{
    "id": "J1BmYbyJGLM",
    "title": "Transforming McLovin's Gaming PC at Micro Center!",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2023-04-07T22:48:55Z",
    "video_url": "https://www.youtube.com/watch?v=J1BmYbyJGLM",
    "category": "Science & Technology",
    "tags": [
        "Transforming McLovin's Gaming PC",
        "McLovin's gaming pc",
        "mclovin",
        "greg salazar",
        "pc cleaning",
        "micro center duluth",
        "micro",
        "center",
        "micro center atlanta",
        "Micro center shopping spree",
        "micro center prebuilt pc",
        "micro center tour",
        "pc clean",
        "how to clean a pc",
        "micro center pc build",
        "gaming setup transformation",
        "micro center",
        "pc gaming",
        "pc transformation",
        "upgrading a pc",
        "pc upgrade",
        "how to build a pc",
        "pc building",
        "gaming pc transformation",
        "transforming",
        "Transformation",
        "gaming",
        "pc",
        "At"
    ],
    "views": 77356,
    "likes": 4470,
    "comments_count": 367,
    "description": "SPONSORS: Shop VIP-SCDKey OEM Windows 10 Pro keys for $16 and use code 'SKGS' for a 25% discount:   We made a trip out to the Duluth, GA Micro Center to clean and upgrade McLovin's gaming PC! If you haven't met McLovin, he's a channel native, making many appearances in earlier videos. Unfortunately, his PC has become super gross over the last 4 years! Thankfully, Micro Center has us covered! We've around $400 for a shopping spree! What will he choose to upgrade?   Consider supporting us on Patreon!   More Micro Center goodies: New Customer Exclusive - $25 Off ALL Processors:  Check out Micro Centers Custom PC Builder:  Submit your build to Micro Centers Build Showcase:  Stay Updated on Everything Tech on the Micro Center Community:    My studio gear on Amazon: Sony A7C (Primary):  Sony a6600 (Secondary):  Sony a6400 (Webcam):  2x Pixio PX277 Prime 165Hz IPS Monitors:  Neewer LED Lighting Kit:  Audio-Technica AT2035:  Yamaha MG10XU Mixer:  Neewer Microphone Arms:  Arrowzoom Sound-Damping Foam Panels:    Follow me on social media: TWITCH:  FACEBOOK:  TWITTER:  INSTAGRAM:    Join our public Discord server:   DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our Rakuten account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.  #MicroCenter #GamingPC",
    "description_links": [
        "https://bit.ly/Win10SKGS",
        "https://www.patreon.com/gregsalazar",
        "https://micro.center/pt2",
        "https://micro.center/y0d",
        "https://micro.center/0ss",
        "https://micro.center/a4w",
        "https://geni.us/lOeoIA9",
        "https://geni.us/k8VBToq",
        "https://geni.us/24nqw",
        "https://geni.us/bCg4nD",
        "http://geni.us/9VTXr0",
        "http://geni.us/xvQc",
        "http://geni.us/d4VvGM",
        "http://geni.us/1w5Sx2Y",
        "http://geni.us/EKFxZc",
        "http://www.twitch.tv/GregSalazar",
        "http://www.facebook.com/GregSalazarYT",
        "http://www.twitter.com/GregSalazarYT",
        "http://www.instagram.com/GregSalazarYT",
        "https://discord.gg/jYA9Xvp"
    ],
    "transcript": "We're out here at Micro Center. We have a viewer's PC. It's mine. This was in your house, dude. Yeah. This is a black case and it looks yellow. Greg built this for me in 2011. I mostly use it for Facebook. We're going to try to clean this up and maybe sort it. We don't want to breathe this stuff in. We're going to clean it as best we can with some of the supplies that Micro Center sells here. They have a pretty decent selection of cleaning gear for computers and other electronics. We'll do them a favor and take it outside when we do that. How long has it been since you've cleaned this? How long ago did we build it? Years. Then we'll bring it back in and maybe revamp it. I think we've got like $300 or $400 to upgrade something. Do you have any idea what you want to upgrade? RGB fans. We'll figure it out. I think I know what he's going to say. From our family to yours. Stay with us. To get rid of that annoying Windows activation watermark, head on over to VIP SCD Key. Purchase a Windows 10 Pro OEM key for a fraction of the price of retail. Just use a secure payment method like PayPal, enter your product key into your PC settings window, and say bye-bye to the watermark. And be sure to use our offer code SKGS for a sweet discount. We need to find the cleaning stuff. Jacob, do you know where that is? You probably don't because you've never cleaned your rig in your life. Let me introduce you to some things. These are dusters. You use this to clean dust. I typically have my wife do that. Heather would appreciate it if you pitched in, especially for your rig. This is an electric duster. It just blows a bunch of air. You're probably going to need something like that to get all this crap up. It is pretty windy today, Greg. We can start off with a basic can of air. I think that's going to be fine. You're going to need one of those. I'll take that. Maybe you'll need two. Just take another. Greg, help me pick some duster blow-off valve spray cans. We're also going to be using microfiber. Cloths. Cloths. Some isopropyl alcohol. For isopropyl alcohol. No, we need isopropyl alcohol. We need isopropyl alcohol. Here, just take some of these. We'll take this for a screen and a light. I don't know what that is, but your rig could probably need it. You know what? I think we need the jumbo. It's so committed that I'm paying with this. You're actually going to pay? I am. That's how serious he is. See that? This is pretty... I've got the caution tape that this entire place is a biohazard. No, you need your hazmat suit before you enter. Jacob, it's not safe. Please. That's not... I thought it would be... That's not how it works. I thought it would be enough. Okay, so we're going to take this outside, because we don't want to be rude to the Micro Center folks, and destroy their habitat. So, Jacob, without further ado, you can grab it. I'm not touching that thing with a 10-foot pole. I can't believe you let your rig get this bad, dude. This is embarrassing. Will's going to want some close-ups of this action, because it's about to get freaking gross. Let me just do you a favor, and don't blow in my direction, por favor. All right, have at it, Jacob. Dude, that is so gross. Just be careful. Don't let the fans overspin. Be really careful with those. You see how you can still see that? Yeah. So that shows you that you've got grime that's not coming up just from air alone. That's why we got the rags, because, yeah, you've got some actual staining going on here. You're seeing it here first, Salazar family. Yeah, it's freaking gross. Oh, yeah, get all up in there, like wiping a baby's bum, Jacob. You like that? Mm-hmm, get all up in there. We're really trying here, folks. This is like a quick and dirty PCDC clip. What can we do in five minutes to transform this rig visually? We've actually made quite a big difference already. But see, Jacob, aren't you glad we got the wipes, too? Oh, yeah. I couldn't see us not using these wipes. You're being sarcastic, but I know you see the benefit in these. I have to clean the stuff that you're cleaning, dude. Like, you've got to do a better job than this. Oh, my. So this rig is definitely not deep cleaned, but it's cleaned enough. Light work. I think we spent five minutes on it. I think it looks a lot better. I think at this point, Jacob, we're ready to take care of an upgrade or something. What do you want? We got maybe around $400. We're going to throw in this? Graphics card. I had a feeling you were going to say that. Graphics card. $400 for a graphics card. $400 would get you RTX 3060, maybe RTX 3070. Yeah, we want a TI. I don't know if that's going to work. A few moments later. Unfortunately, you said you wanted 3060 TIs? Well, I wanted a 4090, but apparently that's not in the budget. That's not in the budget. There's no way. Even a 3060 TI here, the graphics card market is still kind of, especially in the new market. These are still around $450. That's over budget. That's a no-go. So unless you're willing to go AMD, which it sounds like you're not, which, I mean, that doesn't make any sense to me because you have an AMD CPU. You're wholeheartedly against AMD graphics cards. Twelve seconds later. The guys at Micro Center convinced Jacob to at least entertain the idea of an AMD graphics card. Again, he has an AMD CPU, so why does he care? I don't know. You don't want an Intel. That actually looks really good. Double it and give it to the next person. That's a 6750 XT. The guys at Micro Center told us it's $399. That is the perfect tippy top of that budget, and this is about as good a value as you're going to get. I don't know. My 1070 TI is pretty nice. That looks good. This is actually a lot bigger than I was expecting. I know you're not fully convinced, but I promise you, this is probably the best you could have done. For $400 in the store. Are you sure you're doing all right? What is up with this? I don't know why ASRock does this. It's just that, yeah, you've got to add a little bit of complexity to it. I don't know if this card is going to fit vertically. Yeah, you've got to go straight up. There you go. That's better. Just like that. I don't want to see what the back of this is. Actually, it's pretty clean. Would you look at that? You've got some Cheeto powder right there, but other than that, not too bad on the back plate. Yeah, you almost got it. Further to the back. There you go. Slot it all the way in, straight down. Nice. That actually looks sick. Look at that. It looks the exact same. It does almost look exactly the same. I told you, it looked like a gigabyte card. This ASRock SKU looks almost identical to some older gigabyte stuff. Anyway, you've got some plastic peel over these fans. I thought I did. Yeah, these little plastic bits here. Bye. So you're going to display driver uninstall what you already have, because you previously had NVIDIA graphics, and then you're going to reinstall. You could probably use just like AMD AutoDetect to get this to work. Yeah, of course. It's helping me a lot, because I don't know what I'm doing. This looks the exact same. Dude, you got ripped. I know. This is like the same card. I knew we should have gone with the 4090. Okay, anyway. With the external core. You're going to see a clear difference in performance. You will. You pay Apex all the time, right? Yes. You're going to see a huge difference. You're going to get driver installed, and it will be night and day. I assure you. You saw it here first at Salazar Studio Family. Like Olive Garden when you're here, you're family. Normally, at this point, we would turn the rig on just to make sure it works, but I really don't care to for him. Like why? We're just going to take it home as is. There is the question of what we're going to do with the other card, though. Double it. Oh, yeah. That's a good point. We should double it and give it to the next person. I think we should just get rid of my rig and start over. So what do you want to do with this? I think the next child under the age of four will be gifted this. So when they start college, it'll be a relic. Under the age of four? Under the age of 14? Sure. Sure. Sure. We got to go find a 14-year-old or under. That sounds really odd. Anyway, we're going to go find a kid. Will's looking at me oddly. Will's like, you're going to get canceled. So, yeah, we're going to find a kid to give this to. I think Jacob actually thought of it on his own and says, eh, why not? It'll be cool to end the video that way. So, Jacob, it's up to you. You're the one giving it away. Let's go find somebody. It says 1070 right here. Dude. I don't even know what's in my rig. Okay, we thought it was a 1080. I took your word for it, and that's where I screwed up. So it actually is a 1070, so that makes this even weaker. You're definitely going to see a difference now. Can you not wipe the cheese powder everywhere? We just want to make sure that this card is not, like, worse than yours. Because if it is, you don't want it. It's a bit old, but it's still good. It's still good. What is it? I don't remember. That's a 1070. This is a 1070. That's a 1070. Oh, it's better than my card? Yeah. What do you have? You have a 1050? A 1650 Super. He's got a 1650 Super. I don't know what that equates to. A 1060. Oh. Yeah, it's basically almost a 1060. That's a slight upgrade. It's not a huge upgrade. It's a slight one. Still an upgrade. Yeah, it is still an upgrade. What are you looking at me for? I don't know. Yeah. Greg Salazar. Yeah. It's the dude I was telling you about in the car from Florida. Here, well, instead of that, because this isn't like, we want to give it to somebody who needs, like, a really big upgrade. Here's a $100 gift card. How about that? Oh, thank you. Somebody come take my graphics card. Nobody wants your card. Dude, I can't believe, like, 1070s are that old now. They were such tried and true cards for so long. If your subscribers remember when I was skinny, that's when we installed this. Yes, those cards were great, even used for, like, 200 bucks back in the day. But now they're, like, what, under $100 sometimes on eBay? Hey, man, do you mind if I ask you a question? Sure. Yeah, what kind of graphics card do you have in your rig? Do you have a graphics card? Yeah, I have a 3900. Oh, you have a 3090? Oh, okay, gotcha. Yeah, it's way better than that, Jacob. Sorry, he's not going to want it. We have been upgrading graphics cards, so I have this one left over, and we're trying to give it away. It's something to start with, and it's going to be equivalent to a 3050-ish. But it's free, so there's that aspect of it. Free is a good price. Free is a pretty good price. Yeah, no strings. You just take it. We're just trying to get rid of it. I like that the Greg is, like, the Dollar General Mr. Beast. There you go. I appreciate it, yeah. But, I mean, these guys know what they're doing. I don't. I need it as I go. Yeah, this is what I do. 50% of the time. So, yeah. Yeah. Yeah, no problem. It works. Great. Yeah, no worries. No, it's his card. No, it's his. No, it's not a problem at all. Yeah, no. So, you know, it's yours. You can do whatever you want with it, honestly. Yeah, I mean, you can sell it. Yeah, if we don't get it. It's up to you. Yeah, I mean. But, hopefully, it'll get you started. Maybe get you more into, like, looking at building your own someday or, you know, swapping stuff out. It's fun. It gets addicting with time. Yeah. So, yeah. No worries. Okay, so that wraps it up from the Micro Center in Duluth. From our family to yours, thank you for watching. Subscribe and like if you like what you see. That's it. That's it. Just end it. It's good. It's good. Thanks for watching. Now you can see how cringe our videos are. Dude, that's.",
    "transcript_keywords": [
        "Yeah",
        "Micro Center",
        "card",
        "Graphics card",
        "Jacob",
        "Graphics",
        "rig",
        "good",
        "Micro",
        "Center",
        "AMD",
        "dude",
        "upgrade",
        "AMD graphics cards",
        "AMD graphics",
        "Greg",
        "cards",
        "pretty",
        "AMD CPU",
        "family"
    ],
    "transcript_entity_values": [
        "first",
        "3050-ish",
        "Facebook",
        "6750",
        "around $400",
        "1080",
        "XT",
        "2011",
        "the day",
        "3090",
        "50%",
        "ASRock",
        "por",
        "400",
        "PCDC",
        "PayPal",
        "VIP SCD Key",
        "two",
        "Apex",
        "four",
        "the Micro Center",
        "4090",
        "AMD",
        "Beast",
        "CPU",
        "AutoDetect",
        "3900",
        "Duluth",
        "Heather",
        "1070s",
        "Florida",
        "100",
        "today",
        "RGB",
        "1070",
        "399",
        "Salazar",
        "Micro Center",
        "A few moments later",
        "10-foot",
        "eBay",
        "14-year-old",
        "Salazar Studio Family",
        "1650",
        "Intel",
        "Cheeto",
        "Greg",
        "1050",
        "3070",
        "1060",
        "3060",
        "300",
        "Jacob",
        "five minutes",
        "AMD",
        "Olive Garden",
        "CPU",
        "Greg Salazar",
        "Twelve seconds later",
        "around $450",
        "200 bucks",
        "10",
        "NVIDIA"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "PERSON",
        "DATE",
        "GPE",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "TIME",
        "QUANTITY",
        "ORG",
        "DATE",
        "FAC",
        "CARDINAL",
        "ORG",
        "NORP",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "TIME",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "TIME",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG"
    ]
}