{
    "id": "J5AFoS5KXrc",
    "title": "Galaxy A50 Teardown! - Did something crack inside?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-08-09T10:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=J5AFoS5KXrc",
    "category": "Howto & Style",
    "tags": [
        "Galaxy A50",
        "A50",
        "Samsung A50",
        "Budget phone",
        "best budget smartphone",
        "mobile phone",
        "Android",
        "A series",
        "Best samsung phone",
        "iPhone",
        "Apple",
        "new iphone",
        "A 50",
        "Colorful phone"
    ],
    "views": 1987337,
    "likes": 59209,
    "comments_count": 4287,
    "description": "Samsung has arrived at the intersection of Price and Power with the A50. Today we are going to take apart the Galaxy A50, to see what is under the plastic and how it is put together. Its time to review the Samsung Galaxy A50 from inside. Do you like the super colorful smartphones? or would you rather have a more conservative 'normal' colored smartphone? The A50 Durability test is HERE:   Current pricing on the Galaxy A50 is HERE:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/PLRhzJ-jlKI",
        "https://amzn.to/2YE9bbQ",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "I'd like to thank everyone who's back again to check on our colorful chameleon buddy. He's doing great, thanks for asking. Today we're going to perform an autopsy on Samsung's budget phone the Galaxy A50. Maybe we'll see what snapped inside during the durability test. And maybe we'll see what makes this phone so inexpensive once we get all up inside. Let's get started. [Intro] With no visible screws holding this kaleidoscope together, we're going to jump into the tried and true method of heating up the back panel to pull it off. Being a cold blooded reptile, I'm sure the chameleon is going to love the heat. You can see the colors start to warp a bit with my heat gun. I'll stick a suction cup on the back and lift up while prying between the frame and the plastic with my razor blade. Once again, making this the trippiest cellphone teardown yet with how flexi the back panel is. No complaints here. Turns out though that direct heat starts fracturing the colored part underneath the panel. This makes our reptilian friend look much older than he actually is. Fun fact: some chameleons can live to be 10 years old. The nice thing about having a plastic back on a cell phone is that we don't need to worry about the panel shattering into little glass shards. This thing is as flexi as they can get. And I can basically just peel it right off. The A50 has one of the most fool-proof designs we've come across this year. Making plastic phone panels this colorful is a real game changer. The A50 isn't the same old boring single colored plastic panel that we're used to seeing on budget phones. This is next level. Flagship imitation type stuff. And it's surprisingly simple. [Scratching sounds] Taking my razor blade to the back we can see that the color layer scrapes off just like what we would see on a glass panel. The main structure is a clear acrylic and then the color is added to the underside. Manufacturing a clear plastic phone is a real possibility. The only problem with making a clear phone after the fact is since my razor blade is a Mohs 5 and the plastic is a Mohs 3, the panel would be totally obliterated with deeper grooves by the time I was done scraping off all the color. Would you ever buy a clear phone or do you prefer the more colorful psychedelic backs? Or are you the type of person that just wants a single solid color? Let me know down in the comments. Let's see what else this phone has to offer. There are 13 normal Philips head screws holding down the back plastic panel. And you would think at this point with all the screws removed that the back panel would just come off, but nope, it's trickier than that. The back internal plastics are connected with the sides of the phone in one solid piece that very snugly hugs the device. The sides of this plastic layer popping away from the screen is probably the snap we heard during the durability test, since we haven't seen any broken screw holes or any internal cracks to far. Finally, since I definitely remembered to take out the SIM card tray at the beginning, the back and side plastics lift off from the screen, revealing the fairly exposed loudspeaker and the metal side button bracket that rests inside the plastic edge of the phone. Now let's take a look at the phone guts. I'll unplug the battery connector, it just unsnaps like a little Lego. And then I can move over to the long extension ribbons which also unplug like little Legos. Both of which have little arrows pointed up towards the main board just in case we get lost while we're in here. Down at the bottom we have two little screws holding in the optical fingerprint scanner. This is one of those good types of sensors with a lens on it. The sensor we saw inside of the Nokia 9 was one of the slower first generation under screen scanners that didn't have a lens, and they just aren't as quick without it. The charging port board is down here as well glued into the backside of the screen. It has a water damage indicator on the back, along with a USB-C and a headphone jack. Samsung has always been Team Headphone Jack since the beginning. Well...they were Team Headphone Jack...I'm not quite ready to talk about it yet. The main board was pretty difficult to find without, you know, the arrows, but I managed. It has a black Phillips head screw holding down the bottom right corner. Then I can unclip this center selfie camera, 25 megapixels. And then the main board can come away from the phone. There are no heat pipes but we do have 3 different cameras. A top 5 megapixel depth sensor, then the 25 megapixel main camera, and an 8 megapixel ultra wide. None of which have optical image stabilization. But hey, the phone is less than $300 brand new, so we can cut Samsung some slack. One thing we can't cut Samsung slack for though is what's underneath this battery. Or better, what's not under the battery. Samsung has once again left off the battery pull tabs, making safe battery replacements near impossible. It's pretty ridiculous. Not only can the user not replace their own battery, but recycling the phone at the end of it's life is also much more difficult. I mean, look at all this gunk. Battery pull tabs cost literal pennies, and Samsung has to go at this gooey spider web. I have to say it though, if you're currently trying to decide between two different phones, buy the phone with a replaceable battery and skip this A50. The way this battery is now bulging is very unsafe and we all know what happens when batteries get bent or punctured. I'll drop the main board back into place with it's red wire cable. And I can get the top camera set into it's slot, and the bottom fingerprint scanner put down inside it's little hole. Don't get me wrong, I think the A50 is a great durable phone. But permanent battery adhesive is completely unnecessary when safe alternatives exist that are basically the same price. I'll get the long extension ribbons clipped in mostly just to help us remember which side of the phone is up. And the compromised battery gets plugged in last before the plastics get set down. The internal plastics include the side volume and power buttons, so they're pretty important. You can hear the same loud cracking noise we heard during the bend test. And would you look at that the phone still turns on. I like what Samsung is doing. A cheap powerful phone for the masses that still looks really good. And if Samsung skipped the permanent adhesive underneath the battery, it would be an A+, 10 out of 10, 5 star creation. But that permanent battery adhesive is holding it back. Either way, hit that subscribe button if you haven't already. We have the Galaxy Note 10 coming up soon. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "phone",
        "back",
        "battery",
        "Samsung",
        "plastic",
        "panel",
        "plastic phone panels",
        "back panel",
        "back plastic panel",
        "plastic phone",
        "plastic panel",
        "clear plastic phone",
        "Making plastic phone",
        "Samsung budget phone",
        "Team Headphone Jack",
        "main",
        "plastics",
        "headphone jack",
        "clear phone",
        "main board"
    ],
    "transcript_entity_values": [
        "25 megapixels",
        "8 megapixel",
        "Team Headphone Jack",
        "Lego",
        "25 megapixel",
        "Instagram",
        "two",
        "Philips",
        "Phillips",
        "SIM",
        "10",
        "the Galaxy A50",
        "less than $300",
        "this year",
        "5 megapixel",
        "5",
        "first",
        "Samsung",
        "Today",
        "10 years old",
        "3",
        "One",
        "13",
        "Nokia",
        "one",
        "Twitter"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "MONEY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}