{
    "id": "j7IG8eVWy4I",
    "title": "Upgrade your PS5! FINALLY!",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-07-31T03:15:02Z",
    "video_url": "https://www.youtube.com/watch?v=j7IG8eVWy4I",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "sONY",
        "Playstation 5",
        "PS5",
        "software update",
        "upgrade",
        "M.2",
        "SSD",
        "storage",
        "install",
        "replace",
        "support",
        "PS5 SSD",
        "PS5 M.2 SSD",
        "upgrade PS5 storage",
        "get more PS5 storage"
    ],
    "views": 509433,
    "likes": 32011,
    "comments_count": 1159,
    "description": "Get 1-month of Flowcode Pro FREE today with code \"techlinked\" or by going to:    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:  ---------------------------------------------------  Timestamps:  0:00 'preciate u 0:06 RX 6600 XT announced 0:52 Valve lawsuit, other antitrust things 2:12 Russian space station crisis 3:00 Flowcode 3:46 QUICK BITS 3:50 PS5 update, M.2 SSD support! 4:27 More PS exclusives coming to PC 4:53 Huawei P50 Pro 5:32 Twitter algorithmic bias bounty 5:58 vibrating shoes help sight-impaired  AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/FlowcodePro",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/wLRbJ",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- You didn't have to click this video, but you did. And so on behalf of tech news everywhere, I wanna say thank you. And that we're not quite sure whether we should thank AMD for the Radeon RX 6600 XT that they just announced at the China Joy Tech Expo because while the card itself looks like it might indeed be a 1080p beasts as AMD puts it with 32 compute units and a gaming clock speed of almost 2.4 gigahertz, it's not likely to make any kind of significant impact on the industry as a whole. Despite some hopeful developments in the ongoing chip shortage saga, most analysts are predicting that we will still be stuck in this demented hell scape of price gouging and empty shelves for some time to come. Linus dove deeper into this issue in today's Linus Tech Tips video though. So if you're looking for a real dose of reality, watch that. - [Voice Off Camera] That Linus Guy. - Or you could try insulting strangers on the street. The word of the year, by the way, is antitrust. With big tech facing an increasing assault of lawsuits and investigations. But although Valve isn't necessarily big tech, they do run Steam, the biggest platform in PC gaming and the company is now filing to dismiss a lawsuit from Wolfire games, alleging anti-competitive behavior. - [Voice Off Camera] Anti anti. - You see Valve doesn't allow developers to sell their game Steam keys on other platforms for lower prices, which Wolfire says isn't fair along with of course the 30% revenue share that Steam takes from game sales. This dispute is similar to the fight between Epic and Apple and Google, which by the way, was just weighed in on by the techno king himself, Elon Musk, who tweeted that, Apple's app store fees are a defacto global tax on the internet. And by the way, Epic is right. Epic CEO, Tim Sweeney, of course agreed. So expect the antitrust-ing to only increase from here, just like the, EU's fines. Amazon just got handed a record $888 million fine by the EU's privacy watchdog for a data breach from back in 2018, which is just ridiculous. I mean, privacy is important, but I would much prefer to see Bill Gates go to space before I die. - [Voice Off Camera] He deserves it. - Doesn't he. And the Russian NACA module that's docked with the international space station began unexpectedly firing its thrusters yesterday, pushing the station out of its normal orientation. ISS light controllers eventually corrected for the mishap by firing the thrusters on the Russian, Svesda module and the progress cargo ship for a while, it looked like things might be about to go Apollo 13. - [Voice Off Camera] (indistinct). - The ruckus caused Boeing to delay the launch of their Starliner, which was supposed to rendezvous with the ISS today. Russia space agency, Russ cosmos said the knockus thrusters fired because of a software glitch and not at all because of a secret to plan to crash the ISS into a major us metropolitan area, as a means of destabilizing the country for invasion. - [Voice Off Camera] Send in black widow. - And now a message from our Riley. - Now it's time for a quick bits, brought to you by flow code, the service taking QR codes to the next level, with enhanced features and custom designs. Why have a boring old gray scale square, when you can include custom colors, logos, and style on your flyers packaging videos, and anything else you can think of, for tailored hands-on support checkout flow code pro a premium solution with advanced analytics on areas that used to be untrackable. Custom branded designs crafted by flow codes in-house designers, flow page mobile optimized landing pages, and much more starting at just 9.95 a month, but you dear techly, viewers can get a free trial. So check it out by scanning the flow code on screen or clicking the link below. - Quoc bots are sugar and gluten free because they're not food. The PlayStation five is getting its first major software update. Finally bringing support for expanded storage, using the consoles N.2 SSV slot. Unfortunately, the process of determining which SSDs are compatible and how exactly to perform the upgrade is a fair bit more complicated than the X-Box series's storage upgrade procedure, which involves plugging in an external card. But I guess that's what you get for buying a PlayStation because you want it to, oh, I don't know, play exclusive games instead of PC games on a box that's X, - [Voice Off Camera] I just liked the way it looks, okay. - In other news, Sony has confirmed that their recent acquisition of Dutch company Nexus is meant to facilitate more PlayStation exclusives getting ported to PC. So there is even less reason than ever to lock yourself into using a fancy box with limited functionality, - [Voice Off Camera] What about that controller? - Except of course, for the great controller, the fact that it's actually kind of affordable and stuff, I'm really not feeling any China joy right now, but that could change. While we just announced their new flagship P 50 pro smartphone with some unusual specs. It's running Harmony S2 which is basically a fork of Android, depending who you ask, but thanks to the US-China trade war, Huawei doesn't have enough chips to use their own Kyron chip set. So the P 50 pro is actually powered by a Qualcomm ADA SOC, but with the 5g functionality disabled because US-based companies aren't allowed to sell their cutting edge tech to Chinese companies. Man, trade wars can be a drag, but hey, at least they produce some fun Frankenstein monster type devices like this one, so worth it? And bug bounties are common practice in the tech world. But Twitter has just announced an algorithmic bias bounty, which will reward researchers with cash prizes for finding errors in the social platforms, machine learning models. Like for example, the one that caused Twitter's automatic image cropping to prefer white faces. Big yikes. It seems a bit weird to ask the public to do this instead of doing the work, but hey, at least they're paying for it. And finally, a Japanese startup named Ashy Rassie has developed a system that would help visually impaired people walk with confidence by giving them navigational cues through special shoes that tickle their toes. This exists at exactly the intersection between cool and weird that I would expect from a Japanese startup. And I don't think this video will continue. Come back on Monday for more because I have a feeling some crazy stuff is going to happen over the weekend. You're going to that party at Nico's. I don't know anyone named Nico either.",
    "transcript_keywords": [
        "Linus Tech Tips",
        "Joy Tech Expo",
        "tech",
        "Tech Tips video",
        "today Linus Tech",
        "China Joy Tech",
        "big tech",
        "flow code",
        "Tech Expo",
        "Linus Tech",
        "flow",
        "Tech Tips",
        "Linus",
        "Steam",
        "China Joy",
        "AMD",
        "Linus Guy",
        "game Steam keys",
        "AMD puts",
        "game Steam"
    ],
    "transcript_entity_values": [
        "Linus Tech Tips",
        "us",
        "yesterday",
        "32",
        "ISS",
        "Kyron",
        "Linus Guy",
        "Svesda",
        "Starliner",
        "Dutch company Nexus",
        "NACA",
        "Ashy Rassie",
        "the weekend",
        "Valve",
        "Riley",
        "US",
        "N.2 SSV",
        "EU",
        "Wolfire",
        "Google",
        "2018",
        "Boeing",
        "the year",
        "almost 2.4 gigahertz",
        "Huawei",
        "Amazon",
        "a record $888 million",
        "Japanese",
        "Epic",
        "30%",
        "Apollo",
        "Twitter",
        "PlayStation five",
        "5",
        "Frankenstein",
        "China",
        "50",
        "AMD",
        "Bill Gates",
        "first",
        "Sony",
        "AMD",
        "Tim Sweeney",
        "Russ cosmos",
        "Chinese",
        "Harmony S2",
        "Elon Musk",
        "Android",
        "Monday",
        "Radeon",
        "Russian",
        "Russia",
        "Wolfire",
        "Linus",
        "Qualcomm ADA SOC",
        "Nico",
        "the China Joy Tech Expo",
        "Steam",
        "PlayStation",
        "Apple",
        "today"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "FAC",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "MONEY",
        "NORP",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "GPE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "NORP",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "NORP",
        "GPE",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE"
    ]
}