{
    "id": "j_OmOhGTC44",
    "title": "Submodule GB01 Game Boy Cart Reader: Lots of Potential!",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2019-06-14T14:35:59Z",
    "video_url": "https://www.youtube.com/watch?v=j_OmOhGTC44",
    "category": "Science & Technology",
    "tags": [
        "Submodule",
        "GB01",
        "cart reader",
        "Game Boy",
        "Game Boy Color",
        "Game Boy Advance",
        "Nintendo",
        "video game",
        "gaming",
        "retro gaming",
        "flashcart",
        "handheld",
        "game",
        "USB-C",
        "review",
        "This Does Not Compute"
    ],
    "views": 24247,
    "likes": 1229,
    "comments_count": 97,
    "description": "Cartridge readers are a common staple among Game Boy enthusiasts. Does a new contender from Submodule have what it takes to stand out?  Submodule GB01:   -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  -----------------------------------------------------------------------------  Music: \"Riverside Drive\" by Night Tempo ( Additional music by Epidemic Sound (",
    "description_links": [
        "https://submodule.co/",
        "https://www.patreon.com/thisdoesnotcompute",
        "https://nighttempo.bandcamp.com).",
        "http://www.epidemicsound.com)."
    ],
    "transcript": "Hey everyone, it's Colin. How's it going? Game cartridge readers have been around for a long time and there are a ton to choose from. A new one came to my attention though that I wanted to talk about. This is the GB01. It's a cartridge reader for Game Boy, Game Boy Color and Game Boy Advance games. It's manufactured by a company called Submodule and they sent me this one to check out. The hardware comes as a bare PCB and it's well made and looks great with this black solder mask. The silk-screened image on the back looks kind of familiar, too. It connects to your computer through USB Type-C and a Type-C to Type-A cable is included in the box. Now you may be thinking \"Oh, big deal. It's just another cart reader\" and from a hardware perspective, yeah, I could agree with that. But what I think sets this product apart is the software used alongside it. With other cart readers I've tried, the software's functional but a bit clunky and unintuitive at times. Submodule's software though is really clean and easy to use. It's available for Windows and Mac, and when you insert a cartridge it immediately reads it and pulls up details about it from a database including the boxart. Now, I don't have the biggest Gameboy game collection, but of all the carts, I tried they were recognized and in the event you have a more esoteric game that isn't, Submodule will add it to their database for you. Of course, it can also read and write game saves so you can back them up or edit them and another feature that caught my attention was some extra support for the Game Boy Camera. The software can download the pictures as individual files and it automatically converts them to PNG format for easy sharing. So far so good right? Well, there are two drawbacks I've found with the GB01. The first is, you know those features I just talked about? Yeah, that's all of them. At the time I'm filming this it doesn't support things like writing to, or erasing flash carts and that's kind of a big deal because that's what I think the majority of cart reader owners are looking to do. Now, with that in mind, Submodule says that's a feature it'll be adding in a software update and the company seems eager to get suggestions for other features to add. One that comes to mind for me is integrated ROM hack patching. The other drawback is simply the price. The GB01 goes for 45 or about $50 US. That's on the high end as far as cartridge interfaces go especially since that doesn't include shipping. Submodule is based in the Netherlands So if you're located in Europe, postage should be reasonable, but to send one to the US cost 20 bucks. So, here's my take on all this. If you have a big collection of Game Boy games that you want to backup, there's value in the ease of use and convenience that the GB01 offers. If you instead already have a cart reader and you want a better one or you're looking to work with flash carts, at the time this video was published, it's probably not right for you. But of all the cart readers and software I've seen, the GB01 is the most polished and shows a lot of potential. So even if it doesn't do what you need now, as its feature list grows, it's probably still worth keeping an eye on. Anyway, thank you to Submodule for sending one of these my way to review and of course, I'll include a link if you want to check it out If you liked the video, I'd appreciate a thumbs up and be sure to subscribe You can follow me on Twitter and Instagram @ThisDoesNotComp and as always, thanks for watching.",
    "transcript_keywords": [
        "Game Boy",
        "Game Boy games",
        "Game",
        "Game Boy Color",
        "Game Boy Advance",
        "Boy Advance games",
        "Game Boy Camera",
        "Submodule",
        "Boy",
        "cart reader",
        "Colin",
        "software",
        "cart",
        "Game cartridge readers",
        "Boy games",
        "reader",
        "Boy Color",
        "Boy Advance",
        "Advance games",
        "cartridge"
    ],
    "transcript_entity_values": [
        "Windows and Mac",
        "two",
        "Instagram",
        "45",
        "Europe",
        "20 bucks",
        "PCB",
        "Submodule",
        "US",
        "first",
        "Submodule",
        "Game Boy",
        "one",
        "USB Type-C",
        "One",
        "Colin",
        "Netherlands",
        "a ton",
        "the Game Boy Camera",
        "Gameboy",
        "Twitter",
        "about $50 US"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "LOC",
        "MONEY",
        "ORG",
        "PERSON",
        "GPE",
        "ORDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "GPE",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "MONEY"
    ]
}