{
    "id": "ja69acz8m-c",
    "title": "Discord cheats on Playstation...",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-07-21T01:14:32Z",
    "video_url": "https://www.youtube.com/watch?v=ja69acz8m-c",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Discord",
        "Xbox",
        "Discord voice chat",
        "Discord xbox",
        "discord integration",
        "xbox voice chat",
        "Playstation 5",
        "Discord PS5",
        "Microsoft",
        "Xbox Series X",
        "Xbox Series S",
        "Xbox One",
        "console",
        "Discord console"
    ],
    "views": 511407,
    "likes": 29496,
    "comments_count": 768,
    "description": "Save 10% on XSplit's video tools at    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 you're untrained 0:09 Discord voice chat on Xbox 1:15 Switch, Steam Deck heat warnings 2:11 Synchron BCI beats Neuralink 3:11 XSplit  3:45 QUICK BITS 3:51 Alienware 480Hz laptops 4:23 Google Wallet launches 4:48 DALL-E 2 beta expands 5:17 Microsoft makes their own Facebook 5:44 Optical drive class action settlement  FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://lmg.gg/xsplit",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/YdKQX",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "(dramatic music) - When dealing with live tech news, remember always wear protective equipment. We don't, but we're professionals. - [Man Off Camera] We're raw dogging life, baby. - It's dangerous. Microsoft has announced that Xbox series X/S and Xbox One consoles now support voice chat integration with Discord after the tech giant failed to acquire the popular chat platform back in 2021. It was a swing and a miss. They had a big net. It doesn't always work. There are some caveats though. Discord voice chat is only available to Xbox insiders. So you'll have to be okay with installing early versions of software, which, so far, require you to go through a complicated first time setup involving multiple discord session handoffs between your phone and console. Things probably would've been smoother if Microsoft's acquisition went through, but what, should we just let them buy anything if it'll run better? - [Man Off Camera] It just keeps all the lame people off. - The announcement makes Xboxes the first consoles to support direct voice chat integration with Discord, even though they announced a partnership with Sony last year, right after turning down Microsoft's offer and said there would be some kind of PlayStation integration in early 2022. I'd be mad, but Sony keeps making awesome exclusive games and bringing them to PC. So if that's what they wanna focus on, I'm fine with that. I also don't have a PS five, so I- Speaking of consoles, you might wanna check that yours isn't melting as summer heat waves batter parts of the globe. Nintendo and Valve have both issued warnings to owners of these Switch and Steam Deck, respectively, to avoid gaming in temperatures over 35 degrees Celsius. Otherwise, you might experience a different kind of steam. - [Man Off Camera] Head steam. - I was thinking of the plastic, but it's very poisonous. The warnings are appropriate given that it's been over 35 degrees in Tokyo for five days straight in the country's worst heat wave ever documented. While record breaking temperatures also afflict the EU and UK causing Google and Oracle servers to overheat and two British airports to shut down because their runways are fricking melting. While there isn't anything you can do immediately to stop the heat, other than recycling your soda cans, of course. It'll help. You could also pull a Linus Tech Tips and slap a heat sink on the back of your Switch or Steam Deck. - [Man Off Camera] Or grandma. - Or anyone. And Elon Musk has experienced another setback completely unrelated to Twitter. Thank God, 'cause I'm tired of talking about that. Synchron has become the first company to implant a brain computer interface into a US patient beating Musk's competing company Neurolink to the punch. Synchron's Stentrode system involves implanting a wire lace in the patient's brain by pushing it up through a blood vessel, meaning no invasive surgery is required unlike existing prototypes, where research participants have a big doohickey sticking outta their head. Have you ever seen those, James. - [Man Off Camera] Neurolink's is actually called the stent chode. - Synchron has already implanted Stentrodes in four Australian patients, but received FDA approval to do the same in the us back in July 2021. Meanwhile Neurolink hasn't even begun human trials, which is, which is probably good. - [Man Off Camera] Were they monkeying around? - (fake laughs) Honestly, this is probably good. I think it's okay to take it slow with the whole cyborgification thing. We have a lot of problems to deal with already before we add in that, you know. Let's figure things out. Now, it's time for quick bits brought to you by XSplit the trusted live streaming and recording software for gaming, presentations, live events, hot dog competitions, regular dog competitions, you name it. XSplit's got it all, broadcaster, the all-in-one streaming and recording solution, connect webcam, which lets you use your phone as a webcam, presenter for adding personality flare and interactivity to your stream, capture which lets you annotate and add voice over to shareable images and video clips and V Cam, a virtual background tool. Get everything you need to make awesome streams and use code LINUS at the link below to save 10% today. Have you ever seen quick bits that are going by this quickly? Ludicrously high refresh rates are making their way from desktop monitors to gaming laptops. Alienware just announced new notebooks with 1080p panels that can reach a blistering 480 Hertz. - [Man Off Camera] You don't need that. - You, you do not. Thank you James. It's an optional $300 upgrade for the AMD-powered m17 R5 or the Intel powered X17 R2 which might be as hard to justify as those model names. What do they mean? Did they just pick letters and numbers out of a hat? M 15 R 8. - [Man Off Camera] That one's next year's - After killing Google Wallet and replacing it with Google Pay, Google is releasing a new Google Wallet to replace Google Pay. - [Man Off Camera] Yay. - In addition to credit, debit and membership cards, Wallet adds support for transit and event tickets, boarding passes, vaccination records, virtual car keys and student IDs. Look for the update now and look for another update in a couple years, reversing everything again. What do you wanna use the same app forever? Time for you to switch it up? DALL-E 2, the text to image generator developed by open AI and the source of manifold internet memes, will be made available to a million people currently on the wait list in the coming weeks. Those lucky few will be able to generate 50 free images in the first month and 15 every following month. This is great, but also entirely unfair. So only a select few will have ultimate meme power. This is meme elitism. Sign my petition to add a right to meme in the constitution and put open AI in jail. Microsoft has announced Viva Engage, a new social platform inside its Team chat app that looks almost exactly like Facebook. There's a newsfeed with text, image and video posts and personal profiles that are like, look, look at that. That's Facebook. I don't think Microsoft understands that Facebook's growth is declining because people don't like Facebook. They're like the people who pick up litter and bring it back to you. You dropped this. You didn't mean to, I'm sure. And listen up Canadians who may have bought an optical disc drive between 2004 and 2010, you could get 20 bucks without a proof of purchase. Thanks to a $29.7 million settlement in a class action lawsuit brought against large electronic manufacturers like Sony, Phillips, Panasonic, BenQ and more. The companies were accused of price fixing on optical drives, so the least they could do is give you some money for some double doubles and dim bits. - [Man Off Camera] See you there. - I never understand why these are a thing. And the least we could do is tell you to come back on Friday for more tech news. Because again, we are the only people qualified to handle it. We go through rigorous training here that- - [Man's Voice] Heads up. - See, I wouldn't have been able to (screams).",
    "transcript_keywords": [
        "wear protective equipment",
        "remember always wear",
        "protective equipment",
        "wear protective",
        "Google",
        "voice chat integration",
        "Google Wallet",
        "Microsoft",
        "voice chat",
        "Google Pay",
        "Discord voice chat",
        "Steam Deck",
        "chat",
        "Discord",
        "Steam",
        "Facebook",
        "Xbox",
        "back",
        "tech",
        "people"
    ],
    "transcript_entity_values": [
        "R5",
        "20 bucks",
        "last year",
        "five days",
        "Tokyo",
        "US",
        "EU",
        "a Linus Tech Tips",
        "July 2021",
        "Google",
        "2021",
        "Google Pay",
        "the coming weeks",
        "Twitter",
        "Friday",
        "35 degrees",
        "50",
        "Australian",
        "$29.7 million",
        "UK",
        "300",
        "35 degrees Celsius",
        "PlayStation",
        "480",
        "today",
        "FDA",
        "Musk",
        "next year's",
        "15",
        "Hertz",
        "Facebook",
        "15 every following month",
        "PS",
        "Switch and Steam Deck",
        "Xboxes",
        "Google Wallet",
        "a million",
        "early 2022",
        "Discord",
        "Google Wallet",
        "first",
        "Alienware",
        "R2",
        "Sony",
        "webcam",
        "AMD",
        "two",
        "Team",
        "1080p",
        "Elon Musk",
        "British",
        "between 2004 and 2010",
        "Xbox",
        "us",
        "Neurolink",
        "Valve",
        "Nintendo",
        "Microsoft",
        "BenQ",
        "m17",
        "a couple years",
        "10%",
        "LINUS",
        "five",
        "Stentrode",
        "Viva Engage",
        "Synchron",
        "Phillips",
        "the first month",
        "Intel",
        "Canadians",
        "Neurolink",
        "Panasonic",
        "Oracle",
        "AI",
        "summer",
        "Xbox series X/S",
        "Facebook",
        "Switch or Steam Deck",
        "four",
        "James",
        "XSplit"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "MONEY",
        "DATE",
        "DATE",
        "GPE",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "MONEY",
        "GPE",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "NORP",
        "DATE",
        "ORG",
        "GPE",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "NORP",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON"
    ]
}