{
    "id": "jCRNYZ7Ls3o",
    "title": "Apple is afraid of buttons. Why?",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-11-11T03:54:44Z",
    "video_url": "https://www.youtube.com/watch?v=jCRNYZ7Ls3o",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Apple",
        "Epic Games",
        "Yvonne Gonzalez Rogers",
        "Apple stay",
        "iOS",
        "App Store",
        "buttons",
        "links",
        "App store buttons",
        "Apple buttons",
        "injunction",
        "Apple order",
        "denied",
        "lawsuit",
        "court",
        "trial",
        "ruling",
        "appeal"
    ],
    "views": 521269,
    "likes": 33379,
    "comments_count": 1452,
    "description": "Start your build at    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 never leave him 0:05 Apple court request DENIED 1:18 Apple fixes Face ID repair  2:14 Google scares business owners 3:16 Build Redux 3:48 QUICK BITS 3:53 Steam Deck delayed 4:29 YouTube hides dislike count 5:02 Surface Laptop SE 5:37 OnePlus Nord 2 splosions 5:59 NASA blames delay on Blue Origin  AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  They're Just Movies podcast:",
    "description_links": [
        "https://www.buildredux.com/linus",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/hINnX",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/TheyreJustMovies"
    ],
    "transcript": "- (gasps) You came back. I never thought I'd see you again. - [Crew Member] Get it together, James. - Apple, mostly won it's big legal fight with epic games over the iOS app store. But, the judge did order Apple to allow app developers to include buttons or links to third-party payment options by December 9th. It's, we're not there yet. Apple requested a stay on that order, but yesterday, it was denied by judge Yvonne Gonzalez Rogers known in the biz as Gonzo, because she does not care about your feelings. Apple is going to appeal this decision because lawyers need to eat. But also because they claim it's going to take months to figure out how to roll out the change. I mean, I believe it would take Apple months. There apparently have to be guardrails and guidelines to protect children, developers, consumers, and Apple. Wait, what are we talking about? Links? A link to a website in an app? Apple, you don't have to make them. You just have to let the developers add them. Something Apple has already done for reader apps like Netflix, but who knows? Apple is apparently looking into cryptocurrency. So, maybe their engineers are already confused about why something that is so decentralized is so popular. It's like people don't want giant companies controlling what they're allowed to do. So weird. - [Crew Member] How do they decide how to act? - Apple did make sort of a good guy move this week though. It announced an upcoming software update that would allow third party repair shops to replace the iPhone 13 screen without breaking face ID. iFixit pointed out last week that the only way to do this currently is to remove a tiny micro controller from the old screen and solder it on the new screen, which is incredibly difficult and requires special equipment. But, that's because iPhones are special. Why didn't you get this? Meanwhile, at the genius bar, (laughs) they had a simple software tool that will keep face ID working. No problem. - [Crew Member] Even after that. Apple hasn't said when the update will arrive, but if you don't want to wait, you can just sign your small business up for the Apple business essential subscription, which will give you access to signature Apple, brand IT management and onsite repairs. So exciting. A real life Apple genius coming to my office? What do I offer them? Wine? A family heirloom? A kiss? Google cares about small businesses too, which is why they're warning them about a potential legislation that could hurt those small businesses bottom line. Business owners have gotten emails from Google, alerting them to the dangers of the, of the ending platform monopolies act. - [Crew Member] So spooky. A proposed bill that would ban Google and other platforms from favoring their own services. Such a change could make it harder to find your business online, costing you time and money according to Google. Sure, it seems desperate, but big tech companies are under more of a threat from proposed regulation than ever. Like the filter bubble of transparency act, which would force companies like Facebook to provide users with an option to opt out of algorithmic, content feeds. I mean, it's gotta be stronger that IMO. Google themselves just got slapped with a 2.4 billion Euro anti-trust fine over favoring, Google shopping results in search, although they may still appeal that. But until then, they're appealing a different kind of appealing to small businesses. Fear of being buried on page two of the search results. Or, if you're on a phone, scrolling really far. A fate worse than death. Now, it's time for the quick bits, brought to you by Build Redux, the PC builder striving to bring PC gaming to the masses with no price markups. You'll pay the same price for components that you'd pay if you bought them yourself, just with the flat $75 fee to have your PC built by a PC building expert. Probably with huge muscles, and an even huger brain, and twirly mustache, Just select your budget, pick your games that you want to run, and see how they perform right on the website, and let it Redux take care of the rest. All builds, come with a two year warranty. So, click the link in the description and start creating your PC today. Some bits are just too damn long. Let's make them quick. Valve has announced the launch of its highly anticipated steam deck gaming handheld has been delayed two months to February, 2022. I really wanted one for Christmas. Due to of course, the global supply chain issues currently ravaging the Earth like a plague, a pestilence. - [Crew Member] As they do. The fifth horseman, chip shortage. In their blog posts, Valve said they're sorry, which is kind of like apologizing for being late to a meeting because you were attacked by a team of super villains. It's not your fault. - [Crew Member] It happens all the time. - You know? - [Crew Member] It's understandable. - Just make the steam deck good because I need a good portable console to emulate N64 games on. Got 'em. - [Crew Member] Yep, that's a good one. - YouTube is currently rolling out a change that removes the publicly visible dislike counter from all YouTube videos. Including this one in the future. The company says the research showed that this measure reduces the likelihood users will target a video's dislike button to drive up the count or drive down the drive up the dislunk. Which will hopefully ensure no creator ever has to endure a public criticism ever again. Also, creators can still see their own video's dislike counts in the YouTube studio. Quantifying hate will soon be a privilege. You guys better dislike this video while you can still feel like you're part of something rude. Microsoft has announced this surface laptop SE designed specifically for schools and students who will be the only entities actually allowed to buy one. It starts at a cool 250$, has some decent IO and honestly reminds us of those old plastic Mac books. The surface laptop SE will be running windows 11 SE, which is optimized for low end hardware, is easy to set up and manage, and has the Microsoft store disabled. And it also limits window snapping to only two apps at once. Think of it this way kids. It's like holding two phones at once, huh? Why, why would you want three? That's silly. - [Crew Member] Three Tik Toks is too many. - One tic one tok. Reports have been flooding in for weeks now, that the OnePlus Nord 2 is exploding causing damage to clothing and the people wearing the clothing holding the phones. OnePlus says the incidents are isolated cases, but they're collecting details to investigate further because you wouldn't want to initiate a recall until you're super sure it's necessary. Better to let a couple of more pop off first. - [Crew Member] Like uh, me. - You wouldn't though. - [Crew Member] I would. - And NASA has announced it's delaying its moon landing mission from 2024 to 2025. Not because of any technical reason, but because Blue Origin, the rocket company owned by Jeff Bezos sued NASA for giving a contract to SpaceX instead of themselves. And the ensuing litigation took up seven months of NASA's time. Thanks. Thanks. - [Crew Member] Awesome. - Thanks. I'm gonna make a rocket company so I can advance humanity. Oh, wait a second. I'm gonna stifle humanity instead. You-- - [Crew Member] Only if I get to advance. While Blue Origin has lost the suit, they did succeed in annoying everyone involved, but any publicity is good publicity, especially in space where none of us are going now, thank you. This episode has blasted off. So, come back on Friday for more tech news, starring someone else. - [Crew Member] Yeah, not me. - Bye.",
    "transcript_keywords": [
        "Apple",
        "Google",
        "Yvonne Gonzalez Rogers",
        "make",
        "good",
        "judge Yvonne Gonzalez",
        "Apple months",
        "order Apple",
        "Apple business",
        "months",
        "small",
        "business",
        "small businesses",
        "Blue Origin",
        "announced",
        "time",
        "dislike",
        "NASA",
        "app",
        "Apple genius"
    ],
    "transcript_entity_values": [
        "SpaceX",
        "yesterday",
        "weeks",
        "December 9th",
        "Jeff Bezos",
        "IO",
        "three",
        "One",
        "the OnePlus Nord 2",
        "OnePlus",
        "Valve",
        "one",
        "iFixit",
        "seven months",
        "Google",
        "SE",
        "fifth",
        "a second",
        "2024 to 2025",
        "months",
        "last week",
        "13",
        "2.4 billion Euro",
        "11",
        "Blue Origin",
        "Microsoft",
        "Friday",
        "third",
        "Build Redux",
        "first",
        "Netflix",
        "N64",
        "Facebook",
        "two",
        "2022",
        "iPhones",
        "two year",
        "Gonzo",
        "Earth",
        "this week",
        "SE",
        "Mac",
        "only two",
        "NASA",
        "75",
        "Yvonne Gonzalez Rogers",
        "Christmas",
        "James",
        "two months to February,",
        "YouTube",
        "Apple",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "TIME",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "FAC",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "NORP",
        "DATE",
        "PERSON",
        "LOC",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE"
    ]
}