{
    "id": "jdlGvS1y_Ls",
    "title": "A look inside the original Macintosh",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2019-12-09T17:00:11Z",
    "video_url": "https://www.youtube.com/watch?v=jdlGvS1y_Ls",
    "category": "Entertainment",
    "tags": [
        "Marques Brownlee",
        "MKBHD",
        "Vox",
        "Tech",
        "Retro",
        "Retro Tech",
        "Techy",
        "Walkman",
        "Mac",
        "Macintosh",
        "Sega Genesis",
        "Camcorder",
        "Dynatac",
        "Cellphone",
        "Polaroid",
        "Sony",
        "JVC",
        "The Gregory Brothers",
        "Uravgconsumer",
        "Bill Nye",
        "iJustine",
        "Sega",
        "Video Games",
        "Hannibal Burress",
        "Mortal Combat",
        "Mari Takahashi",
        "Smosh Games",
        "Jake Baldino",
        "Gameranx",
        "Casey Neistat",
        "Motorola",
        "Austin Evans",
        "Sara Dietschy",
        "Karlie Kloss",
        "Peter McKinnon"
    ],
    "views": 464074,
    "likes": 12772,
    "comments_count": 523,
    "description": "I meet up with Youtube Creator iJustine at a massive retro tech warehouse in Brooklyn called E-Waste. Inside this tech warehouse, Justine and I open up the original Macintosh and point out a few things that made it so iconic, such as the 128k of internal RAM inside the Macintosh, the 32-bit microprocessor, and the entire design teams signatures molded into the plastic.",
    "description_links": [],
    "transcript": "I didn't even know this place existed. - I'm gonna have my birthday party here. - Yeah. ( music playing ) Marques invited me to this incredible vintage warehouse that has all kinds of old Mac computers. Specifically, the 1984 Mac, which is something that has a very special place in my heart. - Yeah, it's good. - It's so great. They don't make 'em like they used to. Do you wanna open it up? So there are a few screws here. - Should we go for it? - I think we should take it apart. ( muttering ) All right, final screw. - Okay. - Let's lift this off. Do not touch the CRT coil because you might get shocked. Okay, inside is the CRT monitor. - It goes kinda far into the body of it. - Don't touch. - Okay, I'm not gonna touch the CRT coil. - Don't. Mm-mm. - I'll hold the bottom down. - Okay. - Ready? - Yeah, yeah. Moment of truth. Oh, man, look at this. That is the inside of a 1984 Mac. That's the coil. Don't touch the CRT. There are two different boards. There's, to me unrecognizable, mostly power components. And then there's also a board back here at the bottom, which has a lot more soldering. - That's the floppy drive. - The system disk is the floppy disk, so that basically loads it into the RAM. And as soon as you take that disk out, it's gone. You're basically loading things as it goes. And it would be a combination of reading from the memory that it has preloaded things into and that floppy disk. This only had 128K of RAM. What, now it's a thousand times smaller? One front facing selfie on the iPhone, - Yeah? - you couldn't even fit it on here. Like, that's insane. Steve Jobs had created this as a work of art. So, in most art, people sign them. - True. - So, inside of here are autographs - of all the people that worked on this team. - Oh, that's cool. - So you can see them right there. - And they're subtle. All these little inscriptions. That's actually a nice little touch, signing your work. I'm glad we learned all this today. Thank you so much for helping me take apart this Mac and for giving me the breakdown. - Appreciate it. - Thank you so much. This was seriously amazing. Wow.",
    "transcript_keywords": [
        "Yeah",
        "CRT",
        "Mac",
        "place existed",
        "touch the CRT",
        "touch",
        "CRT coil",
        "disk",
        "existed",
        "coil",
        "floppy",
        "inside",
        "RAM",
        "place",
        "floppy disk",
        "Mac computers",
        "birthday party",
        "CRT monitor",
        "art",
        "bottom"
    ],
    "transcript_entity_values": [
        "CRT",
        "today",
        "RAM",
        "1984",
        "Mac",
        "128",
        "Steve Jobs",
        "iPhone",
        "two",
        "a thousand",
        "One",
        "Mac"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ]
}