{
    "id": "Jen6GdfFSF8",
    "title": "iPhone SE (2022) review",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-03-14T13:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=Jen6GdfFSF8",
    "category": "Science & Technology",
    "tags": [
        "iphone se",
        "iphone se 2022",
        "iphone review",
        "iphone se 3",
        "verge",
        "iphone se 2020",
        "iphone se review",
        "apple event",
        "apple",
        "apple watch series 7",
        "the verge",
        "iphone 13 pro max",
        "iphone se camera",
        "iphone se camera test",
        "green iphone",
        "iphone 2022",
        "mac studio review",
        "mac studio display",
        "first look",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "mac studio"
    ],
    "views": 297400,
    "likes": 7201,
    "comments_count": 579,
    "description": "The iPhone SE (2022) includes Apples latest A15 processor, 5G connectivity, and improved battery life over the previous SE model. But its tired design and cramped 4.7-inch display feel like theyre stuck in the past.  Read more here:   Vox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. For more information, see our ethics policy here:   You can get the iPhone SE here:    Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/3tbf8zA",
        "http://bit.ly/2TQsqjB",
        "https://apple.co/3J68srQ",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat music) - It is iPhone time, that is iPhone SE time. Might not be a phone for a lot of people, but there's still a lot to discuss about it. It's the most affordable new iPhone you can get, and it's packed with some really good modern tech inside. But on the outside, well, it's definitely reaching retro territory and not in a good way. It's a physically small phone, which I love, and you can actually fit it into a pocket. For 429, it's also the most affordable phone that Apple makes, even with a $30 increase over the previous model, it's still a really good deal. It has 5G, Apple's latest and greatest processor and a bigger battery. That's all great, but then there's the screen. It's a 4.7 inch LCD bordered by some chunky bezels, you probably haven't seen since 2017. That's because the SE uses the same chassis as the iPhone 8 which was officially retired two years ago. That might not seem like a long time but since then phone screens have gotten bigger. Bezels have gotten smaller, from flagship phones all the way down to $200 budget phones. Apps and webpages are just designed for bigger screens and using them on such a small screen feels cramped. Text is small at default settings but making it larger means a lot of scrolling. Icons are tiny and crammed together. It's an adjustment coming from an edge to edge screen. And even after a few days, I still haven't quite gotten used to it. Bezels aside, the best thing about the SE is how long it will last if you take good care of it, that's kind of the whole point of this phone. Apple supports its phones for five, even six or seven years with software updates after they're launched. Here's my first gen SE from 2016, I just installed iOS 15 on it, and it actually runs pretty well. The phone only works on Wi-Fi because I dropped it in the toilet but that's another story. My point is, if this design feels crowded and tired now it's going to feel really dated in five or six years. And I think that takes some of the appeal of the longevity away. And if you do wanna hang onto this phone for more than a few years, I would highly recommend upgrading to the 128 gigabyte version, which is 50 more bucks. The base model still only includes 64 gigabytes of storage which will fill up fast if you aren't careful. Between the iOS, my usual apps and a few years worth of photos I'm already at 41 gigabytes on my review unit. Unless you're really on top of your cloud storage, or you're a very light photo taker and app user, consider 479 as the starting cost of this phone. (upbeat music) Before we get into who should or shouldn't buy this phone, let's talk updates. The 2022 iPhone SE includes Apple's newest processor the A15 Bionic and that's the same one you'll find in the iPhone 13 series. It makes the phone feel really fast. And honestly, there's not much that the SE can't do compared to a $1,000 phone. That's pretty impressive. Most importantly, the A15 is the key to getting those iOS updates for many years into the future. The SE so gets 5G this year because it's 2022 and every new phone is gonna have it. But unlike a year or two ago, 5G actually kind of means something, and it's good to have it supported here. There's no millimeter wave, which is the super fast, hard to find variety, but that's not really a great loss. You do get low and mid band 5G, including C-Band which is what AT&T and Verizon are using to make their 5G networks actually good. That still might be a few years away for a lot of us personally, I pay for my wireless carriers cheapest unlimited plan, which doesn't include C-Band. So having 5G on my phone right now is sort of pointless. But even if you're not currently on a wireless plan of 5G or the network is still sort of weak where you live, things will probably change over the next few years and the SE will be ready for it. If you live outside the US, you might wanna check with your carrier which 5G bands are and aren't supported. As of right now while we're filming this, I'm still testing those batter life claims, but future Allison's gonna tell you something about it right about now. I'm happy to report that battery life has been improved. It will last through a day of moderate use with plenty left in the tank. And even on a day of heavy usage with some gaming, video recording and lots of screen on time I'm still able to get through a full day without needing to recharge. Back to you past Allison. The A15 also enables some camera updates on the same hardware as before thanks to more sophisticated image processing. There's still just one 12 megapixel rear camera and the same seven megapixel selfie camera as the last SE model, but it gets a few new capabilities that come along with the new processor. There's Apple's fourth gen smart HDR which does a good job handling high contrast scenes. There's also deep fusion to bring out more detail in photos, which is great, if your friends are really into wearing sweaters. Outside of sweater mode, it actually uses some pretty sophisticated processing to make low and medium light images pop a little more. It's kind of cool to see this tech coming to Apple's entry level phone. Photographic styles are also included which is a way to apply different color presets to your images. They're like filters, but better, since they can distinguish different subjects and treat the accordingly, rather than just throwing a cool or warm tone over your whole image. But one thing that's still missing is a dedicated night mode. So photos in very low light look dark and black detail. Plenty of other phones in the mid range and budget categories offer some kind of multi-shot mode for brighter photos and low light. So it's weird that Apple doesn't include it in the SE. It's like a bad throwback to phone photography from several years ago. Aside from that omission, these are all welcome improvements and the SE delivers really good image quality. There's still no ultra wide sensor, there's no telephoto, but those aren't things that everybody cares about. And the main camera is well equipped for day to day snapshots. The iPhone's SE's competitor is probably the Google Pixel 5a, which is another low cost phone that uses lot of software tricks to take better photos. Previous a series pixels only offered one rear camera, but the 5a added in ultra wide. So it does the SE one better there. It does have a night mode, so it's photos in very low light look a lot better than the SEs. It's more of a toss up between mid two in good and medium light. They both a job and neither camera does very well with moving subjects in low light. But I wouldn't really expect them to. The SE shoots up to 4K 60p video and quality is good. The lens is stabilized, which helps keep footage steady. And the new processor means low light video is less noisy than on the previous SE. It's definitely good enough for quick video clips, even though you don't get fancy features like ProRes or cinematic mode. Just like the previous Se, this year's model is a really well built phone, especially considering the price point. It's IP67 rated, so it's water and dust resistant with the aluminum rails and glass on the front and back. And although there's no MagSafe, there's still standard Qi wireless charging. These things are by no means guaranteed in a phone under $500. So the Se continues to stand out in terms of build quality. Touch ID in the not really a button home button are back and in this era of mask wearing, I gotta say, I've missed having the fingerprint sensor rather than face ID. Apple's trying to solve the mask problem in iOS 15 but there's something comforting about that physical fingerprint sensor, it's kind of a throwback like a lot of things on this phone. Even though the design is dated, the SE still delivers some of the best build quality you'll find in a mid-range phone. That's the thing about the SE, you get great hardware, future ready 5G, and many years of software updates for under $500. There's just no other phone sold in the US that gives you that kind of return on your investment. But this screen is a really important consideration, especially if you plan to keep using this phone for five or six years. And I think most people will find it too small to use comfortably in this day and age. You can easily find a phone with a bigger screen that costs less than the iPhone SE. You can get a lot more bells and whistles too, like extra cameras, a battery that lasts for days or a fancy OLED screen with a faster refresh rate. But the one thing you definitely won't get on those phones is iOS. And for a lot of people, green bubbles are a deal breaker. If switching to Android is an option for you. Then the Pixel 5a is a really good alternative. It's $449 with a bigger, better screen an ultra wide camera and more storage. You won't get the same longevity since Google only promises three years of OS and security updates, but it's not bad. Bottom line, the iPhone SE is a powerful little phone and the price is great. If you're sure you wouldn't mind the small screen then it's an excellent deal. But otherwise I think it might be time to let this vintage design fade away. Apple announced a ton of new products last week. We've got a monitor that doesn't cost a million dollars, the new Mac Studio, new iPad and green iPhones of which is great if you're a fan of green and iPhones. So keep it locked to, \"The Verge,\" 'cause we're gonna have reviews of all of them, except probably the green iPhones 'cause they're just iPhones that are green.",
    "transcript_keywords": [
        "phone",
        "years",
        "good",
        "Apple",
        "iPhone",
        "lot",
        "screen",
        "phones",
        "low light",
        "light",
        "low",
        "camera",
        "day",
        "photos",
        "kind",
        "updates",
        "great",
        "bigger",
        "iPhones",
        "small"
    ],
    "transcript_entity_values": [
        "429",
        "the A15 Bionic",
        "five or six years",
        "a few days",
        "SE",
        "Allison",
        "Android",
        "Mac Studio",
        "fourth",
        "one",
        "128 gigabyte",
        "Apple",
        "AT&T",
        "days",
        "Verizon",
        "the next few years",
        "iPhones",
        "a full day",
        "C-Band",
        "Se",
        "The Verge",
        "a year or two ago",
        "more than a few years",
        "this day",
        "many years",
        "Google",
        "2017",
        "US",
        "year",
        "5",
        "64 gigabytes",
        "a few years",
        "479",
        "iOS 15",
        "three years",
        "iPad",
        "several years ago",
        "2016",
        "4.7 inch",
        "six or seven years",
        "41 gigabytes",
        "the iPhone SE",
        "two",
        "a million dollars",
        "449",
        "1,000",
        "4",
        "iOS 15",
        "ProRes",
        "12 megapixel",
        "this year",
        "last week",
        "200",
        "5a",
        "five",
        "a day",
        "SE",
        "first",
        "iPhone",
        "Wi-Fi",
        "30",
        "two years ago",
        "under $500",
        "seven",
        "50 more bucks",
        "iPhone SE",
        "a ton",
        "2022",
        "A15"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "NORP",
        "DATE",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "EVENT",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORG",
        "LOC",
        "MONEY",
        "DATE",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG"
    ]
}