{
    "id": "JeVc6RsHuLI",
    "title": "🇺🇸 4th of July - 2017 vs 2014!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-07-04T17:47:15Z",
    "video_url": "https://www.youtube.com/watch?v=JeVc6RsHuLI",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "july 4th",
        "4th of july",
        "independance day",
        "america",
        "usa",
        "fourth of july",
        "july fourth",
        "cake",
        "how to bake a cake",
        "cake baking"
    ],
    "views": 178200,
    "likes": 5666,
    "comments_count": 756,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(funky music) - Today, we are celebrating the Fourth of July! - Woo! - And we're real festive today for the July Fourth holiday. I think I should have chose some other decorations. Today, we're going to make this cake. It's a five layer cake. We're making some red, white and blue cupcakes. And some surprise cakes. - You didn't tell me anything. You just said, Hey, put on a red shirt. - The whole back of my shirt is missing. Let me show you my spine. - Cover up. - I was like, okay. - America, it's Trump's world. We're just living in it. Okay, first thing's first. We're going to make one of our cakes. (whistling) - If I don't look at it, nothing bad can happen. Da da da da da Y-M-C-A - So, shat we're doing here is we're making a simple cake recipe. - A simple white cake recipe. I'm somewhat about that measuring life. - Do you know how many times I've done this? Enough to know. - Why do I let her do the egg whites? No, I need egg whites, not yellows, shoot. - [Jenna] Perfect, I am a professional. - Good for you, just rub it in. Oh no, a little bit of yellow, oh god. - Ready? Catch. (blender whirring) - [Justine] Do you love America? - [Jenna] Yeah. - This cupcake dispenser thing is probably the coolest thing ever. I bought it so long ago and I never ended up using it. - Mmmm, cake. - Oh God, that's not supposed to happen. (laughing) America America America. Mmmm, it tastes like freedom. - Bake it at 350 until done. - Really? Preheat this oven to 350, which I should have done probably forever ago. Do we put them all on the same rack? - Say rack one more time. Oh my god. The surprise is never going to happen. - I don't have time for that. I'm trying to freaking prepare. Look at them! America. I let them all cool off nicely. So these are our America cakes. - [Jenna] Are you okay? - Okay, now we're gonna let it cool. And then we're gonna decorate. (playful music) - Welcome to America, kids. We're testing our healthcare. - I think it's a nice hole. - Is it good? - You may notice that we are on the floor, yes, but I have wax paper down and it is a freshly cleaned floor. - What is wrong with you? This almost went through your arm. - Oh my God, there's icing everywhere. - I'm just going to lightly dump. - [Jenna] No. - Yeah. So sorry. I don't know how to do anything. Wow, real oily. - This is like basically two colors 'cause it's not mixed well. Wait don't you have to cut that into something else? - No. - Wow, so fluffy. - Oh, is it red or is it pink? - We don't know. - I don't think I want to be associated with this video. - I'm starting at the bottom because I can-- Started from the bottom now we're here That looks stupid. - Alright guys. Now it's time for the super special surprise. This looks nice. - This is way too much icing. I'm not going to have enough icing. We have to just put a little bit because it just has to seal it together. - These are a lot of icing on here. - Oh my God. - Oh my God. - We should shave off this top. I'm just going to shave this off. - Ow, I got my skin! - Surprise. - Surprise! Watch this. - That wasn't the problem. - What was the problem? - Yeah, that's not right. - No, I've only seen better. Martha Stewart is somewhere watching this video, crying. - Alright. - Oh. - Oh my God. - Well that's cool. - The problem here is that we should have shaved a little off the blue. I'm so sick just looking at this cake. It's all going to look perfect when we cut the cake in half. What happened here? - Some things. - Disgusted by everything that is happening. - Oh gosh, why are there turds on there? - Oh! - Oh! - I think they look, oh, I just touched your butt. - Touched my but again! She keeps touching my butt! - Now there's icing on it. It's almost like a real cake. - There's icing on my butt! There's icing in my hair. (upbeat music) Now, the real test is cutting it in half. (upbeat music) - If I stand all the way back here, the cake looks really good. (upbeat music) - Here we go. - It's gonna look just like it did on Pinterest. It's heavy. - Yeah, I know, right? Oh wow, okay, just set it somewhere. - [Jenna] There it is. - I'm so sick of eating cupcakes. - Oh no! - Oh no! Oh no, I just got this. Oh God! - That tastes like a cupcake. I wanted this cake to be perfect. - I thought, I honestly thought we could do this. - I don't like the surprise. - Mmm! - It's really good. - I lost my phone. Surprise. I think I might have baked my phone inside of this. Thank you guys for watching. Huge thank you to Jennifer for helping out with this video. Well guys, thanks for watching. We have to clean up now. I think we might need to hire a hazmat team. Happy Fourth of July. Oh my God, our cake came out perfectly. Zoom in so they think it's ours. Can we just hold it, hold it like this. - Yeah. Hold it right there. - Oh wow! - Guys, it came out perfect! (laughing) - This was actually really difficult. (upbeat music)",
    "transcript_keywords": [
        "July Fourth holiday",
        "god",
        "July Fourth",
        "cake",
        "America",
        "America America America",
        "Fourth of July",
        "America America",
        "Fourth",
        "July",
        "icing",
        "surprise",
        "celebrating the Fourth",
        "Yeah",
        "Wow",
        "Fourth holiday",
        "Today",
        "cakes",
        "Good",
        "America cakes"
    ],
    "transcript_entity_values": [
        "Jennifer",
        "Trump",
        "one",
        "America America America",
        "the July Fourth holiday",
        "Martha Stewart",
        "Justine",
        "Da da da da da Y-M-C-A -",
        "July",
        "Today",
        "half",
        "forever ago",
        "Mmmm",
        "five",
        "Fourth of July",
        "350",
        "Pinterest",
        "today",
        "two",
        "America",
        "first"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "LOC",
        "EVENT",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "NORP",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORDINAL"
    ]
}