{
    "id": "JF8UziDHqZo",
    "title": "Linus let me spend $10,000 on THIS!!! - Pantone Plus Plastic Standard Chips Collection",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-05-01T17:59:13Z",
    "video_url": "https://www.youtube.com/watch?v=JF8UziDHqZo",
    "category": "Science & Technology",
    "tags": [
        "Design",
        "Graphic Artist",
        "Color",
        "Colour",
        "Chips",
        "Pantone",
        "Expensive",
        "Designers",
        "Graphic",
        "Matching",
        "Chip",
        "Plastic",
        "Pricey",
        "Linus",
        "lttstore.com screwdriver",
        "I convinced Linus to spend $10000 on plastic color chips",
        "Why I spent $10000 on plastic chips",
        "I convinced Linus to spend $10000 on plastic"
    ],
    "views": 3362868,
    "likes": 135119,
    "comments_count": 8853,
    "description": "Get $25 off all pairs of Vessi Footwear with offer code shortcircuit at    Linus isn't a FAN of us spending money, but when we need it, he is willing to loosen those purse strings. The Pantone Plus Plastic Standard Chips Collection helps us make products faster since we can see the color in person before making samples, which results in us getting things done quicker, for a price. Maybe we could've got the screwdriver done faster if we had this in the first place...  Check out The Pantone Plus Plastic Standard Chips Collection:   Sign up to get notified when the lttstore.com screwdriver is available for order at   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - We spent $10,000 of Linus' money 0:18 - Unboxing 0:44 - What is Pantone and why it's important 1:33 - Assembly and pricing 2:31 - LTT use case example 3:35 - Here comes the BOSS 7:53 - Criticisms 9:14 - Sponsor - Vessi! 9:49 - How to use their index 11:06 - I still think it's pink 11:46 - LTT Pantone code 11:51 - How to use the Pantone plastic chip 13:26 - Outro",
    "description_links": [
        "https://www.vessi.com/shortcircuit",
        "https://geni.us/lcqG5r",
        "https://lmg.gg/ceKw2",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Five. (Sarah laughing) (Sarah screaming) Oh my God. - Why? - So today's ShortCircuit is a bit of an oddity. It's not a tech product. However, it did cost us a lot of money so we're gonna milk it as much as we can. - [Jono] You good? (Sarah laughing) Oh my God, you're gonna break it. (Sarah laughing) - Oh no. It's this. (Sarah and Jono laughing) I have not had much of a chance to explore these. So this is my first time kind of really checking them out. They have numbers on top and inside, instructions. We have to stack them properly so that they have a beautiful Pantone gradient. Oh, I guess I should mention what these are. (Sarah laughing) The best way for me to describe Pantone is essentially the color from your monitor is not gonna be the exact same as a color that comes out of a printer or comes out of a plastic product. So when we send design files over to our manufacturers, we wanna make sure that the samples that we're receiving are exact with the color that we're expecting. Using these, we can ensure that our colors come out accurate and correct the first time round. Over in Creator Warehouse, we use Pantone chips all the time. I myself use coded Pantones. Bridget and the fashion team use TCX which stands for textile cotton extended codes. And then over in the engineering team, they were kind of missing out. So we ended up splurging and buying these plastic Pantone chips which is what we'll be checking out today. These are a little more difficult to put together than I had expected, but I guess that's maybe just user error 'cause this is the first time I'm doing this. Now the Pantone booklets that I use, the coded ones, those can cost upwards of $400 USD, so obviously all of the Pantone products are expensive, but to be fair, Pantone has to make sure that all of the colors come out exactly how they are supposed to. For these booklets in particular, Pantone recommends that you switch it out every 12 to each months just because the colors will fade eventually with them rubbing around or getting sunbleached. Whereas these plastic chips, obviously, since they're solid color, they last quite a bit longer. Oh, I forgot the little Lazy Susan on the bottom. There we go. Woo! I will say, as a designer, I wholeheartedly appreciate everything Pantone designs and makes because it really does make our job a lot easier. With our screwdriver, it has a end cap and a beauty ring. And we had gone through like 20 samples trying to perfect the color of the beauty ring. And we had gotten to the point where we were finally fed up. We were sending them the solid, coded Pantone codes. And obviously on paper, it's a lot different than it would be on plastic. We finally decided, you know what, we're spending so much money in samples that we might as well just splurge and get the Pantone chip so that we can make sure that our samples are correct the first time around. Now, one thing I do really wanna talk about is Pantone had launched these color plastic chip books a while back. I believe it was their first ones that they ever launched. But even Pantone says that those are supposed to be used as inspiration instead of actually being used as reference. Going with these, which are actual Pantone-formulated chips, these were the right way to go even though they cost a couple more thousand dollars than the books themselves. Hey, I heard you wanna be part of this video. What do you think? You spent $10,000 on these bad boys. - No, I don't wanna talk about that part. (Sarah and crew laughing) Actually, I do wanna talk about that part. Why? (Sarah laughing) - Well, obviously we need them to make sure- (Linus laughing) - Okay. - Well, would you prefer that we get hundreds of different samples trying to get the right color or we get the right color first time around because we have a chip to reference? - God, that's a lot of greens. Why do we even need this many greens? - I mean, who knows? - What's the difference between this green and this green? - Look at them. - No, I want you to look at them, okay? Ms. Colour. Okay, okay. (Sarah laughing) Here we go. We got A. - [Sarah] Okay. - [Linus] We got B. - [Sarah] Okay. - [Linus] Okay? Now I'm gonna shuffle them. (Sarah laughing) - Oh no. - Which one was this? - That was A. - I don't actually know. You could be right. - I think B was a little more yellow. Okay, no, wait. (Linus laughing) I don't even know. But they are different. You can't tell me those look the same. - [Linus] No. - [Sarah] Look at it in the thing. They're completely different. - [Linus] I mean, completely different depends on the angle of the light hitting them, but sure. (Sarah laughing) How are these even labeled? - That, oh, oh. - What is happening? - I want you to be part of this part. Okay, so you would think these beautiful $10,000, I'm gonna keep reminding you of the price. (Linus groans) Because that's quite extravagant. These beautiful $10,000 chips, okay? You would expect them to have an index, right? - Yeah. - Because they've got their numbers, but obviously each Pantone is labeled differently. - [Linus] Yeah, so that's the thing. - Yeah. - Why doesn't number 13 say 13 anywhere on it? - Nope. - Why would it do that? That'd be stupid. - Okay, but you know what else is stupid, Linus? So the way that you can figure out which number goes with which, you're not gonna believe this. I couldn't believe this. Here's your index. - Oh my God. Who uses these anymore? - I know. And I don't even know what the software looks like for this yet. We're gonna have to figure it out. - [Linus] Whee! - World's most expensive wheel. Yeah, take that, Lamborghini. (Sarah laughing) Like, man, you know, you got little kids. It's like, what's your favorite color? Sarah's gonna be like, \"(beep) TQ2416C, (beep).\" - No, I will say my favorite Pantone code for a while was 1495 which is a beautiful like lemony orange color. That would be in this pile here, which is our oranges and reds stack, which is still in the box. - Orange and red stack? - Because it takes 10 minutes to stack these things. (Sarah laughing) - [Linus] What the hell? - Bring it on over. Oh, look at that. We got some falling out over. - Oh no, it fell out. - Yep, yep. - Now I need a CD drive to know where it goes. (Sarah laughing) - Yeah, exactly. Yay! - Okay, so sorry, what's your favorite Pantone? - 1495. (Sarah laughing) - What kind of nerd has a favorite Pantone code? - Designers. Actually, in the comments, let us know what your favorite Pantone code is. - I also don't really like understand how it's sorted, to be honest with you. - It's not necessarily sorted strategically. It's just sorted by like color shade. - I'm gonna pick this. This is pretty good. I like 320C. - 320, nice. Let's make a screwdriver in that color. - So it's not about how much you spend on samples. It's about the opportunity cost of waiting around for those samples. Every week that screwdriver gets delayed could be costing us tens of thousands of dollars. So being able to just say, \"Hey, go get this chip. If it doesn't look like that, it's not good enough.\" Instead of having them send it to us for approval, send it back to them, try again, send it to us. These processes take weeks. We're never gonna find that color again. - No, we're not. - I bet we didn't even get it. (Sarah laughing) 1495. - Yeah. - Oh, well, there it is. - There it is, yeah. - [Linus] Oh, but that doesn't tell us where to find this on here. - No, no, no. I told you the only index- - What? - Is the disc drive. - Oh my God. - Yeah. - What the hell? So they've all got numbers except for some. This is PQ-WARMREDC. - That was my brand color in school. - PQ-ORANGE021C. Sure. Okay, see you later, Sarah. Enjoy. - Thanks. Oh, I will. Oh, well, okay. So that's one thing I wanna mention is when these were being unboxed for the first time, we definitely noticed there were a lot of chips that fall out and for $10,000, you would hope that Pantone would focus on making sure that chips stay in. That way, none of them get lost or confused. With that said, another thing is when pulling them out, some of them are a bit sticky and me, who always has clammy hands, does have some difficulty getting them out of the slot. - [Jono] Whoa, oh my God! - See, I told you. (Sarah screaming) Oh my God. (Sarah laughing) That would've been terrible. Okay, yeah, see how easy this pink is to like take out? It just falls out. Yeah, there's definitely a couple that you can see kinda wiggle. Oh yeah, see, look it, over here. Up here. They're just a little too loose for my liking. Each color chip costs $20 and 5 cents USD to purchase. And that's before tax and shipping. (Sarah grunting) (crew member laughing) Here's all of them together forever. Altogether, there's approximately 1,755 chips. That includes neons, pastels, and metallics. Before we put this in, let's get into our sponsor, Vessi. (Sarah laughing) Thanks to Vessi Footwear for sponsoring today's video. Vessi Footwear is known for being lightweight, easy to pack, comfortable, and most importantly, water resistant with its Dyma-tex technology. Their Everyday Move lineup is made to keep up with your active lifestyle with its added support at the midsole and better breathability. It also has a pull tab to take them off and put them on with ease and it's made creature-free so you can take each step in them guilt-free. You'll want to wear them everywhere. Keep your feet dry and save $25 with our code \"shortcircuit\" at vessi.com/shortcircuit. Here I have an ancient artifact dating back to probably 2008 and then this arriving with a 2022 product, like pardon me? And they make books and they don't have the index in book form. Can you believe that? Riley, can you believe that? - [Riley] Oh, how could they not have the index in book form? - Yeah, look at this. When was the last time you seen one of these? - [Riley] Oh, we're gonna sue them into the ground! (Sarah laughing) - Oh, there it is. Pantone Plus Plastic Standard Chips Collection. Okay, okay. It is in PDF form. I take back all my slander. These are all PDF form so I can simply move them onto my desktop and not have to worry about using the disc anymore. We gotta find 1655C. That is our brand color. - [Jono] Have you memorized that? - Of course. I have to use it all the time. So we've got 1655C in tray 2 and it is number 86. Because Pantone put the numbers on top of each of these little trays, when it says tray 2, I have to go back to this form now and figure out which tray is number 2, which is this one, and now I'll find my Pantone chip. (Sarah groaning) Oh, there goes another one. - [Jono] It's that pink one. - No, it's purple. - [Jono] That's pink! - This is purple. Marcus, what color is this? - [Marcus] Pink. - No! Wait. It is with the pink Pantone chips. (Sarah laughing) (crew laughing) But it does look purple. I swear, this is like a light lilac. 0.0115% violet and 1.1300% white. So it's definitely purple. Okay, I've got LTT's brand code which is 1655C and it says it's tower 2, which is this one we've realized, and it is number 86. This is it. Pantone 1655C. What a beautiful color. Lastly, let's do a real test. Let's see if I can match a Pantone code to an actual product. Oh my God. I'm so sorry. This is my SNES controller. I wanna color match the gray color here. Obviously, there's only 1,755 colors here and there are millions of color combinations. So I can't guarantee that I'm gonna find an exact match for this color, but let's see if we can find a close match. At first glance, it's a bit more of a purple-y gray. So I'm not gonna go to my cooler, warm grays. I'm actually gonna go to my purple selectors and my blue selectors. So I'll have to bring this one over, as well. (Sarah gasping) - [Crew Member] Oh, that's so cool! (Sarah laughing) - It's a bit lighter, but that is pretty close. So I might have to go a little darker if I can. Another really neat thing about these Pantone chips is, as you can see with this SNES controller, we have a more matte finish to the controller itself, but the buttons have a gloss finish or a shiny finish. And the Pantone chips offer a matte finish on one side and a gloss finish on the other side. It's really awesome and extremely useful for all of the products that we've been working on. I honestly think I found it. I don't see anything closer. I'm gonna say maybe these two. This one is closer just because it's a tad darker. Hopefully this unboxing was not only informative but also gave you an idea as to the kind of workflow and things that we do over in Creator Warehouse. While these Pantone chips are expensive, they are incredibly useful for our day-to-day work. And I don't know, I hope you enjoy it. Yeah, sign up for the LTT screwdriver and backpack. And if you wanna watch another expensive unboxing, go watch the Porsche Taycan video? Thanks, bye. (Sarah laughing)",
    "transcript_keywords": [
        "Pantone",
        "Pantone chips",
        "color",
        "Pantone code",
        "chips",
        "favorite Pantone",
        "Yeah",
        "favorite Pantone code",
        "God",
        "plastic Pantone chips",
        "time",
        "chip",
        "pink Pantone chips",
        "make",
        "samples",
        "plastic",
        "code",
        "plastic Pantone",
        "thing",
        "colors"
    ],
    "transcript_entity_values": [
        "TCX",
        "10 minutes",
        "weeks",
        "Linus",
        "Every week",
        "2",
        "Riley",
        "one",
        "20",
        "Creator Warehouse",
        "approximately 1,755",
        "Porsche Taycan",
        "$400 USD",
        "PQ-WARMREDC",
        "Vessi Footwear",
        "Dyma-tex",
        "25",
        "1655C.",
        "1.1300%",
        "LTT",
        "tens of thousands of dollars",
        "hundreds",
        "Marcus",
        "13",
        "0.0115%",
        "millions",
        "320C. - 320",
        "Jono",
        "2022",
        "Marcus] Pink",
        "only 1,755",
        "Pantone",
        "first",
        "Pantone",
        "10,000",
        "Pantone Plus Plastic Standard Chips Collection",
        "86",
        "SNES",
        "Sarah",
        "two",
        "1655C",
        "PDF",
        "Linus",
        "ShortCircuit",
        "Colour",
        "1495",
        "2008",
        "2",
        "a couple more thousand dollars",
        "Vessi",
        "Lamborghini",
        "20",
        "today",
        "Bridget"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON"
    ]
}