{
    "id": "JgADogL6Bp8",
    "title": "This is Pure False Advertising - HP 550 Keyboard",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-04-16T16:58:53Z",
    "video_url": "https://www.youtube.com/watch?v=JgADogL6Bp8",
    "category": "Science & Technology",
    "tags": [
        "HP",
        "Gaming Keyboard",
        "Mechanical Keyboard",
        "HP 550",
        "Havit",
        "Red Mechanical Switches",
        "Membrane",
        "Hybrid Membrane Mechanical",
        "Memchanical"
    ],
    "views": 1884983,
    "likes": 76516,
    "comments_count": 3134,
    "description": "Its no secret their chairs are great! Check out Secretlab at   Signup for a Hetzner server and use code LTT23 to save 20 at:   We don't hate hybrid membrane-mechanical keyboards, we hate when the box doesn't make it 100% clear that that's what you're buying. Despite the deception, is the Gaming Keyboard 550 from HP any good or should you stay very far away?  Discuss on the forum:   Buy a Redragon K530 Pro Draconic Wireless Mechanical Keyboard:  Buy a Logitech G413 Mechanical Keyboard:  Check out the CIY GAS67 Wireless Gasket Keyboard Kit:  Buy a Havit KB487L Mechanical Keyboard:  Buy a SteelSeries Apex 5 Hybrid Keyboard:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:05 Blind Tests 2:35 Switches 5:00 Marketing 6:00 10KRO 8:00 Alternatives 9:10 Conclusion 11:08 Outro",
    "description_links": [
        "https://lmg.gg/secretlab",
        "http://linustechtips.hetzner.com/en/cloud-arm-23",
        "https://linustechtips.com/topic/1501190-this-is-pure-false-advertising/",
        "https://geni.us/BzSpN",
        "https://geni.us/uFDH",
        "https://lmg.gg/Nui5C",
        "https://geni.us/lpX4",
        "https://geni.us/aAIPZ",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Marketing sucks. Whether it's the wonderful weight loss benefits of cigarettes, vitamins that prevent cancer, or a free Harrier jet if you collect 7 million Pepsi points, those mad men blow so much smoke our way, you'd think the studio was on... Fire! Wait, that's not the studio. It's the HP 550 gaming keyboard that we bought off eBay for 50 British pounds. Why did we do such a thing? Because someone's brother on our subreddit bought this thing that says, \"Red mechanical switches,\" which is a weird feature to call out on a keyboard that is not, in fact, mechanical. Was HP hoping no one would notice? Is this thing any good? Are the switches even colored red? Yes, they are. Have I wasted my money? I know the answer to one of these questions at least. And I know our sponsor. - Hetzner. Hetzner is now offering brand new ARM64 cloud servers. Discover Ampere's efficient and robust ARM64 architecture and be ready to get blown away with this performance. Deploy yours now by clicking the link below. - Let's kick things off with the blind tests. We've got our HP 550 and a similarly priced real mechanical keyboard with linear switches. Each test subject will get to feel each board then see if they can tell them apart and let us know which one they prefer. (keys clacking) - Untrimmed, unlubed. - It seems pretty cheap, I'd say. - Is there a clicky? Feels like a Red switch type beat, yeah? - There's, like, more satisfying click to it. - I like the feel of this more than I like the feel of this. - [Sammy] Okay, I can already tell this is kinda (beep). Oh, sorry. (space bar rattling) - [Tester] Those stabs suck. (keys clacking) - Those are weird. (chuckles) - [Tester] It feels like a chore almost. - [Sven] This one feels, like, super mushy when you bottom out. - I don't like this one. - [Plouffe] (laughing) Which one do you like more? - Neither. They both suck. - [Plouffe] (laughs) The HP 550 up there- - Yeah. - [Plouffe] It's membrane. - It's membrane. (laughing) That makes sense why it feels like garbage then. (laughing) - Oh, it has a num pad. Ay! Okay, no, that changes everything. - Can I take 'em off? - [Plouffe] Yeah. - Huh. (Angus laughing) - [Plouffe] Would you buy either of them? - No. (chuckles) Okay, meme price, I would pay like $5 for it. (laughs) - Were you one of those ones, like, when you buy, like, a PC, it comes with it? But if I were to guess, like $70, just because of, like, the brand price. - Probably a little more, like 150, 200 US. - [Plouffe] The HAVIT's like 50 bucks, isn't it? - Yep. - [Plouffe] Yeah. The HP is about $50 as well. - Okay. - I'm not even a keyboard guy, and I could tell. - [Plouffe] Yeah. - Yeah. Wow. Yeah, no, this feels so much better. - Naturally, their reactions are no surprise, particularly the enthusiasts in the crowd. Most of our subjects either actively disliked the HP 550 or at least preferred the other option. Even though both of them claim to use mechanical switches, our keystroke force graphs here reveal a clear difference in the feel between the two. As you press down on a linear mechanical key switch, you should see a consistent, that is, linear, increase in the required pressure as the spring compresses. Switching over to the HP, as a Canadian, I might not know much about much. But I can sure as shoot recognize a hockey stick when I see one. (laughing) And if we tear this keyboard down, the reason is obvious. Under our key cap is what appears to be a switch. And in fairness to HP, it is in fact made of red plastic. However, if we remove one and open it up with our handy-dandy switch puller and opener, we can see that it is in fact an imposter! Then, looking closelier, we have most of the traditional switch components, top and bottom housing, stem, spring. But what's missing is the contact pins on the bottom and the leaves that they're attached to. Now, when you press down on a real mechanical switch, the stem moving allows the leaves to make contact and send a signal down through the pins into the keyboard's PCB and then on to your computer. What we're doing here, though, is just jabbing the stem down. So how does a signal get generated from the rubber dome that is below it? Rubber domes work by buckling under the force of your finger, mashing a conductive material onto a contact pad. And the reason membrane keyboards often feel mushy is because rubber itself is kind of mushy, and that's what you're actually pressing down on to make the connection happen. One of the advantages of rubber membrane switches is that they are cheaper. But a major disadvantage to this approach is that if a key stops working for whatever reason, chances are that it will be a real pain to fix it, if it's possible at all. Outside of removing the rubber, cleaning up the contacts, and then praying to Tech Jesus, there's just not much that you can do, whereas with a mechanical keyboard, you should be able to simply replace the faulty switch and go about your day. It is a little harder on some keyboards than it is on others, but it's pretty much always an option. Our major problem with the HP 550, though, isn't that it uses membrane switches. In fact, they're not even the first to make a mem-chanical or hybrid mechanical switch like this one. Our problem is with the marketing. The box says, \"Red mechanical switch,\" when the switch component of a switch is the contact point. There is a mechanical component to it, the stem and spring, but it presses down on a dome that presses down on a switch. It's kind of like saying, \"I'm driving an electric car because I have an electric shoe that presses down on my gas pedal.\" Words are not just words. They actually mean things, and I don't think it's a stretch to say that for someone who doesn't know any better, maybe a relative doing some gift shopping or a first-time keyboard buyer, they could easily see that on the box and assume that this is a fully mechanical keyboard, especially given that it's priced like one. And it gets better. Another feature they've listed here is 10KRO, or 10-key rollover. This means that our keyboard should be able to register up to 10 different keys pressed simultaneously. It's a feature that's so common that many new keyboards actually come with NKRO, or any key rollover, by default, with the majority doing six at the minimum. This is more important than you might think. Even in a typical first-person shooter, you're often holding down at least one or two keys. For our example, let's go with W and Shift to sprint forward. Now let's say you wanna strafe a bit and go at an angle, so you add D. And then there's a jump coming, for a total of four keys potentially pressed at once just to move around. Unfortunately, this board, while it boasts 10-key rollover, often can barely handle four, so another outright lie. The worst part is, it's not even consistent. Depending on the zones occupied by our keys, we can get significantly higher scores of seven or even eight-key rollover before it becomes unresponsive, which would get them some extra points especially if it's at its best in the gaming zone, except that that's still well short of their claims. But I can practically hear some of you saying- - But Linus, I only have four fingers and a thumb on one hand. I don't need a 10KRO. - And for the majority of people, you're actually right. Six-key rollover is perfectly adequate. But we aren't even getting six consistently. And if you play any kind of keyboard-based rhythm game, or if you play classic two-player games where both people are using the same keyboard, or if you're the kind of sadist who plays \"Devil May Cry\" with a mouse and keyboard, chances are that an input won't be registered during a critical moment, giving you a valid reason to blame your peripheral for your failure and giving us a valid reason to be mad at HP for their bullspit. Now, to be clear, I'm not trashing on anyone who purchased this product and loves it. The thing about keyboards, particularly mechanical ones, is it's all about preference. And if you prefer the tight feel and sound of this board, there is nothing wrong with that. But if you're still shopping, there are some other options that I would like to point out for you. Redragon, for instance, recently moved away from PCBs meant for smaller OUTEMU switches and now offer a much more versatile board with their K530 Pro Draconic. It's currently just $55 on Amazon, wireless over Bluetooth or 2.4 gigahertz, comes with switches and keycaps, and is hot swappable with most three or five-pin switches. Want something a little more custom? The CIY GAS67 doesn't come with switches or keycaps, and you will need to build it yourself. But Tim from the lab snagged one of these online for just 46 Canadian rubles. They have gone up a bit lately due to scarcity, but still, that's almost the same price as a super comfy mystery-colored waffle long sleeve from lttstore.com. If you don't like either of these options because you prefer something a bit more name branded, well, hey, there's always the Logitech G413 SE. It's not our enthusiast top pick, but it's still a real mechanical keyboard for about 60 US dollars at the time of writing. Don't get me wrong. None of these are gonna beat the sound and feel of a much more premium board, but they're gonna get you a lot of the way there at a fraction of the price, and they don't cost much more or even more at all than the HP 550. As for this thing, it just kind of sucks. It's got a green LED backlight, one-stage flip-up feet, and a permanently attached USB-A cable all in a very typical plastic housing. We tested it for latency, and while it isn't terrible, measuring an average of 15 milliseconds, that's not gonna matter if the key you pressed never even registers. For reference, our HAVIT keyboard registered about 13 milliseconds. And our Apex 3, which is another membrane keyboard, was also at about 15. If, for some reason, you want a hybrid mechanical keyboard, there are many newer options like the SteelSeries Apex 5 that doesn't feel anywhere near as bad as this thing does. So the next time you're out there shopping around, trying to decide what keyboard to buy next, do yourself a favor and don't fall for the marketing BS. Many mechanical keyboards, if they're actually mechanical, we'll show the PCB or at least the socket so that you can confirm these details for yourself. Now, to HP's credit, their website has been updated to read, \"Hybrid mechanical-membrane keyboard.\" But I'm still not gonna go too easy on them here because they are still claiming that their terrible 10KRO is gonna ensure that no matter how fast and furious you make your next move, your key presses will be detected. So it's junk, and you should get yourself quite literally anything else. You know, I heard Tommy Hilfiger has a good gaming set, just like I heard this is a pretty good segue to our sponsor. - Psst. You wanna know a secret? SecretLab chairs are great. Their sleek, ergonomic, high-quality chairs are built to withstand the rigors of gaming or office work for long hours. Their TITAN Evo 2022 series chair offers four-way lumbar support, comes with a magnetic memory foam head pillow, and is offered in different upholsteries like hybrid leatherette, soft-weave fabric, and Napa leather. SecretLab also has a range of gaming chairs designed in collaboration with popular games such as \"League of Legends,\" \"VALORANT,\" and \"Overwatch.\" Head to the link in the description and check out SecretLab chairs today. - If you enjoyed this video, make sure to check out the last time we talked about mem-chanical boards a few years ago. It was deceptive crap marketing on Cooler Master's part back then, and thankfully, they're doing better about that these days. I think HP could probably learn a thing or two.",
    "transcript_keywords": [
        "keyboard",
        "mechanical",
        "mechanical keyboard",
        "switch",
        "switches",
        "feel",
        "mechanical switch",
        "real mechanical keyboard",
        "yeah",
        "Red mechanical switch",
        "Red mechanical",
        "thing",
        "keyboards",
        "Red",
        "Feels",
        "key",
        "mechanical switches",
        "real mechanical",
        "mechanical key switch",
        "membrane"
    ],
    "transcript_entity_values": [
        "Cooler Master's",
        "PCB",
        "just $55",
        "about 13 milliseconds",
        "one",
        "Ampere",
        "HAVIT",
        "550",
        "four",
        "first",
        "eBay",
        "Redragon",
        "NKRO",
        "Harrier",
        "up to 10",
        "46 Canadian rubles",
        "eight",
        "One",
        "HP",
        "a few years ago",
        "HP 550",
        "2.4 gigahertz",
        "70",
        "about 60 US dollars",
        "seven",
        "SecretLab",
        "today",
        "linear",
        "Angus",
        "D.",
        "five",
        "British",
        "about $50",
        "15 milliseconds",
        "Amazon",
        "Tommy Hilfiger",
        "at least one",
        "10",
        "Logitech",
        "long hours",
        "the spring",
        "Napa",
        "Hetzner",
        "150",
        "US",
        "Pepsi",
        "Tim",
        "Overwatch",
        "200",
        "Six",
        "three",
        "VALORANT",
        "like $5",
        "six",
        "50 bucks",
        "USB",
        "about 15",
        "Canadian",
        "10KRO",
        "Linus",
        "50",
        "the SteelSeries Apex 5",
        "two",
        "Devil May Cry",
        "Tech Jesus",
        "these days",
        "7 million"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "ORG",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "NORP",
        "CARDINAL",
        "NORP",
        "MONEY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "CARDINAL"
    ]
}