{
    "id": "JgtAEDe3s5I",
    "title": "NEW AirPods Pro 2 first look (and listen!)",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-09-11T18:18:28Z",
    "video_url": "https://www.youtube.com/watch?v=JgtAEDe3s5I",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 728899,
    "likes": 21060,
    "comments_count": 791,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Oh, my gosh. Okay, look here they are, the new AirPods Pro 2. These are so awesome. And I love the fact that they have a built in lanyard. I feel like that's something that was missing on basically all of the AirPods. But now it's here and they also have a speaker, which if you have AirPods, leave a comment below. How many times have you lost your AirPods and then found them? This will actually help you find them easier because you'll be able to actually hear the sound much louder. So I'm very, very excited about that. So this has a pretty similar design to the previous version but it has the brand new H2 chip. It has high band connectivity, new low distortion driver with custom amplifier. It also has personalized spatial audio, so you'll be able to use iOS 16 to scan your ear. You may have seen me talk before about Sony's headphones, because they have the similar thing where you can actually scan your ear to get customized audio. Well now the AirPods actually have that too. So you're gonna be able to scan your ear and be able to get customized spatial audio, depending upon the shape of your ear, which is pretty awesome, because as we know, we all have different shaped ears, and sometimes a lot of AirPods don't work for my ears. So I'm very excited to try this out to get customized audio. We also now have smaller ear tips, which is also very exciting because I do have trouble sometimes with these in my ears. With the case you'll be able to get about 30 hours of battery life, and listening time, you'll get about six hours, which has increased from the previous version. It does have the adaptive transparency mode. I love using the AirPods Pro when I'm on a flight or if I'm out and about, and these do have noise cancellation that has been improved, and it's supposed to be two times stronger. So that's gonna be really fun to kind of test that out in comparison to the previous version. Another thing that I'm excited about is you'll be able to now charge your AirPods case with the apple watch charger. And this is really exciting because I always travel with the little dual charger, and sometimes I'm charging my phone and I wanna charge my AirPods at the same time, but now I can actually use the apple watch section of that and charge my AirPods. I've got left. Oh yeah. Active noise cancellation is on. - [Employee] So let's change it to transparency so we can talk for one second. - I hear everything. So a lot of times with these headphones, you hear kind of like this tinny kind of sound and it kind of hurts your ears, whereas these do not do that. It sounds very clean, very natural. And actually they fit as well. It sounds so good. So I don't wanna, I feel like I'm talking, I don't know if I'm talking loud 'cause I can't hear myself. But now with the active noise cancellation on it told me that my noise levels are okay because I'm blocking out a lot of the sound. This is so great. I'm so glad I decided to do the demo. - [Employee] One more thing to try. - We have one more thing. - [Employee] The touch controls on volume. - Okay. So the touch controls are actually really awesome. So now I'm turning it up and turning it down. Music's going up. Music's going down. The only thing that would make this better is if Tim Cook and Harry Styles walked outta the Steve Jobs theater right now. We can only hope. - [Employee] We can hope. - We can. Oh my gosh. Awesome. These were so cool. Wow. - [Employee] Glad you enjoyed. - Thank you so much. So here they are. The new Airpods Pro 2 right here. I'll see you guys in my next video. Peace.",
    "transcript_keywords": [
        "AirPods",
        "AirPods Pro",
        "ear",
        "thing",
        "ears",
        "audio",
        "Pro",
        "awesome",
        "noise",
        "kind",
        "hear",
        "previous version",
        "customized audio",
        "customized",
        "noise cancellation",
        "scan",
        "sound",
        "times",
        "previous",
        "scan your ear"
    ],
    "transcript_entity_values": [
        "Harry Styles",
        "H2",
        "Sony",
        "the apple watch section",
        "AirPods",
        "Airpods Pro 2",
        "16",
        "one second",
        "one",
        "about six hours",
        "the AirPods Pro",
        "Steve Jobs",
        "AirPods Pro 2",
        "two",
        "Tim Cook",
        "about 30 hours",
        "One"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "TIME",
        "CARDINAL"
    ]
}