{
    "id": "jI6pmMOrzdY",
    "title": "Dyson Zone: Futuristic Headphones with air purification?!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-04-27T22:16:32Z",
    "video_url": "https://www.youtube.com/watch?v=jI6pmMOrzdY",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Unboxing",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 174057,
    "likes": 4471,
    "comments_count": 649,
    "description": "Thank you to Dyson for sponsoring this video! Click the link here:  to check it out for yourself!    PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE:    GET YOUR OURA RING:    FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -",
    "description_links": [
        "https://bit.ly/3MTs8Uv",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "https://oura.link/ijustine",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ"
    ],
    "transcript": "- Have you ever seen a pair of headphones that has air purification? Well, now you have. This is Dyson Zone. They're noise canceling headphones with a personal air purifier, or they can just be headphones if you want. (calm music) Dyson is a leader in the industry and, quite often, they are found pushing the boundaries when it comes to creating products. They're mostly known for their vacuums and futuristic looking air purifiers. They've also entered the hair care, lighting space, and now, the headphones space. But these aren't just any normal headphones. These are the Dyson Zone headphones and personal air purifier. With up to 50 hours of battery life, advanced noise cancellation, and a high efficiency filtration system that allows you to tackle pollution on the go, these definitely feel like a product of the future but they're here right now. Inside the air cups are micro-compressors and filters. These will capture 99% of airborne particle pollutants, which include nitrogen dioxide, sulfur dioxide, and airborne dust. This has been something that Dyson has been working on for over six years, with their main goal of reducing noise and air pollution for the wearer. Now, to do this, obviously, there were a lot of challenges, like, \"How do you make \"a great sounding pair of headphones \"that are comfortable \"while combining that \"with Dyson's specialty of air purification?\" Well, it looks like we have the answer. So, my friends, let's unbox it and see what's inside before we start testing these out. Wow, look at this case. This is so industrial. Let's open it up and check these out. We are greeted with... Oh my goodness, it's got a little carrying case. Here's the strap. This case is so nice. I would actually carry this as a bag, like as a purse. Very nice. So we have a few components to this. This is the visor, so this is the actual air purifier piece that attaches to the headphones itself. And what I love about this, from the things that I've seen and read about it, is this doesn't actually touch your face, it kind of just hovers in your breathing zone. So it's not hindering your face movements, you can be a person while you have your purified air. So here's the visor. I love that this has the copper accents. So pretty. Oh my goodness, I love it so much. Then inside, we have the headphones. Wow, this case is so incredibly nice, I can't get over it. I love the look of them. I like that this has a little see through ear cup, and inside these ear cups is actually where the air filtration happens. So before we turn them on, let's see what else is inside these boxes. We have, it looks like, all of our instructions, a quick start guide, which definitely gonna need that. Ooh, we've got all sorts of accessories. We've got a nice little carrying bag. So if you don't wanna have that hard shelled little bag, you can take this one on the go, which I definitely will be doing. Look at this. This is something I'm actually quite excited about, they have a travel adapter for airplanes. I also like that they offer a wired connection. This is huge because as someone who edits and really does need to rely a lot on timing, I sometimes don't like editing with Bluetooth because there is a slight lag, so this is great that we have an option to have it wired. And I love the color of this braided cable. We've also got another braided USB-C cable, and this is for charging the headphones. And we have the air filters. Now, these go inside the ear cups and this is what filters out the air before it gets to your face. Let's install our air filters. Now, there is a MyDyson App, so we are gonna connect this to our phone and with that, you'll be able to tell the quality of the air filters and when you will need to change these. They say these should last up to a year. Oh, this is nice, they gave you an extra set. So the one bag, there's actually two of them inside. Let's turn them on and get them synced up to the app. Oh my gosh, it's telling me to put them on, okay. Prepare our visor. \"To prepare, remove the sleeve \"and fully extend.\" That's it. That was it. I'm feeling the air. The thing that I do like about this is it's telling me about the air quality that's around me, and it's saying the air quality is actually pretty good. This, I feel like, is not something that you would be wearing indoors, unless you have some sort of air pollution problem in your home. And if that's the case, then you should probably get that looked at. So to turn on active noise cancellation, you double tap, and this will reduce the background around you, and you double tap to cycle between modes. There's also an audio joystick, so I can control my audio using the joystick on the back of the right ear cup. And there's a voice assistant. Whoa, oh my gosh, I just switched to transparency. So when I do have the transparency off, I'm hearing all around me. And there's obviously fans running to filter this air to your face, to give you that air filtration and the purified air. I hear something, like a small, slight hum, you might actually be able to hear it yourself, but for the most part, especially when I turn on the isolation, I can feel it but I don't really hear it. So since the air quality is pretty good in my home, I'm going to just take these off. The fans automatically stop. The air is obviously no longer blowing on my face. And now, I've just got a high quality set of headphones, so let's listen to some music. (\"I Don't Really Care\" by Hallman) Whoa, okay! We've got music. Sounds very good. These are actually very comfortable. For how large they look, there's like perfect distribution of weight on my head. And this is so light... I'm yelling because I have the music up very loud. Thing that is so cool is how quickly this just snaps on and off. These are so interesting to me because I do feel like that in a lot of areas, depending upon where you live, busy cities, I think about when I go to New York, how disgusting I feel just breathing the air from big cities. This is something where you'll be wearing the headphones indoors, to work, to edit, to take phone calls, and then when you go out on your daily commute, or if you're just out and about in a city, that's when you can pop the visor on. I love that this is so lightweight too, so adding this to your backpack or your purse, it'll barely add any weight at all. Not only are you getting the benefits of noise cancellation and noise pollution, but you're also getting that added benefit of reducing air pollutants as well. So right now, I'm doing a software update and when that is done, I'm actually heading out on a trip. So I'm gonna be really excited to test these out on a plane, in various cities, and in different scenarios where I think this would be most fitting. One of the things that I thought was awesome while testing these out for the first time in Seattle is as I was walking faster, it's able to determine your breathing rate and deliver more purified air to you as needed. So this is the first time I'm experiencing that. It's so cool. So I am back now from traveling and testing out the Dyson Zone headphones and personal air purifier, and I'm gonna tell you that I'm actually way more into this than I thought I was at the beginning. When I first started this video, I thought this was an incredible concept, I thought this would be something really great for people who live in cities, who do commutes. But then, as someone who travels a lot on an airplane, I could not tell you how awesome this was to fly with. I did travel to Seattle, to Pennsylvania. So while I was in Seattle, I did take these around outside, going for a walk, and just wearing them to see what it would be like to wear on a daily commute. Now, I was in Redmond, which is actually a pretty clean city, all things considered. So being able to take my phone out and actually see on the app what the pollution levels are while you're in a location is one of my favorite features. The other thing that I really liked was how easy it is to switch from active noise cancellation to transparency mode. So if I was crossing the street, or I wanted to be able to get some of the sound that was around me and not stop listening to my music, I could do that as well. When you do first see these, they look a little silly. I mean, you can't deny that. It is something that is not the norm. So obviously, when something looks a little bit different, people are going to look and ask questions. And I was actually so surprised, no one said anything to me on the plane, nobody even looked at me. No one said anything in Seattle, there wasn't a single person that was even paying any attention. And I think that's the interesting thing about, well basically, us as humans, is most of the time, we're the ones that are more concerned about what other people think when, in reality, no one actually cares. So for me, my own health and my comfort means so much more than what someone else thinks about what I'm doing. I'll put a link in the description if you guys wanna get more information on where to purchase these. Now, when I was thinking about the price point of these, these are about $1,000, a lot of high end headphones are within the $500-700 range, and so on, so not only you're getting high quality audio but the fact that you're getting this added bonus of a personal purification device, it kind of makes sense. Jenna! - [Jenna] Yo! - You haven't tried these yet. - [Jenna] I haven't. - Oh my gosh, aren't these so cool? - [Jenna] They're very... I like the color. - I know! - [Jenna] Whoa. - They're awesome. Well, thank you guys so much for watching. If you haven't already, please like, comment, and subscribe if you enjoyed this video, and I will see you guys in the next one. Bye. (soft piano music)",
    "transcript_keywords": [
        "air",
        "Dyson Zone headphones",
        "headphones",
        "Dyson Zone",
        "air purifier",
        "personal air purifier",
        "Dyson",
        "air quality",
        "air filters",
        "Zone headphones",
        "personal air",
        "Inside",
        "noise",
        "purified air",
        "love",
        "Zone",
        "quality",
        "air pollution",
        "Seattle",
        "case"
    ],
    "transcript_entity_values": [
        "Seattle",
        "about $1,000",
        "six years",
        "USB-C",
        "New York",
        "up to 50 hours",
        "Dyson",
        "Bluetooth",
        "Dyson Zone",
        "Pennsylvania",
        "daily",
        "99%",
        "two",
        "Redmond",
        "first",
        "up to a year",
        "Hallman",
        "500",
        "Jenna",
        "One"
    ],
    "transcript_entity_types": [
        "GPE",
        "MONEY",
        "DATE",
        "ORG",
        "GPE",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "GPE",
        "ORDINAL",
        "DATE",
        "PERSON",
        "MONEY",
        "PERSON",
        "CARDINAL"
    ]
}