{
    "id": "jjwLHqupXpM",
    "title": "Tesla makes a PHONE CHARGER?! - Teardown",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-12-21T17:28:52Z",
    "video_url": "https://www.youtube.com/watch?v=jjwLHqupXpM",
    "category": "Howto & Style",
    "tags": [
        "Tesla",
        "Tesla Power bank",
        "18650 lithium ion",
        "battery cell",
        "electric car",
        "green energy",
        "Power bank",
        "cell phone",
        "mobile device",
        "tech",
        "technology",
        "iPhone",
        "Made by iphone",
        "Apple",
        "best phone charger",
        "Telsa car",
        "Model X",
        "Model S",
        "Model 3",
        "Lithium",
        "Roadster"
    ],
    "views": 1995219,
    "likes": 34122,
    "comments_count": 1731,
    "description": "The magical lithium power inside the electric Tesla cars is now jammed inside a much more portable Tesla PowerBank. Lets open this little piece of tech up, and review it from the inside.  Get 1000 miles of free Tesla supercharging when you buy a Tesla with my link:  Does tesla use the same lithium 18650 battery cells inside their little Tesla Power bank? There is only one way to find out. Lets teardown the Tesla iPhone Charger.   The TESLA Powerbank:   Awesome Smart Phone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://ts.la/zack10701",
        "https://shop.tesla.com/us/en/product/apparel/powerbank",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "Tesla has made a power bank for your phone, and it's rather interesting. Designed by Tesla of course, this normally costs about $45 US dollars, but it's completely sold out at the moment. It's interesting that inside the box, this Tesla charger comes with very specific instruction to not disassemble or repair it. So I think it's time to disassemble and repair it. Let's get started. [Intro] This particular charger comes with the lightning port for iPhones, and a detachable micro USB for all those Android phones from 2015. Maybe Tesla will ship a USB-C dongle for their next batch of chargers for the more modern Android phones. The black surface is made from plastic. And the silver protrusion mimicking a cylindrical battery is made from a thin metal. Getting inside this thing is rather difficult and actually involves breaking some of the plastics. It's not designed to be opened up. Once inside we get our first glimpse of the 18650 lithium-ion cell, with a 3300 milliamp capacity. This is the same exact battery found inside many of the Model S and Model X Tesla vehicles, except for, you know, there's thousands of batteries inside those cars and this phone charger just has one. Two screws hold in place both circuit boards on either side of the battery, and the whole contraption can pull away from inside the plastic housing. The neon green battery itself is soldered onto the main board with leads headed to each of the terminals on each side of the battery. The copper wire strung up the side is probably for the temperature sensor. These 18650 batteries are actually extremely common and can be purchased in bulk from Amazon or Ebay for really cheap. So from a repair-ability standpoint, if you can solder, this thing can be replaced. I'll plug it into a power source and we could see the green LED at the end start flashing, indicating that the lithium-ion battery is charging. I'll plug that micro USB port into one of my Nokia phones, and we have power. It's definitely not the biggest power bank, and probably more of a collector's item than anything, but it's still cool that the same technology charging your cell phone is powering some of the coolest and fastest cars on the planet. I'll go ahead and plop the singular cell back into the plastic housing. To restore the plastic housing back to the perfect condition, I'd need some glue since the plastic tabs holding this closed weren't meant to be opened and broke off during my intrusion. I'll toss a link in the description for these Tesla power bands when they become available again. Would you ever get one? Or would you rather save your money and just buy the whole car. I'm still trying to get my hands on a real Tesla to tear down. I'll keep you updated on Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Tesla",
        "Android phones",
        "battery",
        "inside",
        "plastic",
        "plastic housing",
        "Tesla charger",
        "power",
        "Tesla power",
        "charger",
        "phone",
        "phones",
        "micro USB",
        "modern Android phones",
        "Tesla power bands",
        "Android",
        "made",
        "interesting",
        "side",
        "phone charger"
    ],
    "transcript_entity_values": [
        "Amazon",
        "3300 milliamp",
        "Android",
        "thousands",
        "Ebay",
        "about $45 US dollars",
        "Model X Tesla",
        "one",
        "USB",
        "iPhones",
        "Two",
        "Nokia",
        "18650",
        "Tesla",
        "first",
        "Twitter",
        "2015"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE"
    ]
}