{
    "id": "jkhvXkDtkhY",
    "title": "Galaxy Watch 6 Series hands-on",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-07-26T11:00:38Z",
    "video_url": "https://www.youtube.com/watch?v=jkhvXkDtkhY",
    "category": "Science & Technology",
    "tags": [
        "galaxy watch 6",
        "samsung galaxy watch 6",
        "galaxy watch 6 classic",
        "samsung galaxy watch 6 classic",
        "galaxy watch 6 leaks",
        "galaxy watch 6 pro",
        "samsung galaxy watch 6 pro",
        "galaxy watch 6 features",
        "galaxy watch 6 release date",
        "samsung galaxy watch 6 unboxing",
        "galaxy watch 6 rumors",
        "galaxy watch 6 price",
        "galaxy watch 6 pro specs",
        "samsung galaxy watch 6 specs",
        "samsung galaxy watch",
        "watch 6 samsung",
        "galaxy watch 6 pro unboxing",
        "galaxy watch 6 2023",
        "watch 6",
        "watch 6 classic",
        "samsung"
    ],
    "views": 378031,
    "likes": 6197,
    "comments_count": 467,
    "description": "Samsung just unveiled its Galaxy Watch 6 series at Unpacked  and it's all about the bezels. Both the physical rotating bezel, and the thinner bezels around the displays. But is it a good thing when the update you're most excited about is an old feature making a comeback?  0:01 All about the bezels 1:30 Displays 2:15 Size impressions and comparisons  3:00 Hardware and design 3:19 Performance and specs 3:45 New fabric bands  4:08 New strap mechanism 4:45 Software changes, WearOS 4, battery life 5:29 One UI 5 Watch 6:00 New software tricks for 6:25 Bad news is the price  6:52 Final thoughts   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "(upbeat music) - Do you see this? The physical rotating bezel is back, baby. Oh, and the regular Galaxy Watch 6 is here too. (upbeat music) Clearly I've got bezels on the brain, but I cannot overstate how happy I am that Samsung's seen the error of its ways and brought back the Classic for the Galaxy Watch 6 series. I, and apparently a bunch of y'all, felt bummed when Samsung did away with it last year for the Galaxy Watch 5 and Watch 5 Pro. I mean, it was an iconic feature that really set Samsung apart and the digital bezel just didn't work as well. Playing around with the bezel underscored how much I really missed it last year and using it again felt like getting a warm hug from my grandma. What I love most about the rotating bezel is how intuitive it is to use. Even the biggest smartwatch displays are still pretty small, and the way wearable apps are designed, it involves a lot of scrolling. The rotating bezel gives you more control over the speed and it's very forgiving compared to the digital bezel. With the touch bezel, you have to be more precise. Your finger also has to travel around the whole screen whereas you can just sort of stay in place with the physical bezel. And because it's physical, it's immune to sweaty fingers or gloves. Plus, it just has this really satisfying click. (watch bezel clicking) This isn't the only bezel-related update either. The bezels around the display is 15% thinner on the Classic and 30% thinner on the regular Watch 6. In fact, Samsung says these are the largest displays they've ever had on a watch. It's subtle and you notice the extra screen real estate more on the Classic, but it's still an improvement from past generations. It's actually kind of impressive given that the regular Watch 6 still comes in 40 millimeter and 44 millimeter sizes. The Classic, well, these are one millimeter bigger this time around at 43 millimeters and 47 millimeters, and the 47 millimeter Classic is basically the biggest Galaxy Watch ever. Listen, I have worn a ton of 47-millimeter smart watches but there's no denying that this is a big boy watch. That said, hardware and materials on these larger watches have a major impact on wearability, especially if you have small wrists like me. For example, a 47-millimeter Polar or Coros watch, well, that's gonna be a bonafide chonker. 47 millimeters on the Classic, well, it wears small-ish and it helps that it's relatively thin and light for this size. Side by side, it was very similar to the 49-millimeter Apple Watch Ultra. The 43-millimeter Classic is, however, noticeably lighter. If you really want thin and light though, the regular Galaxy Watch 6 is gonna be the better choice in both sizes. Other than that, the hardware and design hasn't really changed much. If you've seen a Galaxy Watch 4 or 5, you know the deal. We're not getting any new sensors and we still got IP68 and 5ATM of water resistant, sapphire crystal, the same GPS, temperature sensor, same three-in-one biosensor, et cetera, et cetera. The watches, however, are getting a bit of a performance boost. The Watch 6 series has a shiny new Exynos W930 chip with two gigabytes of RAM and 16 gigabytes of storage. Supposedly that translates to 18% faster performance, but it's too early to say whether it makes a notable difference. These were demo devices in a controlled setting so it's not fully representative of the final product. Another minor update. Samsung's introducing a fabric band and a one-click strap mechanism, and thank God. The fabric band is similar in feel and texture to the Apple Watch's Nylon Sport Loop, which is great if you have sensitive skin or you want something a little more breathable. The sport loop is the strap I recommend to every Apple Watch buyer, and I have a feeling that this fabric strap will be my pick for Galaxy Watch users going forward. I also like the new one-click strap mechanism. It's very straightforward and it makes swapping bands a lot easier than the previous spring-loaded pins. Don't worry if you've amassed a huge watch strap collection. Your standard straps will work with the Galaxy Watch 6 and these new one-click straps are also backwards compatible. The only problem I had is my nails have been wrecked by one too many manicures, so pressing the button was a little difficult for me. Like, I know I'm supposed to press this button, but my nails just, come on, nails, you can do it. I believe in you. Nope, no, you broke. (upbeat music) The main changes this year are coming via software updates. Namely, these are going be the first watches to launch with Wear OS 4. Nevermind that Wear OS 3 still isn't fully rolled out yet to every compatible Android watch. Doesn't matter, Wear OS 4 is here. The big thing about Wear OS 4 is it's supposed to extend battery life, which, as you may know, has been an issue for Samsung since switching from Tizen to Wear OS. Plus, both watches have bigger batteries this time around. Not like a lot bigger, but bigger. These two things together make me hopeful about battery life, though, Samsung is sticking to the whole all day up to 40 hours estimate, so we're just gonna have to see. Alongside Wear OS 4, the Galaxy Watch 6 will launch with One UI 5 Watch and that's gonna come with a bunch of new updates like the ability to check sleep tracking details from the wrist, a new sleep mode, heart rate zones, and improved emergency SOS features. There's also going to be a new ThermoCheck app where you can use the infrared sensor to check the temperature of your surroundings. Like, bam, how cold is the pool water? That sort of thing. Plus, there are gonna be some other features that tie into Samsung products. For example, if you have a foldable, the watch becomes a remote control when you open the camera app. Would've been nice if it was for non-foldables, but it's just foldables for now. But you can turn the bezel and it zooms in and out, which is actually pretty fun. You can also use SmartThings Find to track down lost items from the wrist, and Samsung Wallet is also coming to the watch. We had Samsung Pay, but now we have Samsung Wallet. I do have some bad news though. Samsung is upping the price again. The regular Galaxy Watch 6 is gonna start at 299.99, while the Classic will start at 399.99. If you want the larger versions of both watches, it's gonna be an extra $30, and then if you wanna add LTE, you're just gonna have to add onto that too. This does make the watches more in line with the competition but it's never fun to see the prices go up. Overall, this is an odd year for Samsung watches because on the one hand, we get a new Wear OS, new software, a new chip, and bigger batteries. All together, that sounds like it ought to be a big change. But having played around with the watches, it all feels like something we've seen before, just slightly elevated. That's not a bad thing. Again, I am so happy that the bezel came back, but these gradual incremental improvements, it's something we're seeing across the entire wearable category. Companies have these big goals for down the line and very teeny tiny updates in the meantime. In any case, it's just a little bit weird that the thing I'm excited about for the new watch is an old thing that's coming back. Go figure. Wait, hold on. Bezels, bezels, bezels, bezels Rotating bezels Bezels, bezels, bezels, bezels That was our Samsung Unpacked hands-on for the Galaxy watches. We're getting review units in, so keep an eye on theverge.com.",
    "transcript_keywords": [
        "Galaxy Watch",
        "regular Galaxy Watch",
        "Watch",
        "Samsung",
        "Galaxy",
        "bezels",
        "Apple Watch",
        "bezel",
        "bezels Rotating bezels",
        "Rotating bezels Bezels",
        "biggest Galaxy Watch",
        "Classic",
        "rotating bezel",
        "regular Galaxy",
        "Galaxy Watch users",
        "Wear",
        "Apple Watch Ultra",
        "regular Watch",
        "Apple Watch Nylon",
        "watches"
    ],
    "transcript_entity_values": [
        "Polar",
        "16 gigabytes",
        "last year",
        "Classic",
        "Watch 6",
        "Android",
        "one",
        "49-millimeter",
        "Galaxy Watch 6",
        "15%",
        "40 millimeter and 44 millimeter",
        "three",
        "299.99",
        "UI 5 Watch",
        "LTE",
        "18%",
        "the Galaxy Watch 6",
        "43-millimeter",
        "Exynos",
        "up to 40 hours",
        "30%",
        "SmartThings",
        "SOS",
        "5",
        "47-millimeter",
        "Tizen",
        "the Galaxy Watch 5",
        "Coros",
        "an odd year",
        "Wear OS",
        "Wear OS 4",
        "Samsung",
        "the Apple Watch's",
        "two",
        "Galaxy",
        "all day",
        "one millimeter",
        "Rotating",
        "One",
        "Galaxy Watch",
        "Apple Watch",
        "this year",
        "399.99",
        "43 millimeters",
        "first",
        "Wear OS 3",
        "Samsung Wallet",
        "Bezels",
        "47 millimeters",
        "5ATM",
        "30",
        "RAM",
        "Apple Watch Ultra",
        "a ton",
        "Galaxy Watch 4 or",
        "two gigabytes"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "EVENT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "TIME",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "NORP",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY"
    ]
}