{
    "id": "jKi7xGE4BEw",
    "title": "The Impact Sprinkler - more clever than it seems!",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2020-07-30T14:58:22Z",
    "video_url": "https://www.youtube.com/watch?v=jKi7xGE4BEw",
    "category": "Science & Technology",
    "tags": [],
    "views": 1540363,
    "likes": 77394,
    "comments_count": 3659,
    "description": "It's that time again! Time to take a deep dive into the mundane to see what we can learn. Join me as we look at this sprinkler!  Here are some impactful links; Technology Connextras (the second channel that stuff goes on sometimes):  Technology Connections on Twitter:  The TC Subreddit   This channel is supported through viewer contribution on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. It's how I can make fun of products like these! If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!   And thank you to the following patrons! The New Universes Project, ShadowWolfy , Alex Groom, Blythe Hines, Brian Beck, Jack Conner, Billiam , LazySpoon, RangerMankin, Greg Lindsey, Robert Haynes, Zilverbolt Malproximate, David Nelson, Eli Youngs, Paul Hackett, Alex H., John Curley, Zeta Grey, Benjamin Dykstra, Dan Cortes, Vy-let Cybra, Joseph Fickus, Raymond Ernesto Coln, Luka Kovac, Mike Berman, Kay Ohtie, Cysioland, Pathite , Adam Jensen, Mr.Bright, Frode Hauge, Stu Kabakoff, Carmichael Keane See, Chris Jordan, Steven V, Brian & Laura, Brian Holder, Mindy B., Patrick Khl, NoFriendsThatSlav , PetesGuide, Jeremy Whaling, Sunshine Heart, VMRosetta, Christian Lwel, Nathan Walters, Rob C, Michael Yeo, Massimo Fierro, Grant Blayney, Jake Sanders, William McKinnerney, Elizabeth, Amy Cable, Rafael De Los Santos, heyitsleo , Paul Sutton, Timothy Dunn, Jack Alderson, Hunter Kennedy, Eric Kalenak, Lukas Svec, Mike Nichols, Roman , Ari Kestenbaum, Sean Harding, Bryan Helmig, Luis Calvo Mayo, Felix Huang, Blake Palacio, Jonathan Cotton, Isaac , Spencer Golde, William Willing, Pedro Soto, Matthias B, Tim Leidel, Vincent McBeigh, Ramon Perez, Xtr3m3 , Steve Fallon, Punkey , Sascha Strau, Scott Kuker, V. Legrand, Keith Hemenway, Andrew Eslick",
    "description_links": [
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "For whatever reason, Ive always been more than a little fascinated by things involving water. Particularly the devices we use to carry it around, distribute it, keep it away, or even just make it look pretty. Be it fountains, aqueducts, water towers, roofs, or even a plain ol pipe, theres a lot to whet your inquisitive appetite. Such as these things! Ah, the humble lawn sprinkler. The irrigating sound of summer. Impact sprinklers like these have been around for a very long time and Ive always been a little curious about them. See, the way they move back and forth is intriguing. An oscillating sprinkler like this guy makes total sense. Its just got a little water wheel in there that acts like a motor, robbing some of the kinetic energy of the flowing water to power a little gear train which makes the holey stick thing go back and forth. These dudes, though, well Im sure youve heard how in one direction they go all [tick tick tick tick tick tick tick tick] but in the other direction its more of a [tstststststststststststststs] Why does it speed up? And how does that make it go in the other direction? Well, I wanted to answer these questions for myself and also you because it turns out these sprinklers are downright fascinating, and for a bunch of reasons. Naturally, I have one right here. These sprinklers do that thing where their principle of operation is incredibly simple, but the design which makes it possible is visually complex. Lets start with where the water comes from. Hook a garden hose up to this bit and water will flow up into the sprinkler head (and, if you wanted to, out that way to another hose for another one down the line). Now obviously the head is designed to spin and its pretty easy to turn. But notice that it has a lot of vertical play. I can actually lift up on it quite a bit, and if I hold it in this position it becomes a bit harder to turn. When the sprinkler is being used, the water pressure forces the sprinkler head up against its stop, the effect of which is that it takes a fair bit of force to turn it. Youll see why thats important shortly. Next lets look at where the water comes out - its here, from this little brass nozzle. But notice how theres a thing in the way. This little armature sudden low-fi fast jazzy dance hall music (or something like that) Can you believe I didn't put a ton of jokes in this bit? This little armature serves to redirect the waters path. It will first hit this angled piece which throws it slightly to the left. But immediately after that it will hit this sort of scoop shape, throwing it back to the right and roughly on its original path. The armature isnt fixed, in fact it can move but a spring acts to return it to its resting position. When the water comes flying at the armature as the restriction in flow created by the nozzle causes its velocity to increase dramatically, the armature gets flung with a fair bit of force to the left. That force gets absorbed all nice and soft like by the spring, but of course the spring returns the favor and eventually flings the armature right back where it started. And by the time it gets there, its moving pretty fast. The energy the armature picked up as it was thrown to the left by the water never went away, instead it was just dampened and absorbed by the spring. The spring then works to push the armature back to its resting position, and once it gets there the stored energy gets released all at once in a momentous occasion. The sudden impact as it slams against the head imparts a fair bit of torque. Bringing a moving object to a sudden stop isnt exactly easy. Thats our friend Force equal Mass times Acceleration. When the armature is initially flung to the left by the jet of water, the total force (and thus, torque) generated isnt that substantial. It gets moving, or is accelerated, fairly slowly, and the opposing force of the spring (another source of acceleration) is also pretty weak and so happens over a fairly long period of time. But once it returns to its starting position, its moving at a relatively high speed and hits a solid barrier. The near instantaneous acceleration that results from this impact, multiplied by the mass of the armature itself, imparts a substantial amount of rotational force (or torque) on the sprinkler head. That knocks it slightly to the right, or clockwise. And this is where the resistance brought about by the lifting force of the water comes into play. With the sprinkler head forced against its stop, now we have to overcome friction to get it to move. While there is a counterclockwise force imparted as the armature is flung to the left (and as the spring resists that movement), the small acceleration component diminishes that force to the point that it cant overcome static friction. The upshot of this is that the sprinkler head can only rotate when there is a substantial peak force caused by an impact, which means it will only move clockwise. But of course, it can also move the other way. Just as your Auntie Clockwise! [awkward silence] That was a dumb joke, but in case you didnt know these dont have to change directions; you can make them just go in circles like most online arguments. If this little thing is flipped up, well then it will just go round and round and round and 'round. But flip it down and when it hits these little things (which are adjustable so you can control its range of movement) it will change directions at each end. How? Well, look at what it does. The action of moving the little directiony changey bit causes this small metal piece to move. And when its in this position, it limits the movement of the armature by catching it with this little tab. Now you might think this wouldnt do a whole lot, but it makes one significant change to the action of the armature. It changes when the impact occurs. Now, as before, the armature picks up speed from the jet of water throwing it to the left. But rather than have a nice and subtle spring slow it down and reverse its course, it slams right into the metal piece right away. That impact imparts pretty much the same amount of torque as before, but in the opposite direction. The energy the armature gains from the water pushing it to the left goes right into the sprinkler head, rather than into the spring as an intermediary. That high peak torque can overcome the static friction and nudge it to the left, or counter-clockwise. When its going in that direction, the impacts occur much more frequently because the spring is for the most part out of the picture, and the distance the armature can travel is quite small. Plus, thanks to that limited movement, the water jet now becomes not only a source of energy for pushing the armature to the left, but also a dampener when it returns. After making the impact, it will of course return to its resting position (partly because of the spring and partly just from bouncing off the tab thing), but it doesnt have enough speed to overcome the jet of water and so a second impact doesnt occur. Instead, the armature just gets pushed away again relatively gently, without enough acceleration to produce a torque which can overcome the static friction. Since the only impact occurs on its outward swing, the only movement generated is in the counterclockwise direction. And really, thats it! As far as I can tell these got their name solely from the fact their driving force comes from an impact. And theyre not the only device to use this principle. Ever heard of an impact wrench? These things, rather than just spin a socket with a plain ol motor, instead spin a large metal thing inside them called a hammer. And not, like, this kind. Its just called a hammer. That hammer, after its up to speed, periodically strikes an anvil which creates a large amount of torque as the energy from the spinning hammer is imparted into the stationary anvil. The socket is attached to that anvil, and so in effect gets struck in a twisted way repeatedly by the hammer. Its the same principle as using a high amount of acceleration to create a large amount of instantaneous torque. Because thats what it is. The distinctive sound of an impact wrench, either air driven or as is the case here cordless is the result of the hammer repeatedly striking the anvil, and this process is what creates the repetitive bursts of very high torque. [rapid, loud clicking/banging sound] In these sprinklers, though, its a lot more simpler and also just easier to see because you can actually see it. The impact of the armature also helps the sprinkler be a better sprinkler. See, the nozzle shoots water pretty far at a slightly upward angle giving it great coverage far from itself, but pretty lousy coverage right in front of it. As the armature slaps the stream of water like a curious racoon, it periodically disrupts the stream and gets some water close to home. When the direction changes, it gets even closer. And also, fun fact, many of these sprinklers are adjustable beyond simply their angle of sprinklage. You might have noticed this little set screw. Tighten that and this pin will enter the jet stream and break it up, reducing the effective range of the sprinkler. You can also achieve similar deflection with this little hat thing. A nice touch. These really are pretty versatile sprinklers, unless of course what you need to sprinkle isnt round. Like a cake. So the next time you hear the irrigating sound of an impact sprinkler, just remember that its really quite clever. And make no mistake, this is a technology. While I often focus on things like audiovisual equipment and other eletronicals, something as simple as a water distribution device deserves due diligence. Orton Englehart used human ingenuity to invent this thing back in 1933, and while it may seem like a simple and down-to-earth device, it is still full of lessons we can learn from it. Thanks for watching. impactfully smooth jazz But the design which makes it possible is visual When water comes flying at it as the restriction in flow created by the nozzle causes its velocity to increase dramatically [said mockingly] ...the armature isnt fixed, in fact it can move but a spring da di duppa dough And once it gets there, the that wasnt right. It gets moving, or is accelerated, fairly sssssssssssssssssss lowly. Bringing a moving object to a sudden stop isnt exactly easy. Thats our what was that? There was a noise. The distinctive sound of an impact wrench either.. air ugh You can control its range of movement. That I missed some words. You better believe I know what armatures are, now. Sometimes they're the spinny bit of a motor, other times they're the wire framework of a figurine or model. And other times they're offensive or defensive appendages on animals and junk. Like armor. But yeah, anyway, armatures.",
    "transcript_keywords": [
        "armature",
        "water",
        "Impact",
        "sprinkler",
        "sprinkler head",
        "force",
        "spring",
        "things involving water",
        "bit",
        "left",
        "sprinklers",
        "head",
        "thing",
        "pretty",
        "direction",
        "moving",
        "move",
        "torque",
        "makes",
        "things"
    ],
    "transcript_entity_values": [
        "Orton",
        "1933",
        "the spring",
        "a ton",
        "Clockwise",
        "The spring",
        "second",
        "first",
        "one",
        "summer",
        "Force"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "PERSON",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG"
    ]
}