{
    "id": "JLQAh6IHPc4",
    "title": "Magic Keyboard for iPad Pro review",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-04-20T13:00:14Z",
    "video_url": "https://www.youtube.com/watch?v=JLQAh6IHPc4",
    "category": "Science & Technology",
    "tags": [
        "magic keyboard",
        "magic keyboard review",
        "apple magic keyboard",
        "iPad Pro magic keyboard",
        "ipad pro",
        "ipad",
        "ipad keyboard",
        "Smart Keyboard",
        "apple keyboard",
        "keyboard",
        "new keyboard",
        "ipad laptop",
        "laptop",
        "apple",
        "apple laptop",
        "MacBook",
        "MacBook Pro",
        "review",
        "keyboard review",
        "apple review",
        "hands on",
        "price",
        "weight",
        "dieter bohn",
        "what to buy",
        "how to buy",
        "verge",
        "dieter",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "google",
        "iphone",
        "microsoft",
        "the verge"
    ],
    "views": 2155270,
    "likes": 31827,
    "comments_count": 2015,
    "description": "Apples new Magic Keyboard for iPad Pro makes it easy to turn a tablet into a laptop. But its expensive, heavy, and more limited than you might expect. Still, if you want to convert an iPad into a laptop, its the best option available.  Read the full review here:   Vox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. For more information, see our ethics policy here:   Buy the Magic Keyboard via Apple:   Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/3eFtAGO",
        "http://bit.ly/2TQsqjB",
        "https://fave.co/3eEEVqj",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "(upbeat music) - The new Magic Keyboard for the iPad Pro is a very well-made, very expensive add-on for this tablet. It has this backlit keyboard here and a track pad, finally, and when you open it up it sort of floats the iPad just so it ends up being a little bit closer to your eye holes. I am continually impressed with how well-built this thing is. And that is very good, since the 11-inch version costs $299, and this 12.9-inch version here costs 349. The Magic Keyboard though is just really well-executed. It does everything that it was designed to do. I'm just not totally sure that it was the right design in the first place. (upbeat music) But I wanna start out with what's great about this keyboard. It's the keyboard. The keys are scissor switches with a really solid feel, good travel, and a pretty decent thunk. I mean, give it a listen compared to the old Smart Keyboard for the iPad Pro. (keys clicking) It's not bad, right. Now the keys, they're not quite as stable as the brand-new Magic Keyboard on the 16-inch MacBook Pro, but whatever. These keys are great. I really enjoy typing on them, and they are backlit in in the dark. But you can't adjust the backlighting on the keyboard itself. You have to dig into the iPad Settings app, like way down in General. Now usually the keyboard lights are at the right brightness, so it's not too big of a problem, but if you wanna watch a movie or something, it's a real hassle to dig in there. And that hassle would've been solved if Apple had just included a function row of keys above the number row of keys. But it didn't, which is kind of annoying. But look, this keyboard is solid. There is no flex to it. It is incredibly stable when you open it up, and it also holds the iPad pretty securely too. It's hard to get it outta there. And I really like how it does lift the screen up and bring it a little bit closer to your face than other laptops do. That's not something that I realized that I wanted, but turns out I totally did. Plus, honestly it does just kinda look cool floating there. It does pass-through charging through this USB-C port on the side here, but you can't connect like data accessories to it. But that's nice, it still means that you don't have dopey charging cables hanging off the side of the middle here. The track pad is also really good. It's small by MacBook standards, but I had no problem getting used to it because I've used Surface laptops for a really long time. But this one is actually better than the track pad on Surface laptops because you can click anywhere on the track pad, and it'll still click. It's also really smooth. It just, it feels really nice. Now as far as track pad support on iPad OS goes, I said before that I think Apple basically nailed it. And it's better to have a track pad on a keyboard case now, so it's like much more convenient. And, unlike the bridge keyboard, everything on this track pad just works. The gestures for switching between apps are intuitive. I like how the cursor snaps to on-screen elements, to make them easier to click. And editing text is much better, mostly. Even though Apple has nailed it, a lot of other apps haven't. Google Docs is still a mess on the iPad. And there're a bunch of other apps that use non-standard UI elements that feel janky, like you can't swipe to archive stuff. Hopefully that gets fixed. So great, right? What's the problem? Well, there's a few. The first is weight. The Magic Keyboard is heavy. This 12.9-inch version when you've got it attached, the whole package weighs just shy of three pounds. That's 25% heavier than the 12.9-inch Smart Keyboard. It's heavier than the iPad Air. It's about the same weight as my MacBook Pro, my 13-inch MacBook Pro. But, it's actually thicker than my 13-inch MacBook Pro, which eh. Now I don't have the 11-inch version to test, but I think 25% heavier than the Smart Keyboard is like a safe bet. And, while the floating screen is great, the available angles on it are not. You could have it anywhere between 90 and 130 degrees, which actually isn't that much. Look, I'm just gonna make a comparison here. And we're just gonna sit with it together for a minute. This is my Surface Pro X. It runs Windows on ARM, and that's not great for many reasons, I know. But we're just talking about the hardware here. Now the screen on the Surface Pro X is about the same size. The track pad is about the same size. But the Surface here has a keyboard with a function row on it, and, if you want, you can put it at nearly any angle that you want, almost completely flat. And if you wanna watch a movie or something, you can flip the keyboard behind it. And it's thinner than the iPad Pro with the Magic Keyboard, and it's lighter. And, I don't know, the webcam is in the right place. It's a really good thing that everybody knows that these are different devices for different needs and different people so that there's no reason that the comparison between these two things that I just did is gonna cause any arguments at all. Here's the thing. This is a very well-made keyboard. And Apple made choices when they made it. They made a choice not to put a kickstand on the iPad itself. Fine. They made a choice about how this whole hinge thing would work, and if you agree with those choices, this thing is amazing. I'm just not sure that I do. I think that it's just a little bit limiting. The big story with the iPad over the past two years is whether it's a computer, or what kind of computer, or whatever. So look, I'm tired of that argument, but a lot of people are going to ask whether this Magic Keyboard makes the iPad a better computer. And I think that's the wrong question. The right question is whether this keyboard makes the iPad a better iPad. And well, my iPad Pro is, by far, the most versatile, do-anything screen that I own. I use it at my desk like a laptop, sitting in a chair just browsing around doing some light work, watching movies or reading in bed, as a second screen for my Mac using Sidecar, as a second computer next to my Mac when my Mac is chugging. I just need to listen to some Spotify or whatever. You can even now, with the track pad support, use the iPad as like a desktop computer with an external monitor with your track pad and your keyboard sitting in front of it. It can do a lot. Does the Magic Keyboard improve all those situation, or does it add more situations to that stack? Yeah. It works really well when you're at a desk, or you're working in a chair because it feels like a laptop. And honestly, my favorite feature of this keyboard case is that it makes it easier to just grab the iPad and walk away with it. So I love this keyboard case 'cause it helps me not use a keyboard case. But it's nice to use the iPad by itself. So honestly, since I've had this thing, this keyboard has sat on my desk most of the time. If you wanna turn your iPad into a laptop, there is nothing better for that than the Magic Keyboard. It is very well-made and expensive but maybe worth it for you. But to me, the iPad is great precisely because it does more than a laptop. It can do all of those other things. And the Magic Keyboard doesn't really help with most of those. It's kind of a one-trick pony, but, I have to admit, it's a pretty good trick. Let's just see. Let's just, let's just... (claps) Hey, what do you think, and thanks for watching. One of the things that happens when you record by yourself at home is you forget to record the end card, and your director, Vjeran, yells at you. So thanks for the reminder, buddy. Let me know what you think of the Magic Keyboard down in the comments below, and stay safe out there.",
    "transcript_keywords": [
        "Magic Keyboard",
        "Keyboard",
        "iPad",
        "track pad",
        "iPad Pro",
        "Pro",
        "Magic",
        "Smart Keyboard",
        "keyboard case",
        "MacBook Pro",
        "Magic Keyboard makes",
        "track",
        "pad",
        "Surface Pro",
        "brandnew Magic Keyboard",
        "Magic Keyboard improve",
        "Surface",
        "Keyboard makes",
        "thing",
        "Apple"
    ],
    "transcript_entity_values": [
        "Surface",
        "Sidecar",
        "one",
        "Apple",
        "the iPad Air",
        "Windows",
        "11-inch",
        "Spotify",
        "Vjeran",
        "The Magic Keyboard",
        "the Surface Pro X",
        "Magic Keyboard",
        "the past two years",
        "Smart Keyboard",
        "MacBook Pro",
        "the Magic Keyboard",
        "iPad",
        "the Smart Keyboard",
        "130 degrees",
        "UI",
        "25%",
        "16-inch",
        "the iPad Pro",
        "three pounds",
        "two",
        "The Magic Keyboard",
        "iPad Pro",
        "this Magic Keyboard",
        "One",
        "MacBook",
        "299",
        "iPad Settings",
        "second",
        "349",
        "13-inch",
        "Google Docs",
        "first",
        "Mac",
        "12.9-inch",
        "between 90",
        "a minute"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "EVENT",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "LAW",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "LAW",
        "QUANTITY",
        "CARDINAL",
        "WORK_OF_ART",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "FAC",
        "MONEY",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "TIME"
    ]
}