{
    "id": "JOE5FB4hXpc",
    "title": "Apple Arcade Preview on iPhone 11!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-09-16T16:04:50Z",
    "video_url": "https://www.youtube.com/watch?v=JOE5FB4hXpc",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "apple arcade",
        "iphone 11",
        "iphone 11 unboxing",
        "iphone 11 review",
        "xbox",
        "playstation",
        "apple tv",
        "apple tv+",
        "new iphone"
    ],
    "views": 473257,
    "likes": 13756,
    "comments_count": 1056,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and we're at Steve Jobs Theater right now. This is where the actually keynote happened. But right now, they're having a special hands on event for Apple Arcade. It officially launches on September 19th for $4.99 a month. They're gonna have hundred of titles by fall. But right now, we're gonna get a chance to check out some of the launch titles. So let's head in. First game we're gonna play is Gate City. I like your t-shirt. - Ah, thank you. (laughs) - Oh, we have three options. We have Barcelona, Oslo and Los Angeles. I'm gonna start with Los Angeles. I don't know how to play this, so I'm just figuring it out as I go. Okay, I figured it out already. I'm doing tricks like you would not believe. I used to love Tony Hawk Pro Skater. I used to play it on Dreamcast back in the day. This is incredible, this game is called Sneaky Sasquatch. Some of you guys might be new here but my sister and I used to do a show called, Squatch Watch. (upbeat music) Sasquatch squatch watch yeah Squatch Watch. So this is a very fitting game. If I were to make a game I feel like this is what I would make. This raccoon is talking to me. He wants to talk to me. If he sees us we'll be in big trouble so let's practice. - [Guy In The Background] Get out of my way kid. - This is so amazing. He's sneaking. Okay, sorry. Oh, no, I'm getting in trouble. - What we're doing here is essentially trying to line up these little square shapes. By doing that we'll get this circle that's going around to actually touch it and get us to the next level. - There it is. - [Man] There you go. - Okay, we're at the next level. - [Man] Nice. - Okay, that's really fun. - [Man] Yeah. - (gasp) The Lego Game, we have to play the play, oh my goodness (gasp) Okay, this is super exciting. You guys may know that I'm a huge Lego fan. No, I've died already. No, I don't die. Okay, I didn't die. - [Guy In Background] Can I use this? - [Woman In Background] Yeah, go for it. - Oh! Oh, my gosh I'm out. I've died, I've died. So that's Lego Brawl. I absolutely love Lego and I love everything that Lego is doing to push Lego into the next generation of digital. Let's see what else they have here at the Apple Arcade. (upbeat electronic music) Oh, this is fun. Oh, I was going the wrong way. Oh my gosh, this is so cool. I love this, it's so cool because you're kind of using the gyroscope to actually make the controls. So where you point the iPad, that's where you go. There's a trampoline. Am I supposed to be doing parkour? I definitely think that I am. (ding) (ding) Oh, this is cool. - [Man In Background] Race very fast. Fail spectacularly, avoid all the traffic. - Cool, all right, I'm getting the hang of it. This is like me in L.A. down the 405 to the 10. One of the cool things of Apple Arcade and also iOS 13 is you can actually connect a controller. So right now, we're playing the Apple TV version and I'm gonna be using an Xbox controller to play on Apple TV. I'm kinda speechless. We're playing The Impossible Road. So I've never played this before and I feel like I'm doing quite well for my first time. Oh, gosh, whoa boy, things are happening. I think I've taken a short cut or I may have fallen off the track. I'm a champion. Does somebody else wanna play? So obviously you can play on iPad on iOS on Apple TV, but you can also play on Mac. So let's not forget, there are Mac gamers out there. I was one of them. Oh, my gosh, I remember when Unreal Tournament came out for Mac. It was like, I'll have to double check what the year was but it was a long time ago and it was the most exciting thing for me. And now, here we are with Apple Arcade. I am using a PlayStation controller playing on a Mac. Look, at the little doggie. It's Maddie. - [Girl In Background] You can take the dog with you if you really want it (laughs). - [Justine] No, I definitely do. So do I take him. - [Girl In Background] Yeah, so now that means to meet it you can invite. - [Justine] Puppy oh my gosh, yes, I'm taking him with me. Okay, so me and the dog are getting in the car. - [Girl In Background] So now hit escape. - We're escaping. Things are going very well. I'm in the car, Bobby's in the car, we've escaped. He's injured, oh, you poor thing. Oh, we're both injured. We need to get healed up. I'm using a PlayStation controller while playing on a Mac. I was just using an Xbox controller while playing on an Apple TV, this is the future. We had so much fun playing games here. This is Jenna, my sister, if ya didn't know. She's always in my videos. - Hi, we're awkwardly sitting in a chair. - We are. - So if it looks awkward, 'cause it's super awkward. - So what was your favorite game that you played? - I really enjoyed the Sneaky Sasquatch. It was so cute and we love Sasquatches. - Squatch Watch. - And the skater game because I absolutely love skating. - It's just crazy because there's gonna be so many games. And it's cool because you can play on your iPhone, your iPad, your Apple TV and you can use a controller. Like that is still something that is kind of shocking to me. I loved playing the Hot Lava game which was actually kinda cool 'cause you use the accelerometer. So you're kind of actually moving around in the space. I wish that we could have played them all but we didn't get to but. - Good news is that we can play soon. - I was just gonna say, it's gonna be out soon. - Yeah, we'll have enough time. - If you think I'm talking fast it's because we have to head to the airport now. - We do, we have to go. - Let's play one more game and roll out. So this is cool. In the keynote, they mentioned that all of the audio that they record in this game, they actually did record it under water. That is something that I would like to see of how they did that. And that's it. That was just a quick look at Apple Arcade. There's gonna be so many more fun games coming out and I cannot wait. So, you guys wanna see more game play, leave me a comment, subscribe, like, hit the bell. And I'm gonna walk up these magical steps. (upbeat electronic music)",
    "transcript_keywords": [
        "Steve Jobs Theater",
        "Steve Jobs",
        "Jobs Theater",
        "Apple Arcade",
        "Apple",
        "play",
        "game",
        "Squatch Watch",
        "Lego",
        "cool",
        "Arcade",
        "Justine",
        "Mac",
        "Steve",
        "Jobs",
        "Theater",
        "playing",
        "Los Angeles",
        "controller",
        "love"
    ],
    "transcript_entity_values": [
        "iPad",
        "one",
        "Apple TV",
        "4.99",
        "Gate City",
        "Bobby",
        "Justine",
        "Sneaky Sasquatch",
        "Apple Arcade",
        "405",
        "Squatch Watch",
        "Mac",
        "Barcelona",
        "Dreamcast",
        "iPhone",
        "three",
        "PlayStation",
        "Oslo",
        "the day",
        "Apple Arcade",
        "13",
        "Lego",
        "Los Angeles",
        "hundred",
        "September 19th",
        "Xbox",
        "the year",
        "Justine]",
        "Maddie",
        "Lego Brawl",
        "Hot Lava",
        "The Lego Game",
        "The Impossible Road",
        "L.A.",
        "Steve Jobs Theater",
        "10",
        "first",
        "Tony Hawk Pro Skater",
        "Mac",
        "First",
        "the Apple Arcade",
        "Jenna",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "LOC",
        "PERSON",
        "PERSON",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "DATE",
        "FAC",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "FAC",
        "PERSON",
        "CARDINAL"
    ]
}