{
    "id": "jPm4ouSR_NI",
    "title": "Google Pixel 6 and 6 Pro review: flagships found",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-10-28T16:16:46Z",
    "video_url": "https://www.youtube.com/watch?v=jPm4ouSR_NI",
    "category": "Science & Technology",
    "tags": [
        "pixel 6",
        "pixel 6 pro",
        "pixel 6 review",
        "google",
        "google pixel 6",
        "google pixel 6 pro",
        "pixel",
        "pixel 6 unboxing",
        "pixel fall launch",
        "pixel 6 camera",
        "pixel 6 size",
        "google phones",
        "iphone 13",
        "iphone 13 pro",
        "pixel 5",
        "google pixel 5",
        "pixel 5 review",
        "pixel 5 camera",
        "pixel event",
        "facebook pixel events",
        "facebook pixel event setup",
        "pixel event live",
        "best phones",
        "phone review",
        "phone reviews",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 412325,
    "likes": 9060,
    "comments_count": 861,
    "description": "Googles new Pixel 6 and Pixel 6 Pro are a reset of its smartphone ambitions, and they have new designs, new processors, new cameras, and new capabilities. They are some of the best phones you can buy right now.   If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:   You can get the Pixel 6 here:    Articles mentioned: WSJ article on Real Tone image:   Wired review:   Read our full review:    Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2TQsqjB",
        "https://amzn.to/3nvX0ME",
        "https://on.wsj.com/3mk9He6",
        "https://bit.ly/3BoviGo",
        "https://www.theverge.com/e/22514428",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- All right, you've been patiently waiting. It's finally here. Let's review the Pixel 6 and the Pixel 6 Pro. The Pixel 6 and 6 Pro are a big deal for Google. They're the company's first attempt at making a high-end phone in quite a few years. And then the first phones with Google's new custom Tensor processor, which powers AI and ML, and lots of hopes and dreams, I guess. It's also finally updating the camera's hardware after years and years of using the same old sensor in Pixels. These phones are also just big. I mean, just look at these things. They're not small phones. If you're coming from Pixel 5 or Pixel 4, it's going to take some adjustment and maybe some bigger pockets. Also big, that camera bar that's houses these new sensors. Like Becca said in our hands-on video, it's absolutely massive. But at least the phone doesn't rock on the table when you put it down because the bar spans the back of the whole thing. The Pixel 6 starts at $599. It comes with 128 gigs of storage, 8 gigs of RAM, and has a standard wide and ultra wide camera. It has a flat 6.4 inch screen with a 90 hertz refresh rate and an 8 megapixel front-facing camera. Now, depending on how you buy it, it will support either basic sub-6 5G or the fast but really hard to find, millimeter wave 5G. If you're getting it unlocked or from T-Mobile, you can expect sub-6. If you're getting it from Verizon or AT&T, you're going to be paying a little bit more, but you'll also get millimeter wave. Now, the Pixel 6 Pro starts at $899. It also comes with 128 gigs of storage, and it has 12 gigabytes of RAM, and it adds a 4x Telephoto camera alongside that wide and ultra wide camera that are on the regular Pixel 6. It's got a 6.7 inch screen with a variable refresh rate of up to 120 hertz and it has curved sides. Now, the front camera on the 6 Pro is 11 megapixels and has a little bit wider field of view. You might be able to fit an extra friend in a selfie. And you don't have to worry about any of the 5G shenanigans with the 6 Pro. No matter how you buy it, it will support both sub-6 and millimeter wave 5G. Now, the Pixel 6 comes in two-tone black, green or red. The Pixel 6 Pro is available in white, black or a yellowish gold. And between them, the 6's color options are way more fun, but whatever, you're gonna wanna put a case on these, and that's a good idea because they are both big, slippery bars of soap. Now I've had both models slide off my desk, table, sofa arms, my lap, you name it. Plus, I've nearly dropped them more than once. We even managed to crack one of our review samples. Even though these have Gorilla Glass Victus on the front, you could still break them easily enough, so you're gonna wanna get a case. And when I first got my hands on these Pixels, I really wasn't so sure about this design. From the front, it's hard to tell them apart from the Samsung Note 10 or Note 20. And from the back, they kinda look like TCL phones to me. And after a couple of weeks, the design really hasn't grown on me. Sure, they feel nice and premium in ways that prior Pixels didn't, but they lack some of the whimsy and fun that the older models had. All right, let's get into the meat of this. How do these new Pixels perform? The answer, very, very good. There's very little to complain about with either of them. Both screens are punching colorful. They're bright enough to read in sunlight and the faster refresh rates make the interface smooth when you're scrolling around, especially on the Pro. If you look closely, you can find some issues. Like if you look from an extreme angle, you might see some color shift, or if you're using the Pixel 6 Pro, there might be some visible shadow under light screen areas where the curves are. But you have to look really closely to find these things. And in fact, it's really even hard to show you them on video. They don't really interrupt my day-to-day use. And frankly, I don't have a problem with any of these screens. They don't have any weird bugs or issues like a color cast in low brightness or flickering, or really bad color reproduction that we saw on older Pixel phones. Now, the Tensor chip performed just as great as other high-end Android phones, whether I was launching apps, multitasking, navigating the UI or whatever I happen to do. It's not gonna run benchmarks as fast as Apple's latest chips, but it's miles ahead of the processor that was in last year's Pixel 5, and totally competitive with Snapdragon 888. Also, great battery life. Both phones were able to last a full day of heavy use with plenty leftover in the tank. Most nights I was plugging them in with 35 to 40% battery left. If you're a light user, I could easily see you go in two days with this. Now, a lot of that has to do with the fact that these have big batteries in them. They're big phones with big batteries. It's a big mood. But either way, the problems that Pixels had with battery life years ago are firmly in the past. Now, on charging, both models support wireless and fast wired charging. But neither come with an actual charging brick, so it's BYOB or bring your own brick. They also do reverse wireless charging for things like wireless earbuds. They both have loud, clear stereo speaker. - [Voiceover From Phone] Pods, and for first time since the original pair back in 2016. - And in something that matters a lot to me, they've got really nice haptics. Bad, buzzy haptics can just ruin the experience on a phone for me. But Google nailed it here. They're soft and clicky with just the right amount of feedback. But where the Pixel 6 and 6 Pro really dropped the ball is with their under-screen fingerprint scanner. (gentle music) It's in a comfortable spot. It's about a third of the way up from the bottom of the screen, but it's just slow compared to others. And sometimes it needs a few scans to recognize my fingerprint. There's also no facial recognition here. So this is the only biometric security option you got. And frankly, it could be a lot better. As you'd expect, the Pixel 6 pair run Google's latest version of Android, the completely redesigned Android 12. Now for the most part, I like it. It's very legible. The animations and design elements are fun and whimsical, and it mostly stays out of my way when I'm using the phone. It's like Google put all the fun in the software this time, as opposed to putting it into the hardware design. There are a few Pixel 6 specific tricks that are worth talking about though. And the most significant one for me is in the phone app. The Pixel 6 can make life a lot easier for you when you're calling automated phone tree systems and it can even wait on hold for you. The phone tree system attempts to transcribe what's being said, and it provides you with easily tappable buttons. So you don't have to sit there listening intently the entire time a robot is speaking to you. But it's still very clearly in beta, and it misses a lot of the words in the context still. Hopefully, this gets better over time. Another thing enabled by the Pixel 6's Tensor processor is faster, more accurate dictation, which is convenient to use, but will be a lot more useful when Google figures out how to get it onto a smartwatch. Those features, plus some photo stuff we'll get into, I promise I have not forgotten about the camera, are the main benefits of Google's custom Tensor processor. They're not an AI revolution, but that's okay because I'm not ready for the robot overloads yet. Lastly, Google says it will be supporting the Pixel 6 and 6 Pro for five years, which is a lot longer than the typical Android phone gets. But that's only referring to security updates. Google's only committing to three operating system upgrades over the lifetime of the phone, which means that Android 15 will probably be the last upgrade that these get come 2024. (bright music) All right, it's time to get into these cameras. These new cameras are a big deal because like the phones, they are big. These are just huge sensors. They're also a big deal because this is the first time since 2017 that Google has put new hardware inside of a Pixel camera. And the main camera in both phones is the new giant 50-megapixel sensor. It's hard-coded to produce 12.5 megapixel images. It's set behind an f/1.85 aperture lens, and it has optical image stabilization. Next to that is a 12-megapixel ultra-wide camera. That's 114 degree field of view and f/2.2 lens. Now, sadly, this does not have any macro or close-up focusing ability like you can get on the iPhone 13 Pro and lots of other phones, but it does have optical stabilization. And finally, on the 6 Pro, you get a new 4X Telephoto 48-megapixel camera that spits out 12-megapixel images. It's got an f/3.5 aperture lens and has optical stabilization. Of these cameras, by far, my favorite is the Telephoto camera. It's the first Telephoto on a phone that I've actually enjoyed using. It's got longer reach than you get on an iPhone 13 Pro and has better compression and subject separation so I don't need to use portrait mode nearly as much. It's also way sharper and more usable everyday than Samsung's 10X camera. And thanks to Google's algorithms, you can zoom digitally up to 20X and still have a mostly usable picture. Seriously though, I was on the road to choosing the Pixel 6 between the two of these, but that Telephoto camera, it's pretty great. The new main camera is excellent, too. It's classic Pixel, high contrast, moody looks, with lots and lots of detail in both good and low light. It's very competitive with the best from Apple. I'm not gonna declare either one to stand out winner. Some shots look better from the iPhone, some shots look better from the Pixel, but both are very good. And as we've been seeing for a few years now, which one you prefer really comes down to your own personal tastes. But if there's one area that I would like to see improvement from Google on, it's how long the Pixel takes to capture night mode shots. A lot of times you'll be standing there holding the phone for multiple seconds at a time to finish the capture, which can be a problem when your subject is moving around, or you're just not patient enough to wait for it. A lot of times, the iPhone would take half as long to capture the same night mode scene. Now, the ultra-wide camera is good, but it's clearly the weakest of the bunch. It's got softer details, noticeable distortion. I think it's safe to say the iPhone has Google beat here. The iPhone has also always consistently beat Google with video capture. And this year, yeah, that's still the case. The Pixel 6's video is a lot better than older Pixels, but it's still wonky with image stabilization and has some weird color processing that's very different from how Google processes still photos. Their reds and oranges and any highly saturated colors in particular look way oversaturated in the video. But you can easily record 4K, 60 FPS video for as long as you want without it overheating, which is a big improvement over the Pixel 5A from earlier this year. Google is making a big deal this year by how it's adjusted its image algorithms to work better for darker skin tones. And it's great to see the company addressing this problem that's long plagued the photo industry. Now, both Nicole Nguyen at WSJ and Julian Chokkattu at Wired we're able to test the camera with a wider range of skin tones, and came to some really interesting conclusions. I encourage you to check their articles out. We're gonna link them below. And if you look at the older photos, it's clear that Pixel is still doing Pixel things. It's high contrast with a dose of overexposure to compensate for it, and very sharp details. Some folks might like that look, but not everyone will, even if you have darker skin. Lastly, it wouldn't be a Pixel camera with a couple of neat software tricks that make hard things a lot easier than they used to be. The first is magic eraser. It lets you move distracting people or objects from your photos that you just don't want there. It's a fun trick, but it can be really hit or miss. This isn't gonna put any skilled Photoshop editors out of work. You can also get very similar results from third party apps so it's not totally necessary to buy a Pixel for this. But the thing that really impressed me was the new motion capture mode, which lets you mimic a panning shot or a long exposure with a single snap of the shutter and no tripods or neutral density filters or extra equipment involved at all. These are things that take years of practice and lots of equipment to capture with a traditional camera, and the Pixel makes it as easy as snapping a selfie. I love it. We're gonna be doing a lot more with these cameras, too. Becca is gonna be comparing them head-to-head with the iPhone 13 Pro in the next episode of \"Full Frame,\" so be sure to stay tuned for that. (upbeat music) Okay, so that's a lot of stuff. What's the takeaway here? Well, the takeaway is that the Pixel 6 and the Pixel 6 Pro are excellent devices, and among the best phones you can buy right now. In fact, I'd say that they're the best Android phones full stop. They have a great value. The Pixel 6 in particular, offers a lot of phone for $600. And there's no showstopping bugs or issues to be worried about. If you could deal with the fact that they are just giant phones, you're probably gonna be happy with them. Now, if you're trying to decide whether or not that $300 extra for the 6 Pro's worth it? That's a tough call. I really prefer the regular 6's flatscreen and slightly smaller size, but I know I'd miss the Telephoto of the 6 Pro if I went without it. At the end of the day, it feels like Google really did it this time. It's produced flagship competitive phones without any glaring issues or omissions, and it's priced them under the competition. Okay so, what are you getting? Fast speeds, competitive prices, an excellent camera plus that Telephoto on the 6 Pro, some of the best software you can get on a phone anywhere, and great battery life. What happens when Google tries to make an excellent phone? Is it ends up making an excellent phone. The apps, so it's not totally necessary to. My background fell down. There's another gadget that we've been waiting years for, new MacBook Pros, so be sure to check out our video on those. And now you can watch any of our videos on any popular Smart TV platform, whether you got Roku, Android TV, or Apple TV. So go check out the Verge app there.",
    "transcript_keywords": [
        "Pixel",
        "Pro",
        "Google",
        "camera",
        "Pixel camera",
        "phone",
        "phones",
        "Pixels",
        "lot",
        "big",
        "older Pixel phones",
        "Telephoto camera",
        "Pixel phones",
        "Telephoto",
        "Android",
        "Android phones",
        "years",
        "year Pixel",
        "time",
        "Pixel things"
    ],
    "transcript_entity_values": [
        "90",
        "Android",
        "128",
        "three",
        "120 hertz",
        "Nicole Nguyen",
        "12.5 megapixel",
        "5",
        "years ago",
        "a few years",
        "the end of the day",
        "300",
        "Pixel",
        "ML",
        "Android TV",
        "the Pixel 6 Pro",
        "UI",
        "BYOB",
        "2024",
        "50-megapixel",
        "6",
        "Pixels",
        "Tensor",
        "a couple of weeks",
        "Pixel 6",
        "RAM",
        "millimeter",
        "Pixel 5",
        "6.4 inch",
        "Android 15",
        "third",
        "599",
        "multiple seconds",
        "quite a few years",
        "4x",
        "35 to 40%",
        "Verge",
        "Google",
        "2017",
        "about a third",
        "12-megapixel",
        "Telephoto",
        "Photoshop",
        "hertz",
        "Samsung",
        "600",
        "this year",
        "first",
        "MacBook Pros",
        "two days",
        "Roku",
        "earlier this year",
        "the Pixel 6's",
        "48-megapixel",
        "Pixels",
        "AT&T",
        "T-Mobile",
        "AI",
        "8",
        "Becca",
        "2016",
        "8 megapixel",
        "13",
        "Pixel 5",
        "4",
        "Julian Chokkattu",
        "Smart TV",
        "Android 12",
        "the Pixel 5A",
        "11 megapixels",
        "12 gigabytes",
        "Pixel",
        "one",
        "five years",
        "Apple",
        "the 6 Pro",
        "Snapdragon 888",
        "Pixel 6",
        "60",
        "years",
        "114 degree",
        "half",
        "Apple TV",
        "two",
        "899",
        "Verizon",
        "6.7 inch",
        "iPhone",
        "WSJ",
        "last year's",
        "10 or Note 20"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE",
        "EVENT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "ORDINAL",
        "MONEY",
        "TIME",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "FAC",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "EVENT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "GPE",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL"
    ]
}