{
    "id": "JrJQAhA_E1Q",
    "title": "Apple’s new Contact Poster feature for iPhone calls",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-07-04T14:41:28Z",
    "video_url": "https://www.youtube.com/watch?v=JrJQAhA_E1Q",
    "category": "Science & Technology",
    "tags": [
        "apple",
        "iphone",
        "ios",
        "ios 17",
        "mobile",
        "apps"
    ],
    "views": 80113,
    "likes": 2058,
    "comments_count": 48,
    "description": "When you set a Contact Poster, you choose a photo of yourself that fills an iPhones entire screen along with the font that displays your name. The vibe is very similar to the customizable lock screens added with iOS 16.  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "This is what your friends will see when you call them on iOS 17. What depth, what full screen, and what a way to say \"Answer my call.\" These are Contact Posters, and they'll be available on iOS 17, which is the next big update from Apple, and it'll drop this fall. They're customizable cards that look a lot like the lock screens on iOS 16. You make your own poster by picking a photo or your Memoji. Portrait photos get this nice depth effect, and you can customize your card with different fonts, filters, and colors. So once you set it up and call a friend who has an iPhone with iOS 17, that's what they'll see. This feature's still in beta, so the final product might look a little different. You can also make custom cards for your friends if you want total creative control over how they show up on your phone. And, if you're feeling kind, you can even make one for the Android users in your life. That's so sweet. So the question is: Do you use an actual photo of yourself, or do you get creative and hope your friends pick the Contact Poster you made for yourself instead?",
    "transcript_keywords": [
        "iOS",
        "call",
        "Contact Posters",
        "poster",
        "update from Apple",
        "friends",
        "Contact",
        "Answer my call",
        "make",
        "Answer",
        "depth",
        "Apple",
        "cards",
        "photo",
        "full screen",
        "creative",
        "Memoji",
        "Posters",
        "screens on iOS",
        "lock screens"
    ],
    "transcript_entity_values": [
        "17",
        "this fall",
        "iOS 16",
        "Android",
        "iPhone",
        "one",
        "Contact Posters",
        "Apple",
        "iOS 17",
        "Memoji"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "EVENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "EVENT",
        "PERSON"
    ]
}