{
    "id": "JrkcNAgJkes",
    "title": "I Broke My First Foldable [Into The Fold Episode 6]",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-12-11T23:31:40Z",
    "video_url": "https://www.youtube.com/watch?v=JrkcNAgJkes",
    "category": "Science & Technology",
    "tags": [
        "moto razr 2020",
        "motorola razr 5g",
        "razr review",
        "into the fold",
        "foldable phone",
        "folding display",
        "folding screen",
        "broken foldable"
    ],
    "views": 439817,
    "likes": 21377,
    "comments_count": 1659,
    "description": "This is a video that I never wanted to make, but lets be honest: it was inevitable. MrMobile has officially broken his first folding phone, and of course, its the one Michael Fisher bought with his own money.  On this episode of Into The Fold: what happens when you wreck your Motorola RAZR 5G (2020)  and why its not a reason to distrust either Motorola or foldables in general  because my Razr didnt break the way you might think.   [SUBSCRIBE TO MRMOBILE]     [ABOUT INTO THE FOLD EPISODE 6: R.I.P. RAZR 5G]  This is the sixth in a series of episodes exploring the many facets of life on a folding screen. From the best foldable phones of 2020 to the bleeding-edge world of folding-screen laptops, Into The Fold is MrMobiles showcase for the most exciting movement in mobile technology since 2007!   Episode 6, a list of lessons learned from MrMobiles first broken foldable, was produced following 40 days with a Motorola Razr 5G / Motorola Razr 2020 retail unit purchased by Michael Fisher. Motorola sent two Razr 5G / Razr 2020 cases for inclusion in this video, but neither Motorola, Chase, nor any other company paid a fee or otherwise offered compensation in exchange for this coverage, nor did any company preview or approve this content before publication.    [LINKS]  Razr 5G / Razr 2020 Cases [Motorola]:   Moto Care [Motorola]:   The 8 Best Cell Phone Insurance Providers of 2020 [LifeWire]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford Future plc a commission should you make a purchase. This does not affect MrMobiles editorial content. See Future's disclosure policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #intothefold #razr5g #razr2020 #razr #motorola #foldingscreen #foldingphone #foldable #foldablephone #foldablescreen #fold #flipphone",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "https://www.motorola.com/us/razr-5g-cases",
        "https://www.motorola.com/us/moto-care",
        "https://www.lifewire.com/best-cell-phone-insurance-4584059",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.futureplc.com/terms-conditions/",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- This is not a video I ever wanted to make, but, if we're honest, I guess it was kind of inevitable. I broke my first folding phone and in a particularly egregious case of a bad hair day, it's one of the only ones I've spent my own money on. On this episode of \"Into The Fold,\" what happens when you wreck your razr. And why it's not a reason to distrust either Motorola or foldables in general. Because this phone didn't break the way you might think. (upbeat music) All right, so here's how it happened. I'm walking along, enjoying my Sunday. I got my Frankel's breakfast sandwich in one hand, my razr in the other, staying mobile. And I just drop it, man. (chuckles) Literally, it just falls out of my hand for no discernible reason other than maybe my hand is cold, crashes to the sidewalk in a horrible murder scene. In fact, it was so brutal that the barista here gave me a coffee on the house because she felt bad. Thank you, by the way, Cotter Barber and coffee shop. But the phone was destroyed. She asked me what the damage was and it was kind of like that scene from \"Armageddon.\" - What kind of damage? - Damage? Total, sir. - At least on the outside. The Gorilla Glass 5 backplate got a cracked corner, while the same material upfront was totally shattered. The impact pulverized enough glass to expose the touch controller for the Quick View display and also broke that display itself. The only thing that's not broken, despite the fact that it fell while open, is the folding screen on the inside. Yes, we will come back to that. So, yeah, pretty terrible start to a Sunday. It's been a while since I broke one of my own phones. Normally, they're review devices. Anyway, as I sat here tweeting and texting and making full use of my fully functional foldable screen, I started going through my options. Despite five years of encouraging customers to get insurance on their phones back when I sold them, I didn't have any on this one. So knowing I'd have to pay for a repair, I started making phone calls. And from the big corporate chains like uBreakiFix, to the independent shops in Brooklyn, nobody offered repair on the new razr. You guys don't repair on the razr 2020, right? - No. - No dice? Okay. Do you know anybody who does? - [Repair Shop Attendant] None at all. - Okay. - Okay. - See ya. Should say, \"We fix some phones.\" Only one shop I called said they might be able to do it, but the guy seemed confused about which razr I was talking about, and I wasn't about to go all the way across the city just to be told they thought I was talking about a decade old Droid. This is something you unfortunately just have to keep in mind when you're buying a low volume device. (gentle upbeat music) So, I decided to go right to the source. Once I got past Motorola's repair portal thinking I was in Kansas and then telling me there were no service locations in the entire U.S., it was actually pretty straight-forward. I logged in, told it which of my devices I was trying to repair, and somehow totally missed the how much will it cost bit, here. The part where it says dropping a fragile phone on cold concrete like a dumb dingus is a replacement, not a repair situation. That might've saved me the sticker shock when I saw that a replacement razr would cost me about the same as a new razr, about a thousand bucks. Now, again, I don't blame Motorola for this. The damage is on me. The refusal to use a case is on me. The lack of insurance is on me. But just before I gave up all hope, I was speaking to my friend David Imel about how I bought this thing, and he reminded me that sometimes credit card companies don't care whose fault it was. You see, I bought the razr with my Chase Visa card, which has a protection plan that can reimburse you for loss, damage, or involuntary and accidental parting, as the legalese goes. Assuming you bought the product within the past 120 days. So I called up Chase, after at first getting one digit of the number wrong and having an exciting mini-adventure. - [Woman] Do you want something very special? Something you find hot? No restrictions, no rules, right now. - Credit companies have changed since I was a kid. - [Woman] And feel the pleasure. - I started the claim process by submitting forms online. But then Chase emailed me to say it needed more forms. And then I was told that I needed to go back to one of those repair shops to get someone to sign a document saying how much it would cost to repair. (groans) At publication time my claim is still pending approval, but it looks like I'm gonna get about 500 bucks. Sure, It's only half the cost of the phone. But $500 for a screw up that was my fault? I'll take it. And I'm ordering my new Liquid Mercury razr as soon as I see another holiday deal pop up. Let me know in the comments or on Twitter if you see one. Now, I did reach out to Motorola to make sure there wasn't a repair option I was missing. But while the company did send over some lovely cases as a kind of sympathy donation, thank you, Motorola, ironically, the only special support options for the razr concern the one component everyone expects to fail, the folding display. Folks, you are going to see this story shared and blog posts and quote tweets, and even people leaving comments on this very video without first having watched the video, if you can believe that? And they're gonna say things like, \"Well, this is just another example of foldables \"not being ready for prime time.\" (sighs) I would encourage those folks to consider this. All the damage this phone sustained in its drop would have been sustained by a slab phone made of the same materials. In fact, the only thing that's not damaged, the risk of repeating myself, is the foldable part. So we know what lesson not to take from this, let's review a few that we should take to heart. One, phones and concrete don't mix. So be careful. Two, if you're clumsy, be safe, and wear a case. And three, get insurance. You'll regret not having it when you have to pay for the same phone twice. I'll link a nice write-up I found on the best insurance for unlocked phones, but your wireless carrier may also offer an option for you. And manufacturers of folding phones have their own programs. Motorola does offer several extended warranty options that they charge between 35 and $400 for, which you can activate up to 30 days after purchase. Yeah, I just missed it. And Samsung has similar offers, including screen replacements on its foldable products for a fee. My final thought here. Well, I'm obviously sad this happened to my favorite clamshell. The Liquid Mercury lining is that it vindicates why I make this series in the first place. \"Into The Fold\" is all about long-term foldable usage in the real world, the highs and the lows. So I will continue to use every folding screen I can get my hands on for as long as I can keep hold of it. And I'll keep taking you along on every step of the way. Please subscribe to theMrMobile on YouTube so you don't miss future installments of \"Into The Fold.\" The subject of this video was a retail razr 5G unit purchased by me, Michael Fisher. While Motorola did provide comment and these cases on the house, it certainly didn't commission or otherwise compensate me for this video. That'd be a really weird PR strategy. And the same goes for Chase and everyone else mentioned. This video is not sponsored, the opinions are my own, and Motorola is seeing it right alongside you for the first time. Until next time, thanks for watching. And if you can't stay home, then at least stay safe and mask up while you stay mobile, my friends.",
    "transcript_keywords": [
        "razr",
        "phone",
        "Motorola",
        "repair",
        "phones",
        "damage",
        "video",
        "Chase",
        "folding",
        "kind of inevitable",
        "kind",
        "Liquid Mercury razr",
        "Motorola repair",
        "past Motorola repair",
        "foldable",
        "Fold",
        "Liquid Mercury",
        "cost",
        "screen",
        "insurance"
    ],
    "transcript_entity_values": [
        "2020",
        "about 500 bucks",
        "Into The Fold",
        "Michael Fisher",
        "Armageddon",
        "Brooklyn",
        "Samsung",
        "Chase",
        "only half",
        "400",
        "YouTube",
        "500",
        "up to 30 days",
        "Motorola",
        "Chase Visa",
        "Cotter Barber",
        "first",
        "One",
        "Sunday",
        "U.S.",
        "about a thousand bucks",
        "Frankel",
        "five years",
        "Only one",
        "5",
        "Kansas",
        "Liquid Mercury",
        "David Imel",
        "the Quick View",
        "Two",
        "Twitter",
        "three",
        "one",
        "the past 120 days"
    ],
    "transcript_entity_types": [
        "DATE",
        "MONEY",
        "WORK_OF_ART",
        "PERSON",
        "WORK_OF_ART",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "GPE",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "PERSON",
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE"
    ]
}