{
    "id": "JrkhC9GFyt0",
    "title": "PS5 Pro Controller - DualSense Edge",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-08-23T21:08:43Z",
    "video_url": "https://www.youtube.com/watch?v=JrkhC9GFyt0",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 181450,
    "likes": 5167,
    "comments_count": 354,
    "description": "PlayStation has officially announced their PS5 Pro controller, the DualSense Edge! The Weirdest BANNED Tech:  I'm Stealing This - ASUS ROG Extreme PC Build:  The WEIRDEST Japanese Dollar Store Tech:  Apple Has a BIG Problem:  The WEIRDEST Products at Costco:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 DUALSENSE EDGE LIVE REACTION 0:44 Initial Thoughts 1:48 Customizable Controls 2:10 Multiple Control Profiles 2:26 Dedicated User Interface 2:49 Changeable and Replaceable Sticks 4:34 Design Thoughts 5:00 Charging Case and Cable 6:07 Launch Timing and Price (???) 6:39 What do you think?",
    "description_links": [
        "https://youtu.be/dRe97Cs8W1Q",
        "https://youtu.be/j-lOYlIX5YY",
        "https://youtu.be/ldg1XtSnVFM",
        "https://youtu.be/C0GWWNAoJlU",
        "https://youtu.be/Uw6OsPUbR7I",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- Controller? - Controller. That's a Dual Sense. (thrilling music) - What? (Austin laughing) - What happened? - There's triggers. - It looks cool though. The Edge? DualSense Edge. - DualSense Edge. Look, this thing here, if I could just, like, - Okay. - Who needs this one? - So the PlayStation Edge controller is official. The PS5 Pro controller that has been promised has been delivered. Let's set the stage here. - I have the dumbest joke. - Do it, do it, hit us Matt. - Would you say that this new DualSense controller is cutting Edge? (both laugh) - No. - I'm not even a dad. All right we've had the long awaited PS5 Pro controller. - [Austin] Yeah. We've literally seen this about 17 seconds ago. So, come with us for a little journey, as we all learn together. So the DualSense Edge is going to have customizable controls. You're gonna have the little bumps that look exactly like what you get in the Elite controller for your triggers. - Adaptive triggers. - Yep. - We've had these types of controllers for PlayStation in the past. But this is the first time that we're getting an actual proper first-party PlayStation Pro controller. But like, I love using the Xbox Elite controller. I do like the adaptive triggers. I don't really use the customizable back buttons that much. I just, I mean, I know if you're like an FPS gamer like those are super helpful for that. For me, just the better build quality and the heft of the Elite controller is why I love going back to it. - [Austin] It feels terrific. - And the DualSense was already an amazing feeling controller. But I always felt it was a little light. I like a hefty controller. I like a controller to weigh as much as me. And that's saying something. - So I'm gonna hit you with the key talking points with the PlayStation 5 DualSense Edge. - Okay. - Ultra customizable controls that allow you to remap or deactivate specific button inputs. That is terrific. I think that is sort of table stakes for a Pro controller. Having the ability for you to adjust the sensitivity, the deadzones and whatnot. Totally, totally important, especially if you want a real Pro controller that's not just, oh, it's cool and flashy, but actually has real features, right? You can also save multiple control profiles. - We kind of talk about like, PlayStation breaking into PC gaming and if they have their launcher, and if you could grab all your trophies, all your cloud saves from the game, but then also your profiles. - I don't see any reason why they wouldn't let you do that. - Like, that'd be great, that'd be great. - So there is an on-controller user interface which has a dedicated function button to allow you to easily adjust your setup while staying focused on the in-game option. So the idea is that unlike what you do on the Xbox which is going into the, is it Xbox controllers or, whatever that app- - Yeah, it's an actual app. - Yeah, you can actually do this as, looks like inside the actual menu of the PS5. So you hop in, tweak your deadzone a little bit hop back out without having to leave the game which is terrific. There's also, again, very Elite controller-esque, changeable stick caps and back buttons. So it comes with three stick caps. Very much familiar if you're used to the Elite controller. Now, it's interesting, because I believe the Elite controller has four paddles you can connect to the back, but they only did two here. Do you care at all about that? - I do know that they're useful for a lot of like, FPS stuff. - Yeah. - What it's hard to tell in the photos here, - Yeah. - Is whether it actually does have four or not. 'Cause it looks like it might have two in the back but I can't tell whether those two in the back are also, - [Austin] The ones that you get on the front, - [Matt] The one right below the joysticks. If you have one in the joystick, and you can kind of hit it with your thumb, I think that's actually, to me more useful than trying to do the hands here because I always find like, I either hit it or it's weird to stretch out to hit 'em. But on the back of it, there's one thing I think is gonna get uncomfortable. And if you look at this, like seam, down the handle, it looks like a there's a seam. - [Austin] Oh, you're right, yeah. - And I feel like that would get uncomfortable after a while. - Now, continuing on, they also say that you can fully replace each individual stick module on the controller. Replacement modules will be sold separately. I mean, if you're a pro, you gotta go keep your sticks fresh. You're gonna use the same sticks twice? Please. Use them once, throw them away obviously, right? - Well, the cool thing about when you have something that's like, modular like that, - Yeah, yeah. - It does look like they're easily user serviceable, but if you can now have third-party things of like, you know, for the right side, because I want a little bit more aim. I don't know, like- - Well, 'cause you can already replace the caps. - Yeah. - But then this is the actual stick module itself. Sony are saying that they're selling you replacements so it doesn't seem like upgrades, more so, like when yours break. - Yeah. - But you gotta know that if this is popular and enough people are sort of buying into this, there will be third-party stick options you can just drop right in. - And of course this is going to be popular. People have been asking for this for since the Elite controller came out. The only thing I'm gonna knock this for, - Yeah. - Is one, I love the design of it. I love the kind of two-tone- - Well, I don't know if I love the design. I think the design is fine. I think it looks a little like DualSense that they bolted on some things. - Yeah, I kind of like that. One of the things that we loved about this controller is how this is so bumpy but it's weirdly smooth at the same time - Yeah, yeah. - with all the little PlayStation face buttons. - One more thing that I think that they have completely ripped. And again, I'm not complaining about this. Great, thank you for ripping all the good stuff about 'em. It comes in a carrying case, which means that you have a braided USB-C cable that comes with the controller. - All cables should be braided at this point. - I mean- - I will die on this hill. - The other thing is you can actually keep the controller charged via the case. So you don't have to pull the controller out, plug it in. It's gonna have a little pass through or something inside the case, just like the Elite Series 2 does. So if you're gonna be using this wire, which, if you're very real pro, of course you're wired. - No latency. - Latency. (growls) - We don't compromise as gamers. (Austin laughs) - Although if you don't compromise as a gamer, then you should subscribe to the channel and ring-a-ling the ding-a-ling button. Because here this is, we only compromise on delivering high quality, cutting edge news directly to your subscription feeds. We only give you the best. Subscribe. But what I'm looking at here is this DualSense Edge feels like absolutely the PlayStation version of the Elite controller. Let me be super duper clear. That is a great thing. Everyone is making third-party controllers. Everyone is jumping on this sort of bandwagon whether it's Razer, whether it's SCUF whatever the case is. To have a first-party controller with that deeper integration, with the high quality build and hopefully a reasonable price. Although they are very specifically telling us nothing about anything beyond the launch timing which is going to be announced in the coming month. - I feel like it's safe to say it's, at a minimum, $200. - 180 to 200 is my thought as well. - Yeah. One of those things I feel like, all right, it's gonna be like 200, 220 and then just constantly on sale for like 180. Sony in general has been making these great integrations with the PlayStation. They got their INZONE line. Like their headphones have the great integration with PlayStation. - Yeah. - That's something that they're really doing a lot of great things with. Having all this first-party integration, being able to control like, the PlayStation. - [Austin] All at your fingertips. - I'm glad that they're doing this. - Yeah. - Obviously the thing is, let's make sure it doesn't suck. - I would be shocked if it sucks. 'Cause this is- - I would too, I would too. - Such a good control. Like, the DualSense is my favorite controller right now. Even including something like the Elite. I love this controller, I love haptic, so good. - All right, I'm somewhere on the fence with the DualSense and the Elite. I love the Elite, but the - Haptics- the haptics on the Elite are terrible. - Oh, on the Elite, yeah, yeah, yeah. - The vibration motor on it, horrible. - This is terrific. I'm very excited to get our hands on a DualSense Edge. - Yeah. So make sure to subscribe for our thorough in-depth tear down of the DualSense Edge. Hopefully we don't get in trouble again like last time. - I wonder if it runs three degrees hotter. - Matt, you're gonna get me canceled again, please don't. (upbeat music)",
    "transcript_keywords": [
        "Elite controller",
        "Controller",
        "Yeah",
        "DualSense Edge",
        "Elite",
        "Edge",
        "Pro controller",
        "Xbox Elite controller",
        "DualSense",
        "PlayStation Edge controller",
        "Pro",
        "PlayStation",
        "thing",
        "PlayStation Pro controller",
        "love",
        "back",
        "Edge controller",
        "great",
        "things",
        "Dual Sense"
    ],
    "transcript_entity_values": [
        "220",
        "the DualSense Edge",
        "PS5",
        "one",
        "third",
        "four",
        "three",
        "FPS",
        "PS5 Pro",
        "a DualSense Edge",
        "INZONE",
        "Xbox Elite",
        "the DualSense Edge",
        "Razer",
        "PlayStation 5 DualSense Edge",
        "Matt",
        "Elite",
        "PlayStation Pro",
        "DualSense Edge",
        "DualSense",
        "Austin",
        "this about 17 seconds ago",
        "two",
        "180",
        "One",
        "this DualSense Edge",
        "Xbox",
        "USB-C",
        "200",
        "Sony",
        "Edge",
        "three degrees",
        "first",
        "PlayStation",
        "the coming month",
        "Edge",
        "PlayStation Edge",
        "200"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "FAC",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL"
    ]
}