{
    "id": "jTW3h_lDnNc",
    "title": "iPhone 11 Pro?!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-08-16T18:41:36Z",
    "video_url": "https://www.youtube.com/watch?v=jTW3h_lDnNc",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iphone 11",
        "iphone 11 pro",
        "iphone 11r",
        "lastpass",
        "lastpass login",
        "password",
        "password generator",
        "lastpass chrome",
        "lastpass download",
        "lastpass premium",
        "random password generator",
        "generate password",
        "password manager",
        "recover",
        "lastpas",
        "laspass",
        "lastpass premium features",
        "delete account mobogram",
        "lastpass.com",
        "how secure is my password",
        "last password"
    ],
    "views": 553664,
    "likes": 16698,
    "comments_count": 1465,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, its Justine. And today we're going to be checking out some of the new iPhone 11 rumors. I cannot wait. I can't believe that a new iPhone is just around the corner. Welcome back to my office/lair/dungeon. A lot of you had a bunch of questions about where I am and what my new office looks like. Soon I will be doing a video about that, but today we need to take a look at some of the new iPhone 11 leaks. Thanks to LastPass for sponsoring a portion of this video. I have been such a huge fan of them for the past couple of years. And what's been great is because I do get new phones quite often, with LastPass I don't have to remember my passwords from phone to phone. Everything syncs through the Cloud, through the LastPass app. I don't have to even come up with a crazy different password for each one of my accounts. It has a really great auto password generator feature, so if you don't want to have to think of a crazy password, LastPass will also do that for you. The best part about it is LastPass auto fills all of your credentials on iPhone, on your computer, on IOS and even on Android. Thanks again to LastPass for sponsoring a portion of this video. And being there for me over the past couple of years when I first started using this app. And now it is time to get into the rumors. The first thing that I need to look up is, when was the iPhone announcement event last year? (typing on keyboard) I spelt announcement wrong. September 12th. That's soon. September 12th, the iPhone event. September 14th, pre orders. September 21st, the iPhone was actually released. And this most recent image leak found in an IOS13 screenshot looks like it'll prove our September 10th date for announcement and 20th for actual phone release. Of course nothing is officially announced yet but this is looking pretty accurate. So keeping those dates in mind that's probably around the same time that we'll be having a new iPhone. So make sure you mark your calendars, a day before and a day after, just in case. 'Cause we never really know what Apple's gonna to do. I love looking at crazy concepts because it just makes it so much more fun to see what the future is gonna be like. Because these concepts can easily become real. OK well maybe.. Maybe not that real because this looks like a like a freaking jelly bean. This is, what the heck? This really does look like a jelly bean. This looks like an iPhone flattened. This just, this is something. Look they even have little icons on the side, Oh my goodness. There's more, look at this. You've got the volume on the - oh wow! Not sure about the practicality mostly because I need to have a case on my phone so how am I gonna be able to use the edge of this if I don't have a case on it? Which, the iPhone without a case is one of the most beautiful things that you'll ever see. Display makers have already figured out flexible OLED screens. Have they, though? Have they? When will Apple announce the iPhone 11 in 2019? It's a question that I have, and its a question that I think that we sort of tried to figure out. This article has Apple iPhone release and announcement dates from 2012 to 2018. The last two phones, were on September 12th . And the release dates, the 21 and 22nd. So really who knows? They're saying September 10th. And orders would kick off on Friday the 13th. It's interesting because a lot of the articles that I've been reading and some of the rumors are predicting that a lot of the features that we thought were gonna be in the iPhone 11, they are kind of pushing it to the 2020 version of the iPhone. So 5G, 120 hertz OLED retina display, 2020. It just continuously keeps being confirmed. Article after article, rumor after rumor. That the 2019 phone will be a lot like the 2018 phone. Incremental upgrades, faster camera chips, the next version of the operating system which is IOS13, which I have been playing with the beta and honestly it's crazy because when you do upgrade to the latest IOS, it does feel like you have an entirely new phone. Some of these most recent articles are saying that they're going to be calling the top of the line iPhone, the iPhone 11 Pro. Then we'll have the iPhone 11 Max. And then the iPhone 11R. Honestly I wouldn't be too surprised by this but I'm not entirely sure that I believe it. Mostly because I feel like they'll probably stick with their normal naming conventions until the 2020 release. Which is rumored to be the most significant upgrade. I'd love to know what you guys think, so leave me some comments below. Most of the rumors still seem pretty set on this three camera design, which I'm not sure if I'm the biggest fan of it because I just feel like it's kind of like a chunky block. I think I would have liked just basically taking the phone that we have now and just extending and adding in another camera. Oh I love this tweet from Mrwhosetheboss, If you like this design or a retweet if you like this design. I was thinking I would like the camera sort of a vertical instead of horizontal. Oh my god, he tweeted that in January. It's crazy that this leak has been around for that long. Apple offer another LCD iPhone in 2019, the 11R. I loved the 10R, I think it's a great phone. A13 processor will power the iPhone 11, the A12 bionic chip was the previous one in the 2018 phone. It's just so crazy to think that it's already been almost a year already. Wow! Almost definite, the 2019 phone won't support 5G. This is interesting because what if Apple decides to come out with another phone? Like another another iPhone. Like the iPhone 11 5G. Sort of like Samsung did with their 5G model. That's honestly a very realistic possibility. I wouldn't put it past Apple and I wouldn't put it past me to buy it. Other assorted rumors, a different phone for China. They sell a cheaper version of the iPhone. Interesting. And perhaps one in India too. Substituting a cheaper in screen and finger print scanner for face ID, a new mute button, USBC. If Apple decides to finally put USBC in their new phones, I'm gonna loose my mind, like I will break something. Not out of being upset but out of excitement, because this is something that I've wanted for the past I think at least 3 years maybe? I don't know. Anybody remembers the first iteration of me saying that I wanted the iPhone to have USBC, leave me a comment below. A new way for users to interface with future additions of iPhone. The touch less gesture control. I'm really into gesture control. It's really hard to get it to work properly all of the time, every single time. So it will be interesting to see how well that does work. 2020 iPhones may have a full-screen Touch ID. 2020 they'll stop using intel chips. (gasps) I'm also curious, Mac Pro release date. When do we think that's gonna happen? Apple has favored October for a lot of previous computer launches. (gasps) October would be nice, although my sister's baby is due on October 14th. So Apple if you guys can like maybe just y'know adjust things accordingly so that I could be there for the birth of my sister's child but also be there for the birth of my future child which is not human, and I'm so okay with that. God I can't wait. Look how freaking beautiful it is. Ahhh. My heart. Well that was just a look at some of the rumors that I have seen here recently. I have done a really good job of avoiding it but this is interesting, I saw this also, the iPhone 11R accidentally revealed in a Samsung Note 10+ leak. I just don't think that's it. I feel like this is faked. This is, we've been seeing this same design for months. Like the fact that Mrwhoestheboss tweeted that in January, like that's a long time ago. So it's gonna be a real shock, if this isn't what the phone looks like. Anyway, I'd love to hear from you guys. What do you think the iPhone 11's gonna look like? Do you think these leaks are accurate? Do you think that they are going to wait until 2020 to release all the goodies that we thought that they were going to release this year? Either way, you guys know that I am one of the biggest Apple fans ever, so I cannot wait to get my hands on one of them, or two of them, or all of them. I don't think I'll be doing an iPhone 11R unboxing of all of the colors again or will I? I'm not sure. Well that's it, I will see you guys in my next video. Don't forget to subscribe so you'll know when I post a new video. Be sure to hit the bell so you actually get an alert when I post a new video. That's it for now, I'll see you guys later. Bye. (upbeat pop music)",
    "transcript_keywords": [
        "iPhone",
        "phone",
        "Apple",
        "September",
        "Apple iPhone release",
        "Justine",
        "release",
        "LastPass",
        "guys",
        "rumors",
        "crazy",
        "video",
        "Apple iPhone",
        "lot",
        "past",
        "interesting",
        "time",
        "phones",
        "Apple decides",
        "USBC"
    ],
    "transcript_entity_values": [
        "iPhone 11",
        "intel",
        "one",
        "120 hertz OLED",
        "2012 to 2018",
        "A12",
        "Apple",
        "September 12th",
        "Justine",
        "Apple iPhone",
        "iPhone",
        "USBC",
        "Mac Pro",
        "2020",
        "three",
        "at least 3 years",
        "the past couple of years",
        "January",
        "last year",
        "5",
        "Samsung",
        "20th",
        "China",
        "A13",
        "Mrwhosetheboss",
        "today",
        "LCD iPhone",
        "India",
        "2019",
        "Cloud",
        "two",
        "the iPhone 11R.",
        "months",
        "this year",
        "2018",
        "Android",
        "11",
        "first",
        "October 14th",
        "Mrwhoestheboss",
        "September 21st",
        "LastPass",
        "21 and 22nd",
        "Max",
        "IOS",
        "Friday the 13th",
        "October",
        "September 14th",
        "September 10th",
        "almost a year"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE"
    ]
}