{
    "id": "JUhrZbK8vHM",
    "title": "The Most Powerful Mini Gaming PC...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-03-29T18:10:56Z",
    "video_url": "https://www.youtube.com/watch?v=JUhrZbK8vHM",
    "category": "Science & Technology",
    "tags": [
        "gaming pc",
        "hades canyon",
        "nuc",
        "intel",
        "gaming",
        "vega",
        "amd",
        "intel nuc",
        "hades canyon nuc",
        "i7-8809g",
        "i7-8705g",
        "pc gaming",
        "mini pc",
        "small gaming pc",
        "austin evans",
        "rx vega m",
        "fortnite",
        "pubg"
    ],
    "views": 652365,
    "likes": 17593,
    "comments_count": 1359,
    "description": "With an Intel CPU and AMD RX Vega M graphics, the Hades Canyon NUC is a dope gaming PC. Can You Play Fortnite on a $200 Laptop?  Subscribe!  Instagram:  Twitter:  Facebook:   An Overclock Media Production  Presented by Austin Evans  Producer: Kenneth Bolido Editor: Jimmy Champane",
    "description_links": [
        "https://www.youtube.com/watch?v=0Xi2rurVAvs",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. This is one seriously interesting little PC. So this is a Intel Hades Canyon NUC and inside, not only is this the very first time that an Intel CPU has been paired with an AMD GPU on the same chip, but it is also, according to Intel, the smallest VR capable gaming PC that you can buy. The special sauce here is absolutely that 8th gen Core i7 processor with the built in Radeon RX Vega graphics. Now, it's hard to overstate how weird it is to see Intel and AMD combining forces to create a single chip. Now to be fair, this is sold by Intel. This is an Intel NUC, and you're going to be seeing this chip in some other things. Mostly some mainstream laptops. However, the NUC is all about getting using the maximum performance in a very, very small desktop form factor. So, Intel sent this out for review but you should keep in mind that there are actually two versions of this NUC. So this is the higher end 100 watt version. However, there's also a 65 watt tdp edition, which, is going to be nearly a couple hundred dollars cheaper but you are going to be cutting back on the CPU, the GPU, as well as the clock speeds. Now, at 800 dollars, it doesn't look too bad, and this guy at 1000 dollars seems like a good deal on paper, however, you have to keep in mind that it's a NUC. So essentially, you have to supply, not only your own memory, but also your own SSD, as well as operating system. Pop open the box, and we're gonna see, not only the awesome skull logo, but also our NUC itself. Wow, that is legitimately really small. So, while we were in San Francisco for the launch event of this guy, we actually got to try a VR capable backpack PC. And I say backpack PC, because literally one of these was sown onto a motorcycle jacket. I'm not usually this stylish but what I've got here is a motorcycle jacket which has not only the Hades Canyon NUC on it, but we also have a mixed reality headset. So, with a battery built into the jacket, in theory, I'll actually be totally portable. Oh yeah, the tracking is not bad. It's really cool that this is a fully an untethered experience. I mean, if I hit a wall, I guess that would not be good. But the ideas that I don't need any cables connected, no power, nothing. So what's really cool about this set up, is that because the NUC is going to be so small, that we can actually run it easily on a battery, and it allows me to be completely and totally untethered. I'm gonna...I'm gonna grab your gun. Grab your gun, shoot you, throw the knife. Okay, I just got shot. Alright, alright, alright, I can do this, I can do this. The main idea here is that because now I am untethered with the PC and the battery, and I'm also using the mixed reality headset, so I actually don't need any sensors around me. I can kind of freely walk around. It feels pretty good. This is really cool. I'm legitimately surprised with just how good of an experience you're getting, with something that's literally on the back of a motorcycle jacket. The size of this is actually pretty impressive. So for context, I mean, that's the size of my hand. So it's not really going to be all that large, but you're getting some pretty serious power inside. You can kinda see that in the back, because there are a whole lot of heat sinks in this guy. So around front, you're going to be seeing, not only an SD card reader, but a couple of USB 3.0 ports, a front facing HDMI 2.0, USB 3.1 type C, headphone jack,and then, if you flip it around to the other side, you're going to be getting a whole lot more including, one more HDMI 2.0, four more USB 3, two gigabyte ethernet, two mini display ports, as well as two thunderbolt 3 ports. Inside the box, we're also getting the pretty large power supply, that is like the same size as the NUC. (Laughing) However, that's actually going to be pretty important with a computer like this. While it's stock, it's only going to be pulling about 100 watts or so. This is going to be fully overclockable, not only on the CPU but also the GPU, as well as that HBM2 memory inside. So having a little bit of extra head room with the power supply is definitely not a bad thing. Pop off the six screws on the top of the NUC, and inside, we're gonna have access to the motherboard. So, Intel sent this already pre-populated with the memory, as well as optane, and a full SSD, but like I said, if you pick up one of these, you will have to supply all this yourself. Something that is definitely not going to get old is when I open Radeon settings and see intel logos all over the place. Even the whole thing is in blue, but the good thing is because we do have AMD graphics, we do have full support for all the stuff you'd expect, including free sync which this monitor supports. So, right now we're running 1080p at 144 frames per second. Speaking of high frame rates, we have rocket league. So here at 1080p on max settings, we're easily able to get 144 frames per second. Something like the Vega GPU inside here is going to have no problem playing a lot of games at 1080p. And as you'll see in a second, we can even crank things up a little bit farther. Now, as everyone knows, PubG is not exactly the most optimized game in the world, however, it actually runs pretty well here. So, this is gonna be a mixture of medium settings and 1080p but because we have the high refresh rate monitor, that does mean we're getting somewhere between 60 and 70 frames per second in these lighter areas. So its one of the big advantages, of course, of playing on a PC, and especially with something like this that does have that free sync support as well as the high refresh rate monitor, is that you really can get something that's gonna be a lot smoother than any kind of console. Especially considering that this is, well, smaller than pretty much any console. I think PubG is a good example of a game that actually runs really well here on the NUC. So no, I'm not gonna be blasting 4k and like crazy options or anything, but it's definitely playable with pretty much any kind of game that you can pick up today. Of course, now gaming video in 2018 would be complete without a little bit of fortnite. So here, at 1080p on epic settings, we're doing something a little bit closer to 40 to 50 frames per second, but if you really do want to get those super high frame rates, it's easy enough to just pop the settings down a lil' bit. And of course, if you guys are interested in a little bit more on fortnite, I did recently do a video talking about how it runs on everything from like a 1000 dollar game PC, all the way down to a 200 dollar laptop. Moving on to a game that's going to be even more graphically demanding, is Middle-Earth: Shadow of War. Now here at 1080p, on medium settings, we're getting somewhere between 60 to 70 frames per second. If you don't care about the high frame rates as always, you can crank up the settings a little bit, but this is definitely going to be a solid 1080p game box. Jump into the benchmarks, and in 3D mark, the graphics here are going to be a little lower end than something like a GTX 1060, perfectly fine, and honestly pretty powerful for a system this small, but it is going to be a little lower. On the CPU side, it's going to split the difference between something like a gaming laptop, which honestly, is about the same size as this, as well as a full six core, core i5, or core i7 on the desktop. Look, there's no getting around it. This thing is weird, the idea that you're getting an intel CPU with AMD graphics inside of it, and all the drivers are sort of branded as intel. Like everything is kind of unusual about it. However, it kinda works. Now yes, it is going to be a bit pricey at 1000 dollars, and of course, you do need to keep in mind that you need to budget at least a couple hundred dollars more for ram, as well as an SSD, and probably a windows license, however, this is something that's not really gonna be found anywhere else. You're getting a ton of power in a small package, it supports up to six video displays at the same time, you've got two thunderbolt 3 ports, so in theory, you could even connect an external graphics card to this guy, and out of the box, it does support overclocking. Now, if size is a matter, you can build yourself a bigger, more powerful computer for less money, but for a lot of people, I do think that the small size is a legitimate selling point. I mean you can just stuff it behind your monitor and never have to look at it if you don't want. So, I'm curious, what do you guys think about the Hades Canyon NUC? Let me know in the comments below, and I will catch you in the next one.",
    "transcript_keywords": [
        "Hades Canyon NUC",
        "NUC",
        "Intel",
        "Canyon NUC",
        "Intel Hades Canyon",
        "Intel CPU",
        "Intel NUC",
        "Hades Canyon",
        "pretty",
        "bit",
        "CPU",
        "Intel Hades",
        "settings",
        "inside",
        "Austin",
        "size",
        "high frame rates",
        "game",
        "AMD",
        "good"
    ],
    "transcript_entity_values": [
        "six",
        "AMD",
        "at least a couple hundred dollars",
        "2018",
        "first",
        "between 60 and 70",
        "Core",
        "USB",
        "jack",
        "Austin",
        "1000 dollar",
        "two",
        "AMD",
        "HDMI 2.0",
        "3",
        "four",
        "Intel Hades Canyon NUC",
        "100 watt",
        "65 watt",
        "the Hades Canyon NUC",
        "intel",
        "one",
        "1080p",
        "800 dollars",
        "about 100 watts",
        "second",
        "8th",
        "1060",
        "GTX",
        "Radeon RX Vega",
        "San Francisco",
        "Intel",
        "1080p",
        "CPU",
        "SD",
        "NUC",
        "4k",
        "3.1",
        "40 to 50",
        "144",
        "two gigabyte",
        "1080p",
        "SSD",
        "NUC",
        "the Vega GPU",
        "max",
        "200 dollar",
        "Middle-Earth",
        "GPU",
        "today",
        "Radeon",
        "CPU",
        "1000 dollars"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "QUANTITY",
        "QUANTITY",
        "LOC",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "QUANTITY",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "GPE",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "MONEY",
        "LOC",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "MONEY"
    ]
}