{
    "id": "JVwSWOdyZvM",
    "title": "The Best Tech & Gadgets Under $50!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-02-23T18:25:52Z",
    "video_url": "https://www.youtube.com/watch?v=JVwSWOdyZvM",
    "category": "Science & Technology",
    "tags": [
        "Best Tech Under 50",
        "Tech Under 50 Dollars",
        "Tech Under 50",
        "Best Tech Under 50 Dollars",
        "Cool Tech",
        "Cool Tech under 50",
        "Best Tech Under $50",
        "Best Tech Under $100",
        "best tech",
        "tech",
        "cool tech deals",
        "top tech",
        "tech deals",
        "charger",
        "nice",
        "best back to school tech",
        "jonathan morrison",
        "gaming tech",
        "best tech deals",
        "iphone",
        "back to school tech",
        "gaming pc",
        "gadgets",
        "best",
        "top tech under $50",
        "unboxing",
        "top 10",
        "september",
        "under",
        "apple",
        "case",
        "2017",
        "cool tech under 50",
        "coolest"
    ],
    "views": 727670,
    "likes": 23593,
    "comments_count": 718,
    "description": "FAKE APPLE AIRPODS!  The Best Tech & Gadgets Deals Under $50! (February 2017)   Colorware Skins:  CRISPY AF SHIRT!   Brightech USB Table Lamp -  Axgio Wireless Earbuds -  LensShifter Focus and Zoom Grip -  Lenovo N50 Wireless Mouse -  Elago D Stand -   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/BMH317CXRGo",
        "http://www.colorware.com/categories.aspx?category=128",
        "https://s2apparel.myshopify.com/products/crispy-af-1",
        "http://amzn.to/2lHujy6",
        "http://amzn.to/2lHpyVc",
        "http://amzn.to/2lakjdl",
        "http://amzn.to/2lxt1U3",
        "http://amzn.to/2lxsqSp",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo guys, Jonathan here. Welcome back to another episode of The Best Tech and Gadgets Under 50 Bucks. Today, we are kicking it off with a pair of truly wireless earbuds that are a fraction of the price of AirPods, didn't get cracked in the face with an ugly stick like the clones I just looked at, and also surprisingly don't sound half bad. So these are the AXGIO Dash, which are clearly named after a very similar product in the space, but the idea and the intent here is to be a budget alternative at a much lower price point. What I think stood out to me most with these, though, is the fact that the pairing process was not a giant, smash your face into a desk session, which I think is what you'd normally expect with most truly wireless earbuds at this price point. So on the headphones is what they're calling a multifunction button and what you're gonna do is hold this for six to eight seconds, and then once you see a red and blue light blinking and alternating, that means you're ready to pair. Now normally, with other truly wireless earbuds, you would need to repeat this exact same process with the other earbud, cross your fingers, pray to Korean Jesus they somehow didn't fall out of sync and magically work together and the end of this nightmare. But with these, you simply power them on and they are magically connected. On top of that, I'm gonna reiterate, they don't look ridiculous. They're stealthy, they got that ear hook so they got that sporty look to 'em, and alternatively, as a result of that ear hook, they're gonna stay in your ears really, really well. So with these, if you're gonna use 'em for workin' out or for running, not only are they gonna stay locked down in your ears, they are also waterproof, and that's something that the Beats X at three times the price doesn't even offer. Beyond that, after all is said and done, if these sound like garbage, none of those features matter. The good news is they don't sound like garbage. They're not gonna be Audiophile great headphones, they're not gonna sound better than the AirPods, the Jaybird X3, the Beats X wireless. But for the price, nearly a third of the price point, they actually sound surprisingly good. So next up is the Brightech USB desk and table lamp which is sittin' right next to me. Truth be told, I actually ordered this for the next desk setup, which is geared to hit the $500 budget. But if you guys are excited for that, if we can hit 25,000 likes, I will drop that video this week. So jumping back to the product. It is no secret that I love lamps, I love lighting, and therefore I am constantly on the lookout. And this one is special because not only does it produce light, it also charges your phone. Now for sure, if you're using this on your desk, let's say next to your computer, having an extra USB port to charge your phone really isn't that big of a deal, but on the flip side where I can see this being more useful and more practical is somewhere like next to your bed where you can then charge your phone at night. Now as far as the lamp itself aesthetically, it is killer. And as much as I love colored lighting, I've really grown fond of practical, warm lighting like this because it adds this really relaxing tone to the room. And I don't care if you're shooting video or just comin' home to your setup, having something that is aesthetically and visually appeasing kind of just makes you feel good inside. (sings Batman theme song) Now if you were eyeing that sweet iPhone right there, no, that is not a jet white iPhone. What it is is a super clean skin from ColorWare. If you're thinking to yourself, \"I thought ColorWare \"was that company who did ridiculously awesome paint jobs,\" they just dropped a bomb in the skin game. On a serious note, though, what separates ColorWare is their expertise in paint and customization where they can then apply it to the skins which results in something truly badass. Honestly they have one of the coolest looking color options for the Google Pixel out right now. And not only are these under 50 bucks, they actually start at under 15. You guys can check out the link below for the endless amount of customization, but I've actually teamed up with ColorWare to give away a custom wrapped iPhone 7. Next up is a really great lookin' wireless mouse from Lenovo. This is the N50 which has this really cool, unique diamond prism design that would look great on any desk. It's actually very similar in terms of looks and design to the Logitech performance MX. It is less customizable, but that in turn yield a lower price point. Right now this guy is currently sitting under 40 bucks, and on top of its 10 meter wireless range, what's a nice touch is the fact that you can actually store the USB receiver when you are taking this mouse on the go. I guarantee you at some point this is gonna make its way into one of my video because honestly, it is really hard to find good looking mice. Apologies, Stuart Little. But the looks combined with the fact that it functions well, it's priced even better, makes this a fantastic all around wireless mouse. So next up is this strange lookin' device on the camera right here. And while it may look funny, it is actually very useful for you videographers out there. So this is the lens shifter, and what it's geared for is either to pull focus or to adjust zoom in and out. In this case, because I'm on a prime lens, the only parameter I can control is focus, but in the case we're on a zoom lens and you wanted to control both focus and zoom, there's a matching red version so you can easily tell the two apart. Now I guarantee someone out there's gonna say that is stupid, I could pull focus with my hands. What do you suck at video or something, Jonathan? And to that I say once you get past that mindset and start to use tools like this to help you, you can then take your mind off the tedious portion and therefore focus on the creative parts. (electronic music) What's also cool with this is the fact that it's adjustable, so it should work with lenses ranging from 56 up to 98 millimeters in diameter. And like I mentioned, it will work with both zoom and prime lenses. So if you're someone out there shooting video, maybe struggling with focus pulls, maybe they're not as smooth as you would like them to be, something as inexpensive and effective as this could make all the difference in the world. So last up is the elago D Stand. Get your mind out of the gutter. So what this actually is is a multipurpose charging dock geared for lightning-equipped Apple devices. I do think this looks best, honestly, with the AirPods or the Apple TV remote. If you do for whatever reason wanna charge your Apple wireless keyboard you can, but it looks silly. And again, like most of the products featured in this video, not only is this under 50, right now it's actually under 20. It looks great, build quality is fantastic and just like the mouse, it's gonna look great on your desk. The one thing I do wanna point out, though, is that it seems like it's geared for Apple-specific lightning cables. So if you wanna use this with a third party cable, you're not gonna get the best results. Apart from that, though, especially if you're gonna use this to dock and charge your AirPods, this is a great, inexpensive option that fits the bill perfectly. Aside from that, thank you guys very much for watching. If you're wonderin', \"How do I win that sweet iPhone 7?\" Details are down below. And if you haven't yet, definitely make sure you subscribe. Got a lot of killer content comin' up, including the $500 desk setup. This is Jonathan and I will catch you guys later. (beep) Damn, I rolled that R, I was like-- (rolls R)",
    "transcript_keywords": [
        "price point",
        "Tech and Gadgets",
        "price",
        "wireless",
        "wireless earbuds",
        "desk",
        "lower price point",
        "point",
        "great",
        "video",
        "focus",
        "sound",
        "Brightech USB desk",
        "guys",
        "AXGIO Dash",
        "lower price",
        "wireless mouse",
        "USB",
        "charge",
        "earbuds"
    ],
    "transcript_entity_values": [
        "two",
        "Batman",
        "iPhone",
        "The Best Tech",
        "Today",
        "nearly a third",
        "MX",
        "Lenovo",
        "Jesus",
        "50",
        "10 meter",
        "iPhone 7",
        "USB",
        "Apple",
        "50 bucks",
        "98 millimeters",
        "ColorWare",
        "AirPods",
        "Brightech",
        "Korean",
        "under 15",
        "500",
        "25,000",
        "under 40 bucks",
        "Apple TV",
        "three",
        "half",
        "six to eight seconds",
        "one",
        "50 Bucks",
        "this week",
        "third",
        "Logitech",
        "Stuart Little",
        "56",
        "Jonathan",
        "night"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "NORP",
        "DATE",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "TIME"
    ]
}