{
    "id": "jwhFr5Ax3Fk",
    "title": "The Triple Monitor Mega MacBook!",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-07-29T15:30:01Z",
    "video_url": "https://www.youtube.com/watch?v=jwhFr5Ax3Fk",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "ten one mountie",
        "mountie",
        "ipad laptop",
        "ipad",
        "iphone",
        "apple",
        "macbook",
        "macbook pro",
        "ipad air",
        "ipad pro",
        "ipad air 2",
        "ipad mini",
        "iphone 6",
        "iphone 6s",
        "iphone 7",
        "iphone plus",
        "iphone 6s plus",
        "iphone 7 plus",
        "mount",
        "ipad mount",
        "iphone mount",
        "android",
        "best",
        "smartphone",
        "samsung",
        "vs",
        "6s",
        "apple iphone",
        "things",
        "innovation",
        "invention",
        "inventions",
        "new inventions",
        "tablet",
        "cool gadgets"
    ],
    "views": 4274850,
    "likes": 89494,
    "comments_count": 4693,
    "description": "(   ) --- Today's Mystery Video -  Ten One Mountie Clip (USA Link) -  Ten One Mountie Clip (International Link) -   This little Mountie clip allows you to attach mobile devices for use as secondary displays to your MacBook (or other laptop). It works with various devices including iPad (and other tablets) iPhone (and other phones).  From the manufacturer -   Have a little entertainment on the side. Mountie makes it easy to attach movies, sports, tv shows, or second screen to your MacBook or iMac. The simple lever-action makes attachment quick and easy. Multiple included grips means Mountie will accommodate all current and future models of iPad, iPhone, and Macbook.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/8n_drQrLHko?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://amzn.to/2am07D5",
        "http://geni.us/9Xm0T5B",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "So I found these cool little contraptions. They're called Mountie and what these guys do is allow you to clip an iPad onto a laptop. In this case a Macbook. The reason you might want to do it is for multitasking to create a multi-monitor laptop scenario. Now normally you'd only do it with one iPad but I was like that's just not exciting enough let's get two.. two iPads, one Macbook and create a triple monitor freak show. Now once you get connected like that you're probably wondering well what do I? How do I? What's on the iPad? What's on the laptop? Well, there's an app. It's called Duet Display and it allows you to extend your desktop onto an iPad. In fact, there's another one called Air Display as well as a couple different ones, each with different features and functions. Let's crack these babies open. How many people wish they had a multi-monitor setup on the go but you don't want to have a separate external display? They're big, they're heavy, they require power source because they don't have a battery built-in. Well, an iPad sort of solves all of that. Little adapters, I'm guessing, depending on which Macbook and which iPad. That's the thing right there and its own. so there's one. Let's get the other baby cracked open. Tiniest little instruction manual. Macbook and Macbook pro use D or F. Okay, D is pre-installed. They're like these little spacers, of course, once you figure out which ones you need, you should be all set. So if I crack this open. Just a little bit of this action here Oooh wow, that's a lot more secure than I expected it to be and that just clips in Wow, okay, so you can kind of leave it on there; take it off; this up to you. Oooooh now, could you do it in portrait mode as well? I don't see why not Ooh, I'm not sure, I might even like that better. Doing some editing Get yourself a little bit of real estate back 0h, so it kind of clamps down you get a... Course Lou, get with the times, bro Right. Wow This one has a black skin on it from dbrand, but look at this. Can you appreciate what's happening here? That's the laptop I always wanted, you know? What really gets interesting is when you go with this Duet app that I'm talking about. Duet Display, it's called. You plug-in via USB and lightning and the reason for that is because you want to get close to zero lag. Lag is a nightmare anytime you're extending a display. Yes, trust. Woah, it's launching. Whoa, that is crazy town. That is so odd. Okay, hang on a second here. I can do 60 FPS, high quality. I'm gonna try Retina resolution. This is like my laptop but extended over onto the iPad. Now obviously if you're using it for video, you're going to want to be in... Look at that! It automatically adjust the resolution. Let's say I've got twitter open on this one. Maybe I want to use a portrait mode. Look at the multitasking right now. I've got a half way between the two. Can drag it over here like it have Final Cut open. Look at me right now. Who's better than you? You show up with this thing right here in the Starbucks, they're gonna be scared of you. They're gonna be like, \"Look at this - what's he's a... he's hacking the Pentagon over there.\"",
    "transcript_keywords": [
        "cool little contraptions",
        "found these cool",
        "iPad",
        "Macbook",
        "Display",
        "Duet Display",
        "laptop",
        "called Mountie",
        "open",
        "called Duet Display",
        "called Air Display",
        "called",
        "Duet",
        "wow",
        "Air Display",
        "contraptions",
        "found",
        "cool",
        "Mountie",
        "create"
    ],
    "transcript_entity_values": [
        "Duet",
        "Starbucks",
        "Air Display",
        "USB",
        "Final Cut",
        "close to",
        "60",
        "Duet Display",
        "Lou",
        "two",
        "Pentagon",
        "Macbook",
        "second",
        "iPads",
        "zero",
        "Duet Display",
        "iPad",
        "half",
        "Mountie",
        "one"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}