{
    "id": "JWZjOkgq_zg",
    "title": "I have always wanted to try these! - UE Fits Earbuds",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-05-04T19:59:26Z",
    "video_url": "https://www.youtube.com/watch?v=JWZjOkgq_zg",
    "category": "Science & Technology",
    "tags": [
        "Ultimate Ears",
        "Earbuds",
        "Wireless",
        "Bluetooth",
        "Custom Fit",
        "Audio",
        "UE",
        "Music"
    ],
    "views": 540607,
    "likes": 22517,
    "comments_count": 710,
    "description": "Sign up for Private Internet Access VPN at    Earbuds that truly fit your ears are fairly unique. Will music sound better or make things a bit more inconvenient since it will only work well for one person?  Check out the Ultimate Ear Fits Earbuds at   Buy Ultimate Ear Fits Earbuds On Amazon (PAID LINK):  On Newegg (PAID LINK):   Buy Google Pixel 4 On Amazon (PAID LINK):  On Best Buy (PAID LINK):  On Newegg (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.privateinternetaccess.com/ShortCircuit",
        "https://lmg.gg/WkSpG",
        "https://geni.us/nLvTAS2",
        "https://geni.us/iNIj",
        "https://geni.us/Nk1IU",
        "https://geni.us/Utsi",
        "https://geni.us/gawvt",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- I don't know if this is a good thing, but I feel like my whole career has brought me to this moment because when I was a kid, I always wanted to have those awesome earphones that are molded and custom fit. Today I finally get a chance with something like it. The UE FITS. Whoa, cool box. I kind of like this. This already looks like it's like molded. So it kind of evokes the whole reason. This thing exists. What the heck? Oh, it says ear tips are light sensitive. Set up promptly after opening. Maybe I'll just put this aside. USB A to C cable, presumably for charging the case. Ah, ah, this is like in American Psycho when he peels off that like skincare stuff. Now let's get to the fun part. Pop both earbuds into your ears, gently adjust them until they feel comfortable and secure. You will mold both sides at the same time. This is an interesting look, right and left. It says, put them in and kind of twist. These already have pretty good isolation. Next, apparently these are molded in 60 seconds. Let's do this. Gently hold your Earbuds in place the entire time I'm also going to keep my mouth open. Cause I saw the other types of earphones that mold they always have like a biting block. - [Andy] What? - This is totally my own thing. Hmm. It is warm. Okay. What a pleasant experience. This is really, it's really warm in the ears, and the music that was playing the whole time was really nice. And the visuals that went along with that process, that was that was a great experience. The story about the bite block thing. There's been other types of earphones that mold to your ears for a long time. They use different methods though, but almost all of them ask you to have a bite block. And the reason is when your mouth is like one to two inches open, it'll open your ear canals a little more. And that way, when you close your mouth, they'll like tighten on the earbuds. So you just, you get it even tighter seal. Okay. We're set up. We're in the App now. Press the button to check out the equalization curve they've applied. By default, you've got UE signature and you're, you can actually see what their signature curve is there. It's not flat it's actually bass in the boost and they bring down the highs a little bit, which is interesting. It looks like they have some presets, there's Bass Boost Bright, Hi/Lo Boost, Loudness which is just flat but louder and Spoken Word, like a preset just for podcasts, I guess. And it looks like it takes off the low end which I guess kind of makes sense cause people often use like really big compressor mics that make them sound boomier. You're like you've ever had a car drive past you when it's listening to a podcast. And it just that's like, (muffled sounds) if this were me, I would probably hit the plus button for a new preset. And I would just save this flat unless maybe the UE preset the EQ that they have on there, maybe that signature accounts for the characteristics of these earphones and actually boosting the base and taking down the mids, makes it flat. So you might actually be making them worse if you just apply the flat EQ, so I don't know, regardless, I'm going to test it with the signature, EQ out of the box. Let's see how these puppies sound right after this message from our sponsor, PIA. Private internet access VPN helps you access services and websites as if you are in a different country. They encrypt all your internet traffic and use a safe, protected IP and you can connect up to 10 devices at once including clients for Windows, Mac, Android, IOS and even Linux. You can buy a one-year plan for 39.95 using our link below. And you should because PIA is good and only good things should exist in the world. You know, bad things are bad. Bad sucks. Be good. Get PIA. Let's start with some electronic music. Have you seen this video of these guys? Like in Norway, like thousands of feet. It's just insane. This is like one of the sickest DJ sets ever. Oh, there's a big drop coming. I'm excited for this. (music builds) It's pretty immersive. How loud is it though? If it's super loud, then that's just kind of cheating. Oh, the bass just kicked in, it's low. Andy's trying to talk to me, I can't hear you. What? You can hear my, it's bleeding. - [Andy] Yeah! - It's not even that loud, here, I'll max it out. It's about halfway, Oh, I don't even want to max it. It goes pretty loud. Hoa! I'm going to test now. Will they pause when I take them out? Nope, Still playing. I can Name my headphones, single tap On and Off, double tap On and Off. Okay, So that's where you're working with single and double taps. You can have these set up so that the actions are symmetrical on both earphones or you can have different commands for each ear. So let's see on the left right now there it's Play and Pause and so is the right, but you can also go Next Track, Previous Track, Volume Up and Volume Down. I'm going to go for Double Tap on the left is Previous and double tap on the right is Next. And then I'll single tap will be Play and Pause. I guess I'll just do Volume on my phone. So these options aren't as rich as what we saw on the Razer Hammerheads. There's no triple tap. There's no long press, but this is workable. It's not my favorite, but it's workable. You could get used to it. These single taps are doing nothing like how hard and how flat does my pad have to be on here? Okay. That registered with double. I'm going to toggle single top on and off. It is cool that you can toggle these different interactions just off if you want. Yeah, the single tap is just not working for me. I'm going to try changing the single tap to a different action, like Volume Down. Let's see if that does anything. That's working. Okay, I do not recommend tying volume actions to a single tap because you're gonna end up going volume down, down, down, down, down and then that's going to be a double tap and change songs which is what just happened to me. Okay, now I'm going to make it Play, Pause and see if that does anything. Okay, we got it. We just had to change it and change it back. Still, the interaction isn't very consistent. You can see, of all those strikes, only the final one did anything. It seems like you gotta be really deliberate. You can't just say quickly go like that. Oh, actually that did work. And that was like a glancing one. Okay. So it seems like it's less about where and the contact and more about the impact. If I hit it with like pretty good, nevermind. Nevermind. That didn't do anything. Okay. So the interaction is a bit spotty but I think you could probably get used to it. But I just learned something new. I had the earphones disconnected from my phone and then the charge case died. Even though the ear phones still have lots of battery on them, then I went to reconnect the earphones to my phone and I couldn't reconnect them. Even though they have battery, I think this thing needs to have some battery for them to reconnect. So I plugged it in, put the earphones back inside then it reconnected. I don't think all wireless earphones work like that. I don't think my SoundCore Liberty 2 Pro's work like that. Although they have buttons on them for pairing. So that's probably the difference there. Just something to be aware of. Now I want to test another claim from Ultimate Ears which is that they're like the best fitting ear phone, that they have this Fall Out Free fit. So for that, I'm going to need some very noisy heavy metal music to bang my head around to while listening. And I'm going to use arguably System's best song, Deer Dance. (loud music playing) While they're in there, those are not a, whoo, kind of dizzy. I'm confident you could, you could do burpees or honestly you could probably get slapped in the face with these on. They're going to stay. There's still one other intermittent issue I keep having with these is that I get a spotty connection sometimes. And it's really disconcerting because maybe they'll go away with an update. Maybe I'm the only one experiencing it. And it has to do with my phone or something but maybe like five or 10% of people who buy these will have these connection issues where it starts studing or stuttering or hitching. That leads me to my final take on these earphones, the 250 bucks. But to me, these are pretty much comparable to other $200 ear phones I've used, except I guess they tack on an extra 50 bucks for the forming quality. I kind of wish they didn't but the industrial design is awesome. I think they look good. They look unique. They don't look like AirPods rip offs, they don't look like generic beans. The sound quality is great. The fit is very comfortable. I could probably wear these for hours. The interaction is okay. I could probably get used to that and the connection issue or I don't know about that. So I would recommend these, especially since they have a 30 day guarantee you can send them back after. And that's really nice to see considering that these are one-time use. Once you mold these to your ears, there's no going back. They do say that they're going to sell replacement silicone tips on their website. I don't think you can buy them just yet though. And unless you buy new ones, you can't redo the molding process like you can with some other moldables. So I think that it's pretty safe to audition them for for a month. See if you have a connection issue, see if you like the fit and then if it doesn't work out for you, send them back. It's nice that they're giving you the option. Also I'd be remiss, if I didn't show you the other colors now, I can only just show you these briefly because as soon as the light hits them they're going to start the molding process. So these ones are black and these ones are lilac. That looks a little different cause it's still in the plastic. But I think those are nice color options. I personally, I think I'd go with the white. If you liked this video hit like hit subscribe and hit us up in the comment section if you end up getting these things with how well that EQ setting works the podcast EQ, I want to know how that works. You know what? If you have to listen to a podcast to test it, why not check out the Carpool Critics movie podcast co-hosted by myself David and Riley from TechLinked. See you later.",
    "transcript_keywords": [
        "tap",
        "single tap",
        "earphones",
        "double tap",
        "single",
        "Volume",
        "ear",
        "career has brought",
        "kind",
        "good",
        "ears",
        "double",
        "flat",
        "pretty",
        "thing",
        "phone",
        "pause",
        "ear phones",
        "hit",
        "back"
    ],
    "transcript_entity_values": [
        "up to 10",
        "this Fall Out Free",
        "Carpool Critics",
        "one-year",
        "Loudness",
        "IOS",
        "Riley",
        "Play and Pause",
        "one",
        "USB",
        "Deer Dance",
        "UE",
        "IP",
        "Andy",
        "an extra 50 bucks",
        "250 bucks",
        "PIA",
        "American",
        "Windows, Mac",
        "max",
        "Off",
        "30 day",
        "David",
        "Norway",
        "39.95",
        "the Razer Hammerheads",
        "Linux",
        "a month",
        "60 seconds",
        "10%",
        "Ultimate Ears",
        "Android",
        "200",
        "TechLinked",
        "two inches",
        "EQ",
        "hours",
        "Next Track",
        "VPN",
        "System",
        "Next"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "EVENT",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "MONEY",
        "PERSON",
        "NORP",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "GPE",
        "CARDINAL",
        "LOC",
        "PERSON",
        "DATE",
        "TIME",
        "PERCENT",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORG",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG"
    ]
}