{
    "id": "jXz7NVX_O-A",
    "title": "LG G8 Teardown - Dont Remove The Battery?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-05-09T13:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=jXz7NVX_O-A",
    "category": "Howto & Style",
    "tags": [
        "LGG8",
        "LG G8",
        "LG G8 Teardown",
        "LG G8 review",
        "LG G8 disassembly",
        "take apart LG G8",
        "LG",
        "Mobile phone",
        "android",
        "iphone",
        "technology",
        "best smartphone",
        "boycott",
        "LG G8 ThinQ",
        "LG G8 battery replacement",
        "LG G8 Screen repair",
        "LG Battery boycott",
        "LG Battery",
        "Permanent battery",
        "OLED speaker"
    ],
    "views": 1460899,
    "likes": 42526,
    "comments_count": 2960,
    "description": "The LG G8 is a flagship smartphone with modern features, and from the outside it looks like a winner. But what does the LG G8 look like on the inside? This Teardown of the LGG8 reveals that the battery is permanently glued into the housing, and is not replaceable. I think this is unacceptable. If you are deciding between 2 phones to buy, You should NOT buy the LG G8 until they fix their battery adhesive, and add pull tabs under the battery. Batteries dont last forever. And eventually someone is going to either replace the battery, or recycle this phone. And when that day comes... the battery needs to come out easier than this.   I will update this description if LG Changes their manufacturing process to add pull tabs or different adhesive.  LG G8 Durability Test:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/DDZY8qPSUbg",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today's video is a bit different. I'll still be taking apart a pretty averagely built smartphone, but I'll be talking about something that's pretty important revolving around the way LG installed their battery. Even when turning the phone on, we find a warning talking about how we shouldn't ever remove this battery because it's a safety hazard. Repairing cellphones is not normally a safety hazard, so if it is a safety hazard, it's LG's own fault and I've got some words to say to LG about that. Let's get started. [Intro] Taking apart the phone is normal enough. Everything is glued shut like we see on most flagship smartphones, which just for the record, I'm fine with. It helps with waterproofing and looks pretty sleek. Not a big deal. A professional can still get inside the phone in about 10 minutes, and even an average person, with a few cheap and simple tools (which I'll link in the description), can also open up their own phone. It's safe...assuming you don't cut yourself of course. The heat gun softens the adhesive, and a large suction cup helps release the pressure on the glass so I can slice through the adhesive underneath. LG has made each edge of the back glass have it's own curve, which does complicate things a little bit, but still, not a big deal. And if the back glass does break, it's only like $10 to replace. The back panel, which doubles as a camera lens, is finally removed, revealing the fingerprint and scanning hardware that rests up against the motherboard's gold contact points. Pretty normal so far. We can see the cameras and the one way wireless charging coil. And, lucky for us, only 14 normal Phillips head screws are holding everything in place. If you've been watching my channel for a while, you probably know this is a pretty typical smartphone tear down so far. The wireless charging pad comes off with the top plastics. Taking apart the G8 might even be a bit easier than normal since the screws aren't proprietary. The bottom plastics have the loudspeaker attached with the waterproofing mesh over the speaker opening. The problem that I have with the LG G8 is this: the battery - not because there are no dogs allowed, bu because the battery is the one dangerous component inside the phone, and LG used permanent adhesive to hold down this battery. There are a lot of safe ways to secure batteries. Static pull tabs, like we've seen inside the OnePlus phones, or magic pull tabs, like all the iPhones have. Or even gentle adhesive like the HTC phones those can be removed by hand. Permanent adhesive is dangerous and stupid. Bending batteries during the removal can crush the anode and cathode layers together, causing a short, or sparks, or even explosions like we saw with the Samsung Note 7 and the subsequent recall. Accidental punctures can do the same thing. LG has put anyone who tries to repair their own phone at risk by using this much permanent adhesive...which is probably why they added that disclaimer when turning on the phone. It's their way of decreasing liability while still making their phones difficult to repair. Planned obsolescence isn't cool. Even if you take very good care of your phone, battery lifespan decreases a lot after the first year. My own Galaxy S8 Plus that I've owned for over two years now needs to be charged up almost twice a day. It's ready for a new battery because batteries don't last forever. People who want to save money can save a ton just by getting a new $20 battery replacement. Plus, it's better for the environment to reuse a phone than it is to buy a new one. Even alcohol, which sometimes is used to soften adhesive, is not working on LG's battery. Yeah, heat might help a bit, but heating a battery is also super dangerous. LG has intentionally and dangerously made their batteries very difficult to remove. Basically what I'm saying is, if you're on the fence deciding between this phone and another phone, skip the LG G8. From now on, if a smartphone has a permanently glued in battery with no pull tabs, it's getting a veto from me no matter how cool it is. Battery replacements should not be dangerous. Safe pull tabs cost pennies to manufacture, and are just as easy to add underneath the battery as permanent adhesive is. There's no reason why pull tabs aren't installed on every phone. Alright, now that we got that out of the way, let's see what else LG has to offer. There is one screw holding down the headphone jack. The headphone jack is something I do like. It has a little rubber lip to help keep a tight, water resistant seal around the edge. The LG G8 is ip68. I'll disconnect the screen, the front facing camera, and the front facing 3D time-of-flight camera. And I'll remove the dual slotted SIM and SD card tray. LG has done a lot of things right on this phone, don't get me wrong, I'm just saying unsafe battery installations need to stop. The charging port is attached to the underside of the main board. So all the circuit boards will still come out together at the same time. And take a look at that. Remember in the durability test where I assumed the front earpiece was just a vibrator? Well, I was wrong. That massive rectangle there in the center is LG's crystal sound OLED speaker. It's what causes sound to emanate from the top half of the phone, instead of having a traditional speaker up top. I'll dig more into it in a second. First, let's get those cameras out. The larger time-of-flight camera is on the left with it's googly-eyed sensors. A TOF camera is a range imaging camera system that sends out light pulses and then the camera's sensor measures the return time of each pulse, mapping things in 3D. This allows for those accurate hand gestures and stuff. The other little camera is an 8 megapixel normal selfie taker. Now let's see what we can do with this large rectangle. I'm not an expert on sound behind screen technology, but LG has been using these little rectangular exciters behind the panels in their TVs for quite a while now. So it's cool to see the technology bleed over into the mobile cellphone world. The exciter is held super tightly behind the display with some foamy adhesive. I was worried about breaking the display at first, but it looks like there is a metal layer between the exciter and the AMOLED. I'm assuming this uses small electromagnets to vibrate and project sound through the display using the screen as a diaphragm. It'll be interesting to see if these become more common in the future. LG has included a heat pipe inside the flagship G8. This helps dissipate heat coming off of the Qualcomm 855. Slicing open the pipe, we can see the liquid quickly evaporate out of the copper. LG is using the same style of pipe that we saw in the Galaxy S10 with the kind of dirty internals. There's probably a reason for the dirt...I just don't know what it is. There is a triple camera setup on the phone. If you're going to buy the G8 in the USA though, it'll only come with 2 cameras....also, don't know why, but that's just the way it is. The main 12 megapixel camera does have OIS. The 16 megapixel ultra-wide camera does not have optical image stabilization. And the third camera, which is not included on USA models, is the 12 megapixel telephoto camera, with 2x optical zoom. The charging port is detachable and replaceable. Thumbs up for that. Having modular internals helps the device stay alive longer. And with phones, as good as they are nowadays, there's really no reason to be upgrading every year. Overall, I'm pretty impressed with the LG G8. They've really stepped out of the box and done some really awesome innovative things that I definitely want to see more of in the future. Cellphones don't last forever though, so until they make their batteries safe to remove with pull tabs or softer adhesive, I'm not going to recommend it. If LG does add battery pull tabs to their manufacturing process, I'll be sure to update the description of this video and let you know over on Twitter. I'll get everything clipped back into place and the plastics set where they should be, with the glass panel set back on the phone, and the SIM card tray installed. Check that out the whole thing still works. Yeah, the battery got bent during removal and could explode at any time now, but I'd like to live life on the edge. Hit the subscribe button if you haven't already, and come hang out with me over on Instagram and Twitter. Thanks a ton for watching. I'll see you around. [Female voice] Amazingly the speaker is still working...even if it crackles.",
    "transcript_keywords": [
        "phone",
        "battery",
        "camera",
        "pull tabs",
        "adhesive",
        "safety hazard",
        "permanent adhesive",
        "pull",
        "tabs",
        "phones",
        "pretty",
        "battery pull tabs",
        "back",
        "normal",
        "batteries",
        "cameras",
        "glass",
        "things",
        "bit",
        "hazard"
    ],
    "transcript_entity_values": [
        "HTC",
        "OnePlus",
        "Qualcomm",
        "Galaxy S8 Plus",
        "8 megapixel",
        "ip68",
        "SD",
        "about 10 minutes",
        "Instagram",
        "G8",
        "20",
        "jack",
        "2x",
        "12 megapixel",
        "half",
        "a ton",
        "Phillips",
        "SIM",
        "USA",
        "iPhones",
        "first",
        "second",
        "the first year",
        "Samsung Note 7",
        "First",
        "third",
        "Today",
        "16 megapixel",
        "only like $10",
        "over two years",
        "every year",
        "AMOLED",
        "one",
        "the Galaxy S10",
        "2",
        "Twitter",
        "LG"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "GPE",
        "NORP",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "MONEY",
        "DATE",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}