{
    "id": "JYEAE-QTAUM",
    "title": "I Went Into A Shop...And Bought A Graphics Card 😱",
    "channel": "Dawid Does Tech Stuff",
    "channel_id": "UCvcRA2Hva1lULVf4GCouH8w",
    "subscriber_count": 688000,
    "upload_date": "2022-04-27T17:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=JYEAE-QTAUM",
    "category": "Science & Technology",
    "tags": [
        "dawid",
        "dawid does tech stuff",
        "PC",
        "gaming",
        "intel",
        "AMD",
        "Corsair",
        "Gaming",
        "Game",
        "Computer",
        "Gaming PC",
        "David Does Tech Stuff",
        "DDTS",
        "Tech",
        "Stuff",
        "msrp",
        "graphics card",
        "rx 6600"
    ],
    "views": 198369,
    "likes": 9785,
    "comments_count": 774,
    "description": "I actually managed to buy a new graphics card from a shop for basically MSRP.  Check out the awesome Hardware Unboxed Video GPU Market breakdown here:   Get some AWESOME Dawid merch here:   -Here is a link to my Patreon page, it would be awesome if you check it out:   -Follow me on whichever Social media you don't hate-  Discord:  Twitch:  Twitch shorts channel:  YouTube:",
    "description_links": [
        "https://www.youtube.com/watch?v=gMUcZ7978rc",
        "https://dawiddoesmerch.com",
        "https://www.patreon.com/DawidDoesTechStuff",
        "https://discord.gg/b34uVGaYVB",
        "https://www.twitch.tv/dawiddoestechstuff",
        "https://www.youtube.com/channel/UCAiMJaOrvTik7XyJethz-ig",
        "http://www.youtube.com/c/dawiddoestechstuff"
    ],
    "transcript": "The weirdest thing happened the other day. Anna walked into a computer shop and bought a graphics card. She didn't even have to queue for beets for three months or anything! And that isn't even the craziest part about it, because this graphics card cost basically MSRP! I paid 449 Canadian rubles for this RX 6600. Which translates into about US$ 350. And that is only US$ 20 more than the launch MSRP of this graphics card. And I'd go as far as to say, that kind of counts as MSRP considering that even before the scalpocalypse, US MSRP was very rare in Canada. So what we're gonna do to celebrate this momentous occasion, is we're gonna unbox the graphics card, and we're gonna... you know... rub it on our face a little. Just to make sure it's real! And then we're gonna play some games on it. Oh yes, a Gigabyte Eagle card. This is like the eighth one I've had a look at recently and it's starting to feel like they're stalking me. Although this one did seem to have the best cooler for the money, so I grabbed it. Oh the box has been a bit savaged but that's okay. That is actually a lot of thick foam and under that we have a graphics card. That we just bought in a shop! I didn't even have to do anything dodgy in an alley for it and now that we have it out of the box, the first thing we need to do is... Oh it's real...It's definitely it's definitely real. Wow, that is a long skinny boy of a graphics card. You can see that it's actually only two slots. Now considering that it's a Gigabyte Eagle card, it does use the same crappy-ish plastic build, that the other eagle cards use. Although this one does have a much bigger cooler, and that combined with the short PCB, is why we can have such a huge cooler pass-through on the back of the backplate which has become so popular since the launch of the 3080. In terms of power we just have a single eight pin which is nice. It means it's not going to draw up 400 watts which is good and then on the back we have two display ports and two HDMI. But now as is tradition, it's time to potentially break the graphics card while trying to tear it down. So let's jump to after the testing and see how it goes. All right let's crack into this basically MSRP 6600. Ah it all tore... Now on to the three fans. This is quite a basic cooler. We do have three heat pipes touching the GPU and then we have thermal contact with the video memory and the VRM so hopefully it gets the job done. And then, when moving over to the back plate you can see that that is some some primo quality plastic we've gone going. But it does make sense. There's a big hole cut out in it. Having a look at the PCB, that looks like a mid-range-ish graphics card PCB, with its eight gigs of gddr6 and then the tiny little rDNA ii GPU. We also have six power phases on this PCB. Which should be fine considering the low power draw of the RX 6600. But actually, let's get this very well constructed high quality plastic back-plate off and have a look at the back. Wait, what? Why are there thermal pads on the back of a plastic back-plate? I feel like that... I don't feel like that's gonna be doing much is it? Am I missing something here? Is this some kind of new thermally conductive plastic? And when we have a look at the back of the PCB it seems like that cod piece plastic back-plate makes contact with the back of the GPU and the back of the memory... That's interesting and on that seemingly pointless note, let's get into the gaming! Okay, this is tradition we're starting with 'cash grab', the game. Uh, I am curious to see if we're gonna get stutters with this configuration. Though uh we are running at very high settings at 1080P. Okay, so let's try... uh oh... No, it's pretty stuttery. Battlefield 5 does tend to quite like AMD GPUs and it shows because that is a very solid 1080P Battlefield 5 gaming experience. With this 6600, we are running it at Ultra settings which you shouldn't do. The high settings are are much more reasonable. But yeah, would you look at that! that's running beautifully. Whoa, that's good. Uh 1080P high and we're just solidly above 60 frames per second, which for a game like this, which is more visual safari than it is competitive fps I think that is a perfectly good range to be in. Um yeah, this is good. It feels nice. It looks great actually. In terms of efficiency, this thing is really impressive because it's using about 30 percent less power than that RTX 3050 did and we're getting more performance. So that's pretty cool. AMD is definitely going in the right direction in terms of efficiency. As opposed to Nvidia very much going in the wrong direction. But with that, before we compare this graphics card to something, let's just have a quick look at some benchmarks as a baseline. As you can see, the first basically MSPR graphics card I've been able to buy is a real 1080P little beastie, and in fact Hardware Unboxed recently did a very good GPU market analysis video where they were showing that the RX 6600 is one of the best frame per dollar graphics cards you can buy at the moment. I'll have that video linked in the description below. It is some primo consumer advice. But with that I thought it would be interesting to compare the RX 6600 to one of its older brothers the RX 5700. Okay, so with the 5700, we seem to be getting a slightly higher average than we got with the 6600 but in all fairness the RX 5700 - the older graphics card - is drawing more power to get this performance at 130 watts. Actually, on that note, with the RX 6600, you do have the option to increase the max power limit from 100 watts to 120 watts - so let's see if giving it that additional bit of juice will actually help it close the gap between it and the 5700. Oh wow, okay that didn't make too much of a difference. But with that let's see how the 5700 handles a more demanding game. Okay, damn! So cyberpunk also seems to be running just a hair better than the 6600. Functionally both GPUs offer about the same gaming performance. This feels good and I think in a blind test you probably wouldn't be able to tell. But let's be let's be more specific here. Let's have a look at the benchmarks and and see how they compare. So according to my tests it seems like the RX 6600 is just a hair slower than its older brother, the RX 5700. Luckily, because of progress the RX 6600 was launched at a much lower starting MSRP. That happened right? The RX 6600 it's cheaper now right?",
    "transcript_keywords": [
        "graphics card",
        "card",
        "graphics",
        "Gigabyte Eagle card",
        "MSRP",
        "graphics card PCB",
        "back",
        "PCB",
        "Eagle card",
        "basically MSRP",
        "MSPR graphics card",
        "plastic",
        "good",
        "power",
        "GPU",
        "Gigabyte Eagle",
        "older graphics card",
        "graphics card cost",
        "card PCB",
        "plastic backplate"
    ],
    "transcript_entity_values": [
        "first",
        "six",
        "6600",
        "three",
        "Nvidia",
        "only two",
        "Battlefield 5",
        "only US$ 20",
        "VRM",
        "1080P. Okay",
        "1080P",
        "three months",
        "3050",
        "MSRP",
        "two",
        "MSPR",
        "Canada",
        "3080",
        "eight",
        "AMD",
        "about 30 percent",
        "5700",
        "100 watts",
        "second",
        "the RX 6600",
        "130 watts",
        "PCB",
        "gddr6",
        "6600",
        "RX",
        "about US$ 350",
        "one",
        "449 Canadian rubles",
        "GPU",
        "the RX 6600",
        "Anna",
        "Hardware Unboxed",
        "MSRP",
        "60",
        "AMD",
        "Gigabyte Eagle",
        "The RX 6600",
        "400 watts",
        "the RX 6600",
        "US",
        "eighth",
        "120 watts - so"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "LAW",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "GPE",
        "ORDINAL",
        "QUANTITY"
    ]
}