{
    "id": "jYfWl0lwXr0",
    "title": "Don't wait for the Xbox Series X! - NZXT BLD H1 Gaming System",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-03-19T00:11:16Z",
    "video_url": "https://www.youtube.com/watch?v=jYfWl0lwXr0",
    "category": "People & Blogs",
    "tags": [
        "PC",
        "Gaming",
        "System",
        "NZXT",
        "H1",
        "Case",
        "BLD System",
        "Pre-Built",
        "NVIDIA",
        "Intel",
        "9900K",
        "2070 Super",
        "PCMR",
        "Series X"
    ],
    "views": 885718,
    "likes": 29891,
    "comments_count": 3405,
    "description": "Thanks, NZXT for sponsoring today's video! Check out their BLD systems using the H1 case at   The next-generation consoles are around the corner, but what happens if you want the look yet you want to still play only on the PC?   Buy NVIDIA 2070 Super Video Cards On Amazon (Paid Link):  On Walmart (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy 9900K Processors  On Amazon (Paid Link):  On Walmart (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy NZXT Computer Cases On Amazon (Paid Link):  On Walmart (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy Gaming Monitors On Amazon (Paid Link):  On Walmart (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy Gaming Mechanical Keyboards On Amazon (Paid Link):  On Walmart (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy Seasonic Power Supplies On Amazon (Paid Link):  On Walmart (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy Gaming Mice On Amazon (Paid Link):  On Walmart (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://nzxt.co/ShortCircuitH1",
        "https://geni.us/IiAF",
        "https://geni.us/40GYV",
        "https://geni.us/ZwqLC",
        "https://geni.us/Lq5g",
        "https://geni.us/fEtaKob",
        "https://geni.us/eETgPIP",
        "https://geni.us/lOHg",
        "https://geni.us/MzpR",
        "https://geni.us/F2l4d",
        "https://geni.us/Gaynp",
        "https://geni.us/VhAYg4",
        "https://geni.us/qm1xv0",
        "https://geni.us/Hi7Xm4f",
        "https://geni.us/oNCl",
        "https://geni.us/HBzkYSM",
        "https://geni.us/ol41Jd",
        "https://geni.us/iHt2s",
        "https://geni.us/r926Bi",
        "https://geni.us/3ZIOc2u",
        "https://geni.us/4ERBY",
        "https://geni.us/etl1L",
        "https://geni.us/DsGfBwY",
        "https://geni.us/dEpe",
        "https://geni.us/DQ9Nkqa",
        "https://geni.us/dnS4zip",
        "https://geni.us/MpDikkI",
        "https://geni.us/il5xA",
        "https://geni.us/rcbiQP",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- This video is sponsored by NZXT. You can check out their build systems below. I, forgot to do the disclosure early enough in the video. I have actually already opened it now but (playful music) The next gen game consoles are coming, but maybe you're the kind of person who's like, (yawning) 'cause the reality of it is, you're just going to game on PC anyway. That is exactly who NZXT has in mind with their build systems featuring their H1 case. Oh, it's got the size and they couldn't have possibly planned this because we've only known about the look of the Xbox One Series X for a very short period of time. But also the shape of the next gen console experience but with the power of a gaming PC. (plastic rattling) Alright, let's have a look at this thing. Packing material looks pretty good to me. Nice soft foam, lots of protection and not the rigid kind, where if it takes one bad hit, it's like done the next time someone drop kicks it onto your doorstep or whatever the case may be. Tempered glass panel right there. And wow, the entire rest of the thing, this is my first time seeing it in person, is all just ventilation. It draws obvious comparisons to the Corsair One, both in terms of the form factor and like, the way the vent holes are configured. But unlike the Corsair One, they haven't really tried to gussy up the vents. So they're just like, \"Yep, these are vent holes. They're everywhere. Don't worry about it.\" On the top, we've got, Oh, that's interesting, we've got power, USB 3, USB more different 3, that's a type-C port, as well as a 3.5 millimeter jack but only a single audio jack. I would have to assume that's a headphone jack rather than a microphone one. I guess there is a large scale shift to USB audio solutions especially for microphones but hey, there you go, it's not there and then, oh. Oh. This is why it's more fun, if I don't actually do any prep. I did not know the IO was on the bottom, so that's cool. So all your cables come in here at the back plug in just a little, something like that. And then you've... That actually that's really clean. It means the whole outside of it is just ventilation. Now, let's crack this thing open and have a look at what kind of specs we're dealing with. It's always kind of fun for me to look at the people that are like salivating over the next gen console like, \"Wow, they're gonna be so powerful. They're gonna have AMD gen 2 CPUs and they're gonna have like this graphics card and studiously...\" Yeah, okay, this is gonna be pretty cold people. Anyway, so let's have a look at it what the layouts like inside. There's some foam packed in here that's pretty standard system integrator fare, if they want their systems to survive the journey to their customers. And wow, they have done a lot of custom work for this thing. So the PCI express riser is actually curled. You can see here, it's like kind of bent around this bracket that's gonna keep it from shifting at all. That's pretty cool and then we've got a, like a reference founder's edition. I believe that's a 2070 Super but don't quote me on that yet. We're gonna try and get another panel off here and take a closer look at it. Our power supply's up at the top drawing fresh air in from this ventilation panel right here and exhausting it out the back and then check that out. That is a 140 millimeter all in one liquid cooler. So that's handling CPU cooling duty and you can see the motherboard has really been squeezed down to exactly as slim as it can be with that kind of cooling puck mounted to the CPU over there and then reasonably low profile memory although it does still have heat spreaders on it. It's nice that everything's been tool-less so far. So if you wanted to add like a two and a half inch drive upgrade or something like that you could do that without breaking up the screwdriver but we wanna go a little bit deeper. Oh. Alright, well that's how the tempered glass panel comes off. Just those little ball and socket joints there. And we've got some more foam that we need to remove in order to make sure that our graphics card is getting adequately cooled. Cable management is definitely a plus on this thing so far. Like it's not a, you know, Mac pro or whatever, so like, we engineered this PC for two years, but it's really clean. Everything is tucked away, super nicely and they've got little panels like this to hide any excess. Oh, does that? Look at that, that's tool-less too. Wow. Alright. I like it. I really liked the care and attention they've put into protecting the PCI express riser cable. It's really easy for these to suffer from signal degradation which can cause problems that are not always easy or fast to diagnose. So, it's great, they're just taking every precaution here to make sure that the panels aren't pressing on them or anything like that. I really want to remove these other panels but everything's been so easy so far that I'm afraid that if I press too hard on anything... And I'm probably doing it wrong. You know? I think it's entirely possible that the chassis doesn't come apart without removing these little grommets and undoing these screws I think. This is as far as your intended to go as someone who's bought a completed system. I mean, it's not the end of the world. You can easily access your graphics card for upgrades. They've got a couple of thumb screws here. And this is nice the modular interface on the power supply is right next to these power connectors. So it's super easy to change one of these out or whatever the case may be. But, I think as someone who bought a completed system that is about as far as you're expected to go. Power supply could also be swapped without too much trouble but there are some screws in there that are kinda hidden away a little bit. So you'd really want access to this top panel if you were to try to take that one out. So graphics card upgrade that's about all you can really do with it but you know what? I guess I'm okay with that. Besides we've got a separate video coming over on the Linus tech tips channel where we're going to be building up in one of these rather than getting a pre-assembled one. So why don't we just take a look at what we can expect from one of these completed systems then? - [Man] Oh my God. Oh, no, okay, oh. - Come on NZXT give me a little vinyl sticker, you know? No don't cut the camera, this an important tech tip, oh wait, wrong channel. It's a, it's a short tip. (upbeat music) Man! I got to clean the monitor. I peeled the ROG off my monitor. Look at this. Now it's not for gaming. Like, there it is, it's off. It's only half of gaming now. So yeah, I mean, it's just nig, just nig. While I load a the game and some benchmarks, so we can make sure the CPU and graphics card are working properly, we can load up NZXT's CAM software. We've got a 9900K, 16 gigs RAM, RTX 2070 Super. Looks like a terabyte of storage. Yep, terabyte of NVME storage, not too shabby. It also gives us all of our monitoring information so we can see temps, CPU load, fan speeds, all that kind of good stuff. And I think, that's pretty darn quite, yeah, I would believe 700 RPM. That'll be a good stress test, let's go ahead and fire up Cinebench R20, while we're downloading a game. So we should be sitting real nicely at a 100% CPU usage. We won't be able to take the score or anything like that but a 9900K is sort of a 9900K. I just wanna know what kind of temps we're gonna hit. Normally inside compact cases like this, some of the hardware components can suffocate but what's cool is the intake for the CPU cooler and the power supply are right along here, easy access and happened to be filtered. And the intake for the graphics card, same deal, with most of the exhaust coming out at the back here. So I would expect, we never hit higher than about 45-50 degrees on the CPU. I would expect that to say pretty consistent. Shoot! This is a very early save game. That's okay, it's runnin' super smooth here. This is at 4K all high with motion blur off and just basic anti-aliasing. And besides the thing that I wanted to know was just how loud this thing's gonna get in game 'cause while it is an advantage for cooling, it means your fans aren't gonna ramp up so high to have the intake right next to the graphics card. It also means that the sound can come right out. Now, I would put the system to my right, just so that the graphics card is behind the tempered glass that will help a little bit. That is pretty darn quiet. Well, that's it. Here's one of NZXT's build systems in their H1 case. It doesn't do me much good to tell you what the price is because you can configure it. Thanks to them for sponsoring this video and make sure you are subscribed to Short Circuit. Yes, you are in fact, looking at a different channel. Actually had a number of you, report to me that this short circuit channel is using your videos and your likeness in order to capitalize. But it actually is me, it's just me. This is a different channel. Appreciate you though.",
    "transcript_keywords": [
        "graphics card",
        "CPU",
        "kind",
        "graphics",
        "card",
        "pretty",
        "thing",
        "power",
        "NZXT",
        "build systems",
        "systems",
        "power supply",
        "panel",
        "game",
        "Super",
        "NZXT build systems",
        "system",
        "easy",
        "wow",
        "channel"
    ],
    "transcript_entity_values": [
        "3",
        "700",
        "USB 3",
        "100%",
        "One",
        "2070",
        "H1",
        "4",
        "one",
        "USB",
        "Corsair",
        "Xbox One Series X",
        "two years",
        "Mac",
        "140 millimeter",
        "only half",
        "CAM",
        "IO",
        "Cinebench R20",
        "ROG",
        "first",
        "NVME",
        "16",
        "AMD gen 2",
        "about 45-50 degrees",
        "3.5 millimeter",
        "Short Circuit",
        "PCI",
        "Linus",
        "CPU",
        "jack",
        "NZXT"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG"
    ]
}