{
    "id": "Jys2vEyUOTw",
    "title": "Am I wasting my money? - LTT Labs Update",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-07-19T18:27:47Z",
    "video_url": "https://www.youtube.com/watch?v=Jys2vEyUOTw",
    "category": "Science & Technology",
    "tags": [
        "the ltt lab",
        "am i wasting money on the lab",
        "is the lab a waste of money",
        "the future of this channel",
        "enhancing our testing"
    ],
    "views": 1680217,
    "likes": 78912,
    "comments_count": 4302,
    "description": "Go to  to get $5 off your first purchase!  Check out the ViewSonic ELITE XG321UG at   It's been a few months since we announced LTT Labs, my master plan for revolutionizing the testing that backs our content, so I figured it was time for an update on exactly what we've been up to over there.  Discuss on the forum:   Buy Photography Light Box:  Buy Logitech Brio 4K Webcam:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:16 Audio testing 4:55 Keyboard testing 10:21 I learned powerpoint today 10:42 Automated game testing 13:21 The Lab video game - how the lab facility will look once setup 17:04 Outro",
    "description_links": [
        "https://privacy.com/linus",
        "https://lmg.gg/ViewSonicLTT",
        "https://linustechtips.com/topic/1444270-am-i-wasting-my-money/",
        "https://geni.us/cKhX4i",
        "https://geni.us/K6fiWA",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- We have shown you the lab, my master plan for revolutionizing the testing that backs all of our content, at least the shell of it. And we've shown you the person in charge. Hi Gary. - Hi. - But that's only two parts of a much bigger puzzle and we've already spent hundreds of thousands of dollars on testing equipment. So it's a good thing I'm already on the floor. Ahh. Let's take your journey then and see exactly who I can introduce you to so far and what it is that they've been doing, right after I do tell you about our sponsor. - ViewSonic, their Elite XG321UG mini-LED monitor, offers a 4K native resolution IPS panel with a 144 Hertz refresh rate. It comes with G-Sync Ultimate R4 and a quantum dot color layer. So it's great for both gamers and creators. Learn more at the link down below. (upbeat music) - Long term, our intention is to have an expert for every major field of technology we cover. That'll include mobile phones, displays, TVs, monitors, projectors, PC hardware, audio, pretty much any other category that you have seen on our channels. The script calls for me to talk about our mechanical engineer, Antoine, but instead we're going to start with Sam. You've been specing out a gauntlet of grueling tests to run headphones, speakers, and microphones through in order to help our viewers decide, which ones they should consider. I mean, I think it's clear from what we've talked about so far that our intention is not to say definitively this is the one to buy because it's a very personal choice, but there are certain things that can be absolutely quantified. We've got frequency response tests, distortion tests, isolation tests, leakage tests, and more. What are you working on right now? - So in terms of update, I can tell you that we have placed the order for the head simulator B&K 5128 and also for the audio precision 517 testing system. Because the equipment hasn't the arrived yet, I've been looking at all of the frequency response measurements that I have done on humans on a bunch of headphones and I have something interesting to show you in terms of the headphones that have noise canceling. You wanna see? - Really? Yes, I would like that very much. - This is really cool. - I feel cool. - A lot of people don't know that with closed back headphones, having an airtight seal between the ear cups, it's critical for delivering a lot of bass. And if you have glasses on or LTT store hat. - Lttstore.com, gotta pay these guys. - Or LTT store beanie. - Sure. - You're gonna break the seal between the ear cups and your ear and you're gonna get a drop in bass. - However. - Noise canceling headphones, use the microphones inside the ear cup to listen for how much bass you're hearing and they compensate for the drop in bass. - No way. So you've actually recorded this. - It should be noted that the measurements here are normalized. So even though the baseline looks flat, the actual measurement wasn't flat. I'm just making it flat so it's easier to compare. - We're looking at relative. - Yes. This is the frequency response of the QC 35 in the bass range up to 4,000 Hertz without glasses, without a beanie, without a hat. When I add glasses with noise canceling off, you see a little bit of drop in bass. So about three DB, two DB of drop in bass. - Right, which sucks. - Yeah. - That's significant. - If you're listening to games or bass heavy music, you're gonna notice that. - Or you'll just think your headphones suck or the audio in this game sucks. - My headphones doesn't have enough bass even though the measurement shows that it has actually enough bass. If you use a hat, you get even more drop in bass. - Whoa! I thought you said hats were good. You just made me spend $40,000 on hats. - Different hats. Now, and if you add a beanie which you use when you're recording \"The Wan Show\" this is the amount of drop in bass that you get. - I knew my voice wasn't that high pitched when I'm monitoring. - Almost 14 DB of dropping bass at 100 Hertz. - But. - When we turn noise canceling on, this is what we get. Again, this is the baseline. This is the measurement on me without glasses or hats or a beanie. This is with glasses on. - Whoa! - So compared to the old measurements where we lost like three DB off bass, here we lose only maybe a DB or a half a DB. With a hat on again, we're getting maybe only one DB, one and a half DB. And if I put on a beanie, we're getting maximum like four or five DB off dropping bass, but with noise canceling off, it was 14 DB of dropping bass. - That is wild. - So if you have a noise canceling head phone and you wanna make sure that you're getting good amount of bass all the time, turn noise canceling on. This doesn't happen with all the noise canceling headphones, but the better ones from Sony, from Bose, from Apple, they all do this. So if you wanna make sure that you're getting enough bass with your headphones, turn the noise canceling on. - Cool. Antoine, meanwhile has done all kinds of other cool things here including actually designing the desk made of radiators though I think he was still on probation when we did that video. So we weren't able to credit him properly, but hey, we made up for it now. You've got a lot of stuff going on here. First of all, you stole our high speed camera. So we haven't had that for production lately. And I think you have a demo to show off today as well. It's a robot, right? - I have a few. - Nvidia makes their latency tester. Why do we need that? Oh, wait, what have you done here? You've got a metal key cap on here it looks like. No, you've just got copper foiled tape on it and you soldered a bunch of stuff to it. What on earth are you doing, sir? - Yeah, that is meant for mice, not for keyboards. - Yes. So you didn't care about that at all and you made it for keyboards. - Exactly. - Antoine, is our keyboard testing specialist. - Press the key for me. - Do I have to do. Hi. Whoa, okay. - [Jake] It's so aggressive. - Wow, yeah, does it have to hit it that hard? - It's to minimize the impact of the travel of the key? - I think you're maximizing the impact on the travel of the, pun intended. What's the point of this? Surely every keyboard is fast enough. - Are they? - Okay, that's fair enough, isn't it? Actually, they might be, but what I think we can all agree on is that keyboards have not necessarily reached peak feel. How do we quantify that? Meet, what do you call this thing? - The keystroke tester. - The keystroke tester, I have with that actuation force analysis machine. We'll figure out a cool name for it later. It might not look like much, but it's really cool. This piece right here is a force load cell. And it can measure to a resolution of 0.001 Newtons. That is one 10th of a gram of force. And whoa, there's a lot more to it than that. I mean, we could theoretically just grab this thing and like go like this along every string single key, but that would be madness. We would need an army of Antoines to test the, what is it we're planning to get through the lab, like 200 plus keyboards by the end of the year? With the help of Guy Fox over here, we've created a machine vision system that will automatically detect the edges of the keys and then direct our XY access. This was just like ripped out of a 3D printer or something. - Yes. - Yeah, (indistinct). Nice, that will direct our force load tester and move and press each of the keys in turn many times which is where actually is he and the rest of the development team are gonna be working on the back end, front end and software tools that we're gonna need to actually log all this data. Now, from a software standpoint, it occurs to me that not every thing on a keyboard can be pressed down like this dial for example. Guy, is it just gonna push the force load tester against it and go in? No, that doesn't work or. - Nope, before every test run, we have a UI that allows Antoine or whatever other tester is going to be doing the test to actually remove or isolate those options. - Cool, okay. I think that's pretty much it. Can we run it? - Yeah, sure, let's go ahead. - This is pretty cool. This is just a cheap photography box and this is to ensure consistent lighting from all angles so that our cheap webcam, well, expensive webcam cheap camera can see all of the edges really well. How do we account for like all the different legends that you might find on the keys and all that kind of crap? - Once each key is pressed, we're gonna get the signal into the machine to say this was the key that was pressed. So we don't actually need to read the keys off the top. We just need to detect the individual keycaps. - Show me the money, lots of money. Oh my God, it's so slow - [Antoine] It's a prototype - Prototype, okay, fair enough. Is the aim to pay respects here to my wallet? Right now, I'm sure our goal is to hit the center of the key, but in the long term, could we test the variability from corner to corner to corner to corner to center? - [Antoine] Yes, we could. - Oh, now that would be really cool because that's one of the things that really changes the feel of a keyboard particularly on something like a laptop where you've got a scissor switch. You can have a a laptop keyboard that uses a low end switch technology, but feels great because the stabilization of the keys is excellent. And then you can have one that feels like crap, even though it has mechanical switch because the stabilization sucks 'cause we're not perfectly accurate. We don't hit the center of a key every time we're typing. Oh my God, it's testing only the second key now. We're gonna need an army of these things and an army of Antoines. - How about a robot arm? - That looks really expensive. If any robot manufacturers wanna reach out and they wanna work with us, maybe we can figure something out that would obviously be a much better way of doing it than what we have now. And I'm told you have more. - Yes I do. - Who is this? Looks aggressive if it's anything like that. Whoa, hi. - Look, it's fine. So the goal of that guy is to test the wear on keycaps to compare ABS against PBT double shots. - So these are basically little fake fingers. - Yes. - Fascinating. - And the idea is to assign fake oil to them to test as well. - And just wait until we get this guy going on mice and other input devices, it's gonna be lots of fun. And you do what exactly? - Oh, I have no idea, but I learned PowerPoint today. I know. I did not have time to do a demo. - I promise you he's doing stuff. He's working through the incredible backlog of applications because as you guys may or may not have noticed, not all of our key product categories are covered yet. What we do have though, let's go have a look at that. That's where fallout guy comes in here. He's our first full-time software engineer and he is already making a huge difference to our workflow. The thing is you guys probably think, yeah, you guys play with all the latest tech, but you would be blown away by the number of things that we turn away because of how manual our test procedures have been up until now. So his job and the rest of the team that we're gonna build out is to make things as automated as possible. We then need to be able to take those results and turn that into information that we can quickly and easily present in our videos as well as in an online database that anyone can access. Why don't you show us what you've been working on? - Instead of having to launch a game and babysit a benchmark yourself and with the push of a button, way we go. - Now, what is happening here? Is this just basically glorified auto hotkey or like what am I looking at? - Some parts are, but some games have menus that are not navigable via keyboard. So we're also using computer vision here as well to identify some buttons. - Interesting, and will we use computer vision to identify what our ideal settings are so that we can have it configured to whatever it's supposed to be or how does that work? - We can do that. However, changing the settings is actually a lot easier to do if you just manipulate the files underneath. - Got it. Now, I know it's not implemented yet, but our goal in the long term would be to also use machine vision to identify any kind of artifacting or visual anomalies in the picture. Is that correct? - Yep, that's something we hope to be able to do. - When? - That's a very good question. I'll head that to the other software engineer. - And it's done. To be clear, it's not that much today, but this foundation is gonna allow us to rapidly scale not only how many tests we're able to run, but what kinds of tests we're able to run and on what products. This is gonna be the backbone that the entire lab runs off of. And it's going to be epic. Wait a second, so you're saying that once it works better than the load tester, we don't even need to make graphs anymore like it'll just spit everything out, ready to go? - Just about. And it'll save them the time. - Okay, I mean, does it do that yet? Where does the data go? How does that work, what data points? How does it read the results even? - So it spits out reams of CSV files which then we parse and send into a database. - Which is great, but I'm about to show you something cooler. Antoine whip this up in his spare time. Gary tried to take the credit for this, right? That he inspired you. - Really? - I mean, he has nothing else to his name so he's gotta kinda weasel in there. Just kidding. Antoine, this was a completely an Antoine initiative and it looks like progress has been made. It's really cool. We're just not sure how much we like needed it. So why don't you show us what you made? - So basically the future of the lab. - This was all done in Unreal Engine five, meaning that it is basically a game level of what it will be like to walk through lab two. - The front door. - It's amazing. I still can't believe you did this. This will be the non-LTT writers downstairs. Take us to the server room. Nice. - [Jake] Where's the server? - Yeah, where's the server? - It's coming. - [Jake] What the heck, Antoine? - It's coming. - I'm kidding. You really don't need that. - I hope so. - And then what's here? Is this the lunch room or? - Lunchroom, meeting room and whatever room. - Yeah, cool, show me the aquarium. I wanna go to the aquarium. You told them they were upstairs? - Yeah, I removed the one upstairs, I'm working on it. - Oh, interesting. Okay, that's my office. I'm apparently an open concept kind of boss now. That's fine, I'm into it. Jake, where's your desk gonna be? - [Jake] I don't know - Somewhere there. - Right there. I cannot crouch. - [Jake] That's where Luke goes. - And then this is the aquarium. So Gary, this is where you're gonna sit. - [Gary] Thank you. - You're welcome. - [Jake] You'll make PowerPoints in there. - Logistics is gonna move over to lab two since that's where pretty much every product that crosses our threshold is going to arrive first. The lab will test it, tell us if it's good or if it's crap and then it will be sent to LTT or short circuit or maybe sent nowhere 'cause it sucks. That's a very real possibility. So that's why logistics needs to move here. And we're going to use logistics area which is actually right below us for, I don't know, more sets or something along those lines. Okay, everybody's workstations. And then this is the testing area. So like CPU bench, GPU bench. We wouldn't do any displays here or anything like that, I wouldn't think, would we? - Not necessarily. Some of the tests. - Some tests here, okay. There's obviously some optimizations we could make to the layout. For example, if we wanted to test laptop battery life, having like a nice little rack where you can pack them in nice and tight would be a huge advantage. Is this your work area? Did you take us right to your desk? - Yes. - I love it. Okay, so you've got your. - Do you recognize that? - Yeah, the keyboard tester. - [Jake] Do you have the Unreal Engine on your computer in the Unreal Engine? - That's in beta. - And what am I looking at here? - So this is for the first room that is for Guy to use with the smartphones. - Smartphones, okay. We've got some really cool smartphone testing coming. It turns out there's all kinds of tomfoolery that goes on in the smartphone industry around like fake reporting, 5G connectivity, and all kinds of cool stuff that we're gonna be able to dig into in there. - I mean, this is the first big cheque that you signed. - Oh, is it. Actually, that's the second big cheque. Where's the power supply tester? (indistinct) - It should be over here. - It'll look a little something like that. Cost over 100,000 US dollars, but it'll allow us to analyze every aspect of a computer power supply. And then this is a theater room, right? - Yes. - We can do projectors in there, we can do speakers. Just anything that you need a larger space for is gonna happen in here. - We need to open the LAN, but maybe not too much later. Thermal chamber. - Thermal chamber. Freaking exciting just like this message from our sponsor. - Privacy.com. Privacy.com lets you buy things online using virtual credit cards rather than your real ones. Any summer birthdays coming up, keep your identity and baking info safe on the internet while you're shopping for presents. You can set spend limits, pause, and close cards at any time. Are you a victim of a fraudulent transaction? Privacy.com automatically declines the transaction and notifies you immediately. You can sign up for free trials and offers without worrying about forgetting to cancel the subscription because privacy.com lets you generate a one time card number to sign up anonymously and safely closing the card as soon as it goes through. No more jumping through customer service hoops and hopes of canceling or losing money on apps you never meant to spend on. Privacy.com also offers different plans depending on your goals from cash back to plans for your team. So head to privacy.com/linus and sign up for an account. New customers will automatically get $5 to spend on their first purchase. That's a free five bucks. - Do you guys enjoyed this video? Maybe go check out the physical version of the tour of the lab. It really doesn't look as good as Antoine's video game fantasy version, but we'll get there, I promise. I have to spend all of my money.",
    "transcript_keywords": [
        "bass",
        "noise canceling",
        "cool",
        "Antoine",
        "key",
        "tests",
        "test",
        "Yeah",
        "canceling",
        "noise",
        "headphones",
        "tester",
        "show",
        "Noise canceling headphones",
        "things",
        "keyboard",
        "drop in bass",
        "lab",
        "Guy",
        "turn noise canceling"
    ],
    "transcript_entity_values": [
        "Sony",
        "the end of the year",
        "Privacy.com",
        "five bucks",
        "XY",
        "one",
        "R4",
        "14",
        "UI",
        "second",
        "Jake",
        "Apple",
        "Sam",
        "Elite",
        "100",
        "Guy Fox",
        "first",
        "LAN",
        "Bose",
        "PBT",
        "Hertz",
        "The Wan Show",
        "First",
        "summer",
        "CSV",
        "517",
        "one 10th",
        "PowerPoint",
        "5",
        "Guy",
        "0.001 Newtons",
        "GPU",
        "today",
        "the QC 35",
        "five",
        "G-Sync Ultimate",
        "IPS",
        "Antoine",
        "Antoines",
        "5",
        "5128",
        "4",
        "40,000",
        "LTT",
        "over 100,000 US dollars",
        "only two",
        "200",
        "ViewSonic",
        "three",
        "a second",
        "PowerPoints",
        "CPU",
        "Nvidia",
        "Unreal Engine",
        "Luke",
        "hundreds of thousands of dollars",
        "four or five",
        "only one",
        "Gary",
        "144",
        "two",
        "Privacy.com",
        "about three"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "MONEY",
        "ORG",
        "DATE",
        "EVENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL"
    ]
}