{
    "id": "JzaL2O3bSgU",
    "title": "How To Fix THESE Errors",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-08-04T15:42:54Z",
    "video_url": "https://www.youtube.com/watch?v=JzaL2O3bSgU",
    "category": "Science & Technology",
    "tags": [],
    "views": 213089,
    "likes": 17234,
    "comments_count": 1830,
    "description": "Sign up for Private Internet Access VPN at    What should you do about these common Windows error messages?  Registry entries for Windows Update error:  [HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\WindowsUpdate\\UX] \"IsConvergedUpdateStackEnabled\"=dword:00000000  [HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\WindowsUpdate\\UX\\Settings] \"UxOption\"=dword:00000000  Commands for Wi-Fi error:  netsh advfirewall firewall set rule group=\"Network Discovery\" new enable=Yes  reg delete HKCR\\CLSID\\{988248f3-a1ad-49bf-9170-676cbbc36ba3} /va /f  netcfg -v -u dni_dne  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  Nerd or Die Stream Overlays & Templates:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.privateinternetaccess.com/TechQuickie",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/s8hBAgR",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Windows is the world's most popular desktop operating system, but anyone who's used it for any length of time knows that it doesn't mean it's perfect. I mean, McDonald's serves over half a billion Big Macs every year, but it's far from the optimal thing to shove down your gullet. So today we're gonna talk about a few of the most common and frustrating Windows errors and what you can do about them, other than trying that automatic Windows troubleshooter, of course. Let's start with the access is denied error you'll sometimes see when you're trying to open a folder, which probably seems a bit silly if it's on your computer. This often happens when you don't have the right owner setup, whether it's because you're trying to access a system folder containing critical Windows files or whatever other reason. To fix this issue, first make sure your user account has administrator rights, which it should if you're just working on your own personal computer. And right-click the folder you're trying to open, hit Properties, then Security, then Advanced. Click Change beside the owner field and a new box will pop up. Punch in your username and click Check Names to ensure that you typed it in correctly. If you did, you'll see Windows tack the name of your PC onto the username. Click OK, then click the option at the bottom of the previous window that refers to child object permission entries. This will make sure you also have access to any subfolders. Click OK on all windows and you should be good to go. And if you're still having problems, go back to the Security tab we previously mentioned and make sure that your username has full control over the folder. Just click your username, select Edit, and adjust the settings accordingly. You may not want to do this on a critical system folder, though. Next, let's have a look at a common Windows update error that's been around for nearly 20 years. Sometimes when you try to use Windows updates, you'll get this error code along with this message if you're using a recent version of Windows 10. There were some problems, but we'll try again later. What does that mean? Thankfully so many people have gotten this message that plenty of fixes for it are floating around. If you go to your Windows directory, you'll see a folder called SoftwareDistribution. Rename it to something else. SoftwareDistribution.old is a good choice so you can find it later if needed. And restart your machine, then just try running Windows Update again. If that error message keeps popping up, check out the two registry entries we put in the video description below and make sure they match what's in your registry exactly. All right, let's wrap things up with something that's sure to be extremely frustrating if it ever happens to you. A wifi network you want to connect to isn't in the list that Windows provides. Assuming that everything is okay with your hardware and the wifi network itself, this can be caused if you're using a VPN that isn't playing nicely with Windows. So your first step should be to disable your VPN temporarily. If that fixes the issue, ensure that you're running the latest version of the VPN software, as older versions can use a driver that doesn't work correctly with newer versions of Windows. It also won't hurt to ensure that the driver for your wireless adapter is also up to date, but you still can't see the network you need. Fire up a command prompt, making sure to run it as an administrator, and type in this command. If that doesn't work, type in these two commands, pressing Enter after each one, and we've included them in the description so you can copy and paste them easily. So what are your most frustrating experiences with Windows errors? Let us know down in the comments and tell us what you'd like to see in a follow-up episode. And regardless of what problem you're having, before you panic, just make sure it's not a PBKAC error, big wink. And if you don't have a VPN, you should get one. Today's sponsor is private Internet Access. Private Internet Access is a tool that masks your IP and encrypts traffic on your devices. Combine it with private browsing tools to even make savvy websites think that you're somewhere else. They've got reliable service with over 3000 servers in 45 countries and no bandwidth caps. They've got configurable encryption, an internet kill switch, you know, they got all sorts of stuff. They've got clients for windows, MacOS, Android, iOS, and Linux, letting you connect up to five devices at once. Check it out today at privateinternetaccess.com/TechQuickie. Camera overheated and broke like four times. So guys, thank you very much for watching. Like, dislike, check out our other videos on Windows up here, comment with video suggestions, and don't forget to subscribe and follow. Thank you.",
    "transcript_keywords": [
        "Windows",
        "popular desktop operating",
        "desktop operating system",
        "Windows errors",
        "world most popular",
        "popular desktop",
        "desktop operating",
        "Windows update",
        "Windows update error",
        "access",
        "folder",
        "Click",
        "make",
        "billion Big Macs",
        "VPN",
        "private Internet Access",
        "error",
        "Internet Access",
        "frustrating Windows errors",
        "common Windows update"
    ],
    "transcript_entity_values": [
        "Windows",
        "one",
        "nearly 20 years",
        "Windows",
        "3000",
        "IP",
        "privateinternetaccess.com/TechQuickie",
        "Windows",
        "Today",
        "McDonald",
        "Windows",
        "Windows Update",
        "Linux",
        "first",
        "two",
        "Windows 10",
        "up to five",
        "Android",
        "four",
        "45",
        "SoftwareDistribution.old",
        "VPN",
        "Big Macs",
        "MacOS",
        "today"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "NORP",
        "PRODUCT",
        "GPE",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE"
    ]
}