{
    "id": "jZc8qMNiONo",
    "title": "Hey Siri, Drive My Tesla (How To Use iPhone's New Shortcuts)!",
    "channel": "Snazzy Labs",
    "channel_id": "UCO2x-p9gg9TLKneXlibGR7w",
    "subscriber_count": 1170000,
    "upload_date": "2018-09-21T22:17:58Z",
    "video_url": "https://www.youtube.com/watch?v=jZc8qMNiONo",
    "category": "Science & Technology",
    "tags": [
        "snazzy labs",
        "quinn nelson",
        "snazzyq",
        "siri",
        "siri shortcuts",
        "ios 12",
        "tesla",
        "tesla model 3",
        "tesla model 3 performance",
        "self driving cars",
        "automation",
        "smart home",
        "siri smart home",
        "siri vs google",
        "siri vs alexa",
        "alexa vs siri",
        "iphone xs",
        "iphone xs max",
        "iphone automation",
        "ios 12 tips",
        "ios 12 tutorial",
        "apple shortcuts",
        "ifttt",
        "shortcuts tutorial",
        "how to use shortcuts",
        "ios 12 vs ios 11",
        "ios 12 old iphone",
        "iphone 2018",
        "electric cars",
        "future tech",
        "siri sucks",
        "siri fail",
        "apple"
    ],
    "views": 641918,
    "likes": 22394,
    "comments_count": 1111,
    "description": "Make Siri suck less with Apple's new powerful Shortcuts App!  Siri Shortcuts Subreddit -  Follow Snazzy Labs on Twitter -  Follow me on Instagram -   Siri has been terrible for a long, long time; however, Apple just released Shortcuts for iOS 12 which is an app that lets you automate your iPhone (be it a new iPhone XS Max, iPhone 5R, or an old iPhone 5S) to do cool commands. Think IFTTT, but for Siri. Create custom macros and shortcuts to control your smart home, automate annoying tasks on your iPhone, play fun text based games, and even control your Tesla!",
    "description_links": [
        "http://reddit.com/r/shortcuts",
        "http://twitter.com/snazzyq",
        "http://instagram.com/snazzyq"
    ],
    "transcript": "Are you kidding me? Come on? What an idiot alright, hey Siri back me up Come on perfect. Hey Siri stop Hey Siri, stop. Hey, wait. Hey Apple users know that Siri hasn't really been very good and well Forever but a new Apple app called shortcuts released alongside iOS 12 , A few days ago allows you to do some really cool stuff Like program and also download automated actions which can be triggered by Siri basically making your iPhone pre-programmed priyada mated supercomputer It's really cool problem is is the apps a little bit intimidating and a lot of people don't know how to get started So I'm here to show you exactly how it works Okay, so to get awesome shortcuts on your iOS device. You are perhaps obviously going to need the application shortcuts Now this was previously called workflow But Apple bought the app and the company and have released it with more power than ever before to download the latest version you are Going to need iOS 12 or later because that's required for the series shortcuts If you haven't updated if your device runs iOS 11, it will run iOS 12 and it does quite a good job So you should update anyway, but once you've done that you can open the application Now I have a few shortcuts here that have been pre-programmed, but your page is going to be blank You won't have anything just to give you some background on how you can trigger some shortcuts You can either do it from the app page itself You can also do it from your Notification Center widget and then you can lastly do it through Siri That's the method that I found the most interesting and fun now you might be wondering Well, how do I find shortcuts because I have seven here and you have zero Well, there are a few ways the easiest is to use the built-in gallery that Apple has curated now because Apple has curated it It's a little bit more limited than you might expect but there are actually some pretty cool actions in here for example, if we go into the photography section, my favorite one is convert burst photo to gif so you click it and then you can click get shortcut and it automatically Installs into your library now a burst photo is if you open up your camera and hold down the shutter button It takes, you know a bunch of photos in sequence Those aren't very useful because you click the photo and you're usually able to select one twenty-five photos as the main photo However, if you use this convert bursts to gif shortcut, you can click it. It wants you to choose the burst image So that's the one we just took and then it will convert it to a gif pretty cool you can click done and then it will ask you whether you want to share it or save it to your photo role or Cancel so that's what we're going to do So the first way to find shortcuts is through Apple's own gallery The second way which is going to become increasingly more common is third-party applications Third-party app devs can create their own series shortcuts that are pre curated that you can enable in the settings application So if you go into settings click a third-party app, and then you click the Siri and search button You'll find that there is now a shortcut section that will only pop up if the third-party developer has supported shortcuts So overcast which is my podcast app of choice Supports Siri shortcuts and one of my favorite podcasts is connected so there is a command called play connected that I can add and Then I have to create a serum and now I can do the recommended one overcast connected but I can make it literally anything I want so I'm going to call it play connected podcast and Now that's my hot key. So anytime I say that from anywhere in iOS Play connected podcast It will resume the episode that I'm currently listening to Without me having to do anything without me having to enter the app without me having to use the Apple podcast app It's really cool. And I am betting that there are going to be a ton of powerful features that make it into third party applications There are one there's one other way to find really great shortcuts and that is using the subreddit shortcuts when people have made shortcuts you can actually share them with others and so reddit is a great place to find a bunch of ones that people have created a Lot of them are really useful and super powerful and a lot of them are very stupid and absurd like this one Which is called the pineapple incident I can click download and the URL opens inside of the app and I can actually see what this app does By scrolling through this text now this one's actually pretty involved. But what it does is a pixel random content random contact and sends the pineapple emoji in iMessage 100 times Really bad shortcut, you'll never want to use that one But if you wanted to you could So those are three ways to find premade shortcuts in the gallery in the Settings app and on reddit or online sharing with your friends But you can also make your own shortcuts Before we get to that I do want to show you two handy tricks to rearrange your shortcuts that you have You just hold it down until they wiggle just like on The app home screen and you can move them around and then to delete them or duplicate them. You just select the Shortcuts you want so they have a blue checkmark next to them and you can duplicate or delete So that's one thing to note. The other thing worth noting is how you actually trigger them with series So this is my calculate tip function Which I use all the time and historically I've gone into here scrolled over and clicked calculate tip It asked me the bill when I'm at a restaurant type. I don't know 50 dollars and 72 cents It asked me how much I want to tip 20 percent and then it gives me my tip amount and my total amount pretty cool But let's say I want to trigger that using Siri well I can if I go into the calculate tip settings I can click this little guy right here and then click Add to Siri Then I create a shortcut what's my tip and Then now anywhere in iOS I can hold trigger Siri. What's my tip? And My shortcut will run it asked me for the bill. It tells me the ask me what I want a tip. So $14 and Then let's do 20% And then there you go. My tip is $2.80 and my total is 1680. So pretty good That's how you do it. But again I mentioned you can make your own shortcut I just bought a Tesla Model 3 and I am very excited about it and I'll talk about it later in the future. A lot of people want a full review I'll do that Once I've had the car for a few months But one of the things that I've really enjoyed is that Tesla has an open API so there is an application called remote s Which allows you to do quite a few more things than the regular Tesla app? Does I can change the exact temperature? I can open the trunk and the Frank I can honk the horn most of those the regular Tesla Do but I can do a few other things like track the app or track the cars location in real time modify charge settings, etc Anyway, that's probably more than you care to know Remote s has a few pre-made functions like I mentioned with overcast So if I go here and then I scroll down to remote s I can click a Syrian search Shortcuts and I can create an activate from so that will open the front trunk on my car If I tap add I can say that's actually a good command. I'll use that open the front and When I say open the front using Siri Open the front In theory it opens your trunk now the problem with this is I don't like it because it requires an extra step It asked me do I want to open it? and If I if it asked me that I have to have the phone in my hand to tap yes or no or to give it A verbal confirmation and I don't really want to do that so I can actually modify this shortcut Let's delete it first and then I can create my own Inside of shortcuts, so I'm going to go in to shortcuts Create a shortcut. And now you can actually see that there are a bunch of options here that you can create your own shortcut So you can open an app you can do a calendar event You can do scripting which we'll talk about in a minute or I can scroll down to a premade shortcut remote s tap it tap the activate trunk command and Then I can actually just disable show in run. This means that everything will happen in the background I don't need to provide confirmation and the minute I say open trunk well, it'll open I'm going to turn that off and then I am going to Click the icon to add to Siri and now I need to give it a Siri command. So Open the front Alright and then I can change the shortcut if I want so let's call this open Frank And then I can give it an icon if I want so let's make it a Car and then red. Okay. So now anywhere in iOS I'm done and I can go Open the The shortcut will run and it opens without me having to do anything let me demonstrate. Hey Siri open Frank But I can already see some of you saying and that doesn't seem very secure and you're right so the great thing about this is that I can make this workflow a little bit more complex and I want to do it by adding a verbal password. So let's start over. I'll show you Basically how powerful this can get if you're willing to play around and read the descriptions on some of these items So let's go into scripting scripting is cool because it allows you to create a bunch of conditional logic items So if I'm going to give it a password, let's say when I say open the front. It'll say okay fine. What's your password? So what I need to do is find an area or an item where I can dictate text to the device It's not in here. It's actually probably going to be in Text and then I can click Yeah, there you go dictate text. So now what happens when I run the workflow is It wants me to Say something out loud. And then when I'm done, it will pass whatever I say on to the next step now We haven't programmed a next step yet, so nothing happens but let's Keep that that's fine. And then it actually wants me that's the dictate text that I'm looking for So let's riad it dictate text. Perfect. And then once I pause it stops listening and it passes it on to the next step So now we need the next step and let's use a variable These are pretty powerful. So if I use an if variable, this is where we get into conditional logic So it gives me a few options if something happens then do this Otherwise do that and then end the command so I'm going to dictate text. Say my password That's what I want it to say, but it doesn't know what it's looking for So if my input equals because it's password If it's not perfectly, correct, then it shouldn't unlock the car and then we need to enter the value That's the password that it's looking for I don't know. Let's do coconut That will be my password okay, so if I dictate text and that text equals coconut then Do what we wanted to do, which is open the trunk So now we're going to go in here find my remote s again and then click activate trunk Oh, no, we want the front activate the trunk okay, and then we're going to cancel show and run because again We don't need that to pop up and we need to drag that inside of our if variable so if I say the right password then open the trunk and That's really all I need to do but what if they enter the wrong password, so otherwise Meaning they don't say a value that equals coconut. They say something else the wrong password Then we need to punish them somehow now I could just end it and the script doesn't complete properly, but that's no fun So let's throw some variables in here That will let the person know that they've done the wrong thing Maybe someone steals my phone and they try to break into my car using my Siri shortcut Well, what can I do to let them know they've screwed up let's go into Scripting again. And this does a lot of low-level device features. You can for example vibrate the device So let's vibrate like a buzzer Otherwise if they get it wrong, so we're going to drag this into otherwise so when they say the wrong password the device is going to vibrate kind of like a Wrong answer and then what else could we do? Oh I've got it we can rickroll them So if I enter this area I can find that there is a music shortcut I click music and then let's see, okay well We need to find the music because the music app doesn't know to rickroll Unless we tell it to find the song and then play it so we need to click find music We're going to drag that again underneath this tree of command. So otherwise vibrate the device and then finding music so we need to add a filter and the song so we need to find title is Never gonna give you up and we need to do the exact whole title. Otherwise, it's not going to work Okay, so we've done never gonna give you up and Then after that, oh, do you know what's even better? Let's raise the volume to 100% So it's really loud and really annoying. So let's go into scripting We will go down to set volume and we can make the volume of the system 100% that is going to be really irritating. So what happens is If they get the wrong password the device vibrates the volume on the device gets set to 100% it looks for the song never going to give you up and now we only need one more thing and that's to tell the Device to play the song so we need to go into music and then click Play music and then it will actually play the song that we've listed. So there's our workflow. It's done That's all we have to do. And so let's work through it. Again. It's going to ask us when we say. Hey Siri, I Probably shouldn't say that I'm gonna say hey dingleberry Open the or open the front and when I say open the front, it's gonna say ok It's going to ask me to dictate some text and I need to say the password If I say coconut then the trunk opens, if I don't say coconut then this tree of items happens Which is the device vibrates the volume gets set to 100% ITunes looks up never going to give you up and then it plays it at full blast and that's my command I press done and it's ready to go. So let's try it out. Hey Siri open trunk Coconut Hey Siri open Frank Password Well folks that's all for me if you enjoyed this video please give it a like if you didn't well that other button seems to work okay to Get subscribe for more awesome videos like these but most importantly and as always stay snazzy",
    "transcript_keywords": [
        "Hey Siri open",
        "hey Siri",
        "Siri open Frank",
        "Siri",
        "Siri Open",
        "open",
        "shortcuts",
        "shortcut",
        "Supports Siri shortcuts",
        "click",
        "Siri open trunk",
        "app",
        "password",
        "hey",
        "Apple",
        "Coconut Hey Siri",
        "open the front",
        "find",
        "open Frank",
        "Siri shortcuts"
    ],
    "transcript_entity_values": [
        "14",
        "third",
        "iOS 11",
        "iOS 12",
        "50 dollars",
        "Supports Siri",
        "Notification Center",
        "Third",
        "two",
        "Apple",
        "Tesla",
        "Frank",
        "2.80",
        "iOS Play",
        "Siri",
        "20%",
        "twenty-five",
        "Syrian",
        "1680",
        "100%",
        "API",
        "seven",
        "first",
        "one",
        "a few months",
        "20 percent",
        "100",
        "72 cents",
        "second",
        "Tesla Model 3",
        "A few days ago",
        "Siri Open",
        "three",
        "priyada"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORDINAL",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "FAC",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "WORK_OF_ART",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG"
    ]
}