{
    "id": "JzpUfRv45yY",
    "title": "The Worst Hot Takes in Tech",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-07-21T21:00:07Z",
    "video_url": "https://www.youtube.com/watch?v=JzpUfRv45yY",
    "category": "Science & Technology",
    "tags": [
        "MKBHD",
        "tech hot takes",
        "hot takes",
        "magic mouse",
        "cybertruck",
        "polêmicas de tecnologia",
        "comentários polêmicos",
        "mouse mágico",
        "DubbedWithAloud",
        "opiniones controversiales sobre tecnología",
        "opiniones controversiales"
    ],
    "views": 4411349,
    "likes": 150638,
    "comments_count": 8345,
    "description": "You all should be sorry Get that shirt:  JxmyHighRoller:   Tech I'm using right now:   Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "https://mkbhd.com/products/30-fps-t-shirt",
        "https://www.youtube.com/@JxmyHighroller",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(soft upbeat music) (soft upbeat music) (soft upbeat music) (bright upbeat music) - So I've been on the internet for a long time and most of it, at least where I hang out, pretty reasonable which is great. But you know, there are some tucked away in the corners every once in a while that do have some pretty controversial opinions, things that they actually believe in, some hot takes that are guaranteed to ruffle some feathers but sometimes there is some truth to them. So today I've gathered some of the hottest takes around the internet from you guys and we're gonna see if they're actually good takes or not. Also, I need to thank JxmyHighroller for the concept for this video. If you haven't already seen his channel, he does a lot of basketball videos including reacting to NBA hot takes. They're incredible. So if you somehow, if you're interested in basketball and somehow haven't seen this channel already, I'll link it below. But let's get into some tech hot takes. So here's a hot take. Tesla Cybertruck will outsell the Ford F-150 by 2026. And this, well, this is a hot one. So the Cybertruck, the Cybertruck is one of the most hyped vehicles in a long time. As long as I've been alive. Certainly the most hyped EV. You know the numbers speak for themselves. But now they're actually being spotted around the roads, around Tesla headquarters and it seems like they're finishing up details of manufacturing and design and they may be about to finally go into production with this thing. Now the hot take is that it'll outsell the F-150 in three years because the F-150 as you may already know, is very popular. But the thing is, and I don't know if you thought about this as you were typing it, I don't know if you realize how popular the F-150 actually is. The Ford F-150 has been America's best selling truck for 46 years in a row. Actually, it's been the number one most popular vehicle for 41 years straight. Last year, Ford sold one of these trucks every 49 seconds and it typically totals anywhere from 600,000 to just under a million of these things every single calendar year. So yeah, the Cybertruck very hyped and there are allegedly somewhere in the neighborhood of 1.5 million pre-orders which is crazy for a vehicle that's not even out yet, that only a handful of people have even seen with their eyes. But a couple of things; first of all, those pre-orders are $100 deposits. I know that because I'm one of them. I think they're actually $100 refundable deposits. The point being, 1.5 million pre-orders does not equal 1.5 million sales. It's just that many people have reserved their spot in line and some fraction of them will convert to orders but it won't be 100% and Tesla knows that. But then number two, you can't just build them all at once, you have to ramp up into production. We've seen this with other models before. So you know, they'll start off small, couple dozen one week, then 100 the next week, then 500 the next week and they'll have to ramp up. It'll take a while to get through the first million easily well over a year. Like at this very moment, Tesla doesn't even have the capacity to make a million Model 3s, let alone a million of something they've never made before. So you know, we could be optimistic about the manufacturing process but it's gonna be tough to get to a million of these things sold and dethroning the king by 2026. So I love the optimism about that Cybertruck possibly being one of the most disruptive vehicles ever, maybe could happen but it's gonna take a little more time than that. Bad take. All right, here's another one that Apple Maps is now better than Google Maps. And this is a interesting take. Do you remember when Apple Maps first came out like all the horror stories, the articles that all came out, how bad it was? There were entire towns missing. There were places that were just in the wrong spot. It was getting people lost, driving 'em into water. It was missing a ton of features. It was so bad that Tim Cook, the CEO, had to issue an apology. But a lot of things have changed since then. Basically, I mean, having a good maps app requires a lot of mapping data. So they've been plugging away at that since that launch of course. All the street view data, the correct location data, businesses, public transportation, different actual routes, real time traffic, all that stuff, they've improved dramatically at all of that. Plus they've actually started adding some genuinely cool features on top of it. I can actually vouch that if you look at Google Street View and Apple Maps Street View in the same location, nine times outta 10, the Apple Maps one is actually higher quality and smoother and looks better. It's easier to navigate. I also think Apple Maps is generally better designed, it's just a little better looking than Google Maps. And as of the latest iOS 17 beta, it's actually finally getting one of the biggest features that was missing which is downloading maps for offline. Finally. I'm not ready to say that Apple Maps is better than Google Maps yet. I mean, especially because first of all, it's multi-platform, it's just so much more available and then the decades long headstart that Google has had in mapping and gathering information in the most obscure parts of the world like it's gonna take some time for Apple to continue to catch up with that. But I will say that it's at least caught up to Google Maps. They're on the same level, they're actually competitors which is good because now they compete to try to get better. And for certain people, in some places, sometimes, it's just as good if not better than Google Maps. There I said it, I said it. It's a good take. The Magic Mouse is the best mouse for the Mac. (Marques breathing heavily) Ah, you know, y'all really pushing this one. Let's just ignore the take for a second and just talk about the, how does the Magic Mouse exist? Like how is this the best mouse that Apple, the world's richest, $3 trillion company could come up with? All the billions of dollars of research and development dollars and the best designers in the world and all the testing and optimizations and strategy on the planet, this is the best mouse that they could come up with? Seriously? Sorry, I should be more objective here. What makes a good mouse? Zoom out a little bit. Good design, good performance, good features, good price. The best mouse cannot have a fatal flaw in more than one of these fundamental categories. And we all know about the fact that the only way to charge it is a lightning port and they put that port at the bottom of the mouse so you literally can't even use it while you're waiting for it to charge. It might only happen once a month but that's more than it should ever happen. But on top of that, it's also terrible ergonomically. I mean, there's a reason why all the other best mice in the world have an arch to rest your hand. But look, Oliur is a smart guy. I don't think he's trolling. This is not a completely empty take. The reason why people genuinely feel this way about the Magic Mouse is because Apple has done to this accessory what they've done to every other accessory that they possibly can in their universe which is making it impossible to make a better one than the Apple one. Like you literally cannot make a better smartwatch for the iPhone because you'll never get as much access to the data and the integration that Apple gives its own watch. You can literally never make headphones that pair more fluidly and switch more easily than Apple's own AirPods. And the Magic Mouse, well, the Magic Mouse has smooth scrolling. Literally, the best and only good feature about the Magic Mouse is that it has really smooth scrolling and gestures. So you can scroll up and down with one finger and it just flows with the inertia of a touchscreen. Like you can toss webpages and apps around and catch them with this smooth scrolling. You can two fingers swipe between spaces. You can zoom in and outta things, it's so smooth, just like a mouse should be. And every single other mouse for Mac scrolls in jittery chunks, basically because they literally have to just pick an integer for how many lines they want to scroll with every unit scrolled on the scroll wheel. It's just night and day difference. There's just no way for it to be as smooth. Now this is also true about the Magic Trackpad which is actually why I literally use one on my desk alongside a good mouse. And I know plenty of people who just use a track pad and no mouse at all. So if you really listen to people who defend the Magic Mouse, you'll typically hear something along the lines of, well, except for, insert giant flaw here, it's a great mouse. Except for comfortableness, it's amazing. Except for the whole charging on the bottom thing, which you only do once in a while, it's great. But that's a pretty big thing for a mouse. I mean, there's really not much that they have to get right. The Magic Mouse is one of the most frustrating Apple products because it just, it could be so good. With their trillions of dollars, they could just hire a building full of the best mouse designers on the planet, they could buy whatever people they want to design the most incredible mouse mankind has ever seen and it could have smooth scrolling but they don't do it. They don't do it. I knew this was coming. It's a bad take. Tensor sucks and Google should have stuck with Snapdragon. I can get behind half of this take, not the whole thing but I can get behind half of this. Tensor is not great. You know, like two years ago, Google made this bold choice to move from Qualcomm Snapdragon chips in their phones to their own custom design Tensor chip that's actually built by Samsung. And the idea was to be able to dedicate certain parts of the chip to certain functions whether AI related or just specific to the phone, speech to text, things like that. We are two generations in now, so we're at Tensor G2 in the Pixel and they have relatively weak raw performance and they also don't have great battery life and they're not very efficient. So I get why people say Tensor sucks but I don't think they should have stuck with Snapdragon. I still think there's time, I still think in two or three generations even, they could get to the point where they have such good optimization and such good calibration with exactly what they wanna do with these chips, that they'll be the most efficient, best battery life, best experience, something that they could never have created by just buying an off the shelf bunch of Snapdragon chips. So I think today, like if today they literally offered a Snapdragon Google Pixel with a Snapdragon 8 Gen 2 and a Tensor G2, I think today I would pick the Snapdragon one but I don't think they should just give up on the Tensor dream. Okay take. All right, Beats are and have always been very good. Often people pretend that sound isn't incredibly subjective. A natural/audiophilic sound is always less enjoyable and more jarring outside of pro referencing. You know, you bring up a really good point. Audio is subjective, audio is definitely subjective. You know back in the days of making fun of Beats headphones for being overpriced garbage sounding plastic, there was always a little kernel of truth underneath it all, which is that people still bought Beats all the time and enjoyed them. And I always found that fascinating that you could literally tell people that there's another pair of headphones out there that sounds better for half the money. And people in that world where it seems like a totally straightforward choice, they would still pick the Beats and love them and recommend them. And the truth is like, yeah, for most people, if you just give them their first pair of nice headphones, their first pair of expensive headphones, and they've got this nice V-shaped equalizer, a big thumping bass and they're not really thinking too hard about it being nice and flat and a nice professional sound, they're gonna be impressed. It's gonna sound really exciting and interesting for most music listening which is what people are doing with Beats headphones. It's great, it's fine. Like audio is, it really is one of the most subjective things in all of the tech world. And there are tons of reviews and studies out there with countless examples of this. It kinda feels like the only trait in audio that people universally find impressive is just loudness, just higher volume, but kind of across the board, anyone can kinda enjoy any sound signature and generally headphones these days are good enough to have an EQ and be able to sound differently based on different types of music and movies and whatever you're doing. Now, all that being said, I don't think I could still say that Beats have always been very good. At some point in the past, they were definitely a much more expensive, cheaply built version of the average headphones you could kinda just get anywhere else but the marketing team has always been very good. That has always been good. So I think, yeah, decent headphones today, decent take. Also side note, I continue to be so fascinated by the behavior of them as a company like Beats since they've been purchased by Apple and the newest pair of Beats by Dre Studio Pro headphones are the latest example of that. Let me know if you guys are interested in a video about these things by hitting that like button. Either way, this has been really fun, I think we should do this again sometime for sure. Not doing that one. So leave your hot takes, I say leave them in the comment section below and I'll sort of comb through those, it's not even mathematically correct. And I'll comb through those and I'll find the best ones and we'll do an another tech hot takes video in the future. Have you read my shirt this entire video? And I think that'll be really fun, just make sure they're a little more varied and different from this past one. I hate this, I hate this one.",
    "transcript_keywords": [
        "Magic Mouse",
        "Apple Maps",
        "Mouse",
        "Google Maps",
        "Apple",
        "good",
        "Maps",
        "Google",
        "people",
        "Apple Maps Street",
        "Magic",
        "Beats",
        "good mouse",
        "things",
        "Snapdragon",
        "hot",
        "headphones",
        "Snapdragon Google Pixel",
        "Tensor",
        "million"
    ],
    "transcript_entity_values": [
        "41 years",
        "Apple",
        "1.5 million",
        "Last year",
        "600,000",
        "Marques",
        "Tensor",
        "just under a million",
        "three years",
        "half",
        "first",
        "the Magic Mouse",
        "iPhone",
        "Tesla",
        "trillions of dollars",
        "Samsung",
        "The Magic Mouse",
        "today",
        "2026",
        "one",
        "the Magic Mouse",
        "Snapdragon",
        "10",
        "Ford",
        "two years ago",
        "AirPods",
        "EQ",
        "JxmyHighroller",
        "Tesla Cybertruck",
        "two",
        "100%",
        "F-150",
        "100",
        "the Magic Trackpad",
        "the billions of dollars",
        "Qualcomm",
        "Google Street View",
        "Tensor",
        "three",
        "Mac",
        "Gen 2",
        "the next week",
        "every 49 seconds",
        "more than one",
        "decades",
        "Model 3s",
        "Tensor G2",
        "America",
        "$3 trillion",
        "100",
        "NBA",
        "second",
        "just night",
        "these days",
        "AI",
        "some fraction",
        "Google Maps",
        "nine",
        "The Magic Mouse",
        "8",
        "EV",
        "a Tensor G2",
        "Apple Maps",
        "Cybertruck",
        "46 years in a row",
        "Oliur",
        "Google",
        "17",
        "Snapdragon",
        "the days",
        "Magic Mouse",
        "number two",
        "the Magic Mouse",
        "500",
        "a ton",
        "a million",
        "Tim Cook"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "MONEY",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "FAC",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "TIME",
        "CARDINAL",
        "DATE",
        "LAW",
        "FAC",
        "GPE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON"
    ]
}