{
    "id": "K-0IpWVt7do",
    "title": "Not so Glorious... - Glorious Model O 2",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-03-14T16:03:49Z",
    "video_url": "https://www.youtube.com/watch?v=K-0IpWVt7do",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "glorious",
        "gaming",
        "mouse",
        "gamer",
        "esport",
        "wireless",
        "02",
        "o2",
        "o 2"
    ],
    "views": 217912,
    "likes": 7395,
    "comments_count": 625,
    "description": "Looking for your next tech upgrade? Check out Newegg at   Glorious has come a long way with their peripherals and David has been a long time user of the Model D-Minus, so when we got our hands on the new Model O 2, there was palpable excitement in the air. With connection issues and an interesting choice in build materials, will David be impressed or should you stick with your Amazon basics mouse?  Check out the Glorious Model 02 Wireless Mouse:  Buy a Glorious Model D-Minus Mouse:  Buy a Logitech G305 Wireless Mouse:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 The golden loot box 1:04 Unboxing 2:44 Design impressions 7:00 Sponsor - Newegg 7:36 Software and RGB 9:43 Gaming and connection issues 12:51 Pricing and overall thoughts 13:50 Outro",
    "description_links": [
        "https://lmg.gg/newegg",
        "https://lmg.gg/W3cXf",
        "https://geni.us/kwIECIj",
        "https://lmg.gg/fpK5n",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- When it comes to PC gaming peripherals, Glorious is sort of like the dark horse champion that I've always dreamed of. Hey, they might not sell the most mice. The most mice. That's weird to say. But they always produce pretty darn good results and the price is always quite fair. Today we have one of their first sequels, the model 02, essential, like oxygen. I was kind of, I'm kind of a little disappointed. I thought this was gonna be kind of a cooler gift box, but this is just trash. Do better, Glorious. - [Colleague] Mm, yummy, that's plastic. - Yeah, plastic. Inside this gift box, there's three devices. One of them is the Glorious Mouse Bungee. A great device. Absolutely not necessary, considering we are unboxing a wireless mouse today. Goodbye. What is inside of this nice little case? Oh, it's just a little travel case. That's all that's in here. Cool. And now the model 02. This is one of the most popular models of Glorious mice. It's an ambidextrous one. You know, kind of like a G-Pro, maybe 305, sort of shape. You know, like most Glorious mice, although there are some closed body ones, this is a honeycomb mouse. Which I am slowly growing to like a little bit more. We have this little thing of papers. Register your product. I will not. Your RGB brightness is set at 5%. Oh, that's pretty neat. I kinda like that it lets you know. I will be installing software so I'd find that anyway, but just a little tip. Cool. I love to shill. I'm quite excited to unbox this mouse. It's not drastically different than their last model, but I don't think it needed it. It was quite a good product. But there's a lot of significant refinements that should turn this into quite a compelling little package but we will cover those as we get to them. Let's keep unboxing. Silica, oh, tasty. Last couple things in the box. We have our paracord cable. It's a nice little touch that it's the same color as the mouse. Even when you plug it in, it'll look good together. I guess you could run it as a wired mouse. Maybe use the bungee, but we will not be doing that cable. Good quality. It's nice. Nice little detail. We have the Glorious logo etched into the USB. Next we have our dongle and our dongle adapter. I'm a big fan of including adapters like this, because you can use the same cable to charge your mouse as you would use to plug in your dongle. Keeps it simple. Less cable, it's always a good time. That brings us to the main event. The model 02 wireless itself. Glorious has changed a lot about the Model 0, including the texture, which is a little rougher to my hand but I think it feels fairly premium and it would last. The shape's also a little bit different, including the honeycomb design that is circles instead of, you know, hexes. You can actually see all the way through, which is interesting, that the honeycomb design persists on the bottom, meaning that there is kind of a big point of ingress at the bottom of your mouse, which I'm not a huge fan of. That being said, you shouldn't be dragging your mouse through a puddle of Mountain Dew anyway. In terms of aesthetics on the mouse, I am glad that they're kind of bringing down the giant face on the side to a little logo at the top. As well as, you know, some branding on the side. I am not a big fan of flashy mice. I don't even like RGB on my mice, but this is a little bit better. Another change is they've reshaped the buttons. They kind of curve a little bit more to your hands. Based on the shape and my, you know, small to medium sized hands, I will immediately palm grip this mouse, which is not my default hand stance, my stands hands. But it's comfortable in the hand. I find I have many points of contact, which is, you know, good for palm. This mouse is a little bit bigger than I would like for my style, but it's definitely very comfortable and the texture provides a solid amount of grip. In terms of other buttons, we have our two side buttons. My thumb lands pretty naturally on them. I'm not a big fan of buttons that are designed to feel sort of seamless from each other. The side buttons are fairly pronounced from the body of the mouse itself, but I can definitely tell you right now, if I use this mouse a lot, I would press both buttons most of the time and often press the wrong button. On the bottom of the mouse, we have a reminder that we live in 2023. Update all your peripherals. And then we have these stickers for our PTFE feet. It's pretty smooth. I feel like the glide pads are a little small, and so the experience I'm having, it's not bad, but it's certainly not amongst the smoothest mice I've ever experienced. On the bottom we have our DPI indicator and we have the BAMF 2.0 sensor which has a whole slew of improvements we'll get into. And also an indicator of one of, I think, the most important upgrades this mouse gets. Like the original, there is the 2.4 gigahertz mode but this one also comes with Bluetooth. Most of the time when I'm at home gaming or working I'm gonna use the 2.4 gigahertz mode. When I travel, there's a huge risk of losing it. My laptop and many, many laptops only have one type A port and so if I need that one, I'm unplugging my dongle, putting it down, you know, unplugging, replugging, and there's just a risk, you know, of it going missing. You don't have to do that. You can do Bluetooth. Sure, you lose a little performance, but what's a little performance in the face of overwhelming victory by not losing your dongle? Moving to the inside of the mouse, Glorious has upgraded the switches on the inside to 80 million rated ones as opposed to the 20 million rated ones. That's four times, you know, on paper reliability, that can't be a bad thing. The scroll wheel feels fine. Not too loose, not too tight. I feel like it would get pretty loose fairly quickly. I personally like looser scroll wheels, and this one's already feeling kind of on the edge of too loose. I don't like the texture on it. It feels okay, but it kind of feels cheap. Overall, I would give the feel and build of this mouse, you know, a solid pass. There's a few spots that kind of look crappy. The seam between the bottom and top assembly can be felt and seen, and I think that that sort of brings down the overall impression, at least from a distance. Like, you can't probably see it as well as I can, but that's, you can hear it. (mouse seam clicking) That's just my finger rubbing against this. This is probably the most pronounced gap. That's somewhere that there's a high likelihood my hand would be touching. I'm kind of a little bit disappointed in the overall build quality. Another thing that's upgraded on the inside is the battery. The previous model 0 was rated for around 70 hours on the 2.4 gigahertz channel. Now you get 110 using the dongle and up to 210. So that's got you covered for plenty and plenty of usage. But you know what else is plenty for anyone? Our sponsor, Newegg. Thanks to Newegg for sponsoring this video. Looking for the latest technology to upgrade your gaming rig, home office, or entertainment setup? Look no further than Newegg. As one of the largest online retailers of computer hardware, software, and electronics, Newegg has everything you need to take your digital life to the next level. They offer competitive prices, fast and reliable shipping, 30-day hassle-free returns, and excellent customer service to ensure that you have the best shopping experience possible. So when you're a tech enthusiast gamer or just looking for the latest gadgets, Newegg is the go-to destination for all your tech needs. Check out Newegg at lmg.gg/newegg. Excellent, we're plugged in. Slid the dongle in, turned our buddy boy to 2.4 and away we go? Okay, there you go. Sure. First impression when I turn it on, I am not a fan of RGB, but I think this looks pretty nice actually. That really 5%? I don't believe you. In terms of software, we have the Glorious software so we can customize it. Let's click and see what's available to us. Lighting. This thing is cutting in and out a lot. What the hell is going on? This is not a great experience. They lied to me. They said it was 5% brightness. Okay, so that's gonna what? 100%? Let's see what that looks like. Yeah, it's brighter. You can customize your key binding and your performance. I'm a big fan of this. I usually just disable everything but two DPIs. You can change the color of the DPI stage so you know which one you're using. I don't think the light's doing anything. So I have the different DPI stages that I'm switching between, but the light is not doing anything. Maybe I have to turn the lighting on? That would be a big mistake. Yeah, that's stupid. In order to get the DPI indicator color changing on the mouse, you have to turn on the RGB on your mouse. That seems like a little bit of an oversight. Hopefully it's something that can be fixed in firmware. Thankfully I know that I want 800, so. Outside of that, you can change your liftoff distance so you can kind of increase your accuracy when you're doing big movements and kind of lifting your mouse on and off of the mouse pad and your debounce time, which is an interesting thing to change. Basically your debounce time is the time in between button presses where it just won't register. And so if you're worried about double clicks or whatnot, you would turn up your debounce time. Yo, I'm a pro gamer though. I'm going down to zero milliseconds. Let's go. You can also change your polling rate. I'm not concerned about battery today so I'm gonna leave it a higher zone. Beyond that, you can save and export your profiles, kind of standard stuff. Nothing super extraordinary in this software, but it's there, which is always greatly appreciated. I'm definitely having an issue with dropout. The dongle is, you know, two feet away from this mouse, so I'm not sure what's going on. The mouse is charged. I don't think that it's a laptop thing, but maybe it is? It's kind of an annoying issue. We're gonna pop into CS: GO and see how this thing performs at clicking on heads. Now that I've switched my hand across this desk pad a couple times, my impressions of this mouse are kind of dropping. It's feeling, you know, kind of cheap. It's not sliding as smooth as I want it to. It's fine, but I can tell you right now that I am not loving this. What the (beep)? Why is it dropping out? What's going on? I'm gonna try a different USB port. If I wasn't shooting a video, I would be much closer to this screen so I could see a little bit better. Okay, I don't know what's going on, but that is not a good experience to have my mouse just kind of drop out every 10 seconds or so. If it wasn't for that, I would be crushing these bots. That's kind of a problem. Is that doing that with like other mice? I'm kind of fed up with these dropouts. I'm gonna test this mouse wired. So I'll unbox this mouse bungee. Huh, this is not having the dropouts, which leads me to believe- Oh, David, you suck. That it's more of a mouse issue, which is not great. It seems like it's stopped? Like it's not doing it at least as often. The problem here is not the accuracy. The BAMF 2 sensored is up to 26,000 DPI and 650 IPS inches per second, so that's kind of the speed at which it's able to track. That's good. That's better than the previous generation of mice, and totally adequate. It's a 1000 hertz polling rate, which is absolutely okay. But the fact that I'm having so much dropout is really alarming. We plugged in the mouse, it wasn't having the issue, and so it seems like there's some wireless connection problem. Actually I should, before I say that, I should just try a different mouse and see if that is the issue. This is one of the worst mice experiences I've had in a long time. Maybe I'm unlucky, maybe I got a a dud one, but this certainly isn't inspiring confidence. - [Colleague] What is the issue? - It's just, there's lots of dropout and then I'm, it's just having issues, it's just connecting. So I, (beep), never in my life have I needed to call in tech support to get a mouse to work properly. After updating drivers, including mouse drivers that are kind of just generic ones, it seems to be working a little bit better. Not a great user experience, but at least now we're not having dropouts nearly as bad. The problem persists that it just doesn't feel like that great of a mouse. Therefore, in conclusion, should you buy this mouse? How much does it cost? - [Colleague] 100 dollars. - Nope. Hard no. It's an okay mouse and I feel bad saying this. I like Glorious products a lot of the time. This doesn't feel quite as refined as some of other products and the feel of it, the experience isn't great. It's still a fine mouse. The accuracy is good, the buttons are fine. But I think there's better options. If you wanna stick with Glorious, I still love the Model D Minus, both the wired and wireless one. I think that's a better shape. Yeah, the sensor's not, you know, as up to date, but it wasn't a problem before. You're never gonna go over the 400 IPS anyways. And there's a whole bunch of refreshes that I'm sure are gonna come now that they have the new sensor. So yeah, don't get this mouse. Hold off, wait for another Glorious one, or you know, get a Logitech, a 305. It's a lot cheaper and feels kind of better. That's it. Thanks for watching Short Circuit. If you like mice videos, why not check out video where I unbox one of the best mices I've ever used, which is a Razer, strangely enough.",
    "transcript_keywords": [
        "Mouse",
        "kind",
        "Glorious",
        "dark horse champion",
        "mice",
        "Glorious Mouse Bungee",
        "Newegg",
        "bit",
        "time",
        "Glorious mice",
        "feel",
        "good",
        "model",
        "Glorious Mouse",
        "dongle",
        "buttons",
        "DPI",
        "big",
        "thing",
        "feels"
    ],
    "transcript_entity_values": [
        "up to 26,000",
        "2.4 gigahertz",
        "210",
        "two feet",
        "PTFE",
        "Yo",
        "100%",
        "three",
        "One",
        "30-day",
        "one",
        "every 10 seconds",
        "USB",
        "Newegg",
        "0",
        "2023",
        "110",
        "around 70 hours",
        "Logitech",
        "80 million",
        "Today",
        "2.4 gigahertz",
        "650 IPS inches",
        "2.4",
        "20 million",
        "David",
        "the Glorious Mouse Bungee",
        "Glorious",
        "Bluetooth",
        "first",
        "two",
        "Razer",
        "305",
        "5%",
        "four",
        "400",
        "CS",
        "1000",
        "Short Circuit",
        "RGB",
        "First",
        "2",
        "today",
        "2.0"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "FAC",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL"
    ]
}