{
    "id": "k1TyDOwe67I",
    "title": "The Ultimate Mobile Miter Saw and Table Saw Work Bench! #TeamTrees",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-11-11T14:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=k1TyDOwe67I",
    "category": "Howto & Style",
    "tags": [
        "Team trees",
        "teamtrees",
        "woodworking",
        "best woodworking bench",
        "miter table",
        "table saw",
        "how to build work bench",
        "how to build woodworking table",
        "shop tour",
        "Woodworking shop",
        "woodworking tools",
        "best work bench",
        "cheap woodworking bench",
        "shop bench",
        "shop tools",
        "how to",
        "DIY",
        "DIY shop table"
    ],
    "views": 537854,
    "likes": 28909,
    "comments_count": 1775,
    "description": "Playing with dead trees is super fun. As long as there are trees being planted to replenish what we cut down! Donate to #TeamTrees HERE:  we are getting close to our goal of 20,000,000 trees donated by 2020! Team Trees and the Arbor Day Foundation will make sure 20,000,000 million trees are planted and cared for around the world by 2022.   In this video Ill be showing how I built a woodworking table for my shop. I wanted a table that could conserve space, be partially made from scraps I have from other projects, AND have room enough for a miter saw and a table saw. All said and done, the main portion of the table was about 8 feet one inch long, and 35 inches tall. the side table added about another 2 feet to the length. The measurements all depend on the size of your tools.   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://teamtrees.org/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "[Music] So trees are pretty cool. They take carbon out of the air and turn it into oxygen that we breathe. Pretty important. Trees take that bad carbon and turn it into wood. Wood literally grows on trees. We plant good stuff and we get more good stuff in return. You reap what you sow. Today we're going to talk about different types of wood and how humans can make wood themselves, while I show how to build this workbench behind me. One of these days I want to make one of those cool epoxy river tables that you see on Instagram, but I'll save that for another video. You might have heard about something on the Internet lately called #TeamTrees. A bunch of people all over the world are joining together to raise 20 million dollars to plant 20 million trees. One dollar equals one tree. And we're almost there. Currently we're sitting just shy of 15 million dollars. I was going to donate $10,000, but then I saw Linus donating $10,000 and I couldn't let him beat me. So I'm one-upping him with $15,000. $15,000 equals 15,000 trees planted. And the cool thing right now is that YouTube is actually matching the donations - $ 1 million worth. So that $15,000 that just got donated is now $30,000. And your YouTube donation can be doubled as well. They're still doing it. Nobody can do it alone though. It takes a team. So if you enjoy oxygen, find that YouTube donation link somewhere around this video, or go to TeamTrees.org and donate directly on the website. And by our example we can show everyone that the planet is important. The link is down in the description. Now it's time to show you how I built my workbench. Let's get started. [Intro] So I recently moved shop and I don't have a good spot to put my power tools you know, my table saw and my miter saw. Right now I just have this white desk and it adjusts up and down but it's not super convenient. So today I'm going to build something that fits in this place that works a lot better for the woodworking tools that I'm going to put there. It is weird in a video about planting trees that I'm using cut down trees for this project. But a lot of this wood has been salvaged from other projects and was just laying around and would have been thrown away. I've jotted down some tentative ideas of what I want this project to turn out like, but since I haven't built it yet and the plans aren't finalized, it'll be interesting to see how this turns out. So I'm going to be using these larger posts as the table legs. You might have noticed that these 4x4's have little notches in them. That's because this particular wooden post is pressure treated meaning that it's designed to be used outdoors, like for a deck or a fence. [Sawing sounds] The wood is soaked with preservative chemicals in a pressure chamber, and the wood absorbs those chemicals to keep the wood from decomposing with time or being eaten by bugs. Little grooves dug into the sides of the wood help the preservative sink in deeper inside the beam. From the cross section of the wood you can see how deep the chemicals from the treatment seeped into the wood. The little grooves in the side help facilitate that. Of course once it's dries it's totally safe to touch and work with. But you still never want to burn pressure treated lumber in a campfire. The most common size board used in construction is a 2x4, which means that the board is 2 inches by 4 inches. Fun fact the board is not actually 2 inches by 4 inches, it's 1 by 3 . You can see from this diagram of how a round tree is cut into different sized boards. The rough cut dimensions are indeed the exact 2 inches by 4 inches, but after it's been dried and smoothed out, it shrinks a half inch on either side. But we still call it a 2x4. Wood glue is a yellow adhesive designed specifically for wood, and when it's dried it's stronger than the wood itself. Since I'm screwing everything together, I don't really need the glue, but my Grandpa Jerry, who this channel is kind of named after, he would slather glue on all of his woodworking projects. So we might as well throw some on for good luck. The problem with naturally grown pieces of wood is that as they dry, they warp a bit. They twist, Especially if they aren't stored flat. So these minor variances have to be taken into account during construction. Now that the top is framed out, I can flip it over and frame the bottom shelf. So using salvaged wood scraps like this might mean that the work bench doesn't look as pretty, but you know, it's a work bench so it's not meant to be pretty. Now that the frame of the table is finished, the whole thing will eventually be mounted on wheels so it'll be off the ground. The bottom shelf is attached to the inside of the leg pillars so I'll never hit my shins on it when I'm working next to the table. [Drilling sounds] For the bottom shelf supports I could use any 2x4, but since I have some scraps laying around, we'll use this instead. Engineered lumber is where things start to get cool. A large board like a 2x10 can be used as a beam. But larger and longer wood has a tendency to be irregular with knots, splits and weak point inconsistencies that you can't trust to support very heavy loads. This is where engineered lumber comes in. This lower shelf definitely isn't considered a heavy load of course, but I can still cut this scrap down to the size I need. These man-made, perfectly straight and true beams can handle consistent loads every single time. And because of that they're used a lot in residential construction. Small wood fragments are glued together and steam pressed to make these beams. This particular fragment was previously headed to the dump, but now it's found a second life supporting my shelf. I'm using an MDF sheet to cover the shelf surface. And before I explain how that's made, this clip shows the reason I'm mounting the table saw flush with the top surface of my workbench. When ripping or cutting long pieces of wood, it really helps when both the sides and the end of the board are supported and the worktable I'm building will be able to do just that once it's finished. You can see that the sheet I just used is made up of very fine fibers. This is MDF, or medium density fiberboard. Another engineered piece of wood. It starts off as a tree of course, but then is ground up, steamed, and fluffed into fibers. Then combined with a resin or wax and is hot pressed into a long flat board. The nice thing about MDF, particle board, and plywood, which we'll talk about in a minute, is that they can all be made from the leftover dust and chips from milling regular boards. None of the tree is wasted. The top of the table is rather complicated since I want to mount my miter saw into the table so that the surface of the saw is flush with the surface of the table, making it easier for me to cut long boards. To do that, I'm going to take a 2x6, which is a slightly wider version of a 2x4, and rip it to the same depth as my miter saw. In my case, about 4 inches. That way when I frame the top of the table I can make a little square cut out in the center for the saw to sit in. You'll see what I'm talking about in a second. [Drilling sounds] All the support boards I have here in the center are going to keep the top of the table sturdy and steady. The top of the table is another thicker piece of MDF. The same engineered fiber type board we used for the bottom shelf. Since I don't have my table top saw mounted yet I'm just using a circular saw to cut the large sheet the right way. It's a bit slower and not quite as exact, but still gets the job done. All of these saws accomplish different things. Alright the table saw cut is done. Now we just need to cut out this little portion here for the miter saw. [Sawing sounds] The saw I'm using now to cut the 2x4 frame off the table opening is called a reciprocating saw. And this saw I'm using here to cut the top of the MDF is a jigsaw. Measure twice cut once. Now that the top is cut, nice, I can save the top piece and add it to the base of the miter saw opening. So in order for me to mount the miter saw inside of the table, I'm going to use these metal brackets right here. These are slightly modified construction framing brackets. I just drilled a couple extra holes in them and mount it to the underside of the 2x6 that we, you know, shortened up a little bit. That way they'll be able to handle the weight of the puzzle piece chunk we cut out of the top board earlier, which is going to sit down inside of this hole we framed out. I have a feeling that we're going to add supports here in a minute, but I'm going to see if the miter saw fits. Not too shabby. So I'll definitely need supports right here, but it looks like everything is good. Once we get the top piece on it should be flush with the bed of the miter saw. Now we just need to add the table saw portion after we get those supports. So now I'm going to put the supporting pillars underneath the platform for the miter saw. And yeah, even though I'll be screwing the top board into place, I'm still going to be adding glue everywhere because 1) that's what Jerry would do, and 2) it will help the table structurally and keep it from twisting or bending because it will be totally secured. I'm going to countersink the screw holes so that when I do screw in the top boards to the table and they won't catch on anything sliding over the top. It turns out that my metal strap idea wasn't strong enough for my miter saw so I added some 2x4's underneath the miter saw cutout to help support the saw and give me a place to screw the saw into the table to help hold it in place. And there we go. The miter saw is in position, flush with the surface of the work table. Now we just have to build the side rack for the table saw. This is also going to sit flush with the table top so it can simultaneously use the surface of the table and also be the surface of the table if needed, since the surface of the saw is flat and it can retract the blade into itself. For the table saw rack we're going to use particle board. This is a much lower quality version of the MDF also cheaper. And is actually made from hot pressing sawdust into a sheet instead of using fibers. The particles are much bigger than fibers and it's not quite as strong. But I had some saved from some old shelves I tore out, so here we are, giving it a second life. It'll be supporting the same saw that cut it in half. Luckily, now that the miter saw is positioned in the table, I can use it to cut the boards for the table saw rack. Getting off the floor is a welcome change. The trickiest part of this side rack is to get it to the right height. If the saw sits too low, it'll defeat the whole purpose. Using some clamps, math, and measuring, I was able to get things pretty well figured out. Once the saw's framed to where I want it, I can quickly cut the OSB for the lower shelf. OSB or oriented strand board is also engineered and man-made. Except this time, instead of using fiber or sawdust, it's using larger yet still super thin strands of wood. These thin chunks of wood are all then heat pressed into one massive sheet. The cool part about all these different wood products I've used in this table is that nothing goes to waste from the tree when they were being made since every part of the tree can be used. Trees also grow pretty quick and they are renewable. And sustainably managed forests are a net positive for the environment. Even though the trees get cut down to make this lumber, the forests all get planted again right away so they can repeat the process. And, of course, as the trees are growing, they pull carbon out of the air and give us oxygen. It's a win-win. I'll get the supports for the particle board screwed in. Then I can start screwing down the particle board itself. This stuff is pretty flimsy when it comes to screwing. I'm pre-drilling my holes so that the pressure of the screw going through the wood doesn't blow out the edges. It doesn't hold together as well as normal wood, or even OSB or MDF. I'll also be countersinking the holes, just like we did on the table top so that the screws sit flush with the surface. The nice thing about adding wheels is that if I want to raise or lower the table an inch or two later on, I can just change the size of the casters. And there we have it. The workbench is complete except for the casters on the bottom. It is flat along the table saw and flat along the miter saw. Plenty of room for activities. Now I'm going to flip it over and add 6 wheels on the bottom. The wheels can hold 1500 pounds so no worries there about them being fragile. They'll be able to handle the workload just fine. [Drilling sounds] Yeah maybe I went a bit overboard on the wheels, but they come in packs of 4. And there you have it. A fully functional work station that fits my miter saw and my table saw with plenty of room for storage. I'll probably add a power strip in the future to organize the cords a bit better, but either way, it's way better than my previous table. I'm pretty excited with how well it turned out, and it should last me for forever. Don't forget about Team Trees. Even a few dollars goes a long way, especially when everyone chips in. So do it now before you forget and let me know down in the comments if you donated. Also let me know if you enjoyed this video. It's a bit different than my normal content but I feel like it was pretty important. It's for a good cause. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "table",
        "wood",
        "cut",
        "top",
        "board",
        "miter",
        "table top",
        "trees",
        "MDF",
        "surface",
        "tree",
        "boards",
        "pretty",
        "top board",
        "shelf",
        "particle board",
        "inches",
        "good",
        "bottom",
        "bottom shelf"
    ],
    "transcript_entity_values": [
        "4x4",
        "15 million dollars",
        "6",
        "Instagram",
        "2 inches",
        "2x10",
        "One dollar",
        "Jerry",
        "20 million dollars",
        "4 inches",
        "Grandpa Jerry",
        "1500 pounds",
        "one",
        "1",
        "about 4 inches",
        "a minute",
        "a few dollars",
        "half",
        "a half inch",
        "4",
        "Team Trees",
        "Linus",
        "an inch",
        "20 million",
        "YouTube",
        "second",
        "TeamTrees.org",
        "$ 1 million",
        "TeamTrees",
        "30,000",
        "Today",
        "15,000",
        "3",
        "One",
        "MDF",
        "YouTube",
        "15,000",
        "10,000",
        "2x6",
        "Twitter",
        "2x4",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "ORDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ]
}