{
    "id": "K4GML51Th8U",
    "title": "He Couldn't Believe It Was the SAME PC!  - Gear Up S1:E3",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2023-04-21T21:23:01Z",
    "video_url": "https://www.youtube.com/watch?v=K4GML51Th8U",
    "category": "Science & Technology",
    "tags": [
        "gear up",
        "micro center pc",
        "micro center",
        "duluth micro center",
        "microcenter",
        "pc upgrade",
        "pc gear",
        "gear up s1e3",
        "gear up season 1",
        "micro center atlanta",
        "pc transformation",
        "pc gear up",
        "greg salazar",
        "gaming pc",
        "pc gaming",
        "pc",
        "gaming",
        "amd",
        "amd gaming",
        "amd gaming pc",
        "ryzen gaming pc",
        "upgrading a viewers pc",
        "he couldn't believe it was the same pc",
        "he couldn't believe",
        "same pc",
        "viewers pc",
        "free pc",
        "free pc upgrade",
        "Pc giveaway"
    ],
    "views": 93995,
    "likes": 5411,
    "comments_count": 444,
    "description": "SPONSORS: New Customer Exclusive  Free 256GB SSD:   Learn more about KIOXIA storage solutions:    Welcome to our Gear Up series! In this episode, we meet with Ethan at the Duluth, GA Micro Center to upgrade his old gaming PC! He's currently rockin' an AMD Ryzen 5 3600 and RX 6600. Let's see what budget he wins and how he spends it!   Consider supporting us on Patreon!   Shop Micro Centers Apple Savings Event:  Redeem Exclusive Offers at Micro Centers new Indianapolis Store:  Check out Micro Centers Custom PC Builder:   SPONSOR: Snag a VIP-SCDKey OEM Windows 10 Pro key for $16 and use code 'SKGS' for a 25% discount:  Win10 Home ($15):  Office 2019 ($48):    PC parts list: AMD Ryzen 9 7900X, ASUS B650E-F, & G.Skill Flare X5 DDR5 Combo:  Shop Deep Cool AK620 CPU Air Cooler:   Shop Inland Prime 2TB M.2 Internal SSD:  Shop Arctic Cooling P12 PWM Dynamic Bearing 120mm Case Fans:    My studio gear on Amazon: Sony A7C (Primary):  Sony a6600 (Secondary):  Sony a6400 (Webcam):  2x Pixio PX277 Prime 165Hz IPS Monitors:  Neewer LED Lighting Kit:  Audio-Technica AT2035:  Yamaha MG10XU Mixer:  Neewer Microphone Arms:  Arrowzoom Sound-Damping Foam Panels:    Follow me on social media: TWITCH:  FACEBOOK:  TWITTER:  INSTAGRAM:    Join our public Discord server:   DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our Rakuten account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.  #GearUp",
    "description_links": [
        "https://micro.center/b89",
        "https://americas.kioxia.com/en-us/business/ssd/client-ssd/xg8.html",
        "https://www.patreon.com/gregsalazar",
        "https://micro.center/w4f",
        "https://micro.center/ymj",
        "https://micro.center/v0h",
        "https://bit.ly/Win10SKGS",
        "https://bit.ly/homeSKGS",
        "https://bit.ly/2019SKGS",
        "https://micro.center/dyn",
        "https://micro.center/641",
        "https://micro.center/mv2",
        "https://micro.center/wjl",
        "https://geni.us/lOeoIA9",
        "https://geni.us/k8VBToq",
        "https://geni.us/24nqw",
        "https://geni.us/bCg4nD",
        "http://geni.us/9VTXr0",
        "http://geni.us/xvQc",
        "http://geni.us/d4VvGM",
        "http://geni.us/1w5Sx2Y",
        "http://geni.us/EKFxZc",
        "http://www.twitch.tv/GregSalazar",
        "http://www.facebook.com/GregSalazarYT",
        "http://www.twitter.com/GregSalazarYT",
        "http://www.instagram.com/GregSalazarYT",
        "https://discord.gg/jYA9Xvp"
    ],
    "transcript": "What's going on everyone? This is another episode of our Gear Up series and this time we're at the Duluth store which is on the other side of Atlanta. Ethan, who is our contestant today, is already in the store and he has his rig ready to be upgraded. So hopefully you guys enjoy this one. Stay with us. Also, sorry about the wind. Alright, so we're here with Ethan. How you doing, Ethan? I'm doing very well. And he drove out with his rig. So you want to tell us a little bit about the specs that we have currently? So currently we have a Ryzen 5 3600 inside here. We have an RX 6600X from XFX. I think a Cooler Master 71C cooler. And then we have an Asus B550M WiFi. So judging by the rig we have now, we have a micro ATX motherboard. Again, Ryzen 5 3600. Possible he might want to upgrade the platform here. Again, it's going to be up to him though and really what he spends budget-wise. The graphics card being a 6600XT. This is already a pretty decent card. But again, depending on what he spends, he might be able to upgrade this as well. Possibly upsize that cooler a bit. So we'll see where this goes. Right, so the wheel spin. The baby blues are the highest numbers. 1200 is the highest you can get. I think 650 is the, or no, 600 is the lowest, which is somewhere on here. Right there. Yeah, there's a couple 600s. And then everything in between. So go ahead and give it one solid spin. Here we go. Big money. Big money. Oh, you're good. Spin again! It's going to be my luck. I'm going to get 600. If it hits 600 again, I don't know. Aw, baby blue. Give me that boo-boo. 800. Okay. All right. 800 bucks. I think we can do something with $800. Absolutely. Cool. All right. So time to get started with the upgrades. QN, our man, AA Ron. I'm sorry. I had to. He's our micro center specialist. And yeah, I mean, 800 bucks. What do you think we can do with that? Honestly, I think we're going to do a lot with 800 bucks that a lot of people would probably just blow through with one graphics card purchase. Are we doing that? I don't know. No? Wait, he's entertaining the idea? The thing is, there's already a solid card in it. So we're going to work through that. See what's going to be the best upgrade for the dollar. But I'm excited to work with y'all. And let's get this thing rolling. You probably did one of the AMD bundles. Okay. That's the main thing I'm focused on. So it'd be three main big parts. You already have decent storage, but depending on what's left in the budget, depending on which level of upgrade you go with, we can reference that. Okay. So we're thinking possibly starting with the platform. Going to look there. They have great bundle deals. This is micro center after all. You already have AMD, right? Yeah. So your boot drive is already synced with AMD drivers. Swapping without reinstalling Windows would probably give you some driver conflict. It's so hard because the thing is, I just reinstalled Windows last week. So I don't really care. I already moved all my stuff to my other drive. You game mostly with this rig, right? Yeah. I'd go with either the 13700K or the Ryzen 9. Yeah. They're both at the same price and those are both going to be very, very large upgrades. And this comes with DDR5 too. I mean, both of those kits come with DDR5. So you're getting basically your whole platform for 5, 600 bucks. Okay. So we think we've decided on what the 7700X, right? And that comes with 32 gigs of DDR5 and a pretty beast motherboard as well for 499. So you can have a sizable chunk of your budget left over by upgrading your entire platform here at Micro Center. That's pretty awesome. I'm out of them in the case. It turns out they don't have, they're such a good deal. They don't have any more. There it is. Look at that. There's this guy. Look at that. It even has Wi-Fi on it. Look at those pesky wires. Oh yeah. Built-in Wi-Fi. It's always clutch. But if you use Wi-Fi on a desktop, you're a little weird. I do that. I know. I don't have any RJ45 ports in my house. Who built my house? We went through this at the last store too. They made fun of you too? Oh yeah. Well, rightfully so. I make fun of myself for it. So starting with Deepcool, this is going to be the most budget-oriented. It's going to be a dual tower, dual fan cooler for $65. It does do extremely well. Yeah, absolutely. Yeah. It's like the most affordable value option that does the job well, right? I really think it will be. That's smart. I think he's going to have a lot of room left over in his budget to probably scale up some other things he wasn't thinking he was going to be able to do. I was expecting you to go water-cooled too. Yeah. I think it's a smart choice. This is a smart choice. Here, I'll let you do the honor. Nice. You've got more than half a build there. I know. It's crazy. You've got a little, you've got what, $230-something dollars left in your budget? Yeah, it's crazy. So obviously not enough here for a graphics card replacement over your 6600 you already have. But you could go more storage. You could go bigger power. So you have a 600-watt unit right now? Correct. So I think we decided on the Inland brand, which is the in-house version of storage. And it's the cheapest. It has a really good warranty apparently. Yes. Which is awesome. I see no harm there. And yeah, it's going to save us some money. Yeah. And it comes in Gen 3 and Gen 4 options. Ooh, question. Gen 3, Gen 4. Mine actually has Gen 5 now. No pressure. I think I'm going to go Gen 3. Gen 3. I do. He's trying to save some money in that budget. He's leaving his options open. I like this. I like it. So another cool thing. It says $350. This drive is actually $100. $100 bucks. The pricing on these little tags is usually MSRP. So always double check on the website to see what the price actually is. What's up, Jacob? This is incredibly cheap. I don't have this. I have one of the floppy disk things. You have a floppy disk? What's this called? It's a hard drive. I mean, yeah, that's what I have. You do not have a three and a half inch hard drive in your rig. Well, maybe for games, but like your primary drive is not. That's how I play Apex. This bogey is getting nice and full. Look at that. I think we still have around 130 or so bucks left to spend. Who knows? So they are still deciding what they want to do with the remaining budget. There's a lot of options here. I heard Case came up once. Power Supply, even upgrading CPUs. They go with a 7900X bundle. I heard Balls. We don't know what's happening here. There's Balls. Jacob's obsessed with this. This is the best brand ever. Sponsor us, please. You sound like you want to go to Ryzen 9. If you do, do it. Okay, you want to send it? Yeah. Okay. The whole thing about him going like this earlier, we're just undoing it. Try it back out. So we've upgraded platforms all around now. And that shrinks the budget down to, I think, what? We have $30 something dollars remaining. $35 left. $35 left. $35 bucks will give you what? Cable extensions? Additional fans? I think we can do fans, and I think we can actually do cable extensions. Wow. So if you want to spice it up aesthetically. Look at that. I like that we're downsizing and avoiding RGB where necessary. I actually admire this. That's going to get me crucified in the comment section, but this is awesome. Dark, dark case. Yeah. Nothing wrong with that. I'm going to say it. Some of the best looking PCs have no RGB. It's true. It's true. So this is where we play Soldier Boy and walk in slow motion. You can do that, right? Does Soldier Boy walk in slow motion? No, no. But we overlay Soldier Boy on it. You know what? Never mind. Anyway. Were you about to start singing? Were you singing just now? Oh my God. I wanted to say you. Okay. So we've got our stack here of stuff, and now it's time to go check out. There it goes. All being scanned in. A lot of boring math later. Right? Okay. So now it's time to unbox everything we just bought and start loading it up into the new rig. You're basically building a whole new system at this point. So it's going to be a totally, totally new rig. I'm so excited. Oh, actually, if you want to upgrade, I mean, you can be hands on if you want. It's totally up to you. I always wear a shirt. Yeah, you want to do it? I brought you a gift. Yo. Oh, dude, this thing has some meat to it. I know. Oh, man. I'm finally accepted into the iFixit family. Is it that? Here, I'll push down on that for you and then just pull straight up. Actually, let's get underneath it. There you go. And we'll set this to the side since we're going to be reusing it later. Everything's got the power supply unscrewed. Slide this old one out. Now, those of you actually, this is stupid because we're not even upgrading this technically. Correct. So why are we doing this? I've never seen it. Boy, that's that sweet, sweet pill. You got one right there. They give you lots of goodies on this board. You got one over the chip set down here. There you go. Nice and easy. Then you can lower the, it's good, that'll come off on its own. You can go ahead and, well, it's going to be pretty tough, but push it. That's hard? Yep. And latch it right under that thing. Perfect. There you go. Oh, wow. It wasn't so bad. Okay, on goes the cooler. And actually, it's really convenient that they bundled a lower profile kit of DDR5 with this. Yeah. Because see, and we'll get them on that side, Jacob. You can see there's actually about, what, two or three centimeters worth of space there. So that worked out really well. Oh, yeah. You know we got to get this on camera. This is the good stuff here. That is a sweet, sweet pill. Now it's time for the platform swap. So you can just grab it here, actually. Just make sure you grab it on the cooler side, like right there. Yep. That's not going to detach itself. Yep. And then you got integrated IO shields. Just line that up with the case. Everyone on YouTube, close your eyes. Jacob, where's my hammer? Oh, okay. So the update is we're just wiring stuff up now. This is the boring part. Simple wiring. No, it's the fun part. This is the fun part. No way. Yeah, that's right. I was about to say, this is, yeah, this is boring. But you got to get all the clips. Yeah, if I was Mr. Beast, these numbers would have extra zeros behind them, but we're broke. So shout out to Shaq. Wait, I got to zoom in way over on his face. Is he legit that tall? Yeah, it's supposed to be a life-size cutout. Yeah, you're good. A little bit of force. Nice. Just like that. Yeah. And then we'll tighten it down at the rear. You can connect the eight pin there. And then we'll just clean up cable management just a tad. Okay. And now it looks like everything is good to go. Are you looking at Shaq earlier? And front panel. Boy, this is looking pretty juicy. You got to put the right panel on, but this looks pretty fricking baller. All right, you ready for the boot? All right, let's see it. Hopefully it turns on. I'm going to feel really awkward if it doesn't. Maybe I should do that. Yeah, Jacob should. There you go. Okay, we have fan spinning. That's a good sign. I know the camera can't really pick those up right now. Oh, debug LED. So we're going to be looking for a post. Oh, we have debug LEDs now on this board, huh? Yeah. Oh, that's a start. It gets you somewhere in case you have issues. Come on, looking for that post. So this is AM5. It takes a little longer to boot, especially with two DIMMs, but we should be getting a post here any second. There it is. Looking good. So you, my friend, might need to have a few drivers updated. Windows should take care of most of that. Okay. But because you've got the same graphics card in there, honestly, you shouldn't even need to update graphics right now. You don't even need to update graphics drivers. Okay. Might need to tweak your fan curves a bit. This, by the way, barely fits in your case, but I think that's pretty cool. Nice and compact. That's just TPM resetting there. That's all it's telling you about. But yeah, I think it looks really good, especially seeing as you don't have the Rainbow Puke RGB anymore. Slightly sad, but it's going under my desk, so I don't mind anyways. Oh, under the desk? It is. You can't tell YouTube that. It's going on top. It's going on a ceiling. It's going on the roof. Oh, and by the way, Ethan said that he is going to be upgrading his current power supply, which, yes, is cutting it kind of close with this rig currently. It's a 600-watt unit, remember? With this beast right here, an RM850X, which you actually probably saw in an earlier episode of the Gear Up series as well. So this is a tried and true unit. It cost him about $140, $150. So he's going to upgrade that when he gets home. But yeah, now he's definitely got a well-rounded system that is also a bit future-proof as well. Right, so here we are. The rig turns on, and I've got to say, it not only looks a lot better, but it's going to be so much more powerful than the 3600, right, that you had in here to begin with? Yeah, the 3600. You're on a 7900X now. I know, I know. Are you an overclocker? I've never messed with it. Okay. Well, this chip is really powerful, and even though you still only have that 6600 in here, it's going to be a great 1080p gamer. And even 1440p, I'd wager, you can pull off of this as well. So what do you think? How do you think it turned out? Oh, my gosh. I am so excited. I cannot wait to go home and use this. Basically, on Minecraft, I would have stuttering, which, I mean, it's Minecraft. It should be the easiest game to run, but I would have frame stuttering, and I think, oh, I know that the new chip in here is definitely going to eliminate that issue. Definitely going to eliminate that issue. Coming from a Minecraft gamer, 100% can attest to that. Well, I'm glad that you're walking out here with a much nicer rig, totally revamped. Thanks for being part of the Gear Up series. And here comes the awkward handshake. I'm going to pivot to fist bump, fist bump. Anyway, see you guys in the next one. Oh, my God. You can stop filming now, Jacob, please. Good old Shaq. I can at least shake his hand. Hey, Ron. So I got to give you a shout because we're not going to see you tomorrow, apparently. Maybe we will? Maybe. I won't be in my work attire, but I'll definitely be around. Maybe you can just, like, hang out a little bit and maybe point us in the right direction. Cool, cool. Well, thanks for the help, man. Really appreciate it. Awesome.",
    "transcript_keywords": [
        "Yeah",
        "good",
        "rig",
        "Gen",
        "thing",
        "Jacob",
        "Ethan",
        "budget",
        "bucks",
        "left",
        "pretty",
        "upgrade",
        "Soldier Boy",
        "Cooler",
        "case",
        "card",
        "Boy",
        "lot",
        "Ryzen",
        "graphics"
    ],
    "transcript_entity_values": [
        "6600",
        "three",
        "32",
        "Apex",
        "two",
        "Gen 5",
        "65",
        "eight",
        "tomorrow",
        "the Ryzen 9",
        "second",
        "100",
        "YouTube",
        "Gen 3",
        "RGB",
        "Gen 4",
        "Minecraft",
        "Micro Center",
        "Ryzen 5 3600",
        "$30 something dollars",
        "MSRP",
        "Wi-Fi",
        "Gen 3",
        "IO",
        "230",
        "499",
        "Ryzen 9",
        "more than half",
        "today",
        "about $140",
        "three centimeters",
        "800 bucks",
        "AA Ron",
        "last week",
        "350",
        "one",
        "DDR5",
        "7700X",
        "the Gear Up",
        "35",
        "Deepcool",
        "YouTube",
        "Asus B550M WiFi",
        "650",
        "three and a half inch",
        "600 bucks",
        "Atlanta",
        "RJ45",
        "Minecraft",
        "Wi-Fi",
        "3600",
        "6600XT",
        "AMD",
        "Windows",
        "Duluth",
        "iFixit",
        "6600X",
        "DDR5",
        "800",
        "XFX",
        "1200",
        "13700",
        "ATX",
        "Jacob",
        "Yo",
        "Ethan",
        "5",
        "Inland",
        "around 130 or so bucks",
        "zeros",
        "$35 bucks",
        "7900X",
        "Beast",
        "100%",
        "Ron",
        "Power Supply",
        "RX",
        "TPM",
        "Gen 3",
        "Shaq",
        "150",
        "600",
        "600-watt"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "EVENT",
        "MONEY",
        "CARDINAL",
        "DATE",
        "EVENT",
        "ORDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "LAW",
        "MONEY",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "MONEY",
        "CARDINAL",
        "LAW",
        "CARDINAL",
        "DATE",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "DATE",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "LAW",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "GPE",
        "ORG",
        "ORG",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "QUANTITY"
    ]
}