{
    "id": "K5oAl2Xp-90",
    "title": "The best PopSocket ever might not be a PopSocket",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-10-04T14:00:24Z",
    "video_url": "https://www.youtube.com/watch?v=K5oAl2Xp-90",
    "category": "Science & Technology",
    "tags": [
        "gadgets",
        "tech gadgets",
        "technology",
        "verge",
        "the verge",
        "tech",
        "tech news",
        "mobile",
        "phone case",
        "magsafe"
    ],
    "views": 21830,
    "likes": 511,
    "comments_count": 9,
    "description": "This $40 magnetic phone grip and stand does what PopSockets can't -- the Ohsnap Snap 4 is thinner than a camera bump, has more ways to hold it, and you can keep it on while using MagSafe chargers and accessories.  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Tuesday and Friday:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz",
        "https://www.theverge.com/ethics-state..."
    ],
    "transcript": "Today I'm toying with an incredibly thin disc that's basically the best popsocket ever made. The Ohsnap Snap 4 is so much thinner, thinner than the camera bumps on many phones. But this one lifts, spins, supports so many different types of grips. And you don't need to take it off to get wireless charging or stick it to a fridge. How's it so thin? Little flexible arms on the inside criss cross as they fold, they stretch to fit a finger inside for a firmer grip. They bend when you notch the disc in place when you turn it into a stand. And they're strong. I've yanked on them repeatedly for weeks without breakage. Caveats: It can dramatically slow down wirless charging, particularly if you use a thick case. It relies on adhesive, not just magnets, because strong Magsafe mounts can overpower its own magnets. The disc can feel a little sharp, and at 40 bucks, it ain't cheap. It's just not as pretty as a good PopSocket, nor as personizable. Though these colors are pretty great.",
    "transcript_keywords": [
        "Ohsnap Snap",
        "incredibly thin disc",
        "incredibly thin",
        "Today",
        "made",
        "popsocket ever made",
        "disc",
        "toying",
        "incredibly",
        "basically",
        "thinner",
        "Ohsnap",
        "Snap",
        "camera bumps",
        "thin",
        "magnets",
        "inside",
        "popsocket",
        "charging",
        "thin disc"
    ],
    "transcript_entity_values": [
        "weeks",
        "Magsafe",
        "40 bucks",
        "PopSocket",
        "4",
        "Ohsnap"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORG"
    ]
}