{
    "id": "ka4GBTIrSxk",
    "title": "The Pixel Fold has a fatal flaw… - Google Pixel Fold",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-07-17T20:27:13Z",
    "video_url": "https://www.youtube.com/watch?v=ka4GBTIrSxk",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "Google",
        "Pixel",
        "Fold",
        "Google Pixel Fold",
        "Pixel Fold",
        "Phone",
        "Mobile",
        "samsung",
        "folding phone",
        "Google Pixel"
    ],
    "views": 274752,
    "likes": 8202,
    "comments_count": 643,
    "description": "Get your own Robot City skins from dbrand at:   The Google Pixel Fold has arrived! Will this new phone be able to take the top spot from the current Samsung Fold lineup? Or did Google just miss the mark? Find out as Bell takes you through his experience using the Pixel Fold.  Buy a Google Pixel Fold:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 0:20 What's in the box?! 1:15 Exterior impressions 3:00 Inside display specs 3:55 Hand feel and weight 5:06 dbrand! 6:38 Booting up the phone 7:50 Fingerprint scanner 8:41 Software testing 10:41 Speaker and display impressions 12:06 Camera impressions and specs 20:35 Labs test results 22:28 Comparing to the Fold 4 24:45 Closing thoughts 25:36 Outro",
    "description_links": [
        "http://shortlinus.com",
        "https://lmg.gg/Jdz33",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "Samsung has been dominating the folding phone space, at least here in North America, but Google is here to try to put a stop to that with their new Google Pixel Fold, and I'm excited to take a look. I'm a big flip phone fan, but I haven't actually spent a lot of time with the folding kind of big to bigger style of phone, but before we get to the phone itself, let's take a look and see what's in the box. Right away, front and center have the folding screen care guide, and we should probably pay attention because I've heard that people are already breaking their Pixel Fold screens, but this isn't mine, so we're not going to pay too much attention to that. We have our booklet that tells you how to turn on the phone, and their sim popper, which is great, and we have a USB C to C cable that is three feet long, nothing special there, and an OTG cable, so that gives you a USB C to USB A for transferring stuff over from your old phone or plugging accessories, but you'll probably just use it once in case you don't have a USB C phone. Other than that, that's it, so we'll get rid of all this and take a look at the phone itself. I'm excited because this phone is a little bit different from Samsung's foldables in the way that it's really thin while shut and folds completely solid close. Man, right off the bat, this is a good looking phone. It is, like I said, completely flat when it's closed compared to the little bit of a water droplet you get with the Samsung Galaxy Folds, and it's a different aspect ratio, so it's a bit kind of more stout. It's thicker versus the kind of taller, more candy bar shape of the Fold 4. I just kind of realized it kind of looks like a DS while it's closed. This looks like the top lid opens up. This would be the perfect DS emulator. So on the right side of the phone, on one half, we have our volume rocker and power button. That's also your fingerprint scanner. On the top, we have our speaker grill, and I'm assuming that's a cutout for millimeter wave 5G as well as a mic hole. On this side, we just have our hinge, which is the multi-alloy polished, cool looking hinge. And on the bottom, we have a lot of holes. I'm not quite sure what each one is. It could all be microphones. We have one here and then two more on this far side. Then we have the SIM tray, a speaker, and USB-C for charging. Let's take a look inside the SIM tray to see if we have two SIMs in the slot here, or if it's going to be an eSIM, or maybe there's an SD card. There's not going to be a spoiler. It looks like we have one physical nano SIM and then nothing on the other side. So you have to do eSIM. Maybe your country does it a bit easier than it is up here in Canada, but switching eSIMs is kind of a pain in the butt classic here. Moving to the front of the phone, we have our 5.8 inch full HD plus OLED, and it's 120 Hertz as well, which is great. This is such a great size that I'm assuming that you'll use this closed quite a bit. You're not going to be kind of sacrificing like you do in the flips for just having a little tiny screen for notifications. And it's Gorilla Glass Victus and supports HDR up to 1500 nits peak brightness. So they're not skimping on this front cover screen. They know that you're going to be using it quite a bit. So they're giving you flagship level specs on that outer screen, which is excellent. On the inside, we have a 7.6 inch 1840P 120 Hertz OLED. So again, pretty darn impressive specs. And you can see there's a bit of a rim around it, but I would say it looks pretty good. Obviously we don't have anything on it, but of course, this is not going to be a standard, just like Gorilla Glass screen on the inside. It is an ultra thin glass protective layer with a screen protector on it. So it has more of like a plasticy feel to compare to the glass of the outside. So if you've never used one before, it does have a bit of a different feel of a screen, but I don't think it's bad at all. It just feels a little bit gummy and you can see my gamer fingers leaving goo all over it. And for brightness, we've done testing on it, but they claim up to 1450 nits peak HDR brightness as well. So again, nice, big, bright, vibrant display, which I guess you should hope because this as a flagship device, I'm sure has a bit of a price tag to it. As for hand feel, it does feel a little wide. Like I can't reach the other side. I've pretty moderate sized hands. If you do the kind of balance, you can start to reach all the corners, but if you're somebody who has smaller sized hands, it's something to be aware of. But of course, when it's open, it's not quite as bad because you're going to be two handing it and thickness. It's only 0.5 inches thick while closed and 0.2 inches thick when it's open. But yeah, it feels really thin when it's open and it's thinner than the average phone. Maybe. Yeah. Phones are pretty thin these days. So I guess it's nothing to write home about, but let's give it a weigh and see how much it weighs. Cause you know, it is kind of dense, 283 grams. So mildly heavy. That's probably around what I think the ROG phone seven ways. And you know, it's a little bit heavier than the iPhone 14 pro max. So again, heavy, but you're going to be probably two handing it quite a bit. So it's not too, too bad, especially when you consider it has over a 4,800 milliamp hour battery in there. So other than that, this kind of feels just like the standard flagship phone, you know, it's got the same kind of pixel stylings on the back with its pretty decently sized camera bump, and it's got IPX8 water resistant. So it's not going to be dust resistant at all, but at least able to submerge it and not have to worry about it. So let's get it turned on and take a look at these big, beautiful screens after I tell you, but our sponsor dbrand. Oh my God. All of this. And this. Okay. Oh, it's a coloring book with the, uh, the robot city skins from dbrand. That's cool. A Rubik's cube with robot skin. This is going to be extremely challenging because each side is just a complete photo from robot city, but they all look extremely similar. Luckily I'm a pro. Yup. Proof. It's a thousand piece puzzle. Oh, I love the smell of a new puzzle. Oh, pixel fold skin, crime square, amusement park, dead quarters, and then just stickers. And I'm definitely stealing those. We have screen protectors for the outer screen. You're not going to put that on the inner screen because it won't close very well and will probably cause bad times. But for the outer screen, you definitely get that protected. I've used dbrand glass on my phones before and it works fantastically. And finally, we have a giant sticker pack, the luxury sticker pack. These are dope. Look at the giant shark fish. If you want to get your own robot city merch, make sure to go to short lines.com. I want to see someone solve that Rubik's cube. So send us a video of you completing it. I will be very impressed and Geoff will give you a high five. All right. Booting up the phone and it looks like stock Android because surprise it is. As for apps loaded on the phone, we have the things from labs, but it is just the Google based apps, which is great to see. Surprisingly, my ASUS did not come with it. That is something we, we downloaded. Checking out what we have for specs. It is like the other pixel devices we've had this year with the tensor G2 chip that we have in the tablet and pixel seven pro and a so nothing too crazy there. As for RAM and storage, we have the 256 gig model, but it does come in 512. And for RAM, it is 12 gigs. I said in the nothing phone video. I think 12 gigs of RAM is great for Android. It does seem like quite a bit, but when you're launching this many apps and kind of keeping things running, especially with the demand that a lot of apps have these days, you want to make sure that your phone's going to last the years and years that the build quality is now kind of getting up to. And speaking of Google's offering five years of security updates. So that's really great to see that they're going to try to make these phones last for as long as possible, because like I said, if it's a great phone, it doesn't matter if you can't trust to have your info on it because there's a huge security hole in two years. I'm not going to update it anymore. Like phones are expensive. Keep them updated. It shouldn't be that hard, but let's try the fingerprint scanner and see if it's any good. Again, I feel like with flagships are all pretty darn similar with how fast they are, but with this new form factor, you never know. Maybe this is going to be a completely crappy one. Bam. Pretty quick. It feels like most of it's coming down to the animation of the screen turning on and everything like that, but it is a pretty darn fast fingerprint scanner. I guess my only complaint would be is that it's kind of high up with the phone being so wide, you kind of have to hold it in a weird spot in your hand. So going all the way up there to get it can be a little bit annoying, but I guess it also means, you know, you're not going to get accidental presses and having the volume buttons closer is probably more useful, especially when you have this phone screen open. You got a lot of info on here. You're going to have some media playing and you're going to want to have access to this to turn things up and down. And one thing that's really nice about even the settings menu is they're taking advantage of this wide screen. So in here, opening up the screen, we have our settings kind of panel on the left and then the details on the right, which is really awesome to see. Let's check another Google app and see if they've optimized other things or if that is just a fluke that it happened to be for settings. All right. Yeah. You know, I thought I was gonna trick them by going to notes. As you see on the left side here, we have our list of notes and on the right, the content of said notes, which is great. And then if you rotate it, is it gonna stay the same? No. So once you get this different aspect ratio, it goes into a different mode, which is kind of neat as well. So it gets just a full pager. So you can just take notes while seeing more on screen and it gives us a split keyboard for easier typing with two hands as well, which kind of seems weird to have a split keyboard, but once you get used to it, it's great. When I was typing on my iPad, I found the split keyboard to be really, really quick because you just kind of memorize where the keys are on each side and then get to type in. One thing that is a little disappointing is that if you customize this outer screen with different widgets or move the apps around, it actually translates immediately to the inside of the phone as well. So you can have a different layout from the outer screen and the inner screen, which you can do on Samsung and other foldables. And I think that's what I prefer because you're going to want maybe a different layout on this outer screen to take advantage of this size or things you want to see at a glance, but on the inside, maybe have, you know, a full calendar or full size widgets for more of your apps because there's just more space for them. I'm hoping that's something they can change in an update, but as it is right now, I think that is a little bit of a miss and a point to Samsung who's been in the game a bit longer. One thing that they do have here is the new dock though. So if you swipe up on this lower rim without going far enough to get into the app multitasking, you can see here your most recent apps or most used apps that you can click and drag them onto the page to do multitasking. So it's a super convenient way, kind of like they do on iPads to just move through your apps seamlessly. So on the right, we have YouTube and left we have notes. I can swipe up and add mail to the left and change it all over. And then in your multitasking view, you have this pairing together now. It will take a little bit of practice getting used to pulling up that dock here though. Actually to get that last shot, it took me a couple of tries to not go into this multitasking view because it's obviously a bit new, but once you get used to it, it's pretty convenient. And then once we want just one full screen app, you can just drag this all the way. And since we're here, let's listen to some crab rave. I got to say, it sounds pretty good. It gets pretty loud. The sound's pretty balanced. It definitely feels dynamic on the two sides. One thing I noticed when I turned it, I guess portrait, because it opens up to landscape is it sounds a bit better because then your hands are here where the speakers are. So it bounces towards your face. I found that when it's in is kind of natural opening motion in that landscape view. The sound's just kind of shooting towards the table and it didn't sound quite as good, but still sounds really darn decent overall. And I think it's something that you could be happy with. As for the screen quality itself looks great. One thing obviously is that there are huge bezels because of this aspect ratio. But I mean, one thing you can do is just zoom in the image the whole way so that it fills the screen if you really want. But I guess don't do that. I don't recommend it. But as for brightness, I've got plenty bright. Color looks great. It's an OLED. And the sharpness is totally fine. So it's good to see that even though it's such a giant screen, they're not cheaping out and giving you something that's like 1080p or less, because you'd probably start to notice that, you know, seven inches. What if you watch it while closed? Yeah, no surprise, the speakers still sound great and the outer screen looks great as well. This is more of a natural aspect ratio. So you're just seeing more on this little screen though. There still is a bit of black bars because it is so wide. Doesn't look too bad though. All right, it's time to talk cameras because there are a lot. On the back, we have a 48 megapixel main shooter at 10.9 megapixel ultrawide and a 10.9 megapixel telephoto lens. You have quite a few options there. But that's not all because there's also an inner camera. So at the top of the bezel of the inner screen, there's another selfie camera here which is an 8 megapixel shooter. And on the cover screen, we have a 9.5 megapixel shooter there as well. Five cameras, all which can be used to take a picture of your beautiful face. So you've been looking to, you know, update your dating profile, this is probably the phone for you because you've got some options. You know, the nice thing with a folding phone is that if you want to take a selfie, you can actually use this outer screen and take a selfie with that. That's showing, right? Let's try it out. One thing that would be nice is that if you're, once you've taken a photo and you want to switch back to the main screen, it'd be great if you just, you know, tap or if there was a button or unlock you could do to bring it back to this main screen. You do have to do on this outer screen. And now let's try with the inner camera. And finally, the outer screen camera. Wow, that cover screen photo is actually way better than I thought it would be. It must have some sort of portrait mode on by default. As you can see, there's a little bit of artifacting right by my thumb here. And obviously, it's a pretty dramatic cut off, but I mean, it worked. I'm pretty darn impressed with this photo and I didn't have to do anything. It was just like a quick snap. Looking at the inner screen camera, I prefer the external screens camera, but this one here, totally reasonable. And if that was the only selfie camera, I would have no problem using that. Swapping to the outer screen, you know, of all the photos, this is probably my least favorite, but I think it's because it's not in a portrait mode. So it's just kind of trying to keep everything looking exposed and even, which doesn't necessarily flatter the main subject of the photo. Comparing the main cameras taking a selfie versus the external screens selfie camera. I think I prefer the external screen selfie camera because it gets my skin tone a bit more accurately. The main camera is exposing me very well and keeping me very bright and the main subject of the photo, but I feel like I'm not that light skinned compared to the external screens. Though I have to say the edge detection in the selfie mode is very good with the main camera. There are like a couple spots in my hair that are out of focus compared to the rest, but it looks very sharp. Now let's try taking some selfie videos. I guess we'll just take three and then look back at them. Hello, this is me taking a selfie video. How do I sound? How do I look? It's in like a weird letterbox. I feel very claustrophobic here, but maybe it looks good and sounds good. I can tell by the preview, it doesn't look great. This is a selfie video with the external screen. How does this one sound and how does this one look? Is it any different? Is it any better? Who knows? This is a selfie video with the external screen. It's a little weird to like line up because you want to line up with the screen, but you can't. So let's see how it looks. I didn't expect there to be so much of a difference between the three, but they are pretty significantly different. The internal one is definitely the worst. It looks the worst. And I don't know if it'll show up for you when you're watching the video on screen, but there was even ghosting, which is super odd. So internal camera, definitely the worst in every scenario, but the difference in the external screen camera and the main cameras is actually pretty interesting as well. The main cameras had a very clear microphone. Like it sounded very crisp versus the external screen had a pretty warm and full microphone. So it sounds different, but I think I prefer the main cameras mic, but I think I prefer the footage from the cover screens cameras because it's a more traditional kind of selfie video look. It's very easy to know where you're looking, where you're gonna look like versus the main cameras, because you're holding it, where you want to look at yourself on the cover screen, you're kind of off center. And then I wasn't a huge fan. I'm kind of surprised that I prefer the more kind of close and centered look of the external cover display. But I think no matter what all of them are fine. Like you're, none of them are blowing me away, but you know, you'll, you have lots of options. So Google is known for their cameras. And I took this out to the symphony last night to see how it performs in an indoor setting where it's pretty dark. And of course it performed very, very well, no matter if I was using the ultra wide, the telephoto or that 48 megapixel main shooter, I have to say the photos turned out really evenly lit across the board and the ultra wide didn't see too much distortion though. You can tell at the tops of the photos, especially with the dramatic ceiling, that there is a little bit of a warp to it, but nothing too bad. And I can only tell because, you know, I can directly see back-to-back photos that were taken with and without the ultra wide. One thing that wasn't as great was the video performance in the theater. You can see that some of the dark spots are quite noisy, but that'll happen pretty much with any phone. So I don't really have any major complaints with that. This one of the chandeliers using the 5x optical zoom. So you're not going to be losing quality like you would with the 20x super zoom, which, you know, maybe is useful for some people, but I don't know when I need to get that close to a subject from far distances because that's a little, it's a little weird, but I have to say again, it does look very good. And the contrast between the bright lit lights and the dark background, though, some of the parts of the background are a little lost or, you know, quite noisy. It's not super noticeable. Like I would post this on Instagram and I don't think anyone would really notice or call me out and be like, this photo looks a little weird in the dark spots. I also went outside and took some photos into daylight to make things a little bit easier for the camera. And the photos are pretty decent. I think the, I think the clarity looks really good and the lighting is pretty even though the plants definitely weren't this brown. They're pretty colorful to the eye in person, yet everything is just kind of yellow, orange, and brown, which is fine. Again, with the clarity, it makes it kind of look more realistic, I guess, but yeah, the colors are completely missing and I'm not really sure what caused that. Heading over to the motorcycle that we always take a picture of, it looks pretty good. The sharpness and clarity though, there is a bit of warmth. This motorcycle is black, but here it's, it's pretty warm black. Even in the fire hydrant in the back, it's a pretty red, red in person, but in here it's pretty faded. And again, the flowers in the background are very brown. I don't actually use a Pixel, so I don't know if that's standard. I think it's a good looking photo, but kind of like my complaints with the Nothing phone, I'd rather have a more flat or realistic photo and apply a faded filter or, you know, up the warmth than just have it kind of be warm and have to edit it back to what it actually looked like in person. As for the ultrawide, it looks good. Again, like I mentioned in the indoor photos, you can see a little bit of distortion on the sides, but I think overall getting everything in the shot is going to be way more worth it than that little bit of distortion. I know in some budget phones, the distortion can look pretty bad, but here it doesn't look too crazy. After taking some pictures outside, I went and took a video of Alex in the shop to see how it performs, you know, taking a video of people moving objects and some pretty flat lighting. And I'm not super impressed. So it starts on the ultrawide camera and things are pretty darn noisy, even though again, the lighting is pretty even and fairly darn bright, but when it switches to the main camera, it improves a little bit, but it's still not excellent. It would be great to see some of that noise cleaned up as there isn't really an excuse for it to be so noisy. I took a photo shooting towards the sun to see if there's any haloing or lens flare effects. And there is a little bit you can see in the shadow as there's a bit of a rainbow from the sun hitting the lens. But overall, I think it performs pretty strongly and lets things be contrast while not blowing up the sky. After this, I took a video of Andy to test the microphones and shake. All right, we're outside taking a video of Andy trying to find parking. We can hear the train in the background. It's a little windy. What do we have? Does it sound good? There's only one way to find out. Let's give it a listen. I got to say the stabilization though is really good on this. Like I'm jiggling the camera like a lot and it is holding steady, like really, really steady. I'm really impressed. The mic quality is totally decent. Again, it might be the speakers on the phone, so you'll hear what it actually sounded like, but I'm pretty impressed. There were still some sections with noise though, which is odd and I couldn't find any setting that I might've enabled that would be causing it. But again, something to be aware of though with the film grain and the bezels from this giant screen seems kind of cinematic. So at least you got that going for you. Let's now talk about labs results jumping right into games. The pixel fold performs okay, both when the screen is open and closed, but something to note is that when you're using that big internal screen, the performance does drop pretty significantly. Looking at dolphin emulator playing Mario Kart Wii, we can see the external screen doesn't perform great, but even then it performs leagues better than the internal screen with the external getting a median of 47 FPS and the internal only getting 29 FPS. Neither of those are very compelling though when even the 7A gets a median of 60 and every other flagship doesn't really struggle with the frame rates in any game we tested. The only one to really bounce back would be Call of Duty Mobile, which again on the external screen performs pretty darn decently with 93 FPS, but when comparing to the internal screen, it only got 79 FPS. So why is it performing so much worse even compared to the other pixel devices? Well, that's when it comes down to thermals. This thing is getting hot and especially with how thin it is, it's having trouble getting rid of all that excess heat when your hands are holding onto it, it's playing games, it's got the volume coming out and because of that, it's starting to throttle performance. Not super great to see and it's definitely the sacrifice of having this thin body. Luckily though, the battery performance is pretty solid. In the battery longevity test, we use the external screen because if you want to keep your battery going, you're going to be using that external screen. We were able to get 20 hours of video playback, which is great and compares to some of the best phones we've seen on this list so far. And for the stress test, we use the internal screen and hit the CPU and GPU hard and we're still able to get four and a half hours, which is again, one of the top performers that we've seen so far. Great job. As for charge times, everything seems pretty standard with a zero to 100% charge with a 65 watt charger taking an hour and 36 minutes. And in an hour, it was able to get 77%. So it might have the quickest top ups, but it's not too bad. And finally for brightness, the internal and external screen, we're both able to get 450 nits, which is a pretty middle of the pack result that we've seen compared to other flagships, but not too bad. Now Samsung for some reason has not sent us their fold devices before, so I don't actually have one to compare, but Elijah has been using a Fold 4 for about a year now. And one of my main concerns about folding phones kind of comes true with this one here. So it's been used for about a year. You can see all the gamer gear that's been building up over that time, but the internal screen looks awful. Look at that. That screen protector is coming off. It's fighting for its life. In fact, it's fighting for its life so much. Listen to this. It's not supposed to make that sound. And it's really not supposed to look like this. On top of that, it has a permanent kind of V shape. So even with me kind of trying to push it flat, it does while I'm holding it. But once I let go, it bounces back a bit. But that's also a valid complaint for the Pixel. When you open it up, it also kind of opens to a bow unless you force it flat. But if you've watched JerryRigEverything's video, you got to be really careful with that hinge. It will just break back. Though Samsung has been doing this for four years, it still can't get it perfect. Will Google's first try be perfect? No. Thank you. And that's another kind of complaint I have. And what I've seen a lot of reviewers have is that with this being so new for Google, there aren't really any killer folding features. I think the Play Store really needs a great for fold section that has apps that are already optimized for two panel displays because there just aren't any. Like, believe it or not, a lot of people use Instagram. And again, I know a lot of people brought this up, but this does not look good. Like, why is this in the center? Yeah, you can move to the side, but this should be full screen. And it is on the Samsung Galaxy Fold 4. If it's going to look like this, at least give me the ability to scroll with this empty space or do something more useful. On top of that, if you're not someone who uses these large form factor folding phones like myself, it takes a while to get used to because it's still very thick and was a huge presence in my pocket that took a bit to get used to, especially when I was sitting for so long in an uncomfortable chair already at the symphony. This is actually starting to cause some discomfort being in my pocket for so long. But that could just be me coming from the Zenfone 10 and before that, you know, the smaller flip style phone. So your mileage may vary. Clearly, it's a bit of a mixed bag for me. I love folding phones and I truly believe that they're for the future. And even though I prefer the flip style, I do see a place for these folding phones. And as somebody who does a lot of admin stuff, you know, running this channel takes quite a bit and having a larger screen would be great. At 1800 US dollars, it's a pretty high entry point, though it is the same price as the Fold 4 and probably the Fold 5 when it releases sometime soon. If you are not somebody who knows what they're going to do with this form factor, I don't think it's something that you should just kind of jump into as a, hey, why not? The flip styles are a lot easier to kind of just go, well, why not? Because at the end of the day, when you have it open, it's just your current phone. This one here, you're adding another phone to the back. And with that, you're getting double the screen space. But do you need that? You can't see it all when you're watching videos and some of your games might not work. And the apps you use might just be the regular size anyway. So make sure you do a lot of research and let us know down below. Are you the person that this phone is for? Are you sold on the Pixel Fold? This is only available in America. So if you're outside of the States, is this something that you want to come to your country? For me, it's a pretty hard miss.",
    "transcript_keywords": [
        "screen",
        "kind",
        "pretty",
        "bit",
        "phone",
        "external screen",
        "outer screen",
        "great",
        "camera",
        "Pixel Fold",
        "Fold",
        "screen camera",
        "good",
        "Phones",
        "Pixel Fold screens",
        "internal screen",
        "external",
        "main",
        "video",
        "Pixel"
    ],
    "transcript_entity_values": [
        "1800 US dollars",
        "America",
        "79",
        "an hour",
        "four years",
        "8 megapixel",
        "USB",
        "two years",
        "Google",
        "this year",
        "1450",
        "Alex",
        "JerryRigEverything's",
        "Samsung",
        "OTG",
        "ROG",
        "Canada",
        "a thousand",
        "450",
        "1500",
        "the Play Store",
        "iPad",
        "FPS",
        "Hertz",
        "29",
        "the Pixel Fold",
        "10.9 megapixel",
        "Andy",
        "77%",
        "1840P",
        "last night",
        "5x",
        "283 grams",
        "the Zenfone 10",
        "256",
        "7A",
        "93",
        "first",
        "the Samsung Galaxy Folds",
        "two",
        "Geoff",
        "an hour and 36 minutes",
        "GPU",
        "SD",
        "CPU",
        "States",
        "ASUS",
        "48 megapixel",
        "5.8 inch",
        "65 watt",
        "millimeter",
        "RAM",
        "0.2 inches",
        "one",
        "the Fold 5",
        "iPhone",
        "Pixel Fold",
        "9.5 megapixel",
        "seven inches",
        "North America",
        "these days",
        "Rubik",
        "three feet",
        "120",
        "Android",
        "five years",
        "Elijah",
        "512",
        "the end of the day",
        "12",
        "only one",
        "G2",
        "YouTube",
        "Google Pixel Fold",
        "Five",
        "seven",
        "four and a half hours",
        "100%",
        "three",
        "One",
        "60",
        "14",
        "one half",
        "only 0.5 inches",
        "7.6 inch",
        "Instagram",
        "Mario Kart Wii",
        "Gorilla Glass",
        "20 hours",
        "about a year",
        "iPads",
        "Galaxy Fold 4",
        "USB-C",
        "47",
        "Call of Duty Mobile",
        "5"
    ],
    "transcript_entity_types": [
        "MONEY",
        "GPE",
        "CARDINAL",
        "TIME",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "PERCENT",
        "DATE",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "EVENT",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "LOC",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PERSON",
        "TIME",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}