{
    "id": "kBZ6kW8G8Y8",
    "title": "Unboxing M3 Macs! Space Black M3 Max MacBook Pro and M3 iMac!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-11-06T14:01:34Z",
    "video_url": "https://www.youtube.com/watch?v=kBZ6kW8G8Y8",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 571230,
    "likes": 15461,
    "comments_count": 672,
    "description": "Had so much fun checking out the new M3 Macs! New M3 iMac and Space Black M3 Max MacBook Pro! Scary fast!   #BestBuyPartner #affiliate    PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:      BECOME A CHANNEL MEMBER:",
    "description_links": [
        "https://howl.me/ck8SdEQQNql",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Look what we have in the studio today. The brand new M3 iMac in pink, and the new Space Black M3 Max MacBook Pro, let's unbox. I think we're gonna unbox the MacBook first. Okay, ready? Oh, I'm excited. So this has 48 gigs of RAM, which you can spec it up to 128. This is the M3 Max chip with one terabyte solid state drive, which you can spec up to eight terabytes. This is the 16-inch version, but I ordered the 14-inch, so I'm excited to see the 16-inch Space Black. Oh, here it is. No smell, but that's all right. (upbeat music continues) (paper rustling) This is like a heavier paper. (paper rustling) (packaging rustling) Wow, oh, man, check this out. (gasping) It looks so good. (packaging rustling) It's wild how much bigger this is than the 14-inch since I've been using that for the past year. So here it is compared to the 14-inch Space Gray and honestly, I forgot which color MacBook 14-inch I ordered so I had to look it up just to make sure. Because these two next to each other, this looks silver to me. I never realized how light the Space Gray was now in comparison to the Space Black, this is so much darker. Now, on the new Space Black, they did a new anodization process because the Midnight MacBook errors definitely had some fingerprint issues, whereas this one, so far, I don't know, it looks pretty good. It doesn't feel any different, it feels the same. Here's the new MagSafe cable, which is also in a Space Black color, which I love. Wow, it's wild like it matches almost perfectly. Excited to get this set up, but first we have to unbox the iMac. (screen beeping) (packaging rustling) Here she is, it's so light. Also got some accessories here. Power cable, other power cable, a pink sticker, We've got the color matched keyboard, cable, track pad, and magic mouse. (packaging rustling) Here it is the big unveiling. (packaging rustling) I mean, even though I've already unboxed this once, like it is just so beautiful. Like the attention to detail, just this beautiful reflection. Oh, it's so pretty. (sticker scraping) Shall we peep the accessories now? (packaging rustling) First things first, we have a (gasps) Lightning cable. The accessories are not yet USB-C, which is kind of interesting since we're kind of going for the full move to USB-C. So this still is a braided Lightning cable for all of the accessories that are still Lightning plus Lightning still is really great so I mean, no shame. (packaging rustling) Here's our mouse, matches it beautifully. (packaging rustling) Power adapter, color matched braided cable, I just love that everything matches, it's so, so pretty. Full-size keyboard. (packaging rustling) That's nice, and last, but not least, we've got a track pad. (packaging rustling) This looks so nice in the whites. Look how great everything looks all together, all of the accessories and the iMac, you look great. Now, that we have both computers unboxed, let's go get them all set up and check them out. (upbeat music) So here they are, these are the latest versions of the MacBook Pro and the iMac. Now, obviously, the main change with these Macs is the introduction of the new M3 chips. So no new hardware updates, aside from a slightly new anodized finish on the Space Black MacBook Pro to reduce fingerprints. Now, I think some of us are maybe hoping for some new colors in the iMac lineup or some kind of change, but for me, I'm obviously gonna go with the pink anyway, so whatever. Now, the previous version of the iMac only had the M1 chip, so now with the M3, it's gonna have basically double the speed and performance and it still starts at only 1,299. That's pretty cool and, of course, it still has the awesome 4.5K retina display, Wi-Fi 6E support, built-in webcam, color match peripherals, and everything else that we love about the iMac. This does only come in the M3 configuration, so you aren't able to update it to the Pro or the Max, just the M3, but I'm probably most excited about this new MacBook Pro because I do travel so much and this is my main computer. Now, both the 14-inch and 16-inch models now come with the M3 chip with this entry level 14-inch starting at just 1,599, and with the M3 PRO and the M3 Max, you can now get up to 128 gigs of memory, that is pretty wild and again, I am obsessed with this new Space Black finish, it is so clean. So we're gonna test out both of these. We're gonna start with the iMac, I'm gonna do some gaming, do some editing, and then I'm gonna set up my MacBook Pro at my editing station where I do all of my work. I've got the iMac all set up. Now, the newest macOS is macOS Sonoma and there are some changes. The first thing that you're gonna notice is this new login screen. You'll see down here you've got your login name where you enter your user ID, your password, or just touch ID and it logs you in automatically. Something else that's cool with these new interactive desktops, I went and just got this super basic pink background to match the new MacBook. This is the Hello Metallic Pink. You can download all these different landscapes. So this is the standard one, this is the Sonoma Horizon, which is really pretty, but this doesn't feel like a Mac-ish desktop background, which is why I changed to that Metallic Pink, but there's a few other ones. Here's another background, let's see what it looks like as the screensaver. These are so awesome because they're animated like this is... It's so trippy, like this is a drone shot. I wonder how far it goes? But the animation looks really cool and it ties right into the lock screen. So when you log in, so I'm gonna log in and you'll see that this transitions from the screensaver to your desktop with a very subtle animation. It's super subtle, but I love the attention to detail. There's so many different ones, but for the sake of this video, I'm gonna switch back to this Hello Metallic Pink. Something else new is you can now add widgets to your desktop. Now, a lot of these features I don't usually ever use, but it is kind of cool that you do have the ability to just drag these widgets. Now, right onto the desktop, so I've got the Weather here. I'm gonna add my Calendar. I'm just gonna add everything here, just as an example. There they are. So there we have our widgets right on the desktop and if I wanna click into some News, I can do that or I can click into the Weather and get more weather information. So it's cool when you go into the app, these kind of gray out, but when you click back to the desktop, they automatically are activated again. Another new Sonoma feature is these hand gestures that you can make that will then trigger an effect. So I'm just gonna use Photo Booth, but these will transfer over to Zoom and any other video conferencing software that supports it. So I'm just gonna pop into the Photo Booth to give you a little example of this. Now, the first one is I'm gonna make some hearts here with making the little heart sign. Got a thumbs up, we'll give you a thumbs up and a thumbs down will surprise. We'll give you a thumbs down. Two thumbs down. It's a little storm, it's so great. Peace sign with one hand, we'll get some balloons. Peace sign with two hands, confetti. If we do a rock on symbol, we'll get some lasers. I haven't used Photo Booth like this since like 2006. This is a YouTube video that I posted to my YouTube channel using Photo Booth in 2006. It is absolutely unhinged. (indistinct chattering) (upbeat music continues) (Justine laughs) Oh, my goodness, I think that's probably the last time I used Photo Booth. Now, that we've tested out some very simple things, let's go in and see what it's like to video edit on the new M3 iMac. So I've got all of this 8K footage, we're going to drag it into the Library and here it is. So I'm gonna take all of these and I'm just gonna pop 'em in the timeline. Look at that, look at that, fast. It was like nothing, smooth like butter. Now, none of this has been converted to ProRes, this is right off the Sony cameras. So this is just, it's just running. Look at this. Here we go, here we go. Little edit here. Ooh, yeah, look a little camera move, we'll take that one. That's nice, that's a nice shot right there, we like that. Great, looks good. Let's see if you add a little effect or something on here, let's see what we got. Whoa, moody. I know what this needs, night vision. (laughs) Let's try a little stabilization on this shot here. So there's, wow, that's pretty stable compared to what we had. That's nice too. So obviously, my first initial editing tests, everything is running super smooth, super fast, am I surprised? No, I'm absolutely not at all. Something else new in macOS Sonoma is the new Game Mode. So we're gonna test out playing some games. I've got my Spider-Man PS5 controller connected. So one of the games that they recommend testing was No Man's Sky, so this isn't gonna be my first time playing this, so I'm really excited. So as you can see right here, it says Game Mode has turned on. This prioritizes the performance, so this will make sure that everything is optimized for game playing. It also sounds really great. - [Robot] Life support systems activated. (ambient music) Heal kinetic system online. (ambient music continues) User initialization sequence complete. - All right, here we go. So far, it's running pretty smooth. I mean, I've got zero complaints other than I wish I had more time to play video games. So I really wanna continue playing this, this is actually really fun and I can't believe I have never played this before. So I'm really excited that I can now play this on my Mac, so I will be sure to install this on my MacBook so I'll be able to take it with me on the go. So now, let's move on to the M3 Max MacBook Pro onto my editing station. I have this entire desk all set up just how I like it, so I'm basically gonna be swapping my 14-inch for the 16-inch and I'll show you guys what we've got. So this is my full setup and I'm so excited because my previous Mac, I had completely maxed out the amount of peripherals that I could have hooked up and I just now hooked up an additional two terabyte solid state drive and it worked. So I'm so excited that I can now take this setup up a notch. So I have two Pro display XDRs, one studio display, also hooked up, I have a bunch of storage options. Now, I have a Thunder Bay flex, which I use for all of my backup files, and then hooked up to that, I have a 16-terabyte drive, I have an OWC stack that I use for some additional USB-C ports, I have another two terabyte drive that I was using to transfer some files back and forth, and I also have this OWC Thunderbolt dock, which I have a bunch of things also hooked up to. I've got my Gen-X speakers hooked up to the Apogee Symphony. There is so much stuff plugged into this computer and it's wild because I was running this all off of that tiny little 14-inch, but now, thanks to the new M3 Max, I can hook up more things to it, which is just what I need. You can see I have the MacBook plugged in right here and I not even... It's not even open 'cause I have all of these displays hooked up to it. So let's get into some editing. I already have a library here that I have prepped with some 8K footage direct from the Sony camera and also 8K ProRes. So I made a little ProRes timeline here with nine streams of 8K. So we're gonna play this really quickly, and here it is, it's running. I'm gonna actually switch this to better quality and let's pop this open and you can take a look and see what it looks like. Everything is running perfectly smooth. Now, when I made this timeline, initially, I did pop all of this footage in directly from camera. Now, this timeline is straight from Sony a1, nothing has been converted and at first, it was a little bit laggy, but now, everything is all rendered in and this is also running perfectly smooth in better quality. We have no drop frames, no stuttering. I mean this is so exciting. This current configuration of the M3 Pro Max MacBook Pro that I'm using actually has less RAM than my day-to-day M2 Max MacBook that I've been using for the past year. This one has 48 and my previous version had 64. So even with less RAM, this is running really smoothly. I'm pretty happy with my editing test. Let's move on to some photos, shall we? All right, let's just open up regular Lightroom. (upbeat music continues) So as you can see, it loaded up super quick and it pulled up all of these images that I've already taken, which is very exciting 'cause these are some nice new ones. Let's go in and edit some... This one, from the iPhone 15 shoot in Catalina. So let's up the exposure a little, let's turn down those highlights, let's go... Actually, let's turn that down a little bit. Here we go, here we go. Up the shadows. Give me that saturation, beautiful. Oh, that's great, that's really lovely. Now, let's take this into Photoshop and this should automatically open up Photoshop as you can see here. There we go, there we go, super fast, nice. Okay, I kind of wanna make this a little bit taller here. So let's see if I can get generative AI to fill in the rest of this image for me. Now, the generative AI in Photoshop does go to the Cloud so it doesn't really matter how fast or slow your computer is, it really more depends on your internet speed, and that looks great. Let's maybe... Let's see what we can come up with on the other side. Okay, well it kind of gave me a very interesting watch here. Maybe there's a... Oh, that's nice. There, that's perfect, love it. So I'm pretty happy with how this all turned out, everything's been working really well. Now, let's move on to gaming on the MacBook Pro. Here we go. Now, I know I've already played this before, but I don't remember. I think I had to put the baby to sleep. Okay, we got to go upstairs, put the baby to sleep. Now, the one thing that I've already noticed is this is running super smooth. Now, let's remember this is running off of a MacBook and I have three displays hooked up to it, plus all of these other accessories. (baby crying) - [Dad] Shh, there there. It's like I said to your mom, that book's too scary for you. - Oh, so scary. I don't remember which one is your bed. Oh, no, where's your bedroom? - [Dad] Almost there, honey. - Yeah, this looks like your slob room. Look at all your toys. You're too young to even play with any toys. Like you just eat and stuff. - [Dad] I'll be right downstairs. Daddy won't let those weird fairytale monsters get you. - (laughs) All right wife, where's my mail? - Is she okay? - Sleeping like a baby. (phone ringing) - So I skipped a few... I skipped ahead and we've clearly are now in some sort of a disaster. (laughs) Things have exponentially escalated. (phone ringing) - [Dad] Jesus. - All right, so for my gaming test, everything seems to be running really smoothly, also haven't really experienced any drop frames. So it's no surprise everything is running smooth, everything's running fast. I mean, at this point these computers are getting so good that no matter what you throw at it, it's just gonna work. Now, if you do have an M1 or an M2 computer, I really do feel like it's not necessary to upgrade to an M3, but you really will see the jump in performance if you do have an M1 and more specifically an Intel Mac. If you have an Intel Mac and you even upgrade to an M1, the performance increase is going to just blow your mind. So this is kind of a first look here with the new M3 lineup and I can not wait to further test these out. I personally ordered the 14-inch MacBook Pro with the Pro Max. No, I just keep calling it Pro Max, M3 Max, but like they have like Pro Max like it just, it just, you know, if I say Pro Max, you know what I mean. We're just gonna go with it. If you guys wanna watch some more videos, I'll put them here on the end screen and if you enjoy this video, be sure to like it and leave me some comments below and let me know what you think of this new lineup. What computer do you have? Do you have an Intel? Are you upgrading? Let me know, I would love to hear it and I will see you guys in the next video, bye.",
    "transcript_keywords": [
        "Max MacBook Pro",
        "MacBook Pro",
        "Space Black",
        "Pro Max",
        "Pro",
        "Pro Max MacBook",
        "Black MacBook Pro",
        "Space Black MacBook",
        "Max",
        "Max MacBook",
        "MacBook",
        "Space",
        "Photo Booth",
        "Space Black color",
        "running",
        "Black",
        "pretty",
        "iMac",
        "Space Gray",
        "Space Black finish"
    ],
    "transcript_entity_values": [
        "MacBook",
        "the Photo Booth",
        "Catalina",
        "one",
        "USB-C",
        "K ProRes",
        "M3",
        "the MacBook Pro",
        "macOS",
        "2006",
        "Game Mode",
        "the MacBook Pro",
        "Photoshop",
        "the Sonoma Horizon",
        "M3 Max",
        "iMac",
        "Library",
        "AI",
        "Sonoma",
        "first",
        "Space Gray",
        "Macs",
        "Max",
        "MacBook Pro",
        "Game Mode",
        "15",
        "zero",
        "just 1,599",
        "nine",
        "14-inch",
        "Space Black",
        "Two",
        "Mac",
        "M1",
        "YouTube",
        "an additional two terabyte",
        "the Space Black",
        "Intel Mac",
        "webcam",
        "RAM",
        "Wi-Fi 6E",
        "today",
        "the M3 PRO",
        "First",
        "48",
        "PS5",
        "MacBook",
        "Spider-Man",
        "iMac",
        "Space Black M3",
        "Metallic Pink",
        "48",
        "Photo Booth",
        "Jesus",
        "Justine",
        "Thunder Bay",
        "Sony",
        "OWC",
        "iPhone",
        "three",
        "the Hello Metallic Pink",
        "the Apogee Symphony",
        "4.5",
        "Pro Max",
        "M3 iMac",
        "Midnight",
        "8",
        "OWC Thunderbolt",
        "Weather",
        "M2",
        "16-terabyte",
        "128",
        "Photo Booth",
        "ProRes",
        "16-inch",
        "only 1,299",
        "USB-C.",
        "No Man's Sky",
        "Intel",
        "Lightning plus Lightning",
        "the Space Black MacBook Pro",
        "Calendar",
        "MacBook Pro",
        "Lightroom",
        "M3",
        "the past year",
        "two",
        "MagSafe",
        "Max MacBook",
        "64"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "LOC",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "LOC",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "LOC",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "ORG",
        "FAC",
        "PRODUCT",
        "PRODUCT",
        "FAC",
        "GPE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "FAC",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL"
    ]
}