{
    "id": "Kcs_18JktOA",
    "title": "Apple Admits They Were Wrong (2021 MacBook Pro) - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2021-11-04T15:56:55Z",
    "video_url": "https://www.youtube.com/watch?v=Kcs_18JktOA",
    "category": "Science & Technology",
    "tags": [
        "Apple Admits They Were Wrong (2021 MacBook Pro) - Krazy Ken's Tech Misadventures",
        "2021 MacBook Pro",
        "MacBook Pro",
        "M1 Pro",
        "M1 Max",
        "M1 MacBook Pro",
        "Apple",
        "Mac",
        "macOS",
        "macOS Monterey",
        "macOS 12",
        "Notch",
        "Mac Notch",
        "Menu bar",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer",
        "Tech",
        "Computer Clan",
        "Tutorial",
        "How-to",
        "USB-C",
        "Touch Bar",
        "Butterfly Keyboard"
    ],
    "views": 47056,
    "likes": 2478,
    "comments_count": 369,
    "description": "In a recent interview, an Apple executive more or less admitted Apple was wrong about the previous generation of MacBook Pros, and this is evident with all the reverse changes in the 2021 models. Let's take a look Download our epic wallpapers   Check out our rare tech playlist   Watch our tech scam-busting episodes    Support our channel and get cool stuff   Follow us on Twitter   Like us on Facebook   Subscribe and listen to our podcast     Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://thecomputerclan.com/wallpapers",
        "https://bit.ly/clan3zlKXX9",
        "https://bit.ly/clan3o1EdZ2",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://applekeynotechronicles.transistor.fm",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- So in a recent interview, an Apple executive more or less admitted that Apple was wrong about the previous generation of MacBook Pros. So I think it's time to have a little heart-to-heart with me and you, Apple. You know, even though you're probably never gonna see this. (upbeat techno music) Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken, and on the Computer Clan, I run two awesome shows, \"Krazy Ken's Tech Talk\" and \"Krazy Ken's Tech Misadventures\" Tech Misadventures is my playground to be unscripted and off the cuff, and not read from a script at all. And that's exactly why I'm here today. I just wanna speak from the heart and talk with Apple a little bit. Because the new 2021 MacBook Pro kinda undoes five years of changes Apple was trying to do with the MacBook Pro. And they just stepped back on a bunch of those with this new release. In my opinion, the 2021 MacBook Pro is the best new Mac I've ever used. It is so much fun. For the first two days I had it, I didn't even touch my iMac desktop. I was just so into this thing. I haven't purchased a Mac notebook in eight years, primarily because I don't think Apple's latest round of MacBook Pros were really that great. In 2016, Apple introduced the new MacBook Pro for the time, And they got rid of a lot of useful features, and they made a lot of changes that weren't always that welcome. And for five years, they stuck with most of those things. Fixing a couple of them, but sticking with most of them. But I was waiting, 'cause I knew Apple was working on something cool. Something much better. Let's talk about some of those changes that I didn't personally like, and I think a lot of people didn't like. First off was the Touch Bar. Apple tried getting rid of the function keys in favor of that touch interface. I don't think it really took off so well. I know there's some people who liked it, but generally speaking, I think most people didn't like it. From my point of view, the biggest problem was it wasn't tactile. As a person who uses a lot of keyboard shortcuts and works very fast on their Mac, I like being able to feel where my keys are. And if I have the Touch Bar, that's really hard to do, even for something like changing the volume, it requires me to look down and try to fiddle with an interface, just to change the volume. It's kinda silly. Plus, if you had a malfunction where the Touch Bar would flicker or the display wouldn't work, now, your controls are just gone. So, now it's 10 times more complicated to do simple things like change the volume when it really wasn't necessary. Apple said the function key goes back decades and yes, that's true, but old technology doesn't mean bad technology. I think it's okay to still have function keys on there. And I think Apple eventually agreed because, look at this, they brought the function keys back. Not only did they bring them back, they made them full height. These are the biggest function keys they ever put on a Mac notebook. Another thing they got rid of was the Escape key. A traditional key that's been on keyboards forever. They just got rid of it. And I thought that was kinda silly, 'cause that's a nice thing just to be able to press easily. But if you can't get to it, that's kind of annoying people who like keyboard shortcuts. Now, the Escape key was built into the Touch Bar, so it was a virtual Escape key. But it wasn't always visible depending on the context of the application, because the Touch Bar adjusted depending on your settings and depending on what application you were in. And, again, if the Touch Bar just stopped working, your Escape key would stop working too and you'd be stuck without an Escape key. And that would be terrible. And I think Apple realized that even earlier, because even before these new MacBook Pros came out, they released an updated version of the previous generation of MacBook Pros with a physical Escape key. So I do believe they listened to their customers. They may be trying to do new things, sometimes too much all at once, but I do believe they do listen. Another thing they rolled back earlier before this model came out was the dreaded butterfly keyboard. So many issues with that fricking keyboard, I can't believe it. So, first of all, not only did it feel weird because the travel for the keys was really bad. It was really short. It locked up a lot. There were tons of malfunctions. And they were trying to fix this problem with key stability, which I really don't think was a problem. Again, I think it was Apple trying to fix a problem that really didn't exist. You know, I give them credit for having courage, - Courage. - but I just don't think it was really necessary. So, again, Apple rolled back from that dreaded butterfly key switch to a scissor switch in the later generation MacBook Pros, before they released this one. Because, again, I think they were examining the situation and noticing there's all these problems, and they decided to roll that back. Good job for you there, Apple, but also maybe bad job for releasing the butterfly switches in the first place. Another problem was they removed all the I/O. (chuckles) Pros need I/O. We don't wanna carry around dongles or CONVERSION TECHNOLOGY with us 24/7. When we wanna plug an SD card and we just wanna plug it in. When we wanna plug HDMI, and we just wanna plug it in. We don't wanna have to carry around dongles. Not only is that now another thing we have to remember to bring with us when we're going to a shoot or whatever, but now, it's another thing that could be a failure point. So it's nice just to have the ports built-in. Which is another reason why I stuck with my 2013 MacBook Pro for so long. It had all the I/O that I needed. And in this design, they brought back MagSafe, they brought back the SD card reader, they brought back HDMI, which I think were all really smart moves, especially for pros. And another big problem with those 2016 MacBook Pros, and especially I believe the later ones was the cooling. I mean, Apple just tried making those computers so darn thin, it became a heat problem. Especially when they started shoving more cores in there, those things got so fricking hot. I've used them. They get hot. I don't know if this is a thermal throttling issue, but I've used them where they're like connected to external displays, and they just lag like crazy when they're under stress. And there was tons of reported issues of similar situations with these computers, because well, first of all, those Intel chips run very hot. And secondly, Apple made the computer really thin and really solid, there's hardly any ventilation on those previous generation MacBook Pros, which I don't know exactly what was going through Jony Ive's head or the rest of the design team, but it really seemed like Apple was going for form over function there, which doesn't surprise me. That's kinda been one of their strengths and also weaknesses in their history, is going form over function. A great example I love to bring up is the Apple III. That thing had no fans, but it also had no vents. The goal was to use the whole case as a giant heat sink. Well, it sucked. That thing overheated so much that the solder joints for the chips would literally melt, and the chips would jiggle out of place because the heat was so intense inside that computer. That's kind of how I look at the newer MacBook Pros before this redesign. The thing was so thin with hardly any ventilation. That's all the bad stuff. And those are the reasons why I don't wanna upgrade. But Apple listened. And more or less, they admitted that they were wrong. In a recent interview, Tom Boger said they listened to customers. And as we physically see, there's a lot of undone changes in this new MacBook Pro compared to the last generation. So I think that's them subtly, without them physically saying, that they were wrong. And Apple, I do wanna thank you for that. You sacrificed some of that thinness to make a more useful computer. To make a computer that can run cooler. You made it maybe look a little bit thicker, and you may be sacrificed some of that form, but you've got a lot more function out of it. You put those ports back on it. You stuck with the scissor switch. You got rid of the silly Touch Bar. And on top of that, you're putting your own Silicon in these things now. The Apple Silicon chips compared to the Intel chips, man, they run so much cooler, and the battery life is so much better because the energy efficiency is insane. This thing, I don't even think the fans are running. Like, there's fans in here, but I've never heard them turn on. These things perform really fricking well. And again, these are laptops. They have to consider battery life, and energy efficiency, and cooling. Just wait until we see these chips in much bigger computers with better cooling and when they don't have to worry about battery life. We're gonna see some hella crazy performance. And on top of everything, this display, I mean this display absolutely kicks ass. Not only is it XDR so it can display 1,600 peak nits, not only is it just really cool with the thin bezels and the rounded corners, but it's also 120 Hz. You can see stuff really smoothly at a 120 Hz refresh rate. And for us, you know, geeky video guys, that's really cool for 24 FPS film. Because now, we can look at the 24 FPS film perfectly. Because when you look at 24 FPS film on a 60 Hz display, every so often, a frame has to be skipped, or some algorithm has to fix that, because 24 doesn't divide into 60 evenly, but it divides into 120 evenly. So for someone like me, that makes me really happy. Heck, Apple even included options to lock the refresh rate. So if we're working on particular projects with set frame rates and we need that, we can use 48 Hz, heck, even fractional frame rates, we can use 47.95 Hz. I mean, that's just, as a video guy, that really shows that Apple is caring about those people in that industry, those pros. It shows that they're caring about pros more. And I think they maybe always did, they just didn't always show it too well. But we're really starting to see those signs again. That they are listening, and the MacBook Pro is back. I bought this thing immediately when it was announced, because it checked all of the boxes for what I was looking for in a computer. So again, Apple, I just wanna say thanks. Thanks for admitting subtly that you were wrong and undoing some of those things. And thank you also for bringing new innovations into the computer with Apple Silicon, a ProMotion 120 Hz display, and everything else. Let me know what you guys think about the new MacBook Pro. And if you have any questions about it, feel free to let me know. I know there's people probably wondering about the notch. I'm purposely not talking about that right now, because I actually talked about it and about how it works in a previous episode, so feel free to check that out. And feel free to stick around for more tech episodes coming out all the time. I love doing episodes about rare and retro tech, new tech, and of course, scam tech. And hey, if you liked this episode, you know what to do. Thanks, and I'll see you next time. Catch the crazy and pass it on. (upbeat techno music)",
    "transcript_keywords": [
        "Apple",
        "MacBook Pros",
        "Touch Bar",
        "Pros",
        "Krazy Ken Tech",
        "Escape key",
        "MacBook",
        "Pro",
        "Krazy Ken",
        "touch",
        "generation MacBook Pros",
        "thing",
        "back",
        "key",
        "Bar",
        "Apple Silicon",
        "Escape",
        "Ken Tech Misadventures",
        "things",
        "MacBook Pro kind"
    ],
    "transcript_entity_values": [
        "Jony",
        "47.95 Hz",
        "24/7",
        "Tom Boger",
        "secondly",
        "MacBook Pro",
        "24",
        "two",
        "Apple",
        "eight years",
        "the Computer Clan",
        "the first two days",
        "48 Hz",
        "MacBook Pros",
        "decades",
        "MacBook Pros",
        "CONVERSION TECHNOLOGY",
        "2013",
        "Tech Misadventures",
        "Mac",
        "today",
        "1,600",
        "Krazy Ken",
        "Krazy Ken's",
        "Silicon",
        "Apple Silicon",
        "60 Hz",
        "2021",
        "SD",
        "the MacBook Pro",
        "first",
        "XDR",
        "the Touch Bar",
        "10",
        "MagSafe",
        "MacBook Pro",
        "iMac",
        "five years",
        "2016",
        "MacBook Pro",
        "ProMotion",
        "the Apple III",
        "120",
        "First",
        "Intel",
        "60",
        "120 Hz"
    ],
    "transcript_entity_types": [
        "PERSON",
        "QUANTITY",
        "DATE",
        "PERSON",
        "ORDINAL",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "FAC",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "LOC",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY"
    ]
}