{
    "id": "kdOzeoo0RUI",
    "title": "Why is this Backpack $1,300?",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-05-27T15:31:44Z",
    "video_url": "https://www.youtube.com/watch?v=kdOzeoo0RUI",
    "category": "Science & Technology",
    "tags": [
        "tech",
        "tech backpack",
        "tech backpack review",
        "tech backpack 2017",
        "2017",
        "review",
        "gadgets",
        "cool tech",
        "tech bag",
        "tech bag review",
        "what's in my tech bag",
        "what's in my tech backpack",
        "what's in my gadget bag",
        "what's in my gadget backpack",
        "gadget bag",
        "technology",
        "backpack",
        "laptop bag",
        "what's in my bag",
        "whats in my bag",
        "best tech",
        "apple",
        "unboxing",
        "whats in my tech bag",
        "gadget",
        "travel backpack",
        "gadget backpack 2016",
        "new",
        "laptop",
        "tld",
        "jonathan morrison"
    ],
    "views": 330229,
    "likes": 24321,
    "comments_count": 3778,
    "description": "The Wizpak - a $1,300 Tech bag. lol. -  I turned my Galaxy S8 into a Desk Setup!  Wanna win this stuff?   Read this for some lolz   \"The WizPak is a first-to-market patented Smart Backpack that is a true vision of wearable technology. Being able to take your music on the go while ensuring portable power to all your smart devices is key to todays busy students, young professionals and all individuals with an active lifestyle. The WizPak is a 4-in-1 Smart Bag which allows you to go to the beach, the gym, the boat, dance studio, park or classroom and enjoy your favorite tunes. The quality and concept behind the WizPak is a blend of Apple, Bose and Gucci in nature. The WizPak aspires to be a lifestyle luxury icon among celebrity personalities and the emerging youth of today. Being able to stay connected to friends, family and loved ones is becoming increasingly more important as people become more mobile.  The WizPak is the perfect companion to give people the ability to have the highest quality sound in unconventional environments. Enjoy precision audio for your favorite movies, songs and games. The WizPak is also a great educational tool to help students that are using advanced technologies to engage in their everyday school life. Being able to listen to audio books or having the proper sound set up for your presentations is a breeze with the WizPak. Simple cord connections tailored into the WizPak allow you to easily plug in all the latest smart devices for the power you need when you want it.\"  My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "http://amzn.to/2qZjCcs",
        "https://youtu.be/Ls532hvAYHw?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://gleam.io/AlvEn/the-1300-tech-giveaway",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- You guys, Jonathan here, and I'm not gonna lie, I'm a little nervous right now, because I have no idea where this video is going. Beside me in this weird, luxurious, one of a kind Wizpak knapsack is a 1300 dollar tech backpack, or as they like to call it, \"the first-to-market, patented Smart Backpack, \"that is a true vision of wearable technology.\" honestly, my favorite line off the website has to be this, \"The Wizpack is a four-in-one Smart bag, \"which allows you to go to the beach, the gym, the boat, \"the dance studio, park or classroom \"and enjoy your favorite tunes.\" The frigging boat? And just for full disclosure, this is not a sponsored video. I wish I could say this was sent to me, but unfortunately I paid for this, bought it off Amazon and sadly, I'm outside the return window, so I am stuck with this. (doorbell ringing) I think the bag just doorbelled me. That definitely came from the bag, we don't have a doorbell. (theme music from \"The X-Files\") Continuing on, bringing this out, here is the 1300 dollar backpack, full leather, which you could smell from a mile away and I've gotta admit, I am definitely not one to say I got a grasp on fashion or sense of style, so I'm not gonna hate on this directly. As far as the looks go, I personally don't think it looks that good, but if you guys do, let me know in a Comment down below. Upon first glance, I think what stands out most to me is this is supposed to clearly be a fashion statement. Jumping back to their great website of lines, \"The quality and concept behind the Wizpak \"is a blend of Apple, Bose and Gucci in nature.\" (laughs) Without a doubt though, past the price, past the leather, the biggest thing that stands out about this backpack are the crazy, built-in speakers. Supposedly, they're 40 watts, so we've gotta test those out. So the first problem is I've gotta find the power button. We got some cool, (rubbing base) what are these called? Studs, now you could hurt someone with these. Oh, I'm dumb, it's over here on the side right here, so we're gonna power this guy up. We got a light. (doorbell rings) It did it again! Can you imagine the marketing room meeting right there, when they're deciding what sound we need to turn the backpack on, like, \"Oh, how about a doorbell?\" \"Great idea!\" Aside from that, the Wizpak has now showed up. Let's see if we can connect. I'm a little nervous right now. Three, two, one, Yellow Claw. (upbeat, pop music) OK, I'm not gonna lie, it's kind of a legit speaker, but the thought of someone with this on their back and blasting music that loud in public is insane, like, no one's gonna wanna be your friend, if you're out in public with this guy blasting music out full volume. I was about 75% right now, honestly, maybe we'll go a little higher than that. (upbeat pop music) And I wanted to really not like this, especially for the price. Is it a 1300 dollar speaker? I don't think so, but you can't deny, that's pretty impressive. Apparently there's a sub woofer in here and you can actually hear the difference, once you place it on a table and it's engaging in that sub woofer mode, whereas if you were holding it, you can definitely hear a difference. Strangely enough, there is also an SOS Help button on here, just in case you're in public and someone wants to steal your Wizpak. So if we flip things over here to the side of the backpack, on the back of the strap, that is Volume control. (doorbell ringing) What the-- (doorbell rings) (laughing) That's gonna confuse so many people, man. What if you have a Grandma in the room? (doorbell ringing) (laughing) I've never heard a doorbell in tech, like, aside from ring (laughing). So apparently I was looking in the wrong place. On the flip side, behind the Volume Control and the Doorbell button, there's actually that SOS button. (alarm sounding loudly) Holy! (laughing) Stop! Jesus! That's gonna set off some serious concern, if you're out in public. I guarantee no one's stealing your Wizpak with that one. No! (alarm sounding loudly) (brass band, jazz music) So maybe we found a use case right there. We've got Jaden and Gage laying it down, big thumbs up, big applause to them. You guys killed it, thank you very much. Keep doing what you're doing. Sorry Wiz Khalifa. No part of this video at all is sponsored. The backpack we bought, this was actually a trip down to Best Buy. So during that trip, I wanted to challenge myself to see exactly how much tech I could buy for 1300 bucks and everything here on this table right now actually came out to under 1300 dollars with tax. We got the Honor 6X Smartphone. We got the HP, probably a long PC name, m3-u101dx laptop, which is around 500 bucks. We got the MyCharge Portable Charger, which is around 39 bucks, honestly, you can pick up a much cheaper and bigger one on Amazon, which I will link down below. We got this sweet Solo Velocity Backpack, that holds laptops up to 17 inches. Sony MDR Bluetooth Headphones in this sweet, sweet, sweet TLD blue and last, but not least, what I am most excited for, the Logitech Megaboom, ooh, damn, that's a... sweet entrance and we got blue everywhere. So you've gotta ask yourself, do you want a crazy speaker, that is built in and attached to your backpack, or do you want a comparable bluetooth speaker, that you can take on the go? Let's power this guy on. UE Megaboom. (mellow, pop music) So I'm not gonna lie, based off just initial reactions from this compared to that, it is kinda scary close with this and this is a 250 dollar on sale, sometimes 300 dollars speaker. (mellow, pop music) OK, it does have more volume and more bass, but again, this is 1300 dollars, this is 300 dollars and with the price difference, we get a smartphone, we get a battery bank, we get a pair of headphones and that's probably the smarter move right there, because if you're playing the Wizpak out in public, people are gonna get pissed. This is the way to listen to music out there in public, in privacy and quiet, don't disturb anyone, please. And last, but not least, we got this sweet, sweet, sweet HP laptop. Now again, I really have no need for any of this, so if you guys wanna win either the Wizpak or everything featured in this budget tech bag right here, let me know by dropping a Like down below, make sure you Subscribe, turn on notification, check out the details down below, where you can pick that up.",
    "transcript_keywords": [
        "patented Smart Backpack",
        "Wizpak",
        "backpack",
        "fourinone Smart bag",
        "sweet",
        "Smart Backpack",
        "Jonathan",
        "Smart bag",
        "public",
        "Smart",
        "speaker",
        "patented Smart",
        "fourinone Smart",
        "dollar",
        "dollars",
        "guys",
        "volume",
        "bag",
        "doorbell",
        "kind Wizpak knapsack"
    ],
    "transcript_entity_values": [
        "two",
        "a mile",
        "SOS",
        "Solo Velocity Backpack",
        "HP",
        "around 500 bucks",
        "the Volume Control",
        "Jesus",
        "TLD",
        "Gucci",
        "Yellow Claw",
        "40 watts",
        "around 39 bucks",
        "17 inches",
        "Apple",
        "four",
        "Wizpak",
        "Smart Backpack",
        "1300 dollar",
        "m3",
        "Jaden and Gage",
        "The Wizpack",
        "1300 dollars",
        "Bose",
        "first",
        "Grandma",
        "1300 bucks",
        "one",
        "under 1300 dollars",
        "Amazon",
        "Three",
        "about 75%",
        "300 dollars",
        "Doorbell",
        "Sony MDR Bluetooth Headphones",
        "UE Megaboom",
        "The X-Files",
        "250 dollar",
        "Wiz Khalifa",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "MONEY",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "MONEY",
        "PERSON",
        "PERSON"
    ]
}