{
    "id": "KfJDJgmTrqU",
    "title": "Talking Tesla with MKBHD!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-01-24T19:03:35Z",
    "video_url": "https://www.youtube.com/watch?v=KfJDJgmTrqU",
    "category": "Science & Technology",
    "tags": [
        "mkbhd",
        "marques brownlee",
        "tesla",
        "austin evans",
        "austin",
        "tesla model 3",
        "tesla model s",
        "model 3",
        "model s",
        "q&a",
        "tech",
        "cars"
    ],
    "views": 425592,
    "likes": 17456,
    "comments_count": 964,
    "description": "Nothing like a Q&A at the Tesla Design Studio with MKBHD. Marques and I talk Tesla Roadster and more:  Subscribe to MKBHD!   Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "https://www.youtube.com/watch?v=6joCzIxiUaE",
        "https://www.youtube.com/user/marquesbrownlee",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. Marques bought a Model 3, so now we're going to do a Q and A video because that makes sense. - Let's do it. - [Austin] How long do you think it'll be until smartphones will be able to shoot 8K video? - When we get an 8K sensor in a phone? - It's gonna be a while. - I feel like Sony's gonna throw it in there in like a year or two. It's gonna happen before we actually care. - But I mean, 8K smartphone video, probably not gonna be great at all, for any reason probably just going to be annoying to work with and probably not look much better anyway. - Think of the crispiness, Austin. - [Austin] How many Pixel 2 XL's can you fit in your difference in height? - Let's say it's a five inch tall phone. I'm just ball parking. - OK, do we have more than one? - No. - 'cause I think you probably got one and a half on me, right? - I guess yeah, I'd say two. - Try it, try it, try it. - This goes to here, which is one, that's way taller than me, too. So, it's between one and two. - [Austin] Austin, you've never talked about the Tesla roadster. - Oh yeah. - [Austin] You actually did a whole video on the Roadster. - [Marques] I did. I mean, the hype is super real, but that car's not coming out for another at least two years - two or three. - to 2020. - Yeah. So, if you're the type of person to buy a car without ever seeing it and just seeing it at an event then you'd be really into the Roadster, or-- - Yeah, no one would ever do that. - For real though, the Roadster is interesting. I'm curious, I think the specs that they've announced are crazy. I mean, like actually crazy. - They seem like targets because again, we get Model 3 and we have all the numbers for it. We're kind of expecting a refresh from Model S where the numbers will kind of put themselves somewhere between Model 3 and Roadster, so not insane to me. I'm just excited to actually be able to drive it. - So, when you get yours can I have a ride? - Absolutely, oh that's gonna be a whole video for sure. - I feel like it's gonna be a series. - [Austin] Audi versus Tesla, we need a race. - Audi versus Tesla? - I could beat you in the Model 3, but I'm pretty sure the Model S would win. - Well, which Audi is the question? - [Austin] My RS3. - Oh, well then yeah I hoped you would beat it. - Yeah, but I couldn't beat your ass. Although I think I could beat your ass around like a race track. Not like in a drag race, you definitely would beat me in a straight line. Maybe this is part two of this video. - I think I would take him. - Oh really? - I think I would take him. - You think you could beat me on an actual road course? - Yeah because nothing closes in a straight line on Model S. - You would definitely pull on. - So you would have to have some pretty dope turning, cornering ability to make up for that. - We'll figure something out, we'll figure something out. - Part two, how did you guys both first meet? Do you actually remember that? - I have an event in mind that I think is-- - It's the Galaxy S3 launch. - OK, I was gonna say a Samsung launch in New York City, but that sounds about right. - it was S3. So, Samsung Galaxy S3, Samsung does this thing every year, they bring out influencers, Youtubers to their events where the phone gets announced and we get to play with it and this was the first one I'd ever went to. - Same, same. - And I think that we'd probably coordinated and say I'll be there, I'll be there too, but we finally walk in and down at the corner at the end of the room Austin pops over and goes \"Yo, what's up\". - [Austin] With my giant stupid shirt (laughs). - Yeah, but it's always weird 'cause like people online you feel like you know them already, you feel like you've met them and you've already had conversations, hey what's up, I'm good how are you, but then you actually meet them and it still feels like a continuation of that. - And if you're me, I'm like oh wow you're tall. - Well, I get that a lot, yeah. - Let's get in the car. - Yeah. - It's too hot in the sun. - It's pretty darn hot right now. - [Marques] What's your favorite camera for Youtube? - I would say the A6300, or 6500 especially. I think that it is kind of expensive, but considering that you're getting a great 4K image, you're getting the in-body stabilization, the auto focus is pretty good. - It's complete and good for the price. - Yeah, totally. - So, A6500 I've shot with and it compare well to a7R, if you've ever used one, which I've used a lot also for video. Do you know the way? - Oh, I know the way. (laughs) - [Cameraman] Don't put that in? - But can you do this? - [Pewdiepie] But can you do this? - And did you talk about, you did a best of CES video, but did you have any favorites that really stood out from this year, or just CES in general? - CES in general wasn't actually that great this year. - OK, yeah, I felt jaded saying that, but-- - It's just, there wasn't a lot of exciting stuff. Like I feel like most years there's a couple things like oh wow, I can't believe this, and this year there are some good things, but there's nothing I just like lost my mind, like oh man I can't wait to get this. It was just kind of, it was decent, there was a lot of decent stuff. - I think what happened is companies have realized that their biggest announcements deserve their own event in a sense, so they save those for their own event later in the year, and as a result you don't get those massive new product announcements at CES among all the other hype and noise. Instead you get these sort of I don't wanna call them vaporware, but these sort of fluff pieces-- - Wouldn't wanna throw a word like that around. - I mean, I don't wanna point any fingers, but you see Razer's triple-headed laptop, or you see this rollable TV and you don't really know when it's coming to market. That's the kind of stuff you see at CES. It's just kind of a guess at the future. - It's like concepts. - Yeah. What do you wanna see in the Pixel 3? - Ooooh. A not garbage tone screen would be pretty high up there. - That is definitely something I'd want. As far as things that are wrong with it, 'cause the rest of the question is \"was the screen the only thing that prevented \"it from being the first perfect smartphone?\". There's no-- - there's no such thing. - There, there you go, there's no perfect smartphone, but that was the biggest part of what I would say turned people away from it, otherwise excellent phone. - I would love to see a Pixel 3 standard size, but with the almost bezel-less display 'cause I feel like for me the Pixel 2 is actually a really nice size. - Oh true, yeah. - So, I would love to see a sort of middle ground like that, where it's still a couple hundred dollars cheaper than the XL 'cause I feel like-- - I have a question for you. Are you a fan of these rounded corners every phone has now? - I don't mind them. I think it looks weird on some, like I feel like this because it actually has, it's bezel-less, but it still has a reasonably big bezel I think it looks a little weird. And it looks better on stuff like the S8 or the iPhone. - I'm not a fan. I know every phone has rounded corners now, but I'm still like pretty-- - I think you do rounded corners when you have to do rounded corners, not just as a design statement. - Razer phone is that boxy phone and it's got the boxy corners and I think it works. - You kind of get those 15 extra pixels. - Exactly. - [Austin] What are the Cheerio boxes all about? - What are they all about? - Yeah. - They represent freedom ... - freedom? Oh, tell me more. - The freedom to choose your own breakfast cereal without other people judging you for it. To put it wherever you want in the background of your Youtube videos on your channel, no matter what the subject. That's what Cheerios represents. - I think you're just a giant iOS fanboy, and the Cheerios are just your subtle way of putting it in there - Cheer iOS. What are your guys' funniest tech flubs or disaster stories? Accidental drops, saying the wrong thing in the video, accidentally deleting footage? I mean that's, I think I've done all those things. - We've definitely accidentally deleted video. - I've accidentally drop ... You've deleted an entire video from your channel? - Well, oh no, no, not from the channel, no, but while we were editing. So, the most recent one was I went to go edit a video, I plugged the drive in and it ejected in the middle of loading the project, completely nuked the project. - Yeah. - We've also accidentally left footage on another drive, and like oh wait where was that and it was already wiped and stuff. - Right, OK. - Don't think I've actually, accidentally dropped a phone or anything though. - OK, I'm the opposite of you, I have accidentally dropped a phone. As recent as the OnePlus 5 before my review I had it before embargo. - Oh no. - Dropped it, didn't shatter it or anything, but I had some good chunks out of the corners of it, before I even shot any of my footage, but luckily I had - (laughs) Hey, OnePlus, sorry about your phone. - I had a meeting with them right after that, in between then and the review, so I showed it to them and I was like do you mind if I get another one, and they actually did, so that was pretty cool. - Team Crispy Live 2.0 when? I don't know. You wanna do another one? - I kinda do. I don't know about when, but I-- - It was a lot of work to put the first one together. - I would love to like take all that effort and put it somewhere like New York, or another location. We did that L.A. one, which was awesome. - Yeah. - I think it would be rewarding to it again. - Yeah, it was just a lot of work 'cause essentially, if you guys aren't familiar, Team Crispy Live was a live stage show we did probably like two years or so ago now? - Yeah, at least. - We basically rented out like a whole amphitheater, it was like 500 seats and we proceeded to be not entertaining for two hours and say hello to everyone, so-- - We answered questions, we talked to people. - You premiered a video, right, or no you showed off behind the scenes of a video. - Yeah, we did a behind the scenes, we showed some never before seen stuff. I signed a lot of peoples phones. - Dude, that was so scary. I was like are you sure? I don't wanna ruin your phone. - I defaced a lot of electronics. That was a fun time, yeah. - Alright, Team Crisp Two. Maybe. So with that, I think we have a very successful Q and A. However, we are not done yet, oh no, because, Marques, I think we're about to go and have some fun in a Model 3. - This is a thing that's happening today, tomorrow, the next day, this is the (mumbles) for the week, and we're gonna make a video about it, are you ready for that? Have you subscribed yet? I hope so. Stay tuned. - You heard him.",
    "transcript_keywords": [
        "yeah",
        "video",
        "Model",
        "phone",
        "feel",
        "lot",
        "kind",
        "roadster",
        "CES",
        "pretty",
        "year",
        "beat",
        "Austin",
        "corners",
        "accidentally",
        "stuff",
        "thing",
        "Pixel",
        "good",
        "things"
    ],
    "transcript_entity_values": [
        "Marques",
        "Model 3",
        "Model S. - You",
        "15",
        "Model S",
        "this year",
        "Razer",
        "Galaxy S3",
        "three",
        "iPhone",
        "Youtube",
        "Audi",
        "New York",
        "Cheerio",
        "first",
        "the next day",
        "the week",
        "Samsung",
        "Two",
        "Austin",
        "two years or so ago",
        "two",
        "2020",
        "Roadster",
        "Team Crispy Live",
        "XL",
        "Tesla",
        "Cheerios",
        "more than one",
        "Pixel 2 XL's",
        "4",
        "Sony",
        "S8",
        "8",
        "S3",
        "CES",
        "today, tomorrow",
        "between one and",
        "two hours",
        "year",
        "OnePlus",
        "500",
        "Cheerios",
        "a couple hundred dollars",
        "five inch",
        "New York City",
        "Yo",
        "Samsung Galaxy S3",
        "Model 3 and Roadster",
        "OnePlus 5",
        "L.A.",
        "Youtube",
        "3",
        "6500"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "LOC",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "TIME",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "GPE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "GPE",
        "PERSON",
        "CARDINAL",
        "CARDINAL"
    ]
}