{
    "id": "KJ_otmElnbM",
    "title": "Tesla’s Investor Day was kind of a dud",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-03-01T22:35:08Z",
    "video_url": "https://www.youtube.com/watch?v=KJ_otmElnbM",
    "category": "Science & Technology",
    "tags": [
        "tesla",
        "elon musk",
        "tesla investor day",
        "tesla investor day announcements",
        "tesla gen 3",
        "gen 3",
        "tesla master plan",
        "robotaxi",
        "model S",
        "model X",
        "model 3",
        "model Y",
        "cybertruck",
        "tesla cybertruck",
        "tesla ir",
        "tesla investor day stream",
        "tesla stock",
        "tesla day",
        "AI",
        "artificial intelligence",
        "tesla robot",
        "tesla optimus",
        "tesla bot",
        "ev",
        "electric vehicles",
        "electric vehicle",
        "autonomous vehicles",
        "self-driving car",
        "supercut",
        "tesla gigafactory",
        "the verge",
        "verge",
        "verge reviews",
        "tech",
        "tech news"
    ],
    "views": 150593,
    "likes": 2368,
    "comments_count": 326,
    "description": "At Teslas Investor day, Elon Musks company pulled the curtain back on its latest Master Plan 3.0, as well as details about its plans to grow to extreme size. #Tesla #ElonMusk #Technology   Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Subscribe to The Vergecast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "http://bit.ly/3KNwQlV",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "https://bit.ly/3I6nJtz",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- All right, master plan part three. There is a clear path to a fully sustainable earth with abundance. In fact, you could support a civilization much bigger than earth, than, much more than the 8 billion humans. So we're gonna walk through the calculations for how to create a sustainable energy civilization. The thing that is needed is, at very large scale, that is not currently present, is a vast amount of battery energy storage. Our rough calculations are that this is about 240TWh or 240,000GWh. That's a combination of electric vehicles and stationary storage. So we're assuming sort of an eight to one ratio of stored energy to power. - And this is across mining, refining, you know, battery factories, recycling vehicle factories. All the things that we're gonna talk about needing to invest in, to build this sustainable energy economy. - In terms of wind and solar, how much land would be used? It's less than 0.2% of the land area of earth. Anyway, the point is that with a pretty, really, a remarkably small amount of Earth's land area, we can go fully sustainable. - So this is the plan, and now we'll get into a little more of the details of the plan. Basically five areas of work. First, renewably power the existing grid. Second, switch to electric vehicles. Third, switch homes, businesses, and industry heating to heat pumps. Fourth, high temp heat delivery and storage for high temp industrial and chemical processes. And a little bit of green hydrogen in there for chemical processes that need hydrogen. And, finally, sustainably fuel planes and boats. So when we stack up all of these efforts, we end up with the numbers we shared at the beginning of the presentation. 30TW, 240TWh, $10 trillion. And you may be saying like, I need some context. Is this feasible? Spoiler alert, (crowd laughs) it's entirely feasible. (laughs) Just looking at it from a growth rate perspective, how much do we need to grow the deployment of these technologies? We're talking about only a 3x growth rate in solar and wind deployment. When we look at the electric vehicles, they have to grow 11x. Well, they grew 60% year-on-year last year. And lastly, storage. You know, Tesla's energy storage business has grown at 65% CAGR since 2016. The global, you know, energy storage business is accelerating pace as well. I mean, all these gaps are gonna close, especially as this momentum of the transition to sustainable energy accelerates. And what about on the mineral extraction side? So this is a cartoon that sort of gives you a sense for all the ore and the, like, extracted minerals that are coming out of the earth every year. It's about 68 gigatons. So each truck is a gigaton. What does this look like when we're in a sustainable energy economy? Looks like that. The resources are there to support the transition. You know, this is cumulative demand to move in a sustainable energy economy direction until 2050, relative to USGS resources today. What people think happens is, \"Oh, there's this many resources? Next year there's gonna be less 'cause we're gonna extract them.\" What actually happens is, as we extract resources, we find more, and you can see, on the right, what has actually occurred with the key materials to the sustainable energy economy. Since 2000, as the sustainable energy economy has been growing, and Tesla's been growing, and all the industries around us have been growing, the actual resource availability has increased, not decreased. - Earth can and will move to a sustainable energy economy and will do so in your lifetime. Yeah, and I mean, my personal opinion is that, as we improve the energy density of batteries, you'll see all transportation go fully electric with the exception of rockets. They're just awkward.",
    "transcript_keywords": [
        "sustainable energy economy",
        "sustainable energy",
        "energy",
        "master plan part",
        "energy economy",
        "sustainable",
        "earth",
        "energy storage",
        "storage",
        "economy",
        "sustainable energy civilization",
        "energy storage business",
        "master plan",
        "electric vehicles",
        "Tesla energy storage",
        "fully sustainable",
        "plan part",
        "electric",
        "resources",
        "fully sustainable earth"
    ],
    "transcript_entity_values": [
        "an eight to one",
        "Fourth",
        "Second",
        "2050",
        "240,000GWh",
        "11x",
        "Earth",
        "three",
        "60%",
        "today",
        "Tesla",
        "2000",
        "$10 trillion",
        "Third",
        "2016",
        "less than 0.2%",
        "USGS",
        "about 68 gigatons",
        "Next year",
        "five",
        "8 billion",
        "3x",
        "30TW",
        "65%",
        "First"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "ORDINAL",
        "DATE",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORDINAL"
    ]
}