{
    "id": "KK7n1HZf2Pk",
    "title": "Laser Keyboards! Why Did This Company Die? - Krazy Ken’s Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2022-11-29T16:59:16Z",
    "video_url": "https://www.youtube.com/watch?v=KK7n1HZf2Pk",
    "category": "Science & Technology",
    "tags": [
        "Laser Keyboards! Why Did This Company Die? - Krazy Ken’s Tech Talk",
        "Magic Cube",
        "Laser Projection Keyboard",
        "iPad",
        "iPhone",
        "iOS",
        "iPadOS",
        "MacBook Pro",
        "Mac",
        "Apple",
        "macOS",
        "Bluetooth",
        "Microsoft",
        "Canesta",
        "Pico Projector",
        "Microsoft Surface",
        "Windows",
        "Technology Adoption Curve",
        "Sales",
        "Marketing",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer",
        "Phone",
        "Tablet",
        "Tech",
        "Computer Clan",
        "Celluon"
    ],
    "views": 481329,
    "likes": 12399,
    "comments_count": 1495,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below Watch the Modbook mystery episode next   Krazy Ken tries a laser projection keyboard named Magic Cube, and he made some discoveries about why the company has been silent for 5 years.  Watch more tech fails!   Patreon!    Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Special thanks to David for helping me film some b-roll!   Additional Sound Effects / Music: \"Who Wants to Be a Millionaire?\" Distributed by Sony Pictures Television \"The Lazer Collection\" by Dominic Fear  Download Computer Clan wallpapers    Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "https://youtu.be/mh1LC0M2zLc",
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1rjrzxzjt_6iGeYS0jiBBZfq",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://youtube.com/c/david4sberg",
        "https://thecomputerclan.com/wallpapers",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Whoa, these laser keyboards are really cool. But I see some big problems with these things, and that's probably why the company died and you never see these in public. So let's talk about this. Sponsored by Linode. (upbeat music) Hey, everyone, how are you all doing? If you're new here, welcome. My name is Krazy Ken. And back in the magical land of 2011, the hype was semi-brewing about this futuristic-looking revolutionary product named Magic Cube. This thing looks cool in the demos, but let's be honest, most things do. I just didn't think it would be good in practice. Maybe it was positioned to be a revolutionary product and it just didn't get a fair shot back in the day. Before we dive into that stuff, I think it's important that we learn a little bit of history about the company behind Magic Cube, Celluon. Celluon was founded in 2004 in South Korea, and they worked with the company Canesta to develop a laser projection keyboard. Two years earlier, Canesta demoed their laser projection keyboard and eventually, they formed a business partnership with the folks at Celluon. Canesta still exists today. And guess who owns them? (dramatic music) Did you say Apple? Then, you're wrong. It's Microsoft. Anyway, this partnership gave birth to the CL800BT in 2005, a laser projection keyboard with Bluetooth connectivity and it was compatible with Windows Mobile 2003, Palm OS 5, and Windows XP. I am a little concerned about the woman on the cover of the manual. I don't think she knows where to point the laser. Well, thankfully it won't hurt her eyes, right? Right? Right? Fast forward to June 28th, 2011. Celluon posted a video on their YouTube channel about their latest product, Magic Cube. If I recall correctly, I first heard about this product from that YouTube video, but I don't remember this thing getting much press attention, at least in the United States. I went back and checked archives, and I could barely find anybody talking about this thing. And later that year, Magic Cube went on sale for $170. So how does this thing work? Three letters, EPT. EPT, or Electronic Perception Technology, is a patented technology by Celluon, which makes Magic Cube possible. On top of the Cube is a pattern projector which projects the image of the keyboard as a series of dots. At the bottom is an infrared light source, which projects a layer invisible to the naked eye. And in the middle is an optical sensor, which reads the infrared light to recognize keystrokes. And all the data is transmitted via Bluetooth to your device. So now we know how Magic Cube works, but the better question is how well does it work? (Krazy Ken speaking gibberish) Oh, sorry, I was reading directly off my notes. I wrote that sentence while looking at the laser keyboard and trying to type with as normal of a typing posture as I could. And that's the result. Pretty great, hey? Let's go a little deeper. To match the time period, I'm using a 1st-gen iPad running iOS 5, and I placed it on a plastic stand. Celluon recommends starting with a hunt and peck approach when learning how to use the keyboard. And I find this to be true because after many fails with normal posture, I switched to hunt and peck and it was much more accurate. I typed, \"The duck swims on the lake\" successfully in one try, but I think that was a bit of luck because I found the success hard to keep up. It also took me a while to find the period, because instinctively, I reached to the bottom row, but it's on the top row on this product. Thankfully, the keys are accurate, at least at a slow pace. So from a technical perspective, it actually works a little bit better than I thought. But getting used to no tactile feeling is quite a challenge. The Magic Cube makes a little clicking noise when you type, so you get a little bit of audible feedback at least, but there's a big problem. There is no visual feedback with your keystrokes. If you look at a physical keyboard and type, you'll see the keys move when you press them. On a touch screen, even though there's no physical tactile feedback, you at least see the keys dim, so you know what you press. But on Magic Cube, there is no visual feedback. No visual feedback combined with no tactile feeling, makes the learning curve for this product really steep. But let's keep testing. I tried writing a short email, and it took me almost a minute with Magic Cube. With the iPad's on-screen keyboard, it took about 20 seconds. The Auto-Correct feature helped me type a lot faster. But in iOS 5 on the iPad, that's not supported with external keyboards. But that's an Apple limitation, not Magic Cube. Jumping to the present, I tried it with an iPhone 14 Pro on iOS 16. It still took me three tries to type a sentence with hunt and peck. I tried typing with a more normal posture again, and thanks to the Auto-Correct, I actually was able to type pretty fast and accurate. But man, it was really hard to keep up that momentum. I felt like the more I typed, the more mistakes I made. And another thing I noticed, my eyes hurt a little bit when I look at this keyboard,. It's not really bad, but it's still annoying and I'm afraid it would hurt more if I do a lot of typing. So that strain prevents me from using this product for extended periods of time. So you're already seeing the problems pile up, but I think the bigger issues are still yet to come. But before I get into those, I wanted to talk about one more feature that I actually think is kinda cool. Magic Cube has a mouse mode. If you press the function key and the mouse key, the keyboard turns into a giant trackpad. So I paired it with my iPad Air 4. And sure enough, the mouse cursor worked, even with two finger scrolling. The movement is a bit choppy and laggy, and sometimes I need to tap twice to trigger a click. I actually had more fun using Magic Cube as a trackpad compared to a keyboard, and I found it way easier too. But again, I'm just one guy and sometimes I can be a little incompetent. Whoa, (beep). Whoa. Perfect, oh, (beep). Oh, (beep) (hammer clanging) (beep) Maybe other people liked it. Different strokes for different folks, right? But when searching the internet, I can barely find anyone talking about this. Heck, I ran a YouTube poll with my tech-centric audience and only 4% of the voters know about this product. And when was the last time you went to a coffee shop or some other public place and you saw someone using one of these? I can't find any hard data, but it appears the sales were extremely low. So what happened? You like to beep, don't you? That leads us to the three big problems, which I believe forced Magic Cube's failure. Number one, it was marketed poorly. I'll give them credit. They did a good job at getting viewers' attention. I mean, hey, who doesn't like lasers? They look like they're from the future. They have a sci-fi feel to them. So the product itself serves as a good pattern interrupt in advertising. But from my perspective, that's the only thing they did right. If you dig through Celluon's marketing materials, you don't see anything that would convince you to spend $170 on this thing. They don't tell a good story. So they're not connecting with the consumers on an emotional level. They don't show any lifestyle photos or videos of people using this in a real setting. And they don't have any significant endorsements or social proof from bigger names. And they didn't have a significant advertising campaign either. I don't recall ever seeing a web ad for this, and I don't recall ever seeing it on TV. And judging by the polls I ran, I bet none of you guys have either. Problem two, it's not intuitive. Steve Jobs said, \"You only use what you understand.\" When I switch to a different keyboard, I want all of those years of typing habits that I learned to very easily transition over to the product. If it takes too much time to learn it, I'm not gonna wanna do it. And that leads us to problem three, the biggest problem of them all. This product doesn't solve anything. As an inventor, it is a necessity that your product fills a need. Remember what Socrates said, \"See a need, fill a need.\" Just kidding, that was Bigweld from the movie \"Robots.\" But you get the idea. Taking the fancy lasers out of the equation, boiled down, this is just a keyboard like many other products out there. So as a buyer you have to ask yourself, \"What problems does this keyboard fix that other keyboards don't fix?\" And from the business perspective, you need to communicate very clearly to your buyer what problems your product fixes. But in my opinion, they didn't have to put effort into that message to the consumers because there was no problem to fix in the first place. What's the use case for a mobile keyboard in general? Well, they're easy to travel with. So you can use them in coffee shops, cafes, you know, classrooms, libraries, that sort of thing. You might use them with a phone, but it's more likely that you're gonna use them with a tablet. So what does Magic Cube do that a regular wireless keyboard can't? The only thing I can think of is it's more compact, but I don't think that changes anything. If you're traveling with a tablet, you're already gonna have a bag to put the tablet in. So adding a keyboard on top of that's not gonna take up much more space practically. Yeah, I guess you could put this in your pocket, but you might have a little bit of a bulge poking out around your thigh. I mean, hey, if you wanna do that, no judgment here. So can this thing compete with other hardware and software keyboard solutions? They market this product with laptops and phones and tablets. So let's break down those scenarios. With a phone, you typically don't need a physical keyboard because, A, it would cumbersome to carry with you as you have your phone in your pocket usually. And, B, you can type relatively fast with your thumbs. Even back in the day, good touch screens and features like auto correct and swipe made this possible. So you don't typically need an external keyboard for phone use. With tablets, the onscreen keyboards are usually very usable, especially today with bigger screen tablet options. But there's also a wide range of physical keyboards that work with tablets. Apple introduced a Keyboard Dock with the first iPad in 2010. And in 2012, Microsoft introduced the Type Cover and Touch Cover, combining a cover and keyboard into one accessory. And in 2015, Apple started selling similar keyboard accessories for their iPads. Plus both the Microsoft Surface and iPad will work with Bluetooth keyboards in general. And I think we can skip the laptop part 'cause if you're on the go, why would you want another keyboard with your laptop? Your laptop has a built-in keyboard. What's the point? And not to mention, you can't use a laser keyboard on your lap. With Magic Cube, you're bound to a table or a desk. With laptops and tablets, that's not an issue. Again, it's slightly more compact, but at a price. There's many more intuitive alternatives out there. And in many cases, those alternatives are cheaper than $170. And I'm open to debating this, but I don't think there's a practical use case for laser keyboards of any brand. And maybe Celluon recognized that too. In 2013, they updated Magic Cube to a new product called Epic. It featured a lower $130 price, a pocket-size design and multitouch gesture support, and allegedly better optics for more accuracy. I tried it and it was maybe a little better, but I think it was too little too late. Epic aside, Celluon has not released a new keyboard product in nine years, and it appears their focus has shifted to Pico projectors. But I'm not seeing life from this company. Their last Twitter and Facebook posts were five years ago, and their website copyright date still says 2016. Oh, interesting new logo. (dramatic music) I tried to contact the company to get more information about their history and sales numbers, but unfortunately, both of their phone numbers have been disconnected and their email has also been shut down. These types of product failures are common. You just don't hear about most of them because they never get a chance to break into the mainstream market. And in the tech world, there's this thing called the chasm and it can be a death sentence for a product and maybe a business. And I believe Celluon fell into the chasm. This bell-shaped curve is the Technology Adoption Curve. It visualizes when certain customer groups adopt a new product. The first 2.5% are the innovators, followed by early adopters at 13.5. Then the early majority in the mainstream market at 34%. Then the late majority also at 34%. Then you have the last group of adopters at 16%, the laggards. If you're watching me, chances are you're a tech enthusiast. So at one time in your life, you've purchased a hot and fresh tech product right off the assembly line. So you would fall on the left side of the curve. Regular end users will fall in that middle big hump because they don't care as much about early adoption and they want to see the product prove its worth in the market before they buy it. And in my situation with Magic Cube, I was skeptical about its practical use. So I landed way on the right side, buying it 11 years after it came out. Now, here's the dangerous part of the curve. The chasm lies between the early adopters and early majority groups. At this point, you've already built up a foundation of believers and ambassadors for the product. However, if your product cannot fulfill the needs of the early majority, it will lose momentum and fall into the chasm and it may not survive because now the product misses out on the huge growth opportunity it could gain from the early majority. And if it can't survive, there's nothing for the business to sell and it will struggle financially. It's a shame to see this company fizzle out because the product really did look cool. But in the end, necessity is the mother of invention. No necessity, no invention. But a big necessity is compute power and storage space. And if you have an application or website that you need to scale and deploy, Linode has the infrastructure and the 24/7 support you need. Linode offers out-of-box apps for game servers like TF2, CS:GO, and even Minecraft. You can run your own virtual private network with OpenVPN, build an online application with Joomla's content management system, or build a video streaming site with a multitude of app choices. There's so much you can do with Linode's affordable Linux virtual machines. And to boot, they offer award-winning 24/7 technical support. To put it simply, if it runs on Linux, it runs on Linode. Visit linode.com/computerclan and click one of the signup buttons and we'll give you a 60-day $100 credit just for watching this episode. And when you do that, you're also supporting the Computer Clan. So thank you very much. So let me know what you think of this product and try one out if you can. They're pretty cheap on eBay. And hey, if you're gonna start a business and create some cool new invention, just remember to have a need to fill. Hey, maybe I'll buy it one day. Catch the crazy and pass it on. Pew. (bright upbeat music) Imma firin' my lazah! (laser exploding)",
    "transcript_keywords": [
        "Magic Cube",
        "Cube",
        "keyboard",
        "Magic",
        "product",
        "Magic Cube works",
        "makes Magic Cube",
        "Magic Cube makes",
        "Celluon",
        "laser projection keyboard",
        "Magic Cube failure",
        "named Magic Cube",
        "forced Magic Cube",
        "updated Magic Cube",
        "thing",
        "keyboards",
        "laser",
        "type",
        "laser keyboards",
        "projection keyboard"
    ],
    "transcript_entity_values": [
        "one day",
        "2015",
        "the Auto-Correct",
        "Windows XP",
        "two",
        "iOS 5",
        "one",
        "iOS 5",
        "Windows Mobile 2003",
        "Twitter",
        "Palm OS 5",
        "only 4%",
        "Socrates",
        "2004",
        "2.5%",
        "Facebook",
        "Magic Cube",
        "Three",
        "iPads",
        "Apple",
        "Linux",
        "100",
        "Electronic Perception Technology",
        "60-day",
        "2013",
        "the Technology Adoption Curve",
        "Canesta",
        "16%",
        "Joomla",
        "first",
        "Epic",
        "The Magic Cube",
        "Microsoft",
        "13.5",
        "cheaper than $170",
        "Linux",
        "Linode",
        "Bigweld",
        "three",
        "Touch Cover",
        "Magic Cube's",
        "the Microsoft Surface",
        "34%",
        "nine years",
        "24/7",
        "Celluon",
        "TF2",
        "iPad",
        "today",
        "YouTube",
        "Krazy Ken",
        "EPT",
        "those years",
        "later that year",
        "South Korea",
        "Steve Jobs",
        "2016",
        "the United States",
        "iPhone",
        "Cube",
        "five years ago",
        "Minecraft",
        "2011",
        "the Computer Clan",
        "2010",
        "iPad Air 4",
        "Two years earlier",
        "Magic Cube",
        "130",
        "2005",
        "eBay",
        "1st",
        "lazah",
        "about one",
        "June 28th, 2011",
        "about 20 seconds",
        "almost a minute",
        "11 years",
        "Canesta",
        "Celluon",
        "170",
        "Pico",
        "signup",
        "Linode",
        "2012",
        "the day"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "PERSON",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "GPE",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "PERSON",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "MONEY",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "TIME",
        "TIME",
        "DATE",
        "ORG",
        "PERSON",
        "MONEY",
        "NORP",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE"
    ]
}