{
    "id": "KKlO3Bof7uw",
    "title": "Dream Desk - Retro Apple Setup",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2016-06-05T14:00:14Z",
    "video_url": "https://www.youtube.com/watch?v=KKlO3Bof7uw",
    "category": "Science & Technology",
    "tags": [
        "Dream Desk",
        "The Dream Desk",
        "Dream Desk 3",
        "The Dream Desk 3",
        "The Dream Desk Episode 3",
        "Episode 3",
        "Retro iMac",
        "Colorware Retro iMac",
        "Desk Setup 2016",
        "Desk Setup Tour",
        "Desk Setup Tour 2016",
        "Desk Setup Ideas",
        "Setup tour 2016",
        "Setup Tour Project",
        "Setup Tour MKBHD",
        "Setup Tour Tech",
        "Best Desk Setup",
        "Best Desk Setup 2016",
        "Ultimate Desk Tour",
        "Ultimate Desk Setup",
        "Ultimate Desk Tour 2016",
        "Ultimate Desk Setup 2016",
        "Best Mac Setup",
        "Best Mac Setup 2016",
        "iMac Desk",
        "iMac Setup"
    ],
    "views": 1779318,
    "likes": 78570,
    "comments_count": 3686,
    "description": "Retro MacBook Giveaway Winner!  Newest Dream Desk!  The Dream Desk 2 - MKBHD Edition:   Colorware Retro iMac:  Retro MacBook (Limited Run of 10):   Dream Desk 3: Game of Thrones Edition:   The Desk:  Avantone Speakers (Painted using PMS 9143 w/ a matte finish):  TEAC Bluetooth Amp:  USB-C Hub:  Satechi Monitor Stand:   Cables & Adapters:   Speaker Wire:  USB-C Adapter:  USB 3 Adapter Kit:  Anker USB 3.0 Hub:  USB 3 Extension:  Cable Clips:   Add me on Snapchat!  New Food Project:  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://twitter.com/tldtoday/status/744954575149404160",
        "https://youtu.be/_nAL4NB58lA?list=PLqcaiHQwxA9iQ29GmJDV-spxGwp3b7BDt",
        "https://youtu.be/53M4b-OCoHM",
        "http://www.colorware.com/p-628-colorware-imac-retro.aspx",
        "http://www.colorware.com/p-644-colorware-macbook-retro.aspx",
        "https://youtu.be/io0SKNYrAbg",
        "http://amzn.to/1Pw9CiX",
        "http://amzn.to/25H1XWv",
        "http://amzn.to/1PwalAL",
        "http://amzn.to/1t9HwjK",
        "http://amzn.to/25H1QtP",
        "http://amzn.to/1PwatzY",
        "http://amzn.to/24qnXiq",
        "http://amzn.to/1U6rmkS",
        "http://amzn.to/1U6s1CY",
        "http://amzn.to/25H2ckd",
        "http://amzn.to/24qnSeG",
        "https://www.snapchat.com/add/tldtoday",
        "http://www.instagram.com/nomcityofficial",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- [Voiceover] He guys Jonathan here, and welcome to Dream Desk 3. Where old meets new and the evolution of the set up tour continues to grow and define what makes a desk unique. It's something you couldn't go buy off the shelf at a store, but rather, taking it a step further and making something that is truly one of a kind. (percussive music) Without question the centerpiece of this set up is a limited edition retro iMac from Colorware which visually is pure eye candy. The idea of those classic Macintosh colors fused with something as modern as a 5K display is awesome because they are two polar opposite ends of the spectrum that somehow completely compliment one another. As crazy as Dream Desk 2 was, this was is particularly close to my heart because the desk itself at its core, is relatively simple. It has this killer rustic reclaimed wood look that really compliments the beige finish of the iMac, but for me, it's more so what we're able to transform the desk into. First and foremost, the speakers are part of the desk. I wanted them to appear as if they were floating: no power cables, no wires, which in this case was tricky. They're passive, which meant: A). they needed an amp to drive them and, B). wires to connect them. So what we did was drill a hole into the desk which in turn would eventually allow us to run the wires through and then from there we mounted steel pipes onto the desk, and with the help of a couple of adapters, those became the speaker stands. Finally, from there, we drilled into the pipes and that's really what allowed us to have complete control over cable management. Initially though, the speakers were not the same color. It kind of became a distraction from the setup, so what we did was the matching Pantone color and then use a texture matte finish to match the retro look. We actually messed up a speaker in the process which resulted in buying a second pair, but I'm extremely happy we went that route because it really took the aesthetic to the next level. Jumping back to the amp that powers the speakers, I also wanted this to appear like it was floating. Normally, this is something that would sit on top of your desk but what we did instead is take spacing blocks and then using mounting adhesive to attach the amp to the bottom of the desk. What's rad about this amp though, is that you can connect via Bluetooth and that allowed for one less cable and a wireless set up between the iMac. On top of that, this also gives you a really convenient spot to plug in headphones. Now continuing with the mindset of keeping cables to a minimum and appearing as if they weren't there, we then drilled a hole behind the computer which allowed for a couple things. We took a right-angled USB adapter, painted that beige and then ran both that, and the iMac power cable through the desk. Now what this allowed for is something you may not have even noticed on the desk. So right there discretely in front of the desk is a USB hub which gives access to USB 3, MICRO SD USB C and effectively minimizes the need to ever reach behind the iMac. From there, this is what makes this entire setup special. If you're thinking to yourself that looks just like an Apple 2 floppy drive from 1978, you sir, are correct, but what we did was take a non-functioning one, and not only restored it, but also removed the control board to make space for a one terabyte SSD. Now just like the top of the desk, we also drilled into the shelf which allowed us to run the cable underneath the desk, and then from there connected it to a USB hub which gave off the appearance that it was wireless, but in reality it's actually connected by USB 3 and ready to use with the iMac. So the idea of taking a piece of technology that is nearly 40 years old, and then transforming it into something you could edit a 4K video off of, really exemplifies the meaning behind this set up. And as awesome as this set up came out, I think we're ready for a plot twist. A couple weeks back, you may have seen a tweet from me that I was looking for a fan to help us with a video shoot and that was for this, so meet Blake, who is 22 feet tall and has no idea why he's here, other than he thinks he's helping us out with a video. So I walk him in and unveil Dream Desk 3, giving him the tour, playing it up like he's really just there to see Dream Desk 3 before everyone else, hyping up the floating speakers, the retro iMac, the cable management. And as stoked as Blake was just to check it out early, he had no idea what was coming next. The computer, the speakers, everything here is going home with you. - No way. - [Jonathan] Yes way, sir. - That's so sick. - [Jonathan] I mean, I was like, I'll be honest, when we put this together, I was kind of like, I want to keep it, but. - Honestly, as awesome as this is, you paid for it man. You can keep it but if you really want it, oh, man. - [Jonathan] No, no it's yours brother, it's yours. - Wow, that's sick. That means so much. - [Jonathan] I think this was probably my favorite Dream Desk to put together, because, you know, we've done flashier ones, but it was the thought that went into this, and the intricacy of the cable management, so I wanted to, you know, it would be cool to send it with somebody. - [Blake] Yeah, I'm going to be stomping all my roommates. (laughs) - [Voiceover] Now as amazing as it was to give back to a fan in real life, I still wanted to take care of you guys, so I bought a Macbook and asked Colorware if they could bring the same retro look to that. They did, and it looks amazing, and one of you guys has a chance to win this, this is one of 10, so it's super limited, and honestly if you guys like the idea of wining this retro Macbook, let's get this video to 100,000 likes, and I will buy a second one to give away. So go ahead and subscribe if you want to win, details on how to enter are down below, and I will catch you guys later. (inspiring instrumental music) - I don't know, I'm just really thankful for it, like, I really appreciate what you guys did, and contacting me and like, I don't know, I can still hardly believe it, it's so sick. (piano instrumental music)",
    "transcript_keywords": [
        "Desk",
        "Dream Desk",
        "guys Jonathan",
        "USB",
        "Dream",
        "iMac",
        "cable",
        "Jonathan",
        "unveil Dream Desk",
        "favorite Dream Desk",
        "speakers",
        "guys",
        "set",
        "cable management",
        "allowed",
        "idea",
        "retro",
        "USB hub",
        "retro iMac",
        "amp"
    ],
    "transcript_entity_values": [
        "5",
        "two",
        "A couple weeks",
        "Colorware",
        "Pantone",
        "Dream Desk 3",
        "USB 3",
        "10",
        "Dream Desk 2",
        "4",
        "USB",
        "USB 3",
        "1978",
        "iMac",
        "MICRO SD USB C",
        "Apple 2",
        "iMac",
        "second",
        "First",
        "one",
        "Blake",
        "Macbook",
        "100,000",
        "nearly 40 years old",
        "22 feet",
        "Macintosh",
        "Jonathan",
        "Dream Desk"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PERSON"
    ]
}