{
    "id": "kNTLYY-8wUE",
    "title": "I built the cutest gaming setup",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-06-01T14:59:17Z",
    "video_url": "https://www.youtube.com/watch?v=kNTLYY-8wUE",
    "category": "Science & Technology",
    "tags": [
        "gaming",
        "gaming pc",
        "pink pc",
        "cute pc",
        "cute setup",
        "kawaii",
        "kawaii pc",
        "uwu",
        "pretty pc",
        "prettiest pc",
        "cute accesories",
        "comfort",
        "relax",
        "streamer",
        "collectibles",
        "aesthetic",
        "Cute gaming setup",
        "Cute gaming computer"
    ],
    "views": 979434,
    "likes": 42364,
    "comments_count": 2244,
    "description": "Try Rocket Money for free:    Check out Ridges Fathers Day sale at  and enjoy up to 40% off!  Cute is more than style - its a way of life. Its not just a gaming PC, nor is it using every shade of pink and its certainly not just squishing every plushie you own onto a desk. There is a careful balance of the right parts and peripherals, and we aim to make our prettiest setup EVER!  Discuss on the forum:   Check out the KAWAIIIII products used in this video:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 The Heart of our System 1:36 Sponsor Spot 1:45 Cases can be cute, too 2:35 Cooling is so cool 3:45 PRETTIEST POWER SUPPLY EVER! 4:55 GPU - this is what you came looking for 5:45 Time to Setup our Setup 6:25 Peripherals 8:18 Linus Reacts to the Final Setup 11:04 But how much does cute COST? 12:31 Time to GAME",
    "description_links": [
        "https://RocketMoney.com/ltt",
        "https://www.ridge.com/LINUS",
        "https://linustechtips.com/topic/1572236-the-cutest-gaming-setup/",
        "https://lmg.gg/ck1zP",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "The Core i7-14700K may not be particularly cute, but everything else is! Welcome to the cutest PC! Everything about today's build is S-tier adorable, starting with the motherboard. I mean, just look at the color-fire Miao B760M. Now stop looking at it. Not only is it more ginger than rose, we were turned off in a big way by its lack of features and settled on the Max Sun iCraft Z790 in White. It's more feature-laden for sure with more USB and PCIe expansion slots, but it is definitely the first of our cute cost casualties. The MSRP is fine at $260, but the lowest price we could find in the wild was closer to $350. That is more than double the price of this similarly featured, but decidedly un-cute MSI Z790 board. Luckily though, the same is not true of our 32 gigs of DDR5 5600 megatransfer Corsair Dominator Platinum. In our opinion, these have one of the classier implementations of RGB out there, and the specs don't suck that much, at least compared to other Dominator Platinums. Next up is our teeny-tiny 1TB 2230 Saber and then the SSD. Look how small and precious it is! Perfect for something with limited space like a Steam Deck, but for a full-sized rig. The $100 price tag means you could get a more attractive deal on a bigger and better drive, even if you were trying to do a cute build. Like this cute segue to our sponsor. Ridge. Heads up, guys. Father's Day is right around the corner, and if you forgot, don't worry about it. Get up to 40% off Ridge at their Father's Day sale using our link in the description, and pick up a great last-minute gift. We were somewhat divided on how to tackle the big box. I mean... There are novelty cases, like the Yeston Cute Pet case, which, I mean, are unique. And there are lots of regular boxes with colored vinyl stickers that make them kawaii. But the more we scrolled Instagram and TikTok for ideas, the more we noticed an overwhelming trend. The case itself was rarely the focus. It's the inside that counts. So the idea is we're treating the PC cooler C3T 500 more like an art gallery than an art piece. And it's slightly smaller size when compared to most ATX cases should keep the proportions correct on our desk, but David what the heck is this just a white build? No no no the AIO is white with a screen You know we already did the all-screen PC - right all-screen PC 3, baby Okay, as long as you don't mind paying the extra and pay extra you will The Corsair ICue-Link H150i RGB with the upgraded LCD screen module with high-resolution display Looks absolutely incredible in any theme to build Though I can't say the same for the case's pre-installed fans I mean, they're alright, they are RGB and everything But the QX series from Corsair is a lot more pleasing to the eye With 34 LEDs per fan for smooth lighting effects And... Daisy chaining for less ugly cable tangle-age. The only thing that's really not cute about them is the price. It's ugly. You can't argue with the look of it though. I mean, this is clean. Funnily enough though, our first real individual aesthetic piece, the Seasonic Vertex Sakura 1000 watt is a power supply that's gonna end up being stuffed into the back of our case, never to be seen again, which is a shame because, oh my goodness. Seasonic has attended to every detail here, creating a power supply that is as cute as it is performant. Wait, no way. Even the cables are accented pink, saving us the cost of custom cables from a third party vendor. That is a big win for our budget, or at least it would be, if this wasn't a very limited run item that's currently going for about triple the price of the black model. Also. Really guys, you got one black connector and it's going to be front and center in the middle of our build on our GPU. That is whatever a cuter word is for bummer. Tushy here? Thankfully, it doesn't really matter since our GPU is going to be using these classic 8-pin PCIe power connectors. Let's go ahead and get everything cabled up, shall we? Now it's time to meet our GPU, the Power Color Hellhound Sakura 7800 XT. Like the non-Sakura version, it boosts to 2520 megahertz with 16 gigs of GDDR6 memory and has an LED color switch. But obviously its most important feature is its colorway. Now, the Hellhounds of Legend aren't known for being adorable, but this is so cute. How high was the cuteness tax on this one, David? It wasn't too bad. It was less than a hundred dollars more than a regular Hellhound. That's a lot more to pay for a 7800 XT, but hey, at least it comes with this adorable anti-sag bracket that's going to serve us very well when we're decorating the case. Now for the finishing touches. There were two peels on that. Now that our computer is adorable, all we need to do is cutify the space around it because this simply won't do time to paint okay that is a cute color apparently it's called pinky promise now to be clear there's a lot of things I would have done a little bit differently if I'd been the one in charge of getting all of our painting materials and all that but doesn't really matter we are just doing an accent wall anyway I'd hate for you guys to get bored literally watching paint dry here with me so while I do this David is going to show you some of our cute peripherals let's start with Logitech and the G705 mouse it's sadly not using the hero sensor but it still has light speed connectivity for nearly lag free performance and it's well constructed if slightly small for bigger hands but perfect for cute hands it's part of a well-rounded cutesy Aurora lineup and and we grabbed the matching G735 headset for our setup with its similar soft lines and matted white plastics punctuated with tasteful RGB and if you want to take your cuteness a step further you can get the pink earcups, pink boom mic from Logitech or these universal cat ears that fit on pretty much any headphone for just a few dollars. As for the keyboard, we are going so hard with the Yunzii C68 Hi-Fi mechanical keyboard, one of the sweetest little keyboard bases I've ever seen. I've actually already put in the Mixed Pastel C-Glass Linear switches from Omnitype, and these absolutely perfect in every way cat-shaped Meow Meow Squad keycaps from Keyboom and MeowrBang. Those are made up words. I mean, all words are made up. The cherry on top is going to be this white cold cable from CableMods. Linus has gone to shoot another video, so that means I can finally think straight again and we can do the most important part of today's video, which is decorate both our PC and our setup. Let's go. I think this looks absolutely incredible. And that's not just thanks to me. I had a whole council of cute come together and help me pick the parts for this. And so I want to have their reactions to the finalized setup. And we're going to have that over in an exclusive at LMG.GG/FLOATPLANE. But right now, I want to see what Linus thinks. Oh my goodness. I feel like I'm moving between worlds. Wow. You know, I think I could get used to this. What a relaxing vibe. How's this keyboard? Is it actually good? She clacks, she clacks, she moves. Okay, well, she's all right. There are so many layers. I see we've traded out our Bulbasaur bushes for Ivysaur flowers. Yeah, we've evolved. This is a nice touch, by the way. Yep. LTT Store OG pink and white water bottle. Hardly even noticed it there. First thing you're supposed to notice is the desk pad. What do you think? It's the cutest thing I've ever seen. I can't even complain that it's not from LTT Store. We need to make something like this. I actually do agree with you. We need to do some more kawaii types of products. Is this a stream deck skin, or is this just like a special cute version of the stream deck? No, it's a special one. Elgato actually has a Neo lineup of hardware. That's designed to be super easy, just plug and play, very aesthetic. They have a webcam light, a mic, and I think it just kind of blends into the setup in a really pleasant way. One of the pleasant surprises I had was actually setting up this monitor. I really like this base. It's white with speckles. It looks great. Evnia is Philips' new welcoming gaming brand. Okay. And they have really good monitors. This is a 41-inch, 4K, 138-hertz monitor. It's OLED. And everyone who walked by was commenting on how good it looks and feels. But they also had one that I was kind of considering, a 34-inch QT OLED, you know, QD-- QD OLED. Oh, I just thought you meant you wanted the best panel tech. No, no, QT. Oh, I love the heart back there. That was Glenn. He made that happen. That is awesome. So there's a ton of aesthetic things. Oh my goodness, the Secret Lab chair is adorable. The Titan Evo with the pink plush, but also the memory foam armrest. Oh, and they've got like soft. It's really nice. I'm so ready to launch my e-girl career. One of my favorite random touches is this random BMO switch dock. We don't have it plugged in right now, but it's a dock and you could actually have your screen play through it. And we even got a switch case to match-ish. I mean, it's cute. It was supposed to be pink, but by the time we ordered it, the pink was out. Quality, I mean... No, no, don't worry about quality. It's cute. Did we run into a lot of things like that though? There wasn't too much. The trade-off is there is very little that is budget in this build. Do you want to know how much it's worth? I already have kind of... So that doesn't count. I brought that from home. Okay, tell me. The computer was around $2,500. That is not that bad. Other than that the GPU is not what I would expect for a system of that price. When I spec'd a very similar system that was not aesthetic, it was $1,700. So there's a big premium there. So you could basically afford to have a 4080 Super. Instead. Actually, maybe even better. You could get a 7900 XTX. And a 14900K. I could put that into my budget, so. Did you also do a not cute version of the complete setup? I did not, because if you're not doing a cute PC, why do you need a cute setup? Right. I mean, the Dorito dust should be enough decoration. Yeah, Dorito's dollar. Your decoration's a dollar. The whole setup, minus a few things that weren't included. $10,000. Shut up. Shut up. How much are these? Those are nothing. These are like, $6 a piece. It's the monitor. What is it? Where did the money go? The lights, everything. How much were these? Those are $200-ish dollars. There's a few things that I got that weren't included. So I will show you the total right now on screen. It should be a little bit less. What about this? It's like, $50. Where did all the money go? I honestly don't know. Oh, jeez! Scared the pants off me. What do you think of that mouse? You know what? It's a little small. Yeah, even for your hands. Even for my hands, yeah. No, no, no, no, no. Whoa, try to get over it. It's water. These are the cutest keycaps I've ever seen. I can't say I'm a huge fan of the key switches. Are you, you're a-- I'm a tactile guy. - Tactile guy, yeah. These are linears. They sure are. I do like the keycaps though. They're actually pretty high quality for being gimmicky. Yeah, they're so cute. They feel great. I think the cutest thing though, is that-- As we game and our fans ramp up, there's a breeze that blows through our cherry blossoms. Oh yeah, that's satisfying. Oh, I feel like I'm a three-year-old with those games again, you know, where you're putting the shapes in the hole. This is very relaxing. I like this genre of games. Oh, I meant being in this environment. Well, I thought you meant being next to me. You're part of the environment, David. I wouldn't spend this kind of money on it. Oh, oh. But it's definitely something that I can appreciate and enjoy now that I'm sitting in it. Far more than I would have thought that I would. Oh God. That's their house Linus. I know, I swallowed it all up into the abyss. Oh my gosh. How does this get cold yet? Good timing for your question. Great delivery. I need to play this game. I think I do too. And I need to tell you about our sponsor. Rocket Money. It's a pretty terrible feeling when you look at your bank statement and there's fewer dollars in there than you were expecting. That's, this isn't right. And with more and more platforms switching to subscription models, that nickel and diming is becoming increasingly common. But Rocket Money is here to help. Their personal finance app helps you cancel subscriptions, lower bills, and manage your money better. They can cancel your unwanted subscriptions in just a couple quick taps. And that means no more scavenger hunts on your \"My Account\" page trying to find the \"Cancel Subscription\" button. I know it's here somewhere. Just wanna cancel. Just wanna cancel. You think this is a game? Plus, Rocket Money can also go over your spending habits and help set up a budgeting plan that works for you. To save more and spend less, join over 5 million members that use Rocket Money today by clicking the link below. If you guys enjoyed this video, you might enjoy the last time David and I put together an aesthetic-themed build. It was flippin' awesome, Luke loved it, and my kids showed up as helpers.",
    "transcript_keywords": [
        "cute",
        "Rocket Money",
        "money",
        "Corsair Dominator Platinum",
        "White",
        "build",
        "Cute Pet case",
        "David",
        "case",
        "Yeah",
        "pink",
        "setup",
        "Core",
        "price",
        "things",
        "RGB",
        "GPU",
        "Yeston Cute Pet",
        "cute version",
        "thing"
    ],
    "transcript_entity_values": [
        "just a few dollars",
        "Elgato",
        "one",
        "500",
        "4080",
        "SSD",
        "Ivysaur",
        "One",
        "RGB",
        "over 5 million",
        "Corsair",
        "GPU",
        "fewer dollars",
        "C3",
        "1",
        "50",
        "Logitech",
        "Daisy",
        "Dominator Platinums",
        "Linus",
        "41-inch",
        "AIO",
        "Corsair Dominator Platinum",
        "Rocket Money",
        "6",
        "2520 megahertz",
        "first",
        "the Max Sun iCraft",
        "LMG.GG/FLOATPLANE",
        "First",
        "32",
        "Seasonic Vertex Sakura 1000",
        "less than a hundred dollars",
        "34-inch QT OLED",
        "G735",
        "Neo",
        "the Hellhounds of Legend",
        "the Yeston Cute Pet",
        "4",
        "MeowrBang",
        "un",
        "White",
        "third",
        "Tushy",
        "LTT Store",
        "LCD",
        "BMO",
        "7800",
        "Rocket Money",
        "ATX",
        "138",
        "Seasonic",
        "Ridge",
        "10,000",
        "Omnitype",
        "Miao B760M. Now",
        "MSRP",
        "Hellhound",
        "260",
        "David",
        "XT",
        "16",
        "TikTok",
        "Glenn",
        "Evo",
        "a ton",
        "Meow Meow Squad",
        "5600",
        "Instagram",
        "3",
        "34",
        "Philips",
        "two",
        "around $2,500",
        "Aurora",
        "three-year-old",
        "up to 40%",
        "today",
        "350",
        "8",
        "LTT Store OG",
        "100",
        "Luke",
        "14900K.",
        "USB",
        "Dorito",
        "QX",
        "1,700",
        "Yunzii",
        "Keyboom",
        "last-minute"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "ORDINAL",
        "FAC",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "FAC",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "PERCENT",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "GPE",
        "TIME"
    ]
}