{
    "id": "KNyobl4kTuU",
    "title": "Installing Windows 10 on a Mac - Boot Camp Bonanza - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2019-04-12T20:00:47Z",
    "video_url": "https://www.youtube.com/watch?v=KNyobl4kTuU",
    "category": "Science & Technology",
    "tags": [
        "Installing Windows 10 on a Mac - Boot Camp Bonanza - Krazy Ken's Tech Misadventures",
        "Installing Windows 10 on a Mac",
        "Boot Camp",
        "Microsoft Windows",
        "Windows 10",
        "macOS",
        "Apple",
        "MacBook Pro",
        "Mac",
        "Boot Camp Drivers",
        "Touch Bar",
        "Windows",
        "Tech",
        "Computer",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Comedy",
        "Humor",
        "Funny"
    ],
    "views": 39775,
    "likes": 1019,
    "comments_count": 186,
    "description": "Krazy Ken needs to install Windows 10 on a Mac via Boot Camp Assistant; this will allow him to setup for a future experiment! But when The Curse strikes, Maniac Mike steps in to save the day.  Support the show and get in the credits   Want more videos like this?   Subscribe for more tech videos!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures #98 - Installing Windows 10 on a Mac - Boot Camp Bonanza  Pledge on PATREON now to get your name in the show credits and gain access to Krazy Ken's exclusive Discord server!*   Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?   Amazon links are powered by the Amazon Associates Program.  COMPUTER CLAN COLLABORATORS INVOLVED IN THIS VIDEO midnightxenesis - as Maniac Mike Ken (Hildron101010)  *not all Patreon tiers qualify for all rewards  #KrazyKen",
    "description_links": [
        "http://patreon.com/krazyken",
        "http://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://patreon.com/krazyken",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- [Ken] Oh, there's Cortana! - [Mike] Uh, how 'bout no? - [Ken] No. Failing already. You need 39 gigs free. What do you mean? We have 100, is that not enough? Fuckin' cool. - [Mike] No, you have a pretty hard-on for blue last time I remember. - [Ken] Whoa, what? Whoa, what? (laughs) (Mike laughs) - [Ken] So I like blue things. Wow, it's been one of those eons. (beeping) (keyboard clacking) (upbeat dance music) - [Mike] One, two, three, ah! Oh, yeah. (Ken laughs) - [Ken] That's our vocal warmup. - [Mike] No, that's mine right there. - [Ken] That's your vocal warmup. Hey, guys, how are you all doin'? Really? That's just great. You know, I'm doing pretty great today, too, because I'm not all lonely in the lair today. I ordered a pizza, and oh guess what? The pizza guy stayed, and it's none other than Maniac Mike. - [Mike] Hello. - [Ken] Hey. We're at a little bit of an experiment today. I've been using Adobe Premiere as my daily driver at my day job, but I use Final Cut Pro X as my daily driver in my freelance life and in my YouTube life, so I was wondering, hmm, why does Final Cut Pro seem so much freaking faster than Premiere, and why is Premiere so unbelievably slow? Is it an optimization issue? Is it faster on Windows maybe? Maybe it's not optimized for macOS, so I was thinking I need to compare them, and then someone else commented asking something very similar recently, and I'm like well, you know what? You're in luck, guy, because I'm doin' an experiment on that, so what we're gonna be doing soon is we're gonna pit Adobe Premiere's speed on Windows against macOS and see which one actually renders stuff faster, but first we need to get Windows installed on this computer. That's where this lovely DVD of Windows 10 64-bit comes from. I believe imaged this, or burned this from an image that I got from the recovery tool who know how long ago? I honestly don't remember, and we're gonna be using the built in Boot Camp solution, which I never have luck with. (laughs) I'm really scared. This is probably not gonna work at all, but hey, Maniac Mike will make it easier, so let's start with the Boot Camp Assistant. Essentially what we need to do is partition the disk, install Windows, and then you don't have enough space. (beep) Mother shit, bitch, why? We're failing already. You need 39 gigs free? What do you mean? We have 100, is that not enough? Oh, my gosh. Shit. Okay, so before that happened, what I was trying to say was we need to partition the disk, install Windows, and then get the drivers installed on Windows so it operates properly on this hardware, but right now we don't even have the space to do that. Let me see here. So don't need to create an installer. We do need to download that shit, though, so maybe we can at least do that, 'cause I think we can use my DVD though for the actual installer but for the drivers we may need to do this here. Okay, let's see if we can download this at least. To the Kingston, cannot be used, alright. It needs to be reformatted. Alright, so let's at least do that for now. Let's get Disk Utility open and reformat this flash drive for the drivers. FAT32, we can do that, right? Let's go here, boom, and that should be pretty simple. Alright, so partition complete. That is done. Now we should be able to hit continue, and what do you mean it can't be used? Oh, it needs MBR. Son of a bitch. Alright, we can do that. Erase. MBR. Fat. Erase. Just do your thing, and we're done. Okay, hopefully you can work now. Your computer is not connected to a power source. Well, I too like to play dangerously, so we will just do that without a power source. - [Mike] And we're good on battery anyways. - [Ken] Yeah, we have a shit-ton of battery. Okay, so while that's going, I need to free up some disk space. Apparently 39 gigs, like what? Alright, that'll be fun. Alright, thanks to the power of this LaCie, I was able to transfer a few things, and I deleted some caches and all that BS, so we should be all, oh, it's still doing, (laughs) it's doing something in the background right now, so we actually can't continue with the partitioning process at the moment, but at least the support software is going on there. Sometimes this part can take forever, so we'll catch you on the flip side in like five hours. I was quickly looking at this disc to see the scratches on it, and oh my gosh, guys. (laughs) Where was this thing stored? (laughs) So what were you wondering about it, is there... - [Mike] Well, I mean, from when we got in here today, I mean, you were just playing around with it, sliding it around, and oh my gosh, I'm just like, yeah, this is going to fail spectacularly. - [Ken] No, it's gonna work, because I'm a believer. I'm gonna put this in. Actually this wouldn't really prove anything. It might just prove that one part of the disc works where it's able to mount but not actually copy all the files, but for the sake of experiment for now, let's see, where is that USB port? Let's see, there, right? Maniac Mike, do you wanna help me out there? (laughs) Help a brother out? - [Mike] There. - [Ken] Thank you, sir. Alright, let's pop that in there, boop. According to the progress bar, which could be wrong, it's almost done. I mean, it mounted at least. - [Mike] Yeah, but we'll see where this goes. - [Ken] Yeah. I actually just realized under the Action menu there is a manual button to do just the download of the support software. I had no idea that was even a thing. Install this Windows support software after installing Windows. Makes sense, so we're gonna quit. (laughs) Hey, eject first. Eject. Eject. It's workin' on it. Still workin' on it, (laughs) there we go. Alright, let's reopen the Boot Camp thing. Alright. Continue. What do you mean, what? We just freed up a (beep) ton of, wait. Oh, wait, hang on a second. This didn't say we needed to free up 39 gigs, it said you must have at least 39 gigs free. We have 140. What is this thing doing? (laughs) Oh, my gosh, guys. - [Mike] What? - [Ken] Okay, well, that's gonna go in the tech fails gallery. - [Mike] Wait a minute. - [Ken] What? - [Mike] Hang on a second. Process of elimination. - [Ken] What? Oh now it, now it's-- - [Mike] It's trying to download Windows 10. - [Ken] Oh, what? Oh yeah, 'cause it changed. - [Mike] Uncheck the box. Oh wait, the install is blurred out. - [Ken] Yeah, now it grayed it out, so we go, let's try it. - [Mike] Shit. - [Ken] Yeah it says... - [Mike] But we have 100-- - [Ken] We have 140 gigs free, and it says we need at least 39. - [Mike] And that's your only partition, correct? - [Ken] Yeah, yeah, I mean, let's double check this. There shouldn't be anything else on here. Yeah, there's one container, and the container has one volume. Alright, let's just reboot the computer maybe. Maybe it's just confused. Ah, (beep) you. (both laugh) You son of a bitch. Quit. Reboot. Yeah, this is weird. We're already having problems. I had a coworker who was having trouble using Boot Camp recently, and I was just like, oh my gosh, I'm about to jump into that myself, and I'm just so scared. Alright, so we're rebooted. Let's try doing that again. Hopefully it works this time. Yeah, right. Didn't even open up. Shit. (laughs) Okay. Continue. I'm gonna punch a bitch. Why doesn't this (beep) work? Could we manually partition this? Would it work still? How would the BIOS emulation end up functioning? - [Mike] Well, for sure it can't be APFS. - [Ken] Well, yeah, we would partition is as Fat, and then we'd have the Windows installer reset it as NTFS. I've done a manual partitioning before without using Boot Camp. I think it worked, because you can still install the drivers but my concern is will the BIOS emulation have a problem? Since nothing is working, maybe we just try it? Just for shits and giggles maybe? - [Mike] Maybe. - [Ken] Let's try, oh. - [Mike] Yeah you're gonna-- - [Ken] Oh, god. Okay, hang on, let's do a partition. I think if we add, oh, good heavens. Oh, my gosh, APFS is really (beep) confusing. (laughs) It makes everything so much harder. Okay, there's gotta be a way to do this. Can we do this from recovery mode? Can we resize this stuff or something? Wow, this is really weird. Maybe APFS is confusing the Boot Camp Assistant, but it's Apple's own thing. That would be silly. - [Mike] Yeah, and plus APFS is standard on new installations. - [Ken] Right, right, and the installations still come with the Boot Camp Assistant, so it's not like it's an out-of-date technology, but it doesn't seem to know how to work. I want to partition the device, but it's not letting me. The container can not be split, because the resulting containers would be too small. What the shit does that mean? Okay, well let's try doing this in Recovery Mode. I doubt we're gonna get a different result, but maybe we'll luck out. And if this really doesn't work, we can try it on your system, since you volunteered your computer as tribute. - [Mike] Yeah. - [Ken] Ah, shit. Wait, we don't have a way to plug this SuperDrive in, though do we? Do you have a dongle? Oh wait, you have a hyper thing, right? - [Mike] I have a HyperDrive. - [Ken] HyperDrive. - [Mike] Well, yeah, at least mine's working. I don't know what the (beep) is goin' on with yours. - [Ken] Your Assistant's doin' the thing? - [Mike] Yeah, mine-- - [Ken] Hang on. Shit, what the fricky frack on stick biscuit? What the bitch, what? How? Why? - [Mike] I just hit Next, and that's what showed up. - [Ken] What, hang on, so oh wait that's new where it says ISO image. I don't remember it ever saying that before. You can just put the ISO right inside it? Shit. - [Mike] I think that's mostly just for these, 'cause you don't have any USB ports. - [Ken] That could be. - [Mike] Oh, hey, it's done. - [Ken] Wow, that's, how did it work for you and not for me? Gosh darn it. Oh, yeah, 'cause the Krazy Ken curse only applies to Krazy Ken not you, and that why, lucky bastard. - [Mike] You, Light Mode. - [Ken] Yeah, right, Light Mode. Ooh, so gross. Alright, so I gotta wait for it to mount, and then I'll have to type the password to unlock the disk. There we go, okay, so we're unlocked. Partition. It's gonna do the same bullshit. Yep. - [Mike] Yep. - [Ken] Alright, well we're gonna have to abort the mission on this guy. Well, if you're cool with us temporarily installing Windows on your system to do this experiment, I'd love to use your computer. - [Mike] Here's what's funny. I have, so you're gonna hate me for this, but I have just about the same amount of space available, and I have a smaller SSD. You have a 512 gigabyte SSD if I remember correctly. - [Ken] Yes, that's true. - [Mike] And I have a 256. - [Ken] Well, I'm sorry that I'm a video editor that also shoots raw photography, hmm? (laughs) - [Mike] Well, no, it's nothing on your part. It's because Boot Camp on your computer is just fucking garbage. - [Ken] Oh, that. Oh, nevermind, I thought you were making fun of my storage habits, but yes. (laughs) I wanna punch something really hard. - [Mike] You have better storage than I do, because you have full Thunderbolt drives. I don't. I don't have anything that will take advantage-- - [Ken] Cry me a river! Cry me a damn river. Alright, let's put your computer in here. Okay, so Maniac Mike is literally saving the day here, so he has his 2018 MacBook Pro here. - [Mike] In glorious Space Gray. - [Ken] In glorious Space Gray, and yeah, Boot Camp Assistant is just working like it freakin' should. (laughs) So yes, I'm just trying to see. Please select the Boot Camp partition size. Once the partition is created it cannot be adjusted. Windows support software will be installed after completing Windows installation, so does it need to image that to a flash drive, or does it just know how to do that? - [Mike] I guess it just reads it right from the ISO. Considering how you're, considering how long you're kinda seeing it here is that you have, you're already to the step where you choose the size of your partition and then go right into install. - [Ken] Wow, they really simplified this. I wish it worked for me. (laughs) Let's give it 64 gigs, that should be fine. It's just temporary anyway. 65, whatever. - [Mike] But first of all we're going to need an ISO image. - [Ken] We will or we have a CD. - [Mike] I think it wants an ISO image more than a CD. - [Ken] Yeah, that's true. Alright, well it's here. What's your plan? - [Mike] I was thinking we should probably download one right from Microsoft's website. - [Ken] Alright, so you know what? I'm gonna let you sit in the Krazy Ken stool and navigate. - [Mike] Certainly. Normally if you try to visit this on, this is the site, on a Windows computer, you'll get the download to the media creation tool. However, 'cause we are not running Windows, we can't use that, and it will just give us a direct ISO file. - [Ken] Which I would love. Just let that download. So in the meantime you have a little gadget in case we needed use the USB drives and stuff like that. - [Mike] Yep, so as you may or may not already know, I only have Thunderbolt 3 ports, which are USB type C, because Apple is like that for some reason and wants to get rid of all the ports. - [Ken] Well, yeah. - [Mike] Thankfully, I have what I like to call the uber dongle, which is this guy right here. It takes up two USB-C ports or Thunderbolt ports. Whatever you wanna call it. I don't really give a shit. - [Ken] USB-C slash Thunderbolt 3. - [Mike] Basically it goes onto one side, and as you can see it gives me all my ports back, so there's two pass throughs for each of the Thunderbolt ports, and it can charge through them, too. - [Ken] Nice! - [Mike] And then I have both a micro and full-sized SD card, two USB-As. I believe these are 3.1 or 3.0 spec. I don't know, and then if we come around here I also have HDMI out. - [Ken] Awesome, I mean, at the office I'm at for my day job we should probably get some of those for the MacBook Pros. (laughs) - [Mike] Yep, and they do come in both colors, so like here I have the luscious Space Gray version, but there is the Silver one if you do have the Silver version. - [Ken] Sweet. Alright, so image is downloaded. Let's drag that boy in here. Okay, 64 gigs, Install. You might need to fingerprint or no, oh wait, hang on. Oh, nevermind. - [Mike] Yeah, we live dangerously. - [Ken] Continue on battery power. (laughs) Oh yeah, it's downloading the support automatically, and you don't need to use a flash drive anymore. Wow, this is getting a lot more automatic. I remember back before it was still a beta in the Tiger days. There was so many other steps you had to do, but at least that worked. It doesn't work for me. (laughs) Wow, this is nice. Okay, also I love the orange with the Dark Mode. I might have to change my accent color to that, 'cause that looks really fuckin' cool. - [Mike] Nah, you have a pretty hard-on for blue last time I remember. - [Ken] Whoa, what? Whoa, what? (laughs) (Mike laughs) I like blue things, but hey, honestly I was thinking this to myself earlier, I was thinking the complement to blue it terms of color contrast is actually orange, so I was thinking with a Dark Mode orange actually looks really nice. I thought, oh, maybe I should do more orange, and now it's like, oh, this is a calling. I should change my accent color to orange, but apparently I have a hard-on for blue, so I can't say that now, hmm? - [Mike] Hey, I don't control you. You do whatever. (Ken laughs) - [Ken] I have a hard-on for blue. (both laugh) The fuck? Gosh darn it, my screen won't turn on. Asshole, turn on! My computer's mad, wait, did I shut it down? Oh, I shut it down, that's why. - [Mike] You shut it down! (both laugh) - [Ken] I'm an idiot. I'm an idiot. Booting back up. Wow, this, it's been one of those eons. - [Mike] Oh, wait, partitioning. (Ken laughs) I thought for a moment that said formatting. - [Ken] No, no, no, no, no, no, no. - [Mike] What the (beep) is it doing? - [Ken] It's not formatting. It's just partitioning, but yeah, it's workin'. It's workin', man. Oh, now it's saving the Windows support software, but yeah, Midnight converted me. I'm gonna be using some orange with Dark Mode for now. Yeah, alright, so can you reach your finger in there? (chimes) Boop. (laughs) - [Mike] There we go. - [Ken] That's cool that it lets you do that for all that shit. That's awesome. - [Mike] Certain stuff, and we're goin' in. - [Ken] Goin' in to Windows. Are you able to see? - [Mike] And my screen is dusty. - [Ken] Oh, you want me to clean it? There's probably some fingerprints on it, too. Oh, hey, we got a Windows. - [Mike] Hey! Rest in piece, startup sound. - [Ken] Yeah, set up is starting. Wow, this is, I've said this before, but this is so much more automatic than before. - [Mike] Well, the good news is is that thing. Since this is a temporary install on my system, we don't need a private key. - [Ken] True. - [Mike] Alright. - [Ken] Wait, how does that work nowadays anyway, 'cause when I do-- - [Mike] It just nags at you. - [Ken] No, no, no, no, no, no, like when I've done install from the Recovery Tool, it just knows. Is it tied to an email address or something, 'cause I never remember being asked? - [Mike] It's probably tied to your motherboard. It might be. I don't know. - [Ken] On my Mac, though? - [Mike] I don't know. - [Ken] I don't know, man. - [Mike] Or it could be whatever. - [Ken] Oh, maybe Brainiac Brent knows, but, yeah, we don't have a product key, so we can skip that for now. Like you said it's only for 30 days or whatever, well. - [Mike] I'd say for this we'll just do Pro. - [Ken] That's what was downloaded, though, right? Wasn't it Pro? - [Mike] It's all of those SKUs. - [Ken] Oh, really. Oh, 'cause it depends on what product key you have, okay. I'm learning! It's been a long-ass time since I've touched Windows. What I still don't get is they still have the old 7, Vista look, but it's Windows 10. I guess they just never changed the way the setup looks. - [Mike] Or the setup is based on Windows. - [Ken] Or yep, that could be. - [Mike] It's based on Windows 7. - [Ken] Because with installing XP. - [Mike] Or it could be like an early version, but it's using some kind of Aero theme. - [Ken] Yeah, 'cause they even have the little animated progress bars going on. - [Mike] And if you were to boot off of the ISO... Oh, that is going very fast. - [Ken] Holy shit. I mean, it's all on the inside on your super fast SSD. - [Mike] And yeah, 'cause it's MDME-based, I believe, too. - [Ken] Yeah, it's a frickin' fast SSD. While it's installing I just kinda wanted to go back to this HyperDrive thing. Maniac Mike, what kinda technology would you call this? Maybe it's a type of converter of sorts. - [Mike] I think you have it right there. Just put converter and technology. I think you might have mentioned it before on multiple occasions. I can't put my finger on it. - [Ken] Converter technology, hmm. I don't know. That just doesn't have the same ring to it as something else maybe. What if we play with the words a little bit? Not converter technology but maybe, what else could we say that sounds, what about a conversion maybe? - [Mike] I think so. - [Ken] Is it a type of conversion technology? - [Mike] That really-- - [Ken] Conversion technology! It works! - [Mike] Woo! - [Ken] It sounds so much better. This thing is really slick, by the way. I really like it. Conversion technology. - [Mike] It blends in. - [Ken] It does blend in. - [Mike] With the rest of the case. - [Ken] It's really slick. Okay, well it's already done with everything, so it's gonna do the finishing up, and then it's probably gonna go to the thing where it's like hey, we're getting everything set up for you. Alright, we're gonna do the startup sound ourselves. Bong. Cool. - [Mike] This is going super fast. - [Ken] Wow, holy crap. - [Mike] This is much faster than I would expect it to go. - [Ken] Yeah. - [Mike] And even then my-- - [Ken] Oh, my gosh. - [Mike] My installations on virtual machines just go, oh my god. - [Ken] What? Dude, I think this installs faster than macOS does. (laughs) I could be wrong about that. I haven't used the newer hardware, so I don't know how fast it is on this. - [Mike] I will warn you. Get ready to mute. - [Ken] Is there a noise? - [Mike] The devil herself will be appearing soon. - [Ken] Oh, no, Cortana. Wait, how do you mute on this thing with the Touch Bar? - [Mike] It turns into a Function row. - [Ken] Oh, it does? And then what Function key would be the volume by default? - [Mike] It would be kinda like how your Function keys are, and then if you hold Function, it'll turn into our standard Function keys. - [Ken] Oh. - [Mike] Spoiler alert. - [Ken] Okay, ah, that makes sense. - [Mike] Yeah, you don't get any kind of special Touch Bar tech. - [Ken] But does the Touch Bar know how to communicate with Windows without the support software installed? - [Mike] I think it just does it automatically. - [Ken] Maybe it just does, yeah. Everything's automatic nowadays, which is kinda cool, but I'm so behind. - [Mike] For all I know, I don't think Touch ID works with Windows Hello. - [Ken] Yeah I don't think, that would be a huge security problem. - [Mike] Yeah. - [Ken] Yeah. Alright, so it looks like it just did a reboot there. Just a moment. Ah, this is going really smooth, though. I'll just make a dummy account. Alright, so we're in the Virgin Islands, nope. - [Mike] Three, two, oh I guess, yay, because it doesn't recognize there's a microphone. (claps) - [Ken] Oh, so it won't automatically do Cortana. - [Mike] We're just flying right through this. - [Ken] Oh, yeah, now we have some important setup to do, so get ready. Make sure you're taking notes on this shit. You need to pull out your phone and take notes? - [Mike] Nah. - [Ken] You should, 'cause I told you to. - [Mike] Now let's see what's new from Windows. (Ken groans) Don't install that update, please. - [Ken] Mm, yeah, I hope it doesn't do that. - [Mike] I don't want my data erased, even though there's nothing to erase on there. I would go set up for an organization. - [Ken] Really? - [Mike] 'Cause it's a way to bypass the Microsoft account easily. - [Ken] You can't do that on personal? - [Mike] It's easier on-- - [Ken] Okay, I trust you. I trust ya. Yeah, I mean you are the pizza guy after all. - [Mike] And then go to domain join instead. - [Ken] Shit. - [Mike] And there you go. - [Ken] Well, okay, shit. Alright, Krazy Ken, and super memorable password, 1, 2, 3, 4, 5, 6. Confirm, 1, 2, 3, 4, 5, 6. Security questions, (beep) you. - [Mike] Eh, we can just do random shit. - [Ken] What was your first pet's name? (beep). (laughs) Security question two. Sorry, that was really immature. What was your childhood nickname? (both laugh) What was the name of the school you first attended? (laughs) It's (beep) University. (both laugh) Oh, there's Cortana! - [Mike] Uh, how 'bout no? - [Ken] No, and I already have a personal assistant. Her name is Bethany. - [Mike] And off, off, off, off, off, off, off, off, off. - [Ken] Yeah, I was gonna say off, off, off, off, off, off, off. (laughs) - [Mike] And I think there's one more. - [Ken] Oh, shit. - [Mike] (laughs) Oh, no. - [Ken] This is an experimental account. It's gonna get wiped out. Now, do you have Adobe Premiere installed on your macOS partition, though? - [Mike] I do, but I probably might have to deactivate one of mine, but I don't care. I can just easily reactivate, because Adobe is nice enough like that to let you reactivate your two device limit. - [Ken] Yeah, so in a future tech video log, we're gonna show our Adobe Premiere speed test on Windows versus macOS on the same hardware to see if Premiere is optimized for a certain platform over another. We'll see how fast each one is. That will be a little bit later, and Maniac Mike sacrificed his hardware for the experiment. We just need to get all the operating system stuff installed. Yeah, now we're at the this may take several minutes stage. - [Mike] I know exactly what it's doing. It's installing all of that bloatware, like three different versions of Candy Crush. - [Ken] Is it really installing Candy Crush? - [Mike] Yes. Leave everything to us. - [Ken] Almost there! - [Mike] Actually, when that shows it's a let's start, 'cause they changed it. Searching for display driver, oh, yeah. If you close out Edge right behind you... Hey! - [Ken] Oh, shit, dude! Look at that. - [Mike] The support software. - [Ken] I was hoping that's how it would be, so, yeah, let's just install that. Enumerating pre-installed packages. Oh, oh, okay, yep. - [Mike] Oh, Okay. - [Ken] Everything's doing the thing. Fix apps that are blurry 'cause of the resolution. - [Mike] Okay, c'mon. - [Ken] Maybe I shouldn't touch it. (both laugh) I wanna see, oh, dark, oh, dark, oh. Well, that's too dark. Can you just give me a slider? - [Mike] I think we have to wait for the actual, for the Touch Bar drivers to install. - [Ken] It's just it's too bright. Change Brightness. There we go. - [Mike] Oh, there's our slider. - [Ken] Woo, that's all I wanted, yay. Oh, that makes it very hard to adjust. Oh, shit! - [Mike] Oh! - [Ken] Now it's nuclear radiation poisoning. There we go. That should be fine. That's pretty. I haven't used a lot of the, not material, oh my gosh, the Fluent interface yet. - [Mike] Yeah, remember what I said about Candy Crush? There we go. - [Ken] Oh, yeah. What the (beep)? Well, I guess they gotta have some games. That's kinda a Windows thing, but, yeah, I just hope soon they unify the interface look, 'cause the Win32 stuff looks totally different from the universal stuff, and the Fluent Design. - [Mike] Yeah, Fluent Design looks better, but the Win32 stuff looks like complete garbage. - [Ken] Yeah, yeah, they kinda have a problem where they did too many different things, and it's not uniform, which personally I don't like, but if I just focus on the whole Fluent Design stuff, that looks really frickin' pretty if it's running all those packages. (laughs) Blip, blip, blip, blip, blip, blip, blip, blip. - [Mike] And complete! - [Ken] Alright, restart the system recommended. (laughs) - [Mike] I'm pretty sure you have to when you install drivers of any sort. - [Ken] Yeah, probably. Now, does it automatically switch the boot thing, or do I have to go to the picker? - [Mike] Um, I believe it switched my startup disk. - [Ken] Yeah, I'm just gonna go to the picker, because I can. Oh, yeah, it did, nice. That was painless. - [Mike] Yeah. - [Ken] What the heck? - [Mike] And this is a T2 chipped laptop. - [Ken] Yeah, yeah, yeah. - [Mike] I have a T3 chip (Ken laughs) on there and you can't install Linux on there, because of the SSD. - [Ken] Couldn't throw a Linux distro on there. No way, but well I think our Boot Camp bonanza is done! I don't see how the Touch Bar, oh, shit, it just came up. There, yeah. Maniac Mike, thank you so much for being our savior for this experiment. - [Mike] Of course. - [Ken] And next time we revisit this computer you will see the Adobe Premiere test, speed test. (upbeat dance music) Adobe Premiere on Windows versus macOS. Until then thanks for watching. Catch the crazy and pass it on. (upbeat dance music)",
    "transcript_keywords": [
        "yeah",
        "Windows",
        "Boot Camp",
        "alright",
        "Boot Camp Assistant",
        "shit",
        "Adobe Premiere",
        "Maniac Mike",
        "thing",
        "Boot",
        "wait",
        "Premiere",
        "Touch Bar",
        "Windows support software",
        "Windows support",
        "Camp",
        "install",
        "install Windows",
        "Hey",
        "partition"
    ],
    "transcript_entity_values": [
        "256",
        "the Tiger days",
        "XP",
        "MacBook Pro",
        "a minute",
        "two",
        "Recovery Mode",
        "SSD",
        "3",
        "Adobe Premiere",
        "65",
        "the Dark Mode",
        "3.1",
        "512 gigabyte",
        "Fuckin",
        "Bethany",
        "one",
        "Final Cut Pro",
        "Space Gray",
        "macOS",
        "at least",
        "LaCie",
        "Mike] Nah",
        "Ken] Holy",
        "Ken] Wait",
        "Windows",
        "Ken] Ah",
        "Three",
        "6",
        "7",
        "39",
        "10 64",
        "Apple",
        "Ken] Shit",
        "Action",
        "Edge",
        "Boot Camp",
        "Vista",
        "the Virgin Islands",
        "Ken] Woo",
        "Brent",
        "Light Mode",
        "first",
        "Mike] Hello",
        "Candy Crush",
        "Kingston",
        "Microsoft",
        "the Touch Bar",
        "Windows Hello",
        "Windows 10",
        "100",
        "64",
        "Ken] Wow",
        "2018",
        "Function",
        "at least 39",
        "Ken] Mm",
        "APFS",
        "Linux",
        "T3",
        "three",
        "USB",
        "Ken",
        "Boop",
        "3",
        "Ken] Awesome",
        "Adobe",
        "1",
        "2",
        "Thunderbolt",
        "the Boot Camp",
        "ISO",
        "Touch Bar",
        "my--",
        "30 days",
        "the Boot Camp Assistant",
        "YouTube",
        "today",
        "Krazy Ken",
        "5",
        "Mike",
        "Mike] Shit",
        "Adobe Premiere's",
        "Windows",
        "Fluent",
        "Mike] Yep",
        "Mike] Eh",
        "several minutes",
        "SuperDrive",
        "the Recovery Tool",
        "the Fluent Design",
        "3.0",
        "Aero",
        "like five hours",
        "140",
        "Maniac Mike",
        "daily",
        "Next",
        "Mike]",
        "Boot Camp",
        "Windows 7",
        "Midnight",
        "MBR",
        "Ken] Cry",
        "1",
        "6",
        "Mac",
        "4",
        "Ken] Alright",
        "Space Gray",
        "T2",
        "Premiere",
        "MDME",
        "Mike] Spoiler",
        "SD",
        "Krazy Ken",
        "Thunderbolt 3",
        "Ken] Sweet",
        "One",
        "the MacBook Pros",
        "USB-C",
        "Boot Camp",
        "Cortana",
        "second",
        "Ken] True",
        "HyperDrive",
        "NTFS",
        "Ken] Right",
        "the day"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "ORG",
        "EVENT",
        "TIME",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "LOC",
        "CARDINAL",
        "PRODUCT",
        "LOC",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERSON",
        "NORP",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "NORP",
        "PERSON",
        "PERSON",
        "TIME",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "DATE"
    ]
}