{
    "id": "kO6yPUtvTnM",
    "title": "Chevy Bolt EV Summer Range Test",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2018-05-31T19:09:44Z",
    "video_url": "https://www.youtube.com/watch?v=kO6yPUtvTnM",
    "category": "Science & Technology",
    "tags": [
        "Bolt EV",
        "chevy bolt",
        "chevy volt",
        "chevrolet bolt",
        "electric vehicle",
        "electric car",
        "EV",
        "tesla",
        "tesla model S",
        "tesla car",
        "range",
        "range anxiety",
        "EV range"
    ],
    "views": 114271,
    "likes": 3871,
    "comments_count": 817,
    "description": "Come with me as I take the Chevy Bolt EV through 183 miles of summertime driving.  It was really hot out and most of the drive was spent at 70 miles per hour, but the car still did pretty well.  Here's a link to my winter range test:   You can support the channel on Patreon!  Patrons of the channel are what keep these videos coming.  If you'd like to support the channel, please check out the link below.  Thanks for your consideration!   Technology Connections on Twitter:   The Williams pinball machine references in the video:  (for those unaware, almost the entire pinball industry was in Chicago, with Williams, Gottlieb, and Bally all producing their machines here.  To this day, Stern pinball is located in the suburbs, having recently moved to Elk Grove Village from Melrose Park)  And thank you to the following Patrons! Charlie Quigley, Dakota Williams, Adam Erickson, Kevin Terrell, Tommi Hares, Trevor Smith, Thomas Fuchs, Callum Brieske, Tomas, Chuck Floyd, Eitan Tal, Emil Gilliam, Andy Copsey, Bitcore, Filip, Per 'Zapro' Jensen, Ward Sutherland, rn Arnarson, Alberto Amatucci, etho624, Chris Giddings, Tomasz Kolinko, Carles Codony, Samuel Plainfield, Jason McMillon, TeaChest Media, Michael Pacheco, Jason Ganiatsas, Mike Gerow, Marc Schroth, Andrew J Thom, Samuel Blakey, Mrpirate707, Frank Harris, Joseph Spiros, Patrick Meister, Sergey Kiselev, Clara Latter, Ashley Grant, Scott Emmett O'Donnell, Tianyu Ge, jeekl, rozboris, Kelly Rose, Paul Fisher, Stephen Vrazel, Applied Science, Peter ford, Sophie Haskins, James Id, Brendan Sheehy, Jay Foreman, Rich Theobald, Kyle Olson, Bryan Reid, Quinton Wilson, Jeremy DeGuzman, Sean Spark, Lucas Hartbarger, Taylor Cuzela, David Lastres, Granger Meador, Jeremy Kitchen, Jason Wellband, Shane Belaire, Paul Emmerich, Matthew Rossi, Paul Craigie, Alex Smith, Nick, Tyler, Paul Williams, Steven Hidy, Fredrik Grufman, Kollin O'Dannel, RJ Kent, Yona, Kevin Strehl, Tony DeSimone, Mike Bailey, Maggie Brown, Howard Kraut, TM, Mark Nicholas Wales, Jason D., T.J. Steckbeck, Pavlo Pravdiukov, Tobias Faller, Marco Anastasi, Peter Byrd, Trix Farrar, Matthew Razza, Mitchel J. Mullin II, Jakob Strande Langgaard, Jan Stavl, Paul Walton, Matt Falcon, Steven First, Denver Alexander, Conor Hennessy Sykes, FinaleGrande, Christopher Dickey, OnlyOneSolutionTBHFam, Matt Sackett, Tim Juchcinski, Wayne Marsh, Ernie Smith, foophoof, Stein Strindhaug, Hank Eskin, Brady Brown, Giacomo Scaparrotti, Winfield Trail, Luke Biddle, Marc Ethier, Joseph Hill, John Semander, Bill Basch, Robert Toth, Magnus Tranum, blouerat, PK, Richard Lindsey, Lars JJ, Patrick Musson, Matt Taylor, Johan Schoeman, Thomas Jew, Josef Citrine, Marcus Schwartz, Ryan Cozzubbo, Christopher Bassett, Julian Rapoport, Ed Hall, Jason Portwood, Jesse Cardone, Michael Snowden, Drew McClain, Boh00711, Jon-Andr Haraldstad, The8TrackKid, Daniel J Schless, Sebi Jecklin, Casey Kikendall, Craig Leverenz, Charlie Hankin, Andres Plaza, Revenge, Matthew Baron, Andr, Gerald Monaco, Tab Patterson, Jason Weathered, h.drew foy, Roger Beal, Gantradies, Chris Hartl, Steve Stone, Brian G. Shacklett, Colton Aubrey Hooke, Paul Mills, Christopher Luna, Kotanu, Brendan Terrett, Techmoan, Mike Mason, Elijah Reeds, Christopher Jett, Justin Talbot, Steven Metcalf, Verysofisticated, Lolucoca, John McLusky, Ashleigh R, Stephen Bell, Logan Beenken, Eric Wood, Stephen Pick, BlancoGrande, Matthew Giraitis, James Ryan, Robert Joscelyne, Ellis M. Eisen, Francis Fisher, Kedar Deshpande, Lukas Komischke, Dave Anderson, Felix Freiberger, Dane Peterson, Brent LaRowe, Aerospyke, Kieran Cox, Hunter Schwisow, Logan Kriete, Rafa Wiosna, Adam D. Ruppe, Audin Malmin, Eric Hansen, Noah McCann, Jason R Scheuren, Rufo Sanchez, The War Academy, Yaniv, neko, Daniel Ch, Lee Wallbank, Grayson Lang, Neil Bronner, Carl Yazbek, Jeffrey Grajkowski, Christopher Splinter, Eric Merrill, Stefan Berndtsson, Michael Sims, Seth Kneller, Clint Eisinger, Jesse G. Donat, Christopher Leidich, Mike Friedman, Svante, Andr Waage Srensen, Ed McCloskey, Philip Daniel, Jasper Thun, Camilo Rodrigues, Dusan Dzelebdzic, Sam Douglas, Sam Redfern, MagicMatteo",
    "description_links": [
        "https://youtu.be/UogqTenNrks",
        "https://www.patreon.com/technologyconnections",
        "https://twitter.com/TechConnectify",
        "http://www.ipdb.org/machine.cgi?id=1178"
    ],
    "transcript": "So I apologize for the shakiness, this is kind of an unplanned video. It's not often that you see me outside, but I'm actually gonna be borrowing the Bolt again today to do a little video for you. It is... hot today. It is about--it is currently 86 degrees and it'll go up to a high of 96 which is... this Celsius. And I'm going to take the Bolt EV back to my place, to work, and back which will be a total of 184 miles. All highway driving. And we'll see how it does. But before we go, I want to show you one thing here. Because it's so warm outside I'm gonna have the Bolt precondition itself. And I wanted to show--this is the charging station that it's on. And as you can hopefully see the charging station is not supply power to the car 'cause it's fully charged. So I'm going to use the remote to remote start the car and then the charging station will click on. [Clunk of contactor inside EVSE] Hear that big thunk? So now that orange light indicates that the charging station is sending power to the car. And very soon you'll hear the air conditioning running. [sound of A/C compressor spinning up] The Bolt has a variable speed A/C compressor--same as the Volt with a 'V', it's just more efficient that way and it can run any amount of refrigerant it needs to. So I'm gonna let the car run like this for about five minutes to get nice and cool. That way, right now it's pulling power from the grid; it's not using its battery at all. So by preconditioning the cabin like this we're gonna get a little bit better battery range. And then once it's cooled off, I'm gonna get in the car. We'll use my dashcam and I'll show you a bit of the drive that I'm taking. OK one more thing before I get going--I'm sitting inside and it's nice and cool in here but the car is not actually on and it is still plugged in. So I'm gonna turn it on 'cause I want to show you one thing. Some people are worried about this. [warning chimes as vehicle starts up] So I wanted to show you--notice how it says the charge cord is connected 'cause I'm still plugged in? It will not let me shift into gear. If I try... [warning chime] \"Conditions not correct for shift\" [warning chime] \"Charge cord connected\" So a lot of people freak out about what happens if you move your car while it's still plugged in. The answer is nothing! Nothing happens. Because it knows its plugged in and it won't let you move. So I want to apologize for the dashcam footage because the dashcam that is in this car-- I got dashcams for my mom and dad for Christmas one year, and it's the same one as in my car--and it's a wedge style dashcam. And there's a blue windshield tint on the Bolt and so it's looking through that a little bit. So everything looks pretty blue, and I'm gonna do my best to correct that. So this Bolt unlike probably many Bolts EVs spends a lot of time in rural areas on country roads like this one. This is IL-29. I'm heading North to get to I-180 to take me to I-80. My parents live South of I-80 and North of Peoria. And, well, we're just entering Bureau county right now so this EV spends a lot of time in a rural setting not anywhere near a city. We are about 120 miles away from Chicago right now. And part of why I want to make sure people understand that is because even for people in a rural setting, if they have access to a home charging station which can recharge the car in about 10 hours from empty... you know this car works for a LOT of people. I see so many comments about EVs \"They're city-dwelling car's only, you can't take them outside of the city\". This car doesn't even live in the city most of the time! It either spends some time with me in the suburbs or a lot of the time out here! This is not the city! So I have cruise control set to 70 MPH which is how its gonna stay for a good portion of this trip. 70 MPH is actually not idea for an EV's range because generally you want to stay to 65 or less, but I'm intentionally keeping it at 70 because I don't want to paint the picture that I am trying to hypermile here. I'm really not. I'm gonna keep up with traffic as best I can. And according to the car it is 89 outside, so we've got some nice toasty warm weather. This part here getting to I-80 is one of the most challenging parts for this car as far as range goes because--if you can hopefully tell in the dashcam--we're actually going at a pretty significant incline. Where my parents live is one of few areas in Illinois that aren't completely flat. It's still pretty flat but there are some river valleys around here. And, uh, so there's some pretty wild changes in elevation. Right now to go up this hill maintaining 70 it's taking 37-38 kW which is a lot of power. But now we are back to flat land as far as the eye can see. By the way, just as common courtesy you should do that. Like, if someone's on the side of the road for whatever reason move over for them. The person behind me didn't, and there's no one around me. Don't be a jerk. And by the way in Illinois if that's a cop or an emergency vehicle you HAVE to get over and if you don't you will get pulled over. Just ask my dad about that. Here we are on I-80, everybody's favorite. Big East-West Interstate, going from New York to California, all the way across. I think it's New York, maybe it's New Jersey. Uh, anyway, I'm not going to try and hypermile, remember? I'm keeping speed set to 70. If I pass a truck I pass a truck, if a truck passes me, a truck passes me. I'm not gonna follow one. I'm trying not to present this as a \"you have to be careful to drive an EV\" thing, I want to show you what it's like if you're just driving it like you would a car. So I've got cruise control set to 70 MPH, which is the speed limit. Yeah, you might be going a little higher than that on average but I will at least do that much. Well, that's not hypermiling by any stretch of the imagination but I will at least do that--get that little bit of range out of it. But now, we're on this road for the next 60 miles or so. We have just under 100 miles left in this journey and we'll see where we are when we get there. The temperature reading on the car is now 94! It's going up! Did you know that in Illinois there's a warp tunnel to Peru? It's right there. Just take that exit, you're in Peru. They even have a Menards in Peru. Oh you know, I should probably say I have the cabin temperature set to 71 F, so I'm... In my winter range test, I kept the cabin temperature pretty cold because I have a heated seat, a heated steering wheel and I was bundled up. Some people complained about that. Well now I have the temperature really comfortable. Perfect for driving, it's 94 outside but 71 inside--nice and comfy here. As we are moving into the 44th mile of this journey we have use 12.2 kWh which is, uh, a little worse than average. If we go with the EPA rating, 12 kWh should get us 48 miles. But we've used 12.3 and we've only gone 44.7 miles so we're a little bit behind but not a whole lot. Here in Illinois we also have a warp tunnel to Ottawa. Just go that way and find yourself in Canada all of a sudden. I'm about to be passed by a Tesla! I'll give him a nod. Hello! Eh, he seems unimpressed. He's also not running a front license plate, tsk tsk. OK, so I just noticed that--and I've heard some wind noise but you can see in the trees, or I could see in the trees of the right I'll have to back the footage up a bit, but I'm facing a pretty significant headwind. Which is weird because I'm going East. And usually if I'm going East there's a tail wind. But you know, sometimes... It seems every single time I want to do a range test in this car the wind condition is the wrong way. So we're still gonna be fine but just to give some context, right now wind is not helping me. It's hurting me. So keep that in your head while you're thinking about the range here. Every time I take this ramp there's a truck at the front going 25 MPH. Ugh. Come on in, Mr. 4Runner. Welcome to this lane. I bet you knew you needed this lane a long time ago but just now is when you decided to get in because ya know, that's how we do things! Oh, and thank you so much for letting me know you were exiting, I really appreciate that signal. We really have a model driver in front of us, ladies and gentlemen. Alright, so. We are now back and I'm parked in my garage just because I want to keep the car out of the sun. Just get that little bit, tiny bit of an advantage. But we weren't super efficient this time, we took 31.9 kWh to go 113.4 (miles). And that's probably...well I'll do the math 12.5% lower than what the EPA estimate would be. And, uh... I really did not account for the winds today I didn't think it was gonna be that windy. So I just want to point out climate settings was only 4% so, and I've said this a lot to people--air conditioning is not that big of a load for an electric car. So even though it was 94 outside for much of the commute--it got a little cooler once I get towards home but it was still about 88--I've been keeping the climate control set at either 71 or 72 and that was only 4% of the energy usage for this entire trip. So air conditioning is really not a huge deal. If we go to the main center cluster you'll see that it's predicting 98 miles of range remaining. And I have 70 miles that I need to go further. Now if I were a rational human being who wasn't doing this test I would plug the car in because I have 2 hours of charging that would give the car another 40 miles of range at least. But I'm not going to do that! Because I want to test this range and I really think it's gonna improve for my drive to work because I typically go a little bit slower and also we'll be going North-South rather than East-West, so we'll see what happens. Okeydokie. [Music from car intro screen thingamabob] Alright so I did not plug in the car--you'll notice it says \"Plug in to Charge\". And our range estimate actually went up by one mile because it realized that we went into a cooler place. So we are still at 31.9 kWh with a distance traveled of 113.4. Now we're going to drive 34.2 miles or something like that and then we'll see where that puts us. [sound of electric acceleration on the on-ramp] Alright so the trend line this early into this leg of the journey is right in the middle. There is no direction going up or down, but as we cut back in here we've gone about 6 miles. Our max range is 110 and our minimum is 76. Currently we're predicted to go 93. So I can see that the guess... I can see that the trend line is starting to creep up which I expected it to do so, especially because I looked outside and the wind around here seems to by dying down. I'm no meteorological expert but I did notice it was getting cooler as I headed toward my place which is closer to Lake Michigan and I'm wondering if there was a high pressure area over the lake as it always keeps the air above it colder because it's a big body of water, and maybe that was forcing air out towards the West and that's why I had the head wind. I don't know. But in any case the wind is much calmer right now, it's 93 out according to the car, and we will be up at my work within the next half-hour or so. Also, I should point out that I'm not taking a huge risk here. If there are people who are like \"Oh my God, range anxiety!!!\" I know two things, one my boss is fine if I plug in at work so if for some reason I get to work and there's way less range than I think I'll plug in, but two--the O'Hare Oasis which you keep seeing signs for has both a Level 2 AND a DC Fast Charging charger available for the car. So if I needed to on my way back I could just stop at the oasis. I've never actually used the DC fast charging on this car--I won't do it unless I need to. One day I'm gonna test that, but not right now. But it looks like that trend line is creeping up some more and driving conditions seem much more favorable. Also I'm trying to keep up with traffic in this lane. I'm not hypermiling but also people tend to go way faster than I want to on the Tri-State so I'm not gonna join the left lanes but I will stay here and keep up with the guy in front of me. I know I said I wasn't gonna hypermile and it may look like I'm hypermiling because I'm here in the right lane and everybody's passing me but if you're unfamiliar with the Tri-State...anything goes here. I am, to put it.... well I'm speeding. I'm going a bit over the speed limit. Everybody else is... Woah! Now in Illinois we have laws where you need to follow traffic flow so really I'm going under the \"speed limit\" but, ugh. I'm just in the right lane because I don't want to go a fast as the other people are going. Alright, I am now at work. And that is our final, we are actually just at 40 kWh used which is 2/3 of the battery. We went 148 miles so that means we could go 50% more assuming we have the exact same average efficiency we had so what would that be? 74 on top of that, so about 221 or so. Which is actually right about what it predicted when we first turned on the car. So then going over to the speedometer cluster area we are at a minimum of 61 miles, predicted 75, and if you recall it said that--we started at 100. So the range meter only went down 25 miles even though we drove 34 and that's because it was just more efficient driving this time and we weren't facing that wind. And still, our climate settings have now accounted for 5% of our usage but still that's very very little and I'm still keeping myself comfortable even though the temperatures are in the 90's. Alright so I just got out of work. Yes I work in the evenings. It sucks. I drew the short straw working this particular time on Memorial Day, but let's see where we're at. It is showing 78 miles. It's not exposed right--there we go. 78 miles. So let's turn it on. That's better. Alright. So we have 34 or so miles ahead of us. I'm sure we'll make it. OK now that we are back on the Tri-State headed southbound, I normally keep my speed to 68 on this segment and then I slow down a little bit as I get towards home. I don't have traffic to keep up with because it's late at night so I'm just setting the speed that I always do. And again, I'm not trying to hypermile here I'm not gonna follow a truck. Yeah I'm going a little bit slower than the average person, but really not that much slower. And we will see what sort of range we have when we get home. So, uh, we'll do a bit of a time warp. So I took us out of warp speed because I wanted to explain for those who have never been to Illinois--the oasis that I was mentioning that has the charging station that we're about to go under, it's more obvious what it is at night. I don't know...they've been around for many decades, in fact there's a Williams pinball machine from I believe the 1960's called \"Highways\" which has one of these oases on its backglass. There's some trivia for you. But anyway, these highway oases are on the tollway here and it's got restaurants and stuff. And it's built above the tollway as an overpass--it's kinda cool. So you can see Auntie Ann's and Starbucks maybe in there. And, so... do other states have those? I don't know. Not all of them in Illinois are built over the road like that, some of them are just off to the side. But the ones that are built over the road, you know you uh... depending on which direction you're going you enter through one door or the other. And you can't turn around which kinda stinks but you wouldn't really need to in most circumstances. But anyway, that's what the highway oasis was and over there by the Mobil gas station there is a DC fast charger. I have not used it myself but I have seen it and people on Plugshare have rated it so that would've been there as an option. But as it stands I'm still showing 56 miles of range remaining and I'm more than halfway home so no need to stop. Aright, we are now back home and we have gone 183 miles today which took 48.8 kilowatt-hours. And the car thinks we will be able to do another 47. The trend line was pretty high up towards that max 55 but that's because I was going less than 60 MPH for the last bit of this journey. But, uh, if we do our little math here... Uh, the EPA estimated range of this car is 238 and we are... oh man I'm so bad at math in my head. ...223... OK we would have gone 230 so we're actually only 8 miles shy of the EPA estimated range assuming that our efficiency stayed what it is because we were going 40... If we had 47 left, with the 183 that we did we would be a 240... no (guffaw) 230 miles so that's only 8 miles off. I am bad at this. So this is gonna cost me about $5.50 in electricity, so not bad. We did 183 miles of driving on $5.50. I also wanted to show you the experience of plugging it in. Because, you know, people feel like this is so hard. There's the charge port. I actually have like the hardest way to plug in of anybody because my charger's all the way over here. And I gotta unfurl the cord. And we're just gonna walk back to the car... And, plug it in. And just for your enjoyment you're gonna hear a bunch of sounds. You're gonna hear some relays clicking, you're gonna hear the actual charging station back there make a big THUNK, and the car's gonna make a couple other weird noises. And then, it beeps. Just push that in. [click] [THUNK] [other odd sounds] [beep] So incredibly complicated. And then the car will tell you when you open the door when it will be done charging. Its estimate is going to move up a little bit. Oh, I have found a bug. Let me close the door. [startup music] It does that a lot. OK. So it says that the charge will be done by 8:30 AM and, uh. Often times that estimate will go up a little bit as I plug in because this is a 32 amp charger but it's only on 208 volts. So it's actually a little bit slower than my parent's charger even though the charger itself--the Clipper Creek HCS-40--is a larger charger. It's on 208 rather than 240V so it charges a little more slowly. So maybe they actually--the car's software was updated over the air recently and I don't know if it affects the instrument cluster but maybe it did. In the past it used to be you would open it after I plug in and it say \"charge complete by 7:00...7:15...7:30...7:45\" as it realized it was on a lower voltage but today it didn't do that. So I hope you enjoyed this video on the Chevy Bolt EVs summer driving range. Although it missed the EPA estimate by just a hair, I think its still pretty impressive since for much of my drive the car was facing a headwind, and all of the miles were strictly highway. Unlike a conventional car, an EV does better in stop-and-go city driving because it can use regenerative braking. On the highway, theres no braking going on so its range will drop. This partially explains why the EPA range estimate for Electric Vehicles is so much more conservative than the european or asian estimates for the same vehicle--being so spread out in the US, highway range is more important here. Anyway, thank you very much for watching, please check out my Twitter feed if youre into that, and a peek at my Patreon page would be much appreciated if youd like to support what I do on this channel. Ill see you next time.",
    "transcript_keywords": [
        "car",
        "miles",
        "range",
        "bit",
        "time",
        "charging station",
        "Bolt",
        "charging",
        "back",
        "people",
        "lot",
        "plug",
        "Illinois",
        "station",
        "EPA",
        "wind",
        "work",
        "pretty",
        "speed",
        "driving"
    ],
    "transcript_entity_values": [
        "the O'Hare Oasis",
        "2/3",
        "7:00...7:15...7:30...7:45",
        "just under 100 miles",
        "2 hours",
        "Ottawa",
        "4Runner",
        "Williams",
        "this early",
        "East-West",
        "70 miles",
        "two",
        "North",
        "68",
        "I-180",
        "West",
        "65",
        "Bureau county",
        "about 221",
        "76",
        "90",
        "late at night",
        "25 miles",
        "I-80",
        "40",
        "110",
        "one",
        "Canada",
        "Plugshare",
        "Bolt",
        "94",
        "31.9 kWh",
        "47",
        "50%",
        "34 or so miles",
        "184 miles",
        "Menards",
        "New Jersey",
        "only 4%",
        "223",
        "208 volts",
        "many decades",
        "238",
        "34.2 miles",
        "32",
        "about 88",
        "48 miles",
        "F",
        "North of Peoria",
        "44.7 miles",
        "86 degrees",
        "8:30 AM",
        "12 kWh",
        "56 miles",
        "113.4 (miles",
        "another 40 miles",
        "70",
        "South",
        "5.50",
        "IL-29",
        "the european or asian",
        "75",
        "12.5%",
        "first",
        "about $5.50",
        "230",
        "100",
        "Highways",
        "I-80",
        "1960",
        "summer",
        "98 miles",
        "48.8 kilowatt-hours",
        "Chicago",
        "Lake Michigan",
        "Level 2",
        "the next half-hour",
        "New York",
        "Christmas one year",
        "Patreon",
        "today",
        "about 6 miles",
        "kW",
        "EV",
        "71",
        "one mile",
        "less than 60 MPH",
        "40 kWh",
        "the Bolt EV",
        "Starbucks",
        "Ann",
        "Electric Vehicles",
        "12.2 kWh",
        "the Clipper Creek",
        "Big East-West Interstate",
        "12.3",
        "only 8 miles",
        "44th",
        "25 MPH",
        "DC",
        "5%",
        "34",
        "55",
        "37",
        "the Chevy Bolt EVs",
        "about five minutes",
        "East",
        "Bolts EVs",
        "North-South",
        "74",
        "183 miles",
        "Volt",
        "Memorial Day",
        "96",
        "148 miles",
        "THUNK",
        "Tesla",
        "89",
        "the next 60 miles",
        "78 miles",
        "70 MPH",
        "about 120 miles",
        "70",
        "EPA",
        "California",
        "US",
        "Illinois",
        "113.4",
        "72",
        "93",
        "One",
        "208",
        "about 10 hours",
        "61 miles",
        "Mobil",
        "240",
        "230 miles",
        "Twitter",
        "183",
        "Peru"
    ],
    "transcript_entity_types": [
        "LOC",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "TIME",
        "GPE",
        "PERSON",
        "PERSON",
        "DATE",
        "LOC",
        "QUANTITY",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "ORG",
        "LOC",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "TIME",
        "QUANTITY",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "GPE",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "LOC",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "LOC",
        "MONEY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "DATE",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "GPE",
        "LOC",
        "EVENT",
        "DATE",
        "GPE",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "FAC",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "LOC",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "GPE",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "LOC",
        "ORG",
        "LOC",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "FAC",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "GPE",
        "GPE",
        "GPE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "GPE"
    ]
}