{
    "id": "Ko75zhPwKks",
    "title": "NEW 2018 iPad Pro Unboxing! 12.9in Space Gray 1TB!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-11-08T00:10:31Z",
    "video_url": "https://www.youtube.com/watch?v=Ko75zhPwKks",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "ipad pro",
        "12.9 in",
        "unboxing",
        "review",
        "screen",
        "procreate",
        "illustration"
    ],
    "views": 4239732,
    "likes": 101182,
    "comments_count": 13448,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "Justine - Hello! Oh boy! Today is the day that the iPad Pro is released. I'm actually in New York right now, I have no idea what this video looks like because I forgot my little monitor so the only way that I can kind of see you guys is there's a mirror, but you're, so I have to go like this to see in the mirror to see you. It's really quite silly. But I wasn't home to be able to get my iPad that I ordered, and it's great that I wasn't home because I actually forgot to pre-order. I ordered an engraved pen, I ordered the Folio Pad, I ordered a case, I ordered everything except the iPad because what I thought I had done is ordered the iPad first but then I got side-tracked by engraving my pen and tweeting and a lot of different things. But I'm here, I'm in New York, and I got a chance to see the temporary 5th Avenue Apple store, and I feel like that 5th Avenue store has been under construction for a really long time. So anyway, I went in today, got some goodies. Pretty hyped about it. Can I even see myself? Is this over-exposed? Who knows. I'm actually in New York to go to Good Morning America. Be sure to look for me on the show if you watch, or if your mom watches, or if you have family that watches, tell them that you know me. Tell them that we're friends, if you need me to send a tweet to say that were friends, to confirm it, tweet me, I will do that for you. Pencil. What did I call, did I call it a pen earlier? I'm not sure, I'm delirious. I honestly don't know when the last time was I slept. I think the last time I slept was when (mumbles). That was a long time ago. iPad Pro. Smart Keyboard Folio! We've also got some dongles because something that's pretty exciting about the iPad Pro is it does feature USBCs, so with USBCs you can do so many more things than you could previously with Lightning. So you can actually use your iPad Pro to charge your iPhone. I need to take my shoes off, I gotta get comfy. This is a real chill unboxing and I hope that you enjoy it. I hope I'm even recording, I don't even know. So this does feature USBC, you can also use an external monitor. Probably should not have returned mine and just kept it because it's times like these. (fuzzy music) It's times like these, You learn to love again. Oh man I love the Foo Fighters. Where was I (laughs)? We're going to un-box now, I promise you. If you can make it to the end of this video, congratulations. I mentioned this in my iPad Air video but just in case you missed that video, be sure to go check it out. Jonathan and I are doing another giveaway of either an iPad Pro or a MacBook Air, whichever one you guys want. In addition to our iPhone 10r giveaway. So we're gonna be announcing those winners at the same time, so if you wanna go check it out, check out Jonathon's channel, check out my channel, subscribe to both, like our videos and we'll be choosing the winners very, very shortly. Here's the problem with traveling: I don't have a knife. I didn't check a bag so I couldn't travel with a knife. So this is knife-less un-boxing, hope that you understand. I hope that this is even in focus. This could very well be in manual focus for all I know. This could be the worst thing that I've ever done. No, that's not true, cause' I've posted a lot of crap on the Internet. If you guys aren't already subscribed to my channel please do so because I'm working on a really fun iPad Pro video. This is just the unboxing, but I really want to test out the capabilities for actual artists and creators because I don't really use this for illustration but I have a friend who does, so he is going to be creating a really cool illustration for you and showing you guys how a real creative artist actually uses an iPad, other than me, who watches Netflix and workout videos and spills Doritos all over it (laughs). This thing looks so good, I saw it at the Apple store and it's always so cool going into Apple stores because sometimes, a lot of you guys, you don't really know what to say when you see me there, or you don't think it's actually me so then you ask questions like, 'hey so do you make Youtube videos?', I'm like 'yes, I am, give me a freakin' hug!' Get a good look at this. (plastic tearing) You look great. So this is the one terabyte version, which is absolutely absurd. What am I gonna do with a one terabyte iPad? I'm asking myself the same question. It smells like a vanilla-spiced latte with a hint of cinnamon, wow are you delicious! So there's the camera and if you are completely new here and haven't seen any videos about the iPad Pro yet, this is the 12.9 inch model. This is the one terabyte version, they also have one with cellular and wifi. I usually end up just doing things off of wifi or tethering with my phone, so this is the wifi model, one terabyte of delicious, delicious storage. This features the new A12 X Bionic Chip. There's no home button so it now does feature face ID. So this really is, kind of just like, a really massive iPhone and the screen looks so good! Quick start, so if an iPhone or iPad running iOS 11 or later, bring it nearby, alright. Set me up, baby! The new Apple Pencil now features gesture controls so if you are an illustrator or somebody who does those kinds of things, I think this will be super helpful because you can switch through brush strokes and different things and you don't actually have to go into menu settings or anything! You just, double tap. Okay let's set this up to the hotel I'm in, this hotel is incredible, by the way, the lighting is not ideal for shooting but everything else is amazing. Give me my complimentary wifi please. So it's saying that it might take a few moments to activate my iPad. Don't worry, I have all the moments that you need so take your time. I don't actually have that many moments because I'm hungry and I wanna go get dinner so don't take too much time. Face ID, I'm setting up face ID on this massive tablet! How am I, this is so huge! I can't even imagine what people next door might think that is happening in here. I'm just unboxing an iPad if someone can hear me, don't be concerned. Okay, you set up my Apple ID, I'm going to show them something else, so I'm talking to my iPad like it's a person. Are you surprised? What else do we have in the box? We've got, wowee! So, well I was trying to act surprised but I'm not really good at faking my emotion. These stickers I actually saw Jonathon un-box and he made note of how massive these stickers are. They are much larger, I feel like, than the previous versions, I don't have any with me, to compare. So we've also got a USBC cable and, oh! Look at this. This looks like all of the charging bricks that come with all of the Google accessories, but this is an all new charging brick, I've never seen one of these from Apple before. It's so dark in here, or I'm old, but I can't read the voltage on it so, uh, shit, we into the retirement home. How am I supposed to comfortably show you this? This is so ridiculous and I'm loving every freakin' second of it! Brightness is turned up. So I guess I should, I don't know what to do now. I should probably download Procreate. So let's see what else we have. So this is their new keyboard. This is something that I would need my knife for. But I don't have one. Do you know how many knives I've had taken away from me at TSA? Probably like 14. I even had my tactical knives taken, like come on, let me take that through. I'm not gonna do anything (sighs). So I ended up getting the Space Gray one. Everyone was joking, their like, well Justine, how are you going to survive without not having a gold iPad? I don't know how I'm going to survive but I think I'll be okay. Look at you, oh! Fancy, hello! Anything else in here? So it has a little magnetic little docking station here, so that's actually how it stays put and then it has two different settings here. So there's one. If it's on your desk, and here is two, that is really in there. That's good, that's nice! And this second little setting, if its on your lap. Well, I think I'm way more into this iPad than I thought I was gonna be. Oh, now I'm like hyped for my flight back. I'm just going to be sitting there like can somebody please talk to me about my new iPad? Does anyone wanna talk about it? Cause' it's here, can we chat? Do you wanna be my friend? Here's a little test. Can you see? Hello, I am typing (laughs). This feels nice, oh wow! I like it. It's a nice feel. Yeah, I'm into that. That's a nice type, that's a very nice type. (typing) Gosh, maybe I'll respond to my emails now. It's now onto the pencil. This is the Apple Pencil two, this features gesture control and you can now magnetically attach it to your iPad. I don't know if you guys remember, well (sighs), if you have an iPad and you have an Apple Pencil and you charge it, there's no way that you'll ever forget how you had to freakin' charge that thing, like you would just jam it into the lightning cable at the bottom then you would have this pencil sticking out of your iPad and it looked absolutely ridiculous. I don't know what they were thinking, I honestly am not sure for whatever reason. It still worked and the Apple Pencil is incredible and I think it's such a cool device. We love the pencil, we've got some paperwork. Wouldn't that be great if they had little, mini stickers in here, I know it would be a surprise, I'd be shocked. I also got one of these and I got my name engraved in it. I don't know why, it said, 'do you want the free engraving' and I said yes. Here we go. Oh, there's still something on this. (crinkling) Okay (laughs). Now, witness my friends. We even had, oh wow that was great. Look, look what it's doin'! Look, it's doing something! Apple Pencil, connect, yes I wanna to connect it! No way! I'm actually left-handed, so. Whatever. So I'm an artist, as you can see, this is what I like to call: mistakes were made. (laughing) So if you like, prints will be available, I'll put a link in the descrip- I'm just kidding. I'm not actually, actually I probably should print this out because it is the best thing I've ever seen. Mistakes were made. You probably can't see it, I can't even see it. Is this video even recording (laughs), I don't know! Let's put that there. God this pencil (sighs), this iPad's really beautiful. This is a USBC to SD card reader, so because this is USBC, you now can use USBC dongles, so accessories, like this, and I'm also excited about this. Why did it take Apple so long to make a USBC SD card reader? (scoffs) I don't know! But it doesn't matter, they have one now. So you can use this to transfer footage to your iPad pro. This is one of the Thunderbolt three USBC cables so this will be able to transfer data much quicker and then what is this for? This is the USBC digital AV Multi-Port Adapter. So this will allow you to have an addition USBC port and HDMI and just a regular USB port, so this is actually quite nice and I'm kind of excited because I can use these with my MacBook Pro, cause' I will never say no to a USBC dongle. (gasps) look at this! I freakin' love technology. I love the future, where we are right now is such an incredible time because I feel like we are on the verge of so many incredible things in the next, I was going to say the next five-ten years, but even in the next year. Car tech, AR, VR, so many amazing things. If you guys stay subscribed to my channel you may get to see some of it. Oh I also went into the Lego store today. I bought myself a New York luggage tag, just this Lego New York, uh, body, cause' I didn't really need anything else, just thought I'd bring this back home, to put on my Lego mini figures. Don't ask. So now with face ID on the brand new iPad, the iPhone, that just leaves the MacBook and the iMacs to also start integrating face ID. So that's going to be pretty cool. It's kind of interesting that they haven't really done that already, I mean it's not that shocking because it probably would increase the price of those machines, as is. I'm so excited to shoot my more in-depth video with this. It's gonna be really cool and I'm so excited to share with you from someone else's perspective, on what it's like to use an iPad and also I want to do some AR demos, so there's so many other things that I would love to do with this, so if you guys have any other suggestions on things that you might like to see, leave those in the comments below and I will see you very, very, very, very soon. Probably in like, a few days, cause' I have to shoot and edit the video but if you happen to be watching Good Morning America tomorrow I'll see you there! Bye! (calm, ambient music)",
    "transcript_keywords": [
        "iPad Pro",
        "iPad",
        "Apple Pencil",
        "Apple",
        "USBC",
        "iPad Pro video",
        "Pro",
        "Pencil",
        "things",
        "video",
        "time",
        "York",
        "iPad Air video",
        "guys",
        "Good",
        "ordered",
        "Avenue Apple store",
        "fun iPad Pro",
        "Apple store",
        "Good Morning America"
    ],
    "transcript_entity_values": [
        "the iPad Pro",
        "TSA",
        "A12 X Bionic Chip",
        "Apple Pencil",
        "AV Multi-Port Adapter",
        "second",
        "MacBook",
        "Jonathan",
        "iPad",
        "one",
        "USBC SD",
        "New York",
        "5th",
        "iPad Air",
        "the next year",
        "wowee",
        "AR, VR",
        "Apple",
        "14",
        "Justine",
        "Youtube",
        "the Folio Pad",
        "a few moments",
        "iPad Pro",
        "iPhone",
        "Today",
        "USBC",
        "Good Morning America",
        "three",
        "the day",
        "MacBook Pro",
        "the iPad Pro",
        "un",
        "the Apple Pencil",
        "five-ten years",
        "Lego",
        "Google",
        "Lego New York",
        "Netflix",
        "Procreate",
        "the Foo Fighters",
        "Jonathon un-box",
        "Jonathon",
        "iPhone 10r",
        "one terabyte",
        "Justine - Hello",
        "Apple Pencil",
        "SD",
        "today",
        "iMacs",
        "5th Avenue",
        "two",
        "12.9 inch",
        "MacBook Air",
        "11",
        "a few days",
        "iPad Pro",
        "first",
        "HDMI",
        "tomorrow",
        "Doritos",
        "USB"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORDINAL",
        "FAC",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "FAC",
        "TIME",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG"
    ]
}