{
    "id": "kP3ak83ASjU",
    "title": "Palm Phone hands-on: an Android phone for your phone",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-10-15T12:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=kP3ak83ASjU",
    "category": "Science & Technology",
    "tags": [
        "palm",
        "android",
        "palm phone",
        "phone",
        "hands on",
        "first look",
        "new phone",
        "smartphone",
        "new phones",
        "phone unboxing",
        "unboxing",
        "iphone",
        "apple",
        "2018",
        "best android",
        "verizon",
        "cellular",
        "processor",
        "dieter bohn",
        "the verge",
        "android pie",
        "android apps",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "phone review",
        "is it worth it",
        "pre order",
        "review",
        "google",
        "verge"
    ],
    "views": 1035854,
    "likes": 14650,
    "comments_count": 2229,
    "description": "The Palm phone is basically a tiny phoneto go with your everyday phone. A San Francisco startup has bought the Palm name, but can they keep the ethos? This new Android phone they're releasing exclusively to Verizon is meant to be your secondary device, a tiny little thing for the weekends. Our question  does your phone need a phone?  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey everybody, I am Dieter Bohn, And if you are of a certain age you know that means that I am the Palm guy. I used the Centro, I used Pixi, I used the Pre. I founded precental.net, I was all about webOS, I was all about Palm. Then it died, but now it's back. Not the company but the name Palm. It's coming back as this little thing that I was hiding in my hand. It's a tiny little phone to go along with your big, huge, honking phone. Well what's all that about? (upbeat music) So, this is the Palm phone, and the basic idea here is you don't want to carry around your big, giant phone. So, you can have this little weekender phone, and it uses Verizon's dual number system. So, you pay an extra ten bucks a month, and that allows you to have this phone, share your phone number and also share text messages. So, you can leave your other phone behind, which is a great idea, except there's a couple of caveats. If you're an iPhone user, your iMessages obviously won't come over. If you're an Android user, you're gonna need to use Verizon's custom text messaging app instead of the built in Android messages in order to get your messages. The other question you're probably asking is, what's the deal with this phone? Well, it's an Android phone, and the basic navigation works this way. There's a single, solitary button on it. You press it, it turns the screen on, you swipe up to unlock it. If you double tap it, it will launch the Google Assistant, and it will listen to your voice and you can do voice stuff. They did that because they figured it's a lot faster, you're gonna wanna be doing a lot of voice stuff. Now, there are no soft buttons on the bottom, and so there's this one, single, solitary button, and it works one of three ways. So, if you tap it once it serves as a back button. If you double tap it, it goes home, and if you long press it, it takes you to this overview screen. They have built in a custom face unlock feature into the camera, but I'm sure it's nowhere secure as Face ID on the iPhone. So, you can just use a standard unlock pattern if you want. The screen is 3.3 inches and it actually looks pretty good. It's not too bad, and for the basic stuff that it's meant to do, it's relatively fast. Although, it is Snapdragon 435 processor with 3 gigs of RAM and 32 gigs of storage. So, this isn't exactly a powerhouse in terms of specs. As far as Palm, the new Palm is concerned, you really are just gonna be using a few different apps with the same bopping in and out. So, it can run any Android app, because it's running Android 8.1, but really they expect you're just gonna use it for music, maybe a little Facebooking, navigation, that sort of stuff. Really simple, weekender phone stuff. (upbeat tempo) Now there is a camera on this, it's a 12 megapixel camera on the back, and I'm sure it's no great shakes. We haven't looked at it on a big screen, but on this tiny screen it looks fine. There's our conference room. If you wanna adjust volume, you need to go into the quick settings thing. Now the other thing I'll notice when I'm in the quick settings things here, is there is this Palm button. This is where we start to get into why this is a little bit more like an old Palm phone, at least why they claim it is. So, when you turn on Life Mode, which is what they call it, this basically acts as both battery saver and do not disturb at the same time. So, when this mode is on, you turn the screen off and no notifications will come in. And in fact, they turn off the radio so not even phone calls will come in. So, this thing should last a very, very long time in this mode. It's only got an 800 milliamp battery in it, but if you have this mode on the thing will probably just hang out, it's inert forever. The other sort of cute little Palm thing is they've made this shortcut on the lock screen where you swipe up and you get this little graffiti area with four buttons on it. Then you can do a search for C, if you wanna do the clock. Or you can jump right into the camera or messaging, whatever. The home screen here, it is just an app launcher, there's not two different things and it's in this honeycomb pattern. You can, of course, move stuff around, drag it around, install it. You'll notice here, I long pressed on an item, that brings up shortcuts to jump directly into things inside the app. It's a really underused feature in Android, and I'm really glad they sort of foregrounded it here. That even works from that lock screen, so if I were to go here and write an S, it'll jump into different shortcuts inside the app. So, jump right into scan inside the camera app, for example, or the drive app. So, that's kinda neat. (upbeat tempo) I know what you're thinking, Dieter, is this really a Palm phone? I mean, it's got sort of a Palm logo on it, but it's not running webOS and the only really Palm thing about it is that a bunch of other Palm phones have been tiny. Yeah, you're right. You should almost think of this more as a really big Smart Watch than a really little phone. You can't buy it on it's own, it's actually sold on a connected device plan, so it's an extra 10 bucks a months. It's 350, or you can get it on 15 bucks a month on a installment plan. It can do more than a Smart Watch 'cause it can run every single Android app, but it can do less than your phone, 'cause it's got a tiny screen and you're not gonna wanna spend that much time on it. That's kinda the whole idea here, is this is meant to be a time well spent phone. It's a phone that you turn on, do a couple things, turn off and ignore. You can even turn on that Life Mode thing and completely ignore it entirely. So, it's sort of like a back up plan to your phone. Is that worth 10 bucks a month? Maybe. (soft techno music) Thanks so much for watching, we're gonna have a whole lot more about this thing, including a review, when it comes out in November. In the mean time, you should subscribe to the channel now, 'cause we've got a whole bunch of Pixel 3 content.",
    "transcript_keywords": [
        "Palm",
        "phone",
        "Palm phone",
        "Dieter Bohn",
        "Android",
        "screen",
        "thing",
        "Palm thing",
        "app",
        "Palm guy",
        "Bohn",
        "Android app",
        "turn",
        "stuff",
        "Mode",
        "things",
        "back",
        "Android phone",
        "camera",
        "Palm button"
    ],
    "transcript_entity_values": [
        "iMessages",
        "November",
        "Android",
        "one",
        "four",
        "Verizon",
        "three",
        "3.3 inches",
        "15 bucks",
        "Palm",
        "Google",
        "Dieter",
        "a Smart Watch",
        "Pixel 3",
        "800 milliamp",
        "Smart Watch",
        "3",
        "Centro",
        "Palm",
        "Life Mode",
        "webOS",
        "two",
        "Dieter Bohn",
        "10 bucks",
        "an extra ten bucks",
        "12 megapixel",
        "32",
        "iPhone",
        "8.1",
        "350",
        "RAM",
        "Snapdragon 435"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}