{
    "id": "KRF8JkQSbu0",
    "title": "This adorable robot needs you more than you need it",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-01-10T18:48:57Z",
    "video_url": "https://www.youtube.com/watch?v=KRF8JkQSbu0",
    "category": "Science & Technology",
    "tags": [
        "lovot",
        "groove x",
        "robot",
        "robots",
        "robotics",
        "ai",
        "dami lee",
        "ces",
        "ces 2019",
        "cute robot",
        "smart home",
        "lovot robot",
        "anki",
        "vector robot",
        "event",
        "family friendly",
        "smart robot",
        "2019",
        "tech news",
        "home entertainment",
        "first look",
        "hands on",
        "is it worth it",
        "consumer electronics show",
        "ces 2018",
        "desktops",
        "new tech",
        "gadgets",
        "technology",
        "review",
        "tech review",
        "tech",
        "top 10",
        "latest updates",
        "did you know",
        "apple",
        "google",
        "android",
        "iphone",
        "verge",
        "the verge"
    ],
    "views": 124031,
    "likes": 2182,
    "comments_count": 241,
    "description": "The Groove X Lovot companion robot isnt useful  itll actually get in your way. Most robots promise to make your life easier, but Lovot is the opposite. The fuzzy little robot scoots around, following its owner through advanced AI capabilities and sensors. It can recognize up to 1,000 people, and when it spots someone it likes, it flaps its arms up, begging to be hugged. Its specifically built to form emotional attachments, its only purpose to be loved.  Read more here:   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Listen to our podcasts:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2VKgEpj",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- CES can be a lonely place. Sometimes you witness things that you just can't understand. You try everything you can just to feel something but at the end of the day, all you need is a friend to come home to. (soft music) This robot needs you more than you need it. Its only purpose is to be loved. Unlike other robots that promise to make your life easier or help out around the house, the Lovot really just is like a baby for you to take care of. It follows you around and makes little cooing sounds and when you're not paying attention to it, it'll come up to you and beg you to hug it. Its cuteness really comes from these big eyes. It's like scientifically designed to be cute. There's six layers of projections in the eyes to create depth so when it looks up at you and asks for a hug, you better hug it. Okay. Hi. He's laughing. Like you can literally boop it on the nose and it'll respond like it doesn't get any better than that. It weighs the same amount as a toddler and when you cradle it in its arms, it'll fall asleep. So he's sleeping. (shushes) The baby is sleeping. So as far as the tech goes, there's a Kanisawa top with the microphone and the camera and there's over 50 sensors on its body that react to touch and it's also warm so it's not cold like a machine but besides that, it's not really overloaded with any tech. It doesn't have Alexa, it can't speak, so it's not super useful but then again, neither are your cats or dogs. The AI can recognize up to a thousand people so if you're not nice to it or you treat it roughly, it'll remember that and avoid you next time. So one of the downsides is that the battery life isn't that long. It's only about an hour and this is just a prototype but when the final version launches, it'll know automatically to go to its charging dock. The second downside is the price. This little guy goes for three thousand dollars which is kind of crazy but that's the price you pay for companionship. It's becoming more common to use robots as therapy companions in countries like Japan and for comparison, Paula the therapy seal cost five thousand dollars. But if money's not a deterrent and you still want to get your hands on this adorable robot, then the Lovot is supposed to launch in the US some time next year but it's not confirmed yet. I love you. I'm gonna call you Demi Lovato. (coos)",
    "transcript_keywords": [
        "lonely place",
        "CES",
        "hug",
        "place",
        "lonely",
        "thousand",
        "witness things",
        "thousand dollars",
        "Lovot",
        "robot",
        "robots",
        "eyes",
        "sleeping",
        "Demi Lovato",
        "baby",
        "life",
        "price",
        "tech",
        "dollars",
        "time"
    ],
    "transcript_entity_values": [
        "three thousand dollars",
        "next year",
        "one",
        "Lovot",
        "AI",
        "Paula",
        "US",
        "six",
        "the end of the day",
        "Alexa",
        "thousand",
        "coos",
        "Japan",
        "Kanisawa",
        "second",
        "over 50",
        "only about an hour",
        "five thousand dollars",
        "Demi Lovato"
    ],
    "transcript_entity_types": [
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "MONEY",
        "PERSON"
    ]
}