{
    "id": "KULe3WQZvjA",
    "title": "Get a WAIFU and a Wireless Keyboard!!! - NuPhy Air75",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-11-12T19:06:04Z",
    "video_url": "https://www.youtube.com/watch?v=KULe3WQZvjA",
    "category": "Science & Technology",
    "tags": [
        "Nuphy",
        "Air75",
        "Keebs",
        "Keyboards",
        "Customize",
        "Peripherals",
        "Mac",
        "PC",
        "Switch",
        "Wireless",
        "Gateron",
        "Low Profile",
        "Waifu",
        "Wif",
        "Wife",
        "Anime",
        "Cartoon",
        "Typing",
        "RGB",
        "switch",
        "hot swap",
        "Gaming",
        "Speed",
        "Mac Address",
        "First Impression",
        "Unboxing"
    ],
    "views": 719921,
    "likes": 21457,
    "comments_count": 935,
    "description": "Buy a Seasonic Ultra Titanium PSU On Amazon:  On NewEgg:   Waifu and keyboards, that's like peanut butter and chocolate! The Nuphy Air75 is a customizable hot-swappable keyboard that works with PCs, Macs, and almost anything in between especially since it's wireless. Check out the keyboard and find new love while you're at it.   Check out the NuPhy Air75 Keyboard at   Buy Logitech MX Keys Mini On Amazon (Paid Link):  On Best Buy(Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS: ---------------------------------------------------   0:00 - Waifu Intro! 0:31 - Unboxing 1:44 - Keyboard overview 4:39 - Found Waifu Love and instructions 6:21 - Key swap impressions 7:40 - Carrying Case impressions 8:56 - Sponsor - Seasonic 9:24 - Mac user keyboard impressions 11:44 - RGB impressions 12:01 - Typing impressions 12:14 - Final thoughts",
    "description_links": [
        "https://geni.us/q4lnefC",
        "https://lmg.gg/8KV3S",
        "https://nuphy.com/products/air75",
        "https://geni.us/MzKGeo",
        "https://geni.us/Wb67tIT",
        "https://geni.us/AmVRJVY",
        "https://geni.us/EPFO",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- So I feel like I want the loudest clickiest keyboard if I'm gonna do any of this business. - Ok. - Yeah. - Do you need a keyboard and a new Waifu? NuPhy thinks you do. And, they've got the new NuPhy Air75 wireless mechanical keyboard. It's got the world's thinnest spherical PBT keycaps. And this thing is pretty thin in general. It's got I think, 16 mm at the thinnest point or something like that. Let's open it up and get you guys a few more shots of it. I don't even know what her name is. - [Jono] NuPhy. - Yeah, just NuPhy probably, right? Yeah. Okay, so yeah, you got your keyboard here. This little box. These are just accessories, probably. I think it comes with like, you know, switch puller and keycaps and cable. Oh, and it's got feet. Yeah, so this thing has detachable feet, which is pretty cool. They're magnetic. So, you don't have to... like they're trying to make it thin wherever they can. So they can't even like flip up the feet. They've gotta put 'em on magnets so that they're detachable and you can put them on as you want. 'Cause you know, you need this thing razor thin to travel with or whatever, (coughs) whatever you wanna do. It's an Okay cable. Nothing special. USB 80 USB-C. Oh, okay. Sample switches. So, oh, so it's using these low-profile gaterons, I think. So they've got red, blue and brown gaterons. Super thin low profile like, look at that. That's great. The USB dongle is not labeled. So, be careful you don't lose it otherwise you're not gonna know what it's for. Or I guess if it's the only unlabeled stick you have, you'll know it's for your NuPhy. All the reviews I was reading were like pretty decent and yeah. Even just holding this thing, like, it's pretty nice. It's not perfect but for the thinnest keyboard around, or at least, you know, one of the thinnest mechanical keyboards around, it's pretty decent. There's not much... like there is some flex to it, but really you're going for portability and just a super thin low profile minimalist desk set up kind of thing. (keyboard clicks) So it feels okay. It sounds okay. This is a linear. So it must be the reds. To each their own man, if this, you know, if you like clickies, go for it. Uh, it's got LEDs on either side. There's some here and then there's one here. Ooh, it's got a little badge. This is like a mirror finish on this thing too. It's actually really nice. And then the feet attach up here or I guess you can put them down here too properly. There are switches on the back for windows and Mac toggleable. And then what's this guy? Off wired and wireless. Oh, okay, so you just switch it. That's fine. Or between if you want wired and wireless. It's nice having an off switch. Some of them just they don't have off switches. They just turn off automatically after like 10 minutes. But it's kind of annoying if you wanna put it in your bag right away, you just flick it to off. That's great. You can just throw it in and don't worry about any other key presses happening. The other thing that they're offering here is these razor thin keycaps. They're spherical so if you like the other, like non-spherical ones the cups that are like a U shape, then I don't know. I mean, I guess you're out of luck. But it feels okay. (keyboard clicks) It's not a very deep like cupping on it. So you're not gonna be, you know, missing your keys or anything just because you can't move your finger over fast enough. but it's noticeable. I love the color scheme, the gray, like the kind of space gray with this darker gray on the back and then just a few... lot pastel, but like muted colors, like this orangy here and then the yellow here and the what teal, I guess up here. It's nice. So just look at the box. It's got a 2500 mAh power battery. It's got these low profile switches I already mentioned, ultra thin PVT keycaps yeah. So it's a compact 75% layout, which means you still get like your Up Arrow keys and stuff. And then a bunch of stuff like delete and Home and End in case you use any of those in your F keys. So you're not missing out. It's basically like a laptop keyboard. And this thing is actually meant to go over laptops and you can then use it. So if you... - [Jono] Wait, what? - Yeah, it's meant to go over laptops. So if you buy a laptop, but you absolutely cannot stand the keyboard on it for whatever reason, you know, maybe it's just a membrane and you just absolutely cannot deal with membrane keyboards. Or maybe you just want something that looks a little nicer and you're willing to carry it around with you. You can take this guy and just pop it over whenever you want. I'll show you that in a sec, for now let's see what keycaps they sent us in the sample box. Oh, it's the carrying case. Oh, this thing's great. Okay. Yeah. Nevermind. It's not the keycaps. I was wrong. It's the carrying case. Oh, what? Oh my God. (Jono laughs) Oh my God. You get a poster I'm pretty sure this I'm sold now. I mean, I was really, I was already on there on the side of the fence, but they give you a poster and stickers. Can I keep these stickers? Oh my God. This is amazing. - [Jono] You can keep one. - I can keep one? Okay I get one of the stickers. I'm absolutely fitting that somewhere. So yeah. (Jono laughs) You get your own baller, your own poster for NuPhy, if you really wanna simp over NuPhy here. I honestly, I hope that's her name. I don't know what else it is. I guess she's got a badge. - [Jono] It's not simping when it's for love. (laughs) - If you, I mean, honestly, actually kind of like this as wall art even though it's a quick start guide, this is great, but I mean really, come on, you got it. This is what you got to put on the wall. So aside from the carrying case, which I'll show you guys in a sec here, they did send us keycaps, labeled keycaps. So I should have seen this, okay So yeah, here's all the other stuff I was expecting. You've got a keycap puller... switch puller. Ooh, this is nice. They come with this little foam insert to cover them. They are, oh, they're not loose, okay. But there's not too much. I mean, yeah, I guess you were held by this plastic and this foam. So that's totally fine. So I guess my one complain about the keycaps is I would've liked... They're just kind of replacements and I would've liked a secondary color scheme or something. Okay, what else we got? We got the feet. We'll put the feet on. I really would've liked a better switch puller. I really like those ones that are like plastic in the middle and then wire on both ends. And one half is a switch puller and the other half is a keycap puller Oh, there is one. Oh my God. They include it too. Oh, these guys are the best. Look at this. These are the best. Yes, it comes right off. Yeah, they are the reds. Okay. Oh, you pull these from the side I think. Yeah I've never used these low-profile guys. This thing's hot swap, which is always a bonus. They've tried really hard when designing this to keep the frame up so that you don't see your switches so that everything is like integrated as one solid piece basically. And it's all nice and clean. I do like that aesthetic, but I'm also like, I buy really colorful and interesting and nice switches, right. So I actually like seeing them, So for something like this, I would have loved an option where they remove this kind of top part of the case here, And then you can actually see all your switches underneath. Yeah, so this is easy. I mean, they're magnets and they've got this little slot right there that you fit onto the tiny rubber feet. So that's the other thing too is it's got rubber feet built in, so it's not gonna slide around when it's on your table and it's pretty light. I think it's a little over 500 grams. So it's a little over a pound. The feet are great, good option kind of sucks that they're not built in but you're not gonna be able to stick these anywhere without like... so like what's your other option, putting some cheap flip out thing that could break or it doesn't look nearly as cool. Like I actually love how they went with this colorful rubber feet that kind of match the Enter Key. So this case is great. My only problem with it is the big NuPhy badge up here. It's not bad. Like there's so much more egregious logo and branding on certain carrying cases and whatnot. And it fits the rest of it. Like from an aesthetics point it looks okay. I just don't like when branding is all over the place, it's really not bad though. So it's got this, it's all vegan leather, which is whatever it feels pretty good. Strong marketing move. I don't know who came up with the term vegan leather but those guys are geniuses. So you open it up. It's got this foam insert to make sure it doesn't get deformed. This thing acts as both a carrying case and a stand. Oh, it's supposed to go here. You can see. Yeah. You can see the little feet indents to tell you where to put the keyboard. Yeah. Just sits in there nicely. Oh, that's great. And then it just kind of wraps up. It's a little flimsy. Like this is not, you could use this, but it's really not gonna hold everything if you're, I mean on a, on a plane, you're probably safe on a train maybe not so much. Oh yeah. It's pretty good. So let's try typing on it. But before we turn it on, how about a message from our sponsors Seasonic, thanks to Seasonic for sponsoring today's video. Seasonics prime ultra titanium PC power supplies, feature ultra high efficiency with their 80 PLUS TITANIUM rating. They're fully modular feature hybrid fan control to control overall fan noise and fluid dynamic fan bearings. They offer up to 50,000 hour life expectancy along with a 12 year warranty. I mean, you can't get much better than 12 years for a single power supply. Check them out at the link below. Wow, It's Jonathan from Mac address. Jonathan, this keyboard is meant for you. How... - The magic keyboard is the only keyboard I use - What do you think about this, here? - Do you need a MacBook? I heard you might need a MacBook. - Yeah, let's try it. Let's put it on top of the MacBook. So this thing can go over your keyboard. Apparently. - [Jonathan] Well this has the butterfly keyboard, so you definitely would want to. I hope that it's battery life. - Yeah that bad boy. (keyboard typing) It doesn't cover your screen or anything. - I don't like the gray. - No! I thought the gray would be like the selling point - I hate to say this. - Yeah. - But the colors, these are very Google-y. - Oh, that's funny. (crosstalk) - Today's Pixel Day - Yeah, yeah. - These are like the pixel six hole cut colors. I don't know. I'm so newbie, when it comes to keyboards, I feel like I want the loudest, clickiest keyboard if I'm gonna do any of this business. - Okay. - Yeah. - But you know what the funny thing is, I actually, I already don't like this nearly as much. - This is great. (chuckles) - So is it just the angle though? Cause you can put feet on this guy. - No, no. - That's straight up then typing experience and the, and the look of it and everything. You can get it in clickey. - Is this pre production? - No, pretty sure this is final. - Why are some keys higher than others? Like the X look at the X. - Yeah. And the shift is like ever so slightly higher. It's pretty minor though. - That's not minor. - Okay. Fine. The X. Yeah, the X is a little taller and I can't squish it down all that much. - Well, no, I kind of squished it down a little bit there. - Oh you did squish it down. You fixed it. - Yeah. - So did you put all these on? - No, no, no, no. So your first typing session has to be intense. - Yeah, really get in there. - This is very playful. You know, I have an iMac sort of situation. - Yeah. - This is very serious. - That's a serious one. That's the business - I got a brand new MacBook Pro in Space Grey. - Yeah, I'm Mr. Business doing all the business. Yeah. Go subscribe to Mac address. You see more Jonathan, talking up all the Apple stuff that I'm not a big fan of. One thing I actually don't like about the cable that I didn't notice until now is that it's all black. And so once I plugged this in, it's just going to look kind of jarring or weird. Like, this is already gray. It matches the bottom, I guess, but you don't see the bottom all that much. Oh, and there is RGB underneath. It's really minimal though. Like you can't hardly see it at all because of how they've created the case in the keycaps to cover everything instead of having like that under the switch kind of look. So like I said, I don't like how the cable looks anyway. Let's use the dongle and go wireless mode. So, here we go. Jeez, I mean a 100 words per minute and 93% accuracy. It's not great. What tripped me up is even though I've been using XDA, I think it's how low profile everything is. I would get caught up on the keys as I moved to try to type something else. It starts at $109.95. At that price point for something this portable and versatile and slim, that's not bad, especially for mechanical option. I don't know if I would buy it personally because I don't do a lot of traveling. I basically just have my keyboard and desk set up and like, that's where, that's what I use. That's I'm done. But for anyone who like wants to go anywhere and who needs to bring a mechanical keyboard and not something membrane, I think that this is probably one of your most solid options. Especially if you get this case, get their little travel case here. So this is the Air75 wireless mechanical keyboard from NuPhy. It's pretty good product for the price. And if you like thin keyboards, make sure to get subscribed so that you can see us unbox, that new logic tech keyboard that we showed briefly. I mean, we've already put in, taken it out of the box, but we haven't done much else with it.",
    "transcript_keywords": [
        "Yeah",
        "keyboard",
        "thing",
        "pretty",
        "kind",
        "feet",
        "put",
        "keycaps",
        "case",
        "NuPhy",
        "great",
        "thin",
        "guess",
        "nice",
        "switches",
        "switch",
        "keyboards",
        "God",
        "puller",
        "mechanical keyboard"
    ],
    "transcript_entity_values": [
        "10 minutes",
        "12 year",
        "NuPhy",
        "One",
        "93%",
        "Business",
        "one",
        "USB",
        "16 mm",
        "one half",
        "the Enter Key",
        "Seasonic",
        "iMac",
        "sec",
        "100",
        "Seasonics",
        "USB-C. Oh",
        "2500",
        "12 years",
        "today",
        "switch puller",
        "80",
        "Waifu",
        "Jono",
        "NuPhy",
        "75%",
        "a little over 500 grams",
        "MacBook Pro in Space Grey",
        "first",
        "PVT",
        "the X. - Yeah",
        "up to 50,000 hour",
        "PBT",
        "NuPhy",
        "Mac",
        "109.95",
        "RGB",
        "six",
        "MacBook",
        "Apple",
        "Home and End",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORG",
        "FAC",
        "TIME",
        "ORG",
        "FAC",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORG",
        "PERSON"
    ]
}