{
    "id": "KUQOnxhtjqA",
    "title": "Beats Solo Pro review: on-ear noise cancellation, finally",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-10-25T15:43:17Z",
    "video_url": "https://www.youtube.com/watch?v=KUQOnxhtjqA",
    "category": "Science & Technology",
    "tags": [
        "beats solo pro",
        "beats solo",
        "beats",
        "solo pro",
        "solo",
        "pro",
        "dr dre",
        "beats headphones",
        "beats studio",
        "beats pro",
        "beats wireless",
        "beats over the ear",
        "apple",
        "wireless headphones",
        "wireless",
        "headphones",
        "earphones",
        "best headphones",
        "apple airpods",
        "airpods",
        "powerbeats pro",
        "wireless earbuds",
        "noise cancelling",
        "noise cancelling headphones",
        "2019",
        "new beats",
        "apple beats",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "google",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 315289,
    "likes": 6225,
    "comments_count": 574,
    "description": "The Beats Solo Pro headphones stand out as the companys first on-ear headphones with noise cancellation and cost $300. The design is improved, they sound good, and have long battery life. But they put a tight fit on your head, which some people might find uncomfortable.  Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2Nclc4n",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Beats headphones are everywhere. You see them on your commute, at the gym, on the heads of celebrities and star athletes. Beats have sold over 30 million units of its Solo line of headphones and now, there's a brand new version. These are the $300 Solo Pros and they add a long-awaited feature, noise cancellation. (laid back rhythmic music) These are the second release in what Beat says is a new generation of products that began with the fantastic Powerbeats Pro. They come in the soft case which is made from a lot of recycled materials and when you take them out, they definitely look like Beats, but they're somehow more refined. All that glossy, greasy plastic is gone now and the Solo Pros only come in matte finishes. And these exposed aluminum sliders make them feel just a little bit more classy than previous Beats headphones did. So there's no power button on these headphones. To turn them on you just unfold them and they power on. If you wanna shut them off, just fold them back up and they turn off. Now some people like me like to wear their headphones around their neck sometimes so as long as no music is playing, these enter a low power state and save battery life automatically. Beats has made other improvements that you might not notice just by looking at the Solo Pros. The surface area of the cushions has increased by 70% and your ears will appreciate that added foam padding and since Solo headphones are so popular at the gym, Beats also changed things internally to make them more sweat and rain resistant. Now, inside the Solo Pros is Apple's H1 chip so these can instantly pair to any nearby iPhone or iPad and they have hands-free \"Hey Siri\" voice commands and a new iOS 13 feature called audio sharing so you and a friend who has AirPods can listen to the same song or watch a video together at the same time. Don't worry Android people. These headphones work perfectly fine with your phones too. They charge with a lightening connector, not USBC, I know, I know, but there is a cable in the box. What you won't find on these headphones is a 3.5 millimeter input. Apple is determined to kill the headphone jack and Beats has not been spared, so if you wanna use these headphones wired, you've gotta pay $35 for a cable from Apple. Otherwise, it's all wireless, all Bluetooth, all the time. I think that might frustrate some frequent flyers. Put the Solo Pros onto your dome and well, here's the thing, they don't fit me so great. Now, I've got an enormous head. Back in little league, I had to us this special batter's helmet which was one size bigger than the biggest size for people with normal sized heads so I am an exception. Don't focus on that. I wanted more input, so I gave the Solo Pros to the folks around the office and had them wear them around but that same theme kept coming up. People said they felt tight, a lot of pressure on their ears, and for folks who have also big heads they feel a little small sometimes. But there's a reason why these clamp down on your ears so hard. See, for noise cancellation to work well, there has to be a good seal, so the ear pads need a lot of pressure up against your ears to cut off outside noise. Makes sense, I get that, but I also think some people might find these fatiguing or just straight up uncomfortable after a few hours, say if you're on a long fight somewhere. Okay, so Beats' noise cancellation is pretty good. I don't think it's quite at the level of Bose's noise canceling headphones 700 or Sony's 1000XM3s. (sighs) Those names. But it does a pretty good job of cutting out the rumble of the subways or the clamor of city streets. Now, unlike the noise canceling headphones from Bose or Microsoft and some others, Beats does not allow you to adjust the level of noise cancellation. It's all automatic and it adjusts automatically based on your environment. So in a quiet room, it'll ratchet down and if you step onto a plane, it'll crank right back up, but if you have to hear what's going on around you for safety reasons or to pay for a coffee or whatever, you can press this button to enter transparency mode. And on that note, the Solo Pros have one of the most natural sounding passive modes I've ever heard. Conversations sound natural, not overly processed or digital. Battery life is 22 hours of noise cancellation mode or transparency mode but you can turn all of that off and get up to 40 hours of good old music listening, but if you somehow do manage to run out of battery, you can charge them up for 10 minutes and get three hours of listening time. So, let's do it. Sound quality. You know the reputation that Beats has and so do I. For years, it was about head rattling, thumping bass at the expense of everything else, but that's not true anymore and it hasn't been true for a while now. Things started turning around with Solo3s a few years ago and then got really good with the Powerbeats Pro. For the Solo Pros, the bass is still pronounced but it's not too boomy or overwhelming. It feels restrained compared to older Beats headphones, even those Solo3s. One word I would associate these headphones is clarity. They don't have the widest sound stage in the world but they're balanced and pretty enjoyable. Now, do they sound as good as Sennheiser's $400 noise canceling headphones? No, but there's also nothing wrong with them either. Now, Beats doesn't offer any kind of EQ customization so definitely put these on in a store, try them and make sure you're in to that sound. The bottom line is that these are not audiophile headphones but they fill the role of every day, take everywhere headphones pretty well, so long as your head isn't quite as big as mine. And then there's the nitpicky stuff. I wish these paused music automatically when you take them off your head and they don't do that, plus these controls on the right ear cup could be a lot better. You press up or down to adjust volume and you press the center area to pause or play music. Pressing twice skips a track and three times goes back but I keep trying to press left or right for those same functions just like the iPod click wheel back in the day. I wish that was the case here, but it's not. And then there's that $35 cable if you want wired audio. Come on Apple. But with all of that said, if you find these comfortable and you're okay with that $300 price, I think the Solo Pros are pretty much the best Beat headphones ever. No, the noise cancellation isn't best in class. If you care about that most or you travel a bunch, stick with Sony or Bose, but I suspect, just like their predecessors, these are the new headphones you're gonna start seeing pop up pretty much everywhere very soon. Hey everybody, thanks so much for watching. It seems like new headphones and earbuds just keep coming so we've got more tech reviews on the way and for all of those and everything else, subscribe to \"The Verge\" at YouTube.com/TheVerge.",
    "transcript_keywords": [
        "Solo Pros",
        "Solo",
        "headphones",
        "Beats",
        "Pros",
        "Beats headphones",
        "noise cancellation",
        "noise",
        "noise canceling headphones",
        "Powerbeats Pro",
        "Solo headphones",
        "previous Beats headphones",
        "cancellation",
        "canceling headphones",
        "good",
        "pretty",
        "Apple",
        "older Beats headphones",
        "fantastic Powerbeats Pro",
        "Pro"
    ],
    "transcript_entity_values": [
        "USBC",
        "35",
        "Android",
        "the Solo Pros",
        "one",
        "Beat",
        "Apple",
        "a few hours",
        "iOS 13",
        "three hours",
        "three",
        "The Verge",
        "Sennheiser",
        "the day",
        "the Solo Pros",
        "up to 40 hours",
        "1000XM3s",
        "a few years ago",
        "300",
        "iPad",
        "years",
        "22 hours",
        "70%",
        "Bose",
        "Siri",
        "jack",
        "H1",
        "One",
        "AirPods",
        "iPod",
        "400",
        "second",
        "Bluetooth",
        "Sony",
        "10 minutes",
        "Solo",
        "the Powerbeats Pro",
        "Microsoft",
        "iPhone",
        "3.5 millimeter",
        "over 30 million",
        "Powerbeats Pro",
        "700"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "FAC",
        "TIME",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "DATE",
        "TIME",
        "PERCENT",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL"
    ]
}