{
    "id": "KxNmb7S_L2g",
    "title": "iPhone X Camera Test - 4K 60fps!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-11-02T23:37:43Z",
    "video_url": "https://www.youtube.com/watch?v=KxNmb7S_L2g",
    "category": "Science & Technology",
    "tags": [
        "iPhone 4K 60fps",
        "iPhone X 4K",
        "iPhone X Camera",
        "iPhone X Camera Test",
        "iPhone X Camera Review",
        "iphone x",
        "iphone x unboxing",
        "iphone x review",
        "unboxing",
        "review",
        "iphone 2017",
        "apple iphone x",
        "iphone x hands on",
        "iphone x vs",
        "iphone x vs iphone 8",
        "2017",
        "apple",
        "iphone x specs",
        "new iphone",
        "iphone 10",
        "iphone",
        "animoji",
        "iphone 10 review",
        "iphone x vs 8",
        "face id",
        "smartphone",
        "iphone x vs iphone 8 plus",
        "iphone ten",
        "60 fps"
    ],
    "views": 337274,
    "likes": 9060,
    "comments_count": 1053,
    "description": "iPhone X Unboxing!  Trying to trick iPhone X Face ID -   iPhone X Unboxing BTS -   Subscribe!    Background music via Epidemic Sound:   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/etV7qrLITQg",
        "https://youtu.be/LTzeGNJyTrU",
        "https://youtu.be/Q3FQpc3ZI_Y",
        "https://www.youtube.com/tld",
        "https://goo.gl/rMbhQL",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo guys, Jonathan here, there's a couple firsts that are going down here on the channel right now. One, is the first time I'm shooting in 60 frames per second, 4K mind you, so if you've been out there requesting and craving that sweet 4K 60fps goodness, today, is the day, now I'm doing so through the iPhone 10, that is one of the more impressive features with the iPhone 10 as well as 8 and 8 plus, and whether you love Apple or you hate them, it is still impressive to get that out of a smart phone, because honestly, not even many high end cameras have that, but, we are also doing another thing with this, we are unboxing, oh man, how do you like that sweet motion, through 60 frames per second, this is, the Xbox One X, that's been sitting here, haven't got a chance to check it out yet, so I figure what better way to unbox this then through the iPhone 10 in 60 frames per second. So lets crack this box open, we got a beautiful plane, in the distance, so let me know how that sounds or looks, we got some special limited edition Xbox One X design packaging. And this looks like a... Setup book, and it is some pretty, nice quality, like you could knock somebody out with that. Beyond that, I'm just gonna kinda get some motions going on since we're doing the 4K 60fps, Planet Earth 2! I'm not really that excited for that, but, just in case, you've been wanting to get your Planet Earth 2 on, this is included with this, from what I understand, there are quite a bit of game codes included with this press kit, so throughout the video, look for some Easter eggs you're going to get a chance to win some free games. From there, there it is, there's the Xbox One X. Behold, have you ever seen an Xbox One X in 4K 60fps probably, because most channels you watch this on are shooting 60 frames per second, but probably not in 4k, so... That is a difference here. I'm not going to litter, but, I'm going to throw the box at Ralphy right now, cause he is in this ridiculous Where's Waldo costume and... - You can't see me bro. (laughing) - Sorry man, oh no, oh no, well I was going to say there was a problem, because I didn't have any knife or any way to get in through this, but, seems like the bottom just collapsed on me, so, nonetheless, like Fogel says, \"We are in.\" Here we go, we got the hardware, the Xbox One X itself. Now this is a little different from the limited edition Project Scorpio, that is coming out for those who got a chance to pre-order that, but, stay tuned, because we may or may not be giving one of those away. (upbeat pop music) Look at that blow... In 60fps glory. So there we have it, it's very similar to the Xbox One S, a little bit longer, but more so, the more impressive thing is how much power they're packing inside of this and still retaining the design. From there, I'm going to set that off and it's going to blend into the park bench that we're at right now, power cable, that is also one of the more impressive things that I remember from my first impressions is that even though this is a much more powerful machine, its actually using these same power cables, so, wow, so that's cool, Microsoft includes the HDMI cable because no one wants to run to Walmart... Well no one really wants to run to Walmart anyway, but, on top of that, if you have to pick up an HDMI cable, that is no fun, from there, last but not least, inside this Xbox One X unboxing, we have the cable, I'm going to walk over here and get you guys a close up of that. Through the iPhone 10, feels good in the hand, we got like, 15-20 minutes of light left, so it should be a pretty good test, because with the 4K 60 you do need more light then 30 frames per second or 24, so let me know what you guys think. Aside from that, this has been kind of a chaotic, a little bit messy unboxing of the Xbox One X, like I said, I am giving one of these away, but not just this one, the Project Scorpio edition, and I'm doing so with my buddy Kevin Kenson, who has been killing it on the gaming coverage, not only with the Xbox One X, but everything so far. So if you're interested, details, rules, and the link is below so you can enter this giveaway, this is Jonathan, if you missed my iPhone 10 unboxing I'll link it here and I will catch you guys later.",
    "transcript_keywords": [
        "Xbox",
        "Planet Earth",
        "frames",
        "limited edition Xbox",
        "Project Scorpio",
        "iPhone",
        "love Apple",
        "edition Xbox",
        "HDMI cable",
        "cable",
        "impressive",
        "Project Scorpio edition",
        "edition Project Scorpio",
        "guys",
        "unboxing",
        "chance",
        "run to Walmart",
        "Planet",
        "Earth",
        "sweet"
    ],
    "transcript_entity_values": [
        "X. Behold",
        "Xbox One S",
        "Project",
        "4k",
        "One",
        "Xbox",
        "the day",
        "4",
        "15-20 minutes",
        "30",
        "Xbox One",
        "Apple",
        "Xbox One X",
        "Waldo",
        "Scorpio",
        "24",
        "Ralphy",
        "second",
        "first",
        "one",
        "60fps",
        "Walmart",
        "Easter",
        "today",
        "Kevin Kenson",
        "60",
        "Microsoft",
        "HDMI",
        "Fogel",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON"
    ]
}