{
    "id": "kXqKNcTgXC8",
    "title": "Apple is Wrong About Android",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-01-20T18:05:52Z",
    "video_url": "https://www.youtube.com/watch?v=kXqKNcTgXC8",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "apple",
        "android",
        "ios",
        "google",
        "rcs",
        "green bubble",
        "blue bubble",
        "sms",
        "whatsapp",
        "tech",
        "technology",
        "facebook",
        "instagram",
        "twitter",
        "smart phones",
        "smartphones"
    ],
    "views": 46060,
    "likes": 2473,
    "comments_count": 359,
    "description": "Are you a blue bubble or a green bubble and why should Apple stop being a bully?   Playstation is in Trouble:  The PC is Killing PS5:  Can the Switch Keep Up?:  Why the PS5 is LOSING Money:   Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/Jib6v--UffY",
        "https://youtu.be/Ib8WlAfSGYo",
        "https://youtu.be/36_B1cX9z0w",
        "https://youtu.be/3ZzQ1wUJ9iA",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Remember to ring-a-ling the, god dammit, now I said it. - He did it, yes! Yes! Tell your friends, tell your family, This Is is back. So here's the thing, right? iMessage has been around for a number of years at this point. - Since 2008? - Has it been that long? - [Ken] So, iMessage came out in October 12th, 2011, it's 10 years. - 2011? - At least according to Wikipedia. - Wow. Before iMessage existed, there was the dark days of SMS. - I like you to say dark days, like it's gone. It's that's still what we're using. - The thing is iMessage was actual legitimately ahead of the curve, right? So not only do you have things like read receipts and far better image, quality and video quality, you also have a decoupling of your phone number and your iMessage. Right? So you can still iMessage someone's phone number if you want, but you also can set up an iMessage without a phone number at all and you can take it with you wherever you want. Whereas SMS limited to 160 characters. - Something like that. You mentioned that you could not even have a phone number. I know that's how I got into iMessage 'cause I was using an iPod touch. This is also a time when it costs a lot of money to text people, having something that was free to text was huge. - The problem is, is that that is just made SMS look even older and as soon as you get a green bubble person in your group chat or something, everything falls apart and you've got like those like blank person love, blank message, blah, blah, blah, quote, quote, quote. Like it gets to be a complete disaster almost immediately. And it's left Android users with obviously a hugely sour taste in their mouth because anytime you have a text message with someone who has green bubbles on the Apple side, you're completely losing all your functionality, and did I mentioned the image quality? - This argument hasn't, it's not new. It's been going on for a while. It's been going, I mean years it's been going on. So in 2014, this is when they said Android, they didn't say Android, but they said your friend's inferior devices, which was anything that was an Apple. - But the with this green bubble friends and you know they have inferior devices. - So that's what? Eight years ago at this point. However, the reason we're talking about it now is because of VP for Google Hiroshi Lockheimer had just tweeted about it and saying, it's them bullying customers to lock them into use iMessage is bad for the industry, is bad for consumers. I think it's a little ridiculous that Google of all people can come and say that it's all Apple's fault, no one's fault, but theirs. - Okay, so there's a lot to this story, right? So, like you said, it's been around for a long time, but really only in the last few weeks, 'cause it kind of, sort of bubbled back up again. So, pun intended. So, what basically Google stands here. That was definitely a green bubble in that one. Google stands here, is it Apple should adopt RCS. It really is the sort of the, the successor to SMS. You have things like read receipts, you have things like better encryption. You have things like actually usable photos and video over SMS or RCS in this case. And the thing is Google is really pushed this hard mostly because not everyone wants to use like WhatsApp or Facebook Messenger or whatever. So, having that capability is nice and honestly curious specifically here in the U.S. have done a fairly good job of finally incorporating RCS. The problem though, is that the iPhone does not support RCS. Which means that it's still got that ancient terrible green bubble sort of life. I totally am sympathetic to the argument that Apple should pick this up, because think about it. If they enable RCS not to remove our iMessage, iMessage can continue by having RCS as the fallback, in addition to SMS, I think will make an enormous amount of sense because that way you would still have some of that cross compatibility with things like, better photos, you also have the idea that you could theoretically send things like some reactions or whatever that would actually be fairly cross-platform. But the problem though, is that Timmy Cook has zero, zero, zero, reason to ever do this. Do you know how valuable it is for Apple to make the peasants with the green bubbles look bad? I mean, in iPhone and someone with an Android text you or gets in the group chat it ruins everything. Why would they ever throw that away? I mean, that would be a terrible marketing and business decision, even though it would be great for everyone else. - But there is that group of people who really care about this and there are some subtle things that Apple has kinda done, whether it's intentional or not. - That does kinda predate though, because originally the messages app on iPhone, just did SMS before iMessage even existed. So, to be fair, the green bubbles have always been there. It's just that blue bubbles came in and they're the cool hot rebels, everyone wants to be them and then all the Android people are stuck with green bubbles and they look lame. - I agree, I want Apple to open this up. However, a lot of people keep forgetting that these are, we're talking about businesses here and it's their whole goal to make the most amount of money that they can make. I don't think iMessage is better that any other particular app. I don't think it's better than like WhatsApp. But I do think it's the best default app of any device out of the box. And I think that's the key distinction. We were talking about if we want to switch to like WhatsApp, that's a very common argument here. Most of the world uses WhatsApp, stuff like that. If I wanna get that experience with everyone, that means every single person I talked to, has to use WhatsApp. Now, am I gonna convince my parents who barely know how to work their iPhone to download another app? They are gonna use the default messaging app, which is the best one on, I think it's. - So like one of my favorite things about iMessage is that a lot of customer service things are on iMessage. So all the major carriers, at least here in the U.S. AT&T, T-Mobile, Verizon, they have customer service built into iMessage already. And it's almost faster to message them on iMessage than it is to call them. - One of the things we could talk about with culture too, is a lot of the reason that most of the world uses WhatsApp is from necessity, not lenient. The U.S. is one of the only countries where text messages are included in the text messages, but we don't pay for text messages anymore. So using something like WhatsApp is a necessity to not have a 400, $500 bill. - You were up all night, texting your crush on your Razor. - It's this whole idea that carriers are, that iPhone is bullying customers to use their platform. - Which they are. - It's unfair to, for it to be so one-sided against Apple. I'm not saying they're not doing this. This was very real. I lost friends because I had Cingular at the time, which is now AT&T, but they had Verizon or someone had T-Mobile and you actually could not text them without paying 25 cents a text. You had groups of friends like, oh, we're the Verizon group of friends. and we're the Cingular group of friends. I actually had a girl dump me. - Wait, wait, wait, for real? - Yes. A high school girlfriend broke up with me because she got in trouble from her dad because we were texting. She was on Verizon, I was on Cingular. Can someone tell me how that's not bullying? Google is bullying carriers to carry RCS. So it's the same thing. - For most people, iMessage is what your family or friends use. But other than that, you're gonna be using Discord. You're going to be using WhatsApp. You can be using Instagram or Facebook or Twitter DMs. If you're Austin Evans in your old. Look, there's so many messaging platforms out there. It makes sense in my opinion, for SMS to go away. It is so old, so crappy, so limited the characters, I mean, SMS was designed as a way to like take advantage of the tiny little bits of airtime that, your 2G network wasn't using when you are like on a phone call or something, right.? I don't think anyone can argue that RCS is not an upgrade over SMS. - No, It's a huge upgrade. - And a ton of people still use text messages, right? I mean, I think most people on Android are not really using texts that often, but in a lot of countries, including the U.S. texting is kind of like the default kind of way that you can get ahold to someone. You know that that's gonna work. I totally understand Google pushing this. I totally understand Google calling Apple out. I think it's a very reasonable thing, right? But on the other side, the temptation from Timmy Apple to block this from ever happening is way too strong. Now, if Apple is forced to do it, if there's some anti-competitive nonsense or carriers really get sort of strong about it, but like, I don't think anyone cares enough to really force this through and until that happens or until Care just stop, like even dealing with asset messes on the network, I don't think Apple has any incentive. - I agree 100% agree with that and again, as a consumer, I want this to be opened up. I still am gonna come back and say, I think it's ridiculous that Google is putting this all on Apple. They had every opportunity to make one of those apps be at the same level or like the better version of, iMessage the choice is a good thing for a lot of people but when you have now 11 apps, I keep saying iPhone, I'm so biased, I'm such an iSheep. One thing, a lot of people don't remember is RCS has been around for longer than iMessage. This isn't really becoming a big problem now until it's Google's agenda to push it. - And look this is clearly not their optimal thing. I'm sure if Google was sitting on a locked in message platform like iMessage, they would be singing a very different tune right now. - They would be doing the same exact thing of why should we change to come down to your level? You should rise to our level. But what Google has to do now is they have to make something that is better than iMessage. - But they're not going to. Like I think RCS is their fall back just so that they can say they have something, but all the matters is that the Zuck is laughing himself into his piles of cash as WhatsApp continues to dominate the world. But I'm very curious. What do you think, let us know in the comments below and I think I it's been a while said that welcome back to This Is. - Yes. - It's good to be back. - Like subscribe and ring the. - Ring the notification bell. - Ring the ding-a-ling bell, turn on all the notifications. - We're not doing ding-a-ling bell for this time around. - Are you gonna Tim Cook me right now? - I'm gonna green bubble you into oblivion. - You should subscribe to make sure you don't miss that one.",
    "transcript_keywords": [
        "Apple",
        "iMessage",
        "Google",
        "SMS",
        "RCS",
        "things",
        "thing",
        "text",
        "people",
        "green bubble",
        "green",
        "Android",
        "WhatsApp",
        "lot",
        "text messages",
        "make",
        "Google calling Apple",
        "bubble",
        "bubbles",
        "friends"
    ],
    "transcript_entity_values": [
        "zero",
        "11",
        "Android",
        "Austin Evans",
        "one",
        "Razor",
        "Apple",
        "AT&T",
        "Verizon",
        "T-Mobile",
        "a number of years",
        "Discord",
        "25 cents",
        "Google",
        "Wikipedia",
        "2",
        "Timmy Cook",
        "Eight years ago",
        "SMS",
        "Twitter",
        "iSheep",
        "RCS",
        "Google Hiroshi Lockheimer",
        "VP",
        "Tim Cook",
        "100%",
        "2008",
        "Zuck",
        "2014",
        "the last few weeks",
        "One",
        "Facebook",
        "all night",
        "Timmy Apple",
        "Facebook Messenger",
        "iPod",
        "iMessage",
        "the dark days",
        "WhatsApp",
        "Verizon",
        "10 years",
        "October 12th, 2011",
        "iPhone",
        "Instagram",
        "160",
        "500",
        "Cingular",
        "400",
        "U.S.",
        "a ton"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERCENT",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "TIME",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "GPE",
        "QUANTITY"
    ]
}