{
    "id": "kybuRUHYVT4",
    "title": "I crashed The Worlds Most \"Durable\" Drone...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2024-05-09T14:00:39Z",
    "video_url": "https://www.youtube.com/watch?v=kybuRUHYVT4",
    "category": "Howto & Style",
    "tags": [],
    "views": 447201,
    "likes": 15975,
    "comments_count": 613,
    "description": "As a stock vehicle the Hummer EV SUV is a the pinnacle of electric off-roading. And the new DJI Avata 2 stunt drone is at the precipice of off the shelf FPV. Together we are in for a good time. For more crashes... watch Dans video HERE:   Current pricing on the Avata 2 is HERE:  DJI Website:  Amazon:   The Hummer EV SUV is pretty awesome.",
    "description_links": [
        "https://youtu.be/A0DmAkuRhzw?si=3w5HJ_O4AaZNh2zz",
        "https://click.dji.com/AIMXGoVOxKUMDk8WudXMaA?pm=link",
        "https://amzn.to/3wsGlSy"
    ],
    "transcript": "Today we're going to be driving the most capable off-roading vehicle on the planet, the Hummer EV SUV. And we're going to be filming it with the most capable off-the-shelf FPV drone on the planet. Now I'm a rather exceptional drone pilot. Whether I'm filming weddings, scenic car videos, or my bunker project, my drone skills are unrivaled. So hopefully I am capable enough of doing both of these machines justice. I've actually bought three drones today. We have the Avada 2, which is the stunt drone. We have the Mavic Mini 3, which is my own personal drone. And we have the Mavic Pro 3, which is Dan's drone. It's by far the most expensive of the trio, but we'll see all the footage side by side and figure out which drone is best for which situation while we're off-roading in the beautiful red rocks of Moab, Utah. Oh that's crazy. Alright, we're going to try this drone out for the first time. This one's quite a bit crazier than what I'm used to. Normally I have like two joysticks and no goggles or anything. There's three components that all have to connect together and work at the same time. And I'm actually kind of nervous. We're going to be taking this first flight kind of slow. Everything happens with these buttons right here as well as like tilting it left and right. And I guess that's how you direct the camera. Also the camera only moves up and down so the stabilization doesn't tilt. Anyway, let's fly. This video is not sponsored by the way. I just think drone shots are awesome and I've been flying drones for a really long time. As an FPV noob though, I did forget to change the camera settings. So I've upscaled all the images you see here to 4K from 1080p. Oh no. This is so weird. I need to get it way up in the air. Oh my gosh. I got to hold on. Oh boy. I don't know if I'm in like sport mode or anything yet though. It's definitely not going 60. Oh my gosh. I need to sit down. Holy smokes. Dude, this thing is amazing. Oh my gosh. Dude, the turning. I feel like I'm in like a TIE fighter or something. Yeah, you're going to get dizzy if you do that move. And you might be like, hey Jerry, why did you bring three drones to film the Hummer if they all film in 4K? And it turns out that all 4Ks are not created equal. The Mavic Mini 3 Pro is by far the cheapest drone, easiest to travel with, and the most legally accepted. But it has a 1 over 1.3 inch sensor, which is basically what's found inside of a smartphone. The Mavic 3 drone is quite a bit bigger, faster, and much more expensive. But it also has a much larger 4 third sensor, which takes up about three times more real estate than the Mavic Mini. So even though it's still filming in 4K, same as the little guy, it's able to pack in far more information to those pixels with something called bit rate. The Mavic 3 is recording at 159 Mbps, while the Mavic Mini is only recording at 90 Mbps. Still exceptional quality, of course. The average person at first glance won't be able to tell the difference. But there is indeed a difference. Oh, stop. That sounded like you stopped abruptly. Oh, it's in one piece. I thought you ran over it. Oh my gosh. Alright, so I've taken a break from flying the drone and now I am driving the Hummer EV SUV. These things are incredible. Coming down a steep incline here. That's so cool. So as we're going down steeper inclines, there's obviously regen that helps slow down the vehicle and put energy back into the battery. But when we're going super slow, the friction brakes also grab onto the tires. But it's like the computer's doing so much of the off-roading work for me. I mean, I used to drive a lifted Jeep Wrangler back in college. And so I know what it's like to do off-roading with Jess lockers. But having the electric control and the instant torque turning on the front cameras. That thing is so useful. When I'm going down this super steep slope, I'm going to be using these cameras right here. Instant torque in the front cameras and the undercarriage cameras. It's like off-roading on easy mode. This is incredible. Forward momentum is still important, right? Don't get me wrong. But at the same time, since there's so much torque with each of the tires, there's three motors on this thing. Two in the back, one in the front. There's so much instant torque that you can come to a complete stop and still turn back on the acceleration while not spinning any tires. Because if you start spinning tires on a slope, then you can also start moving backwards. So cool. Alright, picking Dan back up. See if I open the door. It goes into park when you open the door. That's interesting. Same thing with my Rivian and Teslas and probably other vehicles too. Any final words, Dan? You don't break it, you're not doing it right. I don't know if that's how the saying goes. So watch as we go down this hill, the rear tire is going to start spinning. Look at that. It is completely turned inward. That's wild. So the back wheel is turning in, the front wheel is turning out. Way easier to navigate the trails when all four tires are spinning and turning. So I've driven a lot of electric vehicles and I think the biggest difference between the Hummer EV SUV and the trucks that I drive is the approach angle and the departure angle. So like with this EV SUV, if I'm coming down a slope, the front bumper isn't going to hit the dirt. There's so much space in front of the tires that they'll just grip whatever terrain's in front of me without coming in contact with the ground. And the same thing for the departure angle. Normally I'm in a truck and the bed will scrape against a rock as we're coming off of an incline. But with this one, there is no tailgate, there's no bed to scrape against anything. The departure angle is phenomenal, which probably makes the Hummer EV SUV the best electric vehicle for off-roading right now, especially when we talk about the different modes. So there's four-wheel steering, there's also crab mode where both the front and rear tires turn the same direction, and just the lower footprint and the smaller wheelbase. So much fun. Plus it comes with a spare tire, which not every EV does. It has an incredible display, which I'll show you in a minute, and the roof comes off. All four of these panels can pop off and be stored in the front trunk. I think I might have scratched it a little bit. Sorry about that. As long as the GoPro is still fine, that's what really matters. A lot of people that don't drive electric cars are probably really terrified about puncturing the batteries. You definitely don't want to puncture batteries. But they have a pretty good rock guard under there, and so we've tested it today. I've tested that and also the paint on the side of the truck and some of the bushes. But yeah, we've hit some things pretty hard, and it protects it pretty well, I would say. And see, if it was the departure angle of the truck, it would have hit a lot harder than that. There's hardly any slope back here for it to connect with the rock because of the minimal departure angle. We're kind of at a stop right now, but if you look at the dash you can see our battery percentage, all four of our tires, how much air is in them, our drive mode, range, how much power we're actually using. Right now we're using 1 kilowatt. And then over here in these displays we can lock our front and rear axles. There's just so much information. We can see our high and low elevation, our axle torque. This one's really cool when we're going uphill. The dashboard is almost like we're playing in a video game, but you know, it's real life. Here in Moab going down some red rock trails. And this rear view mirror can switch from just like a regular mirror, so you can see the Hummer behind us, into a computer display mirror, which is actually really convenient. Ha ha ha! Check that out. You can always judge a truck by how many windshield wipers it has. Besides the camera for the rear view mirror, we also have a lot of cameras around the outside of the vehicle. And if we bump over here, one of the coolest shots is underneath the truck. We can see the rocks that are directly below us, while having the ability to wash them off with liquid. That is the rear camera and there's one in the front too. The other camera is right there. That's crazy. All of the little cameras act like internal and external spotters, just always all around the Hummer. It's just like off-roading on easy mode. One more little thing that I've noticed that Dan doesn't have to worry about, but the roof on this thing is kind of like plastic and I can feel the heat more so coming through on this roof than like my Rivian or the glass Cybertruck. For the hair challenge folks out there, this is cooking my noggin more than other vehicles. But the roof does come off though, which is super cool. But yeah, if there was a little more heat rejection, got to keep what brain cells I have. Yes! Now that we're on more of a flat surface...I don't know what's laughing in my head. Now that we're on more of a flat surface, we're going to try to do some more crazy shots with the drone. I think that I can get it...since it didn't work before flying underneath the truck because we were kind of like jostling around too much, I think I can get a shot underneath the drone. If we go to extract and go up to 15.9 inches. Get out of here! Now the Evada 2 is where things start to get even more interesting. It's the same smaller smartphone sensor that we find in the Mini,1 over 1.3. But the FPV form factor of this drone, with its built-in prop guards and super fast 60 mile an hour fly speeds, just give a whole different feel. Instead of a bird's eye view, we now have more of a Star Wars tie fighter perspective, which depending on the vibe of the video, could fit extremely well. Oh my gosh! Oh! First try! You doubted! That was great! You doubted so much! You doubted! Whoo-hoo! Twice! Oh! The front one didn't work as well. Dang it! Impact detective! It's pretty impressive that the Evada 2 can survive a full frontal impact with a 10,000 pound Hummer skid plate. So Dan, since you've taught me everything I know about FPV drones, do you think you could have made the shot going underneath the Humvee? I don't think I would have attempted it. I'm impressed that you even thought that you could do it. And you did it twice! Easy! Yeah. It was just coming in from the front side. Yeah. I want to re-watch the footage to see what you actually hit. Were you too high? Were you too far to the left or right? The footage will tell, hopefully. But the drone still works. Yeah. I got the vibe that like when I was a certain speed, it wouldn't let me crouch close to the ground. But then when I got faster, it would let me get lower. But then, you know, then there's less time to adjust. When I'm coming from behind the Hummer, there was more time to like situate myself because the Hummer is going with me. It was a valiant effort, I will say. I'm glad it turned out. As a first timer flying an FPV drone, I feel like I did a pretty decent job. The thing that I was missing the most though is that like I feel like the FPV always needs to be flying forward. You pull this trigger to fly and then you just handle all of the movements by moving the joystick. And that's different than other drones. And I feel like I couldn't get all the shots I wanted with this particular setup. So flying, you know, the Mavic 3 or the Mini 3 just like alongside a vehicle is a shot that I would not be able to accomplish with the FPV. But with the FPV, I'm able to like, you know, get in and just provide like a different dynamic. One thing I like to do in my videos to keep things interesting is change up the shots and provide a perspective that maybe people haven't seen before. Like this shot right here, I'm sitting next to the shock super low on the Hummer EV. Normally people see the Hummer as they're driving down the road from a high up perspective. And so this shot I purposefully lined up intentionally to be interesting. And I feel like the FPV provides that, but it's not like the best all-round drone for my drone arsenal. It's a nice tool to have, but if I had to pick one drone for my camera bag, it's still probably going to be the DJI Mini 3. I'll keep playing around with this. I'll get better with it, hopefully stop hitting things as much. There's a lot of different modes I haven't tried out yet. And another controller with joysticks that might even be better than this one. But as a first day, first time, it was definitely fun to try out. It's impressive that it can hit the skid plate of a Hummer EV and live to tell the tale. And if I'm being honest, I'm glad if I had to crash one of the two vehicles, I'm glad it was my drone. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "drone",
        "Hummer",
        "Mavic Mini",
        "front",
        "FPV",
        "Mavic",
        "FPV drone",
        "thing",
        "Hummer EV SUV",
        "Mini",
        "drones",
        "camera",
        "tires",
        "offtheshelf FPV drone",
        "cameras",
        "time",
        "SUV",
        "Dan",
        "offroading",
        "back"
    ],
    "transcript_entity_values": [
        "Mavic 3",
        "4 third",
        "Whoo-hoo",
        "the Hummer EV",
        "1.3",
        "Rivian",
        "10,000 pound",
        "159 Mbps",
        "all four",
        "Hummer",
        "Humvee",
        "Jess",
        "1.3 inch",
        "a Hummer EV",
        "four",
        "two",
        "three",
        "GoPro",
        "Jerry",
        "15.9 inches",
        "Jeep",
        "Two",
        "about three",
        "1",
        "Wrangler",
        "4",
        "Moab",
        "Mini,1",
        "EV",
        "Cybertruck",
        "60",
        "first",
        "the Mavic Mini",
        "FPV",
        "today",
        "90 Mbps",
        "First",
        "the Mavic Mini",
        "Today",
        "Dan",
        "3",
        "One",
        "the Mavic Pro 3",
        "Utah",
        "a first day",
        "one",
        "60 mile an hour",
        "2",
        "1 kilowatt"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "NORP",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "FAC",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "NORP",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY"
    ]
}