{
    "id": "KyimKjSAtuY",
    "title": "This Macintosh Never Existed (Columbo Prototype) - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2022-03-31T16:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=KyimKjSAtuY",
    "category": "Science & Technology",
    "tags": [
        "This Macintosh Never Existed (Columbo Prototype) - Krazy Ken's Tech Talk",
        "Apple Prototype",
        "Macintosh Prototype",
        "eBay",
        "Mac84",
        "Action Retro",
        "CanadianComputerCollector",
        "Vintage Mac",
        "Mac OS",
        "Apple Server",
        "Mac Server",
        "Macintosh II",
        "Macintosh Columbo",
        "3D Model",
        "Apple Tomorrow",
        "3D Animation",
        "Mac Prototype",
        "Rare Mac",
        "Rare Computer",
        "Retro",
        "Vintage Apple",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Tech",
        "Computer",
        "Computer Clan"
    ],
    "views": 83592,
    "likes": 4861,
    "comments_count": 245,
    "description": "You can support this channel on Patreon! Link below Krazy Ken stumbled across a $25,000 Macintosh II Columbo server prototype on eBay. Ever since, he's been intrigued. So while he's trapped in his lair, he dispatched some spies to capture images of it, and now he'll share the story behind this forgotten Apple gem.  Check out our rare tech playlist   Download our epic wallpapers   Support our channel and get cool stuff   Check out Apple Tomorrow's 3D work on Twitter    Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Special thanks to the Columbo owner for letting my \"spies\" film their model! Another big special thanks to the remote film crew who were my spies.  More big thanks to @Mac84, @ActionRetro, and @CanadianComputerCollector for helping!  Mac84   Action Retro   Canadian Computer Collector    Big shout-out to Apple Tomorrow for making great 3D renders!   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #MARCHintosh2022 #KrazyKen #ComputerClan",
    "description_links": [
        "https://bit.ly/clan3zlKXX9",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/Apple_Tomorrow",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://youtube.com/Mac84",
        "https://youtube.com/ActionRetro",
        "https://youtube.com/canadiancomputercollector",
        "https://twitter.com/Apple_Tomorrow",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Hey. Sorry, I'm a little bit swamped right now. I've been diggin' around for months trying to find this Apple Macintosh Columbo prototype. It's actually pretty rare. It never made it to the public. The good news is I think I'm almost halfway, 10% of the way there. And when I find this thing, it's gonna be the crown jewel of my collection. (phone buzzing) Hey Steve, what's up? - Hey, Ken. I found that prototype you're lookin' for on eBay. (duck quacking) - What the. (upbeat techy music) Hey guys, how are you all doin'? If you're new here, welcome. My name is Krazy Ken and this is the Apple Macintosh Columbo prototype. When I saw this popup on eBay I immediately crosschecked the seller's photos with Rick English's photos in the Apple design book, and the model looked incredibly similar. It looked legit, so Columbo has been on my mind ever since. This particular product never made it to retail. In fact, it never really made it to the working prototype stage. The models we see in the book are hard models with no guts, they're just a chassis to demonstrate what the design could look like. So as you can maybe guess, there's not many of these around and they were probably disposed of or locked deep underground by Apple at sometime, so they're really hard to find. Which is why I was blown away when I saw one pop up on eBay. Steve from Mac 84 and I, we were just workin' on a project together and boom, out of the blue we saw this pop up on eBay. But, the seller wanted $25,000 for it which, as you can imagine, is a little bit out of my price range. Donate to my Patreon. Then later it was listed on Craigslist for $12,000. Better, but still a little steep for me. So it's a little hard for me to get my hands on it, but I have an idea. Now the guards will probably not let me out of this lair, so I need to secretly hire some spies so they can go capture some images of this rare computer product, with the owner's permission of course. So I dispatched them, and while they're collecting their intel, let's take a look at the history of what led up to the Columbo project. At Apple World 1987, VP of Product Development John-Louis Gasse introduced the brand new Macintosh II, an expandable Macintosh with six NuBus slots and a blazing fast 16 megahertz Motorola 68020 processor. Well, blazing fast for 1987. It was also the first color capable Macintosh with a video card option boasting a 16.7 million color palette, and 256 color output at 640 by 480. And the Mac II used Apple's Snow White design language, which Apple has been investing in since 1983. At the same time, Apple also launched the Macintosh SE, so they had an all in one compact computer, and a supercharged computer desktop for their customers. But in the business world you're either growing or dying, you're never standing still, so Apple started working on a new product strategy and a new design language. Apple's Jim Stewart proposed a three step transition into a new language, and internally this was named Goldilocks and the Three Bears, or G3B. Ultimately Gasse didn't like this whole transition idea, he thought it would take too long and I guess I can understand that, but he wasn't the only one at Apple who found flaws with this project. And in the end G3B didn't go very far. The funny thing is, in reality the whole transition to the new design language ended up taking a long time anyway, but we'll talk more about that soon. So Apple to a new strategy called tops and bottoms. The premise was simple; offer a badass file server Macintosh solution at the top, and a more affordable modular Macintosh solution at the bottom. Those extremes didn't exist in Apple's product strategy at the time. And in the middle, offer a mid-range business computer option. So Jim Stewart recruited Larry Barbera, and they went to work on the first component of tops and bottoms; the big file server tower codenamed Columbo. The project started in 1988 and that brings us to today. And this is what my spies are trying to film. And it looks like we're getting some images. So I'm gonna collaborate with the insanely talented Apple Tomorrow to create a 3D representation of Columbo. (bell dinging) Alright, the 3D model is complete. Let's take a look at Columbo's design. Columbo was a supersized Macintosh II with a vertically mounted logic board, and it was designed to stand on the floor instead of sitting on a desk, and it was going to feature dual Motorola 68030 processors, making it Apple's most powerful Macintosh ever. Also, this model's rear plate actually still says Macintosh II, with the Mac II's M5000 model number. The typical snow white stripes were not present in the new design, as Apple was shifting to a new language, but there were still thin cut openings for ventilation. The design was comprised of two interlocking boxes to help the unit appear less massive and look more visually interesting. The lesser touch components, like the logic board, were housed in the right side, and the more accessible components like removable hard discs, floppy drives, and CD rom drives, were built into the left side. Now the tower still looked very chunky and square, so to soften it a 50 inch radial curve was added to the front, and that curve also functioned as a door, and behind it, that's where the drives could be accessed. And when they needed to be hidden, you could simply close the door. One could argue this door premise influenced future Apple designs because you see doors on quite a few products they released in the future. And that interlocking box design is also kind of similar to the power Macintosh G3 Minitower, so I wonder if there was some influence there too. Food for thought. Columbo also had a smaller door to cover the reset and interrupt buttons, and the locking mechanism for power on off. The particular physical model I found does not have a door over these buttons, so I'm guessing at least one revision was made internally, but there were probably a bunch of revisions made, let's be honest. Another focus for Columbo was built-in cable management. This hard model does not have that, but that was something Apple was working on. This makes sense because if this is truly gonna be a file server and maybe you have a couple of them set side by side, you're gonna want cable management. So Barbera ended up calling this new design language New Look, and it was also used in the desktop version of the Columbo project. And this particular Mac had more of a pizza box style. It actually sat on your desk and the monitor was built in such a way where it could slide in and lock on top of the computer and it would look like the whole thing was one unit even though they were two separate pieces of hardware. So it seemed like a good product strategy was falling into place. Apple had three tiers of new Macs, better options for customers, and they were working on a new design language to get them ready for the future and to make something that felt approachable. However, New Look and Columbo were ultimately canceled. Gasse didn't like the curved door anymore even though he was generally outnumbered on that decision, but more importantly, market research concluded that it wasn't in Apple's best interest to compete with other server and workstation type machines from other companies. At companies like Apple it's not uncommon for this type of cancellation to happen. Oftentimes designers will have products prototyped or demoed before all of the market research is done. So you'll have maybe a couple units here and be like, hey, these are cool, but then once the market research is done, those guys will be like, mm, we don't have a need for that and then cancel those things. So it's not too uncommon. It happened a lot at Apple during this time. But there's a light at the end of the tunnel. Bits of Columbo's DNA evolved into the Quadra 900. It still used the Snow White language, but certain features, like the lock, made it through. And Apple's first official server product, based on the Quadra 950, was the Workgroup Server 95 in 1993. So despite Apple working on a file server with Columbo in 1988, it still took five years until they released their first official server product, but they persisted and they made it through. And the desktop versions of Columbo evolved into the Macintosh IIsi, and LC, which stood for low cost. And these computers featured that familiar curved front. And those Macintosh's would go on to be big sellers for Apple, so those were important releases in Apple's history. But what about the New Look design language? Yes, technically that project was canceled, but in late 1992, early 1993, Apple started launching products with a new design language named Espresso. And some of the earliest products were the Macintosh IIvx, IIvi, and the Color Classic. Less stripes, more curves, breathing gills, and baby elephant feet were present in many Apple products in that era. And Espresso lasted for about six years until the first gen iMac in the studio display ushered in a new look with Steve Jobs' return to Apple. As for the hard model we filmed, I put the owner in touch with RR Auction. It's an auction house I have used before, and my friend Alfred recently sold a Steve Jobs business card on, so I trust them. I think this is a more appropriate place to get the unit in front of a true serious collector. But more importantly, it's also a great place to get an appraisal on what the unit could be worth. It's gonna be tricky because this is the only one I know of in existence, so hopefully someone can figure out how much it really is worth. From my assessment, and I crosschecked this with another collector, it's gonna be nearly impossible to sell this thing for 12,000 bucks, let alone 25,000, because it's really worth about 2000 to 3,500. But that's still a decent amount of money. It's still a really cool collectible. And it's rare, I've never seen one in the wild. So I wish the seller the best of luck and I hope the Columbo goes to a good home. Also, there's many other canceled Apple projects like this, and I would love to do more episodes about them. And if you wanna see those make sure to leave a like so I can gauge interest. And if you'd like to see more rare and retro tech from the Computer Clan, feel free to check out this playlist and subscribe for more tech episodes coming out every week. Now, I'm off to binge a \"Columbo\" marathon. What? It just seemed appropriate. Catch the crazy, and pass it on. (upbeat music)",
    "transcript_keywords": [
        "Apple Macintosh Columbo",
        "Apple",
        "Columbo",
        "Macintosh Columbo prototype",
        "Macintosh",
        "Apple Macintosh",
        "Macintosh Columbo",
        "design language",
        "design",
        "language",
        "Apple Jim Stewart",
        "Apple Snow White",
        "product",
        "Apple product strategy",
        "future Apple designs",
        "Columbo project",
        "server",
        "Apple design book",
        "Apple design",
        "Apple started"
    ],
    "transcript_entity_values": [
        "Motorola",
        "256",
        "1988",
        "the Snow White",
        "LC",
        "3D",
        "about 2000",
        "two",
        "NuBus",
        "1983",
        "640",
        "six",
        "the Mac II",
        "16.7 million",
        "months",
        "12,000 bucks",
        "Larry Barbera",
        "one",
        "480",
        "Alfred",
        "Snow White",
        "Gasse",
        "Workgroup",
        "Steve",
        "Tomorrow",
        "Espresso",
        "Apple",
        "Columbo",
        "at least one",
        "VP",
        "first",
        "Steve Jobs",
        "1993",
        "three",
        "Barbera",
        "Macs",
        "Mac 84",
        "Ken",
        "the Color Classic",
        "about six years",
        "Goldilocks",
        "1987",
        "12,000",
        "50 inch",
        "25,000",
        "16 megahertz",
        "Patreon",
        "today",
        "Krazy Ken",
        "New Look",
        "G3 Minitower",
        "3,500",
        "John-Louis Gasse",
        "Macintosh Columbo",
        "25,000",
        "the Computer Clan",
        "68020",
        "mm",
        "early 1993",
        "every week",
        "Macintosh II",
        "the Mac II's",
        "10%",
        "eBay",
        "Mac",
        "New Look",
        "Macintosh",
        "Apple World 1987",
        "IIvx",
        "late 1992",
        "Rick English's",
        "Steve Jobs'",
        "Jim Stewart",
        "five years",
        "iMac",
        "Product Development",
        "95",
        "RR Auction",
        "Craigslist"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "FAC",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE"
    ]
}