{
    "id": "L2e4S-LsyMI",
    "title": "Nintendo Candy Taste Test!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-03-16T17:16:14Z",
    "video_url": "https://www.youtube.com/watch?v=L2e4S-LsyMI",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "nintendo candy",
        "taste test",
        "bloomingdales",
        "bloomingdale's",
        "nintendo collab",
        "nintendo taste test",
        "mario candy",
        "mario",
        "super mario"
    ],
    "views": 130871,
    "likes": 5580,
    "comments_count": 569,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys. How's it going? It's Justine. Today I'm tasting candy. And it's not a lot of candy. These are Sugarfina Nintendo themed candies and I got them on Bloomingdale's website. I don't even know if you guys know this or not but Bloomingdale's has been doing this little partnership with Nintendo. They have really cool displays in their stores. I was freaking out when I saw that this was a thing because obviously I love Nintendo. I don't wanna really talk about it much, but I shop at Bloomingdale's way too much. So it's like the combination of two of my favorite things! Yeah! You better believe I was excited! And then I went on the website and I was like, what? It was probably like midnight when I first saw that they started releasing this stuff and I was getting super, super excited. But the thing is, all of the women's stuff was just slightly inspired by Nintendo. They had like a Mark Jacobs green and red purse, for Mario and Luigi. They had some rainbow sweaters, they had some weird little graphic tees or sweaters that say like game on or game over or play on. I'm not really sure. They did have a few little accessories like a purse with Peach on it. I think they had some Iphone cases, but they were not for the Iphone 10. So a lot of things took my excitement level and just knocked it down a little bit. And then, I was even more upset because when I went and looked at the men's clothes, they had super cute little character tee shirts. So they basically had everything that I wanted but it was all for the guys, which is fine, I could have just bought the guys clothes, but then it's gonna fit like a guy tee shirt on my not guy body. (mumbles) so upset! But then I saw this. These are Sugarfina candies, they have Super Mario clouds, Yoshi eggs, and strawberry mushrooms. So they redeemed themselves, but still, I'm a little upset about it. Although I did buy the camo fanny pack and the camo bookbag, so at least those thing are coming. But they said the ship time was like 40 days or something silly but whatever, I'm still excited about it. So let's do a little taste test of these candies. I also bought these for Ro because Sugarfina is one of her favorite candies, and obviously it's Nintendo themed, so I think she's gonna be into it. First up, let's try the Super Mario clouds. I don't want to ruin their beautiful packaging, so I'm just gonna kinda give it a slice, just like that. Mmm, okay. This is a nice taste. I can't even figure out what it is. It's some type of fruit, it's kind of like a crunchy, maybe an apricot? Maybe coconut, could be coconut? I'm not sure, like I can't really tell. It was kind of crunchy, potentially an apricot, maybe coconut. I don't know, I'm not a very good taste tester. This taste test is a taste test fail. Even though I don't know what the taste was, it tasted good. So that's a plus. Let's try one of the Yoshi eggs next. Oh, these are massive. Look at this! Let's try this big pink one. (candy crunches) Oh. What is this? It's like some sort of chocolately malt ball. (knife thumps) Oh, yeah, it is. A real crunchy little delight. Mmm, so far I think that the Yoshi eggs are my favorite out of the two that I've tried so far. I love chocolate, so anything chocolate is a win in my book. This is interesting because all of these other ones say made in the USA, but the strawberry mushrooms say that they're made in Sweden. Let's taste it up. The design on these stickers and packaging is spot-on. It's really beautiful. Dun-da-da-dun. So here's the gummy. It a has a red little top, which is like Toad, and a white little squishy bottom, so this just looks like a little strawberry gummy. Doesn't exactly look like Toad, I don't know, kind of looks like a turtle shell, if you ask me. Let's taste it. Mmm, it is very, very chewy. I also think I might have a cavity, 'cause this is a little bit painful. This tastes really, really good. I think because it has that little bottom white part, it kind of had more of a milky kind of flavor to it, or like a texture. So it sort of tasted like a strawberry milkshake. Okay, so now I think the strawberry one is my favorite. So it's gonna go Toad, to Yoshi, to the clouds. These are so cute. I don't wanna eat any more of them because I feel like they're collector's items and I wanna save them I know this was kind of a short little video, but I was so excited about these that I wanted to share it with you guys before they run out. This is not sponsored in any way. I bought these, no hashtag add, I just thought they were really awesome and I didn't want you guys to miss out, especially 'cause I know a lot of you guys are huge Nintendo fans. And I didn't even know this thing existed. Especially if you don't shop at Bloomingdale's very often, it's something that could be easily missed by a lot of Nintendo fans. So feel free to check it out, let me know what you think, and ladies, are you just as upset as I am about their Nintendo inspired collection? I get it, it's inspired by Nintendo, let's be real. I want the shirts that you have for the guys, for us. It's an equal opportunity here, and you missed 50 percent of it. I'll see you guys in my next video. That's it, I'm gonna go probably eat the rest of these now. See you later! Before I go, did anybody else use the Mario in Google Maps for Mario Day? It was the best thing ever. It still is working right now, so I've still been using it for the past couple of days. I love it! (jazzy piano music)",
    "transcript_keywords": [
        "Nintendo",
        "guys",
        "taste",
        "Super Mario clouds",
        "Mario",
        "Bloomingdale",
        "Super Mario",
        "kind",
        "super",
        "Yoshi",
        "thing",
        "Sugarfina Nintendo themed",
        "Nintendo themed",
        "Yoshi eggs",
        "Sugarfina Nintendo",
        "Nintendo fans",
        "Mario clouds",
        "strawberry",
        "Hey guys",
        "taste test"
    ],
    "transcript_entity_values": [
        "the past couple of days",
        "Yoshi",
        "Peach",
        "Justine",
        "40 days",
        "Nintendo",
        "Luigi",
        "Iphone",
        "Mark Jacobs",
        "Bloomingdale's",
        "Today",
        "midnight",
        "Toad",
        "Sugarfina Nintendo",
        "Sweden",
        "Nintendo",
        "Sugarfina",
        "USA",
        "Mario",
        "Ro because Sugarfina",
        "two",
        "Super Mario",
        "Dun-da-da-dun",
        "First",
        "50 percent"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "NORP",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "TIME",
        "PERSON",
        "PRODUCT",
        "GPE",
        "PERSON",
        "PRODUCT",
        "GPE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "PERCENT"
    ]
}