{
    "id": "l2erH_yo7-c",
    "title": "How I flew from New York to Japan for $300",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-11-08T14:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=l2erH_yo7-c",
    "category": "Science & Technology",
    "tags": [
        "travel",
        "new york",
        "airlines",
        "cheap flights",
        "travel tips",
        "budget travel",
        "airline travel",
        "price",
        "verge",
        "buy",
        "cheap",
        "money",
        "finances",
        "travel video",
        "flying",
        "japan",
        "delta",
        "asia",
        "getaway",
        "tickets",
        "ticket",
        "how to",
        "how to make",
        "diy",
        "travel vlog",
        "pro tips",
        "traveling",
        "vacation",
        "blog",
        "tips",
        "trip",
        "travel hacks",
        "business trip",
        "how to travel",
        "life hacks",
        "travel in 2018",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "mkbhd",
        "marques brownlee",
        "apple google",
        "iphone",
        "review",
        "microsoft",
        "the verge"
    ],
    "views": 116065,
    "likes": 3306,
    "comments_count": 124,
    "description": "Planning a vacation doesn't have to break the bank if you know where to look. If you're ready for a break, here are some useful travel tools, services, and apps that'll help you design your next getaway.  Here are some of the sites mentioned in the video:  Airefarewatchdog:  Airbnb:  Trip Advisor:  HostelWorld:  CouchSurfing:  Viber:  Bonappetour:   Read more about them here:   Note: we sometimes place affiliate links directly to the best deals in our video descriptions, so we may earn a commission if you buy something.  The Verges sponsors play an important role in funding our journalism, but do not influence editorial content. For more information about our ethics policy, visit   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://fave.co/2TNtkdU",
        "https://fave.co/2S18HsI",
        "https://fave.co/2S0Hkzk",
        "https://fave.co/2ByGRyX",
        "https://fave.co/2WVPtIZ",
        "https://fave.co/2S3HPIZ",
        "https://fave.co/2S0x8qk",
        "https://www.theverge.com/2017/7/28/15921842/how-to-plan-a-vacation-travel-apps-flight-deals-abroad",
        "https://www.theverge.com/ethics-statement",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- So a lot of people have told me I tend to be a little extra when it comes to travel planning. And that's true, but that's because I like having control over where I go and how I spend my money. I'm sure that's important to most of you too. So, I'm gonna show you all the tools that you can use to plan to plan your next vacation. As a professional travel planner for eight months, and an amateur one for basically, all of my adult life, I love travel planning. Here's where I like to file for budgeting. A vacation for just yourself should cost roughly around the same as what you make in one paycheck. That way you're neither making or losing money either way. And you give yourself the option of either going to a really fancy resort for a weekend or a backpacking trip on a budget for one week. But obviously, everyone's situation's a little different, especially if you've got family members to account for. For that budgeting, you can use a tool on BEFRUGAL.COM to figure out whether you should drive or fly to a place. It even factors in costs like tolls and gas prices for driving and taxis to and from the airport for flying. But I'm gonna focus on flights because a good flight deal can really feel like they're hard to find. Have you ever heard of people who've scored crazy flight deals from New York to Japan for $300 dollars? I've been one of those people. It was amazing. But it probably helps to first understand how flight pricing works. The majority of air fares you see are targeted to two kinds of travelers. There are those who will pay any price because they need to be somewhere a specific time. That's folks traveling for business, a family emergency, a wedding. And then there are the flexible travelers who are willing to put up with mid-day flights or layovers to get a better deal. So in that sample from New York to Tokyo, the prices might fall into this range. Now of course, airlines are incentivized to make the most money per seat. So the majority of the fares you will see likely fall between this middle range in prices. But, when it's time for an airline to try to fill its empty seats, it may just straight up drop prices. That's where these seats in the lower range become up for grabs. Keep in mind that when an airline drops prices, it drops services too. And this is notorious for domestic flights or ones from low cost carriers. Cheap flights often come with restrictions, such as not being able to pick your seat, bring overhead luggage or having to fly at inconvenient times. These budget options are becoming more popular so that airlines can get their prices in the top of search. So read the fine print before you book. But back to my magical $300 dollar fare. That was actually a mistake fare, which happens when a human or technical error causes a flight to get to literally be sold at the wrong price. This is pretty rare and not all airlines will honor it. But if you do find one, wait until you have a confirmed booking before you start booking places to stay. Currently, I'm looking to book a flight in early December. And I'm pretty flexible on where. Some of my favorite places to find deals are like the Flight Deal or Scott's Cheap Flights or AirfareWatchdog. These are newsletters that track price drops. I'm looking through here and... There are active deals like Copenhagen for $333 dollars. These are pretty good. But I'd like something a little cheaper and a little closer to home. Now this one from the Flight Deal is a $178 dollars to Martinique. It's about a four hour flight. That seems pretty good. I might actually consider that one. One last place I also like to look is Google Flights. So it looks like Google Flights and the Flight Deal are both showing this Martinique flight for 178. It's through Norwegian Airline and that's probably coming up because Norwegian just opened a flight route between New York and a lot of different places. So they're probably incentivizing people to buy tickets to fill their planes that's why it's so cheap right now. You can book a flight like this through aggregators like Orbitz or Expedia and earn points, but booking directly with an airline will give you more leverage if there are travel disruptions or cancellations. Check with your credit card companies too if they offer travel protection. Now, you've got a place to go and now it's time to think about a place to stay. Sites like Homeaway and Airbnb are great options for people who want more of a local vibe or places that are unique to them. If your prefer things like housekeeping or in-room dining, you might choose a hotel, in which case Trip Advisor forums could be a good place to start to look for places that might suit you. And if you're really on a budget, sites like HOSTELWORLD or COUCHSURFING can be good alternatives for finding places to stay on the cheap. Now let's find some things to do. I like to mix my resources. So that's TripAdvisor forums and LonelyPlanet guides. But also look at some YouTube bloggers to see what they've done or even Instagram location tags of different cities. Now, I'm a huge nerd, so when it comes time to put together my itinerary, I like to make Excel sheets in InDesign documents. Most people don't have that kind of time. Apps like Google Trips can be a great option for you to pull all your travel info together, such as maps, hotel bookings, train tickets, what have you. Tip time. Here are some things you should do before you go. Download all the apps you need beforehand. That's offline maps so you can navigate without internet. Ride hailing apps, money exchange converters, maybe a dictionary if you're going to a place where you don't speak the language. Check with your mobile carriers to see if they offer international data plans. Some of them are free. Some of them are cheap. So, look through that before you decide whether you need to buy a Sim card at the airport. Lastly, set a travel notice for your credit card. The last thing you want to happen is to get to a foreign place with no money. I'm really excited for a trip now. Um... But first I need some time off. Uh, Deeder, can I have some time off? (slight chuckle) Travel is so personal, so I'm sure I didn't get to all of your favorite tools. So share them with me in the comments. Let me know. Also, if you haven't already, subscribe to us on YouTube.com/the verge.",
    "transcript_keywords": [
        "flight",
        "flight deal",
        "flights",
        "place",
        "time",
        "Google Flights",
        "travel",
        "places",
        "deal",
        "prices",
        "good flight deal",
        "Cheap flights",
        "people",
        "Cheap",
        "money",
        "airline",
        "Scott Cheap Flights",
        "good",
        "deals",
        "York"
    ],
    "transcript_entity_values": [
        "New York",
        "COUCHSURFING",
        "Google Flights",
        "one",
        "Norwegian",
        "Airbnb",
        "eight months",
        "TripAdvisor",
        "178",
        "Orbitz",
        "one week",
        "Norwegian Airline",
        "Copenhagen",
        "Scott's Cheap Flights or AirfareWatchdog",
        "Excel",
        "Expedia",
        "$300 dollar",
        "two",
        "four hour",
        "early December",
        "One",
        "$178 dollars",
        "Japan",
        "Sim",
        "$333 dollars",
        "Martinique",
        "InDesign",
        "YouTube",
        "first",
        "mid-day",
        "Instagram",
        "Tokyo",
        "HOSTELWORLD",
        "$300 dollars",
        "a weekend",
        "Deeder"
    ],
    "transcript_entity_types": [
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "MONEY",
        "GPE",
        "ORG",
        "MONEY",
        "NORP",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "GPE",
        "NORP",
        "MONEY",
        "DATE",
        "PERSON"
    ]
}