{
    "id": "L5VWWba0coY",
    "title": "Pocophone F1 Teardown - I found LIQUID inside!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-09-18T13:34:38Z",
    "video_url": "https://www.youtube.com/watch?v=L5VWWba0coY",
    "category": "Howto & Style",
    "tags": [
        "pocophone f1 depth review",
        "Pocophone F1",
        "Pocophone",
        "Pocofone",
        "Pocophone Review",
        "Pocophone Teardown",
        "Pocophone take apart",
        "pocophone f1 durability test",
        "poco f1 water test",
        "water damage",
        "how to fix pocophone",
        "repair pocophone"
    ],
    "views": 4152766,
    "likes": 83597,
    "comments_count": 5336,
    "description": "Lets Teardown the Pocophone F1. Quite possibly the most popular budget phone of this year. Lets see if that internal liquid cooling has any actual liquid inside of it. Opening up the Pocophone F1 is actually pretty simple. It is super similar to the older iPhone design. With two screws holding together the pocophone, and then the back housing being removed.   Pocophone Durability test video:   Awesome Smartphone Tool Kit:  BIGGER tool kit:  Green Pry tool:  Metal phone opening tool:   Customize your Tesla with my link:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/IXLvNrUTUYw",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://ts.la/zack10701",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRig..."
    ],
    "transcript": "The Pocophone F1 could very well be the most anticipated and requested budget phone of this year. We should poke around on the inside for a second. With massive specs and a super cheap price point, it's easy to see why it's so popular. Let's get started. [Intro] Getting inside the Pocophone F1 is pretty simple. There is no waterproofing gluing everything together, it just has the two T3 screws down at the bottom and a screen that pops out of the back panel like the older iPhones used to do. The screen is pretty tightly situated inside that back housing though, which is why we didn't see the screen pop out of the housing during the bend test it's tight. After removing the SD card tray, I was able to eventually detach the 1080p display and hardware away from the back panel. As it detaches, we get our first look inside the Pocophone with the fingerprint scanner ribbon attached to the inside of the polycarbonate back plastic panel. I'll switch my screwdriver bit to a normal Philips head, which I'll link below, and remove the 10 screws holding the black plastics above the motherboard. Once those plastics are removed, we get a glimpse at what looks like a complex smorgasbord of connectors, but it's actually pretty simple. I'll unplug the battery first, so there's not any power running through the phone while we continue to operate. Then we'll get the fingerprint scanner unsnapped like a little Lego and set the entire back panel off to the side. There's no making this one clear since everything's plastic, but at least we got an Art Class with Jerry out of it. A quick disconnect of the side buttons and black signal wire connector and the extension ribbon for the charging port, leaves us with 2 silver screws holding in the motherboard. I'll keep these separate from the other 12 screws we've already removed, and then the screen ribbon cable gets unplugged. The whole motherboard can now be pulled out of the phone body, exposing the tip of Xiaomi's F1 liquid cooling system: a copper heatpipe with a dollop of thermal paste on top, which helps to transfer the heat away from the processor, keeping things running more efficiently. We'll find the other end of the copper pipe in a second. First, the motherboard. It appears pretty interesting. We have the front facing 20 megapixel camera with an infrared illuminator next to it that works in tandem with the infrared camera for the face unlock feature. There are two rear cameras facing the opposite direction, each with their own individual Lego style connector. And both cameras are situated in the same metal housing, lined up perfectly so they can assist each other with photo detail while taking pictures. The main 12 megapixel sensor does have some movement to the lens, but it's probably just for focusing, as the Pocophone does not include optical image stabilization on either of the rear cameras, which is a little disappointing, but it is still a budget phone. The last thing I want to point out is that inside this phone, there are water damage indicators on every single surface including both sides of the motherboard. They are currently white, but turn pink if your phone is around water, or even steam from the pool or shower. So keep it dry and away from moisture. This massive advertised 4,000 milliamp hour battery has the same capacity as the $1,000 Note 9, and over double the capacity of an iPhone 8. Thankfully it does come with it's own pull tab and manageable adhesive. The battery has a rated capacity of 3900 milliamp hours and a peak of 4,000. Now that the battery's out, we get a closer look at the other end of the copper heatpipe. This time around, it doesn't include a large copper plate like we saw in the Samsung Note 9, but it looks to be about the same length. I'd compare the 2 side by side, but I kind of chopped the Note 9 pipe into bits. Either way, in the Pocophone F1, the copper heat pipe conductively pulls heat away from the processor into the slightly cooler area underneath the battery. Xiaomi calls this a liquid cooling system with industry leading thermal performance. Boiling down the big words, it really just means it's a copper heatsink with less than a drop of water inside a vacuum sealed pipe. If I pop open the pipe quick enough, you can see the water evaporate out of the vacuum into the air. These little fibers inside the pipe help wick the water to and from the heat, exactly like we saw in the Galaxy Note 9. It's definitely a cool system, and especially awesome to see inside of a budget phone, like this Pocophone F1. It definitely deserves a thumbs up for that. I like seeing that the competition in the budget realm drives bigger innovations with the major flagships. I'll just, you know, close this back up. Perfect. Let's see what kind of vibrator we're working with. Seven screws hold the black plastics over the charging port daughterboard, including 2 sweet looking blue screws. I've never seen that before. The plastics pop off including the loudspeaker along with it's 2 golden contact pads. Still zero signs of water proofing. I'll remove the black signal wire and you can see another big white water damage indicator right next to the charging port hole. The red stuff underneath leads through the white portion when it's wet. The charging port board has some adhesive holding it to the frame. There is no rubber ring around the charging port itself, so once again, this thing has no protection against liquid whatsoever. The circular vibrator is in the bottom right corner and he's a tiny little guy. Overall, I'm super impressed with Xiaomi's new Pocophone project. I haven't always been a fan of Xiaomi's build quality since they do have a few phones on my Shelf of Shame, but they've taken a huge step in the right direction with this durable, yet extremely powerful budget phone. I'll get the 2 silver screws back into the top of the motherboard. I always have my fingers crossed when it's time to see if these phones still work after a teardown. I'll make sure everything's plugged in, including the fingerprint scanner and the battery, before putting the black plastic plate with it's 10 screws back into place. Finally, I'll pinch the 2 halves of the Pocophone back together. This phone is a winner. Hit that subscribe button. I have a lot of fun videos on the way. Would you consider buying this Pocophone? What's your next phone going to be? Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "Pocophone",
        "phone",
        "back",
        "inside",
        "budget phone",
        "screws",
        "requested budget phone",
        "back panel",
        "anticipated and requested",
        "screws back",
        "water",
        "charging port",
        "back plastic panel",
        "motherboard",
        "Pocophone back",
        "copper",
        "battery",
        "pipe",
        "Note",
        "plastics"
    ],
    "transcript_entity_values": [
        "this Pocophone F1",
        "9",
        "4,000 milliamp hour",
        "1,000",
        "Xiaomi",
        "SD",
        "Lego",
        "Pocophone",
        "two",
        "The Pocophone F1",
        "the Pocophone F1",
        "Philips",
        "Jerry",
        "T3",
        "Samsung Note 9",
        "zero",
        "10",
        "this year",
        "iPhones",
        "first",
        "second",
        "Xiaomi",
        "First",
        "12",
        "2 halves",
        "4,000",
        "Seven",
        "20 megapixel",
        "one",
        "3900 milliamp hours",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "NORP",
        "ORDINAL",
        "ORDINAL",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL"
    ]
}