{
    "id": "L62a0FchGV8",
    "title": "The Keyboard Phone Is Back (Again): Hands-On With The F(x)tec Pro 1",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-02-27T17:14:28Z",
    "video_url": "https://www.youtube.com/watch?v=L62a0FchGV8",
    "category": "Science & Technology",
    "tags": [
        "fxtec pro 1 review",
        "livermorium phone",
        "fxtec pro1 hands on",
        "qwerty phone",
        "keyboard phone",
        "michael fisher",
        "mrmobile",
        "android central"
    ],
    "views": 266182,
    "likes": 9268,
    "comments_count": 1464,
    "description": "If you thought the only way to get a high-end smartphone with a keyboard was to buy a BlackBerry, you were right  until now. London-based F(x)tec aims to bring back the best of yesterdays technology, and its first smartphone, the Pro1, does that with a modern twist. The old: a five-row, 64-key QWERTY keyboard and a sliding hinge that props up the screen at an ergonomic 155 degrees. The new: Android Pie on a 6-inch AMOLED. The : a two-generations-old Snapdragon 835 processor and a price starting around $649. The F(x)tec Pro1 is up for pre-order now, with expected shipping in July. Join me for a Pro 1 hands-on from MWC 2019 in Barcelona!   [SUBSCRIBE TO MRMOBILE]      [ABOUT MRMOBILE'S F(X)TEC PRO1 HANDS-ON]  MrMobile's F(x)tec Pro 1 Hands-On was produced following 90 minutes with a Pro 1 review device during a press briefing at  #MWC19 in Barcelona. Preproduction device running pre-release software.   [MUSIC]  True Persistence by Cymatix, available at Premium Beat:     [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #fxpro1 #pro1 #fxtec #keyboard #qwerty #blackberry #tech #mwc19",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.premiumbeat.com/royalty-free-tracks/true-persistence",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] If you thought the only way to get a high-end smartphone with a keyboard was to buy a BlackBerry, well, you were right. Until now. From Mobile World Congress in Barcelona, I'm Mr. Mobile and this, this is a little piece of the past to come back to life. (upbeat electronic music) F(x)tec is a tiny team based out of London devoted to bringing back what's missing from today's technology and making it better. As a guy who uses a BlackBerry everyday, that speaks to me. Giving up physical keys for smartphones with bigger screens brought a lot of benefits, sure. But losing the tactility of typing was a trade-off not all of us were fond of. Like the old Nokia smartphones that inspired it, the Pro 1 tries to give us the best of both worlds. A big six inch AMOLED screen and a five row QWERTY keyboard. The two joined by an articulating hinge that deploys the display at 155 degrees. Designs like this got my attention as a college student over a decade ago. But after trying a few, I found that the landscape layouts slowed me down because of the added distance between keys compared to a portrait style Palm or BlackBerry. Well, F(x)tec thought of that and to combat it, it's clustered the letter keys in the center of the board. It's also been careful not to place the number row too close to the display, a common problem with some older designs that resulted in a cramped typing experience. It's clear a lot of thought went into this keyboard. And even using this early build, I'm impressed. Key travel is limited but the feedback is a firm, consistent click on each key. Eventually, I'm told the Pro 1 will also bring features like app shortcuts. Fundamentally, this hardware is sound. Elsewhere, the makers have leveraged all the added volume that comes with this big casing. There's a headphone jack, side firing stereo speakers, fingerprint reader, even a two-stage camera button. For software, we've got a near-stock build of Android 9 with a small tweak to the launcher to keep widgets properly proportioned when switching orientations. For a company that started out building a Moto Mod that never really came to pass, this is impressive progress. Now you're gonna find compromises anytime someone tries building a smartphone this specialized. At full HD+, the display falls short of super sharp and it's protected by older Gorilla Glass 3. The full aluminum backplate means there's no wireless charging and the Snapdragon 835 at the heart of the phone is two generations old. That last pill is the toughest to swallow when you take a gander at the price tag of cool $649 when the phone starts shipping in July. But then F(x)tec knows the same thing all keyboard phone makers know. They're offering something exceedingly rare, something that some people miss. Whether there are enough of those folks to make the Pro 1 a success is a question as open as all the others I have about camera quality, software responsiveness, battery life. Questions that can only be answered in a full review. Let me know if you'd watch such a review by subscribing to theMrMobile on YouTube. And if you already know you're buying one, well pre-orders are live right now at F(x)tec's website. Meanwhile, let's close out the last video of MWC with a nostalgia party. Tell me your favorite keyboard phone memory in the comments below. Until next time, thanks for watching. And stay mobile, my friends.",
    "transcript_keywords": [
        "Mobile World Congress",
        "highend smartphone",
        "Congress in Barcelona",
        "keyboard",
        "Ftec",
        "World Congress",
        "buy a BlackBerry",
        "Pro",
        "keyboard phone",
        "phone",
        "BlackBerry",
        "Mobile",
        "row QWERTY keyboard",
        "keys",
        "Mobile World",
        "Nokia smartphones",
        "display",
        "thought",
        "highend",
        "buy"
    ],
    "transcript_entity_values": [
        "BlackBerry",
        "F(x)tec",
        "QWERTY",
        "Mobile",
        "Mobile World Congress",
        "today",
        "155 degrees",
        "jack",
        "Michael",
        "two",
        "a decade ago",
        "Nokia",
        "Barcelona",
        "Android 9",
        "six inch AMOLED",
        "649",
        "July",
        "London",
        "YouTube",
        "MWC"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "GPE",
        "FAC",
        "QUANTITY",
        "MONEY",
        "DATE",
        "GPE",
        "GPE",
        "ORG"
    ]
}