{
    "id": "l87M93p7PC0",
    "title": "This Might Give You Faster Internet",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-06-24T18:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=l87M93p7PC0",
    "category": "Science & Technology",
    "tags": [
        "eero",
        "eero home",
        "wifi",
        "internet",
        "faster internet",
        "system",
        "wifi system",
        "router",
        "best router",
        "router 2016",
        "tech",
        "technology",
        "unboxtherapy",
        "unbox therapy",
        "android",
        "ios",
        "apple",
        "samsung",
        "nexus",
        "6p",
        "nexus 6p",
        "iphone 7",
        "iphone 6s",
        "review",
        "iphone",
        "unboxing",
        "smartphone",
        "best",
        "6s",
        "new",
        "iphone 6",
        "vs",
        "phone",
        "gadgets",
        "galaxy",
        "iphone 6s plus",
        "s7",
        "apple iphone",
        "test",
        "apple iphone 6s",
        "android (operating system)",
        "apple inc. (publisher)",
        "futuristic",
        "apps",
        "google",
        "s7 edge",
        "galaxy s7",
        "smartphone (video game platform)"
    ],
    "views": 2027178,
    "likes": 40495,
    "comments_count": 3296,
    "description": "*0_0* ----- Today's Mystery Video -  ----- *0_0*  eero Home WiFi System -   This is the eero Home WiFi system. It claims to blanket your home in WiFi. Systems like this have previously been more complicated. This one on the other hand has incredibly easy setup. Your grandma could probably do it! You can set up the eero using either Android or iOS.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/qjLNV2gnqx4",
        "http://amzn.to/28SS7Gj",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys, Lew here back with another video. And today, as you can tell, I have a beautiful little package. This arrived from a company called \"Eero\". E - E - R - O These guys claimed to have fixed the age old wifi-problem. On the outskirts of your house on the edges, on the fringes... Maybe its a bedroom somewhere, maybe its the basement and that signal, it just starts to drop off a little bit, or maybe, it comes and it goes, or maybe it was never there to begin with. The idea here is to have multiple little stations to spread that network more widely Anyway, lets get inside. Look at how they packaged this. Its exciting! Apparently I havent opened a package in a long time. Okay there we go. Blanket your home in fast, reliable wifi. No more buffering, no more dead zones. Thats a very attractive proposition. Thereve been other ways of achieving this. But Its never been a super simple setup, for the most part. So theres an app to ensure that the setup goes seamlessly, hopefully. Look at the packaging! Very apple esc? It has a 1 gigahertz dual core processor, 512 ram, 4 gigabytes of flash storage (thats in each unit) I know many of you are gonna say, But Lew! Why not just spend the money on a better router? Well yeah, I mean if you live in an apartment or something. But, if youre in one of those pesky environments You have drop offs, dead zones, you have to cover a large area with walls all over the place. And a system like this is pretty tough to beat. Nice unboxing experience! Those kinds of reminds me of something Maybe uh.. Apple TV? You got a reset button, power, 2 ethernet ports, and then a USB port. But I believe the USB port is only gonna be used for Firmware updates or something along those lines. Pretty substantial cable as well. A power brick which is apparently just as stylish. Android.. Yeah its here. IOS Wow look at the reviews! Theyre pretty good. Heres what you need.. Right, got it. Unit number 1, plug it in into the modem, as asked, of course the wall as well, and then Ill come right back and well get the other units set up So Its connected now, to the router. Thats.. How far away is that? Thats uh.. 40 feet (12,2 meters) ? Something like that? You can pick a room so we can call that a particular room. The Situation Room Woah.. The other units, I got to get these babies juiced up. I wanna start immediately extending my network. Oh network name.. Alright I gotta do some basic stuff. Im just gonna call it Eero for now.. And password, I dont need a password! I need a password Its kind of just like next, next, next, success, your network is running. Now, add another Eero. For optimal performance, place within 40 feet (12,2 meter) of each other. So were right on that fringe of like how you should set this up. Oh found it! Its using some kind of bluetooth situation. BOOM! Alright add another one You can see this, anybody could do this! I mean look at them! Theyre pretty friendly looking! Ok were good, got a little speed test going on here, tells me the number of devices connected, I can set up guest access, family profiles. Ive got another router back there. I could do a quick speed comparison. Im on the Eero network right now... Oh.. Pretty fast! Not bad! So now were on the network I was using previously. Just a router sitting in the room over there Oooooh I know the nerds are screaming at me right me right now going, Well if you were standing right beside the other router.. Of course, but what Im trying to portray to you is how most people setup their wifi. Do you need it? I dont know. I dont know how grim your situation is right now But what I do know.. is youre like me. And you appreciate quality wifi. So if youre having problems.. Its time to talk to somebody about it. And Im listening... And apparently folks at Eero are too...",
    "transcript_keywords": [
        "Eero",
        "network",
        "pretty",
        "room",
        "router",
        "USB port",
        "Situation",
        "Lew",
        "video",
        "setup",
        "guys",
        "wifi",
        "Apparently",
        "password",
        "set",
        "back",
        "USB",
        "Eero network",
        "Situation Room Woah.",
        "apple"
    ],
    "transcript_entity_values": [
        "1",
        "12,2 meter",
        "1 gigahertz",
        "Lew",
        "512",
        "today",
        "Apple TV",
        "USB",
        "12,2 meters",
        "4 gigabytes",
        "Eero",
        "Firmware",
        "40 feet",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL"
    ]
}