{
    "id": "L8x8z4fcwHo",
    "title": "Intel's done for...",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-08-19T00:45:04Z",
    "video_url": "https://www.youtube.com/watch?v=L8x8z4fcwHo",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "AMD",
        "Epyc",
        "Genoa",
        "96 cores",
        "192 threads",
        "multi-threading",
        "CPU",
        "server",
        "AMD CPU",
        "processor",
        "Ryzen",
        "Threadripper",
        "best CPU"
    ],
    "views": 556815,
    "likes": 40677,
    "comments_count": 1316,
    "description": "Install Mech Arena for Free  IOS/ANDROID:  and get a special starter pack  Available only for the next 30 days   LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:  ---------------------------------------------------  Timestamps: 0:00 It's our thing 0:10 AMD Epyc Genoa leaks 0:59 GamersNexus vs Gigabyte AGAIN 2:04 Social media vs Taliban 3:23 Mech Arena 4:21 QUICK BITS 4:30 Fortnite Impostors 4:59 Pixel 5a with 5G 5:36 T-Mobile data breach 6:12 FlickType vs Apple 6:42 Boston Dynamics will end us  AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://clcr.me/TechLinked",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/yb3y3",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Oh, my gosh, you clicked the video. I actually made this one special just for you. - [James] You would do that? - Don't tell the other viewers, they won't understand. - [James] They don't get you. - It's our thing. AMD has been steadily ramping up the number of cores in its CPU's and for its next server processor team red might take it to a whole nother level. Documents posted by leakers describe AMD's next gen epic server processor, code named Genoa, as having a whopping 96 cores and with multi threading enabled that's 192 threads! - [James] That's like a blanket. - That's what the joke I was going to make! Is this a CPU or premium satin bedsheets? - [James] Actually it's infinity fabric. - These people don't care about thread counts. The documents were apparently sourced from the recent hack on Gigabyte's servers, which is the absolute last thing that company needs right now thanks to the whole exploding power supply controversy. We should've just put some of those PSUs around their servers as like defensive measures. Speaking of exploding PSUs, time for an update on that story. Gigabyte released a statement following Gamers Nexus' excellent investigation into a pair of dangerous power supply models being forcibly bundled with GPUs at Newegg, but now Gamers Nexus has released a new video criticizing the company again for doubling down on the nonsense. For one, Gigabyte claimed their PSUs only failed after heavy testing, which doesn't represent real world use but-- - [James] You don't know me. - You don't know what I use my power supply for. Powers my life! But some units actually failed after two minutes or less of normal use. For two, Gigabyte is offering to replace broken units, but not issuing a recall, which will probably lead to many owners of these units losing gaming matches because their PC is literally on fire. For three, Gigabyte knew about this a year ago and did nothing. So definitely watch Gamers Nexus' full videos if you love a good excoriation. - [James] No breathing. - Excoriation! I actually don't know that song. And in the wake of the Taliban reclaiming Afghanistan, thanks to America's withdrawal, social media companies are struggling with what to do about the group's presence on Western platforms. The Taliban is classified as a terrorist organization, but they'll now be acting as the defacto government of Afghanistan. Facebook will continue to ban any Taliban accounts and posts, praising, or supporting them on Facebook and Instagram. While Twitter appears to be allowing Taliban representatives to post as long as they obey its rules of conduct. Which I'm sure they will. They seem like they are the rule following type. But the question for WhatsApp is more complicated. Since as an encrypted platform, it can't see the content of its users messages, but it can shut down accounts when they're identified as Taliban affiliated. As it is doing with the helpline set up by the Islamic organization that Afghan civilians can use to report violence or looting. In the west, WhatsApp is getting praised for this, but experts in the middle east, say the move may just end up harming Afghans who may actually need help even if it is from the bad guys. Also, I still don't believe that Facebook isn't peeping on WhatsApp chats, but I mean props to them for keeping up the bit. It's a lot. It just keeps going. - [James] It's called the signal protocol, Riley. - You signal instead. Is that what you're saying? - [James] WhatsApp uses the signal protocol. - Sure they do, dude. Now it's time for quick bits brought to you by Mech Arena Robot Show Down, the brand new, free-to-play, mobile competitive multiplayer game on both Android and iOS. As the name implies, you'll wage warfare using dozens of war robots with special abilities and unique weapons and levels designed for tight, fast PVP gameplay. Meet friends and form teams to dictate the tides of war in tactical control point capture matches or brutal team death match battles. You can even create custom matches in play or run tournaments, network with other bad-ass Mech pilots! Mech Arena just launched globally, so to celebrate, if you start playing before August 19th, they'll give you free welcome gifts! Aw! It's completely free to play on Android and iOS right now. And if you use our link in the description or the QR code on screen, you'll get one Steel Reaper Skin, 500 A-coins and 70,000 credits. All you got to do is scan this QR code on screen or click the link below. So do it! Quick bits! (gasps) Did you ever think they'd even be possible? - [James] Quantum bits. - With dark technology now? - [James] And nanotubes. - Epic Games just launched the new Imposters mode in Fortnite with nary a mention of Among Us, the extremely popular game that the new mode is quite obviously based on. Inner Sloth, developer of Among Us tweeted that they would have loved to collab with Epic on the new mode, but like, you know, whatever, it's not like Fortnite has collabed with literally every other franchise ever. Except PUBG, of course. 'Cause Fortnite, you don't know that, you don't know about games. - [James] I do so. - You've played StarCraft. As was foretold by the leaks, Google announced the Pixel 5a with 5G yesterday and at 449 USD, it seems like a no-brainer for anyone in the market for a Pixel. It's got a bigger battery, bigger screen and the same processor as the Pixel 5, plus it's got a headphone Jack. It does have slightly less RAM and no reverse wireless charging. - [James] Who cares? - But I would get it anyway. Oh wait, I can't because it's only available in the US and Japan! On behalf of Canada I am sorry you chose to do this Google. It's a bad, this is a bad thing you did. We're all upset. - Oregato. - Non oregato! T-Mobile has confirmed early reports that it's suffered a data breach. But while a hacker was originally claiming to have access to a hundred million accounts, the carrier says only 49 million users were affected. - [James] Small potatoes. - Peanuts. But the data includes names, dates of birth, social security numbers, and driver's licenses. So this breach is kind of a big deal. T-Mobile has promised to pay for two years of identity theft protection and is offering an extra step to protect your account called account takeover protection, whatever that is. It's just like a gun. - [James] A panic room. - Just a little sword. Here you go. The developer of FlickType, an iOS keyboard app for blind users is shutting it down after years of what he describes as abuse by Apple, who rejected multiple updates to the app based on false information after their offers to buy the app were refused. The developer, Kosta Eleftheriou, has filed a lawsuit against Apple, who he says does the same thing to thousands of other developers. Oh man. You know, what would help this situation, Apple? Side-loading, you know, just a thought. Have you thought about it? It's pretty, people like it. And Boston Dynamics has put out yet another threatening video showing how capable their Atlas robots are at parkouring over obstacles to get to their fleshy human targets and steal their jobs. - [James] Parkour! - No, my job as a parkour artist! I don't know why as a society, we continue to allow this kind of intimidation, but I will continue to watch these videos. - [James] We're all gonna die. - Because they are cool. We are gonna die though. Whoa, cool video Riley! Thanks James! Come back on Friday for another one. It'll have more tech news, which I know, that's what you love. - [James] Another one. - Ow, you're just throwing things at me. - [James] Direct hit! - Oh, that's what this show's about!",
    "transcript_keywords": [
        "Gigabyte",
        "Taliban",
        "Gamers Nexus'",
        "power supply",
        "server processor",
        "Mech Arena",
        "Gamers",
        "video",
        "thing",
        "WhatsApp",
        "Gigabyte servers",
        "Apple",
        "Fortnite",
        "Pixel",
        "watch Gamers Nexus'",
        "Mech Arena Robot",
        "epic server processor",
        "Facebook",
        "Taliban reclaiming Afghanistan",
        "Mech"
    ],
    "transcript_entity_values": [
        "FlickType",
        "yesterday",
        "America",
        "August 19th",
        "three",
        "RAM",
        "Riley",
        "one",
        "Islamic",
        "Afghan",
        "Newegg",
        "James] WhatsApp",
        "Gigabyte",
        "Fortnite",
        "US",
        "James] Small",
        "Genoa",
        "Google",
        "192",
        "Japan",
        "Mech Arena",
        "Jack",
        "T-Mobile",
        "two years",
        "StarCraft",
        "Us",
        "James] Direct",
        "WhatsApp",
        "Mech",
        "Afghanistan",
        "Instagram",
        "this a year ago",
        "Twitter",
        "Mech Arena Robot Show Down",
        "5a",
        "96",
        "Atlas",
        "Friday",
        "two minutes",
        "the middle east",
        "AMD",
        "thousands",
        "Taliban",
        "Western",
        "Kosta Eleftheriou",
        "Facebook",
        "two",
        "Epic",
        "Gamers Nexus'",
        "Android",
        "Gigabyte",
        "Canada",
        "dozens",
        "500",
        "Gamers Nexus",
        "Fortnite",
        "449 USD",
        "a hundred million",
        "Afghans",
        "Android and iOS",
        "only 49 million",
        "Boston Dynamics",
        "James] Parkour!",
        "CPU",
        "70,000",
        "James] Quantum",
        "James",
        "years",
        "Apple",
        "5",
        "Inner Sloth"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "NORP",
        "NORP",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "GPE",
        "PERSON",
        "GPE",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "TIME",
        "LOC",
        "ORG",
        "CARDINAL",
        "ORG",
        "NORP",
        "PERSON",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "NORP",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON"
    ]
}