{
    "id": "l8ZGbxskrVE",
    "title": "Lenovo Y910 Review - The Ultimate Gaming Setup!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2016-12-01T21:39:41Z",
    "video_url": "https://www.youtube.com/watch?v=l8ZGbxskrVE",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Lenovo",
        "Y910",
        "All in one",
        "Ideacenter",
        "GTX 1070",
        "GTX 1080",
        "Best Setup",
        "Ultimate Setup",
        "Ultimate Computer",
        "Best Computer",
        "Budget Computer",
        "i5 6500",
        "Nvidia"
    ],
    "views": 318855,
    "likes": 10129,
    "comments_count": 829,
    "description": "My review of the Lenovo IdeaCentre AIO Y910 (GTX 1070). The best value all-in-one gaming setup on the market right now. Covering build quality, internal hardware, gaming and video editing performance. Available Here -   Music Credits: Intro: Tyler Touch - Act Of God ft. Jason Gaffner (Robotaki Remix) Background: Fili - H2O  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2gR4963",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Ohh... pretty. Hey, how's it going guys. This is Dave2D and this is a review of an All-in-One device from Lenovo. Now, I normally don't love All-in-one Windows devices, they're normally kinda geared towards casual users, and the ones that can play games, don't play them all that well. This one, however, is quite different. So, by definition, as an All-in-One system, it has all the parts of a desktop PC built into one unit. The overall build quality is good, the exterior is mostly plastic, but everything, including the stand, feels very sturdy and well made. The screen is obviously up front, but the motherboard and all the components are housed in the back. Now, the idea of this system is already pretty cool, but Lenovo also gives users full access to these components, so, upgrading them is super easy. You press this \"Y\" shaped thing back here, I guess we could call it a button, and the panels pop off, it's a fully tool-less entry and once you're in there, aside from the CPU, every major component can be user upgraded. So, the SSD, the hard drive, the RAM, all of these are easily accessed and swapped out, but the best part is that the video card can also be swapped out, and before i got this thing in, I thought they would have put a laptop GTX ten series in here, because of the form factor, but it's actually a full sized desktop GTX 1070, which is awesome. Now, I can't be sure of the direction that Nvidia is going to take their cards, but at 380 W, I think the power supply in here should be enough to upgrade your card for the next generation or two, so that should extend the life of this system nicely. There is a swing-out arm for headphone storage, which is kinda cool and it has a ton of ports: audio jacks, lots of USB ports, an optical drive, an SD card slot, display output and an ethernet jack. It also has an HDMI IN, which allows the display panel to be used as a standalone screen. So, if you have a laptop you can connect it up and now you have a secondary display. But keep in mind that when you connect it like this, even though the computer is off, a quiet fan does kick in seemingly to cool the display panel. It comes with a keyboard and mouse but I preferred using my own. The included keyboard is actually pretty good. It's not mechanical but it feels nice. The mouse is... it's not great, but it lets you get the system running right out of the box. Okay, back to the screen. It's a TN panel, with respectable color gamut and accuracy, 1440p running at 144 Hertz with a 5 millisecond response time and I think this was a really good choice. I mean they could have gone with something higher resolution, like 4k panel, but at 27 inches, 1440p ready has really good pixel density and, on a gaming product like this, going with the high refresh rate is the way to go. On top of the screen is a pop-up webcam and this allows the bezels to be thin, while keeping the camera up top. It's 720p, looks decent and it supports Windows Hello, so you can log in through facial recognition. The CPU in here is an i5 6500, so you can configure it with an i7, but if you're just playing games the i5 is definitely the best bang for your buck. And then combine that with the GTX 1070 and this 144 Hz panel and you have an awesome gaming experience. At the native resolution, Battlefield 1 was a comfortable 70 frames per second on ultra at 1440p and one of the most demanding games I played was Witcher 3 at max graphic settings with hair works on and I'm still getting around 45 frames per second. Hair works off, we're looking at 65/70 frames per second. Now, if you want to see that super smooth 144 Hertz refresh, you'll need to reduce graphic settings or your game resolution to 1080p. My personal preference has always been to play games at 1080p and to get frame rate up, because I love buttery gameplay, but everyone's different. Now, it's also a very capable machine for video editing. There's two drive bays, so you can have a dedicated cache drive and the screen isn't bad for color accurate work. Also if VR is your thing, the GTX 10 series cards can easily handle current VR titles. The thermal management is solid. Temperatures on load are good. Fan noise is audible, even on idle, but it's not very loud and then when it's under load it picks up, but it's still very tolerable. It has a pair of 5 watt speakers and audio quality is decent, you're still going to want a headset for competitive gaming, but they're great for media consumption. Ok, so I fired a PC part picker to do a rough price comparison between this system and than building your own, and equivalent components are coming in at around $1400, minus the keyboard, the mouse, the infrared webcam and speakers. So, let's add, I don't know, another 100 bucks for those. So, I would say that the premium that you're paying to get into this form factor is around $300/$350 and it might even be less depending on Lenovo sales. Now, obviously it's not as flexible system as building your own, but you're getting a warranty with it and it's a pretty cool form factor, so, yeah, I mean, it's not an amazing value, but it's way better than I thought it would be. With the Lenovo Y910 you're getting a really solid 27-inch TN panel with 144 hertz refresh rate. It's a perfect screen for gaming and it can be used as a standalone display. The speakers are also pretty good for a media consumption. When you flip it around, the internals are very easily accessed. The base model comes with an i5 6500 and a Founders Edition GTX1070. These deliver really solid gaming performance and are both properly cooled. There are 12 gigs of RAM, upgradeable to 32, two drive bays, an m.2 SSD and a three and a half inch hard drive. There's a 380 watt power supply and all of these components are packed into a nicely engineered chassis. Overall this is one of the more interesting PCs I've seen this year. I like small cases, so having an All-in-One device that has good components that are upgradable, good performance and a fair price, I think it's fantastic. So, if you're looking for a gaming desktop, take a look at this one. Obviously, it's not for everyone, but it might pick your interest, because I think it's pretty cool. Thumbs if you like this video, subs if you loved it. It's been nice, I'll see you guys next time",
    "transcript_keywords": [
        "good",
        "Allinone Windows devices",
        "AllinOne device",
        "panel",
        "system",
        "screen",
        "pretty",
        "drive",
        "AllinOne",
        "pretty cool",
        "gaming",
        "GTX",
        "Lenovo",
        "display",
        "components",
        "cool",
        "pretty good",
        "display panel",
        "love Allinone Windows",
        "games"
    ],
    "transcript_entity_values": [
        "around $300/$350",
        "HDMI",
        "VR",
        "4k",
        "380 watt",
        "Lenovo",
        "Hertz",
        "CPU",
        "ten",
        "USB",
        "one",
        "this year",
        "Windows Hello",
        "65/70",
        "Witcher",
        "27-inch",
        "second",
        "5 millisecond",
        "GTX 1070",
        "380",
        "TN",
        "around $1400",
        "GTX",
        "SD",
        "100 bucks",
        "Battlefield 1",
        "a ton",
        "webcam",
        "5 watt",
        "6500",
        "two",
        "SSD",
        "Windows",
        "1440p",
        "10",
        "the next generation or",
        "32",
        "RAM",
        "45",
        "12",
        "70",
        "One",
        "27 inches",
        "the infrared webcam",
        "Nvidia",
        "144",
        "max"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "GPE",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "FAC",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON"
    ]
}