{
    "id": "l_VMcIX0hJY",
    "title": "Umi Super Phone - Full Teardown and Repair video",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-07-01T18:30:01Z",
    "video_url": "https://www.youtube.com/watch?v=l_VMcIX0hJY",
    "category": "Howto & Style",
    "tags": [
        "Umi super",
        "umidigi",
        "Umi smartphone",
        "flagship killer",
        "repair",
        "smartphone",
        "teardown",
        "disassembly",
        "how to fix Umi super",
        "fix",
        "battery",
        "cracked screen",
        "replacement",
        "digitizer",
        "Umi",
        "Super",
        "screen repair",
        "glass only"
    ],
    "views": 329290,
    "likes": 3699,
    "comments_count": 366,
    "description": "Awesome Smart Phone Tool Kit:  Green Pry tool:  Phone opening metal tool:  Replacement Phones:  Replacement screens without frame:  (You'll have to pull the broken LCD out of your old frame and reuse the frame with this LCD. Its complicated, but at least the LCD Is cheap.)  LET ME KNOW IF THOSE LINKS STOP WORKING OR IF YOU NEED A PART.  Its not always cost effective to repair a cell phone.  BUT sometimes there is no other option.  Especially when a customer has information that they need to recover from a damaged phone.  The only way to get into a locked device is to get the device working again, whether this means replacing the screen or replacing a battery... its always good to know how to open up the phone.   This is the teardown video for the Umi Super.  I show how to open up the device, repair the finger print scanner, how to replace the battery, do a screen replacement, the cameras... Everything.  Like always if you have any questions, leave them in the comments, I try to answer as often as I can.   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/29yd2it",
        "http://ebay.to/2ibZzU9",
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/1R7Ltic",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "In front of me we have the Umi Super Phone. This is the same phone I did my durability test on so thats why it has a couple scratches on the back and a cracked screen on the front. You can see when I turn the phone on that the top half of the screen does function but the part below the crack does not function. So this phone only costs 200 dollars so it would normally not be cost effective to fix. Parts are hard to find for this device, so why am I taking it apart? First off, so we can analyze the build quality of a 200 dollar phone verses a 700 dollar phone, like the Galaxy S7. And sometimes when you have important information on your phone and the screen breaks, youll need to Frankenstein two phones together in order to save or back up your information. Many non-techy people dont back up their pictures or text messages and are willing to pay money to recover those when their phone breaks. So lets get on with the tear down. Holding down the power button just restarts the phone so were going to do this live. Like you see, were going to remove the SIM card tray and the bottom plastic protections over the bottom and top of the phone. There are 6 screws that hold the back housing into the front housing, and then you can just pull that off the back. All of the buttons do fall out which is extremely annoying. The battery is a 4,000 milliamp battery. The buttons will be annoying later on, but Ill show you how to deal with them. There are 4 screws around this back plastic piece and then one more screw underneath the fingerprint scanner. Tuck the fingerprint scanner through the back plastic and then pop that off of the phone. Then theres a little latch connection that holds the side buttons into place; you can just lift that up and slide that out. Remove the wire cable connector and unplug the battery since this phone was not turned off when we started working on it. Thats very important. Theres not a lot of tape or sticky stuff underneath the battery; it just pops out on its own using the blunt end of my metal pry tool. Be careful to not damage this extension ribbon cable. This is just like you see on the One Plus series. Theres another latch for the screen ribbon so were going to pop that out. And then theres a weird little cable thats actually soldered onto the main board. This design is not my favorite. Im going to remove the top tape and that exposes some more connections for us. Theres a similar Lego-like connection right here at the top. Were going to pop that off and lift it up so its not in the way of the motherboard. And the motherboard is released from the frame. Theres a little metal pocket at the bottom of the motherboard that holds it in place. And then make sure you lift up the ear piece as well so that it doesnt get caught. Im going to remove the rear facing camera and the front facing camera from the motherboard. One has the Lego connection; the front facing has the latch. The rear is a Panasonic 12 megapixel and the front is a 5 megapixel selfie camera. Stick it back into place; just tuck it in with the latch and plug the Lego one in. And then make sure you lock down the latch so that the camera doesnt fall out if you ever drop your phone. There are 4 screws at the bottom near the charging port. Once those are off the top plastic piece will come away. There arent any components on this plastic piece. Unplug the little wire connection and then unsnap the extension ribbon cable. Theres one screw holding the charging port into place, then you can pull that away after pulling off the vibrator motor from the plastic itself. We dont want to damage those wires. Here is the type C charging port. I will try to find replacement parts and link as many as I can down in the video description below, but if youre trying to back up someones information you might just need to buy a new phone or swap motherboards and screens because this is the screen. This is where you take your replacement parts and put them on the new screen thats working if you want to back up your data. The screen is embedded into the metal frame. I imagine if they sell parts at all it will be without the metal frame. Youll need to transfer the new LCD into the old frame after removing the cracked LCD. Kind of complicated. Putting the charging port back into place. Plug in the extension ribbon cable, the wire and the little screw underneath the plastic panel. And then there are 4 screws that hold the top panel in place. Motherboard gets tucked in after making sure there are no wires or ribbon cables underneath it, you dont want to pinch those down. Set the earpiece into place and the motherboard gets tucked underneath that little metal edge on the bottom right corner. Get all the buttons in place. Plug in that wire cable connection. Slide the ribbon cable into the latch and latch it down after making sure all the contacts are straight. If that ribbon cable is kinked at all and the contacts arent touching where they should be, its not going to work right. Get the top ribbon cable snapped down like a little Lego. And put the tape back into place. The tape isnt super mandatory so if you rip that or anything, just try to stick it back as best as possible. Volume buttons are plugged in and the battery is the last thing that were going to plug in so theres no power coursing through the board. Im going to test the phone before I put the back panel on and it looks like everything is working besides the fact that my phone is still busted from the durability test. Put the back plastic on. Get those 5 screws into place before tacking down the fingerprint scanner. Now these buttons are super annoying. They are not held into the back housing, I imagine because this is a 200 dollar phone design. So Im setting those into place as best I can and then Im just taking the top of the phone, motherboard and the screen, and setting that down into the back instead of the other way around which is how I would usually do it. That way the buttons dont fall out when Im moving the back panel. There are 6 screws holding down the back panel into the front housing. And then were going to put those plastic pieces back into place as well. They just tuck in. Its actually a lot easier to use the snapping back pieces than it is to use the glue covered ones on the Nexus 6P. If you have any questions leave them down in the comments. I do behind the scenes stuff on Instagram, Twitter and Snapchat recently as well. Check out my durability video of this Umi Super Phone. Ive done 27 other durability videos on popular phones like the iPhone 6s, the Galaxy S7 and the LG G5, so check those out in my Smart Phone Durability Playlist. Hope to see you around. Thanks for watching.",
    "transcript_keywords": [
        "Phone",
        "back",
        "place",
        "Umi Super Phone",
        "dollar phone",
        "ribbon cable",
        "cable",
        "plastic",
        "back plastic",
        "screen",
        "top",
        "ribbon",
        "Super Phone",
        "motherboard",
        "buttons",
        "front",
        "latch",
        "screws",
        "back panel",
        "back into place"
    ],
    "transcript_entity_values": [
        "Nexus",
        "6",
        "G5",
        "Lego",
        "200 dollars",
        "Instagram",
        "two",
        "200 dollar",
        "4,000 milliamp",
        "the Umi Super Phone",
        "700 dollar",
        "Frankenstein",
        "27",
        "half",
        "4",
        "SIM",
        "5 megapixel",
        "5",
        "Panasonic",
        "the Galaxy S7",
        "12",
        "LCD",
        "First",
        "this Umi Super Phone",
        "Snapchat",
        "one",
        "Twitter",
        "LG"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}