{
    "id": "lbUhdIGsxH8",
    "title": "Apple Forgot to Erase This iMac (PART 2) - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2022-03-03T17:00:23Z",
    "video_url": "https://www.youtube.com/watch?v=lbUhdIGsxH8",
    "category": "Science & Technology",
    "tags": [
        "Apple Forgot to Erase This iMac (PART 2) - Krazy Ken's Tech Misadventures",
        "Apple",
        "iMac",
        "Mac OS X",
        "Apple Internal",
        "Apple Prototype",
        "PVT",
        "Mac OS X Snow Leopard",
        "PhoenixCE",
        "Rare",
        "Diagnostic Software",
        "Computer Crash",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Tech",
        "Computer",
        "Comedy",
        "Humor",
        "Funny",
        "Computer Clan",
        "macOS",
        "Finder",
        "Apple_KFS",
        "Disk Utility",
        "Terminal",
        "Linux",
        "Zorin OS"
    ],
    "views": 141399,
    "likes": 5703,
    "comments_count": 295,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below Krazy Ken and Brainiac Brent dived into the mysterious iMac which escaped Apple's facility. They uncovered more files and answers to questions from the last episode.  Watch part 1   Check out our rare tech playlist   Download our epic wallpapers   Support our channel and get cool stuff    Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord     Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Special thanks to Brainiac Brent for helping! Also, thanks to Unknownz21 for helping with the research:   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #MARCHintosh2022 #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "https://youtu.be/YBhN7kn8j-g",
        "https://bit.ly/clan3zlKXX9",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/URedditor",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- This iMac accidentally departed an Apple facility prematurely, and there's all sorts of internal software and documentation on it. And I dug into this system in a previous episode but much more information has been discovered since then. So it's time for a follow up. Buckle in. Sponsored by Linode. Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken. And our rare iMac friend is back with us today. And if you haven't seen part one of this mysterious journey, I recommend checking that out first. I've officially decided to name this iMac Nemo, which is Latin for nobody. And I think that's fitting because the serial number for this computer doesn't appear in any of Apple's lookup tools. Anyway, we have some new developments to share, along with the conclusion to the question of is this thing truly a prototype or not? So we'll tackle all of that stuff. And we'll start with the elephant in the room. Many of you were concerned about me backing up the hard disk because it contains rare software. Yes, I backed it up. It was one of the first things I did. In fact, Brainiac Brent and I backed it up twice. So no need to worry. The second half of the elephant has to do with the distribution of the software. I've received many requests to image the entire hard drive and upload it somewhere for people to take a look at it, but I'm not sure Apple would like that. So I'm not gonna do it. It's their intellectual property, so I don't wanna distribute it. Yes, it's older software, so they might not care. It's kind of a gray area, but I want to err on the side of caution, but I will do my best to show you guys all the cool stuff that has been uncovered. So you can try to get as much of the experience as possible. And I'd also like to address the Weezer song. Yeah, I know, I totally butchered that earlier, but hey, now we have a name for a new song. Don't fear the Weezer. Thanks Brendan. So now let's tackle some topics regarding this computer, cuz there's a lot of mysterious and fun stuff on it. Starting with Phoenix. The word Phoenix popped up a lot in the last episode. And as you may have saw. it's an application, PhoenixCE specifically, that runs on the system to perform tests. My initial thought was Phoenix was a code name for a team at Apple. And according to some of my sources, yes, that is in fact true. One of my sources said the team is no longer an actual team but I have seen newer versions of the Phoenix software being used. So I can't confirm that. And by the way, the CE in PhoenixCE stands for client environment, cuz it looks like the application talks to a server to do certain things and perform certain tests. And that application is made to run on a client, which talks to the server. So client environment, CE, that seems plausible. Next DTI. We saw that initialism pop up a bunch. One of my sources says it stands for distributed test image, which makes sense because this operating system, this version of Snow Leopard is made specifically for testing. It's using a certain build number that's not a public build and it comes bundled with a lot of other programs to execute such tests. So DTI, distributed test image, makes sense to me. So next are the release notes. I found a document that has a bunch of release notes for this DTI and the DTIs before it. And it dates back all the way to February 15th, 2009 with the Pre-Proto2 label. So this iMac came out in October 2009, but according to this document, we can mostly kind of sorta assume that testing started about eight months before this thing hit retail, if not earlier. And on top of that, there were a couple of release notes that passed that October date, which contained some minor revisions. So I'd like to address the build number situation. In the last episode, I talked about how this build number didn't match any of the public build numbers. So part of me initially assumed it was a pre-release OS but according to my source Unknownz, it's not a pre-release OS, it's an OS made for testing. And according to him, it's referred to as a releaseType. So it's like a variation of an operating system that's made only for testing. So now let's talk about that box. Remember it said QCA on it. And one of my initial theories was it stands for quanta something, something. And one of my sources said, yes, it stands for Quanta California. They said particularly a facility in Fremont. I can't confirm if it was a facility in Fremont but it was still Quanta in California. Not sure if they're still operating, but at least at this time they did mass production of the K22 and K23 iMacs. So let's talk about this final.plist file. Plist stands for property list. There's a secure erase shell script which references this plist. So it knows what files and folders to securely erase. Inside this property list, there's several folders referenced like AppleInternal, which do not show up in the file system at all. So maybe they were never on here in the first place or they were securely erased at another point in time, because for grins and giggles, Brainiac Brent ran data recovery software on here and we still couldn't find those folders anywhere. However, when we ran the data recovery, we did find a few other cool things that were not on the surface, so to speak, but we'll get to those in a sec. Okay. The serial number look up. I gave the serial number to a bunch of friends and they used various tools. Some of them used Apple's own technician tools to look up the serial number. And I used Apple's warranty tool to look up the serial number and no one could find anything. So the serial number just does not exist anywhere. But one of my sources helped explain why. Since this iMac left the facility early, and it was likely some sort of reject due to quality control issues, it never finished its final tests and it never finished its postburn stage, which is a stage that gets the computer configured in a more customer friendly configuration. But because those stages weren't complete and postburn wasn't finished, the serial number was never entered into Apple's database, which they use for products. The leftover testing software on this computer, plus that terminal that says please scan running code are pretty big indicators that this iMac was in the middle of testing, but something clearly interrupted that. So remember that SMC platform console application we looked at and we saw all of those weird keys that we didn't know what they were exactly? Well, there's a file that defines them and it's called K22keys.html. For example, SOT3 refers to a target temperature for the iMac's optical disk drive. And it defines the value as DegC, which is degree Celsius and SGTg refers to the GPU thermal target temperature. So I thought that was pretty neat. I felt like I was Nicholas Cage deciphering stuff or something like that. Anyway, there were a couple of other miscellaneous files we uncovered as well. This core wireless one really got my attention. I mean, I'm not gonna pretend to understand much of it, but I saw a photo of what looked like some sort of prototype iMac in it. This document was from 2007, so it was likely not this iMac that they were working on, but you can see the screen bezel was removed from it. So it was probably some sort of lab test sample or engineering sample or something like that. So I was intrigued by that. I was also intrigued by this one page that just says TBD. So whatever, it's just internal stuff, it's all good. This iMac thermal tools read me file also got my attention because it had contact info in it. I think it's pretty cool to see an actual person's name and email address and they're an employee at Apple. It kind of like humanizes the company seeing that stuff in there. And another funny thing I saw was a bunch of application icons that were just clearly jokes or like memes shared amongst the team. There was like one of a cat and like there were some Simpsons ones. And there was a Mario one. It's just kind of funny to see that stuff in the file system. So that brings us to the question of, is this truly a prototype or not? Long story short, based on what I've heard from my sources, no, it is not a prototype. It is very likely a quality control reject. We've seen multiple labels in the system that refer to the bundle of software as PVT, which stands for production validation test or testing. And depending on who you ask, some people may say, yes, that's a prototype. And some people may say, no, it's not. There's no special stickers or markings on the computer. The serial number isn't blanked out. So it's probably not a prototype. Plus it doesn't have the Apple internal folder on it, so that's another hint as to it not being a prototype. And that scan running code seems to indicate that it was in the middle of testing and it was probably a reject and it just wasn't erased properly before it somehow got out into the wild. It kind of makes sense that it would fail and it would be considered a quality control reject, cuz remember, I had this thing in my possession for only 30 minutes before the power supply died. So yeah, maybe there was something wrong with this. So now we're gonna dive into mysterious unmountable partitions. We had two KFS volumes, which did not show any names and we could not mount them, so we couldn't look at what was on them. But thanks to Brainiac Brent, we figured a lot of stuff out and this took a lot of technical digging. Brainiac Brent ran this iMac in target disk mode for several days while he used Zorin OS Linux distro and Mac OS to run various scanning programs. The goal was twofold. One, get the volumes mounted, so we can read the data from them. And two, recover any deleted files if necessary. And before he ran the scans, he simply pulled up the partitions in Zorin's disks app. And remember earlier how we didn't have names for those mysterious partitions? Well, now we do. The 1.9 terabyte volume had a volume name diagnostics and interestingly enough, the partition name showed up as customer and the other previously unmounted partition had a partition and volume name of recovery. My theory was that the customer partition was gonna be used for the final system when everything was done and erased, that partition would be reset and configured in such a way where the computer is now ready to go for the customer with a clean install of Mac OS on it. Theories aside, we actually have to get the volumes mounted. First Brainiac Brent used test disk to scan the partition table of the hard drive. And after the scan was complete, one of the volumes was missing. All of the other ones showed up. None of them were labeled KFS by the way, but the largest partition, that 1.9 terabyte partition, didn't show up. We're not sure why that happened, but Brainiac Brent was able to manually assign a starting and end sector for that missing partition. So with that updated partition table correctly written to the disk, the computer now knows how to communicate with the hard drive properly. The volumes now all mount perfectly. Well, except for the diagnostics one. It keeps giving us a repair error, but it still mounts. Another weird thing with the diagnostics partition is in Mac OS Big Sur Disk Utility reports it as using -95 gigabytes of space. Not sure how that happens. I'm not sure if there's some virtual thing going on. So it's like pretending to use space on the drive, but it actually isn't. Don't know. That's really weird. However, on Mac OS X Snow Leopard, which is much older than Big Sur, it only reports as using 850 megabytes. So the mysterious partitions were now mountable and their labels gave us a little bit of a clue as to what they were gonna to be used for. But what about the contents of the partitions? Sadly, there really wasn't anything there. They were empty aside from those typical hidden files that are in the file system for operational use. Like there was really nothing that stood out. So we decided to dig a little deeper with some data recovery tools. Keep in mind when it comes to the file recovery on this hard disk, we can't recover anything that was securely erased or overwritten. On the diagnostics partition, we found what appeared to be a complete stock installation of Mac OS X with iLife, which I would say, more or less confirms my theory about the customer label because that configuration is how a Mac would be set up with Mac OS X and iLife when it goes to retail and gets sold to the customer. We also found a lot of clip art images and I do not recognize these at all. If anybody has a clue, feel free to let me know. As for the recovery and diag partition, we didn't find anything of interest. Just again, those typical usually hidden files and folders that are used by Mac OS to help work with the hard drive and the file system. So nothing there. Which brings us to the final partition, max disk, which I'm booted off of right now. We ran a deep scan on it and frankly, we didn't find anything too earth shattering, but there were a couple different files here and there that appeared to be deleted. But my favorite one was this vertex performance file. And in the change logs, there was a little joke written in there for a Halloween update. And it just said, boo. So I like little internal jokes like that. I also like some of the language you see in some internal documents. You would normally never see these written for a customer. Like just in case there's any SMC crap in there. I think that's funny. Ah Nemo, you're just full of surprises. So I have to give a big, special thanks to Brainiac Brent, who helped me dive into this computer. And I want to give another thanks to Unknownz21 on Twitter for helping me research the system. And I'd like to thank all of my other sources that helped me out as well. And of course I have to give a big thanks to my friends at Linode. I've known these guys for years and they helped make this episode possible. They help me and they can now help you too. You can simplify your infrastructure and cut your cloud bills in half with Linode's Linux virtual machines. Whether you're developing a personal project, building a website, or managing larger workloads, you deserve simple, affordable and accessible cloud computing solutions. And that's exactly what Linode is for. Heck, you can even deploy Minecraft and CS:GO servers. And as a thank you for watching my show, I'll give you a 60 day $100 credit when you sign up today. You also receive 24/7 365 human support, regardless of your plan size. You can choose shared and dedicated compute instances. Or you can use your hundred dollars in credit on S3 compatible object storage, managed Kubernetes and more. To put it simply, if it runs on Linux, it runs on Linode. Visit linode.com/computerclan and click the create free account button to claim that 60 day $100 credit. And when you do that, you're also supporting the computer clan. So thank you very much. That's what I know about Nemo. He may not be a prototype after all, but he is a pretty cool quality control reject. He found a new home here in the layer. So everyone in the awesome computer clan community can enjoy him. Man, I'm giving a computer \"him\" pronouns and that can't be healthy. If I discover anything else interesting about Nemo, I'll make sure to update you guys on my Twitter. And if I find enough new stuff where I can actually make a bigger episode, I will make another follow up. And feel free to subscribe for more tech episodes coming out every week. I love making episodes about rare and retro tech, new tech and of course, scam tech. And hey, if you like this episode, you know what to do. Thanks. And I'll see you next time. Catch the crazy and pass it on.",
    "transcript_keywords": [
        "Brainiac Brent",
        "partition",
        "serial number",
        "Apple",
        "number",
        "Mac",
        "iMac",
        "system",
        "computer",
        "iMac accidentally departed",
        "Brainiac Brent ran",
        "file",
        "Brent",
        "Brainiac",
        "file system",
        "stuff",
        "software",
        "disk",
        "serial",
        "testing"
    ],
    "transcript_entity_values": [
        "Mac OS Big Sur Disk Utility",
        "Ah Nemo",
        "Mac OS X with iLife",
        "2007",
        "only 30 minutes",
        "1.9 terabyte",
        "half",
        "hundred dollars",
        "Zorin OS Linux",
        "Weezer",
        "October 2009",
        "60 day",
        "years",
        "every week",
        "Quanta",
        "Snow Leopard",
        "two",
        "Apple",
        "PVT",
        "max",
        "Halloween",
        "Phoenix",
        "100",
        "Mac OS X and iLife",
        "QCA",
        "iMac",
        "Mario",
        "Mac OS X",
        "Brent",
        "CE",
        "Unknownz",
        "GPU",
        "Mac",
        "today",
        "Kubernetes",
        "Krazy Ken",
        "Zorin",
        "CS",
        "SOT3",
        "California",
        "AppleInternal",
        "Plist",
        "Simpsons",
        "first",
        "Latin",
        "iMac Nemo",
        "one",
        "S3",
        "several days",
        "24/7 365",
        "iMac",
        "850 megabytes",
        "Brendan",
        "iMac",
        "One",
        "DTI",
        "October date",
        "Quanta California",
        "Nicholas Cage",
        "Twitter",
        "Minecraft",
        "K23 iMacs",
        "First",
        "second",
        "February 15th, 2009",
        "Linode",
        "Linode",
        "Linux",
        "CE",
        "Twitter",
        "sec",
        "Brainiac Brent",
        "about eight months",
        "SMC",
        "Fremont"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "GPE",
        "MONEY",
        "ORG",
        "ORG",
        "LAW",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "LANGUAGE",
        "EVENT",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "LOC",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "GPE",
        "FAC",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "GPE"
    ]
}