{
    "id": "lHIWMmVoA44",
    "title": "We Tried YouTube's A/B/C Thumbnail Tester",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-06-30T18:14:29Z",
    "video_url": "https://www.youtube.com/watch?v=lHIWMmVoA44",
    "category": "Science & Technology",
    "tags": [
        "YouTube",
        "Thumbnail",
        "Algorithm",
        "Google",
        "Video Production",
        "Graphic Design",
        "Creator",
        "Influencer",
        "Watch Time",
        "Retention",
        "a/b testing",
        "ltt",
        "clickbait thumbnails",
        "why use clickbait",
        "linustechtips",
        "linuxtechtips"
    ],
    "views": 912112,
    "likes": 45934,
    "comments_count": 3810,
    "description": "Visit  and use offer code LTT for 10% off  Check out the MSI MEG Z790 GODLIKE MAX at   YouTube has changed a LOT over the years, sometimes before your very eyes. We've been using their new A/B/C thumbnail tester to figure out what makes YOU stick around and watch more of the video.  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   GET A VPN:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:48 Bell's Upgrade 3:35 Scorpion Chair 4:48 Our Best PC Builds 5:57 What's Going On? 7:27 Conclusion 10:44 Outro",
    "description_links": [
        "https://www.squarespace.com/LTT",
        "https://lmg.gg/PV8C7",
        "https://linustechtips.com/topic/1575263-we-need-to-change-our-thumbnails-now/",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "http://www.piavpn.com/linus",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "Ah, I have been doing this for a long time, and I still do not know how to make the perfect thumbnail. Do I add the big red arrow? Maybe a big smile? Maybe like this? Perhaps a touch of dim-a-stare? Wait, no, of course, I'll use YouTube's ABC Thumbnail Tester, I mean, sure. It's twice as much work for our thumbnail artist, Maria, but, hey, you don't mind, right? Um, actually, Linus i miri be s- Great! While you get that going, I'm gonna explain to the good people what exactly it is that we're up to with our little experiment. Late last year, we were given access to a tool that allows us to upload multiple thumbnails for this same video, and then keep only the one that performs the best. And we've spent many hours experimenting with- some sometimes confusing results. I mean, at times the winner is painfully obvious, but other times it is impossible to decipher just what the heck you guys liked about the thumbnail of choice. Just like it's impossible to determine when I'm gonna segue to our sponsor. See? I gotcha! That wasn't the segue! MSI! Does your gaming prowess need some divine intervention? MSI's Meg Z790 god-like Max motherboard might not actually make you a gaming deity, but we'd like to imagine that if there was such a thing, they'd be using one. Go check it out in the description below. Let's kick things off with a result that still has us flummoxed. Bell's AMD tech upgrade features him either on the left or on the right. And the people have spoken, and Bell on the right is our big winner with 56.9% of the shared total watch time. That means that those of you who watched it were served either of these two thumbnails during our test, and the ones who clicked on this one stuck around for significantly longer. Or wait, hold on a second. Stuck around longer. Yeah, well, here's the thing. If YouTube gave creators a tool that just chose a winning thumbnail based on the click-through rate, we would be straight back to the dark ages within a matter of hours. So instead, they built an incentive for this tool that aligns with their agenda, which is, of course, to keep you watching YouTube for as long as possible. So the best thumbnail is the one that best sells the content that you're about to enjoy. Coming back to Bell then. He thinks it's obviously because his left side is his better side. Who could blame him? He's right. But we think that it could have more to do with how the viewer's eye gets directed. Most of our audience speaks English, which means that they probably read from left to right on the page. So, a thumbnail that communicates in order. There is a strong correlation between the title and concept. This is almost certainly a Linus Tech Tips video, and he's gonna do an upgrade that makes a member of his team happy, might outperform one that communicates, here's a guy who's happy and doesn't look very stealthy. Oh, by the way, I think that's Linus standing in an empty room. Maybe, I don't know. For this one. Your guess is as good as mine, and I would love to hear your theories down below. Hey you! Yeah, you. If you want to hear more of our theories, Maria and I will be filming a closer look about the thumbnails we don't talk about in this video. Get subscribed on Float Plane so you don't miss it, and check out some of our other content while you wait. Let's change gears, though, and look at an easier one, the scorpion chair. We've hitted a pallet of unopened boxes against the chair in all of its glory. Now, conventional clickbait wisdom might be to give away as little information as possible in hopes of enticing you with curiosity. But as you can see, the chair thumbnail won by a landslide with 69.2% of the shared watchtime. And in this case, it's kind of obvious if you think about it. You see the chair, you click the chair, you stay for the chair. You see a pallet of boxes, you click a pallet of boxes, you get a weird chair. Well, see you later. It is entirely possible that the mystery boxes may have driven more clicks, maybe a lot more clicks, and they could have even resulted in more counted views. But the cold hard truth is that YouTube doesn't want to build tools that help an individual creator get lots of views. They wanna build tools to increase viewer satisfaction on the platform as a whole, which is a good thing. It's just that it's really hard to do. As it turned out, the vast majority of our tests were much more evenly split, even in cases where we uploaded dramatically different images. Check out this one. I didn't even realize that we had started this test until I saw this thumbnail on my feed for reacting to our best PC builds ever. Thumbnail one is the big open mouth that I saw, while thumbnail two is a more relaxed natural smile. I thought for sure that this one would help us end the cringe versus natural debate once and for all. But as it turns out... y'all mostly just kind of don't care. The LTT audience seems to slightly prefer a closed mouth or a natural smile versus a big wide O face one like this, but typically by just one or two percent more watch time. Emoting in different ways does see some disparity, but it seems like it's less about lots of emotion and more about ensuring that the emotion or the mood suits the video. When we replaced our office PCs with Dell Optiplexes the neutral face ended up outperforming the disgusted face. So maybe negativity is bad? But then for the $150,000 server video, our frustrated or upset thumbnail did way better than the one in which I'm smiling. In some ways, we've actually ended up with more questions than we had when we started. What we think is happening though, is that some expressions help us tell a better story. And there's a lot more to it than just changing a face. Every element of the thumbnail helps paint a picture that informs. And entices. Maybe this background color was just too aggro for a chill video like this one about cable management, where I'm relaxing at my desk in a bathrobe. People did NOT like the razor green version and strongly preferred a more calming dark blue. If we choose to use text or icons in our thumbnails, we've got to ask ourselves, do we need that big question mark? Could we label things more clearly? Is text even necessary, or is the title of the video enough? Another big part of our experiment has been adding red arrows pointing at the subject of the video that it turns out though Seems like a big no-no when the subject or the item in question is super obvious like Okay, the building behind you clearly smash champs and yeah that meta quest 3 on your face You're obviously going to be talking about that We don't need a red arrow to know that you can get this super comfy dip-dye hoodie from LTTstore.com. Do you? clarity is hugely important, but no one wants to be beaten over the head with it. With that said, arrows pointing out small objects that aren't instantly recognizable. Those are 100% fair game. And yeah, most of this is kind of just graphic design 201. The thumbnail is there to entice you, draw the eye, but not mislead or add anything unnecessary. Just never hurts to have a refresher course. So the TLDR for our whole experiment boils down to a few key points. Number one. Our core audience doesn't seem to care that much about the thumbnail. In our first round of tests, the watch time share was pretty close to 50/50. So either we're so good at thumbnails that we can't make a bad one if we try, or more likely, our loyal subscribers know they want to watch LTT, and if they click the video, they're going to watch a decent amount of it, whether my mouth is open or closed or I'm happy or sad or deranged or whatever. Point number two. For those outside of our core audience, like the people being served our video on the YouTube home page, thanks to the almighty algorithm! Praise the algorithm! Praise the algorithm! For those folks, clarity is king. They don't want to gamble on whether they're gonna like what they're about to watch, and if they can't tell what's gonna happen, or if they get 10, 20 seconds into the video and they feel misled, the odds of them sticking around are pretty low. Point number 3. At the end of the day, it's all just packaging. It's important, but it's not that important. You can think of the thumbnail and title of a video kind of like a candy wrapper. I mean, it's one thing to get somebody to buy your chocolate bar because it has shiny packaging, but it is something else entirely to keep them coming back for more or recommending your candy to their friends. And of course, all of this needs to be taken as preliminary results. While this ABC thumbnail tester is good and we are going to continue to use it, it could be better, because currently it doesn't tell us some pretty important stuff. Like, it doesn't tell us if anyone was served either thumbnail and didn't click at all. It doesn't break the numbers down by subscriber versus new viewer, and it's limited to just three images. I mean, imagine how much more we could learn if we could upload, say, ten thumbnails at a time, or if we could manually choose a specific thumbnail or set of thumbnails for the core audience and then something totally different for new viewers. All of this is almost certainly in YouTube's best interest and I fully expect them to continue to develop this tool and I also fully expect that as creators continue to experiment, the small details are going to change even if the overall findings prove to be a constant, kind of like I constantly segue to our sponsor. Squarespace! It's 2024 and your brand or business needs online presence. Listen, I don't make the rules, we just play by them. Building your own website may seem daunting, but Squarespace is there to make it easier than figuring out just how come your printer never works when you want it to. Okay, maybe not the best example, but yeah, it's super easy. Squarespace is the easy to use platform to start selling or promoting anything and everything on the old interwebs. Local business? Portfolio? Blog? Squarespace has ready to use and easy to customize themes and templates for anything. They even look great on mobile devices. And if you already have a website, Squarespace makes it super simple to port your domain over and start using their customization and marketing tools to really stand out. They even have 24/7 support, which is better than just yelling at your website, \"Why are you doing this to me?\" So go get started on your webpage today and head over to squarespace.com/ltt for 10% off your first purchase. If you guys enjoyed this video make sure to check out the 2020 update of how does Linus Media Group make money? Really, we're through to that one. Interesting. Are we due for a new one?",
    "transcript_keywords": [
        "thumbnail",
        "video",
        "thumbnails",
        "ABC Thumbnail Tester",
        "big",
        "make",
        "chair",
        "ABC Thumbnail",
        "perfect thumbnail",
        "YouTube",
        "watch",
        "Thumbnail Tester",
        "Linus",
        "Squarespace",
        "YouTube ABC Thumbnail",
        "time",
        "watch time",
        "good",
        "kind",
        "audience"
    ],
    "transcript_entity_values": [
        "50/50",
        "one",
        "second",
        "English",
        "150,000",
        "Meg",
        "first",
        "Linus Media Group",
        "69.2%",
        "Max",
        "Dell Optiplexes",
        "10%",
        "201",
        "the end of the day",
        "just one",
        "today",
        "TLDR",
        "many hours",
        "Float Plane",
        "MSI",
        "a matter of hours",
        "Maria",
        "ABC",
        "AMD",
        "3",
        "100%",
        "ten",
        "LTT",
        "YouTube",
        "Squarespace",
        "two percent",
        "YouTube",
        "Late last year",
        "Bell",
        "10, 20 seconds",
        "56.9%",
        "Linus",
        "two",
        "just three",
        "2024",
        "2020"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "LANGUAGE",
        "MONEY",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE"
    ]
}