{
    "id": "libNRwU8kbo",
    "title": "Impossible Foods Pork first taste at CES 2020",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-01-07T07:04:22Z",
    "video_url": "https://www.youtube.com/watch?v=libNRwU8kbo",
    "category": "Science & Technology",
    "tags": [
        "impossible foods",
        "impossible pork",
        "impossible foods pork",
        "impossible burger",
        "vegan burger",
        "taste test",
        "foods",
        "beyond meat",
        "beyond foods",
        "beyond meats",
        "plant based",
        "plant based meats",
        "meatless burger",
        "vegan",
        "fake meat",
        "veggie burger",
        "beyond burger",
        "meat",
        "impossible burger review",
        "meat-free",
        "hands on",
        "first look",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "iphone",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 141934,
    "likes": 2252,
    "comments_count": 483,
    "description": "Impossible Foods is expanding its fake meat options beyond burgers  its moving into pork. We visited Kumi, a Japanese restaurant in Las Vegas to see how Impossible Pork imitates meat and found that it does provide a savory base of protein for a lot of foods that traditionally call for pork.   Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2TbvJBN",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey, I'm Liz, from \"The Verge.\" I've been a vegetarian for 20 years, but today I'm gonna eat pork. (bright music) So, we're here CES in Las Vegas, where Impossible Foods is introducing two new kinds of meat. One is sausage and one is pork. So, for most of human history, meat has been associated with wealth and really desirable, but lately people have been really concerned about the effects that meat has on human health and the environment. So, Impossible Foods thinks it has the perfect alternative. This is supposed to taste like meat, but it's made out of plants. So, this looks a little like ground meat. It's pink, and the texture kind of looks like maybe a chunkier hamburger. One of the things that I noticed while eating it is that it's pretty juicy and you can sort of see some of the oils in the pan. It's definitely sizzling. So, it definitely changed color, and the browning seems to be replicating meat. You can definitely see the areas where it's gotten a little bit more cooked in the same way that you might with a barbecue or something. So, we're gonna do some investigative journalism now. I'm gonna take the meat out of the sandwich. Okay, so this comes apart pretty easily. It's not as tough as meat usually is. And I'm just gonna eat it straight, because why not? (bright music) (crowd murmuring) It's fine, so it tastes salty. There's almost like a kind of nutty flavor to it. It's not one of those things where you have to be like (growling). You chew a little bit and then it comes apart. I can't really tell you if this tastes like pork because I haven't had pork in 20 years, and to be honest, I don't really remember what it tastes like. So, I'm gonna tap in somebody who does. (crowd murmuring) - Hmm, yeah, seems legit. (bright music) - But this isn't really about me or vegetarianism. This is food science. It takes a lot of work to make something like this, not just to make it taste right, but also to make the nutrition right. But one of the things that's maybe worth keeping in mind is that pork is one of the most eaten meats in the world, and it's especially important in the Asian markets like China, for instance, has had a booming pork industry. So, it's possible that this is a brand new market that opens up for Impossible. Impossible Foods is also introducing the Impossible sausage, which I didn't get a chance to try tonight, but that's gonna be available as part of the breakfast menu at certain kinds of Burger Kings around the country, so keep an eye out for that. It's gonna be part of their Croissan'wich I guess? I dunno, I've never had it, but I hear it's good. All right, I'm gonna start with the noodles. It feels safest. Sorry everybody, my chopstick skills are not top notch. All right, here we go.",
    "transcript_keywords": [
        "Impossible Foods",
        "meat",
        "Impossible",
        "Liz",
        "Verge",
        "pork",
        "Las Vegas",
        "CES in Las",
        "Foods",
        "tastes",
        "Hey",
        "things",
        "make",
        "taste",
        "Impossible sausage",
        "kinds",
        "kind",
        "human",
        "Vegas",
        "CES"
    ],
    "transcript_entity_values": [
        "today",
        "Burger Kings",
        "CES",
        "Liz",
        "two",
        "one",
        "Las Vegas",
        "tonight",
        "One",
        "20 years",
        "China",
        "Asian",
        "The Verge"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "TIME",
        "CARDINAL",
        "DATE",
        "GPE",
        "NORP",
        "WORK_OF_ART"
    ]
}