{
    "id": "Lj4Od9D4puc",
    "title": "Easiest iPhone Glass Fix – WITH LASERS (Not clickbait)",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-10-07T12:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=Lj4Od9D4puc",
    "category": "Howto & Style",
    "tags": [
        "iPhone back glass repair",
        "How to replace iPhone glass",
        "iPhone glass",
        "iPhone",
        "iPhone 11",
        "iPhone 11 Pro",
        "iPhone 8",
        "iPhone X",
        "iPhone XR",
        "iPhone repair",
        "Laser separator",
        "laser repair",
        "laser back glass",
        "laser iphone",
        "new iphone",
        "broken iphone",
        "cracked iphone glass",
        "back iphone glass",
        "clear iphone"
    ],
    "views": 24383359,
    "likes": 472257,
    "comments_count": 21022,
    "description": "Glass breaks. Apple has once again made the back glass on their new iPhone 11 and iPhone 11 Pro permanent. Apple charges 300 to 600 dollars to replace the glass back on their new iPhones. Lucky for us, there is now an easier way to replace the back glass on your iPhone 8, iPhone X, or even iPhone 11. And that is with the new Laser Separator machine. There are several brands out there, the one I use in this video is from REWA:   Watch us try to remove the back iPhone glass with liquid nitrogen:  (it is near impossible)   Watch the Apple Watch screen replacement:  (also near impossible)  For every step a company might take to make their  product repairable, there are thousands of awesome people coming up with solutions, and ways to repair 'repairable' devices. This iPhone laser glass separator machine is one of the coolest solutions I have ever seen.   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://bit.ly/2Ks6BmC",
        "https://youtu.be/ZMKDoQ3qk7k",
        "https://youtu.be/PZYWzsB_yfA",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So Apple's going to hate me for making this video. [Music] [Intro] So we all know that the back glass on the new Apple iPhones are nearly impossible to repair. Even Apple themselves charge $550 to repair the back glass on an iPhone 10, and $600 to repair the back glass on an iPhone 11 and 11 Pro. It's because the adhesive on their back glass is permanent. Now, they are the only manufacturer that does this. Most manufactures have an adhesive that melts away when it gets hot. And you can remove the back glass and repair the whole phone for like $20. Removing the back glass is so hard and so impractical, that's why Apple charges $600 to replace it on the iPhone 11. In order for a third party to remove the glass, it has to be subject to extreme temperatures. I've even attempted to take the iPhones to the opposite end of the temperature spectrum and use liquid nitrogen. Today though, I think we found something that's more practical, more repairable, and takes the pain out of removing the back glass. And it's all done with lasers. *laser sounds from the future* So this guy right here is an all-in-one multifunctional laser machine that separates the back glass panel from the frame. Laser is an acronym for Light Amplification by Stimulated Emission of Radiation. The red laser you see on top of the glass right now is mostly just to figure out where the phone is located so we don't start lasering the metal frame of the phone. The laser is strong enough that it will actually etch the metal so we're trying to stay on just the glass surface. Once we switch over to the wide laser, that's where it'll immediately start burning underneath the glass and separating the glass from the metal frame which is exactly what we're after...saving ourselves about $500 or $600. Apple, if you're watching, you can totally buy one of these yourselves and drop your prices just a little bit. Now as the laser is pulverizing all the adhesive underneath the glass, there is quite a lot of fumes that come out, so this is a vacuum that sucks up the fumes from the burning adhesive, puts it through a filter and gets rid of the burning adhesive smell. So this setup is from a company called Rewa, and the software they have included with it works with most every major manufacturer. But today we're mostly worried about the iPhones because those are the hardest to repair. Each design is already preprogrammed into the machine, all the way from the iPhone 10, the XR, the 8. The laser can separate the bezel from the screen as well as the back cover. And the back cover on the X is what we're doing today. Once I have the laser cutout selected, make sure the phone's set in the right spot, and then as soon as I hit mark the real laser starts going. All the lasering you see happening right now is happening in real time. None of this footage is sped up, and the whole process only takes about 5 or 10 minutes. One pass with the laser underneath the glass gets rid of the bulk of the adhesive and we can do a second pass just to remove any of the remaining. After that, we can start removing the glass shards from the frame. A laser is a concentrated light beam, and that concentrated light energy can be absorbed by some objects but not others. The laser would pass through the glass just fine, but as soon as it hits the adhesive or the paint on the back of the glass, the energy is converted to heat and starts pulverizing that paint and the adhesive and turns it to dust. The high powered the laser beam, the more damage it can do. And that is it. The laser has removed the paint from underneath the glass so now the glass can fall away from the phone...for the most part. So you can see here the laser design is cutting out the black portions and that same design left the space for the wireless charging pad, as well as some sensitive bits down here along the bottom. But those sensitive bits don't have adhesive behind it holding it to the glass panel so we're just fine. So now that the laser has run it's course, we can take a look at the phone and see exactly what the laser has done. Taking a thin metal pry tool inbetween the glass and the frame of the phone, I can slowly wedge the pieces of glass out away from the back. Now in a perfect world, if the glass was completely crack-less, the laser would have gone through and disintegrated the layer of adhesive between the glass and the metal frame. You can see the pulverized paint and adhesive getting on my fingers. The laser has literally burned everything underneath the glass to ash. But where cracks appear in the glass, the laser refracts and doesn't quite burn away the adhesive. So there is still some prying to do, but it's still much easier than any method we've tried so far like extreme heat or liquid nitrogen. Now Apple has designed their phone in a way where the glass panel sits underneath the camera lens, which poses a slight problem for removal because that camera lens is welded to the frame and we want to leave that intact to make it an easier repair. I'll slowly chisel out the glass from underneath that welded camera lens. Depending on what glass you buy there are third party glasses that fit underneath this camera lens. I would recommend though that you buy a glass back that fits over the camera lens. I'll show you what I mean in a second. It just makes the repair much easier cuz you don't have to deal with that lens. So obviously I'm not a professional, I'm just showing that the machine actually works. Someone who does this on a regular basis would do a much cleaner job. But the technology is pretty fascinating. So now we have all the glass shards away from the phone. The phone itself is still working, still functional even though the back glass is removed. And now it's time to add the new glass. It'll be as good as new. So when it comes time to select a piece of glass for your phone, there's a couple different options. One is that you can get the glass with logo or without the logo. Apple's been pretty anti-repair from the beginning, so the vendors that sell the glass with the logo tend to disappear. If you're a business doing this on a regular basis, you might want to buy the glass without the logo, that way there's no copyright issues. It's effectively de-branded you could say. The second thing to look out for is the cutout of the glass. This white panel here you can see has the exact same cutout as the original piece of glass, meaning we'd have to unweld the camera lens, put the glass down, and then glue the camera lens back into place. Which is a much more difficult repair. So I recommend buying the piece of glass that has a cutout large enough to slip over top of the camera lens, and then sits down snugly inside of the frame. It's a much easier repair and no one's really going to notice the difference. The adhesive I'm gong to use to adhere the back glass to the phone is called E-8000. It's a multi-purpose jewelry adhesive that adheres glass and metal. I'll apply it to the metal of the phone in basically the same pattern that Apple used initially, and then do a super thin bead around the edge of the phone before I clamp the glass down into place. There should be some seepage out around the sides of the phone. This will help with water resistance even though I would not trust the phone to be water resistant. And before the adhesive cures, which is about 4-10 minutes, we'll use some isopropyl alcohol to clean up the seepage from underneath the glass. We want to make sure most of the overflow goo is gone before it has time to dry. It's easier to clean up when it's wet. You might be asking yourself, what about water resistance? Even though we've applied the glue in the same pattern that Apple applied the original adhesive, water resistance isn't something that you want to trust in the first place, much less after it's been broken and repaired. You should keep your phone away from water either way. One thing to keep in mind though with this laser machine is that the more cracks or the more shattered your phone is, the harder it is for the laser to get through the glass. If your glass is pretty much obliterated, the laser is going to go down and get refracted all over the place and not burn through the adhesive underneath the glass. So the less cracked your back is, the easier it is for this machine to work. Either way though, this machine brings the repair to a much more practical and sustainable level. It's doable. So each of these back glass panels costs about $20. Now granted we did have to buy a $2000 machine, but for a repair shop doing a lot of these on a regular basis, it's a substantial improvement. And I'm a huge fan of where the technology is headed. Lasers are pretty cool. So obviously this repair is a bit more complex than your average teardown and requires some pretty expensive equipment, but it's good to know that the repair is possible and that there are people out there doing it for much cheaper than Apple. Repair is an option. As much fun as playing with liquid nitrogen with the King of Random was, using this laser separator is much easier. I have a feeling these machines are going to get real popular real quick. I'll leave a link for these down in the video description so you can check out the current pricing. As with all technology, I'm sure the price is going to go down as time progresses. If you have any questions leave them down in the comments. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around. These right here are all Apple Watch displays. Every single one of them. My buddy's done so many Apple Watch repairs that he turns them into artwork.",
    "transcript_keywords": [
        "glass",
        "back glass",
        "laser",
        "back",
        "phone",
        "Apple",
        "adhesive",
        "underneath the glass",
        "repair",
        "camera lens",
        "glass panel",
        "underneath",
        "back glass panel",
        "lens",
        "glass back",
        "frame",
        "camera",
        "Apple Watch",
        "Apple Watch repairs",
        "metal"
    ],
    "transcript_entity_values": [
        "about $20",
        "10 minutes",
        "about 4-10 minutes",
        "8",
        "Instagram",
        "550",
        "E-8000",
        "like $20",
        "about 5",
        "the King of Random",
        "Light Amplification by Stimulated Emission of Radiation",
        "11",
        "2000",
        "600",
        "Apple",
        "iPhones",
        "Rewa",
        "XR",
        "first",
        "second",
        "today",
        "third",
        "Today",
        "One",
        "Apple Watch",
        "one",
        "Twitter",
        "about $500 or $"
    ],
    "transcript_entity_types": [
        "MONEY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "NORP",
        "MONEY",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY"
    ]
}