{
    "id": "lLAmL6Tz59Y",
    "title": "iPhone 8 Durability Test - BEND TEST - Glass Scratch Video!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-09-22T01:03:23Z",
    "video_url": "https://www.youtube.com/watch?v=lLAmL6Tz59Y",
    "category": "Science & Technology",
    "tags": [
        "iPhone 8",
        "Apple iphone 8",
        "iPhone 8 durability test",
        "iPhone 8 scratch test",
        "Iphone 8 bend test",
        "apple",
        "iPhone",
        "Smartphone",
        "tech",
        "iphone 8 unboxing",
        "iphone 8 hands on",
        "iphone 8 review",
        "how durable is the iphone 8",
        "New iphone",
        "ios",
        "ios 11",
        "technology",
        "Mohs",
        "Mohs hardness scale"
    ],
    "views": 4009639,
    "likes": 69651,
    "comments_count": 5822,
    "description": "Can the iPhone 8 survive the JerryRigEverything Durability tests?! Will the new glass design change of the iPhone 8 mess with the structural integrity of the phone? Doing a bend test of the iPhone 8 is the only way to find out. I have done over 75 smartphone durability tests, and the iPhone 8 is the next one on my list. Apple has said that the glass on their new smartphone is the most durable smartphone glass ever. Will that correlate to a higher rating on the Mohs Hardness Scale? There is only one way to find out and that is with the JerryRigEverything durability test. My tests are the best way to find out if your iPhone 8 will last for the next 2-3 years in your pocket.   Would you buy this new Glass Back iPhone 8? or would you wait for the iPhone x?  Does Apple really use Sapphire?:  iPhone 7 durability test:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/Zx4hRmuW6TM",
        "https://youtu.be/0vYfAqEyGV0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "The iPhone 8 is here. The same basic shape and feel as last year's iPhone 7, but with the huge physical difference of adding a glass back instead of metal. This is my first time touching the iPhone 8 since Apple didn't invite me out to their launch event, not really sure why, and the glass makes it surprisingly heavy which I actually really like. Will this new glass iPhone have the same structural integrity that the metal iPhones had previously. There's literally only one way to find out. Let's get started. [Intro] Apple claims that this is the most durable glass ever on a smartphone. Pretty bold claim. I've tested over 75 different phones now, and I think we should start with the scratch test first. I have a set of Mohs hardness picks that differentiate between different minerals. Plastic screen phones will scratch at a level 3. Glass is usually around a 5 or 6 on Mohs scale and real sapphire scratches at a level 8 or 9. As far as scratching goes, this glass scratched at a level 6 with a deeper groove at a level 7, which is the exact same score that the iPhone 7 got last year, as well as the Note 8 and most other tempered glass flagships these days. When Apple says most durable they might be talking about impacts and drops instead of scratch resistance. Let me know in the comments if you think I should drop test a couple of these phones. Even though the screen is impervious to my razor blade, coins, and keys, I would still recommend a screen protector. Plenty of other dust, minerals, and pocket sand are harder than a level 6 and can cause micro-abrasions. Speaking of sapphire, Apple does claim to use some sapphire on their phones, namely the camera lenses. So we'll have to put that to the test again. The home button is not affected by my razor blade so it won't get damaged or scratched up while sliding around in your pocket or purse, and that's good for durability. Up at the top of the phone we have the 7 megapixels front facing camera tucked under that same slab of front glass, so it is protected against major scratches and damage as well. With previous versions of the iPhone, Apple used a flimsy metal screen to cover the earpiece which sometimes could jostle and fall out. But nowadays they use a more permanent solid metal screen which will not fall out or dislodge. Bonus points for that one. The gold glass iPhone 8 has a solid slab covering the entire rear surface of the phone. Still undamaged by my razor blade. It's also good to see the Apple logo and iPhone text are layered under the glass and not exposed on the surface. This means they won't rub or wear away with use or time. It's pretty cool how the dual tone LED flash blends so perfectly with the pink and gold color of this phone, protected under the glass surface. Things are still looking sleek and aesthetic. One cool thing is that right next to the camera lens, there's a little microphone hole that has a metal grill in it. Apple's attention to small detail and aesthetics is amazing. Most phones just leave it as a hole with no protection. And now for the camera lens. Apple claims that this is made from sapphire. Sapphire is a super premium and expensive and durable material that resists scratching until a level 8 or 9 on Mohs scale. Testing out this claim with my razor blade, which is about a 5 and a half on Mohs scale, leaves no scratches which is great. And that means that this camera lens is just as durable as regular glass so far. But when I test Apple's sapphire with my Mohs picks, I see visible marks at a level 6, and a level 7, and a deep catching groove at a level 8. It looks like Apple is still using their own proprietary blend of sapphire. I delved pretty deep into this subject during a previous video, and it is aluminum oxide, which is the ingredients of sapphire. But my Mohs picks and an electron microscope indicate that it is a lower grade material than the actual pure sapphire that's used in Tissot's premium watches, or the full sapphire display on the HTC U Ultra sapphire edition, both of which didn't scratch until a level 8. Apple might have extreme attention to detail, but it's my opinion that they cut some corners with this sapphire stuff. I did buy one of their overpriced sapphire Apple watches to test, and that should arrive today sometime. So make sure you're subscribed so you don't miss that durability test. There is a metal ring around the camera lens, but the weird part is that the camera lens sticks up even farther than the metal ring does. So there's no protection for that lens. And since it scratches at a level 6 instead of a level 8, it still needs that protection. Now the sides of the phone are real metal, so Apple did a good job there. This handles keys and coins very well. But my razor blade manages to remove some color, exposing that silver 7000 series aluminum underneath. So it's probably best not to keep your razor and phone in the same pocket. The SIM card tray and power buttons are both metal, along with the button-less and port-less top of the phone. The volume buttons and mute switch are also metal bonus points for that. I'm still definitely a huge fan of that mute switch by the way. I wish more Android phones had that feature. The singular proprietary lightning port is at the bottom of the phone. Still metal down here as well. And still no headphone jack, but Apple has been kind enough to include a dongle in the box if you don't happen to have one of your own. Now I do like to roast Apple every now and then, physically and verbally, and one cool thing about the IPS retina display is that after about 10 seconds in extreme heat, the pixels go black and turn off. But after the heat is removed and the pixels cooled down, they recover completely. The phone is cool to the touch within seconds. It's still important to not try this on your own phone because the flame does burn off the oleophobic exterior coating on the glass. I have been contacted by several angry mothers whose kids have burned phones, so please don't try this at home. Speaking of things to not try at home, it's time for the ultimate test of durability. Nothing stresses the construction of a phone like a bend test. And whether you're an Android fan or an Apple user, everyone can appreciate a well built phone. And this is indeed a well built phone. There is zero flex to this device. If you remember on my iPhone 7 bend test last year, the waterproofing adhesive was ruined by the bend. But this has since been corrected with the iPhone 8. I'm very impressed. There is no glass separation on the front or the back no matter how you bend it. This phone is definitely skinny jean approved. The last thing I want to point out as a bonus and thumbs up to Apple's build quality is the rear glass panel. It has a lip of plastic around the edge as a cushion to protect the glass during drops, so the plastic helps out. Smart design choice. The front screen also has a plastic cushion around the glass as well. Most people wouldn't notice this subtle detail, but Apple does put an extraordinary amount of thought and design into their phones...well, except for the sapphire camera lens anyway. Hit that subscribe button if you want to see that sapphire Apple watch tested. And come hang out with me on Instagram and Twitter. I think we should try and make a clear iPhone 8. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "Apple",
        "glass",
        "sapphire",
        "phone",
        "level",
        "iPhone",
        "metal",
        "phones",
        "sapphire Apple",
        "Mohs",
        "camera lens",
        "test",
        "test Apple sapphire",
        "camera",
        "Apple claims",
        "lens",
        "razor blade",
        "Mohs scale",
        "glass iPhone",
        "razor"
    ],
    "transcript_entity_values": [
        "iPhone",
        "9",
        "7000",
        "Tissot",
        "6",
        "7",
        "8",
        "Instagram",
        "Glass",
        "75",
        "Mohs",
        "6",
        "8",
        "only one",
        "half",
        "SIM",
        "zero",
        "last year's",
        "5",
        "Apple",
        "seconds",
        "last year",
        "first",
        "Sapphire",
        "7 megapixels",
        "today",
        "U Ultra",
        "these days",
        "Android",
        "iPhone 8",
        "3",
        "One",
        "iPhones",
        "one",
        "about 10 seconds",
        "Twitter"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG"
    ]
}