{
    "id": "lLfIc_eBIiQ",
    "title": "Amazon Alexa-powered microwave hands-on",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-09-20T21:39:30Z",
    "video_url": "https://www.youtube.com/watch?v=lLfIc_eBIiQ",
    "category": "Science & Technology",
    "tags": [
        "alexa",
        "amazon",
        "microwave",
        "microwave oven",
        "amazonbasics",
        "alexa oven",
        "amazon alexa",
        "amazon echo",
        "amazon basics",
        "voice control",
        "voice assistant",
        "smart home",
        "kitchen",
        "kitchen toy",
        "appliances",
        "smart kitchen",
        "jeff bezos",
        "technology",
        "top 10",
        "gadget",
        "gadgets",
        "tech",
        "update",
        "first look",
        "hands on",
        "review",
        "latest updates",
        "how to",
        "apple",
        "google",
        "verge",
        "the verge"
    ],
    "views": 191732,
    "likes": 2028,
    "comments_count": 371,
    "description": "This is the new AmazonBasics Microwave that works with Alexa. It doesnt have any microphones on it, nor any speaker (beyond one that can beep). Instead, its a $59.99 device meant to showcase Amazons new system for companies to make their regular gadgets into smart gadgets. The microwave includes voice presets for various foods, so you can cook just by asking Alexa. Theres also a built-in Alexa button that you can press and say simple commands.   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey, this is Dan Seifert with The Verge and I'm here in Amazon's offices where they've just announced a bunch of new Echo and Alexa powered things, and one of the most interesting things that they've announced is the new AmazonBasics Microwave. Now this is a basic microwave, it's a $59.99, 700 watt, .7 cubic foot, basic microwave, basically the most standard microwave you can look at, but what they've done is that they've added a new feature to be able to control it with Alexa. You can see there's a button right here that says Ask Alexa, so the microwave itself is paired to this Echo Plus over here. So, I can do something like, put a potato in there, which I've got, push the button, and say, one potato. (microwave beeps) and it's automatically in control of the microwave to the automatic mode for the potato. You can do this with popcorn, you can do this with defrosting, you can do this with a whole bunch of different things that you might use a microwave for. You can also stop it with your voice. Stop the microwave. (microwave beeps) And there you go. Now the other thing that you can do is you can use your voice directly with the Echo Plus without having to touch your microwave at all. So I can say, uh, Alexa, microwave one potato. (microwave beeps) And it does the exact same thing there. So we'll stop that... - [Alexa] 34 seconds. - Now, the way Amazon was able to do this is with the new Amazon Connect Module which adds Bluetooth, and Wi-Fi, and some of the other things that are necessary to make it possible for appliances to talk to Alexa and talk to the Cloud and become smart. Now, Amazon's using this as kind of a demo of the product and the Amazon Connect feature, but you can still buy it, it's 60 bucks, you can order it today and it'll ship sometime in November. But what the real model here is for when other appliance makers can easily integrate Alexa services right into their thing. So if it's a washing machine, or an oven, or a microwave oven, or something else like that, it makes it very easy for them to do that. It's pretty interesting, it's pretty wild, and it's pretty cool. Alexa, what's the weather? - [Alexa] Currently it is 60 degrees Fahrenheit with cloudy skies.",
    "transcript_keywords": [
        "Dan Seifert",
        "Microwave",
        "Alexa powered things",
        "Alexa",
        "Amazon",
        "Echo",
        "Amazon Connect",
        "Dan",
        "Seifert",
        "Verge",
        "Alexa powered",
        "basic microwave",
        "Amazon offices",
        "announced",
        "Amazon Connect Module",
        "AmazonBasics Microwave",
        "things",
        "powered things",
        "Amazon Connect feature",
        "thing"
    ],
    "transcript_entity_values": [
        "59.99",
        "November",
        "one",
        "Echo",
        ".7 cubic foot",
        "today",
        "Alexa",
        "AmazonBasics Microwave",
        "the Echo Plus",
        "Amazon Connect Module",
        "700 watt",
        "60 degrees Fahrenheit",
        "60 bucks",
        "Alexa",
        "Wi-Fi",
        "Amazon",
        "Alexa",
        "Echo Plus",
        "Bluetooth",
        "Cloud",
        "Dan Seifert",
        "34 seconds"
    ],
    "transcript_entity_types": [
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "TIME"
    ]
}