{
    "id": "LlKQsfDGrxw",
    "title": "What can WE do?",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-03-19T12:00:07Z",
    "video_url": "https://www.youtube.com/watch?v=LlKQsfDGrxw",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 82888,
    "likes": 5363,
    "comments_count": 875,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hi, guys. It's Justine and I'm making a video. It's weird. Everything is just so weird right now and I cannot reiterate enough whatever you're feeling right now about everything. Your feelings are valid because everyone is feeling some sort of way and I don't know how we deal with it but the one thing that I have realized is the internet is coming together as a community, to really just uplift people, and I think that's so important right now and not just on the internet, in your community is where you live, neighborhoods, people are helping each other. And I've even reached out to some of my neighbors and asked if there's anything that I can do because I don't know what else to do. I am actually quarantining myself. I'm taking those precautions. The number one thing right now, is people who don't have symptoms, they have this and they're giving it to people not even knowing that they have it. So that's why all these precautions are in place. I'm not gonna go into it, but I wanted to just show you guys some of the tweets that I got today, because this morning, I was really having a really hard time with everything. I was in my closet, trying to put laundry away, and I just started crying and I want to help. I don't know what to do. I think so many of us want to. And as somebody who does have an audience, the things that we say, I hate the term influencer more than anything, but in this sense, that's what we're doing. I follow a lot of different people. And the past several weeks, I'm following these people, thinking that the things that they say are things that I can trust, and it turns out a lot of people have retweeted a lot of false information. And like I said in a previous video, that's something that I never wanna do. I never want to be providing you guys false information. So I tweeted this this morning, just asking what can we, as people who you watch, as influencers, what can we do? What do you want from us? I'd also been talking a bunch of my other internet friends who are also making YouTube videos and we kind of all have the same feeling, like we wanna do something but we don't know what to do. Do we keep making videos? And that's such an internal conflict 'cause we wanna be sensitive to what's happening. And the overwhelming response that I got to this tweet was people saying, \"We need you guys more than ever right now \"to keep making the content. \"Don't continually keep talking about this.\" Because that's what the news is doing. We're being inundated by so much information. I think just following the CDC and websites that are actually giving us truthful information is really the number one thing. They're telling us to wash our hands, stay inside because you don't know if you could have it. You could be spreading it to someone who then gives it to their family. It hurts just to see people not taking it seriously. But this thread was so incredibly refreshing, which is why I wanted to just sit here and thank you guys for your responses and I wanna read some to you because if you are somebody who is making YouTube videos or making any type of content online, these were really, it was really helpful for me to also read this and just see what you guys want from us. So I'm gonna start with Steven who is also from Pittsburgh and a gamer and he's absolutely incredible. This is what he had to say. He said, \"I honestly believe \"that the best thing that we can do as influencers, \"no matter, whether you have a hundred \"or a million followers, \"is to keep creating the kind of content that you want. \"Our obligation is to our community, \"to be the best shepherds we know how. \"That's all anyone can ask of us.\" And I think this is really important, the fact that he's saying it doesn't matter if you have a hundred or a million followers, even if you just have one or two, that's some who could potentially need help, that's why I'm stressing to you guys, reach out to your friends. People that you may not have talked to in a while. Ask them if they're okay. Ask them if their family's okay. And ask them if anybody needs anything. 'Cause you might have something, an abundance of maybe some toilet paper that you could share with somebody who needs it. This was a great tweet from James. So I really appreciate it. He said to \"follow your heart. \"People need information and they need entertainment.\" Even myself. I have been spending a lot of time, trying to just find content to watch and all people are talking about is this. So I just wanna reiterate, this is gonna be my last video about the whole subject. I mean, I'm gonna be talking about it but I don't wanna make this overabundance of content, just saying the same things that you guys are hearing on the news because clearly that's not what you guys want, but I just want you to know that this is a worldwide thing. We're all going through this. Not a single person who feels like they're the only one doing this. They're not. It's really really crazy. I'm still processing. I don't even know. I don't know, I don't know, we don't know. Rene Ritchie says, \"Providing compassion and escapism. \"Information where we can, entertainment where needed. \"Helping, never exploiting. \"'Until such time as the world ends, \"'we will act as though it intends to spin on.'\" Which it does. And it was really such a weird thing to see that Apple had just announced a bunch of new products and when you think about it, they have to. People still have to have jobs after all of this is over. Apple's just a massive company. So many people work there. And this isn't just Apple. All companies have to try to keep going for the sake of their employees. For the sake of those people's families. So, whatever after this, our new normal is. That's what it's gonna be. It's gonna be a new normal but I'm incredibly confident that no matter what, we're gonna figure it out. People adapt. And I think that a lot of us are a lot stronger than we realize, and I think it's something like this, that we really can use this to create a better community, realize things that are important, and really just reevaluate our entire lives 'cause that's definitely something that I've been doing. And I think in the end, it's gonna be a very positive thing. It might take a while but I feel like we're all gonna be so much better coming out of this and surviving. Rebecca says, \"Being honest.\" I think that's incredibly important because we can't be spreading misinformation. \"Everyone should do their best \"to spread word of proper quarantine protocols, \"to be serious about the situation, without panic, \"stay firm about doing the right thing \"for neighbors, friends, family, without being negative, \"dispel misinformation, link good resources.\" Definitely, a truth. I think just linking good resources is very important. Just be careful that you are actually linking something that is legitimate. \"I think influencers \"should be providing entertainment right now \"of all the things they love the most. \"It'll give people an escape from the news \"and everything that's going on.\" \"Influencers should keep making their content. \"We need the distraction. \"Just a little distraction and some videos \"could help us on that end.\" Working from home is not an easy thing. So if any of you guys, this is something new to you, that you've never done before, it is incredibly difficult. I have been basically working from home for 13 or 14 years now. Obviously, in those years I've been able to sort of set up a little office space, and separate my work home life. But it's still, it's all one. Everything just mixes together. So my biggest advice to somebody who is struggling, if there's any way, even if you can just, mark off a bit of the house that is a no work zone, that's gonna be so important, whether it's your bedroom or the kitchen, it's like no phones in the kitchen or no laptops here. Just setting those small little boundaries for me has been very helpful, and I think that for somebody that's kind of getting thrown into this for the first time, maybe it'll help you, maybe it won't. I think you guys will all quickly figure out what works and what doesn't. Craig says, \"Honestly, carry on as normal. \"I think everyone would be grateful for a distraction. \"I wanna see your optimism and excitement \"over brightly colored tech. \"Keep doing you.\" This also got me thinking, talking about the new iPad, and the MacBook, and all of these new tech things that are gonna be coming out. People are gonna have way less disposable income to spend on high-priced gadgets. So reviews are going to be so important because you don't wanna be wasting any bit of extra money on something that you don't think is gonna be worth it. And obviously, I think reviews are very important overall, but now more than ever, you don't wanna leave anything out to chance. You need to know, I wanna know. I don't even wanna be spending extra money on products to review that could potentially not even be worth it. It probably comes as a surprise that I do buy a lot of the tech that I review. I mean, I'm very lucky that sometimes companies will send things. I would say 70% of the time I buy a lot of it. This one, I really like. \"I'm a YouTuber with 300 plus subscribers. \"In my opinion, at this time, \"what we can do is just keep going as we always have done. \"Also this would be a good time \"to share a skill with your followers. \"Help them develop new skills \"and encourage them to be creative and busy.\" And that's something that I cannot stress enough. Just keeping busy. Working out, I think, is gonna be very important for so many people and it's something that I definitely struggle with, because I love group workout classes. I love going to group yoga classes, getting into jujitsu in the past two years has been something that is so, it's been basically just a place that I go, that I can be myself, not have to worry about anything, and learn and train, and now that I haven't been able to do that, trying to find ways to keep motivated and work out at home. I don't know if you guys have been paying much attention to some of the things that a lot of companies have been doing, but I've been a huge fan of Peloton, not sponsored. They have a really great digital app, and they're giving people 90 days free and I am so excited about this because I love this app so much. They have so many incredible classes, their yoga classes are amazing. So the one upside to a lot of this is a lot of these companies are giving away some incredible things for free. I usually go to CorePower Yoga. They have some free online classes. It's also been so amazing to see so many jujitsu gyms giving away their curriculum for free. Everyone is just kind of banding together and really just trying to get through this. It's also fascinating because I've had a lot of people reach out and say, \"What's the best way to create online content?\" So that's something that I'm also considering, is if I can put together a little video for people who have never made anything online before. Here's just a few simple easy steps and things that you can do to start creating. 'cause it's a whole 'nother world and it's just something that I've really been doing my whole life. And to throw a company or a small business into now having to move everything to digital, I can't even imagine. I think it's incredibly difficult. So I think that's also something that a lot of us tech people can do, offer our expertise and somehow help some of these businesses through the trying times of trying to create content online because it's not easy. It's not easy at all. And I think people are finally realizing that. So if there's anything you guys would like to see, or you think that would be helpful to people, let me know. \"What I need right is from influencers \"to keep doing what you're doing. \"My life has been interrupted enough, \"no need for changes.\" \"To put people's mind on something else. \"COVID-19 is everywhere. \"We need some distraction from this mess and panic. \"We need laughs and we need to let our brains let go.\" I agree, I'm working on it. I promise, I'm not gonna be talking much more about this but I just feel like this is really important, just to reiterate to us as creators that we need to keep creating. If you, as a person who is watching content creators, maybe start creating. Maybe you'll find yourself an audience of people and realize that this is maybe your passion. This also, kind of upset me a little bit. Omar said that, \"Girl, I'm in Austin. \"People are having picnics and playing volleyball. \"Social distancing is not vacation time. \"I don't get it.\" I don't get it either but I also do get it, because I don't think people realize that this is very serious. It just, I mean, the fact that the whole world is shutting down, that's not a joke. I don't know. I don't understand. You can go outside. You can go for walks. I talked to one of my neighbors today from across the street, waving. Don't be going outside and playing football or a sport, and sweating all over each other. That's not a good idea, and if your friends are asking you to come play a sport, say no and that's a bad idea and please try to encourage them that that's not a good idea. Neil is saying, \"Supporting mental health \"and people who have kids at home throughout the day, \"inspiring videos for people of all ages, \"inspiration to create and be productive \"during this unprecedented time.\" I can't even image. Parents trying to entertain their kids, homeschooling. There's so many great online resources for everything. I don't have children and I'm not homeschooling. I probably should be homeschooling myself in basic math but if you guys do have any suggestions on anything, any websites or anything that can help other people, leave them in the comments. Oh, this is a nice one. Colby said that they forgot that I existed. Okay. \"Modeling good behavior. \"Not to say you need to lecture people about it, \"just don't model irresponsible behavior. \"Acknowledge that people's lives are upended, \"but also provide entertainment, \"we still need it. \"In general, that's my thoughts.\" There were so many more and I just really enjoyed reading all of your guys' responses. I'm gonna still make videos. I'm gonna shoot, I'm gonna edit, and I don't know, this has always been an outlet for me, making videos and trying to be creative. So I look forward to seeing what happens when we all come out of this on the other side. And just I would love to know, is there a skill or something that you guys would like to learn while we're in quarantine? I think my one skill that I would like to get out of however long this is, is I really wanna be able to do a handstand. My sister, Breanne, is so good at handstands. She used to be a gymnast, I do a lot of yoga but I can never freaking get the handstand. I just fall over. I don't know. Maybe I have a weak core, whatever it is, so that's what I'm workin' on over here. Try to do a handstand. (chuckling) (sighing) Should I try one right here? I don't know, let me see. I wanna try. Oh, I don't like my pants. I didn't think you guys would see my pants today. So one great thing about working at home, usually nobody ever sees your pants. Okay, I'm gonna try my handstand. We're gonna see how it is. I can't freaking do it. (loud breathing) All right, bye. (beeping) (coughing) Oh god. I'm afraid to even cough now.",
    "transcript_keywords": [
        "people",
        "guys",
        "lot",
        "things",
        "thing",
        "important",
        "content",
        "time",
        "making",
        "videos",
        "information",
        "good",
        "talking",
        "home",
        "online",
        "influencers",
        "video",
        "making videos",
        "incredibly",
        "kind"
    ],
    "transcript_entity_values": [
        "Steven",
        "MacBook",
        "Omar",
        "COVID-19",
        "14 years",
        "one",
        "Rebecca",
        "iPad",
        "a hundred",
        "Apple",
        "Justine",
        "James",
        "this morning",
        "300",
        "Influencers",
        "Peloton",
        "Craig",
        "the past several weeks",
        "the day",
        "a hundred or a million",
        "Austin",
        "13",
        "YouTube",
        "the past two years",
        "CDC",
        "a million",
        "CorePower Yoga",
        "Pittsburgh",
        "today",
        "two",
        "Colby",
        "90 days",
        "Breanne",
        "first",
        "Rene Ritchie",
        "Neil",
        "70%",
        "those years"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "PERCENT",
        "DATE"
    ]
}