{
    "id": "Lm6k6LhHbKc",
    "title": "brb, new Ryzen just dropped",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-03-17T00:48:44Z",
    "video_url": "https://www.youtube.com/watch?v=Lm6k6LhHbKc",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "AMD",
        "Ryzen",
        "Ryzen 7 5800X3D",
        "Ryzen 7",
        "Ryzen 9",
        "Ryzen 2022",
        "new Ryzen",
        "processors",
        "pc gaming",
        "build PC",
        "pc building",
        "DIY PC",
        "Ryzen 5000",
        "300 series motherboards",
        "AMD 300 series motherboards",
        "update",
        "Ryzen 7 5700X",
        "Ryzen 5 5600",
        "Ryzen 5500"
    ],
    "views": 578475,
    "likes": 31154,
    "comments_count": 853,
    "description": "Save 67% on hosting with DreamHost at    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 Wha- OH! No...  0:11 Ryzen 7 5800X3D + others 1:39 Ads in Windows 11 File Explorer 2:37 Intel Arc Laptop GPUs 3:36 DreamHost 4:08 QUICK BITS 4:16 Steam alpha for Chromebooks 4:46 NFTs coming to Instagram 5:05 DirectStorage API 5:33 Tesla fires employee  6:05 Sunshine Protection Act  FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://bit.ly/3oUFp2n",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/tjxmq",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- Oh, no, I don't have any tech news. Oh, ah, but of course I do. - [cameraman] Got 'em, got 'em - Yes, I got 'em. - [Cameraman] Fuck, you got me too. - Could you imagine? - [Cameraman] I almost cut the camera. (Riley laughing) - It's not quite time for AMD to release a completely new generation of Ryzen CPUs. So instead, they've confirmed rumors that they'll be fleshing out the current gen Ryzen 5000 and last gen 4000 lineup. Filling in the gaps a little bit, you know, just like grandma used to do. (both laughing) - [Cameraman] Yeah. - You know, like grandma would make the good food for you. Like fill in you, like you're skin and bones, eat something. (cameraman laughs) - [Cameraman] Hi, Riley, have some more. (Riley laughs) - The most exciting part is the previously announced Ryzen 7 5800 X3D, the first chip to feature AMD's 3D V-Cache, which will launch on four 20 because it's performance is- - [Cameraman] Nice. - It's gonna be lit. It's gonna get buzzed. It's not a thread ripper but- - [Cameraman] You're gonna get ripped. - Alongside that processor will be six additional chips from the Ryzen 3 4100 up to the Ryzen 7 5700X that will hopefully give budget gamers more options to maybe, hopefully build a PC in this gabe forsaken time. And there's another bonus, AMD is officially adding support for 5,000 series chips on 300 series motherboards. So you might not even have to buy a new board meaning you're free to spend that money on whatever just gets you sloshed, dude, whatever loopy you know like, whoa. Wow! - [Cameraman] Thanks AMD. - Thanks, boo. Oh, it's James! Guys, James is here now. Microsoft is weathering criticism once again for going and sticking ads in places they don't belong, namely the Windows 11 File Explorer. An enthusiast called Florian tweeted a screenshot showing a banner ad for Microsoft Editor. What? - [Cameraman] File explorian? - File explorian. (Riley laughs) - [Cameraman] Florian. What! - I was almost there in my brain. He was shown a banner ad for Microsoft Editor when he was just trying to navigate his documents' folder. I mean, that's hard enough, especially the way he keeps it. Ah, there's an audacity folder in there. Like, do you click it? Like, ah, come on! (Riley laughs) Before you get mad about Microsoft having the audacity to do this again, the company said the banner was actually supposed to be disabled in that insider build, and it's just something they're testing internally. - [Cameraman] For now. - Yeah. But given that every attempt by Microsoft to shoehorn ads like this into windows is met with the same response, you'd think they'd learn. Maybe try Edge. And PC gamers have waited patiently for Intel's gaming GPUs. And now, they're finally here in two weeks and in laptops. Yep, team.blue has announced a launch event for the company's first Arc Alchemist discrete graphics cards on March 30th at 8:00 AM Pacific time. The first GPU to arrive on the market will reportedly be the A370M, which will feature up to two times the performance of Intel's integrated graphics without changing the basic laptop form factor. So that's, it's cool. I dunno. - [Cameraman] Laptops. - Laptops. Look, these GBUs will bring support for advanced features like ray tracing Intel's own XeSS AI-powered super sampling- - [Cameraman] XX. - Is that what we're calling it? - [Cameraman] I don't know. - And other features, but if it's not in the form of a physical thing, I can slide into a tower, then it's hard to get excited. I just like taking the muscles, I feel the motion. Now let's have our quick bits brought to you by DreamHost, the company that helps you own your digital presence with premium WordPress website hosting at affordable prices because they have their own data centers. Whether you have a business, you wanna showcase your latest build or you just want a central spot for all your content, DreamHost, huh, they're the dream, baby. They've got templates and website builders to help you get online fast or a pro-services team to build the site for you. Plus migrating an existing WordPress site to DreamHost is easy and free. Check out DreamHost and save 67% when you purchase through the link below. All right, here's a quick bit, they do sting a little if you're tensed up. So just relax. Just- - [Cameraman] Relax your butt hole. - Chill. Chrome Aficionados got a little excited when a Google rep at the tech giants Google for Games Developer Summit casually mentioned that the Steam alpha for Chromebooks just launched. - There are also a lot more ways to play video games with Chromebooks. For example, the Steam alpha just launched - Turns out that's not true yet. But the incident did confirm that the alpha is coming soon. So get ready to turn Chromebook into a poem book. (mimics explosives) Mark Zuckerberg just announced at South by Southwest that Meta is working on bringing NFTs to Instagram in the near term, because yes, the platform can be pretty toxic right now, but we're talking rookie numbers. We gotta get those numbers up. And who knows numbers better than apes. In fact, we're apes. So that says it all. Better buy it now before it gets hot Microsoft has finally released the API for direct storage. It's technology that enables faster load times and bigger game worlds for the public after launching the developer preview last year. Tech like this exists on the current gen Xbox's and the PS 5, but this API will allow any game developer to implement the feature on Windows 10 or 11. - [Cameraman] You can't catch up PC gaming. - Yeah, but it's pretty nice. I mean, it's not every day you get a story that's just like, oh, games will be better now. Nice. - Tesla has fired an employee, John Bunnell for posting a video showing his model three hitting a bike lane divider while in full self-driving mode Bunnell says he recorded the video in his personal vehicle using software that he paid for off of company time and property. But Tesla still called the video a conflict of interest. The interest here on Tesla's part being in preventing normies from seeing the Tesla cars still don't have full self-driving capability many years after it was promised. It's finally gonna release one day and we'll just open the hood up and Elon is in there just moving in. - [Cameraman] They fired him for being so stupid. (Riley laughs) - And in a rare instance of the US Senate actually doing something, a bill called the sunshine protection act was unanimously approved yesterday, which would make daylight savings time permanent across the country if approved by the house and President Biden - [Cameraman] Biden, he looks like a snowbird. He loves the sun. - Is that related? Going for vacation? - [Cameraman] You know. - You know. (Riley laughs) Guys, I'm not joking. This episode is over. Come back on Friday for more tech news. I'll try to scrape around and find some. You know I'll have some, unless ooh.",
    "transcript_keywords": [
        "Ryzen",
        "Microsoft",
        "Microsoft Editor",
        "AMD",
        "time",
        "Tesla",
        "Intel",
        "company",
        "build",
        "DreamHost",
        "tech",
        "video",
        "Windows",
        "current gen Ryzen",
        "gen Ryzen",
        "announced Ryzen",
        "Games",
        "feature AMD",
        "File",
        "feature"
    ],
    "transcript_entity_values": [
        "four 20",
        "yesterday",
        "the A370M",
        "Chromebooks",
        "Arc Alchemist",
        "Intel",
        "the PS 5",
        "three",
        "Mark Zuckerberg",
        "Elon",
        "4000",
        "Riley",
        "XeSS AI-",
        "67%",
        "Chromebook",
        "Tesla",
        "Google for Games Developer Summit",
        "Google",
        "the US Senate",
        "Windows 10 or 11",
        "DreamHost",
        "Chrome Aficionados",
        "Florian",
        "the sunshine protection act",
        "Chromebooks",
        "Instagram",
        "Microsoft",
        "South",
        "API",
        "Biden",
        "Friday",
        "300",
        "up to two",
        "AMD",
        "first",
        "AMD",
        "John Bunnell",
        "Ryzen 7 5800",
        "3D V-Cache",
        "GPU",
        "WordPress",
        "gabe",
        "one day",
        "two weeks",
        "March 30th",
        "Xbox",
        "six",
        "Southwest",
        "James",
        "5,000",
        "Ryzen",
        "Bunnell",
        "8:00 AM Pacific",
        "Meta"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "LOC",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "PERSON",
        "LAW",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "LOC",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG"
    ]
}