{
    "id": "LNAMOQyRaoc",
    "title": "The THINNEST Powerbank Ive ever opened...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-01-30T15:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=LNAMOQyRaoc",
    "category": "Howto & Style",
    "tags": [
        "Thin power bank",
        "crave powerbank",
        "travel size power bank",
        "best power bank",
        "lithium ion",
        "battery",
        "how are batteries made",
        "pouch",
        "portable power bank",
        "USB c",
        "portable charger",
        "tech",
        "technology",
        "gift idea",
        "lithium",
        "mining",
        "types of batteries",
        "crave direct",
        "crave battery"
    ],
    "views": 1150540,
    "likes": 21272,
    "comments_count": 1680,
    "description": "The Crave Plus Thin Powerbank is HERE:  There are two basic kinds of Lithium Ion batteries, the round tube shapped batteries that weve seen inside of the other thick powerbanks ive taken apart, OR the super thin pouch styple batteries we see inside of cell phones. The Crave Powerbank (on Amazon HERE:  has some of the biggeset pouch style lithium ion batteries that Ive seen. Adding up to a 10,000 mAh capacity that can charge up your cell phone multiple times.   Lithium can be found inside igneous rocks, but is more commonly found in HUGE brine pools, like the ones I showed in this video. The cool pastel colored lithium looks amazing from the sky. Someday I want to go film the mining process.  But today we'll have to stick with taking the batteries and powerbanks apart.   Let me know if you have any questions!   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://bit.ly/Plus10000",
        "http://bit.ly/TypeCPowerBank)",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Batteries are important they basically run all of our portable electronics. I've taken apart a couple of power banks recently, and they've all had these large cylindrical lithium ion batteries inside. Today we have a new cover, a new contestant, the Crave Plus, that is a much thinner and sleeker profile. Today we're going to take this thing apart and see what makes it different from the larger cylindrical battery. Thanks to Crave for sending this out. Now let's see what this thing is made of. [Intro] Like you saw, Lithium batteries come in two basic shapes and sizes, from the non-removable square batteries we see inside of cell phones, to the cylindrical batteries we see inside of charging banks, electric cars, or even the massive Hornsdale battery system powering 30,000 homes in South Australia. Batteries are everywhere and lithium batteries are impressive. Lithium, the element inside most of these batteries, is found in igneous rocks, you know, the ones from volcanoes. But the largest producers of lithium in the world is Chile, which extracts it from huge pastel covered brine pools. I'm guessing this aluminum covered Crave Plus power bank has a lithium polymer battery inside, which is the same thing that we see inside of most cell phones, but fits a 10,000 milliamp hour battery life in the footprint about the same size as the iPhone 8 Plus. So as most electronics are moving over to USB-C from the micro USB, this Crave Plus power charger has 2 ways of charging. It has a micro UBS in, along with a USB-C in, which doubles as a USB-C out to charge USB-C electronics, and a regular USB port for your iPhones and stuff. It does have quick charging for those phones that have that enabled, and it can be charging the power bank and a cell phone at the same time. Let's see what happens when we bump it up to 2 cell phones at the same time. We'll use my Galaxy S8. And it looks like we are charging the power bank and charging 2 separate devices at the same time. That's pretty sweet. Some power banks don't do that. Lithium ion batteries have a relatively high energy energy density, but are very safe unless punctured. There are no visible screws around the aluminum enclosure, but popping off the end caps revealed the circuit board, two screws that I can undo to remove this silver cap, and then I can slide the whole contraption out the back side of the aluminum housing. These things aren't meant to be taken apart, it's very tightly glued together and will never fall apart on it's own. As we can see, this sleek looking power bank is using a dual pouch style battery, two batteries stacked on top of each other, which is a pretty efficient use of space. And that's what Crave is after, making their power bank about the same size as an iPhone 8 Plus but with 3 times the capacity. So internally, both of these batteries are built about the same way. If you've ever seen what's inside a Tesla battery made by the What's Inside YouTube channel, when they hack open one of these cylindrical cells, you can see the anode and cathode layers wrapped around each other. The same build style is inside of these pouch batteries, if you remember from my Note 7 video when I tore open one of those batteries to see what it was made of, it had the different anode cathode layers as well. The reason Tesla uses these cylindrical batteries inside of their cars is because they're way easy to manufacture and mass produced. And Tesla utilizes the wasted space around these cylindrical batteries by putting in a cooling system, which allows them to push the batteries beyond their normal limits. For sleek, portable, high-capacity travel size power banks though, I think this pouch style is most ideal. Thanks to Crave for sending me out this power bank to review from the inside and take apart. I'll toss a link down in the video description if you want to check out the current pricing or if you want to get one for yourself. If you have any questions about power banks or batteries in general, leave them down in the comments. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Batteries",
        "power bank",
        "inside",
        "power",
        "Crave",
        "lithium",
        "bank",
        "cylindrical batteries",
        "important they basically",
        "basically run",
        "batteries inside",
        "USBC",
        "lithium ion batteries",
        "Lithium batteries",
        "cylindrical",
        "charging",
        "banks",
        "battery",
        "cylindrical batteries inside",
        "cell phones"
    ],
    "transcript_entity_values": [
        "two",
        "10,000 milliamp hour",
        "South Australia",
        "Today",
        "Crave Plus",
        "Chile",
        "Crave Plus",
        "3",
        "USB-C",
        "USB",
        "iPhones",
        "the Crave Plus",
        "one",
        "Tesla",
        "Galaxy S8",
        "Hornsdale",
        "30,000",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "LOC",
        "DATE",
        "PRODUCT",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "CARDINAL"
    ]
}