{
    "id": "LnGvoGQYqfE",
    "title": "Samsung makes a Flippy Camera? - A80 Durability Test!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-09-19T12:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=LnGvoGQYqfE",
    "category": "Howto & Style",
    "tags": [
        "Galaxy A80",
        "Samsung Galaxy A80",
        "Samsung",
        "galaxy",
        "a80",
        "samsung a80",
        "a80 camera",
        "Galaxy A80 durability test",
        "review",
        "unboxing",
        "hands on",
        "motorized camera",
        "smartphone",
        "mobile game",
        "android",
        "best smartphone",
        "mobile device",
        "technology"
    ],
    "views": 4061419,
    "likes": 99683,
    "comments_count": 6985,
    "description": "Its time to Durability Test the Samsung A80! Install Raid for Free IOS:   ANDROID:  Start with 50K silver and get a Free Epic Champion on day 7 of New Player Rewards program Thanks to RAID for sponsoring this video. This Galaxy A80 is the first phone weve seen with a motorized camera that raises up AND flips around. With multiple motions... does that make the A80 motorized camera fragile? The only way to find out is with an A80 durability test. So far, most motorized smartphone cameras that we have tested have been super strong. (Except for the Oppo Find X fail...  But weve made progress since then!)   Current A80 Pricing:  A80 Teardown:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://clik.cc/FUT0a",
        "https://clik.cc/97NeL",
        "https://youtu.be/oGGe3Z6XmCg",
        "https://amzn.to/2OqaB7G",
        "https://youtu.be/t6UtVSN3fno",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today we're going to be durability testing the Samsung Galaxy A80 a mid-range motorized smartphone that both raises and flips at the same time. Things are getting pretty crazy. This video is sponsored by RAID Shadow Legends RAID has sponsored a few of my durability tests now. This RPG game has been enjoyed by more than 10 million players in the last 6 months. Now I'm not using much of a gamer, but with over 300,000 almost perfect reviews in the Play Store, you could call this game a mega hit. It has crazy graphics, strategic game play, huge boss fights, and over 400 champions to collect and customize. You can see all the detail they put into the characters, and there's always something new to be doing in the game. I can definitely always appreciate that RAID Shadow Legends is free to play, and you can gather knights, elves and orcs to follow and intricate story line and also battle against other players live. The game is growing pretty fast and RAID has scheduled updates for the game for the next 6 months. New factions, a tag team arena, and a new clan boss that you can fight with people in your clan. I'll put a link down in the video description so you can download the game for free, and only through that link can you get a free epic champion and 50,000 silver all part of the new player program. Huge thanks once again to RAID Shadow Legends for sponsoring this video. Now it's time to see if the Galaxy A80 can withstand my durability test. Let's get started. [Intro] Samsung says that the A80 is built for the Era of Live since it has that ability to raise and flip the rear cameras over and around the front, which lets the user then use the higher quality camera for selfie situations. The last rising camera phone I tested, the Oppo Find X, snapped in half and died. So it'll be interesting to see if this rising phone with what looks like the same mechanism will die as well. I have my doubts, but this peachy colored Angel Gold A80 seems to be full of confidence. [Phone] Let's get started. [Zack] If you insist. Right off the bat the phone feels pretty heavy, and even without activating the camera, the top half of the phone can be manually slid up, but then retracts itself back into it's shell automatically. We've seen quite a few mechanical pop up cameras. Most have just a single lens that pops up like the One Plus 7 Pro. Some have a pizza slice like the Oppo Reno, or a flip around camera like the Zenfone 6. This A80 though could be the most complex version we've seen yet with both a rising feature and a spin around motion that both activate simultaneously. It rotates all 3 rear cameras around to the front in one fluid motion. Technology is pretty cool. Analyzing that little flip-a-roo mechanism from the inside is going to be super interesting. If I try to manually rotate the camera backwards while it's in the popped up position it auto triggers a retract and brings the whole thing back down. I think it's a super unique contraption, but it's only worthwhile if it's durable and can last, which is what we're going to find out today. If the camera's extended and I bump the top with my finger, it will automatically retract. And then if I hold the camera shut while trying to extend the camera, it makes noises akin to the dial up era. If you don't know what that means, you can ask your parents. [Dial up sounds] We'll bring the triple cameras up so they can watch us commence with the screen scratch test. I have a set of Mohs mineral picks that tells us what different minerals are made from by the different levels they scratch at. Level 3, as you can see, means the screen is made from plastic. In this case, we're talking about the preinstalled screen protector. We also discover at this point that the camera cannot retract itself when laying on a flat surface. I assume it's because the flipping and rising motion are all attached to a singular motor and if the camera can't do it's flippy thing, then the top can't retract. Interesting. Trying to extend the camera on a flat surface and we get the same results. No flippy means no extendy. Continuing with the scratch test. Now that the screen protector's removed, we know that since this phone is using tempered Gorilla Glass 3, we shouldn't start seeing scratches until a level 6. And that is indeed the case scratches at a level 6 with deeper grooves at a level 7. Pretty normal. Keys, coins, and razor blades won't do any damage to the surface of the screen. The display does look pretty awesome though. No notch and barely any bezels. Even the earpiece looks like it's completely gone, just like we saw with the Note 10. I'll pop up the mechanical camera with it's 8 megapixel ultra wide camera on the left, the 48 megapixel main camera in the center, and the 3D depth camera on the right side next to that single LED flash. The surface of the camera is made from glass. No scratches are made with my razor blade. The cool thing to do on a lot of phones these days is to add an under screen fingerprint scanner, and the A80 is no different. With an onscreen fingerprint scanner down near the bottom of the phone, I'll take my level 7 grooves and scratch up the surface of the glass after my fingerprint is set to simulate years worth of heavy abuse. And it looks like even with all that extra damage, the Galaxy A80 is still able to recognize that fingerprint and unlock the phone pretty much every single time. The sides of the phone are made from aluminum and have a thin protective piece of plastic surrounding each of those sides. Extra protection is always a good thing. The volume buttons are both made from metal, as well as the side of the pop up camera which is built into the frame of the phone. The top of the camera unit and the bezel of the screen are also both made from metal. Samsung is going all out with premium materials. Cruising around to the bottom side of the phone we find no headphone jack. But we do see a 25 watt fast charging cable USB C port, and a SIM card tray with no expandable memory. This mid-range phone appears to be losing extra features, just like we see on the major flagships. Flipping the phone around to the back, we can see the same trio of cameras that we tested on the front. And if we manually pull the camera upwards, we can see the rising shaft of the camera is made from plastic. It took us a while but we found some. The back panel also feels like plastic but is actually Gorilla Glass 6 and unscratchable by my razor blade. It leaves the Samsung logo unscathed. Not too shabby. I mean personally, I think phones should be tools with as many features as possible...like a Swiss army knife. Even if you don't use every feature, it's still good to have it. So I feel like this Galaxy A80 is geared towards techie people who care the most about the camera, but also like having a unique looking conversation starting smartphone. Which I totally understand when most phones these days look like they're all following the same cookie cutter design. I held the lighter in place on the 6.7 inch 1080p AMOLED display for over 30 seconds with no damage to the screen...which doesn't mean a whole lot of anything. I just started burning phones 4 years ago and can't seem to stop. Speaking of not stopping, let's keep going with this camera. Trying to pull the camera directly out of the top of the phone is pretty fruitless. It's in there pretty tight. Banging it around on my desk doesn't do a whole lot either. Even direct top down pile drives leaves the slider intact. Still in the tracts it originally arrived in. No extra grinding or glitches...yet. Some cellphone pop up cameras have a fall detection feature where if the camera detects a fall while the camera is protruded, it'll auto retract in the air on it's way down. And it looks like the A80 kind of does the same thing. It does a weird little half retract and then stops. Kind of bracing for impact. I tried going a bit higher up for the last drop and got the same result. Kind of strange. One thing I thought of when I first saw this phone was a stencil. You know, when you can push the letters of a stencil cut out? With this camera being only attached on either side, I wanted to see if I could pop it out of the frame...like a stencil. But even when pushed from both the back side and the front side, the spinney camera stays intact inside of it's little housing. It's got some movement, but it's still very sturdy. I imagine that other things on this phone will start breaking before the camera mechanism does. Even after all this abuse being forced in and held out against it's will, the camera is still moving strong with no grinding noises, complaints or other weird noises. I'm impressed. Remember though that the Oppo Find X, which has the same slide up top design that this phone does, completely died during my bend test. The frame of the Oppo Find X was too flexi for the screen to handle and the screen broke completely. So let's hope this sliding A80 is a bit stronger. With the first flex from the back we don't get a whole lot of movement, just a very minor back panel separation. Bending from the front though is a whole different story. The back panel is no where near contributing to the structural integrity. It leaves the phone frame to fend for itself. Even with that major flex the display appears to be intact still. The back panel is doing nothing to help the phone stay solid. But also, nothing is permanently breaking. At least now we know where to start for that tear down video. Overall I'm a fan of companies trying new things. So thumbs up to Samsung for coming up with a unique motorized camera design all of their own, and making it sturdy enough to survive my durability test. We'll be taking this Galaxy A80 apart to review it from the inside. So hit that subscribe button and let me know in the comments what pop up camera, if any, you like the most. We've reviewed quite a few. Come hang out with me on Instagram and Twitter and thanks a ton for watching, I'll see you around.",
    "transcript_keywords": [
        "camera",
        "RAID Shadow Legends",
        "phone",
        "Shadow Legends RAID",
        "RAID Shadow",
        "Shadow Legends",
        "cameras",
        "screen",
        "rising camera phone",
        "RAID",
        "pretty",
        "game",
        "back",
        "Oppo Find",
        "made",
        "Galaxy",
        "camera phone",
        "Legends RAID",
        "top",
        "phones"
    ],
    "transcript_entity_values": [
        "8 megapixel",
        "Samsung Galaxy",
        "A80",
        "6",
        "50,000",
        "the Play Store",
        "the Era of Live",
        "Instagram",
        "the Zenfone 6",
        "jack",
        "6",
        "years",
        "25 watt",
        "6.7 inch",
        "half",
        "more than 10 million",
        "over 300,000",
        "the last 6 months",
        "the Oppo Find X",
        "over 30 seconds",
        "USB C",
        "first",
        "4 years ago",
        "Swiss",
        "Samsung",
        "today",
        "the Oppo Reno",
        "these days",
        "over 400",
        "Today",
        "the One Plus 7 Pro",
        "Zack",
        "3",
        "One",
        "48 megapixel",
        "the next 6 months",
        "one",
        "7",
        "Twitter",
        "Galaxy A80"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "EVENT",
        "PERSON",
        "DATE",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "LAW",
        "TIME",
        "ORG",
        "ORDINAL",
        "DATE",
        "NORP",
        "ORG",
        "DATE",
        "FAC",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT"
    ]
}