{
    "id": "LoAVuDHR18I",
    "title": "MAJOR Gaming PC Transformation! - Gear Up S1:E2",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2023-04-18T21:14:40Z",
    "video_url": "https://www.youtube.com/watch?v=LoAVuDHR18I",
    "category": "Science & Technology",
    "tags": [
        "gear up",
        "gear up series",
        "micro center",
        "upgrading a pc",
        "micro center atlanta",
        "how to upgrade a pc",
        "gaming pc",
        "pc gaming",
        "pc build",
        "gaming computer",
        "pc gear",
        "Greg salazar",
        "pc transformation",
        "major pc",
        "major pc transformation",
        "gear up s1e2",
        "micro center pc",
        "Microcenter",
        "amd pc",
        "amd ryzen",
        "ryzen gaming pc",
        "all amd gaming pc",
        "budget gaming pc",
        "$1200 gaming pc",
        "how to"
    ],
    "views": 80719,
    "likes": 5699,
    "comments_count": 374,
    "description": "SPONSORS: New Customer Exclusive - $25 Off ALL Processors:    Shop VIP-SCDKey OEM Windows 10 Pro keys for $16 and use code 'SKGS' for a 25% discount:    Welcome to our Gear Up series! In this episode, we meet with Jacob at the Marietta, GA Micro Center to upgrade his old gaming PC! He's currently rockin' an AMD Ryzen 5 2600 and GTX 1060. Let's see what budget he wins and how he spends it!   Consider supporting us on Patreon!   Shop Micro Center's Apple Savings Event:  Get Exclusive Deals at Micro Center's New Store in Indianapolis:  Submit your build to Micro Center's Build Showcase:     PC parts list: ASUS B550-F ROG Strix Wi-Fi II Motherboard:   AMD Ryzen 7 5800X3D Processor:  ASUS NVIDIA GeForce RTX 3060Ti Dual Fan White Graphics Card:  Corsair RM850x 850 Watt Power Supply:  Deep Cool AK620 CPU Cooler:  Crucial P3 Plus 500GB M.2 Internal SSD:    My studio gear on Amazon: Sony A7C (Primary):  Sony a6600 (Secondary):  Sony a6400 (Webcam):  2x Pixio PX277 Prime 165Hz IPS Monitors:  Neewer LED Lighting Kit:  Audio-Technica AT2035:  Yamaha MG10XU Mixer:  Neewer Microphone Arms:  Arrowzoom Sound-Damping Foam Panels:    Follow me on social media: TWITCH:  FACEBOOK:  TWITTER:  INSTAGRAM:    Join our public Discord server:   DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our Rakuten account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.  #GearUp",
    "description_links": [
        "https://micro.center/ljr",
        "https://bit.ly/Win10SKGS",
        "https://www.patreon.com/gregsalazar",
        "https://micro.center/988",
        "https://micro.center/qlr",
        "https://micro.center/dgx",
        "https://micro.center/pv8",
        "https://micro.center/s20",
        "https://micro.center/vuk",
        "https://micro.center/k7o",
        "https://micro.center/ovb",
        "https://micro.center/s5v",
        "https://geni.us/lOeoIA9",
        "https://geni.us/k8VBToq",
        "https://geni.us/24nqw",
        "https://geni.us/bCg4nD",
        "http://geni.us/9VTXr0",
        "http://geni.us/xvQc",
        "http://geni.us/d4VvGM",
        "http://geni.us/1w5Sx2Y",
        "http://geni.us/EKFxZc",
        "http://www.twitch.tv/GregSalazar",
        "http://www.facebook.com/GregSalazarYT",
        "http://www.twitter.com/GregSalazarYT",
        "http://www.instagram.com/GregSalazarYT",
        "https://discord.gg/jYA9Xvp"
    ],
    "transcript": "We are back in Marietta, Atlanta for the second episode of our Gear Up series. This is the Marietta Micro Center and we already have our second contestant ready for a rig upgrade. You can see McLovin standing there in the background drinking his balls drink. I'm not joking. That's what it's called. See there. I wasn't joking. So anyway, without further ado, let's get to the upgrade. Stay with us. To get rid of that annoying Windows activation watermark, head on over to VIP SCD Key. Purchase a Windows 10 Pro OEM key for a fraction of the price of retail. Just use a secure payment method like PayPal, enter your product key in your PC settings window, and say bye-bye to the watermark. And be sure to use our offer code SKGS for a sweet discount. Right, so I'm here with Jacob, right? Hey guys. All right, and he's got a pretty sweet white rig here, but it's a bit old. Yeah, so it's a Ryzen 5 2600. And what's the graphics card? It's a GTX 1060. 1060 with 16 gigs of DDR4. No matter what direction we go here, any upgrade will make sense. And that was why I thought you were the perfect candidate. So let's move on then to the wheel. The big spin. So the wheel is, yeah, it can take some solid torque. So give her a nice solid spin here. Oh, yeah. So the light blues, the baby blues, those are the big, big money slices. 900 to 1200. Woo! 1200 bucks. All right, so you hit the highest number tile out there. And that means we're going to have a lot of fun with upgrades. Very excited. So that's a lot of money. A little bit of change. And was there anything that you wanted to stay true to with this rig? Yeah, I think I want to stick to the white case and keep the white theme going. Let's walk around and see what we can find. Cool. All right, well, we actually happen to be in one of the most expensive aisles here, and that's the graphics card aisle. Do you think you want to start here? You want to start maybe with a platform or? I think I'm going to start with the motherboard. The motherboard, OK. Start from there. OK, do you have a preference between Intel and AMD? I want to stick, I had AMD, so I think I want to stick to them. Let's see what kind of deals we can find. Cool. So we've got the wizard Connor here with us again, and he's going to try to find a pretty sweet platform deal, yeah? You think maybe AM4 or, well, I guess we could stick with AM4. Do you think AM5 will work in this budget, along with a sweet graphics card upgrade? You can find some deals. Yeah? OK. OK, yeah, that's the Asus one. That looks pretty good. Yeah, yeah, that's the one he has there. The Vision, that one's going to be just $10 more. Oh, the Vision's a triple fan. That's a beefier one. It's really nice, especially if you can vertically mount it. So in short, we've come up to a list that totals to $1,207. That is pretty much spot on. And now it's time to go find those parts. Oh, yeah. Look at this pretty cookie. And it's got built-in Wi-Fi, too. Look at that. Look at that. Yeah, I hear Jacob's a big Wi-Fi user. Yeah, I play all my games on Wi-Fi. Wait, I do. What the heck? Really? Yeah, I don't have any Cat 6 or Cat 5 wired into the house. You should say Cat 8. It's Cat 8. That's, see, that's what I get for building a cookie cutter house. They don't let me modify anything. Oh, yeah. So this, actually, the viewers don't know yet. This is the 5800X 3D. So this is actually going to be a really good gaming CPU. And he does a fair bit of gaming on his rig, so a nice upgrade. He's going with a 3060 Ti from Asus. And it is an all-white card. It's lower, lower, Jacob, lower. No, not that low. Lower. Jacob, right there. There you go. Next up is what, the RM850X, which is on the other side of this aisle. And is that it right there? Yeah. There it is. We're going to be going for the Deepcool, AK620, in white. This is my baby right here. It's so pretty. AM4 and AM5 supported. It's going to look good with his white case, that's for sure. And yeah, she's a chonker. Yeah, that's what we like. Yeah, and then the last thing here is the Crucial P3 Plus storage. It's actually the same drive that Jason in our first episode picked up for, what, $38, a Gen 4 drive? Not the fastest Gen 4 speeds, but again, under $40 for half a terabyte. This will make for a pretty sweet boot drive compared to his 2 and 1 1 inch SSDs he has currently. Those are SATA drives, of course. So there she is. Mm-ma. There he comes. Yeah, look at that full-on buggy worth of parts. This is going to be pretty sweet. I honestly can't wait to see what this looks like. Will, what are you doing? Will? You getting all that, Jacob? Jacob is. Jacob's, yeah. I know, yeah. Weird having two Jacobs here. Yeah, I know. Out comes the graphics card. And yeah, this is going to be a major upgrade by itself. Just for those watching, in case you were wondering, I do give the option for the owner of the rig to upgrade himself or herself. Jacob's kind of just watching right now, but he says he might get his hands a little dirty later on. So we'll see. I don't mind doing it either, though, because it's fine. Thumb of approval, baby. That's what I'm talking about. Oh, yeah. You guys know we had to get a shot of this. Boy, and of course, I let Jacob do the honors. It's his board. He can't miss this experience. Lovely. I think there's one more. Oh, oh, oh, oh, one more. Oh. Little baby one. That was nice. Here goes our Ryzen 7. Yeah, we'll put the sticker on, Jacob. 5800X 3D. This is a really nice chip. I've actually never worked with one, believe it or not. But they are supposedly really good for gaming. Going to drop this bad boy right into the socket. I'm assuming you got all that on camera, Jacob. Non-glare, too. I'm going to find out when I'm editing this stuff. So this is the lovely Deep Cool cooler. And as you can see, it's going to match this case quite nicely and the fans he already has in there. Actually, you have green accents on the fans, too. So that works really well. You know what? What we could do is move this front fan to the rear, like that. And then you still get your pull-pull effect. And you don't have any of your RAM covered up by the fan. Yeah, yeah, exactly. And time for platform install. It's nice having a big old CPU cooler to use as a handle. We have an integrated I-O shield, so that's not a concern. And it's going to sit something like that right there. This already looks really good. Just taking care of some cable management right now. Want to make it look clean for him. And the last thing to install is the graphics card at 3060 Ti. This is going to look super sweet. This is going to be the icing on the cake right here. Going to have a white CPU cooler and a white graphics card tied in with a white case. I cannot wait to see how this looks. Jacob made a really, really, really good decision with this card. Nice. Look at that. Looking good. Tighten everything down, and then we'll be ready to power this thing on again. Watch, it's just not going to work. It's not even going to turn on. Fix or fluff episode, right? Right after a gear up at perfect. Just giving her a quick once over here. Everything looks good. I think now we are ready to fire up. And you had a nickname for this, right? Burnt Marshmallow. Burnt Marshmallow. That did not come from the other Jacob. Great name. Oh my god. Burnt Marshmallow approved. Put it right there. It's still going to look really cringe, but if you insist, just put it like, make sure it's straight, Jacob. No. Oh, dude, that's crooked. No, it's not. It's close enough. Oh my god. If Frank says it's crooked, it's crooked. Oh my god. He has the mentality wise. Yeah, Jacob, you're a little high on the right side. OK, moment of truth. You ready? We are. All right, so power on at the rear, and do the honors. OK, looking good so far. It looks like all of our fans are spinning. Well, I didn't screw that up, at least. And oh, oh, oh, there it is. Cool, so you just have to reset the TPM. That's normal, because you swapped platforms. But yeah, we're looking good. Obviously, remember to install graphics drivers for the new card. And you'll be set. I've got to say, this rig, even without the color matching RAM at this point, still looks really good, because it's a white case, right? It's just so clean, yeah. It just reflects all the colors. Love it. See, actually, you can change between the colors here, and all of them actually look really good. I think the pink's going to look sick. Yeah, that's what I was thinking, too. Yeah. Yeah, look at that. So if we got matching pink RAM. Like the rainbow powder. Yeah, that would be pretty cool. Oh, this turned out really nice. I think that cooler is the icing on the cake. I really like the way that cooler looks in your rig. Oh, yeah. Sick. Right, so that's a wrap. Episode two, that was pretty straightforward, considering we upgraded almost everything. So yeah, hopefully you had a good time, and hopefully you make good use out of it. I think it's going to be an epic gaming rig. Not that it wasn't before, but now it's definitely a- It'll run some games. Yeah, it'll be much better, I think, for 1080p, and even 1440p. So awkward handshake time. Cool. It was nice to meet you, Jacob. And thanks for coming out. And yeah, if you guys like the video, thumbs up, subscribe. We'll catch you in the next one. God, I was- Oh, man. I want cases like this in my house. This is awesome. Look at all these processors. That's good. That's actually some of the stuff for that. Sorry, I didn't realize you were closing that. That's good. And then this. That's a little bit. Support that board. Do you want to be in the video? I mean, sure. Sure, all right. There you go. But yeah, I really do appreciate it. Yeah, no worries, man. Like I said, you're one of the people I actually trust a lot. Cool. Don't get totally biased. I appreciate that. I try to be.",
    "transcript_keywords": [
        "Yeah",
        "Marietta Micro Center",
        "Jacob",
        "good",
        "Marietta Micro",
        "Micro Center",
        "pretty",
        "white",
        "card",
        "nice",
        "Marietta",
        "rig",
        "graphics card",
        "Atlanta",
        "upgrade",
        "sweet",
        "Cool",
        "graphics",
        "pretty sweet",
        "back in Marietta"
    ],
    "transcript_entity_values": [
        "first",
        "AK620",
        "the Crucial P3 Plus",
        "Gen 4",
        "900 to",
        "Atlanta",
        "1,207",
        "GTX",
        "Wi-Fi",
        "PayPal",
        "SATA",
        "VIP SCD Key",
        "two",
        "40",
        "AMD",
        "CPU",
        "2",
        "second",
        "Ryzen 5 2600",
        "5800X",
        "1200 bucks",
        "the Marietta Micro Center",
        "Frank",
        "1080p",
        "Vision",
        "Mm-ma",
        "McLovin",
        "38",
        "Marietta",
        "one",
        "TPM",
        "Jason",
        "Cat 5",
        "3060 Ti",
        "RAM",
        "1200",
        "Intel",
        "1060",
        "3060",
        "Jacob",
        "Connor",
        "just $10",
        "1 1 inch",
        "Deepcool",
        "Deep Cool",
        "Asus",
        "16",
        "10",
        "Jacobs"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "ORG",
        "FAC",
        "CARDINAL",
        "GPE",
        "MONEY",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "LAW",
        "DATE",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "GPE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ]
}