{
    "id": "LQ95XJAwaoc",
    "title": "My favorite car (sucks) - Lucid Air GT",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-09-15T18:58:12Z",
    "video_url": "https://www.youtube.com/watch?v=LQ95XJAwaoc",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "lucid",
        "air",
        "gt",
        "car",
        "electric",
        "ev",
        "issues",
        "problem",
        "scandal"
    ],
    "views": 765087,
    "likes": 30280,
    "comments_count": 1593,
    "description": "Buy a Seasonic Prime TX-1600:   Alex might have found his new dream car! The Lucid Air GT has HUGE range, a futuristic look, amazing handling and speed, but it also has a TON of tech issues. Can the car overcome lacklustre software, or should you leave this $200,000 car in the lot?  Check out StratifiedAuto's DYNO test video here:   Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 The best electric car(?) 0:34 Testing the power inside the Lucid Air 4:07 Sponsor - Seasonic 4:40 Exterior and charging impressions 6:41 Interior impressions 7:58 Driving impressions 9:13 This car goes FAST! 11:13 The software has some issues... 14:20 Everything is BROKEN. 16:16 Sound system impressions 18:05 Pricing and overall thoughts 19:06 Outro",
    "description_links": [
        "https://geni.us/xuJJQ",
        "https://youtu.be/SNYqQ8GuUSQ",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- The lucid air is just hands down the best electric car that I have ever driven. Mechanically, at least. This thing was designed by the same guy that did the original model S and it freaking shows. Sure. It might have 118 kilowatt hour battery. That's massive, but it gets 800 kilometers of range. That's more than everything. The IX, the EQS, the Taycan Even the model S. And they did not do it by being slow. This one right here apparently has 819 horsepower. We're gonna be the first ones in the world to properly test. Yeah, we're at stratified automotive once again and we're gonna put this thing on a freaking Dino. Hopefully. Before we put it on the Dyno we need to make sure we can put it on the Dino. So we're lifting it up finding some good points to attach tote straps making sure it's all nice and safe. And it's really freaking heavy. Now that we have it up This is so freaking cool. The bottom, just flat Completely flat. You expect on electric cars because it's just so much better for aerodynamics And also like there's a battery pack there. Not very difficult to do. All of the suspension links are aluminum. Love to see it, and they are freaking massive. Up front we have double wishbone suspension love to see it just makes your handling better, period. We also have some interesting toe arms that look like it might be a provision to have real real steer in the future. Pretty cool. All good? - Perfect. - We've got it all strapped down and almost ready to go. It is gonna be kind of weird. Normally you do your power curve in terms of like engine RPM versus power output. But here that doesn't really work cause for one we don't know what the ratio is and two, it kind of just doesn't matter. So we're just setting it to a set speed and it'll be power versus speed. And it will probably look about the same. Let's do it. The car's getting really mad at us. Says there's a brake system fault and so on. This is very common on a dyno just because your front wheels and your rear wheels might be spinning at slightly different speeds. And the electronics get really mad. This is common, not only electric cars but any modern four wheel drive car. - Okay. Now, now we're getting somewhere. - Not bad, Not bad. That run right there Apparently had 566 horsepower nowhere near the 820 but we're gonna try it again. - That was just kind of still easing into it. - Yeah. Alex - 670 And that was pretty much floored. 693, actually. - Run number 2, 693, not bad. It seems like it is kind of tapering off as we get going faster that was when we were going like better part of a hundred miles per hour when it did that. - Yeah. We're up right up to a hundred miles per hour. And you can see that actually it's leveling off in terms of power even before a hundred miles an hour. - So I guess we just have to give her the bean sooner and hopefully we'll see it. Alex - Full Throttle. - All right, we did it. Now if we look at what we got our final result is 693 horsepower. Now you might be thinking, oh (Inaudible) blood tears. It's actually pretty fine. Now. I don't entirely understand what the difference is. It has to do with the type of Dino this is. The load calibration. So normally in like a gasoline car, you would take it up to speed, put in neutral, let it slow down. You can put that into your calculations. We can't do that here. Can't turn off regenerative breaking. So this is what we get. They guess that this right here actually translates into 790 horsepower somewhere around there which is very close to what it's rated especially given we didn't have it wide open until 40 50 miles per hour. And electric cars have their most umph down at, well zero. This is really cool. Let's do a tour around it Brandon. Actually, Let's tell you about our sponsor. Seasonic. Thank you to see Seasonic for sponsoring today's video. Seasonic's prime TX 16,000 watt power supply is a great choice for high performance systems. It features an 80 plus titanium rating which means less power gets wasted during power conversion. Seasonic's experience in designing hardware shows in their hybrid mode. A fan control option enabled by users to keep their power supply silenced. It's even backed by a 12 year warranty. If you're building a new system and are looking for a power supply check out what Seasonic has to offer at Seasonic.com or follow the link below. Also check out the nerd forge PC that has one of those in it. And it's freaking sick. All right, from the outside the lucid air grand touring looks freaking excellent in my opinion. Going around it, first of all the key looks pretty cool. And if you just hold it You get access to the frunk which is nice and massive. You can see down in here it has storage for a big boy LTT water bottle, you know, screwdriver, LTT store.com. That's just released. Love it. Moving around to the side. We do have the 21 inch arrow wheels which means our range is somewhere around like 794 kilometers, I believe. if you have the nineteens that's how you get over 800. Right here is the charging port. And this is really freaking good. The whole system is 900 volts and allows you to have 300 kilowatt charging. At 300 kilowatts, 15 minutes of charging is able to get you 350 kilometers of range. That's more than a lot of electric cars have. The charging experience and the Range Is the sort of thing that makes this just different than any other electric car that I've had. You don't want to drive 800 kilometers in a day. And as long as there's a charger at your destination you can charge it overnight. It's like actually different for road trip. That was the one thing about the Taycan that I just couldn't get over. I was like this would be the best grand touring car ever but you can't go anywhere, not far. With this it's different. You can actually just drive until you're tired. The handles here, when it's locked they go in, unlocked they pop out nice and easy. Also, as you go around you can see that there's just a literal (inaudible) load of cameras. Like there's one there, one there, one there there's probably more around here somewhere. Coming around the back, again this thing just looks so good. Like this light bar right here. Oh, fantastic. Also the trunk is massive. As you can see you can fit probably two Jakes in there pretty easily. And that's not even all of the room. You could probably, if you chop him up fit another one down there as well. - Oh - Coming around to the rear seats. I actually haven't been in here yet, so let's find out. I would 100% enjoy being driven around in this thing. In the center we also have let's see here. Yep. Couple cup holders, nice little storage area. There's also a rear screen that can, you know do your seats, heating, four way climate control. Very nice. Getting in, the first thing that you notice is that these seats are exceptional. Actually, all of the interior is exceptional. There's Alcantera there's this other cloth material that feels really good. There's real wood, leather on the seats. These seats are some of the best that I've ever sat in. Actually the best I've ever sat in. There's loads of adjustments. The ones that you want are on the side of the seat and the rest of them are all in here. This is all pretty easy to use. It's not too bad So you can see all of this including like back rest with lumbar support, cushion tilt all of that sort of stuff. As well as that, we also have seat massagers. Unfortunately, Dennis is out today. Otherwise I'd have him here. But this is the best seat massagers that I've ever felt in a car. Instead of just sort of poking you these ones sort of like (inaudible) and it just feels fantastic if you're sort of sore after a long day or were just standing for a while or something like that. First thing, this surround camera is just one of the best that I have experienced. Not only does it give you a very nice view around the entire car it gives you distance measurements to walls and cars and stuff like that. I believe Tesla's the only other one that does that and huge fan, love it. For most day to day operation you're gonna want it in smooth mode. Smooth mode in this is more aggressive than the sport mode in basically any other car. Also for regenerative braking you get a lot and heaps loads and all of it. So this is the first car that I've ever had it on standard regen braking. The other option's, high. I don't know why you'd ever want that because that's like more regen breaking than I don't know, most cars normal breaks. One thing that I do find kind of strange overall incredibly quiet in here like one of the most silent cars that I've ever been in besides maybe the EQS. But the inverter line on these motors is quite a bit. Especially rare on 60 kilometers per hour Like, let's see. It's not brutal. But I think these are the loudest electric motors that I've ever heard that weren't like pumping in fake sounds. Now for the bit you guys have been waiting for though 820 horsepower Zero to 60 of 3.2 seconds Sprint mode, sprint activation. Yep. Launch mode activated. Ooh, holy freak this thing is fast. 3.2 seconds Zero to 60 is just obscene. And like, even when you're going quite fast that is still just sorry, Brandon, but this Oh, so fast. This thing is, it's just epic. Now like the guy who owns this car and was just an absolute legend for letting us take it. I have no clue why he'd do that. Anyway, he used to have a model S plat and he says this does not accelerate like that. And I do believe him. That's what like 50%, less times zero to 60. But that said like, oh you can not complain about that. Holy freak this this or Brandon? while I wait for a corner to arrive just right quick. All of the switch gear on this steering wheel is excellent. This is super nice leather. You have your volume here. Pause in the center. Next song. We have Alexa here, which just sucks. We'll talk about that later. And then on the left you have your cruise control stuff. I refuse to call it dream drive cause that just doesn't exist yet. Again, we'll talk more about that later but we're gonna focus on the driving right now. It is exceptional! the way that they have tuned the suspension in this thing it's well you can tell that it's 5,200 pounds but at the same time it is just so nice to huck into some corners. Now it doesn't have air ride so it isn't quite as supple as like the IX, but at the same time it has adaptive dampers. And if we just (inaudible) It is so planted in the corners. You don't get a lot of communication through the steering wheel, but it's, it just feels so good I don't really care. Compared to other electric cars this is just straight up. It's the best I've ever driven. Taycan was really good too. It's on the same level as the Taycan which is pretty much the biggest compliment you can give anyone ever, oh, while we're driving here should I just complain about the nav? This thing, it's the worst nav I've ever experienced. It's genuinely impressive how much they have managed to just have the nav be terrible. Cause like when I paired title to this it said that it's running Android automotive Android automotive is sick. Amazing. Comes by default with Google map. This is not Google maps. This is terrible. I have used it three times. And two of those times it did not take me to the right spot. And also one of the times it was just straight up wrong. I kind of knew where I was going. So I was like, the exit for the highway's here. I'm going to get on the highway. Even though it's telling me to like drive another 500 meters and then get on the highway where there's no exit. Yeah. Is just actually terrible. Genuine (inaudible) Also Alexa just like straight up doesn't work. So, you know, Google assistant which is built into apple maps and Android automotive that they would've had to get rid of in order to put Alexa on here just does not work. So like, let's see okay, this button's doing nothing. Oh, oh she's back. Hello Alexa Can you play Beyonce for me on title. Alexa - Playing music from provider title is not supported. - Great. I'm warm. Okay She's gone. Alexa - Do you want to decrease the temperature by five or turn on the driver's seat bent? - Yes. Alexa- What should I do when you say that? - Turn on the driver's seat ventilation. Is she thinking? it's genuinely impressive that they made something worse than Hey Mercedes. Props to you guys. Now one thing that you might be thinking is oh, they say they have Android automotive an apple car play that would fix your stuff. Yeah. If they freaking had it. The problem is nothing exists for this car that they say it does. So all of it's coming later much like all of their dream drive stuff. So this has dream drive pro and the hardware is genuinely impressive. So it has lighter up front. all of those cameras bunch of sensors. it has Invidia hardware for the AI and processing. And it in theory works very well. This is exemplified by the adaptive cruise control which is some of the best that I have experienced in a car. It is just so good at seeing someone in front of you and able to just adjust your speed accordingly do it very safely. Very confidence Inspiringly. Love that everything else just does not exist. Doesn't work. Not at all. So let's look in the settings here. Dream drive lane departure protection. Turn it off because it's way too aggressive. I'm just going around a corner and it's like Nope, I'm just taking the corner normally. Sucks. Speed limit alert, sucks. You're going down the highway speed limits 90 kilometers per hour. Every single time that you pass a sign that says 90 kilometers per hour it'll ping you and be like new speed, 90 kilometers per hour. Yeah. I figured that out the last five times you told me you piece of (inaudible). A distracted driver warning. If you're driving into the sun and have sunglasses on it just doesn't work the whole time that you're driving It's like (beeping sound) distracted driving. No, I'm looking at it You just can't see me because I have sunglasses on. What you might be thinking is missing is I don't know the features that you get in a base civic. There's no lane center in this. So would I pay the 13 grand for their dream drive pro? Absolutely not! You will never see it, ever. Probably. We're still driving back to where I was going to complain about how everything in this is broken but you know (inaudible) I'm mad now everything just doesn't work in this at all. Genuinely horrifying that they have shipped this car. Like last night while I was unpacking Brandon's stuff after we got stratified. It just didn't work for 15 minutes. Look at this clip. Well this is just peachy. I was unloading the stuff from the stratified shoot and she's just doing nothing, nothing at all. So like I press this, not a thing. Brandon's camera equipment's in there. Yep. Not opening. I can come in here. The windows are open. Can open it like that. Completely dead. Nothing at all. This was working 35 seconds ago. You know. Nothing, foot on the break. Nope. Gas, zero. Yeah. I just had to go and sit for 15 minutes and when I came back it worked. So that's first big thing you should do Lucid is just have a very simple reset the all of this button because you, you really, really need it. Everything breaks like that screen that I showed you in the back I would call this 3.1 screen set up because the fourth one has only worked Maybe 10% of the time. The door handle on the passenger side just stayed open for like half a day One time. The surround view and the cameras just didn't work one time that I was in it. Every time that I get into it it logs me into the wrong profile, even though there is facial recognition that's never worked once for me. It is just genuinely impressive how just (inaudible) all of the software in this is, and just the fact that they are giving people this car when most of the features that they advertise just simply do not exist. Oh, the switch gear rate here is kind of nice though. I like to give you a physical volume knob and these switches aren't great but at least physical climate controls. I appreciate that. Oh, this is really cool. If you push right here and go up there's a storage compartment which conveniently has my sound level meter that I'm going to use to show you off the sound system. For the sound system, this is the first one with dolby atmost integrated. And, in order to use that you need to have a title subscription and then if it has a supported album like the one from Odessa it sounds really cool. It surrounds all around you. Very crispy highs. There's nice placement of all the different instruments. Very good. If it's not dolby atmos mastered it probably sounds very bad. Any sort of low bit rate that you put into this just makes it sound like crap. And also there's zero extension down into the base. Oh, another thing that I didn't mention every time that it goes into the wrong profile it goes to their seat settings. And then when you switch them, it takes forever. Like watch how long this takes. We're going to do the poor man's frequency sweep. So I have my frequency generator here. Let's see, there we go about 75 DB at 92 Hertz. We'll go down a bit. 82 still is fine. 72 we have maybe a two DB drop 62 we're down five decibels so we're down below the F three of this 32 nothing's happening. 42 is 60 DB which is essentially just non-existent when you're talking about it should be 75. Yeah. It really, really needs a Subwoofer. There's just no extension at all. So any like immersion that you might be getting from the Dolby Atmos is just completely ruined by the fact that there's no reproduction of the lows. Yeah, so crab rave doesn't have atmos support so it sounds pretty crushed. I would be okay with that in a $40,000 car not acceptable when it's 240 grand. Have I mentioned that yet? Did I bring up that this is 240 grand? That's Canadian dollars but like that's a lot of software problems for that much money. I'm just so confused about how to wrap this up. This is far and away my favorite electric car that I have driven the handling's exceptional the seats are super comfortable the power train just straight up, straight up amazing. The range. You actually cannot beat it. And it transforms a grand touring electric car into an actual grand tour. If they just actually had it work I would be over the moon right now. I don't even need to add in like amazing super cruise autopilot, competitor stuff. I don't care about that. I need to trust that when I walk up to it it's going to turn on. I have never been scared before like opening and closing the trunk of a car that it might just stop working and not wake up for another 15 minutes. I would take this over a model S, easily. I genuinely love this car but I'm afraid it's not going to work every time that I walk up to it. And that's just inexcusable for $240,000. So hit like. Get subscribed. Huge thanks for watching. And if you work at lucid please just fix it. The mechanical engineering and the electrical engineering that went into this does not deserve to be let down in this way.",
    "transcript_keywords": [
        "car",
        "thing",
        "electric cars",
        "cars",
        "time",
        "work",
        "electric",
        "freaking",
        "power",
        "nice",
        "hour",
        "Yeah",
        "good",
        "drive",
        "Alexa",
        "kilometers",
        "Pretty",
        "stuff",
        "seats",
        "seat"
    ],
    "transcript_entity_values": [
        "800 kilometers",
        "Beyonce",
        "Alexa",
        "12 year",
        "16,000 watt",
        "Tesla",
        "82",
        "IX",
        "dolby",
        "another 15 minutes",
        "Google",
        "Odessa",
        "Dennis",
        "S.",
        "62",
        "240,000",
        "3.2 seconds Zero to 60",
        "the Dolby Atmos",
        "15 minutes",
        "50%",
        "most day to day",
        "2",
        "five decibels",
        "today",
        "fourth",
        "Alex - Full Throttle",
        "Sprint",
        "S",
        "40 50 miles per hour",
        "Seasonic",
        "a long day",
        "Subwoofer",
        "820",
        "LTT",
        "Alexa",
        "5,200 pounds",
        "Invidia",
        "Hertz",
        "last night",
        "566",
        "first",
        "Zero",
        "two",
        "90 kilometers per hour",
        "Alcantera",
        "Seasonic.com",
        "300 kilowatts",
        "another 500 meters",
        "42",
        "LTT store.com",
        "zero",
        "Dino",
        "Mercedes",
        "EQS",
        "one",
        "the Taycan Even",
        "350 kilometers",
        "300 kilowatt",
        "60 kilometers per hour",
        "Taycan",
        "72",
        "35 seconds ago",
        "13",
        "Taycan",
        "80",
        "Jakes",
        "40,000",
        "75",
        "118 kilowatt hour",
        "a hundred miles an hour",
        "Brandon",
        "3.1",
        "a hundred miles per hour",
        "10%",
        "Android",
        "TX",
        "3.2 seconds",
        "First",
        "five",
        "790 horsepower",
        "92",
        "100%",
        "three",
        "One",
        "794 kilometers",
        "60",
        "about 75",
        "Dino",
        "240",
        "819",
        "21 inch",
        "AI",
        "F three",
        "Canadian",
        "four",
        "Seasonic",
        "693"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "GPE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "TIME",
        "ORG",
        "TIME",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "DATE",
        "LOC",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "GPE",
        "TIME",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "LAW",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "ORG",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}