{
    "id": "LQejAkcKC3w",
    "title": "Smartphone Durability Awards 2023!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-12-31T18:34:07Z",
    "video_url": "https://www.youtube.com/watch?v=LQejAkcKC3w",
    "category": "Howto & Style",
    "tags": [
        "Smartphone durability awards",
        "best phone 2023",
        "smartphone awards",
        "best phone",
        "iphone",
        "android",
        "mobile phone",
        "technology",
        "smartphone",
        "most durable smartphone"
    ],
    "views": 1095875,
    "likes": 86324,
    "comments_count": 1861,
    "description": "The Most Durable (and Repairable) Smartphones of 2023! Spoilers below!   Most repairable smartphone of 2023 FairPhone 5:  Least repairable smartphone of 2023: ROG Phone 7 Ultimate:  Most innovative Smartphone ROG 7 Ultimate:  Best looking smartphone on the inside iPhone 15 Pro:  Best all-round Folding Phone Z Flip 5:  Least durable smartphone Pixel Fold:  Most durable smartphone Pixel 7a:   2022 Smartphone Durability Awards:  2021 Smartphone Durability Awards:  2020 Smartphone Durability Awards:  2019 Smartphone Durability Awards:  2018 Smartphone Durability Awards:  2017 Smartphone Durability Awards:  2016 Smartphone Durability Awards:",
    "description_links": [
        "https://youtu.be/H1UJ5k3yMvA",
        "https://youtu.be/ftV1XDSzkN0",
        "https://youtu.be/XFPOylBJCeA?si=9heqtqKZv9WJUHfT",
        "https://youtu.be/S_W73ouKtjU",
        "https://youtu.be/ZZUMv6RAKa4",
        "https://youtu.be/T1QB_EkeX9Y",
        "https://youtu.be/zZJ0fwbb-P8",
        "https://youtu.be/8e1a_8N9rgY",
        "https://youtu.be/If0ISjRjcBo",
        "https://youtu.be/8XuexCeeaqg",
        "https://youtu.be/YqxrcEiFJtI",
        "https://youtu.be/QkuAvC3zHEc",
        "https://youtu.be/Uvh3v1BkJ-A",
        "https://youtu.be/0oChYfB96lo"
    ],
    "transcript": "Welcome to the Jerry Rigg Everything Smartphone Durability Awards and the last video of 2023. This year I've posted 95 videos, 96 including this one, and there's been a total of 13.9 million hours of Jerry Rigg Everything footage watched by humans this year alone. That's the equivalent of one person watching my videos day and night for 1,500years. I don't recommend doing that, obviously. It's just a mind -bogglingly large number to think about. The reason I bring this up is because it's your views and your watch time that's what's funding and allowing us to make our off-road accessibility machines. Thanks to your views, yes you watching this video right now, this year we were able to release the Kid Rigg. This is the coolest thing ever! An accessibility device for children. Made mostly from bike parts, it's inexpensive, easy to transport, and easy to repair. And we've even started manufacturing our first beta run of custom manual wheelchairs. And yes, we are moving to a much bigger space this coming year. I have some industrial wheelchair manufacturing machines the size of buses getting delivered to our new place in the next few months. And I'm super excited to show off how they work. Thanks to you we should be able to manufacture our wheelchairs 80% cheaper than our competitors. So 2024 is going to be very interesting. This year we're also going to take our first off-roading drive with my DIY electric Humvee. That project isn't finished yet. I've just, you know, been a little busy. Like with one of my favorite projects of my entire life, you guys sent 34,000 books for a library we built in Africa. And we were able to drill a brand new solar powered water well next door to the library, which supplies an entire village with water in Budelangi. Such a cool project. We're able to accomplish some really cool things when we all work together. If this video gets like, I don't know, five likes, we'll do it again this year. So let me know with a thumbs up if you're on board. This year I also had another kid. That was fun. I snuck that announcement into a Star Wars Lego video, if you missed it. She's a cutie for sure. And this year Casetify stole my stuff. No official update on that situation yet. And of course we spent two and a half months submerging a rather epic culvert bunker in my backyard, which is definitely a project I've wanted to do for a long time and we've done all of that while durability testing and tearing down all of the popular smartphones. And that brings us to today and the commencement of the smartphone durability awards of 2023. Let's start with the most repairable smartphone. And that has got to be the Fairphone 5. Not only can the whole thing be repaired with a screwdriver, no glue or heat gun required, but all the replacement parts for this flagship can be purchased right from the manufacturer and it has a five-year warranty. If there is one company doing repairability better than anyone else, it is Fairphone. Unfortunately, they are not available in the United States. Hopefully that gets fixed soon. A good runner up though has got to be the Pixel 8 Pro, which I do have around here somewhere. This guy. Pixel also has repair parts available through iFixit, which is incredibly awesome and makes for a clean runner up for the most repairable smartphone of 2023. Yeah, the screen repairs still need a heat gun and a bit more skill, but if there's another company doing long-term repairability right and not locking people out of devices they own, it's Google Pixel 8. What about the least repairable smartphone of 2023? Well, the iPhones this year did come with a removable back panel, which is pretty awesome, but Apple is still software locking even the non-essential parts to the motherboard, which is rather annoying. But they are technically still repairable even if it's not from a consumer standpoint. The Samsung folding phones would be my next suggestion for being pretty hard to repair, but Samsung offers one free inner screen repair during the first two years of ownership, which I think is pretty reasonable and fair. So we'll leave this one alone. The least repairable smartphone of 2023 has got to be the ROG Phone 7 Ultimate, which I didn't even bother putting back together. With three separate circuit boards, two batteries and a jungle of ribbon cables, Lego connectors, and strange standoff boards that connect everything together, it's a nightmare to take apart and an even bigger nightmare to reassemble. However, one of the things that makes this ROG Phone 7 Ultimate the least repairable smartphone also makes it the most innovative smartphone of 2023. This gaming phone has a a motorized flap that moves up to expose an internal copper heat sink thermal cooling system that is self -proclaimed to be 200% more efficient. The thing flips up like an aileron on a fighter jet and an accessory fan fits over the top to force air into those fins to cool down the phone for all the extreme mobile gaming or Tinder swiping you might be doing. Not something anyone asked for, but still extremely cool and gives the ROG Phone 7 Ultimate the most innovative smartphone of 2023. Yeah, the iPhone did bring USB-C to the table this year, but Android's kind of been doing that since the dawn of time and it doesn't really count when the innovations are delayed by a decade. And while the new iPhone 15 Pro's titanium was cool, we found that when we extracted the titanium from the phone, Apple had just applied a few dollars worth of the premium metal on a superficial exterior layer and it's not an actual solid titanium body. So it's cool, don't get me wrong, but it is a runner up and not the main event. I have been personally trying out an iPhone 15 for the past few months and I have a lot of thoughts, but they won't all fit inside this video. But that does bring me to the coolest looking phone from the inside award and that does go to the iPhone 15 Pro. Not only because they made the back glass removable, but because Apple actually has some awesomely aesthetic inerts like the physical magnets surrounding the copper wireless charging or the copper electromagnets holding the sensor shift mechanism of the main 48 megapixel camera. It looks so good, it almost makes you want to right click and sell it. Right, Casetify? True tear down skins are in the description. A new category this year with a lot of smartphone manufacturers moving to folding designs is the best all-around folding phone award and that has got to be the Z Flip 5. Not only did it survive my durability test and kept working after being bent backwards, but it was also able to be completely torn down, soft flexible screen and all, and completely reassembled while remaining fully functional after it was over. Incredibly impressive device and pretty mind blowing for a phone that has a general stigma of being fragile, which brings us to the least durable smartphone of 2023. We had a few near fails this year, like the iPhone 15 Pro Max and its cracked rear glass. Super awkward, we also had the OnePlus 11, which didn't snap in half thankfully, but it also did break just like the iPhone. The only phone that completely, catastrophically, categorically and cataclysmically collapsed this year is the Pixel Fold. Because unlike the Samsungs, the OnePlus Open or Motorola Plus, the Pixel Fold doesn't have the two halves of the phone meet together in the center when it's open. The spaced out halves of the phone just allow the phone to keep on bending backwards, and eventually, with enough pressure, the whole phone snaps in half. This is obviously a pretty extreme situation, but most accidents are accidental and it's good to know which of the devices can handle these stressful situations. I didn't test any rugged smartphones this year. Most smartphones on this table are a glass back sandwich that need a case to survive a drop. I did get a Kyocera DuraForce Pro 3 that I haven't had time to durability test yet, with just hours left in the year, I don't think it's going to happen. However, without going into the super ultra rugged phones, I think the most durable smartphone on this table has got to be the Pixel 7a with its plastic back. The plastic means there's less parts to break, but also falls into the super same repairable category as the Pixel 8 Pro, with replacement parts available directly to consumers through iFixit. So definitely the most durable non-rugged smartphone of 2023 goes to the Pixel 7a. It's been a crazy year and a crazy decade, and together we can keep all of these smartphone manufacturers on their toes. The last day of the year is also the last day you can buy a JerryRigEverything knife for $9 .99.The sale ends today and on January 1st, I will bump it back up to $14.99, which is still incredibly reasonable. Thanks a ton for supporting the channel and thanks a ton for watching. Together we can accomplish a lot of great things, and I think there's a lot of phones in 2024 that are going to be incredibly nervous to be opened at my desk. Let me know what you think of the awards. Would you have picked anything differently? And as always, thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Jerry Rigg",
        "year",
        "Smartphone",
        "Phone",
        "repairable smartphone",
        "Pixel",
        "ROG Phone",
        "Smartphone Durability Awards",
        "Rigg",
        "Pro",
        "Jerry",
        "repairable",
        "Smartphone Durability",
        "video",
        "Kid Rigg",
        "Pixel Fold",
        "iPhone",
        "parts",
        "cool",
        "back"
    ],
    "transcript_entity_values": [
        "the Kid Rigg",
        "2023",
        "Everything Smartphone Durability Awards",
        "a crazy decade",
        "Casetify",
        "iPhone",
        "Budelangi",
        "this coming year",
        "a decade",
        "15",
        "80%",
        "Lego",
        "the year",
        "9",
        "the Fairphone 5",
        "2023",
        "five-year",
        "two",
        "OnePlus 11",
        "95",
        "Pro Max",
        "three",
        "Africa",
        "2024",
        "Google Pixel 8",
        "Humvee",
        "200%",
        "January 1st",
        "a few dollars",
        "half",
        "The last day of the year",
        "Samsungs",
        "Casetify",
        "This year",
        "DIY electric",
        "96",
        "Jerry Rigg",
        "two and a half months",
        "iFixit",
        "the OnePlus Open",
        "this year",
        "Pro's",
        "Motorola Plus",
        "the United States",
        "7a",
        "five",
        "Apple",
        "USB-C",
        "the Pixel Fold",
        "a crazy year",
        "up to $14.99",
        "the past few months",
        "first",
        "just hours",
        "34,000",
        "Samsung",
        "today",
        "the Pixel Fold",
        "the first two years",
        "Android",
        "1,500years",
        "Fairphone",
        "13.9 million hours",
        "48 megapixel",
        "iPhones",
        "the next few months",
        "one"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "DATE",
        "MONEY",
        "EVENT",
        "DATE",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "LOC",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "LAW",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "MONEY",
        "DATE",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL"
    ]
}