{
    "id": "Ltq96nc-64M",
    "title": "Does Austin Evans ACTUALLY Know Phones?",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-04-17T16:29:25Z",
    "video_url": "https://www.youtube.com/watch?v=Ltq96nc-64M",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "nokia",
        "ngage",
        "motorola",
        "blackberry",
        "cell phones",
        "nokia n-gage",
        "weird phones",
        "weird tech",
        "technology",
        "tech",
        "nokia ngage",
        "consumer tech",
        "gadgets",
        "samsung",
        "pantone",
        "pantone phone",
        "qd",
        "trivia",
        "mystery tech",
        "lg",
        "cool tech",
        "weirdest phones",
        "weird",
        "moto",
        "electronics",
        "top tech",
        "review",
        "tech gadgets",
        "oppo",
        "bang and olufsen",
        "phone",
        "cool tech gadgets",
        "taco phone",
        "test drivers",
        "most unusual phones",
        "unusual tech",
        "unusual technology"
    ],
    "views": 280130,
    "likes": 11033,
    "comments_count": 282,
    "description": "Austin Evans is a FRAUD when it comes to knowing phones! This Tech Is Older than You Think:  110 year old DVD!?  Trying the $166 iPhone 11 Pro from Wish:  Trying $7 AirPods from WISH  The Truth About Xbox Series X:   Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/TBAp3YFcWBY",
        "https://youtu.be/fElUqZHWpUw",
        "https://youtu.be/P5aEi6WGxOs",
        "https://youtu.be/5ZhmuLeGVoU",
        "https://youtu.be/5V_vMjkDzGE",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to This Is. Today, Matt is going to make me look even stupider than usual. What game are we playing? - So, you fancy yourself a tech YouTuber? - I do fancy myself like that. - Well, I'm gonna to test your knowledge today on how well you actually know phones. - I know phones. - Mmm. We're going to find out. Each one of these is a two part question for you. You have to tell me A, what the phones is and B, what year it was released. I'm gonna to show you the picture. You tell me the name. You tell me the year. Each one of these is it's own separate chance for you to either pay 25 dollars for the mystery tech budget or you have a choice. You notice there's a glass of water here. - Oh no-no-no-no-no, Matt, no-no-no (laughs). - If you do not want to pay the 25 dollars, you may take a spoonful bite. - Spoonful? - Not quite a spoonful, but you know, a little bit. I'll be generous... Of the ghost pepper hot sauce from our ghost pepper build. - Is this the level 10 death sauce? - It is not. - Oh, it's level 8. - It's only level 8. - (laughs) Val, we have more videos to shoot today. If I eat all this hot sauce, I'll be done for for the rest of the week. (laughs) - Yes, if you can guess within one year, so, plus or minus one year. - So okay, say the phone came out in 2011 and I say 2010 of 2012, I'm still okay? - I'll give you that handicap. - So, we did a video last year on the main channel where Jake Roper and I ate hot wings and belts pc and I can say once we got to like level 7, it got bad, once we hit 8 and above, it was just fire. - You were a hot mess. First one... I just hit the click knife in my hand (laughs). - Okay well, I feel very confident saying that that is a Nokia N Gauge. - You got that right, that is correct. (bell sound) This is the softball I'm giving you. - My instinct is to say two thousand and... four? But I know that there were a couple of N Gauges including I believe, was it like, the N Gauge QD or something which came out later? That looks like the original Taco N Gauge. I'm gonna say 2003. - That is 100% correct. (exhales) Yes, so I actually had one of these. I did not have it activated. It was an old singular phone that just didn't have a SIM card in it. - Oh, as gaming? - Yeah, I only had Tony Hawk's Pro Skater on it. - [Austin] There are a lot of actually okay N Gauge games, not great, but okay. - Well, it's interesting because they actually want to get into the, they want to take a chunk of the Game Boy market, but a lot of the games for this were actually more SEGA or PlayStation style games like Tomb Raider, Tony Hawk, stuff like that. - Matt, I'm ready to go onto round 2. - All right, next one up, we have... - [Austin] That? (laughs) Oh, no. (laughs) I don't know it. Okay, okay, okay, okay, definitely more than a couple years old just because of the huge bezzles, the physical home button, it's running Android. I'm going to guess this is likely an Apo phone? Look, I'm gonna be 100% real. If I've seen this phone, there's zero memory of it whatsoever so, I'm just gonna take a pass on the actual phone name. I will go so far as saying that it is an Apo of some variety but I will totally concede this point. - All right, do you want to take a guess at what year it is? 'Cause you can still get that point. - Am I right? Was it an Apo? - It is not. - Oh okay, well, then I'm just 100% wrong. I am going to say two thousand and... Fifteen. - Both are incorrect. So, this is the MEZO Pro 7 from 2013 that had a secondary 1.9 inch 24x536 imola display that you could see either the time, the weather or a pedometer on that screen, but it actually did work as a selfie screen if you used the rear camera as a selfie camera. So, you have an option now. You got-- - Mystery tech budget, don't touch the hot sauce. It's time, no time, done, done. - You're gonna go $50? All right. - I can do $50. The first one was, I had it, I knew the phone. If this is number 2... - I will say I randomized them a little bit. The next one. - Okay, okay, okay, this is a Motorola? This is definitely a Motorola. I actually think I did do a video on this one. That looks to me like Android 1.6, maybe 2 but this is really early which would put it in the 2010/2011 timeframe, 2011 would probably be my guess. Is this the Moto Click? That name is ringing a bell right now. I'm gonna lock that in, is that the Motorola Click? - It is not. (grunts in frustration) - What is it? What is it? - So, you're close. The Motorola Click was actually a flip phone, not flip but it-- - Aw, it didn't rotate the same way, ugh! - It didn't rotate. This is the Motorola Flipout, but you are correct, it was from 2010. - Okay, so I will take half an L on that one. I was actually reasonable close, I kinda remember that thing. - Yeah. - It was weird. - They came in a whole lot of fun colors like Poppy red, brilliant blue, licorice black, saffron and just...white. (laughs) Not like Google's \"Just white\", it was-- - White. - White. - All right, I'm gonna claim that I got 75% of that question right. Can I spend $17.50 on the mystery tech budget for that one or no? - No, 'cause it's each one. So, you're out $75? - I'm sticking with my $75 for now. I feel like the hot sauce has my name on it right now, though (laughs). Okay, that is the Blackberry and that's BB 10. Blackberry Passport 2015, final answer. - I'll give it to ya. - Yes! - I will give it to ya. So, it is the Blackberry Passport, it was in 2014. - [Austin] I was close. - [Matt] And in the smartphone era, it was one of the last phones that actually had a physical keyboard on it. - And BOS. This was one of those last phones because after this, what was it? A year or two later, they actually fully switched back over to Android. - To Android, yes, and this was for the Enterprise crowd. This was not really meant for like, the consumer where it's ironic because neither were the old Blackberry's but everyone was using them because the BB Messenger. - [Austin] Was gonna say I actually did do a video on this one, I'm glad I got it right (laughs). I got really confused. I was like, \"Wait, this is definitely the Passport.\" Was like, \"Wait, no, maybe it's not.\" But it is. - All right, still $75. - I'm feeling good, I'm feeling good. - We can get a Robo Raptor for that. - I'll take that. Ohh, I don't even, I, no. (laughs) Okay, I mean, I'm not even gonna try to guess this thing, I've never seen it before. It is a Nokia, I feel pretty confident in that. I'll completely pass on the name because that thing is weird and bizarre but as far as year, I'm gonna throw 2004 at you, final answer. - You know what, I'm not gonna give you this one. - What?! (laughing in background) What-what-what okay, what-what-- - So, 2003 is the actual year, but because you didn't get the name of it, I'm not gonna give you the handicap. If you could just blindly guess. - Wait, what the (bleep), Matt? I gave up the name. I know it's some kind of Nokia, I have no idea what the name is but at least, I get the 2nd half of guessing for the year. I got the year. What-- - Fine, all right. - What is this? - Fine. - We're in the middle of the game, I start doing okay and guessing some things you're like, \"Nevermind.\" Matt Rule Masher here-- - It's no fun when you get it right (laughs). All right so, this is the Nokia 7600. - [Austin] I would never had gotten that. - [Matt] From 2003 and there was a very weird trend in phones, I almost said smartphones just by instinct. - That's not very smart. - Yeah, these were not smartphones, but 2003, there is a large handful of phones specifically targeted for the fashion crowd. They could be like bracelets or there's an earring one, that was really weird. - Hit me with the hot sauce. - You want the hot sauce? - Wait, but small amounts, small amounts, whoa whoa whoa, stop-stop-stop-stop, time out, time out, how much is left in that again? What would you consider that to be? 2 spoonfuls? - I'd say... - 3 spoonfuls? I need to plan my ghost pepper route. - You know what, I'm not gonna tell you. - All right, that's good, ah, what?! - That is half a spoonful. - Try swallow-- - You want me to... - No, I don't. - The plane comes in (imitates plane flying). (laughs) - I think if I put the bottom of the spoon on my tongue and just sort of tip it back, it'll avoid hitting most of it. - We use all the budget up for the hot sauce, we can afford a 2nd glass of water. - Matt, can you please give me the next item? (laughs) Ugh. - Ken, what are you doing this weekend? - Oh, my God, my throat. I thought that swallowing it would help. I think it helped but somehow has made it back to the top of my tongue and I want to throw up. Okay, that's a Samsung phone. - [Matt] Or did I put a Samsung skin on the screen to mess with you? - [Austin] No you didn't, you're not that clever. - Oh. (laughing in background) - It looks... so, I remember there's a time in the mid 2010s where Korean companies started getting weird. There was the LG ah (bleep) the LG G Flex... that was curved and that you could cut with a knife 'cause I remember Marquez had that great thumbnail, it was a viral video back in the day. I do remember looking at it, the port, it was back when Samsung were doing the weird USB 3.0 like, the micro B port. I'm gonna say twenty... fourteen, fourteen, fourteen, 2014. I know that I should know the name of this, I know it's a Samsung. I, stop, stop! No more of that, no more of that. It's the, there's no harm in trying, Samsung Galaxy... Curve, 2014 Galaxy Curve. - This came out in 2013. - No! Wait, no, I got it right. - You said 14. - Yes, okay. - One month before the Flex... - Okay. - But is the Samsung Round. - [Austin] Round! Aw, I actually was not that far off. - I did not think you would like, I was thinking maybe you'd get this confused and say like, this was a Samsung Flex or whatever. So, we're at $100. - Okay. - [Matt] What about this phone here? - Did you just Photoshop that (mumbles), what is going on? What's that thing on the bottom? Matt, the only thing I can say about this is it looks kinda Japanese. I literally have no idea. - Then, why does it look Japanese? - I don't know, just getting a Japanese vibe. - [Matt] Are you saying that only people in Japan like pink? - No, Japan just makes weird phones. I'm gonna say it's a Sharp of some variety and I have no clue on the date so, I'm just gonna say 2011. - [Matt] So, this is the Pantone 5 from 2012. - Wait, Pantone as in like, the color company made a phone? - Yep. - What? - So, while the design of this looks exactly like any other phone in 2012, this one has the distinction of being the first cell phone with a built-in radiation detector and this was released and marketed strictly to Japanese after the Fukushima nuclear plant meltdown. - Are you trying to tell me that a color company made a smartphone with a radiation detector for Japan? - I mean, you're the one who's like, \"Japan makes weird phones.\" - Hey, I recognized it was Japanese, at least. - Well so now, that's right. I remember I told you, it was gonna be $50 from now on. So now, you're at $175. - Ugh, okay, $175, I'll take it. - Next one up, we have... - Oh, I'm gonna say Microsoft Ken One, 'cause I think the 2 was the one with the wider screen. The year... aw, man, this is pre-Windows Phone 7. So, I'm going to say 20...11, final answer. - You are 100% correct. - Woo! - Yes. - They were on sale for like 15 minutes before they got put on Fire sale, too, right? - They were like $25 unlocked. - Yeah, so, it was a Verizon exclusive, if I remember correctly. This was actually that I was really excited about back in the day. I actually made a couple videos talking about the Ken so, I remember this one. In fact, for awhile, a video I did on the Ken was actually the most viewed on the Austin Nevitz channel. - Ready for this one? - Oh, the Kero Sera Echo. Fun fact on this one, I also did a video on this on a secret 2nd channel before This Is and this was the most popular video on that channel, too! - [Matt] Is that a dunkenator? - No it was not. It was http://www.youtube.com/d3. This was the first actually dual-screen smartphone, I believe. It actually was way ahead of it's time even though it ran Android like, I wanna say it was either Froyo or was it Eclair? It was a really early version of Android. Definitely Kero Sera Echo. I'm split between 2010 and 2011. I'm gonna say 2011 for safety. - 100% correct. You gotta buy ya know, Ken a steak dinner because (mumbles) \"Oh, these are so easy.\" Those are the ones that I swapped out because he yelled at me. - I'm happy, thanks, Ken. - If you get this one 100% right, I will do a spoonful of hot sauce. I only brought one spoon, though so (laughs), I'll just do a shot of hot sauce. - No bacteria from a mouth could possibly survive on that. (both laugh) - But you have to get this 100% and not use the handicap for me to do this. All right, - I should really know this one 'cause I just used this phone like, last year. This was actually again-- - What?! - This is Marquez's retro-tech episode. This is one of the ones that got cut from the episode. Okay-okay-okay, let me think about this. I think it was a Bang & Olufsen phone. I don't remember anything more than that. Aw, man. You should feel really confident right now, I'm not gonna get this. I'm just gonna guess the Bang & Olufsen...Wow, that's not it, I'm just gonna guess that and I'm gonna say the year was 2003. - Is that your final answer? - My final answer. - You are 100% wrong. All right, so, this is, in fact, the Bang & Olufsen Serene which came out in 2005. It was a joint venture with Samsung and it was this clamshell design was what all the high-end phone market was all about. So, this thing cost a whopping $1275. - That sounds dumb. - It does sound dumb and it looks dumb, too, but you know what's not dumb? Watching you do... - Please like the video. - It's my last one because I'm clearly gonna get fired after this. - Like this video, subscribe to the This Is channel and if enough of you do it, I will come back from the dead and finish what Matt has started here. Hit that Like button, subscribe to the channel, we'll see you next time.",
    "transcript_keywords": [
        "phone",
        "hot sauce",
        "year",
        "phones",
        "Samsung",
        "hot",
        "sauce",
        "Matt",
        "video",
        "Android",
        "guess",
        "Ken",
        "time",
        "weird",
        "remember",
        "Motorola",
        "Wait",
        "Japanese",
        "back",
        "Gauge"
    ],
    "transcript_entity_values": [
        "zero",
        "the actual year",
        "2013",
        "Froyo",
        "Android",
        "Korean",
        "twenty... fourteen",
        "two thousand",
        "like 15 minutes",
        "BB 10",
        "the day",
        "one year",
        "Poppy",
        "2",
        "25",
        "N Gauges",
        "5",
        "fourteen",
        "20",
        "more than a couple years old",
        "Tony Hawk's",
        "175",
        "75%",
        "the 2nd",
        "Taco N Gauge",
        "Samsung Flex",
        "2nd",
        "the 25 dollars",
        "1.9 inch",
        "Microsoft",
        "75",
        "2010/2011",
        "2015",
        "Val",
        "Definitely Kero Sera Echo",
        "Jake Roper",
        "Tomb Raider",
        "2010",
        "24x536",
        "Austin Nevitz",
        "Marquez",
        "1275",
        "USB",
        "YouTuber",
        "between 2010 and 2011",
        "Google",
        "LG G Flex",
        "the mid 2010s",
        "Matt",
        "Austin",
        "Samsung",
        "100",
        "imola",
        "2014",
        "the Motorola Flipout",
        "the Blackberry Passport",
        "25 dollars",
        "2010 of 2012",
        "Japanese",
        "2011",
        "first",
        "2004",
        "the N Gauge QD",
        "10",
        "2012",
        "last year",
        "Today",
        "Verizon",
        "LG",
        "this 100%",
        "8",
        "Samsung Galaxy",
        "50",
        "N Gauge",
        "100%",
        "the Samsung Round",
        "Nokia N Gauge",
        "fourteen, 2014",
        "2003",
        "Matt Rule Masher here-- -",
        "just 100%",
        "Fifteen",
        "Fukushima",
        "Bang & Olufsen",
        "Ken One",
        "1.6",
        "Tony Hawk",
        "PlayStation",
        "the year",
        "Blackberry",
        "SEGA",
        "17.50",
        "First",
        "as far as year",
        "one",
        "Pantone",
        "four",
        "14",
        "today",
        "Nokia",
        "2005",
        "one 100%",
        "year",
        "half",
        "two",
        "Motorola",
        "Japan",
        "the Kero Sera Echo",
        "Ken",
        "the week",
        "the Bang & Olufsen",
        "this weekend"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "DATE",
        "DATE",
        "NORP",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "MONEY",
        "PERCENT",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "MONEY",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "DATE",
        "NORP",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "LAW",
        "PERSON",
        "DATE",
        "ORG",
        "DATE"
    ]
}