{
    "id": "LVkqK4bl1Gw",
    "title": "If you can fix this PC, it’s yours! - Origin Chronos V3",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-04-10T17:00:53Z",
    "video_url": "https://www.youtube.com/watch?v=LVkqK4bl1Gw",
    "category": "Science & Technology",
    "tags": [
        "pc",
        "linus",
        "tech",
        "tips",
        "gpu",
        "amd",
        "nvidia",
        "originpc",
        "gaming",
        "origin pc",
        "pc repair",
        "contest",
        "Chronos V3"
    ],
    "views": 1336218,
    "likes": 64048,
    "comments_count": 3489,
    "description": "Thanks to OriginPC for sponsoring today's video! Win your very own ChronosV3 Desktop PC challenge-free at   Origin PC sent us a white Chronos V3 gaming pc complete with an Intel i9-13900K process and an RTX 4080 GPU, but they told us we werent allowed to keep it. Of course, we dont plan to give it back to them either, so we broke it good and invited our subscriber Calvin down to try to fix it. We told him hed get to keep this beautiful, compact gaming rig IF he could get it in working order in under 2 hours. Will he succeed, or will we have to find someone else to take this compact ivory obelisk off our hands?  Intel Core i9-13900K Processor:  NVIDIA GeForce RTX 4080 16GB GPU:  Corsair Vengeance DDR5 32GB (2x16GB) 5600MHz C36 RAM:  ASUS ROG STRIX X670E-I Motherboard:  Corsair iCue H150i RGB Elite Liquid CPU Cooler:  Corsair SF Series PSU:   Purchases made through some store links may provide some compensation to Linus Media Group.  Discuss on the forum:    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 FYI, the PC wasn't like this when we received it 0:10 If you can fix it, you can have it! 1:07 START! 2:23 Rules to win 5:09 30 min. mark 9:34 1 hour mark 11:19 Compromise? Compromise. 12:51 1.5 hour mark 17:18 I'm not surprised lol 18:56 Final minute",
    "description_links": [
        "https://www.originpc.com/landing/2023/linus-chronos-giveaway/",
        "https://geni.us/Pr7AyZz",
        "https://geni.us/Lp07wc",
        "https://geni.us/Ya6hr2",
        "https://geni.us/yw1AIMb",
        "https://geni.us/KBk4Up",
        "https://geni.us/BiE72",
        "https://linustechtips.com/topic/1499885-if-you-can-fix-this-pc-it%E2%80%99s-yours/",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- [Announcer] Warning, the following video contains footage of a PC that has been intentionally damaged for educational and entertainment purposes. The PC was fully functional when it was sent to us by Origin, but we broke it. Makers of this video urge viewers to exercise caution and respect when handling electronics. - Origin PC told me to give away this Chronos V3 small form factor gaming PC. And that is their right, they did sponsor the video. But I've been spending a lot of time on r/MaliciousCompliance lately, and while they did stipulate that I have to give it away, they didn't say it had to be in working condition. So here's the deal, Kelvin, if that is your real name. From the time you touch this computer you have two hours to fix it, meeting all of these criteria. If you succeed, you take it home with you, ready to game. If you fail, I give it to someone else. You may, right now, visually inspect the PC. Visually. But don't touch! Not that I think you'll be able to glean any useful information anyway. Our team of skilled customer disservice experts burned the midnight oil making sure that this was going to be extremely challenging. - Do I say something? - You can. You don't have to. - Okay. - You can just touch the computer and try and fix it. - Okay, so I'm- - Well, whoa. He touched it. Set the thing. Set the thing. (upbeat music) Ah, ah! Here we go. Oh, oh, and this is great, because while he's trying to think right now, is a perfect time for me to go through a few more really important details that I'm springing on 'em at the last second here. Oh, and springing on Origin, they had no idea. You see, I put together a few little bonus prize packs of my own, but to get them, he has to complete the challenge in a lot less than two hours. Every 30 minutes, I'm going to open up one of these envelopes and I'll read out what's inside them, but once I say it, you no longer get it. (gasps) Isn't that fun? And the best part, Calvin, is that absolutely nobody is cheering for you because if you fail, there's a separate giveaway for another Chronos V3 for all the fine folks watching from home. But it's just one. Unless you fail, then it's two. Aint' that great? No hard feelings though, man. The contract says I have to give it away. It doesn't say that I have to give it away to you. - Ouch. (Linus laughs) Wow. It really doesn't say anything, it doesn't even say that I'm not allowed to distract you. This is great. Do you have any experience fixing computers, Calvin? 'Cause it really doesn't look like it. - I've built my own before. - Wow, this is tough. He has to post, boot into Windows, have all the parts detected in Hardware Info. There's a lot of stuff in there. Core i9-13900K, RTX 4080, founders edition. 32 gigs of DDR5 RAM, more than one drive. Okay, I'm gonna have to figure out exactly what drives are in there. And score at least 37,000 in Cinebench R23. and 2,250 in Classroom. Yeah, you gotta run benchmarks too? - Yeah. - That half an hour one is gonna be basically impossible. You're removing a SATA drive. - Yes. - What exactly is it that you're hoping to achieve right now? Well, it was disconnected and I could not fit my fingers in to reconnect it. - Hopefully there's not too much other stuff that's disconnected or he's gonna be doing a full tear down and rebuild of this thing. Too bad he can't use Origin's 24/7 lifetime support. Did you watch our previous troubleshooting challenge videos as prep? Oh, that would've been really smart. You didn't, did you? (Calvin laughs) Goodness gracious. Almost eight minutes gone already. Where does time go when you're having fun? Should I give him any hints if I figure something out? - [David] If you can do it in a really rude and sarcastic way, yes. (both laugh) - See, he is one of the people who likes my evil persona. Okay, I'm gonna poke my head in here, David. One thing I can see is something that's very clearly hanging out there. Mm, what's this? Oh, oh, he's looking. Let's look at this, what's this? What's going on here? Ooh. That doesn't seem very good. At about 15 minutes in, there's definitely things that I'd be doing differently. I don't think he's being nearly aggressive enough in his disassembly. He knows we've messed with this thing and he's trying to look for surface-level problems. Like, is the back of the power supply switch off? You know, stuff like that. The first thing I'd be doing is tearing stuff out of here to validate that it's actually connected at all. Oh, he started. Oh, come- - RAM. Ooh, he dropped the RAM. Ah, that's hard to watch! Now I get how you guys feel. In just 11 minutes and 23 seconds I get to reveal the first thing that you're missing out on. It's funny how you changed the dynamic, right? He started this shoot ready to win something in two hours but now all he can think about is what he's gonna lose in 30 minutes. Man, you could be gaming at like 4K, 120 frames per second, in just an hour and 40 minutes. Or you could be driving home in disappointment in just an hour and 40 minutes. (Calvin laughs) You cannot get that motherboard out, eh? - Nope, some things still plugged in. - That's the thing about small form factor builds is when they're done right, they're packed tight. Hey, I came up with that on the spot. Not bad, sleep-deprived brain. - This must hurt to watch, eh? - No, I'm having a blast. (Calvin laughs) I'm feeling particularly malicious today. Had a very bad night. - [David] Still an hour and a half. - There's, yes. - [David] And it's four seconds. - And four seconds, (gasps) which means it's time to open the first envelope. If you had completed the challenge in just 30 minutes, you would have received, in addition to your Origin Chronos V3 Gaming PC- - Damn, a Xeneon Flex, Virtuoso RGB Wireless XT headset, K100 keyboard, and a Dark Core RGB Pro. - Really? A Xeneon Flex? Isn't that like a $2,000 monitor? - [David] Oh, yeah. - Would've been nice. - Yeah, it would've been. - It would've been nice. - Well, hopefully there's something good in the next one. Truthfully, watching him read that did kinda hurt. I'm feeling a little bit more benevolent now. So with that in mind, I will say that half an hour in, I probably would've put a little bit more work into isolation. So taking my individual components and evaluating them one by one. Okay, I got my GPU. Is it plugged in on one end? Is it plugged in on the other end? Okay. Spit-roasted GPU. Good to go. Take my motherboard. You know, where are all the different points it needs to be plugged in? I wanna go one thing at a time. - This cable will be the death of me. (sighs) - You gotta have confidence. You know what? I've come around. I'm rooting for Calvin now. Okay, you gotta have confidence. You gotta just, you gotta pull it out. - [All] Oh. - Ah. - Is that a piece of motherboard? - Just from the edge right here. - So, yes is the word you were looking for. - Yeah. - Can I have a look at that, please? - Sure. - It's cosmetic. - Thank God. (David laughs) - Oh, God's not gonna help you with this. Keep it far, far away. There's a couple more things that Origin PC wanted me to mention about the system. It fits up to 620 mm case fans, which means it's easy to attach a 360 mm AIO cooler, which is really impressive, given the size of this thing. The one that we've got is the iCUE H150i Elite, and it supports up to a 1,000-watt SFX power supply which, is that what they happened to put in here? Yes, this is a 1,000-watt power supply. One issue I'm noticing with Calvin's approach is that he's thinking very inside the box, in a literal sense. He's trying to do everything inside the box. By this point, I would have everything spread out, hanging out the side, whatever it takes to just get my individual components attached in the bare minimum way, and isolated. Doesn't need a GPU to post the system, he doesn't need a cooler. He started with absolutely no response whatsoever. He doesn't even need a power button. He just needs some way to jump those pins and see, \"Has anything I've done improved anything?\" There is something that's troubling me. We don't like viewer interactions to end negatively. That was one of the reasons that I cheated in PC or no PC, awarding the top prize to both participants, regardless of what they actually earned. But there was so much audience backlash when I did that, because people felt that it removed all the stakes, that I will never do it again. If we said you fail, you lose. That's how it has to be. Okay, come on, Calvin. What does this do? - It's it a carrier board? - Where does it go? So where does it need to go? Liberate it. Where, pray tell, Calvin, would you normally find the front IO things plugged in on a motherboard? - Are on the sides of it? - MM-hmm, so do you see anything on the sides that looks sort of unusual? - Mm. - Asus has done something very interesting with this board. There are two male, long nail type-C connectors along the bottom right edge of the board, and they appear to be designed to plug into this daughterboard, which has two female receptacles. Now, if I was the average user, I might look at a USB type C and go, \"Well, that's for USB,\" but if I were me having seen all the weird shis that motherboard manufacturers do over the years, I would look at it and go, \"They have reused an industry standard connector and they've done all their own pinout for it. So they're using these USB-Cs for my, looks like front panel USB 2, SATA, front panel connector. - Oh. - Oh, would you look at that? - It's got power. - [Linus] A little indicator light. - [Calvin] Okay, we're getting somewhere. - Did you find the front panel connector? - Front IO connector? Yeah. - Oh, Jesus, really? You just put this generic front IO connector crap in here? Okay, well, what you need to do is you need to find where the front IO connector is. But before you can do that, I really do need you to open this envelope- - Yeah. - Because I said I would make you do it. - So I could have had- - Yeah. - A Xeneon 32-inch. - Yeah. - HS80 headset. K70 keyboard, and Iron Claw RGB Wireless. - Still great stuff, but a significant downgrade over last time, we're definitely trending in a, like this direction. I'm gonna help you with that, that is an extremely misleading manual. - Okay. - There is no power button there. - Oh. - There's a label here that says Power Button though. What the devil are they talking about? - This is that, those few switches back. I mean, these few prongs back here, I think. Oh. - Interesting. - That was weird. - Okay, well, that's a good sign. - Yeah. - I would turn this off really quickly though. - Yeah, yeah. 47 minutes. Oh no. (laughs) It's getting intense. - Oh, it's been intense for me for a while, you just didn't know it yet. One of the most difficult things about troubleshooting under pressure, whether it's a client breathing down your neck or a deadline, is thoroughness. You always miss things when you're under pressure, and one of the things that I would be making sure that I'm doing at this stage is taking a second, regrouping. Slow is fast. \"Have I missed anything I need to isolate?\" Say for example, an SSD. (intense upbeat music) Well, we know from the requirements that there are drives. We saw one two-and-a-half inch drive, which means there are some others somewhere. Okay, a more direct hint. If something's not working, there's no time, you just need to press forward. Every time something costs five minutes at this point, it is costing one ninth of the remaining amount of time. You gotta think about it that way. Real talk David, at 30 minutes, do I jump in and help? - [David] I think you should. - Is that violating the spirit of the challenge? Because they never said I couldn't help. I mean, they never said I had to do this to him at all. But will people be upset if, together, we achieve it? I don't want people to feel like I, you know, everything's rigged here, 'cause I really don't know the answers. Maybe I can help, but I can't touch it? I can tell- - Yeah, that's a good idea. - I can tell him what to do. Do you think that's compromise? - Compromise. - You guys good? We good? Okay, 12 more minutes. I will start helping in earnest. - Okay, it just has to run. Doesn't need to be in the case to run. - Well, we did say the case panels had to be closed. - [Tanner] We never said that. - I did. - You did? - I did. - Why did you say that? - Well, I said that because I thought that that would be reasonable. - [David] He was mistaken, we take it back. - No, it's established, it's canon. - Okay. - It's like the bad sequel Star Wars movies. We're stuck with them. We're eight and a half minutes from the third and final envelope. And I hate to tell you this, another surprise twist. - Okay, not looking forward to it. (laughs) - Tech tip. Two of the four screws on that motherboard are easier to access than the others. Tech tip, the panels have to be closed, we didn't say anything about components left outside of the panels. Put in only two screws. Go, go, go. - Okay. - Whatever one's are easiest. Isolation, what do we need to do now? - Storages. SSD. - We need to boot it up for longer than five seconds. - Right. - Keep your eye on the prize. All right. - Yes. - I'm sorry. - That's fine. It's fine. Last one. - Yeah. - A Sceptre 20 inch, 1600 X 900. Fake AirPods, I'm not gonna miss those. Amazon Basics keyboard. Amazon Basics mouse. - Okay, well, hey, at least you already had lost most of what you were gonna lose before. But the second twist is I'm gonna be helping you in earnest with the one rule being that I can't touch it. - Okay. I'll take anything. - [Tanner] Let's go! - Find that damn power switch thing and put it on the damn thing. Let's go. - There's no power button. You see this thing? - Power button's right here. And the orientation is this way. So the bottom two. - Finally. - Okay. - That's on. - It's powered on. - Okay, let's see if we get an output. Still have 26 and a half minutes. We're gonna get 'em there. Well, we're gonna try. I'm really sorry but if you don't complete it I actually can't give you the computer. - I know. - Okay. - I understand. - I would power cycle it once though. - Oh, oh. - Wait, okay. - Yeah! - Okay, that's something. - Step one, okay. - Okay. This tells us our M.2 drive is working, that's good. So that means that the drives that wasn't working was probably the SATA one. - Mm-hmm. - Okay, it looks like it's already at defaults, that's fine. So, okay. Yep. So we're gonna reset here. All right. Now let's think, what do we still need to do? We're not gonna do anything we don't need, we have 24 minutes - Hard drives? - So that hard drive must go in, it must get power. We must get this stupid SATA thing plugged in. - Okay. - Okay. However, we don't need to move that power switch. You can deal with that at home- - Mm-hmm. - Get it plugged into the proper thing later, at your leisure, right? So just get this in, get the SATA on here, get that in, and let's see if we can get that drive detected. (suspenseful music) (monitor beeping) We've got two SSDs now. Excellent. Let's get the GPU in. - [Calvin] Mm-hmm. - Okay, that should be the right spot. So you gotta support it at the back and push it in. Push, push, push, there you go. Yeah, it's in. - Great. - Okay. - Hey, these Blender benchmarks. Is this GPU or CPU? - [Tanner] GPU. - GPU, okay. - [Tanner] And the Cinebench score is a single pass. - Single pass. Okay. Okay. Now's a good time to sanity check if our pump is working, we can do that with our ears. The answer is yes. - Yay. - I didn't have to touch it. Okay, so hardware info. What do we need to show up? All parts detected, including GPU, which we obviously have. The RAM. Okay, os all of our RAM, 32 gigs RAM, is that right? That's right, yep. Drives. Well, we know both of our drives are here. Make sure they're in Windows Explorer. They're not. Okay, now hold on. We gotta check the rules exactly. \"Have all parts detected in Hardware Info including the GPU, the RAM, and the drives.\" We have to run the benchmarks. We don't need to get this drive detected in Windows Explorer, you can do that later. - Okay, but we need- - But we need Cinebench R23 and we need Blender with the Monster, Junkshop, and the Classroom benchmarks. Okay, we gotta strategize. Do we think it will be faster to solve assigning a. You know what? It's probably faster to assign it. - Where's the software stored onto, is it on the M.2 or is it on- - It's probably on that two-and-a-half-inch drive. That's probably why we have to fix it. - Yeah, yeah. - Okay. What the crap? - It's not picking it up. Hey. - Okay, this. Forget it, we're not solving it then. - Okay, okay. - Yeah, we're not solving that. Okay, so let's download Cinebench R23. - It might be already here. Is it? I don't, oh, there's a folder. - [Tanner] It's on the desktop. - Yes. - EXE, yes! Okay, we need 37,000. We didn't turn on XMP. We might need XMP in order to get that score. We should also really have Hardware Info open to make sure that our CPU is not overheating. It doesn't help that our fans are pointed down at the table, we'll deal with that later. Okay. CPU core, CPU package looks fine. What's our score? 37,988. Let's move on. - Okay. - Let's see if we get these scores. GPU fan is definitely spinning up. All right. We need to put the side panels on. Leaning tower side panel. The eyes, consider that on. - Okay, great, me too. - Just put it on. Just on the, just. Yeah, on the top. - On top? - Yeah. Just- - There you go. - Okay, on here. Put this on. So if the benchmarks don't pass, we can go back into the BIOS, enable XMP, but we already passed the CPU benchmark so we're in pretty good shape. The one thing I'm worried about is, right now, that second drive, it specifically says it has to be detected in hardware info, it doesn't say it needs to be detected in the BIOS. I didn't see it in hardware info. So let's get this benchmark done, then we know we're clear. We have 10 minutes to figure out why that drive is showing up in the BIOS but not in hardware info. - Yeah, yeah. - In the meantime, I'm gonna figure out if there's a way for us to cheat. Okay. Yes, yes. Monster? No, in the Monster Benchmark. Absolutely Monster numbers. (bell rings) We passed everything we need, the last thing we need to do is we need that drive to show up in Hardware Info. - Okay. - So everything's validated, let's reboot this computer. - So I turn it off? - Yep. - [David] What are you holding there, Linus? - Don't worry about it. (energetic music) Good. Okay, we're in. Wait, maybe I was mistaken. That drive is not. Okay, no, this is good though, because it means whatever is wrong is universally wrong. I was really worried when it was in here and not there. So I think what's going on is that cable is whack. - This one here? - It's like bent. - No, not that one, the one on the motherboard. This. - [Calvin] Okay. - That is like- - Ah, it is bent. It is bent. You're right. - Yeah, so you get that? It's very loose here. - Yeah, let's make sure that's in there. It is possible that we have actually ruined the SATA connector on that little daughterboard. There's a second one. We can try that next, power it up. And then worst case scenario, I have a little trick up my sleeve. This is why they have to be really careful when they build rule sets. - Yeah. - I'm participating. (Calvin laughs) - No. - Still not there. Okay, shut it down. Let's try the other port. We've still got five minutes. What's easier at this point? Plugging the SATA connector into the daughterboard and putting that in? - Ah, yeah. - Okay. - Or just taking the entire thing out. - What entire thing? - This daughterboard? - Oh, yeah, yeah, yeah. Take the daughterboard out, plug it in, put that back in. That might actually be easier at this stage in the game. Two minutes. It's time for the trick up the sleeve. This is a USB-to-SATA adapter. Nothing says we can't use it. So, oh, sorry. I'm not allowed to touch, get that drive disconnected. - Okay. - Just rip it out. Okay. Plug this in. - 25 seconds. Okay, let's put these on. - Put them here, faster. - Okay. - They're on something. - Don't worry about it. (monitor beeping) Storage D. There's a problem with this drive, but we don't care about that. Hold on. Hardware Info, Hardware Info, quick. - Shit. - No, no, you're good. (monitor beeping) (suspenseful music) No, no, come here. (suspenseful music) - [David] It's detected, it's detected! - Yeah, it's detected. Okay. - You did it. - Zero seconds! (bell rings) Oh. Oh my God. (David chuckles) Oh my God. (suspenseful music) - [David] It's detected, it's detected. - [Tanner] Yeah, it's detected. - Thank you. (all laugh) That's crazy. That's crazy. - [David] So this is what a fixed computer looks like, eh? (all laugh) - Well. The letter of the law, not the spirit. (all laugh) - Could it have come more down to the wire? - I know. Oh my god. - Anyway, don't thank me. Thank- Thank you- - Origin PC. Makers of the Chronos V3. A computer that looks a lot better when they ship it to you than when I fix it. (laughs) For real though. The one that you could win at the link in the video description would look more like when this started and not like when it finished, but fully functional, without us having messed with it. Tanner, what the hell is wrong with that drive? - Okay, so what was wrong with that drive when I touched it was the SATA cable was unplugged. - [Calvin] Ha. - In fact, that was a lot of the problems with it. The front panel connector was also unplugged. What was the other thing that was wrong with it? - Wait, there were only three things wrong with it? - Well, there were also two software things. - Okay. - Because I had the CPU underclocked, and I had the GPU underclocked. But I, on that one, forgot to set MSI Afterburner to launch on boot. - Yes! - So... (David laughs) That one's on me. Okay, originally I just wanted the power button to be unplugged, but as soon as I tried to unplug that, the whole daughterboard came out. - Yeah. - So when the whole daughterboard came out, I thought, \"Man, that sure does look like it's still plugged in, let's just leave it. That's gonna be a thing.\" - The clock behind me, it did not help at all, just seeing it like, tick down. - Were these helpful? - No, no. This wasn't- - This was an innovation I came up with at the last minute. - The first one hurt the most. Oh. - Oh, yeah. That Xeneon Flex- - Yeah. - Muah, great monitor. - Great monitor. - But the good news is that, even if you don't have the Xeneon Flex, this is a sick computer and now you get to take it home and build it. (all laughs) - I will actually tear it apart and then put it back together now. - That would be best. - Yeah, yeah. - Yeah. If you guys enjoyed this video, maybe you like the energy, go check out one of our ROG Rig Reboot videos. We'll pick a nice one for you and we'll put it in the video description.",
    "transcript_keywords": [
        "Yeah",
        "Hardware Info",
        "thing",
        "minutes",
        "drive",
        "GPU",
        "power",
        "good",
        "put",
        "things",
        "detected",
        "Info",
        "Hardware",
        "time",
        "SATA",
        "Origin",
        "RAM",
        "power button",
        "Xeneon Flex",
        "drives"
    ],
    "transcript_entity_values": [
        "the years",
        "one",
        "five minutes",
        "4080",
        "SSD",
        "Tanner",
        "One",
        "USB 2",
        "M.2",
        "12 more minutes",
        "H150i Elite",
        "at least 37,000",
        "GPU",
        "120",
        "Xeneon Flex",
        "Every 30 minutes",
        "Cinebench",
        "Classroom",
        "Linus",
        "K100",
        "Cinebench R23",
        "Linus",
        "AIO",
        "Mm",
        "an hour and a half",
        "Monster",
        "midnight",
        "1,000-watt",
        "Two minutes",
        "first",
        "Almost eight minutes",
        "2,250",
        "Windows Explorer",
        "K70",
        "the Monster Benchmark",
        "longer than five seconds",
        "32",
        "Origin",
        "one ninth",
        "47 minutes",
        "XMP",
        "Blender",
        "32-inch",
        "just 11 minutes and 23 seconds",
        "Calvin",
        "Junkshop",
        "4",
        "Calvin] Mm-hmm",
        "only three",
        "20 inch",
        "Kelvin",
        "RGB Wireless XT",
        "CPU",
        "the last minute",
        "third",
        "Jesus",
        "10 minutes",
        "more than one",
        "the last second",
        "1600",
        "Chronos",
        "26 and a",
        "Windows",
        "USB-Cs",
        "four",
        "2,000",
        "Amazon Basics",
        "Origin",
        "just 30 minutes",
        "David",
        "Calvin] Ha",
        "Dark Core RGB Pro",
        "37,988",
        "30 minutes",
        "about 15 minutes",
        "37,000",
        "Xeneon Flex- - Yeah",
        "two",
        "a Xeneon Flex",
        "that half an hour",
        "just an hour and 40 minutes",
        "DDR5 RAM",
        "second",
        "two hours",
        "Cinebench R23",
        "Power Button",
        "Two",
        "our ROG Rig",
        "eight and a",
        "Asus",
        "That half an hour",
        "Iron Claw RGB Wireless",
        "four seconds",
        "the next one",
        "today",
        "SATA",
        "RAM",
        "up to 620 mm",
        "Hardware Info",
        "only two",
        "24 minutes - Hard",
        "the Xeneon Flex",
        "USB",
        "less than two hours",
        "Xeneon",
        "IO"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "LAW",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "TIME",
        "QUANTITY",
        "TIME",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "QUANTITY",
        "TIME",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "ORDINAL",
        "PERSON",
        "TIME",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "TIME",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "TIME",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "TIME",
        "TIME",
        "PERSON",
        "ORDINAL",
        "TIME",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "FAC",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "GPE"
    ]
}