{
    "id": "LVwD_4WJS8c",
    "title": "The Truth about Apple's Nano Etched Glass - (M4 iPad Pro)",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2024-05-30T13:47:00Z",
    "video_url": "https://www.youtube.com/watch?v=LVwD_4WJS8c",
    "category": "Howto & Style",
    "tags": [
        "M4 iPad",
        "M4 iPad Pro",
        "Apple iPad",
        "new apple ipad",
        "apple",
        "iphone",
        "iphone 15 pro",
        "Apple pencil pro",
        "best apple ipad",
        "Nano etched glass",
        "Apple Nano Glass",
        "iPad Air",
        "iPad Pro",
        "2024 iPad Pro"
    ],
    "views": 1216788,
    "likes": 43579,
    "comments_count": 1752,
    "description": "Turns out that Apples M4 iPad Pro is a Mohs Level 4.... Be safe out there. Get a $10 reward for opening a Chime checking account when you activate your Chime Visa Debit Card. Just go to  and enter promo code JERRYRIG.  Apples new Nano Etched Glass on this 11inch iPad Pro is pretty nifty. The Non-reflective glass feels amazing. And looks pretty cool - although dimming the colors a bit. But is Apples new Nano-Etched glass durable? There is only one way to find out...   Banking services and debit card provided by The Bancorp Bank, N.A. or Stride Bank, N.A.; Members FDIC. Activate your physical Chime Visa Debit Card within 30 days of opening a Chime Checking Account with valid promo code and receive $10 within 10 business days of activation. SpotMe eligibility requirements and overdraft limits apply. Boosts are available to eligible Chime members enrolled in SpotMe and are subject to monthly limits. Terms and Conditions apply. Go to chime.com/disclosures for details",
    "description_links": [
        "https://www.chime.com/JERRYRIG"
    ],
    "transcript": "On this year's M4 iPads, you know, Apple's thinnest products ever, Apple has two different types of glass. The 13 inch iPad we reviewed earlier has the regular glossy glass that we see on all the iPhones and previous iPads. But if you're willing to spend a tad extra, Apple has a very special nano texture display on the 1 and 2 terabyte versions, like I've purchased here on this 11 inch. Glass is kind of my thing and I enjoy exploring all of its intricate properties. This video is sponsored by Chime, but more on them later. At first glance this thing is wild. Not only is it a completely different visual experience, but the texture is also much softer than the regular glossy glass. My fingers slide, slipping softly over the sleek surface like a ship surfing the smooth seas before snagging on the shiny surround. The texture is glorious, but visually with the matte coating all the colors do seem to pop a bit less, which is a shame since it feels phenomenal. Inside the box we get an Apple branded polishing cloth. We'll tear this down in a second. And there's the same color matching charging cable and 20 watt charging brick that we saw with the 13 incher. Also keep in mind that this smaller 11 inch iPad Pro with its tinier footprint is actually 0.2 millimeters thicker than the 13. Still ridiculously thin, but we'll get to that later. We know the new NanoWitch glass looks different and feels different, but does it scratch or damage any different? Laying out the Mohs scale of hardness we can start seeing something new at a level 3. Instead of nothing happening like on regular glass, this time we see that the nano-textured etched glass is filing down my Mohs 3 pick like a cheese grater on cheese, or a nail filer on nails, or sandpaper on wood, or a 9 to 5 on my will to live. And when we get to a level 4 we see what appears to be actual damage on the display, which is scientifically impossible since we know the glass is level 5 or 6, and this Mohs 4 pick is a level 4. Taking the approved Apple cleaning cloth to the nano-texture removes the copper filings of the level 3, but does not remove the permanent marks from level 4. Not even with alcohol do they disappear. I assume just like sandpaper eventually wears out while woodworking, these nano-microscopic etched mountains are either knocked down by my level 4 pick, or the level 4 pick has become permanently embedded in the nano-texture via material transfer. Either way, visual damage has been done, and that damage is permanent. Seeing what other real life objects might have a same effect on this portable piece of technology, keys do leave some very visible dust behind, but get 99% cleaned up with the Apple cloth. The quarter as well gets sanded down by the Apple grid sandpaper, but again wipes completely away. The Phillips head steel construction screw leaves a very permanent scratch mark on the iPad glass that does not clean off. The open safety pin is fine. And my Jerry Rigg razor knife with its stainless steel blade also leaves a very permanent marking on the glass. Keep in mind that all of these objects would do zero damage and leave zero markings on the regular glossy glass that Apple usually uses. It's only on this nano-etched glass that the damage occurs. Good information to have for sure. Keep metal objects away from the nano-texture if you're wanting to preserve its pristine presentation. Now in the past, Apple has said to only use the genuine Apple polishing cloth to clean its nano-texture displays. And up until this moment, it has done a good job. It appears to be made from a normal soft non-abrasive microfiber cloth material. The only difference between this cloth and a regular microfiber is that this one is dual layered and costs $19. If I were to use a generic microfiber cloth that cost a few pennies, nothing appears to happen on the screen. And again, if I use a slightly more premium dbrand cloth, no damage occurs. Nor do any markings appear or rub off from the blue workshop towel. Or even, and I'm sure someone at the Genius Bar has fainted by now, a paper towel. Besides leaving behind a tad more dust than a generic microfiber, pretty much any cleaning cloth will work for the iPad as long as it's not steel wool. Which, now that I mention it, sounds kind of fun. Now at this point we would normally scratch the frame to see what material it's made from, but since we already checked the larger 13 inch, I'm sure they're both the exact same. But old habits die hard. The left side with its plastic Pencil Pro mounting location and individual volume buttons has a microphone hole off center near the bottom. I would suggest to Apple to move all their microphone holes off center like this, but that's just me. This top microphone hole at the most vulnerable point in the structure became one of the failure points of the 13 inch iPad. We'll see if it's going to haunt the 11 inch version here in a second. The long empty right side of the M4 iPad Pro is also made from metal and does not appear to be compromised with microphone holes. The bottom has two more loudspeakers and the USB-C port. The back of the M4 iPad has a 12 megapixel camera, a 3D LiDAR scanner, and a quad LED dual tone flash. Rest in peace to the ultra wide camera. Now if you're the type of person who considers durability and longevity before making a purchase, you might also be the type of person who's interested in Chime, today's sponsor. You can get a $10 reward for opening a Chime checking account and activating a Chime Visa debit card. With no hidden fees or monthly minimums, Chime is the banking of the future since it's 100% mobile and 100% online. And with Chime's award winning mobile app, it's easy to keep track of where your money is going. You can join millions of other Chime members who have access to fee free overgraph protection up to $200 with SpotMe and can access 60,000 fee free ATMs. And Chime also has 24-7 live human customer support. You can build your credit with the Chime credit builder Visa credit card. One downside of the smaller 11 inch iPad Pro is that there's not quite enough real estate to finish my draft drawing. But oh well, open your own Chime checking account today and get that $10 reward. Link is down in the description. And thanks to Chime for sponsoring this video. And for discounting 5 of my off-road wheelchairs for $1,000 each. One thing that remained the same between the 11 and 13 inch iPad Pros is the Tandem OLED. They have the same 264 pixels per inch, 120 hertz refresh rate. The 11 just has a tad less real estate, and of course on my version, the Nano Edge Glass on top. They're both surprisingly flame resistant. Even after 30 seconds, there is no damage. As we know, glass is glass, but while I don't think the Nano Edge Glass is going to improve the overall structure, I don't think it's going to do any harm either. The 11 inch iPad Pro is 2 millimeters thicker, and during the bend test, every fraction of a millimeter helps. When bent from the back, there is quite a bit of flex, and the glass pinches the skin from my fingers, which is fair enough. Some technology does fight back. And when bent from the front, again, much bending, but no damage. Apple has solved and fixed the hamburger style folding of the ultra thin M4 iPad Pros. Thumbs up for that. Even vertical hot dog style bending appears to be stronger than the 13 inch, with both the first and second bends leaving the tablet slightly warped, but still intact. It's only on the third bend that the microphone up top comes back to haunt us. My hands were sitting slightly on the upper half of the tablet, so that might be a factor. But the matte Nano Texture Glass is indeed shattered all the way through the entirety of the device. And a quick little bend near the bottom that finishes the job. As we commence the post-mortem autopsy to determine the cause of death, it's a mystery. We can visibly see the exact layout and location of Apple Central reinforced cowling over the motherboard. We have two neat cracks along either side of that central spine, which, and we'll have to check in a second, I think mirrors exactly how the larger 13 inch iPad Pro also broke. Rolling the glass covered tandem OLED off to the side like a can of sardines, we get our first look at the large dual batteries that give us a total of 8,160 milliamp hours and 31.29 watt hours. I'll remove 12 Phillips head screws to get access to Apple Central cowling. It's incredible that this ultra thin tiny piece of metal can keep the iPad from snapping in half long ways. A nitty bitty piece of hardware doing incredibly good at its job. Pulling off the copper shielding from the motherboard, we get our second look at the Apple M4 chip. Both the iPad Pros look very similar inside. Different speaker layouts and a smaller battery. But when we take a peek at the backside, looking of course beyond my photorealistic depiction of the Savannah, we can see both iPads cracked in the exact same spots. The crack extends from the charging port to the right side of the keyboard connection pins, around the right side of the Apple Bytes, and up and around all the way to the microphone hole up top. If Apple removed that microphone hole and added a perpendicular cowling to the insides, I'd be out of business. So please Tim, forget everything I just said, and thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "inch iPad Pro",
        "Apple",
        "Apple thinnest products",
        "glass",
        "iPad Pro",
        "inch iPad",
        "Chime",
        "iPad",
        "iPad Pros",
        "regular glossy glass",
        "Nano Edge Glass",
        "inch",
        "Pro",
        "glossy glass",
        "Apple Central",
        "Nano Texture Glass",
        "Apple thinnest",
        "damage",
        "cloth",
        "level"
    ],
    "transcript_entity_values": [
        "a few pennies",
        "Chime Visa",
        "Tandem",
        "this 11 inch",
        "hertz",
        "Apple M4",
        "19",
        "31.29 watt hours",
        "1,000",
        "6",
        "60,000",
        "The quarter",
        "20 watt",
        "Visa",
        "the Nano Edge Glass",
        "100%",
        "two",
        "120",
        "Glass",
        "99%",
        "the Genius Bar",
        "8,160 milliamp hours",
        "1",
        "the M4",
        "Chime",
        "0.2 millimeters",
        "12 megapixel",
        "Chime",
        "half",
        "Apple Central",
        "iPad Pros",
        "monthly",
        "4",
        "2 terabyte",
        "Phillips",
        "zero",
        "Jerry Rigg",
        "11",
        "2 millimeters",
        "iPad",
        "year",
        "5",
        "Apple",
        "iPhones",
        "264",
        "10",
        "iPads",
        "millions",
        "Pencil Pro",
        "first",
        "second",
        "millimeter",
        "30 seconds",
        "Savannah",
        "9 to",
        "Tim",
        "13 inch",
        "today",
        "the M4 iPad Pro",
        "12",
        "third",
        "24",
        "3",
        "One",
        "NanoWitch",
        "the 13 inch",
        "13",
        "11 inch",
        "200",
        "iPad Pro"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "MONEY",
        "TIME",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "FAC",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "NORP",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "GPE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "ORG"
    ]
}