{
    "id": "lXxfQDdY-rU",
    "title": "WE NEED YOUR HELP!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2024-07-09T19:32:49Z",
    "video_url": "https://www.youtube.com/watch?v=lXxfQDdY-rU",
    "category": "Howto & Style",
    "tags": [
        "JerryRigEverything",
        "Library",
        "Kenya library",
        "budaliangi libarry",
        "doldol library",
        "africa library",
        "africa donate",
        "donation",
        "learning",
        "how to help africa"
    ],
    "views": 915087,
    "likes": 77903,
    "comments_count": 3390,
    "description": "We have built a full size library in DolDol Kenya, and THANKS DO YOUR donation we have collected more than 19,000 books!! See the books we collected here:   We need kids books, novels for teenagers, textbooks, educational books,  encyclopedias... anything and everything. Please no diet books or recipe books.   You can send new or used books! Just make sure they aren't falling apart. The books have to arrive within the first week of August 2024, or they will miss the boat!! You can also drop off the books in person - someone will be there to receive them.   THANK YOU - THANK YOU - THANK YOU  Learn more about our last library in Budalangi Kenya HERE:",
    "description_links": [
        "https://youtube.com/shorts/pyOyjZWuhe4",
        "https://youtu.be/7R71uDa3DNw?si=ETcTZ8YtdPDPbDq8"
    ],
    "transcript": "Zack: Normally we don't ask for help, but today we have a situation. Cambry: When someone comes to this channel and watches one of these videos. We get a small fraction of a penny. Zack: And we've been saving up those small fractions of pennies to build another full-size library in Kenya, but there's a problem. Cambry: The library is already completely built, but that's not the problem. It's sitting right next to a school in town called, DolDol. It's about 300 miles from our last library that we built 2 years ago. Zack: This new building will be a hub of learning for four high schools, eight elementary schools, and provide access to free books to about 20,000 people. The last library you helped stock, with 34,000 books 2 years ago, is still fully functional in Budalagi. It gets used everyday. And in the summer months, when school is not in session, it's still a spot where little kids can come to get a bite to eat while sitting amongst all the knowledge that humanity has to offer, so far. Einstein once famously said that, \"The only thing you really gotta know is the location of the library.\" To build this new library in DolDol we used local materials, local builders, and local designers. The same people who get to use the library are also the ones who built it. And we've purchased about $8,000 worth of books from local authors in Kenya to stock a portion of the library. Cambry: And thanks to you we've also been able to build a pipeline from an existing borehole all the way uphill to the school and the village. This is something that I'm most excited about, because during the dry season when the ponds dry up, elephants come into town and smash open people's water storages to get a drink. Kenyan man: Oh so the elephants. Yes. They were cross with that wabati. Yes. Cambry: The pipeline will a make a continuously refilling pond for the elephants while piping water uphill to the village. Making getting water safer for both humans and elephants. Zack: Imagine waking up in the morning and an elephant is like stealing all your water. Cambry: Right? Zack: Yea it's crazy. Cambry: And we aren't stepping into this willy-nilly. We're working with both the Kenyan government and then the Kenya Wildlife Conservancy to make sure this is done right, and that it's actually needed. Zack: And we're working with my uncle Philip. He is from Kenya, and I've known him most of my life. You can tell we're related by the haircut. Philip: 1, 2, 3 Philip and Kids: Welcome to DolDol library! Philip: To me the most important thing that I feel like you can transfer to somebody is knowledge. I had a chance to get a good education and I've always wondered, how can I replicate that uh from where I come from. Having a library provides that bridge, right? So kids here in Kenya start getting access to books when they go to school. That is like the first time that they start using books. And also, they don't give them any books to use all the time. And so a library provides that opportunity for them to come here, to learn, and also to gain knowledge. So, imagine a kid living in a place where there's so many libraries, or so many books, whether at school at home. If that kid can have the same experience as a kid down here because of a library that is a game changer. They can all have the same knowledge. They might have different circumstances, different backgrounds, they might look different, they might have different skills or abilities, but there's one thing they'll have in common: Is they will all have knowledge. And that knowledge comes from books. Zack: We already have approval from the government to import a full shipping container worth of books, but we don't have that full container worth of books yet, which is where you come in. Cambry: For the rest of this month, July, we're going to be collecting books. So, think of the books that really shaped you as a person. Not the keto diet book or Grandma's recipe collection, because that's not helping anyone. Think of the fun, uplifting, or knowledge building books that you really enjoyed reading. Zack: Because this is a community library we want a bit of everything, baby books, children's books, novels for teenagers, educational research books, textbooks, encyclopedias. Everything! Cambry: New or used books are great! Just as long as they are not torn or falling apart. Zack: And sending books is actually really cheap. USPS has something called media mail where you can send books way cheaper than other packages. So, make sure that you ask for media mail when you're shipping your books for the library. Cambry: Or just order your books on Amazon or Barnes and Noble and send it to the address in the description below. Books need to arrive in July though. If the estimated arrival is in August you've missed the boat. Like quite literally. Because we'll be packaging and putting all of the books in a container for its two-month voyage across the ocean the first week of August. Zack: We're on a tight timeline. Cambry and I will both be there for the library opening so you can see exactly where your books end up. Cambry: Plus this is perfect timing, because we're moving out of our old small wheelchair factory into a larger wheelchair factory. Which more on that later, but it now provides room in our small factory for all of these books to come and be organized and get ready to ship. Zack: And all of this is possible because you guys keep watching our videos. This is two communities a world apart coming together to accomplish something really cool. So, thank you for sending your books new or used to the address in the description. And we will keep you updated. Cambry: Thanks a ton for watching! We will see you around.",
    "transcript_keywords": [
        "books",
        "library",
        "Cambry",
        "Zack",
        "Kenya",
        "knowledge",
        "school",
        "Philip",
        "library provides",
        "elephants",
        "Kenya Wildlife Conservancy",
        "local",
        "water",
        "small",
        "kids",
        "kid",
        "Cambry Zack",
        "built",
        "Kenya Wildlife",
        "build"
    ],
    "transcript_entity_values": [
        "Kenya",
        "Philip",
        "Cambry",
        "2",
        "four",
        "about $8,000",
        "this month",
        "Kenyan",
        "two",
        "Noble",
        "the first week of August",
        "1",
        "July",
        "the summer months",
        "August",
        "Amazon",
        "Grandma",
        "USPS",
        "a penny",
        "two-month",
        "about 300 miles",
        "about 20,000",
        "first",
        "2 years ago",
        "34,000",
        "the dry season",
        "Barnes",
        "today",
        "Budalagi",
        "Zack",
        "3",
        "eight",
        "one",
        "the Kenya Wildlife Conservancy"
    ],
    "transcript_entity_types": [
        "GPE",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "NORP",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ]
}