{
    "id": "lYPe4MsALk4",
    "title": "The World's Largest Smartphone Camera! Xiaomi 12S Ultra",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-07-08T00:57:43Z",
    "video_url": "https://www.youtube.com/watch?v=lYPe4MsALk4",
    "category": "Science & Technology",
    "tags": [
        "Xiaomi",
        "Xiaomi 12S Ultra",
        "12S Ultra",
        "smartphone camera",
        "biggest camera",
        "best camera",
        "best smartphone camera",
        "iPhone camera",
        "MKBHD",
        "biggest smartphone camera",
        "phone camera",
        "smartphone sensor",
        "Sony IMX"
    ],
    "views": 3379514,
    "likes": 122247,
    "comments_count": 4549,
    "description": "Xiaomi 12S Ultra has a truly incredible camera... sometimes  1-inch Sensors aren't actually 1 inch:   MKBHD Merch:   Playlist of MKBHD Intro music:   Phone provided by Xiaomi for review.  ~",
    "description_links": [
        "https://youtu.be/-njHjebtIg4",
        "http://shop.MKBHD.com",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "- Okay, so this is the Xiaomi 12S Ultra. It's a smartphone, sure, but I think we can all tell it's all about the camera. I mean, look at this thing. Almost half the back of the phone is this massive camera module. The first 20 pages of their website for this thing is all camera, camera, camera stuff before it talks about anything else. They even have this video on their site of it morphing from a camera into this phone. And it has the world's largest smartphone camera sensor inside. Can you imagine being the person at a party where everyone's got their phones? They're like, hey, we wanna take a group picture. Does anybody have a good smartphone camera? And you just, yeah, that's, I got it. I guess what I'm trying to say is, this phone better have a great camera. So there's been quite a bit of hype around this brand new Xiaomi 12S Ultra recently, so I had to give it a shot. The headline that caught my eye about it is that it's rocking the world's largest smartphone camera with a one-inch sensor. But a couple funny things about that. First, one-inch sensors aren't actually one inch. They're a little smaller than that. I actually did a video where I talked about that. I'll break that down, down in the description I'll have a link by the Like button. You can check it out. But second, it's not the first smartphone with a one-inch sensor. Matter of fact, there's been a couple before but it is the first one with Sony's new IMX989 sensor, which is the first one built for a smartphone camera rather than repurposing a one-inch sensor to go into a smartphone. So it technically beats Samsung to the punch, who we know they're working on their ISOCELL camera that's gonna be a one-inch sensor, probably coming to the Galaxy S23 Ultra sometime next year. So Xiaomi beat them to the punch. And as a matter of fact, that's kind of the whole point of this phone is to one-up Samsung's Ultra phone in as many ways as possible, and to slap the same exact name on it. So they can do it better. That's the statement they're making. So when I got my hands on this phone that's what I wanted to find out. Does it actually beat the king of the hill, Galaxy S22 Ultra at its own game? And most importantly, is it actually worth it to have the world's largest smartphone camera? By the way, it's this one, not this one in the middle, that's the ultra wide, and it's not this bottom one here, that's the 5X telephoto. That one. That one is the world's largest smartphone sensor. So I've taken quite a few photos and videos over the past few days, testing this phone's camera in both normal conditions and crazy more and more extreme conditions at its limits. And it turns out, yeah, this camera is phenomenally capable and is really, really good very often. So the 50 megapixel main camera kicks out great detail and sharpness binning down to 12 and a half megapixels, and has a knack for reeling in exposure even in harsh conditions, taking photos into the sun and with high dynamic range and all that. But what I really noticed is two main things that were est here that made good photos really, really good on this phone. And that's the shutter speed and the auto focus are consistently really fast, because that huge sensor lets in so much light here. So if we're taking pictures of moving objects like kids and vehicles, pets sprinting around a studio with endless energy, all that stuff, it's great. And that's awesome. It freezes the action and nails focus very reliably and that is super confidence-inspiring in a camera. It also handled low light very well, which shouldn't surprise me given the light gathering ability of a huge sensor. But I did decide to do a little head-to-head against the phone it's trying to one-up so bad, Galaxy S22 Ultra, so I did a blind side-by-side on Twitter. I should have done a poll, but just based on reading the replies, a lot of you guys really did actually prefer the 12S Ultra shot here, despite it being more saturated. Mostly because it reeled in the bloom from the streetlight better, thanks to better lens coatings, et cetera, and it still kept all the details on the rest of the exposure and had very low noise. You might have noticed the Leica branding up in the corner on the back of the phone. They did actually have some help from Leica on the optics and the coating over the glass to reduce things like fringing and chromatic aberration, and it works great. Gut also the color science. So when you first fire it up, the phone asks you if you wanna shoot with Leica authentic look or the Leica vibrant look. Basically you can think of them as the same thing as photographic styles on the iPhone. The authentic look is a little less saturated, while the vibrant kicks out a more instantly shareable, traditional look. But neither of them are particularly great to my eye. Now that I've shot with both. So yeah, the typical photo from the 12S Ultra is a clean and sharp shot with shallow depth of field for close up subjects, pretty punchy and saturated usually and with a lot of dynamic range. But here is my hot take on this camera though. While it isn't perfect, it has the highest ceiling of any camera I have ever seen in a smartphone. So it doesn't always hit, but when it does, it is amazing. I have two shots I wanna show you that specifically just make me feel very strongly about this. So the first one I was up on the roof of this building. There's some plants up there, it's windy up on the roof. And so I'm taking a picture of these plants and they're moving quickly in and out of the frame. I'm just sort of like pointing and shooting and boom. The photo I get back is this tack-sharp shot with incredibly shallow depth of field and this immense dynamic range. The movement is completely frozen in time, like the plants aren't even moving. I kind of couldn't believe it. Just seeing how fast the stuff was moving around in and out of the frame. It's a shock that auto-focus even worked, but it locked on, it kept it in focus, and it nailed it, and it did it again and again, and over and over again. And then the other one is, I was at practice the other day way out on an island somewhere. I had put my cleats on. I was just about to put my phone back in my bag but I took a photo of the ground and just like my cleats on the ground before I got up. Boom. And with this one, this isn't even a particularly difficult shooting condition, right? It's not much moving. It's just a still subject of my feet, but optically, this might be the most impressive photo I have ever seen come out of a smartphone camera. Keep in mind, there is no portrait mode here. This is normal depth of field. My cleats are tack-sharp, there's a clear, shallow depth of field, and you can see the slight roll off of the blur, getting stronger and stronger the further you go back in the frame, and the exposure and the contrast and the color of the entire shot are all so nice. So, you know, it's just a random off-center snap of my feet but Jesus, from a phone? I kind of love this photo. So I've said a lot of good things about this camera but I also said it wasn't perfect. So it's a flagship. I'm gonna pixel peep, and I'm gonna go through those things too. It does have some of the more classic weaknesses of a big sensor smartphone like this. So the huge sensor makes for a nice natural depth of field, which we know is awesome. It's amazing for those mid-range shots, like two to four feet away, but when you get too close it definitely, definitely starts to fringe, like any other smartphone with a huge sensor. So you can get close up to a subject and there's real blur but often part of the subject is in focus and then some of it isn't. And the blur is pretty ugly when this happens. Now they try to combat this, like a lot of others do, by auto switching to macro mode, which comes from the ultra wide camera. Unfortunately the ultra wide camera has a dramatically different look and color science to it. It just looks so different overall. And in my opinion, it looks worse. It solves the fringing problem, but yeah, it looks worse. And then speaking of color science, it is dramatically inconsistent between the lenses. You can easily see if you just quickly switch between them, like go from 4.9X to 5.2X, there's a pretty big difference in color, in exposure in contrast, in everything. And the same thing happens in the ultra wide. This is a pretty common thing with smartphones but it's particularly bad here. And then the video footage. The videos are typically pretty good. You can shoot up to 8K, 24 FPS from any of the lenses, or 4K 30, which looks pretty solid when it hits focus, especially with that rock-solid image stabilization. But it has this weird bug and it took me a minute to figure out what was going on, 'cause I'd shot a ton of videos, and I was trying to understand here, so stay with me, right? So I go up to the roof again I'm taking videos of the skyline and I see a plane and I'm gonna go, I'm gonna test this feature where I can switch between all three lenses while zooming through video. Cool that you can do that, right? So I pointed at the plane. And I start taking this video and what I think I'm doing, and what I see in the view finder is I zoom all the way in on the plane, and then I track it across the sky, perfectly keeping it in the center of the view finder. So imagine my surprise when this is the clip that comes out of the shot. It starts by zooming in on the plane, but then looks like I fell asleep while recording or something. Like it totally leaves the frame. And so I literally just got the shot and then went and watched it back, and I saw that it wasn't what I thought I had. I was trying to figure this out. Turns out what I believe is happening is, as you're smoothly zooming in and out, switching between the three lenses while recording, the view finder is just smoothly zooming in on the primary sensor. And so when it showed me that I was keeping the camera, keeping the plane in the middle of the frame, what it was actually doing was switching to the telephoto in the recording. So you can actually see while watching the footage the moment that it switches to the telephoto camera, which has a slightly different angle to it. So at the max zoom, that really adds up quite a bit. So what I'm seeing on the screen is not what I'm actually recording. This is something that I think they can fix pretty easily with software, by just adjusting where the zoom happens, but it's just an odd, I don't know, it's a quirk. If you happen to be doing a lot of super zoomed-in, creepy videos of stuff far away, then you should know that this one might, you need to calibrate or adjust for it. But anyway, there's so much more I could go into with this camera, from the optical lens emulation from a couple of old lenses, to all the various modes. There's a Super Moon mode and Multi Video angle mode, a whole bunch of other stuff, but I think the summary with this gigantic camera on this smartphone is, the hits really hit. It's hit or miss, but the hits, hit hard. It is a fascinating optical experience shooting with this phone. The rest of the phone, by the way, is very much Ultra. Like again, they're taking aim directly at Samsung here. So I'm talking Snapdragon 8+ Gen One chip, with 12 gigs of RAM, which is now a few months ahead of Samsung, making that leap. It has a 6.7-inch 1440p 120Hz OLED display LTPO, which is 522 pixels per inch, with a max brightness of 1500 nits. It's a world-class display, aside from the curved sides and corners, which I'm starting to hate. And there's also a 4,860 million power battery, which isn't the biggest, but with 67-watt fast charging, 50-watt wireless charging, and 10-watt reverse wireless charging, all better than Samsung's flagship. The speakers are excellent and Dolby Atmos certified, and with plenty of EQ settings to match. there's a new X-Axis haptic motor, which is great. And it's all wrapped in a build, combining matte black metal and a faux leather that's IP68 water resistant and looks like a Minion. Just gonna be honest, looks like a Minion. You will most likely never see this phone in real life, if you live in the United States or North America, but in the regions that Xiaomi is selling it in, it goes for about $900, which again is one upping, or better than what Samsung's selling their Ultra for. So as far as their mission, I'd say mission accomplished. the Me 12S Ultra, Xiaomi 12S Ultra, is a really impressive phone. The hits hit so hard. I love this thing. Anyway, let know what you think. That's been it. Thanks for watching. Catch you guys on the next one, peace. (soft music)",
    "transcript_keywords": [
        "camera",
        "Ultra",
        "smartphone camera",
        "phone",
        "largest smartphone camera",
        "ultra wide camera",
        "smartphone",
        "Samsung Ultra phone",
        "sensor",
        "smartphone camera sensor",
        "ultra wide",
        "world largest smartphone",
        "shot",
        "oneinch sensor",
        "largest smartphone",
        "good smartphone camera",
        "Samsung",
        "Xiaomi",
        "Ultra phone",
        "huge sensor"
    ],
    "transcript_entity_values": [
        "one inch",
        "Almost half",
        "Xiaomi",
        "three",
        "50-watt",
        "one",
        "Multi Video",
        "One",
        "one-inch",
        "Leica",
        "8",
        "Sony",
        "Leica",
        "a few months ahead",
        "12",
        "Ultra",
        "about $900",
        "Super Moon",
        "20",
        "Galaxy S22 Ultra",
        "ISOCELL",
        "4",
        "12 and a half megapixels",
        "Leica",
        "the Galaxy S23 Ultra",
        "first",
        "Jesus",
        "North America",
        "6.7-inch",
        "a minute",
        "67-watt",
        "First",
        "1500",
        "iPhone",
        "50",
        "next year",
        "the past few days",
        "522",
        "second",
        "Twitter",
        "IMX989",
        "RAM",
        "Dolby Atmos",
        "two to four feet",
        "two",
        "the United States",
        "10-watt",
        "Xiaomi 12S Ultra",
        "4,860 million",
        "Samsung",
        "24"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "LOC",
        "DATE",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "LOC",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "LOC",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}