{
    "id": "lYSmz07i9SM",
    "title": "The smartphone from 2030 just arrived today...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-12-20T15:47:00Z",
    "video_url": "https://www.youtube.com/watch?v=lYSmz07i9SM",
    "category": "Howto & Style",
    "tags": [
        "gaming phone",
        "full screen phone",
        "bezel less phone",
        "smartphone",
        "red magic 9 pro",
        "iphone android",
        "mobile phone",
        "gaming",
        "video games",
        "mobile game",
        "best smartphone"
    ],
    "views": 6221652,
    "likes": 155530,
    "comments_count": 71007,
    "description": "There is no camera bump in the future. Current pricing of the RedMagic 9 Pro here:  I enjoy gaming phones, since its usually the smartphones built for gaming, like this RedMagic 9 Pro where we see new technology, and designs, really shine.   This RedMagic 9 Pro has a built in RGB Turbo fan that spins at 22,000 RPM to cool down the internal processor. It also has a headphone jack AND 80watt charging AND an under screen camera. (5th generation) And no camera bump on the back.   If this is what the future looks like - I'm all for it.   To win one of the 2 non-damaged Red Magic 9 Pro's in this video just leave any comment on this video - and Ill pick 2 (two) Random winners in the next 7 days. The winners will be notified publicly with a response on their comment from my verified YouTube channel.",
    "description_links": [
        "https://na.redmagic.gg/pages/redmagic-9-pro-launch"
    ],
    "transcript": "In front of us today we have three bezel-less, wall-to-wall displayed smartphones that not only have a 5th generation hidden under-screen camera, but also no camera bump on the back. No camera rings, no humps, lumps, or rumps whatsoever on the back panel. The Red Magic 9 Pro comes in textured sleet, cyclone, or my favorite, snowfall. I'll be giving away the two untouched phones at the end of this video. Snowfall, however, is about to go through some things. I've noticed during my career that all the cool smartphone features seem to appear on gaming phones first. The rest of androids get them a few years later. And iPhone users will be seeing all this tech for the first time around 2030. Let's get started. [Intro] The no camera bump thing is pretty wild. No lips catching lint and no snagging pockets. In a world where everyone else seems to be competing for the biggest bump, Red Magic is not only eliminating the protruding rear lenses, but also hiding the entire front camera under the screen. Red Magic is nice enough to include a plastic screen protector. It looks completely non-existent, but I assure you there is a 16 megapixel front facing camera hidden under these pixels. I got to thinking, which is dangerous I know, if a camera can peep outward through these pixels, what if we use a microscope camera to peep our way back into the pixels to see what's behind the screen? And it works surprisingly well. We can indeed see the camera, and if we enhance some more, we can see the individual amoled diode, that the 16 megapixels are peeping through. There is a surprising amount of free real estate in between these pixels, and feel free to take a good long look, because if you're under 40, it's the only real estate that's left. We'll check the camera quality in a second. I feel like my mind has already been blown so many times by this phone, and we haven't even gotten to the 10 layer cooling system and programmable RGB turbo fan on the back. Red Magic says that this fan, and an internal sandwich of thermal dissipation, can reduce the overall temperature of the processor by 18 degrees Celsius, while only being 4 decibels. It sucks air in through the right side, and spits that air out near the fan on the left side of the phone, strong enough to blow little slivers of paper across my desk. Spinning at 22,000rpms, my tweezers aren't quite able to reach the ultra thin fins. But, if you happen to have a motherboard of a torn down OnePlus Open Lane around, as one often does, which also has a frayed signal wire, the cooling fan is most definitely penetratable, and transparent enough that we can count the fins rotating inside. It spins back up again after getting stopped, so I don't think we've harmed it permanently yet. That will come later. First, we've got to put that underscreened selfie camera of the Red Magic 9 Pro up against an iPhone 15 Pro. I'll turn off the beauty filter, since my head is already smooth enough. At first glance, it's actually pretty solid. There is a bit more glare off the lights, and the overall image is definitely softer than the iPhone 15. But the Red Magic 9 Pro's underscreened selfie camera still takes very usable pictures. While the camera itself is still very much entirely positively invisible to the outside world, pretty wild. With the camera being hidden under the display, it means that the display itself is now the lens. And luckily for Red Magic, as we work our way up through the Mohs scale of hardness, we see that indeed the 9 Pro scratches at a level 6 with deeper grooves at a level 7. Red Magic is using Gorilla Glass 5. The sides of the phone are made from aerospace grade aluminum, with corner triggers on each end of the frame for extra gaming functionality. At 520 hertz, these non-scratching shoulder triggers can sense your fingers touch, before your finger even realizes it's touching something. The textured red gaming mode switch is metal, the circular power button is metal, the volume rocker is metal, and the fan grill is also metal. The grill leads to a sealed metal channel running over the top of the processor. Making our way to the top of the phone, whoa, it's been a while. This circular hole is actually a really cool port for audio called a headphone jack. This guy eliminates phonic delays by allowing a hardwire connection for extreme gaming scenarios where milliseconds matter. An ultra-premium port these days and a rare sight indeed. The bottom of the Red Magic 9 Pro has our lower stereo speaker, 80 watt USB-C port, which apparently charges dual batteries inside, and also has our metal cover dual SIM card tray with a red rubber ring. With the fan and everything else going on inside of this phone, there is no official IP rating, but it's good to see that some ingress protections have been made. Making our way to the extraordinarily flat back panel, we see it's made from glass and includes the camera lenses. We have our 50 megapixel main camera up top and a 50 megapixel wide angle camera in the middle with our perfectly aligned turbo fan aesthetically complementing the array. The only thing protruding ever so slightly is the dual LED flash. I gotta point out though, that the sleet covered Red Magic 9 Pro has an absolutely wild texture on the back, like a DJ record scratch or someone trying to operate a ham radio in an Apocalypse movie, but both panels are made from glass and won't be scratched up by a razor blade. The wall-to-wall display Red Magic installed on this thing is 6.8 inches and has a 120 hertz refresh rate with an instant touch sampling rate of 2000 hertz. Again, the screen knows you've touched it before you know you've touched it, which means you can't blame hardware for lag anymore. The fire doesn't really have much to do with anything, but the AMOLED screen does last for about 20 seconds before going white and mostly recovering. If we crank the internal turbo fan up to full blast, it is capable of blowing out a fully lit lighter, which is cool... or hot. Pretty sure this Red Magic 9 is the first phone that can actually defend itself against the burn test. Thumbs up for that. Finally, setting my fingerprint with another sensor that sits below the pixels, everything goes pretty smoothly. And after adding some level 7 deeper grooves to the glass surface, the 9 Pro is still able to read and unlock my phone every single time. However, with regards to the bend test, if you're looking for a gaming phone that you can rage quit by snapping in half, this is not going to be the phone for you. The Red Magic 9 Pro is most definitely solid from both the front and the back, with the flat glass pieces inlaid inside an aluminum frame and additional metal for the internal air ducting. This Red Magic 9 Pro, just like all of its predecessors that came before, has the structure to survive my durability test. Nice work, Red Magic. I'm already looking forward to the teardown. Just be subscribed and leave a comment, maybe a goal you have for this next year. And I'll pick two random winners to get the undamaged phones. There's also a link down in the description if you want to check her own pricing. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Red Magic",
        "Red",
        "Magic",
        "camera",
        "display Red Magic",
        "Pro",
        "covered Red Magic",
        "Red Magic installed",
        "phone",
        "generation hidden underscreen",
        "hidden underscreen camera",
        "back",
        "fan",
        "metal",
        "underscreen camera",
        "camera bump",
        "screen",
        "Glass",
        "pixels",
        "red gaming"
    ],
    "transcript_entity_values": [
        "22,000rpms",
        "Apocalypse",
        "50 megapixel",
        "iPhone",
        "9",
        "6",
        "15",
        "two",
        "80 watt",
        "120",
        "Red Magic",
        "three",
        "jack",
        "5th",
        "about 20 seconds",
        "under 40",
        "RGB",
        "half",
        "520",
        "10",
        "this next year",
        "a few years later",
        "18 degrees Celsius",
        "first",
        "second",
        "6.8 inches",
        "2000",
        "OnePlus Open Lane",
        "Red Magic 9 Pro",
        "4 decibels",
        "First",
        "today",
        "these days",
        "16 megapixels",
        "16 megapixel",
        "AMOLED",
        "7",
        "IP"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "FAC",
        "PRODUCT",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG"
    ]
}