{
    "id": "LzD75Pj4pfg",
    "title": "Holiday Gift Guide!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-12-14T21:02:21Z",
    "video_url": "https://www.youtube.com/watch?v=LzD75Pj4pfg",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 188950,
    "likes": 8837,
    "comments_count": 467,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, guys, it's Justine. And this is going to be a really fun video. This is gonna be a holiday gift guide that I'm doing with Best Buy. So thank you so much, Best Buy, for sponsoring this video. If you guys have been following along over the past couple of months, I partnered with them to showcase some really fun products over on Instagram. We even did a really cool live stream. So thank you to everyone who was able to tune in for that. But today, I'm gonna kind of take all of the products that I've been talking about, and put them all in one single video. And a lot of things that I'm showing you, I've actually already got as gifts for friends. I'm not gonna say who. So if any of my friends are watching this, there's a really good chance that a lot of the things that I'm showing you, it's on the way. This year is so different than previous years. But what's great about Best Buy is they have basically been there for me over the past couple of months when I've needed things same day. Now, I can just order things online, and they have curbside pickup, so I basically don't even have to leave my car. I pick the things that I want, I drive there, and they bring it to me. It's incredible. You order something online, you can roll up, check in, and they will bring you your package. You can shop safe and fun. So, one of the things that I wanna start with are these. These are the Phillips Hue lights. Now, I've talked about these in so many different videos. I basically have my entire house hooked up to these, all of my lights in my ceilings, in my lamps. They have so many different models and various kinds. They have indoor, they have outdoor. You can connect them with any of your smart home devices, and you're able to control it with your voice. So these, you can change the colors, but there's also two new ones that just recently came out. These are the Filament bulbs. So these kind of give off a really warm amber hue. Actually using it in this light right behind me. So you're getting this cool retro look, but you can control this with your phone. So you guys can see, this is my Hue app. I have everything all listed and labeled. So right now, we're gonna go into my office. And this big lamp in the back, watch this, I can change the colors. (upbeat rhythmic music) So, since this Filament bulb is not one of the colored bulbs, you can't change this color, but you can change the brightness. So you can turn it all the way up or all the way down. We'll keep it all the way up. If you are looking to get these for somebody, I would definitely find out if they have them already because if they do, then they most likely have a starter kit. With a starter kit, that will allow you to connect all of these bulbs to your router. Obviously, health and wellness is a huge focus I think for a lot of people this year as it has been in the past but this year specifically. Taking care of your health and bringing that into your own hands is something that's very important. So these have been two of the things that I've absolutely loved. This is a little thermometer that actually uses infrared. So you can just take your temperature just like this. That data will be recorded and sent to your phone. The one thing that I have found that is the most important thing is knowing what your normal is. So being able to take that every single day, you'll be able to see the trends. You'll be able to spot the differences, and know when something is up. This is also something else that I absolutely love, and this is the BPM Connect. I've been using this several times a week. I don't do this every single day. This is a blood pressure monitor. So this also will connect to an app on your phone, so you're able to keep all of that data, and all of those records. This could also be a great gift for older family members, or even anybody who might have health concerns when it comes to blood pressure. All of the data is tracked in an app, and you can easily share it if you need to send it to a doctor. And being able to do these simple tasks at home could potentially be life-saving. So definitely highly recommend these. Again, all of the stuff that we're talking about, you can find on bestbuy.com. And I will put links in the description to each of the products that I talked about so you can find out more about them. Also in the health and wellness department is this. This is the HomeSoap (laughs). So what this is, it's a UV sanitizer, and it's big enough that you're able to put all kinds of larger devices like tablets, multiple phones. If I wanna put my blood pressure monitor in there, close it up, wait 10 minutes, and then my item has been sanitized. (fingers snap) Yeah, I know, it's incredible. This next item is the Ninja Coffee Maker. And I never knew until recently that Ninja made coffee makers. And this one is a KitchenAid Coffee and Spice Grinder. I've been such a huge fan of Ninja brand products for a very long time. So, my sister, Jenna, recently said that she was looking for a coffee maker. And I was like, \"Okay, guess what, I've got you covered.\" So, I did the initial unboxing and first test of it just to make sure that it was Justine-approved and it was. And this thing is really, really cool because it also has a milk frother. (gentle rhythmic music) Next up is this Insignia Mini Retro Fridge. (gasps) When I saw this, I was like, \"This is what my office has been missing.\" This is my office. I edit right next to this refrigerator. I do my live streaming right across from it. I don't even have to leave this room when I want a frozen peanut butter and jelly sandwich. I have a mini fridge and a mini freezer in my office. This is the best thing ever. So this refrigerator is by Insignia. It comes in a bunch of different colors, and it kind of has this real vintage look as well. This is great for anybody that's maybe in a dorm, or even if you're at a work-from-home situation like me. It's perfect for small spaces and I cannot tell you, this freezer is actually really cold. So since my refrigerator/freezer has made me a little chilly, this next thing is actually for my vehicle. I got this because we've been doing a lot of road trips recently. And we went to the mountains, and it was very, very cold, and I was getting some really cool time-lapse shots. So this is a heated blanket that can plug right into your car. This was so cozy in the back of my car when I was freezing just waiting for my video to be done. I feel like this is a really fun gift for anybody as like an emergency blanket just to have them keep in their car. But also, if you're doing any road trips this holiday season, you can keep yourself warm. Or if you have a passenger who tends to disagree with you on the temperature, you can just throw this at them and say, \"Here, now you're warm.\" This next product, I can't even tell you how this has honestly changed my life. I never ever thought that I would be the person to have a garden and now, 2020 Justine has a garden. This is the AeroGarden. And what's amazing about this is you get these little seed pods, and you put them inside of the AeroGarden. You put water, they give you a timer. So every two weeks, you're supposed to put some plant food in. I have got so much joy out of watching these plants grow. Can we just look at this? This is so amazing. This has been the most exciting thing. Like every single day, I come down here, and this has grown a little bit more. I trim it, I prune, I harvest. I'm a farmer now. I'm farming. I need to get another one of these. I need to get a bigger one. I wanna start growing lettuce, maybe even tomatoes. I don't even like tomatoes but I wanna grow them and eat them because why? I would know that I grew them myself. So, this is the basil. I've got two types of basil. I have mint. The thyme, it's having a struggle. It's taking its time. I'm just so upset that it took me this long to get one. I wish that I would have got this back in March because I had started cooking a lot more since I've been spending more time at home. And to be able to sort of just wake up every day, look at my plants, see how they're doing. And I spend a lot of time pruning them now. I mean, this basil is getting out of control. The amount of harvest that I am getting on a daily basis, it's gonna be more than I can even handle myself. It's really cool because I've been able to give my sister some fresh herbs as well, and there's all kinds of different seed pods. I did the gourmet herbs one as my first test. Lettuce, 2021, it is on the horizon. Something that I've also really loved is the Oculus Quest 2. Now, this has been really great because I feel like for many of us, obviously we can't go anywhere anymore. So to be able to kind of have the Quest kind of take me out of my indoor element, and I can basically go wherever I want. I also was really enjoying the Oculus Quest just watching YouTube videos. So it's kind of fun because then you can go into like a little theater mode and just watch content. And it kind of almost makes you feel like you're at a movie theater. Have some popcorn, you're set to go. This last one is a very simple gift. This is the JBL Clip. I have loved the JBL clip. I used to take this thing on hikes. This thing traveled with me around the world. I'm able to clip it onto my backpack. It connects to Bluetooth, so you're easily able to play music through it. But this is also a really great stocking stuffer. I don't know if you guys in your family have stockings. My family, we do. We still have stockings and it's so crazy 'cause my mom, she will manage to fit so much stuff in these stockings that we will come down on Christmas day and they are just like basically hanging down all the way to the ground. I'm like, \"Mom, how could you possibly fit any more in there?\" So, if you are a family that has stockings, here you go, JBL Clip. Well, thank you guys so much for watching. This was a really fun video to kind of put together, and show you kind of a wide array of gifts that you can find on bestbuy.com. And I've said this before, at Best Buy, it's kind of a misconception because you just think of TVs or laptops most of the time, but you can basically get anything. They have so many fun, really cool, unique gifts. And of course, yes, they do have all of the tech as well. That's why it's so incredible because they have so many different things. No doubt about it, you can find something for anyone on your list this year. And here's another hot tip. You could just buy it and mail it to their house. That's what I'm doing this year if I'm not doing curbside pickup. Check your mail, friends. I would love to know from you guys, what is the one thing that is on your holiday wishlist this year? I'll be reading those, and I will see you guys in my next video, bye. (upbeat rhythmic music)",
    "transcript_keywords": [
        "thing",
        "kind",
        "things",
        "Buy",
        "put",
        "fun",
        "guys",
        "video",
        "lot",
        "JBL Clip",
        "year",
        "cool",
        "day",
        "basically",
        "find",
        "time",
        "great",
        "Coffee",
        "connect",
        "Clip"
    ],
    "transcript_entity_values": [
        "every day",
        "every single day",
        "Hue",
        "Phillips Hue",
        "10 minutes",
        "one",
        "This year",
        "this every single day",
        "the Ninja Coffee Maker",
        "Lettuce",
        "the past couple of months",
        "2021",
        "Justine",
        "this holiday season",
        "every two weeks",
        "Instagram",
        "March",
        "2020",
        "JBL Clip",
        "Filament",
        "KitchenAid Coffee and Spice Grinder",
        "AeroGarden",
        "JBL",
        "daily",
        "today",
        "this year",
        "Christmas day",
        "two",
        "Insignia",
        "YouTube",
        "previous years",
        "Ninja",
        "first",
        "Best Buy",
        "Quest",
        "AeroGarden",
        "Jenna",
        "the BPM Connect"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "PERSON",
        "FAC",
        "TIME",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "PERSON",
        "PRODUCT"
    ]
}