{
    "id": "m2po5k6UhIY",
    "title": "DON'T BUY THE iPHONE X 🤫",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-12-25T23:07:14Z",
    "video_url": "https://www.youtube.com/watch?v=m2po5k6UhIY",
    "category": "Science & Technology",
    "tags": [
        "iPhone X",
        "Apple",
        "Don't buy iPhone X",
        "iphone",
        "iphone x review",
        "iphone x unboxing",
        "apple iphone x",
        "iphone x vs iphone 8",
        "x review",
        "iphone review",
        "iphone unboxing",
        "apple iphone",
        "iphone x worth it",
        "don't buy iphone x",
        "iphone 8 plus",
        "new iphone",
        "review",
        "iphone 8",
        "iphone 10 review",
        "iphone x vs iphone 8 plus",
        "face id",
        "iphone x camera",
        "iphone ten",
        "iphone 8 vs",
        "iphone x vs 8 plus",
        "iphone x vs note 8",
        "iphone 8 plus review"
    ],
    "views": 714198,
    "likes": 72737,
    "comments_count": 18551,
    "description": "Don't buy iPhone X. Win one! Subscribe to TLD:   Subscribe to dbrand:  iPhone X Giveaway Winners!  iPhone X Skins!",
    "description_links": [
        "http://www.youtube.com/tld",
        "http://www.youtube.com/dbrand",
        "https://dbrand.com/winners/tld-x",
        "https://dbrand.com/shop/iphone-x-skins"
    ],
    "transcript": "- Yo guys, happy holidays. Jonathon here and I'm pretty positive you've seen this statement echoed throughout the internet and probably in real life. So today I am here to agree with that but not because the iPhone X isn't a good phone. It's because I got a bunch to give away. (electronic music) So to clarify you have a chance to win one of 10 iPhone Xs. Yes there is definitely a theme going on. (electronic music) Now to answer it is stupid simple. One, subscribe to this channel youtube.com/tld. Two, subscribe to dbrand who may have outdone Santa this year and that's it. Now it's not required but if you're feeling like being awesome and you wanna hit that like button or even share this video that would be amazing. From there if a free iPhone was not enough to convince you instead of giving you five reasons not to buy one, here are five reasons why you may want one. One is the display. OLED is finally here on the iPhone and that 5.8 inch near bezel-less display even with the notch is one of the best out there. It's bright, it's crisp and I promise you watching Dream Desk on the iPhone X will be at least 10 times better. Two it is water-resistant and yeah, that's not a new thing but it's nice to know whether you bought one, you got one for someone else, or you won one from this video. You're not gonna have to worry about getting that shiny new iPhone X a little bit wet. Three the cameras are amazing. Yes you get great photos, you get portrait mode, but what stands out to me with the iPhone X is video. With this you can shoot 4K video up to 60 frames per second or you can shoot 1080p videos slow motion up to 240 frames per second which is beautiful. Four is wireless charging and much like water-resistance it is not anything but I promise you once you use it you are going to appreciate it. Five the iPhone X is insanely fast, arguably one of the fastest out this year. Plus on top of that these are wrapped in a beautiful marble or TLD blue skin from dbrand and the best part about these is they won't cost you a thing. So thank you guys for an amazing year. Good luck to everyone out there. There's a link below you definitely wanna check out. This is Jonathon and I will catch you guys later.",
    "transcript_keywords": [
        "happy holidays",
        "iPhone",
        "video",
        "happy",
        "holidays",
        "amazing",
        "year",
        "guys",
        "Jonathon",
        "real life",
        "Dream Desk",
        "tld",
        "pretty positive",
        "statement echoed",
        "subscribe",
        "reasons",
        "watching Dream Desk",
        "display",
        "shoot",
        "frames"
    ],
    "transcript_entity_values": [
        "Four",
        "iPhone",
        "One",
        "10",
        "five",
        "240",
        "4",
        "at least 10",
        "Five",
        "Two",
        "iPhone X",
        "1080p",
        "5.8 inch",
        "second",
        "an amazing year",
        "one",
        "Santa",
        "Three",
        "today",
        "Jonathon",
        "60",
        "this year",
        "Dream Desk"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON"
    ]
}