{
    "id": "m3wZgpL9RJQ",
    "title": "The Razor-Thin Convertible Laptop",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2017-01-09T21:31:22Z",
    "video_url": "https://www.youtube.com/watch?v=m3wZgpL9RJQ",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "hp",
        "hp x360",
        "x360",
        "elitebook",
        "elitebook x360",
        "hp elitebook",
        "convertible",
        "hp convertible",
        "laptop",
        "notebook",
        "convertible laptop",
        "convertible notebook",
        "vs",
        "lenovo yoga",
        "cool gadgets",
        "cool gadget",
        "best laptop",
        "windows",
        "pc",
        "best laptop 2017",
        "best notebook 2017",
        "2017",
        "best",
        "lenovo",
        "tablet",
        "hp pavilion x360 convertible laptop",
        "2-in-1",
        "intel",
        "top",
        "yoga",
        "thin"
    ],
    "views": 1933776,
    "likes": 40389,
    "comments_count": 3316,
    "description": "HP EliteBook x360 Business Convertible Laptop, more info:   UK:  US:  FR:  DE:    Features Intel Core i7 Processor  More features...  - 4K Display - B&O Speakers - Fingerprint sensor - Fast charging - Wacom pen input  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://goo.gl/IZJ5dr",
        "https://goo.gl/IEQfRI",
        "https://goo.gl/npBJPm",
        "https://goo.gl/H2TFWR",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "So you can tell I'm in a special location right now So HP invited me out to this really cool suite in Las Vegas with an amazing view to be one of the first people to look at the new EliteBook x360, ultra thin convertible. This product in front of me, it's a buisness convertible laptop but it's also capable of some entertainment functionality. Let's jump inside the box and find out what makes it special. So the first thing I'm noticing about this is just how crazy light it is. I'm told it's under 3 pounds. The new slick logo. And this is, as i mentioned, a convertible. Got a 4K display, 13 inches. Look at these little touches around here. A little bit of bling there. Another thing I just noticed as well is the type of finger print scanner right there. This one looks capacitive, so I'm assuming that's gonna function a lot more smoothly. A Micro SD card slot. A USB type C Thunderbolt connector. A full sized HDMI port. A traditional USB. That's actually not all of it. We've got a deticated power switch. Another USB. Full sized headphone jack. What looks like a volume rocker. Oh, cool. That is a SIM card slot. So apparently, we've got some quick charge functionality in here. You get up to 50% of total battery life recharged in only 30 minutes. Oh, right. It's a pen from a company called Wacom. This gives you some of the most precise input possible on a touch screen. If you're in anyway artistic or you want to manipulate something more precise, this is a great way to do that. Inside the package is the pen itself. As well as some extra tips. I love when they include the batteries. Let's power this up. One of the cool things here as well is if you set up different profiles, if maybe more than one person uses the laptop, they could get access so they could use their own applications but your files and your profile can still be protected by your finger. So you've also got a low-profile backlit keyboard and it looks like it has a few stages here. And here's the real magic trick. By simply folding it over, you can completly change the way that you interact with it. Now you're watching Netflix, now you're watching movies that you've got stored on there, Youtube, how about a little Unbox Therapy possibly?. This convertible has four separate modes This be one of them folded completely flat, where it's turn in to a tablet. As you can see here, I can actually have this is my input method like that. There's the mode I spoke about earlier, which takes out a very little space. Laptop mode if you getting into the content creation, You wanna type up a document Speakers! You might think, because it's so thin you making some short of compromise. HP went out of the way here, to do the military standards testing and this is actually design to pass twelve different standards test, including drop test so, does feel solid even though it's incredibly thin and light. you can get the full fledge core i7 processors in here, from intel that will be your selection. Then other thing you want might notice are this keys up here, This are dedicated buttons for skype for business, the idea here is to give you quick access to skype for business functionality. Take a lok at that, that's 4K content and here's an example of how you can shoot 4K content, enjoy it on convertible like this. The future is now. Look at this, you ever think a laptop can do all this?. For some reason I feel so cool but it completely flat. So there you have it the EliteBook x360 from HP unveiled right here in Las Vegas CES 2017.",
    "transcript_keywords": [
        "amazing view",
        "ultra thin convertible",
        "special location",
        "suite in Las",
        "convertible",
        "Las Vegas",
        "cool suite",
        "ultra thin",
        "USB",
        "Las Vegas CES",
        "cool",
        "laptop",
        "buisness convertible laptop",
        "special",
        "thing",
        "ultra",
        "type",
        "full",
        "location",
        "invited"
    ],
    "transcript_entity_values": [
        "2017",
        "x360",
        "intel",
        "up to 50%",
        "HP",
        "EliteBook",
        "3 pounds",
        "twelve",
        "USB",
        "first",
        "Youtube",
        "Netflix",
        "One",
        "SIM",
        "four",
        "only 30 minutes",
        "Las Vegas",
        "4",
        "Micro SD",
        "C Thunderbolt",
        "13 inches",
        "Wacom",
        "more than one",
        "one"
    ],
    "transcript_entity_types": [
        "DATE",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ]
}