{
    "id": "m53_jtJR-Ig",
    "title": "It's cool but not $1600 cool... - Angry Miao Hatsu Ergo Keyboard",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-12-29T21:07:58Z",
    "video_url": "https://www.youtube.com/watch?v=m53_jtJR-Ig",
    "category": "Science & Technology",
    "tags": [
        "Keyboard",
        "Switches",
        "Key Switches",
        "AM Hatsu",
        "Angry Miao",
        "Keyboard Art",
        "Ergo",
        "Ergonomics",
        "Comfort",
        "Wireless",
        "Expensive",
        "High-end",
        "Who would pay $1600 for THIS?"
    ],
    "views": 716000,
    "likes": 21862,
    "comments_count": 1140,
    "description": "Thanks to Secret Lab for sponsoring today's video! Check them out at   Angry Miao makes some pretty interesting keyboards; high-end stuff and they are beautiful. I'm not exactly sure that I'm ready to ever spend $1600 on one though, even if it is ergo. Let's check it out.   Check out the AM Hatsu Ergo keyboard at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - I'm so ANGRY MIAO! 0:30 - Unboxing 1:00 - Exterior impressions 2:55 - What is Ergo? 3:20 - Keyboard layout 5:15 - Key switches 5:40 - Typing impressions 6:08 - Sponsor - SECRET LABS! 6:34 - Cyberboard and desk pad 8:35 - Wireless charging 9:50 - Connecting the keyboard 10:20 - Using the keyboard impressions 10:54 - Ergo thoughts 11:18 - RGB 12:02 - Function keys 12:46 - Final thoughts and impressions",
    "description_links": [
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MeDnY",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Am HATSU, its future art community because it comes with an NFT, I guess. It's $1,600. Am intrigued, probably gonna be so stupid, but okay, I'll check it out. I really liked the little high-fiving paw thing from the company, what's it called? Something miao, term miao. - [Jono] Angry Miao. - Angry Miao. Okay, I went to their website, tried to scope this thing out ahead of time. There was nothing, there was barely anything on the website. So let's just look at it. I bet this is actually the case you get, not just like a reviewer case. Squishy, cool, fragrant, but in an off gassy kind of way. It's a split key ergonomic keyboard. And now this is garbage, thanks. Angry Miao. (James purring) To get these open a bit and then your generic plastic on the inside. They had to, to keep it food safe. They're kind of heavy, I was hoping they would be even heavier. Oh, it's kind of white. So they made this with a 5-axis CNC machine and they think they're pretty cool for doing that. No one's ever done it before. Lots of thoughts immediately looking at this, but let's take our time here. Let's not get ahead of ourselves, David. What is going on, there's a bunch of weird stuff happening. Like what are these? Is that gonna be RGB? This looks badass. You will be cool if you have this, I didn't see an option on the website for choosing different key caps. I'm not sure everybody will like this kind of P green, depending on the color of your P. The legend actually is, has two colors. If you see the bottom of the key caps, there's some extra, there's an extra legend for secondary functions, which is great, which is cool, it's subtle. Are these non-skid? Yeah, there's some feet. So even off of the LTT Store desk mat there's, yeah, sufficiently non-skid, how about that? Basically the only criteria my wife was interested in when I proposed to her, is he sufficiently non-skid? No, I'm a skid. Whoa, I haven't actually touched these yet and they feel super like lacquered. They feel as shiny as they look, I'll say that. You kind of got this keywell thing going on where it's concave in both dimensions, which reminds me of the Kinesis Advantage2 Ergonomic Keyboard which itself was what $350 and that was expensive. This feels like it's heavier, it's metal and stuff. So it's maybe higher quality than that, or at least more premium looking but I'm not convinced yet that this is like more ergonomic solution or that they did more research than those other guys. Take note of this, what do you call this bed that they're all on? It's so cool and contoured, it's definitely all 3D printed and that looks really badass. This is a beautiful keywell, I'll say that. Now the reason this is split is so that your shoulders can be ergonomically placed. You can be out like this or in, you don't have to be like this or your mouse arm doesn't have to be way over here. So that's the deal with split. It also reduces ulnar deviation, which is when your arms go like that, because you don't have to, if this was super close together you might be like this, but you don't have to be. You can just go like this and be super ergo. The website said nothing about what key switches this thing comes with. It's a bit weird to begin with because your pinky is higher up than your, than I'm used to. You can see that even on the home row, these keys are at different levels. The K key is lower, it's sunken deeper than the J and L keys and that's because your middle finger typically is longer unless you're a psychopath or a genius. I don't know, I think there's a thing. Maybe women have different lengths or is it just the length of the ring finger? I don't know, I'm not an astrologer. Alls I know is my middle finger is longer so that key is farther away. And then when you, by the time you get to the pinky, that will, the semi-colon key there is even higher. So it's a bit of a weird feeling. There is a little notch on the J key for home row, which is nice to have, 'cause I wouldn't be lost on this thing. Feel a little foreign. The idea on this dimension though, the keys are all the same height basically and that's so when you, when your finger sweeps like that, you're reaching up, you're going back down, the key should be kind of within the same reach which is why they're curved like that. Next there's these thumb clusters. I'm a huge fan of thumb clusters on my keyboard, on my desk, I have all the thumbs doing all sorts of different things. And it's actually not that different from what they've set up here. So they have for, I would say the main, where would your thumb go by default. I guess they want your thumb to go here by default which is Space and Enter. I personally would do Space and Backspace 'cause I just backspace more than I Enter, but it's nice to have Enter. They do have both my main squad keys right here which I like, but then I don't really care about Control and Alt, those are a little farther away. System, Delete these dot buttons, who knows what they do. They're all here. The thumb buttons are really nice because you do a lot of work with your thumbs and you should be able to split them out rather than just having your like one buttoned space bar down there, just doesn't make any sense like we have a normal keyboards. These are linear switches. - [Jono] They're called Icy Silver Switches. - Icy Silver Switches, it says right on here TTC. - [Jono] Along with TTC's technical support. - Yeah, okay, they're TTC switches. They're linear, I don't know why. This isn't a gaming keyboard as far as I can tell, it's an ergo keyboard. I would think tactile or clicky would be better. Although as far as like RSIs go, I guess linear is kind of better. I don't know for pure typist, linear is not usually the way they go, but they still okay. They drop that easy to press down. I'm gonna pretend that this Enter button is a space. How about that? Wow, the pinky, you could get used to this pretty quick. I think within a few days, you'd be pretty much up to speed. USB C ports on the bottom. Is this like an Apple mouse like you can't charge it unless it's plugged in and unusable? Let's plug in and check it out right after this message from our sponsor. Secretlab chairs are engineered to keep you incredibly comfortable for long hours at work or at play. Their new Titan Evo 2022 Chair keeps you feeling comfortable for longer hours with their four way lumber support, ultra comfortable line of different seat material and more. All chairs come with up to a five-year extended warranty at a 49 day return policy. So head to the link in the description and checkout Secretlab chairs today. It's not a secret anymore. Now it's time to open another, oh, I was gonna do this with one hand but (James grunting) another box that I have. This is just a whole other ball of wax. Oh, it's actually just more keys guys. (people laughing) Just joking, oh, warning. This is also very fragrant in an off gassy way. It's a tablet, a mouse pad, desk mat, desk pad. First let's see the competition. This is a very basic desk pad with some cool blueprint looking schematics on it telling me where to place my key modules as well as the wireless charging area. So, it looks like they give you some latitude and being able to put your key modules along this axis and still have them wirelessly charge, which I guess makes the portal on the underside a little more accessible, but still kind of lame. That's where they go. Then there's these over here. I believe these are, hold on. Let's put this pip aside. Oh my God, (upbeat music) this obviously is meant to go on top of this, but it kind of just looks cooler without it, 'cause this is almost like a, it's almost like a leather phone case. You got some doohickey at the top here and this would be where you would plug into your machine with a USB C port. Non-skid bottom like the whole way. Yeah, that thing is pretty stable. And then a couple of peels, like these are basically the nipples of the product. Ooh, oh, what we're the only cable company in town? \"South Park\" guys. Did this even, I don't think it's, (James laughing) I don't think this even came with a cable, didn't even come with the charging cable. - [David] Are you kidding me? - Hold on, did I miss it? This is, this smells like an old banana peel. That is crazy. - [David] They're trying to be eco-friendly. - Activate, look at the lights. Did you see that? - [David] I did. - There's a flourish? Does that mean I can just start wireless charging right now? 'Cause my phone supports it. Boom! - [Jono] More light came on. - Over here? Ooh. - [Jono] It's on the other side. - Oh wow, this is (indistinct). So what's gonna happen to these little, I think these are light bars and I'm hoping they light up when I put this on here. Good, give me the RGB. Okay, you got some activity there. Oh, sick, there's like an under-glow. It's not, the light's not coming from where I thought, but right there that looks cool. So now we're charging. 5,000 milliampere-hours in each one. If I wanna extend the lifespan of those, I might unplug this mat once in a while because you don't wanna keep these charged at all times, but there's no switch on here, is there? Is there an off switch? If you want these to discharge, you have to just slide them off I guess, or unplug the whole thing. Currently there's another aspect of this which is these pucks, Cyber Coin designed by Angry Miao. No wire, yeah, we know you didn't even put it in the box. So that's gonna put it in this. Logitech Mouse sold separately. So that pops out. This goes in and now you, boom red. Ah, she dead, she's dead, Jim. Now we know that these change color according to battery life, that's nice. Can I just, how do I pair this thing? It doesn't come with a dongle. - [Jono] Bluetooth only I think. - Bluetooth only. They talked about it being super low latency though. Hold Circle button + Tab for three seconds to start pairing. I don't know if it means any Circle button or we gonna see it blinking blue or something like that. Something's happening. They got a light down here. Oh, there it is, HATSU. Yeah, we're in baby, I'm in. Control + Tab, ah, new tab. (James laughing) I'm Pickle Rick. This might actually be easier for someone coming from a QWERTY keyboard 'cause I have like all sorts of raw muscle memory. I don't know if I wanna learn it. I don't love the feeling of this. Like these are very heavy so they, they have a decisive like bottoming out, that aspect of is pretty nice. I would like to have different switches on here. Is this thing hot-swappable? Can I pull that switch out. But look how wiggly that is. My God, they're all lighting up. Stop it James. I must've put it into like reprogram mode or something. One thing that I don't like about ergo keyboards is that they're always so minimal. They don't have the F keys or a number pad often. And I'm not screwing around trying to learn how to go to the second function row. I'm not pulling out Alt and going into here. I'm not doing that. So that is why I use the one that I have at my desk. It's like the only ergo keyboard I know of that has thumb clusters and a bunch of extra keys. So I guess it's not RGB. There's just this white backlight. Do I have any options for turning it up and down and changing the pattern? Is there a Function key, function? Something I, look at that, you wanna light up this half the keyboard, you got to press the Function key. (James vocalizing) Output power three watts, wireless charging turns on when the battery is less than 85% and turns off when fully charged. There you go. You don't need to switch on here. All user input is error. It charges these when they're below 85, that's too much. It should kick in at like 40, but and then stop at 75, that'd be better, but whatever. I guess that's to make the compromise. So what if you don't wanna use this mat, you wanna charge them up and then peace out? Well then you'd use a cable. Yeah, I stand by my earlier assessment. Long press the left Circle SKP for five seconds to turn off both sides. (upbeat music) No, that wouldn't turn it off. It says both sides. All right, whatever, moving on, you can turn off one side. Circle + P to view the current battery level on the side of the light bar. Right, is this even on right now? (James grunting) Why is this blinking? I can't type though. It's like you have to have them both on to work. I guess it's not paired anymore. It says it's connected. It has 65% battery life but she do not type, no. Well, I can't really get it working. So I'm sorry. Wasn't gonna recommend you buy it anyway. But here's a couple of other things to talk about. Why isn't there enough room for this mouse? You gotta have to go over here to have enough room for your mouse. That's not an issue but again, that means if you're gonna wanna charge it then you kind of have to do it while you're not using it. Unless I guess you can get as far as there, this is workable. It's just clearly they didn't, like they wanted symmetry instead of a good design that accommodated a mouse. I would've liked hot-swappable switches. I would've liked something that worked. I would've liked the ability to customize the keys, at this price point, an online configurator tool would have been nice like the ErgoDox has, that one's awesome. You wanna be able to customize this stuff, that's the thing with ergo and in wanting to be able to go as fast as you can. Like they've done an okay job with the basic layout they've given us, but it's kind of redundant. Why do we need so many Control and Alt on keys for the thumbs? We could have used those for some of the functions that instead are on second layers. Of course you can remap any keyboard using free online tools, but they should definitely provide one. RGB I think a little more would be better. These strips are cool, but I kind of wish it was over here as well and I thought those are gonna line up, they don't. I think that's just for connectivity. There's some kind of feature where you can have multiple Bluetooth devices connect to the thing. It's not clear to me how that works. There's no information in the guide about it. This thing shouldn't be $1,600. It should be like five to 600, even 600 I'd be like that's a lot. But ergo keyboards themselves are often three, $400. Then you've got this big charging mat. That's cool, that's like a power play in itself and those are a couple hundred dollars, aren't they? - [Jono] Yeah. - Like 150 or something. - [Jono] But it doesn't even come with a USB C cable. - Doesn't even come with a USB C cable, they forgot that, okay? They meant to. And then the NFT it's just like go away. I still think the makers of this keyboard will be happy with this review because I think the thing they care about the most is the artistry and precision with which this was cut and designed. And I think the CNC and metal aspect of it is really badass. I think it's beautiful. Apparently this is a \"Westworld\" inspired aesthetic. They'd have that like at least twice on the webpage, whatever. I don't like the color they went with for the legend. I think that kind of serves to erode a lot of the other kind of deposits in the beautiful bank account they made. They just, I just wish it works. (James laughing) But for this, that's it. Save your Christmas money, get something else. NFT stands for no fricking techomandation from James. Get that? That's a tech recommendation, not today. Thanks for watching \"Short Circuit.\" If you liked this video hit Like, if you hated it still hit Like but then yell at me in the comments and watch our other videos about keyboards. Bye. Hello?",
    "transcript_keywords": [
        "key",
        "kind",
        "thing",
        "future art community",
        "Angry Miao",
        "keys",
        "miao",
        "keyboard",
        "cool",
        "guess",
        "Yeah",
        "switches",
        "mouse",
        "light",
        "thumb",
        "Function key",
        "future art",
        "art community",
        "key ergonomic keyboard",
        "desk"
    ],
    "transcript_entity_values": [
        "South Park",
        "49 day",
        "Rick",
        "three",
        "a few days",
        "One",
        "long hours",
        "less than 85%",
        "USB C",
        "Icy Silver Switches",
        "NFT",
        "a couple hundred dollars",
        "three, $400",
        "ErgoDox",
        "QWERTY",
        "150",
        "three seconds",
        "second",
        "Logitech Mouse",
        "65%",
        "Secretlab",
        "600",
        "Circle SKP",
        "today",
        "David",
        "Short Circuit",
        "Kinesis",
        "Space",
        "Control and Alt",
        "five-year",
        "Circle",
        "85",
        "two",
        "2022",
        "350",
        "five seconds",
        "75",
        "four",
        "longer hours",
        "linear",
        "Angry Miao",
        "F",
        "Westworld",
        "CNC",
        "RGB",
        "Cyber Coin",
        "1,600",
        "First",
        "Function",
        "James",
        "5,000",
        "Christmas",
        "Jim",
        "LTT Store",
        "Apple",
        "5"
    ],
    "transcript_entity_types": [
        "LOC",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "MONEY",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "LOC",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "TIME",
        "DATE",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}