{
    "id": "m5MkZC1uRZY",
    "title": "Mi Mix Teardown - Piezoelectric Speaker Test - Screen Replacement",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-11-21T14:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=m5MkZC1uRZY",
    "category": "Howto & Style",
    "tags": [
        "Mi Mix tearown",
        "Xiaomi Mi Mix",
        "Disassemble Mi Mix",
        "How to take apart mi mix",
        "how to fix mi mix",
        "Mi mix",
        "Assemble mi mix",
        "Charging port fix",
        "Mi Mix screen replacement",
        "Piezoelectric speaker",
        "piezoelectric",
        "Crack screen Mi Mix",
        "Ceramic Mi Mix",
        "Xiaomi"
    ],
    "views": 1039851,
    "likes": 20575,
    "comments_count": 1037,
    "description": "Ever wonder how the Xiaomi Mi Mix is assembled? What parts can be replaced on the newest Xiaomi phone? How hard is it to replace the screen on the Mix... and most important, if you drop your phone and crack the ceramic sides... can the frame of the Mi Mix be replaced?  In this video I talk about the Piezoelectric earpiece speaker inside the Mi Mix. Instead of your standard earpiece, this phone has a little vibration motor inside. Its not even where the earpiece should be, but more along the side of the phone next to the frame.   Awesome Smart Phone Tool Kit:  Green Pry tool:  Phone opening metal tool:   Overall I think the Mi Mix is a fantastic device as far as innovation goes and definitely a step in the right direction as far as 'futuristic devices' go. What do you think? Would you buy a bezel-less smart phone?  Mi Mix DROP TEST Video is HERE:  Mi Mix Durability test is HERE:   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://youtu.be/VeLKqjvmFvQ",
        "https://youtu.be/_CZj-l9MJmg",
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/1R7Ltic",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "Its time to tear down the Mi Mix the new bezel-less smartphone from Xiaomi. As you can see this phone has no earpiece. Ill explain how and even let you hear the audio quality of a phone call later in this video as well. Lets see what this thing is made of. [Intro] Remember that this whole phone is made out of ceramic, a super hard and brittle material that scratches at an 8 on Mohs Scale of Hardness. Because of this, this back is actually pretty hard to remove. Even though there is no adhesive, it is held in place by a series of snaps and since the frame and back dont flex, my thin pry tool struggles to get inside. I was eventually successful though and the back panel pops right off. Its nice not having to use a heat gun for a change. The fingerprint scanner has an accordion style ribbon cable attaching it to the motherboard so be careful not to rip that. There are 10 regular Philips head screws holding down the plastic shield over the main board. Keep your screws organized and Ill be linking a tool kit and replacement parts in the video description of this video. Once that protective plastic is off the main board we can unclip the fingerprint scanner just like a little Lego. Then the rear flash and camera lens on the back panel are also replaceable at this point. It is important to disconnect the battery first. Then we have the screen ribbon on the left, and the front camera and the power button ribbons, and the extension ribbon for the charging port all unsnapping like little Legos. This clear plastic is also the earpiece right here along the edge, and Ill get to that in just a second. To remove the 4300 milliamp hour battery it has some of the magical pull tabs at the bottom that easily slide out the adhesive from underneath the battery. Unfortunately these are also very easy to break and if they do break, you must commence the pry of shame, taking immense care not to puncture or bend the battery during this prybecause the batteries do catch fire when punctured. Also watch out for these extension ribbons underneath the battery if youre wanting your phone to still function after the battery removal. Heres the rear 16 megapixel camera for the Mi Mix, and judging by the fact that the lens does not move around inside of its housing like on the Galaxy or newer iPhones, Im going to say that it does not have IOS which is unfortunate. Xiaomi has used OIS on some of their other phones though. One more wire cable to remove and then there is a little screw holding in the vibrating piezoelectric earpiece. I should have taken out the SIM card tray before I started this teardown, but sometimes I get a little too excited. The motherboard is held down by a little latch on the top left corner so unclip that and the motherboard pops out. Now you can see where the processor sits and some of the thermal rubber stuff to help the heat dissipation. Lets look at this piece of electric speaker. This is the thing that makes noise by vibrating the actual frame of the phone. So during a phone call, no matter where your ear is along the frame on either side, front or back of the phone, you can hear sound emanating from the device. Its rather weird. I knew the most asked comment in the comments section would be Hey Jerry! How does this vibrating earpiece sound? So, dont worry. Im going to let you hear it for yourself. So this is what the earpiece sounds like from the iPhone 7. This is the standard earpiece that has a little tiny speaker inside and this is what most every Android and iPhone have inside of them. And this is what the Piezoelectric speaker sounds like inside of the Mi Mix. This speaker is making sounds by just vibrating a little bit. It doesnt actually have a speaker inside of it like most other phones do. So now you can tell the sound difference between the two phones. While both speakers are clear and understandable, to me the Mi Mix sounds a little bit like the other person is on speaker phone when they actually arent. But its still a pretty cool invention and its fun to see innovation in the cell phone world. The charging port shroud is held down by 5 more screws. Ill remove that. The shroud has a loud speaker attached to it as well. Unclip two more ribbon cables and the signal wire and we get to look at the bottom microphone and the USB-C charging port. Its nice that the charging port is replaceable. The 5 megapixel front facing camera is also down here at the bottom of the phone, strangely enough, and it has the longest ribbon cable that I have ever seen attached to a camera. It wraps all the way up the side phone to the main board above the battery. Pretty crazy. One of the things I mentioned during my drop test video was that the ceramic frame of the phone would be damaged easily during drops. The good news is that the frame is absolutely replaceable, with 12 silver screws holding it in place it can pop off from the frame of the screen. Replacement parts for this phone are going to be hard to find since this phone is limited production, but its good to know that Xiaomi is planning for the future if they mass produce ceramic phones. The frame is replaceable. Very smart. They really need to include a rubber barrier between the frame and the screen though to minimize damage transferred to the front glass during drops. Speaking of the screen, this is it. It is adhered to the mid-frame and hopefully Xiaomi will sell replacement screens already attached to the mid-frame, but if they dont, youll have to remove the old display from the mid-frame and attach the mid-frame to the new screen. Ill link any replacement parts that I find in the video description, but like I said before, they are going to be difficult to find. Ill get those 12 screws around the ceramic frame in place, and then the charging port can go back in its slot. Down here at the bottom microphone holes, most of them are for decoration. The mic only fills one hole so make sure that particular hole is never plugged up. Get that wire cable plugged in along with the two ribbons next to it and the front facing camera. The plastic loud speaker and its 5 screws go down on top of that, then the piece of electric speaker gets set down before the motherboard does. There is a little pin and a screw hole that guide it in place. The motherboard can be set down after that. Clipping in the wire cable, the extension ribbon down to the charging port, the screen ribbon, and the power button ribbon, and the front camera ribbon. Then the rear camera can also get snapped in, and finally, the battery. Before putting the protective plastic layer in place, make sure that the fingerprint scanner is also clipped in just like a little Lego. 10 screws later and you can take the ceramic back and snap that into place. Make sure that the phone is working first because getting the back panel off if you forgot something is a real chore. Overall the Xiaomi Mi Mix has a solid build. The earpiece is very interesting and Im super glad that the ceramic frame can be replaced. I wish the camera had OIS, but at least the phone is good looking. My channel is full of teardown reviews like this one. Bonus points for following me on Instagram and Twitter. I post my behind the scenes stuff over there. Thanks a ton for watching! Ill see you around.",
    "transcript_keywords": [
        "phone",
        "frame",
        "ribbon",
        "speaker",
        "camera",
        "battery",
        "back",
        "charging port",
        "Ill",
        "Mix",
        "screws",
        "earpiece",
        "phones",
        "Xiaomi",
        "screen",
        "charging",
        "port",
        "inside",
        "time to tear",
        "bezelless smartphone"
    ],
    "transcript_entity_values": [
        "iPhone",
        "8",
        "Lego",
        "Instagram",
        "IOS",
        "two",
        "4300 milliamp hour",
        "Philips",
        "Jerry",
        "the Mi Mix",
        "the iPhone 7",
        "SIM",
        "10",
        "5 megapixel",
        "5",
        "iPhones",
        "Piezoelectric",
        "the Mi Mix",
        "first",
        "second",
        "Xiaomi",
        "Android",
        "12",
        "16 megapixel",
        "One",
        "Galaxy",
        "one",
        "Twitter"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PERSON",
        "EVENT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "ORG",
        "FAC",
        "ORDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}