{
    "id": "m8lsUvil_S8",
    "title": "My Investment is in TROUBLE - HP repairable laptops",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-11-01T18:18:48Z",
    "video_url": "https://www.youtube.com/watch?v=m8lsUvil_S8",
    "category": "Science & Technology",
    "tags": [
        "HP 845",
        "HP",
        "Hewlett Packard",
        "Laptop",
        "AMD",
        "AMD CPU",
        "Repairability",
        "Sustainability",
        "Thin and Light",
        "AMD Laptop",
        "HP Laptop",
        "Linus Tech Tips",
        "LTT",
        "Gaming"
    ],
    "views": 1725655,
    "likes": 71520,
    "comments_count": 3835,
    "description": "Thanks to HP for sponsoring this video! you can learn more about the HP 845 G9 at:   For years, theres been an unfriendly trend of replacing socketed, swappable components like RAM and SSDs for ones that come soldered to the motherboard. Great for keeping device thickness to a minimum, but not so great for reparability. Lets see what HP did to buck that trend.  Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:57 Opening up the laptop 3:19 The goodies inside 5:17 Speakers and raving with crabs 5:31 Removing the battery 6:57 Removing the fan and headphone jack 7:38 Ports on the laptop 8:36 Philips #0 is my friend now 10:45 Reassembly 13:00 Conclusion 13:38 Outro",
    "description_links": [
        "https://bit.ly/3ztZIJp",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- You would think, being an investor in Framework, that I wouldn't be down to accept HP's sponsorship to show off the repairability of their Elitebook 845 G9. But the truth is that this repairable laptop has a lot going for it that my Framework doesn't. For one thing, HP's sales and distribution network mean that it's available wherever you might need it, and for another, it's got an AMD Ryzen CPU, and that's on top of it being highly user repairable, with parts and detailed guides available to help you through the replacement of everything from the touch pad to the headphone jack to the entire display assembly. All right then, HP, you wanna sink my investment or what? Okay, I'll play ball. Let's see what you got. (upbeat music) Full disclosure, that wasn't just a bit. I am indeed personally invested in Framework laptops to the tune of 225,000 US dollars, and it was a little over a year ago that I ended my original review of the Framework laptop by saying, the only reason other companies can't do this, and Framework proved it, is because they don't care. That's a problem. Chucking a device in the e-waste bin because of one small flaw should be something that we try to avoid at all costs, because everything about the design of this AMD Ryzen powered Elitebook 845 G9 really does seem to be rooted in long service life and sustainable choices. The first sign that HP is really listening comes before we even make it to the device itself. The box is sustainably sourced. And once we open it up, the Elitebook 845 G9's lightweight but durable chassis uses recycled aluminum throughout, and they're using post consumer recycled plastics in the bezel and the keycaps. Speaking of that aluminum chassis, it's time for us to crack it open and find out exactly how repairable these things are. I'm going in pretty much completely blind here, so I guess we're gonna learn together just how easy this laptop is to work on, and we've got one of literally every single part that they offer on their online store to replace. By the way, another aspect of this whole serviceability angle that HP is taking is that if I wanted to cheat and research how to swap everything beforehand, their YouTube channel has proper guides for everything that I'm about to do, for this and actually tons of their other devices. By the way, right out of the gate, I love this. It's something that we've seen on the past few generations of HP laptops. Just five captive screws is all it takes to get inside, and as small as it is, this decision means a lot. Every extra screw or rubber foot that's in the way of someone opening up a laptop is another potential point to give up and not choose repair, or if you're a service tech who's working with a big deployment of these, every screw is 15 more seconds, maybe dozens of times a day, costing you hours of your precious actual life. So bottom line, I really like this no-nonsense approach to getting inside. We're off to a good start. Now that we're in here, under this heat pipe is the star of the show. This laptop is powered by an AMD 6850U, which is an eight core 16 thread Zen 3+ chip fresh out of TSMC's advanced six nanometer fab. This thing boosts up to 4.7 gigahertz in a laptop this thin. It wasn't that long ago that AMD laptops were dismissed for their poor performance, poor battery life and subpar connectivity, particularly their lack of Thunderbolt support. But all of that has changed now. Ryzen 6000 is tremendously efficient, and this model from HP implements AMD's new support for USB4, which can do up to 40 gigabits per second of throughput and tunnels a PCIe signal, meaning that you should be able to plug in previously Intel exclusive Thunderbolt peripherals, like external GPU enclosures, super fast external game drives, or single cable laptop docks. Weirdly enough, we actually have Microsoft to thank for this level of PCIe support. They are mandating that any laptop that can come with Windows 11 must have advanced PCIe support on all exposed USB4 ports. So thanks, Microsoft, I guess. This NVMe drive is a Gen four unit from Samsung. Ours is 512 gig, but that's user configurable. And this little Wifi 6E card here is from Qualcomm. How cool is that? The RAM shield has a little tab. Adorable. (Linus grunting) Woo! 216 gig kits, also Samsung memory, running at 4800 mega transfers per second. Interestingly, HP is actually offering an unusual level of customization in their builder, and they're charging sensible prices for upgrades. 32 gigs of RAM costs the same, whether you prefer a single stick for future expansion or two for better performance and dual channel. Very sensible. Over on the sides, we'll find a couple of two-watt 4Ohm speakers. Not terribly fancy, although they are tuned by Bang and Olufsen and can actually get surprisingly loud. (dance music plays) These don't really need to come out, but they make it easier to get at the most commonly replaced component, this 51.3 watt hour battery. Screws on one side, clips on the other, and I haven't even had to change my screwdriver bit yet. All number one Phillips up until now. Let's see how long we can keep that gravy train rolling. Out of the box, HP boasts that it can go from zero to 50% charge in only 30 minutes, and rates this bad boy at up to 19 hours of use. That's solid. But as you guys know, batteries wear out over time, and I'm pleased as punch that this one could be swapped out in under 10 minutes by even a novice user. If you're not into replacing batteries, I would suggest employing HP's battery life manager software. It automatically maintains an optimal charge level, which is especially useful if you leave your machine plugged in or unplugged for long periods of time. This is the point in the disassembly process that even if you've taken apart a bunch of different models of laptops from a variety of manufacturers, you can start to feel a little bit lost or uncertain. But kudos to HP, I can still clearly see all of the screws that I need to access in order to remove the rest of the components on this laptop and it's these little touches that prove that repairability and serviceability was a high priority during its design. Oh, interesting. The fan is not actually even taped. No adhesive even between the fan and the heat sink. So these pieces can and should then be, ooh, replaced independently. Cool. Here's another really nice touch. Have you ever had something get stuck in your headphone jack? I mean, it's obviously more common with phones with pocket lint and all that. But they can still wear out from regular use, and the fact that this daughterboard is so easily replaceable means that you will never be stuck without audio again. This part costs $26. Reasonable. Also on the daughterboard is a five gigabit per second USB Type-A port, and space for an optional SIM card slot that we don't have on our model. If we did, there would also be a mobile data card for us to remove from here, just below the fan. Moving over to the other side, there's also an optional SmartCard reader, which we do have installed, a couple of those fancy 40 gigabit per second USB4 Type-C ports I mentioned earlier, both with power delivery and display port 1.4, along with another five gigabit per second Type-A port and a full sized HDMI 2.0b. It's starting to look kinda empty in here, and we can take it even further. The fingerprint sensor, ah yes, here you are, comes out. Don't break, please. Please don't break. You just pull out, okay. Well, there's your fingerprint sensor. The realtime clock battery uses no screws at all, and the touch pad has just seven screws around the perimeter. (Linus gasps) We finally had to change the bit in the screwdriver. That's okay, I understand why. These are very very tiny little screws, so we're gonna use a Phillips zero. This little boy comes out, but is a little bit tricky because this cable right here is actually adhered to it, so we just gotta, oh boy. Oh, oh okay, oh that's not that bad. That's not permanent adhesive or anything. And then we also need to pull out this boy. Easy peasy. The battery is super easy to remove too, but we're not going to take that out because it makes life more difficult. We'll have to go back into the bios and adjust a whole bunch of settings and I don't feel like it. Now that the touch pad's out, we can take a closer look at it. It's got a glass surface and it's massive. A big part of that is actually because of the screen, so I'll explain in a moment. Let me take these final hinge screws out and we can talk about the screen. Boop. Lttstore.com, they're finally shipping. (Linus gasps) I'm just gonna give it a little one of those and a little (Linus groans). It's fine. And there's the display assembly. That's right, the reason the touch pad is able to be so big is the aspect ratio of the display. The excellent 16:10 that I and that guy, hey Alex, 16:10, yay or nay? - Yes, good. - Exactly. You get a little more height compared to 16:9, which means whether you're gaming or browsing or video editing, you get that extra 120 pixels of vertical space that can be an absolute godsend for your toolbars, for your extra video tracks or whatever it is you need. Behind the display assembly is HP's five megapixel webcam, complete with auto framing, infrared for Windows Glow and a physical camera shutter, as well as the hub board that powers both it and HP's dynamic noise leveling microphone array. To HP's credit, while this does use clips and adhesive, the replacement parts are available individually, even for different variants of the screen. So if you actually wanted to change out the screen, you could. And with that, we've actually run out of parts to remove from this thing. As they say in the automotive world, reassembly is the reverse of disassembly, which means it's time for us to undo everything. (funky upbeat music) Oh yeah. Script says, \"Success, it still boots.\" Looks like we got ahead of ourselves a little bit there, we don't actually know that for certain. Here we go. Yes! Okay, good. That was pretty impressive. It wasn't that long ago that this level of user serviceability was mutually exclusive with having a device this thin and with such a nice design language. HP hasn't compromised on any of those things here, which leads us to our conclusion. The benefits of a device that is reparable and upgradeable like this one cannot be overstated. When deployed at scale in a commercial settings with dozens, hundreds or even thousands of users, the techs that actually have to work on them will be infinitely thankful to have someone at HP in their corner, fighting for simplicity in design and maintenance. There are other benefits for commercial users as well, such as HP Wolf security and HP Sure View Screen Privacy, which isn't to say that you can't pick up one of these for home use if you wanted to. The socketed RAM, Wifi and SSD are all wins, and while HP's parts store appears to show that everything is out of stock, they told us that this is a bug and replacement parts are in fact available to both companies and to individuals to order, so hopefully whatever that is going on right now will be sorted out by the time this video comes out. While you're at it, by the way, HP, pictures please. Service manuals, as I mentioned before, are readily available in the product support portal. You don't even have to create an account or do anything like that, so kudos to that. And you can cross reference those to find the right part numbers for replacement pieces, but it's nice to have peace of mind, especially as an end user, by being able to compare the thing that's in your hand to an actual photo on the website. So, sponsored or not, if you want this level of performance coupled with a dash of genuine serviceability, your shortlist is, well, incredibly short. HP hasn't committed to future motherboard upgrades or anything like that, but it is absolutely easy to maintain. We're gonna have a link in the description if you guys wanna play around with their configuration tool, and they even offer FreeDOS as an OS option. So, bottom line, for $2000, if HP keeps this up, niche laptop makers may struggle to catch up and other big manufacturers may need to step up and follow suit. If you guys enjoyed this video, you might also enjoy the video where, oh I don't know, we water cooled a Mac Studio. Yeah, that was fun. Not really very much like this video, but definitely fun.",
    "transcript_keywords": [
        "Framework",
        "Framework laptops",
        "laptop",
        "AMD Ryzen CPU",
        "accept HP sponsorship",
        "AMD Ryzen",
        "AMD",
        "screws",
        "investor in Framework",
        "laptops",
        "Framework proved",
        "bit",
        "AMD laptops",
        "parts",
        "video",
        "AMD Ryzen powered",
        "Ryzen powered Elitebook",
        "touch pad",
        "time",
        "life"
    ],
    "transcript_entity_values": [
        "26",
        "one",
        "HP Wolf",
        "16:9",
        "AMD Ryzen CPU",
        "second",
        "2000",
        "a couple of",
        "Windows Glow",
        "first",
        "Just five",
        "SSD",
        "Thunderbolt",
        "zero to 50%",
        "eight",
        "Success",
        "51.3 watt hour",
        "HP",
        "a little over a year ago",
        "32",
        "Phillips",
        "Thunderbolt",
        "216",
        "1.4",
        "up to 40 gigabits",
        "Olufsen",
        "USB4",
        "GPU",
        "seven",
        "Gen four",
        "Qualcomm",
        "Alex",
        "a Mac Studio",
        "16",
        "Framework",
        "4.7 gigahertz",
        "Elitebook",
        "five",
        "120",
        "up to 19 hours",
        "Framework",
        "Windows 11",
        "6850U",
        "five megapixel",
        "Lttstore.com",
        "RAM",
        "Elitebook 845 G9",
        "five gigabit per",
        "six nanometer",
        "4Ohm",
        "AMD",
        "jack",
        "3",
        "Bang",
        "USB Type",
        "dozens",
        "only 30 minutes",
        "thousands",
        "hours",
        "225,000 US dollars",
        "15 more seconds",
        "2.0b",
        "40 gigabit per",
        "YouTube",
        "Ryzen 6000",
        "AMD Ryzen",
        "Linus",
        "hundreds",
        "under 10 minutes",
        "TSMC",
        "Microsoft",
        "two",
        "Intel",
        "Samsung",
        "4800",
        "512"
    ],
    "transcript_entity_types": [
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "TIME",
        "MONEY",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ]
}