{
    "id": "m8QWxJhna8Y",
    "title": "The Biggest Problem you've never heard of - and how to fix it.",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2024-09-28T17:44:58Z",
    "video_url": "https://www.youtube.com/watch?v=m8QWxJhna8Y",
    "category": "Howto & Style",
    "tags": [
        "Orphan well plugging",
        "well done foundation",
        "oil drilling",
        "fossil fuel",
        "methane",
        "co2",
        "co2e",
        "oil field",
        "climate change"
    ],
    "views": 674972,
    "likes": 34263,
    "comments_count": 1991,
    "description": "We've stabbed the planet over 3 million times... and its time to do some fixin'. Unlock next-level power for every scenario with EcoFlow's new DELTA 3  and RIVER 3 series!    Enjoy @EcoFlowTech exclusive preorder offer! Get a Free DELTA Bag on orders that include an EcoFlow DELTA 3 Plus, use my code EFDRJERE5 for an extra 5% off on DELTA 3 Plus and RIVER 3 standalone valid until October 25th.  EcoFlow DELTA 3 Plus:  EcoFlow DELTA 3 Plus on Amazon:  EcoFlow RIVER 3 on Amazon:  Check out EcoFlow Prime Day Sales on other products:   Learn more about the Well Done Foundation HERE:   THE EARTH IS LEAKING - How to plug an Orphan Well?  #EcoFlow #EcoFlowDELTA3Plus #EcoFlowRIVER3 #PortablePowerStation #SolarGenerator #ReadyIn30 #HomeBackup #StartSmallPowerStrong #Outdoor #SolarPowerPart",
    "description_links": [
        "https://bit.ly/4efZlV0",
        "https://bit.ly/4dgRTrx",
        "https://bit.ly/4efZlV0",
        "https://bit.ly/3XB0Shh",
        "https://bit.ly/4dgRTrx",
        "https://bit.ly/3zsCV3S",
        "https://www.welldonefoundation.org/"
    ],
    "transcript": "Someone was standing right here 100 years ago looking for oil. They drilled a hole in the ground 1,500 ft deep, and were extremely successful in finding it. Pumping that black gold out of the ground for decades. However, when the oil ran out, what happens more often than not, is that these companies, these operators go bankrupt. They scrap the equipment on top leaving an extremely deep hole in the ground exposed to the outside air. Which might not sound like a big deal at first, but it's not just oil down there. There's methane, natural gas, or even crazy stuff like hydrogen sulfide that can kill a man with a single breath. Worker: We got a match? Zack: That was a joke for legal reasons. Worker: Kidding! Zack: Which is why I have my handy dandy H2S monitor right next to my breather hole. All those gases are seeping out right now as we speak into the very air we breathe. Every hour of every day of every year for four decades. And it's not just this one which is leaking, or these ones which are leaking. The EPA reckons that there are over 3 million of these abandoned leaky orphan oil wells spread out all across the United States. 3 million! You can see the methane coming out of this hole is moving the tissue paper, and without plugging this hole this methane is leaking out every single minute of every single day. Night and day all year long. It's actually a pretty big deal and a really hard problem to solve, but I think we have a solution. I reached out to Ecoflow to see if they would help me and the Well Done Foundation solve at least one of the wells. They sent over an Ecoflow Delta 3 and an Ecoflow River 3 recently released and extremely portable to help us get the job done. Along with helping to cover a significant portion of the well plugging cost. So, thank you Ecoflow for sponsoring this video. The first step is quantifying exactly how much methane is leaking out and what that means in terms that regular humans can understand. One of the reasons why we have a temporary cap over the open well is so that we can consolidate the methane that is leaking to a single valve, and we can measure that methane. And of course the measuring setup we have right now is being powered by the Ecoflow Delta 3 coming from the small valve on top of the tube running through this cable. And from this well behind me we are seeing emissions of almost 250 grams per hour of methane. Which is almost like 55 tons per year. Which if we were to put into terms that are easier to understand over the course of 20 years plugging this single well is the equivalent of taking 1,000 cars off the road, or planting nearly 200,000 trees. And the effects are immediate since we can plug this hole in as little as a few days. This is what it looks like without that temporary orange cap, but these metal lids don't last forever. And sometimes they're even missing parts that let all that methane escape. We have the Ecoflow Delta 3 powering this test, and we have the Ecoflow River 3 doing something a little more interesting. So normally this truck is running and is connected to an inverter to power the Starlink so we have internet access out here, but today instead we've hooked it up to the River 3. So down here is the inverter that normally powers the Starlink while the truck is running, but the Ecoflow River 3 looks like Starlinks pulling around 100 watts, and we can run it for a couple more hours. River 3 is extremely portable and helps us leave the truck off while we're out here running our tests, and the Starlink internet access point is right there. Now that we have our emissions and measurements let's get back to plugging the well. That is what a 100 year old oil well shaft looks like. That definitely needs plugging. To keep the gas from leaking out of the well permanently we can't just start shoveling in dirt and hope to fix the problem. Dirt is permeable and will still let the gas escape, albeit it just a little more slowly. The plug has to be non-permeable cement just like the rock that was there before, and we have to pump that cement all the way to the bottom of the shaft first. So there's no chance of gaps, cracks, or air pockets forming that could compromise the plug. Since gas has a way of seeping through even the tiniest of fissures. These 30 foot sticks of metal tube going into the shaft are that straw that will help us get the concrete to the bottom. Worker: This is the most expensive Hefty bag you'll ever see in your life. So we count how long it fills up takes to fill up got it! Time! We this right that down right up here so what we do, did in the old day, and we use this in the field all the time to just do a quick down and dirty measurement of what we're looking with that way we don't have to drag a whole bunch of stuff along with you right. Low tech high reliability. Zack: The toxically gnarly fumes exuding from this shaft are nearly 80 times more potent or polluting from an environmental standpoint than CO2 that comes from your car's tailpipe. The same way you don't want to sit in a garage with your car running you most definitely don't want to leave a gas fireplace or stove on unlit. Since either of those situations can cancel the rest of your birthdays. So right now we're at the top of about 750 ft of pipe I think we're halfway there. Such an incredible amount of gas is coming out, and it's like the smell of it how like? Worker: Money. Zack: It smells like money. How would you describe the smell of it? Worker: Huh? Gassy. Zack: Gassy. You can see the gas coming out of the top of this tube and it smells extremely flammable it's a little bit different than say the gas coming out of your stove, but it's the equivalent of the same gas coming out of your stove. Natural gas itself doesn't have a smell to it, but this stuff since it's been underground for a billion years smells like very very old dinosaurs. I'm going to get out of the way so they can continue continue working and I uh maintain what brain cells I have left. The EPA estimates that all the orphan wells in the USA combined emit the CO2 equivalent of about 7 to 20 million metric tons per year or about 2 to 5 million cars worth of exhaust. Just pumping those fumes into our planet sized garage. One way to help offset the issue would be to plant a literal 1 billion trees, or you know and maybe you know this is just a thought. The oil industry could clean up a little better after a lucrative oil well runs dry. We got lucky with this particular orphan well that there were no obstructions all the way down to the very bottom. However we do have to clean it out before the cement can arrive and we do this with 3,000 gallons worth of water. Pumping it into the same straw we installed earlier. Like a brontosaurus sized enema. Any oil residue collects on top of the water and gets ejected out into the little swimming pool that we dug earlier. Definitely smells like oil. Can we get another one? You first. And on the third day in the early morning. Just like Gandalf and Lord of the Rings. The cement pumping calvary has arrived driving to the middle of this farmer's field to fill up the entirety of the well shaft with impermeable cement. It requires three semi trucks. The truck with the blue cab is holding a bunch of water, and the truck with the white cab is holding a bunch of powdered cement. Both ingredients get pumped to the middle truck which adds some calcium chloride, an accelerant for curing, and pumps it deep into the hole using the straw that we set in earlier. Since we have that straw poking down into the well we're able to pump the concrete from the bottom up and it will displace all the water that we put in there earlier. All of it flowing out to this containment pond that we dug with the excavator. The containment pond will make the oily water easier to clean up cuz it's consolidating to one spot. We have to pour the concrete in segments so the bottom plug dries first before we can add the rest of it, and while we're waiting for that to dry let me show you the Ecoflow Delta 3. Having power out here in the middle of nowhere without needing to run a generator has been awesome. The larger Ecoflow Delta 3 plus has six AC outlets on the front and four USB ports with a 1,024 watt capacity and 18,000 Watt output ability. Just like a normal wall outlet that you would find in your house. With X boost enabled it can H 2,200 Watts with brief surges up to 3,600. If an appliance has a hard start or needs lots of juice to ramp up, and not that it matters a whole lot out here in the middle of nowhere but it is super nice that it's quiet. This Delta 3+ can charge from 0 to 100% in 56 minutes from a normal wall outlet or you can hook it up to 1,000 watts worth of solar panels and charge up from the Sun. We're out here using the Delta 3 Plus on the oil fields, but if you're planning on using it at home, on the app, you can put it into something called time of use mode. Where it charges up at night, when the energy is cheap, and runs your appliances during the day when energy is expensive. It can fully charge and discharge 4,000 times while still maintaining 80% of its battery capacity. The Delta 3 Plus can be expanded with an extra battery pack and be used as a UPS an uninterrupted power supply with a 10 millisecond response time. The River 3 is designed to be much more portable it's definitely the most cost effective entry-level power station. While still being extremely durable IP54 water resistant and surviving drops up to 4.9 feet. It has a much smaller 300 Watt output 600 with the X boost. Which is still plenty for Starlink, lights, fans, or air pumps. It also has the same UPS auto switch ability as the Delta 3, for small servers, computers, or security cameras. With a total capacity of 245 watt hours. It can charge with a 100 watt solar panel in about 2 and 1/2 hours, or from a wall plug in about 60 minutes. The River 3 has two AC Outlets three USB ports. If you want to pick up either of these I'll leave a link down in the description if they can survive plugging an oil well in Montana I'm pretty sure they'll survive your camping trip. Now that the bottom plug has had a few hours to dry let's get the rest of the cement down into the well. We put in about 2,000 lbs worth of cement already, but we have another 6 and 1/2 1,000 lbs to go. This well has been drilled extremely deep and might be why it's leaking so much methane, or was leaking so much methane since the concrete is going to stop it. The cement is very viscous to flow down into the tube before it hardens and we don't add aggregate we want this to be as smooth as a milkshake. Filling up every possible nook and cranny, so that no gas can escape. Voids are something we're trying to avoid. You might be like hey Jerry, why aren't we capturing that methane so I can scramble my eggs on my gas stove in the morning? And the answer is even though it's leaking there's just not enough of that gas seeping out to be economically viable. Infrastructure here is built for oil not gas, and this well has been sitting orphaned open to the taking for three decades now. There's definitely no more money to be made from this particular well. This orphan well along with 3 million others is leaking enough to be a hazardous nuisance, but gas isn't valuable enough to warrant collection. Which is why we have to clean it up. The first best time to plug an oil well is right when it's abandoned. The second best time to plug an abandoned oil well is today. As the sun sets on the third day the well is officially sealed and plugged the cement is poured all the way down to the bottom all 1,400 ft of it and no methane will be escaping this hole ever again. One down 2,999,999 left to go. Huge thanks to Ecoflow for sponsoring this video and helping make the world a slightly cleaner place. If you need more power in your life I'll leave a link for the Delta 3 and the River 3 down in the video description, and thanks a ton for watching. Ill see you around.",
    "transcript_keywords": [
        "Ecoflow Delta",
        "Ecoflow River",
        "Ecoflow",
        "gas",
        "Delta",
        "oil",
        "methane",
        "River",
        "leaking",
        "cement",
        "hole",
        "larger Ecoflow Delta",
        "plug",
        "gas coming",
        "day",
        "extremely",
        "bottom",
        "watt",
        "Starlink",
        "Time"
    ],
    "transcript_entity_values": [
        "56 minutes",
        "100 years ago",
        "18,000 Watt",
        "two",
        "the Well Done Foundation",
        "3,000 gallons",
        "1,024 watt",
        "about 2,000 lbs",
        "1,500 ft",
        "a few hours",
        "about 2 and 1/2 hours",
        "nearly 80",
        "CO2",
        "Starlinks",
        "1 billion",
        "600",
        "Sun",
        "Gandalf",
        "about 60 minutes",
        "the United States",
        "100 year old",
        "first",
        "the Delta 3",
        "20 years",
        "up to 4.9 feet",
        "about 750",
        "the Ecoflow Delta 3",
        "Zack",
        "USB",
        "These 30 foot",
        "the day",
        "the third day",
        "1,000",
        "Watts",
        "at least one",
        "The River 3",
        "The Delta 3 Plus",
        "H2S",
        "300 Watt",
        "Jerry",
        "3,600",
        "AC",
        "night",
        "3 million",
        "about 2 to 5 million",
        "the Delta 3 Plus",
        "a billion years",
        "Rings",
        "Montana",
        "nearly 200,000",
        "almost 250 grams per hour",
        "0 to 100%",
        "80%",
        "four",
        "six",
        "three",
        "2,999,999",
        "1,400",
        "245 watt hours",
        "2,200",
        "the early morning",
        "Ecoflow Delta 3",
        "calvary",
        "EPA",
        "100 watt",
        "Ecoflow River 3",
        "USA",
        "a couple more hours",
        "second",
        "decades",
        "about 7 to 20 million metric tons",
        "One",
        "Starlink",
        "1,000 watts",
        "almost like 55 tons",
        "Every hour",
        "10 millisecond",
        "every single minute",
        "IP54",
        "the River 3",
        "three decades",
        "four decades",
        "Starlink",
        "Night",
        "the old day",
        "today",
        "AC Outlets",
        "4,000"
    ],
    "transcript_entity_types": [
        "TIME",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "PERSON",
        "TIME",
        "GPE",
        "DATE",
        "ORDINAL",
        "EVENT",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "LOC",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "DATE",
        "ORG",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "TIME",
        "ORG",
        "GPE",
        "ORG",
        "QUANTITY",
        "ORG",
        "GPE",
        "TIME",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "TIME",
        "NORP",
        "LOC",
        "DATE",
        "DATE",
        "GPE",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL"
    ]
}