{
    "id": "m9Q9hpDaUFQ",
    "title": "The Best Instagram Camera Ever Created",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-08-09T16:00:15Z",
    "video_url": "https://www.youtube.com/watch?v=m9Q9hpDaUFQ",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "dxo",
        "dxo one",
        "one",
        "dxo camera",
        "dxo iphone",
        "camera",
        "best camera",
        "2016",
        "cool gadget",
        "cool gadgets",
        "iphone 7",
        "iphone 6",
        "iphone 6s",
        "iphone se",
        "6s",
        "6s plus",
        "ios",
        "lightning",
        "apple",
        "iphone",
        "best",
        "smartphone",
        "apple iphone",
        "iphone 6s plus",
        "phone",
        "video",
        "apple iphone 6s",
        "invention",
        "innovation",
        "crazy",
        "plus",
        "inventions",
        "things",
        "new inventions",
        "cool",
        "amazing inventions",
        "awesome inventions",
        "ipad"
    ],
    "views": 2221060,
    "likes": 48435,
    "comments_count": 3034,
    "description": "(   ) --- Today's Mystery Video -  DxO One (USA Link) -  DxO One (International Link) -   The DxO One is a lightning port attachment for your iPhone. The DxO One offers a f1.8 lens and a 20 megapixel 1-inch sensor. This is one of the more expensive iPhone accessories I've ever featured. That said, the images are quite impressive.  From the manufacturer -  The DxO ONE attaches to your iPhone and transforms it into a professional-quality connected camera. Featuring a 1-inch format 20.2 megapixel sensor and a high-quality f/1.8 lens, it captures amazing images, even in low light. The companion iOS app turns your iPhone display into a beautiful viewfinder and gives you full control over the cameras settings.  Connect the DxO ONE to your iPhone and its display turns into a big, beautiful viewfinder. Swivel to shoot at any angle. Plus, it has its own memory card and battery so it wont drain your phone or steal its storage.  The DxO ONE packs the power of a high-end camera into a size that's always by your side and ready when you are. Our advanced image processing automatically enhances every image you take.  Weighing less than 4-ounces and standing well under 3-inches tall, DxO ONE is built to fit in your pocket, so you can capture lifes magic without lugging around your DSLR.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/DTK4eRzcRyI?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://amzn.to/2aCZIss",
        "http://geni.us/eNmEO",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Your phone. You use it. Possibly as your primary camera these days. Even though they've kind of advanced to this point of having really amazing cameras, considering their size, they are still not gonna replace a Digital SLR. They're not gonna replace the camera that Jack is using to see all this right now. Look at that thing, look how thin that is, I mean, that -- find me a professional camera that is that scale right. It's just not gonna happen. So, maybe, you wanna step your game up. But maybe, you don't wanna give up some of the functionality of your phone and your instant shareability. That's where this thing comes in. This thing is not cheap. Be warned, this thing is not cheap. The DxO One - Professional quality connected camera. It fits into the lightning port of your iPhone. You're getting a 1inch sensor. 1inch. An f/1.8 lens. This is stuff you're used to talking about with professional photography equipment. It captures raw files. So if you want to manipulate them and edit them later, that's the way to go. What does this mean for you in Instagram professional, so to speak? Might be you. Well, you know what, it is you. Little seal. Okay. Holy unboxing experience right now! Wooh! Look at the way they did that! So the manual's right on here. That's the camera. Woah! Wow, that is really intense. Just open up, Jack, see if you can catch that when I do that. Wooh! A Micro-USB cable to keep things charged up. Power brick. A micro-fibre cloth or carrying case. We're gonna find out. Cloth. Ooh. Luxurious. We've got an iPhone over here. You can see the battery life and it's telling me it has no memory card, so this takes Micro-SD cards. When you pull the lens cover down, seems like it's ready to function, but you need this lightning connector out, so what you do is you pull down a little further, push down, and there's like a little clasp that then ejects the lightning connector. Now to put it away is the same. Hold down, push it in, let go, and it locks. I can kinda pick my angle and this acts as my shutter button, right up here. Got a Micro-SD here. The DxO One app gives you control, good. Auto mode or manual. Aperture ISO speed, essentially all the camera settings you'd be used to in a more professional camera. First off, I'll do a shot in auto mode. Ooh. This is insane image quality. From what you're used to seeing on your phone. So, here, in full manual mode, you have access to shutter speed, ISO, aperture. Blow out the background, have it nice and smooth and out of focus. People use the term 'Bocca' for that. Dude, these photos are insane. Have a look at this. Holy! This selfie is scary high-calibre right now. Ha ha! You're gonna want to see me like that. The fact that I can share a photo of that calibre immediately, and not having to go in, pull it off a camera, put it on to a computer, potentially edit it and so on. I can just throw this into an editing app if I want or just share it right like that. And that's another level right there. Most of you are gonna think if you snap a photo of that you're gonna end up with the entire thing in focus. Now I just want to show you how with the shallow depth of field you can completely change this scenario from a creative stand-point. That's the look that's really tough to achieve with a small sensor and a small camera lens. So, creatively, there are options here. If you were out and about with this kind of setup, the things you can do creatively just go to the next level.",
    "transcript_keywords": [
        "camera",
        "thing",
        "professional",
        "professional camera",
        "Digital SLR",
        "phone",
        "things",
        "lightning",
        "Jack",
        "kind",
        "mode",
        "lens",
        "pull",
        "manual",
        "ISO",
        "replace",
        "Instagram professional",
        "primary camera",
        "cheap",
        "Wooh"
    ],
    "transcript_entity_values": [
        "Wooh",
        "Digital",
        "these days",
        "One",
        "ISO",
        "Bocca",
        "Micro-USB",
        "First",
        "DxO",
        "1inch",
        "iPhone",
        "Micro-SD",
        "Jack",
        "Instagram"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG"
    ]
}