{
    "id": "M9tfueBGRTs",
    "title": "Is there something wrong with my heart? - Withings ScanWatch Horizon Hybrid Smartwatch",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-06-30T21:00:59Z",
    "video_url": "https://www.youtube.com/watch?v=M9tfueBGRTs",
    "category": "Science & Technology",
    "tags": [
        "withings",
        "wearable",
        "watch",
        "smart",
        "heartrate",
        "workout",
        "fashion"
    ],
    "views": 475579,
    "likes": 18695,
    "comments_count": 1556,
    "description": "Thanks to Withings for sponsoring this video! Learn more and get your own Withings ScanWatch Horizon Hybrid Smartwatch today at:   Withings.com -  Amazon -  BestBuy.com -   Analog watches are plain, but most smart watches only have a one day battery life... Luckily, Withings has a solution that blends the best of both worlds while providing a lot of health insights, so Linus wore the ScanWatch Horizon to see what all the hype is about!  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 0:26 Unboxing and first impressions 1:15 What makes Withings special 1:32 Testing out the ECG Sensor 2:54 Testing the bood oxygen sensor 3:11 Other cool features 4:41 App overview 5:51 Other conveniences 6:14 Overall thoughts 6:38 Outro",
    "description_links": [
        "https://www.withings.com/shortcircuit",
        "https://lmg.gg/withingsAZ",
        "https://lmg.gg/withingsBB",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- If you're anything like me you've probably been pretty frustrated by the state of the smart watch market over the last five years. But Withings reached out and sponsored this video to show off their ScanWatch Horizon which is a very different kind of smart watch. It's different in that most of it, I'd say a solid 80% of it really isn't that smart. Huh, nice by the way. The one on my wrist is the ScanWatch and I've been using that for a few weeks but the one that we're gonna talk about today is the ScanWatch Horizon whose claims to fame are several actually. It's validated to double the depth of water resistance compared to the regular ScanWatch. It's larger and much more premium looking and feeling. I actually got a lot of comments on the blue one when I was wearing it for, I guess, I yeah, I had it for a couple of weeks. And thanks to its metal band it has a much sort of heavier feel on the wrist that I know a lot of people prefer the green one. Oh wait, I thought you told me the blue one was the one that was sized to my wrist. - [Jono] I thought so too. - Well, the blue one was the one I was wearing. I know that for a fact, but the green one actually fits really well. Oh, you know what? My right and my left wrist are extremely different. Can actually see the whole arm is very different, That's badminton arms for you. Right, on that subject. Let's talk about what makes a Withing ScanWatch really special. They've got a clinically validated SPO2 sensor as well as a clinically validated ECG sensor. At a moment's notice we can take an ECG. Let's go ahead and set that up. We've gotta activate this feature before we can use it. But the wizard includes some really valuable information about what the ECG sensor can and cannot do. So what it does do is detect whether or not your heart rhythm is normal, which can be an indicator of underlying medical conditions and can be an important tool in your toolkit to monitor your general cardiac health and not detect heart attacks and other medical conditions. So what they're saying is it only does what they say it does. Don't read too much into it. And as always consult a medical professional whenever there's anything concerning an important organ like say for example, your heart. I'm not in a state so I guess let's pick a cool state. How about Nebraska. - Nebraska? (men laughing) - What? Why you hating on Nebraska? Nebraskans, are you gonna take that? - [Brandon] Sorry, Nebraskans. - First let's take your ECG. The interface is super easy to use by the way, one button and a scrolling wheel and that's pretty much it. By the way, you don't have to say that you're starting a workout. It'll actually detect your workouts with a reasonable level of accuracy. It managed to confuse go-karting with riding a bike at one point, but overall it's actually been pretty solid. (upbeat music) And that's it. 30 seconds later they've collected the data they need, after 24 to 48 hours, where it gets reviewed, it will be sent back and will be available within the app. Ooh, the other big one is the ability to check your blood oxygen saturation level. Basically just put your hand on it. 30 seconds, BRB. You can also just have it monitor it during your sleep which is a lot more convenient (laughs). Does a nice little buzz when you're done. 98%, yes. Honestly speaking though, for my part, the cooler features of the smart watch are things that help me day to day. Like the fact that the battery life is a month. Like that's one of my big problems with every freaking smart watch out there, is that you end up charging these things every day or in many cases running out of battery on the same day. I remember I had a watch that I was wearing for quite some time and I didn't even have it connected to a phone because I don't use that brand of phone. And I would still have the battery run out during the day sometimes. I'm sitting here going, \"It's not even connected via Bluetooth. What is happening here?\" I also love being able to (mumbles)... I've got my heart rate (indistinct). It's getting all elevated right now. (laughs) It's going up even higher. I also really appreciate being able to tell the time anytime I want. Now you can configure the ScanWatch to use a gesture in order to activate the display. You can press a button to activate the display or if you're a super smart boy or a lady then you can just read the analog time. Wow. Amazing right? What an innovation. Setting the time on it is super easy. That's kind of cool. I'm not gonna show it because that's something that I did before the video but basically you just set up the app. The watch hands just all point to 12 on their own like kind of creepy magical. And then you're like, \"Yep, it's pointed at 12.\" And then if it doesn't work which it didn't on the blue one. When I first set it up, then you can say, \"No, it's not pointed at 12.\" You turn the dial, point it at 12, and then it like, mm mm mm, yep, aligns. And then it goes to exactly the right time. This one, honestly, I think looks better personally. Oh, I guess we could talk about their app a little bit. You can select which applications you want to receive notifications from. You can see summaries of your workouts as well as your daily steps. (upbeat music) You can see my trends. I've been doing pretty darn well on my steps lately, which is pretty sick. My workouts too. I've been moving. So that's why basically every day I'm doing something that counts as a workout. Yes. Go Linus. (man laughs) You can log your food intake. Man, now you guys got all this information about me. Best day, 15,000 freaking steps. What did I do on Monday, May 16th? Basically there's lots of useful little things in here and I like that it doesn't bother you a ton, unless you tell it to, it's not gonna be like \"Breathe.\" \"Yes, I'm breathing, now isn't a good time.\" The kind of thing that just for me personally absolutely drives me up the wall... Oh, couple little things I didn't mention. The tah tah tah tah tah, outer bezel rotates if you're into that sort of thing, and the hands are glow in the dark. which they're not on the regular ScanWatch. It syncs with major health apps like Google Fit, Samsung Health, Strava. Oh, and the glass is Sapphire glass, which I have not been successful at scratching yet. So that's definitely a good thing as well. I think the selling points here are pretty straightforward. You got the clinically validated SPO2 and ECG sensors. You've got the very traditional looking watch that actually functions like a freaking watch but also has smart functionality. I think a lot of people just want that alone, even if it didn't have any kind of health monitoring features. And of course the actually very robust and useful app. So what are you waiting for? The ScanWatch Horizon is available on amazon.com, withings.com, we're gonna have that link down below. So guys, go ahead and check it out. Thanks Withings for sponsoring this video. Thanks to you for watching. Go ahead and get subscribed.",
    "transcript_keywords": [
        "ScanWatch Horizon",
        "ScanWatch",
        "watch",
        "ECG",
        "smart watch",
        "smart watch market",
        "smart",
        "day",
        "tah tah tah",
        "Horizon",
        "tah tah",
        "pretty",
        "time",
        "ECG sensor",
        "tah",
        "kind",
        "watch market",
        "blue",
        "wrist",
        "validated ECG sensor"
    ],
    "transcript_entity_values": [
        "Sapphire",
        "a couple of weeks",
        "ScanWatch",
        "Withings",
        "Nebraskans",
        "the day",
        "98%",
        "Withing ScanWatch",
        "Google Fit",
        "80%",
        "one",
        "the same day",
        "Nebraska",
        "a few weeks",
        "the last five years",
        "ECG",
        "15,000",
        "SPO2",
        "amazon.com",
        "30 seconds",
        "daily",
        "The ScanWatch Horizon",
        "Strava",
        "Brandon",
        "a month",
        "first",
        "Monday, May 16th",
        "Samsung Health",
        "24 to 48 hours",
        "ECG",
        "ECG",
        "12",
        "Linus",
        "ScanWatch Horizon",
        "Nebraskans",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PERCENT",
        "ORG",
        "WORK_OF_ART",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "LOC",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "FAC",
        "ORG",
        "PERSON",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "FAC",
        "GPE",
        "DATE"
    ]
}