{
    "id": "MavPj0DFFFk",
    "title": "Apple has no shame…",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-08-11T01:16:59Z",
    "video_url": "https://www.youtube.com/watch?v=MavPj0DFFFk",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Apple",
        "RCS",
        "Google",
        "GetTheMessage",
        "Rich Chat Services",
        "iMessage",
        "Google vs Apple",
        "Android",
        "iOS",
        "Android vs iOS",
        "iOS 16",
        "Apple RCS",
        "iMessage Android"
    ],
    "views": 560304,
    "likes": 29982,
    "comments_count": 1081,
    "description": "Get $25 off all pairs of Vessi Footwear with offer code techlinked at    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 is the tech news in the room right now 0:05 Google tries bullying Apple 1:08 Galaxy Z Fold 4, Flip 4, Watch 5 Pro 2:26 CHIPS and Science Act 3:10 Vessi Everyday Move 3:45 QUICK BITS 3:50 RTX 4070 leaks 4:29 Google Fiber's back baby 4:55 LG TV vibrates display for sound 5:27 US Treasury sanctions Tornado Cash 5:54 information encoded in ink  FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://www.vessi.com/techlinked",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/YVEas",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- You can't see the tech news directly, but don't worry, it sees you. - [Man] It's in the walls! Google is once again trying to convince Apple to adopt support for Rich Chat Services, or RCS. A term that only Android people know. They're using good old fashioned public shaming to do it. RCS would allow Android and iOS users to send messages using most of the features found in iMessage, which Apple staunchly refuses to bring to Android. You, you're a green bubble? Google's argument, therefore, is that it's on Apple to fix texting, which they're now proclaiming with a whole website dedicated to calling out Cupertino and tweets with the #GetTheMessage. Yeah. No, Google, they get the message. That's not the problem. They want the experience of being an Android user in a group chat to suck. This is like trying to explain to the opposing basketball team that if you work together, you could make more baskets. - [Man] Come on, guys. - It's unlikely Apple's going to listen to, or be affected in any way by Google's whining anytime soon. I mean, they've been pretty busy working on adding the battery percentage back into iOS. - [Man] Yeah. They forged their own path. - [Man] They're making things better for us. - They listen to Apple users. Samsung Unpacked some new phones, smart watches, and earbuds at an event this morning. But if you were hoping for devices of the rigid variety, buddy, you can flip the flip off. - Flip you, dude. - Flipper. Flip your mother. The Galaxy Z Fold4 comes with upgraded cameras, better durability, multitasking improvements, and wider displays so it actually looks like a phone when it's folded up and not a car GPS from 2006. Design changes on the Z Flip4 are less noticeable with a slimmer hinge and a straighter edge. It does have the new Snapdragon 8 Plus Gen one, a larger battery, and faster 25 watt charging. But none of that probably matters to the bubblegum bunk cotton candy people that they're marketing to. Samsung also announced the Galaxy Watch 5 and Watch 5 Pro, confirming design leaks from last month with new infrared temperature sensors, longer battery life, and better durability. The Pro is bigger and more rugged like me. Lastly, the Galaxy Buds2 Pro have improved ANC, a sleeker design, and support for a Hi-Fi 24 bit audio using what else? Our proprietary Samsung Kodak that will only work on select Galaxy devices. But the best part, they come in purple. That'll play great on TikTok. - [Man] That's an unusual color. - Burple? That's a little bit of a blue tinge. And US President Joe Biden has officially signed the chips and science act, promising $52.7 billion in funding over the next 10 years for semiconductor production after much ballyhooing from some industry players worried that Intel would get too much of it. You guys are worried about Pat? He's a great guy. Give him some money. Let the good guys win. It's hoped that the package will allow the US to compete with China who are investing big time in their own chip making capability. But the act also sets aside 200 billion for scientific research. So even if China ends up winning on the processor front, the US still has a chance to beat them to building the first dinosaur theme park. - [Man] Science can do it. We'll do it good this time. Not like the movie. - Now it's time for the quick bits brought to you by Vessi. Maker of footwear known for being lightweight, easy to pack, comfortable, and most importantly, waterproof. Are you always on the move? Then Vessi's Everyday Move shoes are just for you, especially if you like enhanced breathability, added support and a pull tab for easy on and offing. 'Cause you're an old man now. And shoes that are made creature free so that every step you take is guilt free. If your feet could talk, among all the weird things they'd say, they would say a big thank you for wearing these shoes. So say goodbye to wet socks and save 25 bucks with our offer code Tech Link at vessi.com/techlink. - [Man] I wish I could talk to my feet. - Go away, Quentin. Give the quick bits to me, baby. Ah, ah, ah. Compulsive GPU specs leaker, Kopite7kimi, I really wish he'd have a easier name. - [Man] Kopite. - After all the same. Kopite7kimi has relapsed again, claiming on Twitter that NVIDIA's upcoming RTX 4070 will arrive with faster memory and a boost clock as high as 2.8 gigahertz. Granting it the same compute power as the RTX 3090 TI. That sounds pretty tasty, but is it tasty enough to make potential buyers hold off buying the RTX 30 series GPUs now? I don't know, but it does taste pretty salty. - [Man] It's supposed to take it with salt 'cause it's a rumor. Did you get that? - Take it with some salt. I'm getting arc. Google halted expansion of its fiber internet service back in 2016. But the tech giant says they're now in talks to roll out to Arizona, Colorado, Nebraska, Nevada, and I don't know, Idaho. But why now? Is Google frightened by the guy building his own fiber ISP who's now serving over 70 customers? That guy's in Michigan, Google. You're so weird sometimes. - [Man] What are you thinking? - 70 customers. He's not a threat. LG has taken a page off Sony's book, specifically the one about building TV's that vibrate the display to produce audio instead of dedicated speakers. But unlike Sony's vibrating models, LG says they're 97 inch OLED EX TV can produce 5.1 channel sound for a cinematic level of immersion. - [Man] It's like I'm there. - It's a bold claim and probably only partially true, but I would've said the same thing a few years ago if you told me my TV panel would directly be giving me good vibrations. Science is amazing. - [Man] You're saying it wrong. Viberating. Viberating. - Viber? Okay. Blockchain technology stores every event in a public ledger, which has led to the creation of cryptocurrency mixers that anonymized transactions. Unfortunately, this can enable money laundering so the US Treasury has sanctioned popular crypto mixer, Tornado Cash, which the treasury says has been used to launder more than $7 billion. What are you, Nancy Pelosi's husband? Privacy advocates are understandably upset so consider this your regular reminder that you can't always have your cake and eat it to. And in case you didn't believe science was great, look at these University of Texas at Austin researchers that encoded and encrypted copy of the novel, \"The Wonderful Wizard Of Oz,\" into ink using specialized polymers. They wrote a letter to another researcher at the University of Massachusets who extracted the ink and decoded the novel. His review, somebody says something racist in this. Hey, that's all the tech news we got. So come back on Friday for more. What do you think we are? A tech news machine? No, we skip Thursdays. We can only do so much.",
    "transcript_keywords": [
        "Google",
        "Apple",
        "Android",
        "Rich Chat Services",
        "Galaxy",
        "tech",
        "Apple users",
        "Android user",
        "Rich Chat",
        "convince Apple",
        "flip",
        "Pro",
        "good",
        "RTX",
        "RCS",
        "science",
        "Android people",
        "Galaxy Watch",
        "guys",
        "guy"
    ],
    "transcript_entity_values": [
        "the Galaxy Buds2 Pro",
        "Idaho",
        "2006",
        "RCS",
        "TikTok",
        "25 bucks",
        "the University of Massachusets",
        "ISP",
        "Intel",
        "Cupertino",
        "Pat",
        "The Wonderful Wizard Of Oz",
        "97 inch",
        "US",
        "one",
        "Nebraska",
        "NVIDIA",
        "5.1",
        "treasury",
        "70",
        "Google",
        "3090 TI",
        "Thursdays",
        "ANC",
        "Quentin",
        "last month",
        "Arizona",
        "Samsung Kodak",
        "a few years ago",
        "Twitter",
        "Austin",
        "Samsung",
        "as high as",
        "Friday",
        "Joe Biden",
        "China",
        "LG",
        "Rich Chat Services",
        "iMessage",
        "Viberating",
        "first",
        "Galaxy",
        "Sony",
        "Nancy Pelosi's",
        "the US Treasury",
        "Android",
        "these University of Texas",
        "Nevada",
        "GPU",
        "the Galaxy Watch 5",
        "$52.7 billion",
        "30",
        "Snapdragon 8 Plus Gen one",
        "200 billion",
        "Colorado",
        "Michigan",
        "25 watt",
        "this morning",
        "the next 10 years",
        "a Hi-Fi 24",
        "The Galaxy Z Fold4",
        "2016",
        "2.8 gigahertz",
        "4070",
        "Apple",
        "Vessi",
        "more than $7 billion"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "WORK_OF_ART",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "GPE",
        "GPE",
        "QUANTITY",
        "TIME",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "PERSON",
        "MONEY"
    ]
}