{
    "id": "mavrdYZPg0Q",
    "title": "BlackBerry KEYone Durability Test - SCREEN FAIL!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-06-08T15:00:25Z",
    "video_url": "https://www.youtube.com/watch?v=mavrdYZPg0Q",
    "category": "Howto & Style",
    "tags": [
        "BlackBerry",
        "Keyone",
        "Blackberry keyone",
        "Key one",
        "new blackberry",
        "Android",
        "iphone",
        "Blackberry",
        "Smartphone",
        "technology",
        "review",
        "unboxing",
        "tech",
        "how to",
        "blackberry screen",
        "screen falling off",
        "screen detach",
        "black berry",
        "test",
        "blackberry keyone review",
        "blackberry 2017",
        "crackberry",
        "blackberry priv",
        "flagship",
        "shelf of shame"
    ],
    "views": 6437062,
    "likes": 78291,
    "comments_count": 6271,
    "description": "BlackBerry KEYOne is the latest 2017 flagship from Blackberry. Recently released and its already having a huge problem. Running Android, this new smartphone has some pretty awesome and unique features, like a full fledged keyboard. But what about hardware? Blackberry was previously known for incredibly durable phones... will Blackberry let this new screen flaw haunt their new line of devices? Or are they going to add some adhesive under the display to fix the problem? Hopefully Blackberry will take care of any customer that has a display detaching issue with their device.   Current pricing on Amazon: (DONT LEAVE BAD REVIEWS, unless you actually own the phone.)  Here is a link to two threads talking about screen detaching:     Cell Phone Replacement Parts:  Awesome Smart Phone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/2r91M3g",
        "https://forums.crackberry.com/blackberry-keyone-f445/keyone-screen-has-come-off-after-small-drop-1109491/",
        "https://forums.crackberry.com/blackberry-keyone-support-f468/keyone-screen-coming-apart-after-only-light-use-1110376/",
        "https://goo.gl/8e9zgI",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "The BlackBerry KEYone: barely released here in the United States a few days ago. This is the latest and greatest flagship from BlackBerry; one of the oldest smartphone manufacturers in the business. BlackBerry peaked back in 2013 before Android and the iPhone became the main players. Lately though, BlackBerry has been dipping its juicy fingers into the Android operating system. And that brings us to this KEYone. It does feel heavy in my hands so were off to a good start. Lets see how this new phone holds up to my durability test. [Intro] This is a completely brand new retailed device purchased right here in the United States. Ive tested about 70 different smartphones now, and like always, we start with the scratch test. The screen of this KEYone is a very humble 4 and half inches, but Ive been told that gets the job done just fine. My Mohs picks do a great job differentiating between glass, tempered glass, plastic and sapphire. Plastic is a 3. Sapphire is an 8 or a 9 on the scale. Lately we see most flagships using tempered glass, which lands at a level 6. And this rectangle slab of Gorilla Glass 4 scores exactly the same hardness level we would see on a Galaxy S8 or and iPhone 7. So far this BlackBerry is holding up pretty well to its competitors. Whats cool about this satisfying clicky keyboard is that its touch sensitive, so you can control the up and down, left and right scrolling of the screen without actually touching the glass itself. Its kind of fun. Even with the extremely heavy scratching from my razor blade, more than you would ever see in everyday life, the scrolling functions still work. So you will never have to worry about leaving your keyboard exposed. Thumbs up for that. Speaking of thumbs, the fingerprint scanner is cleverly hidden in the spacebar of the KEYone and its the next part to get tested. Even with heavy scratches on the surface of the fingerprint scanner, it is able to read and scan my fingerprint and unlocks the device on every single try. So far, so good. The front 8 megapixel camera is up here at the top. And this lens is made from glass along with the opaque lens on the other side with the proximity sensor; both are made from glass. One slightly underrated feature on smartphones these days is the dual toned flash. If you ever have to use the phone in the dark, the dual tone provides a much better image than one with just a single color white flash. This is covered by plastic but thats pretty normal on all flash LEDs. The rear 12 megapixel camera is covered with glass as well; pleasant upgrade from the plastic lens on the BlackBerry Priv. It also has a thick metal ring around the outside to help protect it from rubbing up against the inside of your pocket or purse. That pocket sand can be pretty vicious. The back cover is made out of a thin grippy rubberlike material. A BlackBerry in real life is actually a type of aggregate fruit which means that its composed of tiny little individual fruits called drupes. Drupes are the little juicy circles surrounding the actual seed of the berry. BlackBerry, the phone company, chose the name BlackBerry because all of the little black keys on their keyboard resembled the drupelets on the blackberry fruit. The same drupelets you see in their logo. See, its a blackberry. The cover is surprisingly resistant, even to my razor. If you key the KEYone, nothing happens either. The sharp edge of my coin was able to scrape it up a little though, but that was with a lot of pressure. Normal wear and tear wont hurt the surface of this back panel. And the sides of the KEYone are made from sweet sounding metal. The power button is also made of metal. And up here by the headphone jack there is a plastic end cap, but Im not going to complain about plastic because Im just happy the headphone jack is still there. The rest of the silver top surrounding the headphone jack is the quality metal, including over here on the front of the phone where the earpiece is. BlackBerry did a good job of future proofing the KEYone with the USB-C port at the bottom. And now the burn test. This has become increasingly more relevant now that Trump has pulled the USA out of the Paris Climate Agreement. Things are going to heat up rather quickly and it will be nice to have a cell phone that can handle the temperature. Im sure Donald will be watching my videos to see which phone allows him to Tweet the longest while the world burns. This phone lasted about 16 seconds, which should fit his attention span just fine. The good news is that the phone did completely recover. There might still be hope. And now the bend test. Testing the overall build quality of a phone is essential to the people who want a phone that will survive everyday life, and unfortunately this BlackBerry KEYone was not a survivor. I was even holding the screen when it popped out of the frame. It surprised me to see the screen do that since most other screens, like Samsung, have so much adhesive behind them it takes a high powered heat gun or industrial hot plate to remove them. And this BlackBerry screen is held in by nothing. A quick bend from the other side, and at this point my screen stopped functioning entirely. One, the power button was kinked since the glass was adding zero structural support without that strong adhesive. And two, with the screen lifting up like it is, the first thing to tear is that ribbon cable at the bottom of the display. The whole thing can be removed entirely by hand because there is zero adhesive holding it in place. No visible adhesive around the edges or under the LCD of the screen. Nothing. A quick Google search revealed that Im not the only one who has this problem. One guy dropped his phone on the center console of his car and the screen popped off. And another guy woke up with a detached display, which is completely believable if the displays are actually shipping with no adhesive under them. This is a legitimate problem. Luckily for BlackBerry though, it is very easy to fix and Id be more than happy to make another video if BlackBerry ends up correcting this manufacturing oversight. So hit that subscribe button if you want to stay updated on this situation. Ive tested about 70 phones now; most of them are build very well and those that fail end up on my Shelf of Shame. Only 6 phones in 2 years have failed my tests. And since my BlackBerry KEYone is not currently functional, it is going with these 6 phones on my Shelf of Shameuntil BlackBerry gets this figured out at least. It really does seem like an easy fix, so hopefully they will take care of the problem and their customers. If you already own one of these phones, maybe grab a case that surrounds the lip of that glass screen. Ill pop the back off the phone for kicks and giggles. The black PCB board is creative. Im a fan of that. And theres a BlackBerry logo on the battery. It would have been pretty easy for them to slip some wireless charging in here as well, but I think Ive complained enough for one day. Come hang out with me on Twitter and Instagram. Thanks for watching. Ill see you around.",
    "transcript_keywords": [
        "BlackBerry",
        "phone",
        "glass",
        "BlackBerry KEYone",
        "screen",
        "United States",
        "KEYone",
        "barely released",
        "phones",
        "plastic",
        "made",
        "adhesive",
        "BlackBerry screen",
        "Android",
        "tempered glass",
        "test",
        "glass screen",
        "United",
        "States",
        "pretty"
    ],
    "transcript_entity_values": [
        "Google",
        "8 megapixel",
        "iPhone",
        "about 70",
        "Trump",
        "6",
        "Only 6",
        "Donald",
        "Instagram",
        "two",
        "jack",
        "Mohs",
        "6",
        "BlackBerry KEYone",
        "Twitter",
        "12 megapixel",
        "zero",
        "a few days ago",
        "about 16 seconds",
        "the United States",
        "The BlackBerry KEYone",
        "USA",
        "this BlackBerry KEYone",
        "Shelf of Shameuntil BlackBerry",
        "one day",
        "first",
        "Sapphire",
        "PCB",
        "8 or a 9",
        "Samsung",
        "KEYone",
        "Android",
        "these days",
        "2013",
        "BlackBerry",
        "3",
        "One",
        "2 years",
        "iPhone 7",
        "4 and half inches",
        "the BlackBerry Priv",
        "the Paris Climate Agreement",
        "one"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "TIME",
        "GPE",
        "ORG",
        "GPE",
        "LAW",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}