{
    "id": "mDFR1QK-ZRU",
    "title": "This works underwater! - Tribit StormBox Micro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-09-08T19:09:03Z",
    "video_url": "https://www.youtube.com/watch?v=mDFR1QK-ZRU",
    "category": "Science & Technology",
    "tags": [
        "Tribit",
        "Bluetooth",
        "Speaker",
        "Bluetooth 5",
        "Audio",
        "Battery",
        "BTS10",
        "Outdoor",
        "Water",
        "Underwater",
        "Works",
        "Unboxing",
        "Linus",
        "Range",
        "Hiking",
        "Strap",
        "USB-C",
        "party"
    ],
    "views": 318970,
    "likes": 17371,
    "comments_count": 690,
    "description": "Thanks, Tribit for sponsoring today's video! Enter to win a Tribit StormBox Micro Bluetooth speaker at   Bluetooth speakers aren't exactly new, but having one that can work underwater can be a fun party trick!  20% OFF Code: MICROSCT1   US: $34.99  CA:  $55.99  Tribit Official:    15% OFF EU Code: MICROSCT2 UK: 33.99   DE: 39.09    FR: 39.09   IT:  39.09   ES: 39.09   Valid Time:  09/07/2020 7:00 AM PDT - 09/13/202011:59 PM PDT    Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://bit.ly/3jOVIJh.",
        "https://www.amazon.com/dp/B07VSPPQXC",
        "https://www.amazon.ca/dp/B07VSPPQXC",
        "https://bit.ly/32AmcHj",
        "https://www.amazon.co.uk/dp/B086BS83P7",
        "https://www.amazon.de/dp/B086BS83P7",
        "https://www.amazon.fr/dp/B086BS83P7",
        "https://www.amazon.it/dp/B086BS83P7",
        "https://www.amazon.es/dp/B086BS83P7",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Today's unboxing is sponsored by Tribit, and this is the StormBox Micro. It's a super compact battery-powered Bluetooth speaker that apparently offers surprisingly strong bass for its size, wow, it is really small. And is apparently both dust and water-resistant up to IP67. It's got a, oh, this is an interesting feature, it's got a strap on it that, that is actually pretty well-designed, check that out. So it comes off just like that, based on how easily it came off I was really expecting it to not hold on very well, but it kind of clips on there. And then if you put it over your backpack strap or whatever else, it's like, I'm gonna try and rip it off, 'cause I've actually got two of them as you guys might've noticed here. Just 'cause it's sponsored doesn't mean I can't try really hard to break it. That's pretty good, I like it. Okay, cool, so power button's here. Got your Bluetooth pairing button here, it charges via USB Type C. They claim that it has eight hours of battery life. Mind you, That is going to as always be dependent on the type of content you're playing, how loud you're going. Around this side they've got the anchor point for that included strap. And up here, we've got volume down, volume up, and whatever the crap this button does, I guess we'll figure that out soon enough. Let's power it up. By the way, guys, check 'em out at the link in the video description because they are actually giving away 20, that's right, 20 of these. We're also gonna have the link to where to buy down there as well. So when you first power it up you get a little indicator for how much of your battery is left, it looks like this one's fully charged and I think it popped straight into Bluetooth pairing mode. I like that, I like and appreciate that when a device just goes, hey, you're turning me on for the first time. You know what, I don't want to finish that sentence, reminds me too much of my wife. Ey, got 'em. Let's play some music that we have licensed to have in our videos. Laszlo, Supernova. Actually, he did a really cool video about the making of this song that you guys should check out over on YouTube, It's way more complicated than I thought, okay, that's really loud, just a moment here. Okay, hold on a second, Brandon. Okay, I'm gonna do my best impression of that dude on every hiking trail with absolutely no consideration whatsoever for anyone else. How do I look? - [Brandon] Exactly like that guy. - But do I sound like that guy yet? Not quite, okay, hold on, let me fix it. (\"Supernova\" by Laszlo) Okay, now do I sound like that guy? (\"Supernova\" by Laszlo) That's pretty loud, not bad. Like, this is loud enough for you and your whole hiking group and everyone else on the trail to enjoy it. There, that's a far more reasonable listening volume at about 20% there for personal enjoyment. Not bad, definitely a far sight better than your phone. It's funny, who was it that just recently advertised a new phone as like, you know, having powerful enough speakers that you wouldn't need a Bluetooth speaker? As long as compact Bluetooth speakers like this one exists that's obviously nonsense. Of course, I mentioned the poolside, but I haven't actually demonstrated the pool side yet. Jono! - I can't get through. - My pool, please. - [Jono] I'm gonna go from the back. Oh, God, Jono's going from the back. It's Bluetooth 5.0 and I think there's like a multi-play feature that's supported with that so it might not actually need an app. We'll find out, we'll check it out. So yeah, I've got two of them. Okay, so I'm connecting the second one now. Blah, blah, blah, yes pair. Listened together, you can play sound on two Bluetooth devices at the same time. (\"Supernova\" by Laszlo) Look, you can make your own headphones. You just need a strap. But how well can you make noise underwater? Now to be clear IP67, actually, yeah, I think that's rated for submersion, isn't it? - [Jono] It's water-resistant. - Water resist, well yeah, I mean everything's water resistant, nothing's waterproof. I mean, even a rock is gonna erode eventually but. But can it float? No. Wow, that's so cool, look at the bubbles go. - [Jono] Wow, that's so cool. - That's freaking awesome! (\"Supernova\" by Laszlo) No way. Wow, I'm actually pretty impressed that that managed to, doesn't water block wifi and Bluetooth? Okay, I'm not going to leave it down there forever. As we all sensible people know IP67 does not mean leave it under water forever. Oh, it's spittin', spittin' fire. Hold on, wait until the bass kicks in again, it's gonna start like throwing water. Wait for it. (\"Supernova\" by Laszlo) Ah, apparently it's kicked most of it out. Yeah, no, mostly gone. Well, there you have it, pretty much as advertised. Really good strap, gets pretty freaking loud, and is it water resistant? Yes, yes it is. So go check 'em out at the link in the video description. Thanks to Tribit for sponsoring this video and we'll see you guys at the next short circuit, make sure you get subscribed.",
    "transcript_keywords": [
        "StormBox Micro",
        "Bluetooth",
        "Today unboxing",
        "Micro",
        "pretty",
        "Bluetooth speaker",
        "Water",
        "strap",
        "check",
        "Bluetooth pairing",
        "loud",
        "guys",
        "batterypowered Bluetooth speaker",
        "unboxing is sponsored",
        "wow",
        "video",
        "apparently",
        "hold",
        "yeah",
        "cool"
    ],
    "transcript_entity_values": [
        "the StormBox Micro",
        "Laszlo",
        "Jono",
        "Ey",
        "YouTube",
        "Supernova",
        "Brandon",
        "IP67",
        "Tribit",
        "first",
        "second",
        "about 20%",
        "Tribit",
        "eight hours",
        "two",
        "20",
        "USB Type C."
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "GPE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "PERCENT",
        "WORK_OF_ART",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ]
}