{
    "id": "Me76mxespME",
    "title": "Note 8 Teardown - Screen Replacement, Battery swap",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-10-06T21:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=Me76mxespME",
    "category": "Howto & Style",
    "tags": [
        "Note 8 Teardown",
        "Dissassemble Note 8",
        "Samsung Note 8",
        "Galaxy Note 8",
        "Samsung",
        "Mobile phone",
        "Smartphone",
        "Android",
        "Mobile device",
        "Taking apart Note 8",
        "How to repair Galaxy Note 8",
        "Battery replacement",
        "Digitizer",
        "Glass only",
        "Amoled",
        "Charging port",
        "Note 8 repair video",
        "How to fix note 8"
    ],
    "views": 862168,
    "likes": 15482,
    "comments_count": 1049,
    "description": "All Samsung Note 8 Replacement Parts:  Lets teardown the Galaxy Note 8. This is the same phone that I did my durability test on, as well as turned the back glass clear. (Thats why the glass is clear at the end of the video).  And now its time to see how hard it is to replace the screen on the Galaxy Note 8, as well as swap out the Note 8 battery in a few years when it starts to die. Smartphone batteries dont last forever. Luckily replacement parts for the Galaxy Note 8 arent that expensive (Well the screen is expensive) But Everything else isnt so bad, especially as the device gets older.  What questions do you have about the Galaxy Note 8 teardown? Would you ever attempt a project like this on your own?   Fix your Note with parts and guides from iFixit!:   Current Galaxy Note 8 Pricing on Amazon:   This video shows how I replace the screen, the charging port, and the battery all inside the Galaxy Note 8.  Pretty similar to the previous Samsung phones like the Galaxy s6, s7, and s8 series.   Awesome iPhone Tool Kit:  Green Pry tool:  Metal phone opening tool:   T-SHIRTS:  The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://goo.gl/fLnrqf",
        "https://ifix.gd/2zNeWuJ",
        "https://amzn.to/2XPJI3B",
        "http://amzn.to/2y1kDm2",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://jerryrigeverything.com/product/moh-is-my-bro/",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "It's time to tear down the Galaxy Note 8 and review the tech from the inside...see how hard it is to repair if you crack your screen, or just need to replace the battery. Let's get started. [Intro] If you've watched my clear Galaxy Note 8 video, you've already seen some of the opening process. It is difficult. Samsung has used a new type of adhesive this year that is incredibly strong. This is much harder to remove than on the Galaxy S8, or even the glass back of the LG V30. But, it's still removable. This is accomplished through heating up the back glass until it's just barely too hot to touch, and then sliding a thin metal pry tool between the metal frame of the phone and the glass back panel. I found it easiest to pull up on the center of the glass with my suction cup to ease some of the tension, then slide my pry tool along the side of glass. This is how Apple should have made their iPhone 8 but they didn't. Replacement glass panels are relatively cheap for the Note 8, so if yours is already broken, or if you manage to break yours during this repair process, don't stress out too much. I'll have replacement parts linked in the video description. Go slow and be gentle. That usually works for me. I managed to slice through my fingerprint ribbon cable, but you can avoid that since you can see where it's located. Now that the back panel's off we get the first glimpse at the back of the camera lens frame. If you wanted to swap out a cracked camera lens at this point, you could. We also see 6 Philips head screws down by the charging port. I'll remove those and then make my way up to the top plastic section with it's 10 screws. Keep the screws organized. I'll try to put them back from the same hole they came from when I reassemble the phone. I'll remove the wireless charger from the frame at this point, and we can see the golden squares that rest up against the motherboard. They transfer power from the copper coil conductor to the battery. When the bottom loud speaker comes off, exposing the charging port, we also glimpse the headphone jack. I'll show you how to remove all that in a second. The speaker does have a water damage indicator on it, so remember, your phone is not water proof, it's just water-resistant. And Samsung does not cover water damage under their warranty. If your phone gets wet, you're on your own. One cool thing that Samsung has on the Galaxy Note 8 is the dual camera set up on the back. Samsung talked about having optical image stabilization on both camera units: the 12 megapixel regular lens, and the 12 megapixel zoom lens. And that does seem to be the case there is some serious physical movement. This hardware is used to stabilize the camera images. Making sure the battery is disconnected, I'll move on to the display ribbons. They unsnap like little Legos. Even the headphone jack down at the bottom of the phone has the same style of connector. The watertight S pen slot unsnaps next. Then I'll move up to the top of the phone with the iris scanner and the 8 megapixel front facing camera. The front camera does have some play to the lens, but it's probably just the focusing and not the extreme movement that comes with the optical stabilization. There's one ribbon cable on the left side of the board next to the last silver screw that needs to come out. I'll unsnap the two little signal wires down at the bottom of the board with their circular connections. We did see this same style of wire when I made my clear Nintendo Switch video a few days ago. If you haven't already taken out the SIM and SD card tray, now would be a good time. This cute little guy holds the expandable memory for the Note 8, as well as the SIM card. It has a rubber ring around the tip to help keep water out. The motherboard is next to come out of the phone. This is because the charging port Lego-style connection is plugged in and underneath the motherboard down at the bottom. So in order to get at the connector, the motherboard needs to lift up. After the motherboard's out, the cameras can come loose. They are both tied in as one unit. A bit different than the dual connection set up that the LG V30 had, but cameras are pretty cheap to replace, and having them connected as one unit isn't a super big deal when it comes to cost or repair-ability. Looking at the frame of the phone we get the copper heat pipe snaking down the side. This wicks heat away from the processor and transfers it into the frame of the phone. I took a thermal imaging camera to the one inside of my LG G6, and it actually functions surprisingly well, more than I thought it would. There are 4 screws holding down the charging port and the headphone jack. I'll start lifting the tiny microphone out from the frame so I can be gentle with that paper thin ribbon cable. Then the whole thing can come loose. Here is the charging port with it's rubber ring around the tip of the USB-C slot. This helps keep water out. The headphone jack has a similar ring around it's tip. That rubber, combined with the pressure of the screws around them holding it tight, help give the Note 8 it's IP68 water resistance rating one step above the IP67 rating of the new iPhone 8. The housing of the S pen holster is also water tight from the inside. The S pen itself can't get damaged from water since it's inductive with only some copper coils inside, but the rest of the phone needs to be protected. That holster is pretty sealed off. Using the flat side of my metal pry tool, taking special care not to puncture the battery, I'll gently pry it out. Samsung has never been one to use the magic pull tabs, but they also use a gentler adhesive than most. The display is right underneath this battery, so I'm being very careful with this prying. Now if your screen is cracked you'll have to separate it from the mid-frame using some heat and the prying method that we used with the back glass panel. It is not fun. The screens do not survive the removal process, so only attempt this if your screen is totally busted and your replacement screen is ready to go for the installation. Assembling the phone requires that 3300 milliamp battery to go back in it's slot, along with the charging port, getting all 4 of the screw holes lined up with the frame...including that functional headphone jack. The little charging port connector gets clipped to the underside of the motherboard before the whole thing gets laid down into the phone's frame. I'll pull up any extra ribbon cables underneath to make sure nothing is caught when I screw the motherboard back into place with that one tiny screw. The screen ribbons get snapped in like little Legos, along with the headphone jack ribbon. Then the white and blue wire cables that snake up along the bottom of the board get plugged into their circular connections. There are 3 ribbon cables attached to the top side of the motherboard. Then I'll plop in the front camera and iris scanner back into the little slots they came out of. Clicking them down into place. The last thing I'm going to plug in is the battery. Once the battery is connected, I'll plop the loud speaker plastics and the wireless charging that rests on top of the motherboard back into place. There are 16 screws holding everything together. Now normally I would have to plug in the fingerprint scanner at this point, but since I annihilated mine, I get to skip that part. Then finally, the glass gets put back down over the top. Hopefully you'll never have to fix anything on your phone, but accidents do happen and batteries don't last forever, so I'll link all the replacement parts and a cool tool kit, linked in the video description below. I spend most of my free time on Twitter and Instagram, so come hang out over there. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Galaxy Note",
        "phone",
        "back",
        "charging port",
        "camera",
        "Note",
        "glass",
        "motherboard",
        "clear Galaxy Note",
        "Galaxy",
        "headphone jack",
        "frame",
        "charging",
        "water",
        "battery",
        "glass back",
        "back glass",
        "port",
        "screws",
        "ribbon"
    ],
    "transcript_entity_values": [
        "Nintendo Switch",
        "8 megapixel",
        "The S pen",
        "6",
        "8",
        "SD",
        "Lego",
        "Instagram",
        "two",
        "jack",
        "16",
        "Philips",
        "V30",
        "Legos",
        "12 megapixel",
        "4",
        "SIM",
        "10",
        "a few days ago",
        "IP67",
        "Galaxy Note 8",
        "this year",
        "Apple",
        "first",
        "second",
        "3300 milliamp",
        "Samsung",
        "iPhone 8",
        "3",
        "One",
        "G6",
        "the Galaxy S8",
        "one",
        "Twitter",
        "LG"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}