{
    "id": "MFEHFsO-XSI",
    "title": "Why Heat Pumps are Immensely Important Right Now",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2022-03-26T19:09:03Z",
    "video_url": "https://www.youtube.com/watch?v=MFEHFsO-XSI",
    "category": "Science & Technology",
    "tags": [],
    "views": 1268824,
    "likes": 59441,
    "comments_count": 7871,
    "description": "More pumping. More now.  Links 'n' stuff: The original video (explaining how they work)  \"Part 2\" which is now, I guess, more simply about ground-source heat pumps and some other stuff   Technology Connextras (the second channel that stuff goes on sometimes):  Technology Connections on Twitter:  The TC Subreddit    And check out these cool people! Ryan Benson, Johnni Winther, Mark Hesse, Nathan Blubaugh, lululombard , Nelson , William Evans, VilleS , Anton Afanasev, HuskyWithCoffee , Ray , Petter Feltenstedt, Gideon Ritter, Oliver Lee, Lennart Sorensen, basram, Viorel , lohphat , Vivian Pypher, Brooke Whiting, Robin Johnsen, Phia Westfall, Tom Rolfe, Mark Wayt, Arthur Robillard, Vaughn B., Breunie Ploeg, Andy O, Benjamin Cirker, Julien Oster, LeoNerd , Chris Wallace, Matt Shea, Jason Baker, Galimaufry, Michael Holmes, Trey Harris, Benjamin Kier, Peter Pfundstein, Alan B., Mat Stu, RYAN INGOGLIA, Thomas Kolanus, Brett Morgan, Daniel Johnson, Potch , Reemt Rhmkorf, Robin Rattay, Bruce Justyn, Justin D, Adam Zawisza, Triancia, Juan Olivares, Michael Shaffer, Jason Spriggs, Gregory Kumpula, Daniel Pf, Yung Kim, John W Campbell, The Slapster, BytewiseMarissa, Vince Batchelor, Peter Sarossy, Toby Gerenger, Tracy Cogsdill, Matt Allaire, Guy , Will Hayworth, Benjamin Gott, Zach Le, Sean Fyles-Duggan, Fredrik strem, Anil Dash, Simon Safar, Fred Leckie, Kenneth Morenz, Andy Attebery, TritonZ , Greg Stearns, Chris Satterfield (Compgeke), Cameron Benton, Samuli Suomi, Keith McCready, Jeffrey Glover, Marcus Langendorff, Hsin-Kuei Chen, David Anez, Josiah Keller, roberto.xs, tfe, Struan Clark, Alexander Karlsson, Tarrien , Jason Viterna, DrMoebyus , Antonio Esparza, Chris Larsen, Michael Romero, Aram Hvrneanu, Jonathon Mah, Arthur Zalevsky, John Fruetel, Adam Veneziano, Andrew Diamond, Cole Campbell, Christopher Beattie, Samuel Kirzner, Daniel Pritchard, Brandon Tomlinson, Eric Loewenthal, Jeremy Samuels, Malcolm Miles, David L Jones, Matthew Burket, Noah Corwin, Andrew Roland  00:00 Intro 00:43 An old video needs correcting 02:19 The Coefficient of Performance 03:16 Resistive Electric Heat's Challenges 05:16 How Heat Pumps get around those 07:39 Modern Heat Pump Performance Is Amazing! 08:33 An analysis of Chicago winters and Heat Pumps 10:53 Hourly Analysis and Conclusion 12:24 Caveats (costs and demand) 13:52 The Main Point Of This Video 15:49 Backup heat, its necessity, and the options involved 18:29 Conclusion and where to go from here 19:56 Bloopers",
    "description_links": [
        "https://youtu.be/7J52mDjZzto",
        "https://youtu.be/7zrx-b2sLUs",
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections"
    ],
    "transcript": "Hi. Its no secret that I love heat pumps. Making a substance liquify in one place and vaporize in another on our command to moveheat feels like a physics cheat code. Weve been doing it for a very long time in refrigerators and air conditioners, and were finally starting to collectively realize the benefits of doing itbackwards. And, thanks to the very unfortunate global happenings, the need to reduce ourdependence on fossil fuels has found new and different urgency. The world seems increasingly in agreement that its time for more pumping more now. And the world is absolutely right aboutthat! In this video, Id like to explain why. Real quick, you may have realized that I have already made a video as a matter of fact two on the subject of heat pumps. So whats this one for? Well, heat pumps are at the top of a lot of folks minds right now but also, you see, that secondvideo? Im not really happy with it. Largely because I ignored the developments that are happening andindeed have already happened in the air-source heat pump space, and I touted the much, MUCH harder to build ground-source heat pump as the future. Now, to be clear, if you are in a very cold place and have the ability to invest in a geothermal heat pump system, I still think youshould consider it. And by the way if you want to know what that is, well check out the linkbelow. But even in pretty cold climates like mine, effective air-source heat pumps are available today which will reduce the total amount of fuel required to heat your home over ayear even with todays electric grid. Thats good from an emissions standpoint, yes, but it also means more simply that we need less fuel for heating our living spaces. And that means we dont need to obtain as much of it from places we may not want to. Simply put, in a world where heat pumps exist which is thisone right now! it actually makes more sense to burn natural gas in a power plant to generateelectricity than it does to pipe that gas into homes and businesses to be burned on-site for heat. I know,pretty wild, right? Lets talk about why that is. Since this more of a heat pump update, or heatpumpdate, Im not going to go into how heat pumps actually work - check out the original video ifyoud like to understand that. It is pretty cool, and pretty hot. But I will go over the COP again because its what really matters - and why theyre so important. The coefficient of performance is a number that expresses how much heat energy a heating device produces compared to how much electrical energy it consumes in the process. Resistive electric heat the ordinarykind you find in toasters, space heaters, hair dryers, and whatnot has a COP of 1. That means every 1 kilowatt of power consumed becomes 1 kilowatt of heat output. Turningelectrical energy into heat is 100% efficient, so every single watt of power that this heater is consuming is ending up in the room as heat. Thats not bad, but a wrinkle there is that electricity *generation* is A) not 100% efficient and B) somewhat scarce. Lets startwith efficiency - a modern power plant that burns natural gas is, after transmission losses, about40% efficient. Note that Im deliberately talking only about natural gas plants - youll understandwhy as we go on. If you burn natural gas at a rate of 10 megawatts, a power plant will only produce 4 megawatts of electricity from it. While that would get turned into about 4 megawatts of heat if it was run through a few thousand space heaters, we could turn that into more than 9 megawatts of heat if we piped that gas into buildings and burned it locally in boilers or furnaces. As I explored in my video on furnaces, we know how to get nearly all of a fuels heat energy out of it in a safe, effective fashion. So in many parts of the world thats exactly what we do. Burning fuel on-site has been until pretty recently the most rational way to usethat resource for the purpose of space heating. The other problem with electric heata la toasters is that there is only so much grid capacity to go around. It takes a lot of energy to heat a building - heating buildings is among the most energy-intensive things we do. And in many areas the electric grid just isnt big enough to switch everyone over to simple electric heat. And its not because we couldnt build it todo so, to be clear. Its just that, except in areas with access to abundant and stable renewableenergy like hydroelectric power, it has traditionally been much more expensive and resource intensive toheat with electricity because of the efficiency challenges in fossil-fuel power plants. Theelectric infrastructure in areas like where I live just isn't expected to produce as much much energy in winter months because electricity demand has historically fallen when airconditioners stop running and furnaces fire up. But, thanks to heat pumps, we can largely sidestep both of those challenges altogether. When it comes to the need for electricity generation, sinceheat pumps arent converting electrical energy into heat but are instead using it to drive a refrigeration circuit which moves heat indoors, they have coefficients of performancethat are greater than 1. Simply put, they produce more useful heat with the same electricity than a simple electric heater does. Sometimes, more than 5 times as much. This meansthat although heat pumps will put more demand on the electric grid in places that currently use gasfor heating, they require a fraction of the energy of resistive heat and so make electrificationmuch more feasible in those parts of the world. Thats definitely good, but heres where things get even better. Dare I say, mind-blowing. Remember that we can pipe natural gas into a building and burn it there, as weve been doing for decades, and wecan capture perhaps 95% of its energy as heat. But if instead of doing that we burned it in a power plant to make electricity, heat pumps will work their magic. We may only get40% of the gass energy turned into electricity, but when you use it to run a heat pump operating with a COP of 5, in the end youre effectively operating at 200% efficiency. Thats a 100% bonuscompared to burning the gas in a furnace or boiler with perfect efficiency. Literally moreenergy than the gas itself contains ends up getting put into buildings when you use itthis way, and thats nothing short of amazing! Of course, as Im sure certain curmudgeons are shouting loudly at their screens, I need to tell you that heat pumps dont always work that well. But,they only need to operate with a COP of 2.5 to break even with on-site fuel combustion. Thatturns the 40% captured in a natural gas power plant right back into 100% - eking outeven the most efficient furnaces. And, heres why this videos happening, thatis actually very, very attainable. Today. With simple air source heat pumps. Even incold climates. Various manufacturers are now producing ductless cold-climate mini-split heatpumps that manage that COP or better down to -15 degrees Celsius, or 5 Fahrenheit. Theyrealso able to maintain their full rated output at that temperature, though with reducedefficiency compared to milder weather. For the purposes of this video Im only focusing on published data for certain models, and I will freely admit that these models are state-of-the-art and, for the moment, exceptionally efficient. But its importantto remember that these are machines for sale right now, not some theoretical future devices. And they are no more disruptive to install than an air conditioner. The technology is here. Now.We know how to build it, and if we had any sense wed start doing that as fast as we can. ButIm getting a little bit ahead of myself. I live in the Chicago area, and we love to tell you just how brutally cold our winters can get. And yes, I know there are places that get colderthan here. Much colder. But we are definitely one of those places where the conventionalwisdom says heat pumps dont work. Many, many people think its just too cold here to bother installing a heat pump, and so that pretty much never happens. It does get quite cold for somestretch of every winter - a few years ago we had a 48 hour period where the actual air temperaturedidnt get above -10 F, which is about -23 C. For much of that time, it was warmer in your freezer than it was outside! But, and very importantly, thats far from ordinary. Itsticks out in our minds because it hurts to go outside on those days, but if we actually look athistorical data for the winter of 2018 into 2019, heres what we find. In the month of November,we didnt get anywhere close to 5 Fahrenheit. And remember, it needs to be colder than that for a furnace to beat a good heat pump. In December, the closest we got was 16. In January... thingsgot worse, we spent 2 nights below 5 in the third week, and then that lovely polar vortexhit and things got particularly rough. Almost the entire last week of January had evenings below 5 degrees, and then well this wasnt fun. But actually? That was kinda it. Only three daysin February, the 1st, 8th, and 9th, landed at or below 5 degrees. In March we had two more days at the start that dipped below 5, but then by April were essentially out of the woods of Winter so, yeah, nothing close to that cold was experienced. So, for the entire winter season that year, therewere only 14 days where a conventional furnace would have outperformed a heat pump - when itcomes to the amount of fuel needed to produce the same amount of heat. And for most of thosedays, it still got above 5 degrees during at least part of the day. In fact there were only twodays the entire year where that didnt happen. Three if you count the 25th of January where we just barely hit 5. Actually, why stop there? Weve got hourly data,too, how many hours were we below 5 that year? By my count it was 141 hours, or not quite 6entire days. So, there were only 6 days of the entire winter season in which, when it comesto the amount of energy natural gas contains, a furnace made more sense than a heat pump running on electricity produced with that natural gas. Thats astounding! Are we willing to say that heatpumps dont work in Chicago because for six days of the winter wed have been better offwith a furnace? Well I hope not because thats ludicrous. Youd literally be saying Well, weshouldnt with this technology which can reduce our use of energy for 144 days of thefive-month heating season because SOMETIMES it cant do that. Listen to that. Its ridiculous! But sometimes Yeah, sometimes life is hard, and new solutions bring new challenges. But lets keep it big picture, alright? Lets look at some other years, too. Im justgonna look at days, though, finding the total hours is a bit of a pain. The previous winter had13 days where the temperature dipped below 5 at some point. The year before that had only 9. And 2015 into 2016had only 8. Jumping forward, 2019 into 2020 had but 2, though some days did just hit 5 degrees. 2020 into 2021 experienced 8 days with a low below 5 degrees, all in February incidentally. And thewinter were just clawing our way out of now had only 5 days. Though, its not impossible for there to be another one before May rolls around. Now, its important to notea couple of things. First, Im not talking about the monetary cost of delivered energy here. I do need to make that clear - the cost of electricity in your area compared to that of natural gas makes cost comparisons a hyper-local exercise. Although, recent volatility sure makes this a fluid situation, and suggests that maybe we ought to diversify our energy portfolios, which the electric grid is particularly suited to do by the way, in case you hadnt noticed. But this is a wrinkle to heat pump adoption that we should probably figure a way around. If its more expensive to use the optionthat saves energy... thats a problem. And second, I do need to acknowledge thatthose periods of time where heat pumps cant get to natural gas parity are also when heating demand is greatest. So while I can say that there were only 141 hours in which a furnace would have used fewer resourcesthan a state-of-the-art air-source heat pump in the 2018-2019Chicago winter season [inhales] thats incomplete. Wed need to normalize things by weighting that time more heavily if we want to get a more complete answer. But Im not gonna do that for you because I do not possess the expertise. However, it is factually the case that right now, today, BTU for BTU, therm for therm, cubic meterfor cubic meter, kilowatt-hour for kilowatt-hour, we can heat more homes and businesses by burning gas in power plants and using that energy to run simple air-source heat pumps than we can by pipingthat gas to those places and burning it locally for the vast majority of the winter. So long aswe are going to use natural gas, that is full stop the smarter way to use it most of the time. Andmost of the time is what actually matters, folks. There are also some other marginal benefitsto this. In places that have district heating infrastructure, the waste heat from those power plants could be used to heat buildings nearby. We have very little of that in the US so, yaknow... yay, but methane itself is a really potent greenhouse gas and leaks in the infrastructureare problematic. The fact that we have pipes filled with it everywhere around here and thereare countless fittings, junctions, valves, pumping stations, and who knows what else meanswe have a lot of potential for leaks. Eliminating that infrastructure, or at least reducing its use, can reduce those impacts of natural gas as well. Of course, and for the long-term most importantly, being electric, a heat pump is energy agnostic. It doesnt have to be powered by natural gas, itcan be powered by the sun, by the wind, or by the atom. And since they use any of those resources much more efficiently than resistive heating does, they allow us to electrify many more homes and businesses with todays grid output, and reduce the need for the grid to grow as more and more places ditch gas altogether. Heat pumps are incredibly important not just for their immediate ability to curb gas use, but for their long-term sustainability. Now, I do want to answer a question Im sure many of you are asking: what happens on those *really* cold days? Well, that depends. Many units nowguarantee operation down to -13F which is -25C, but they wont attain their full output and will have a poor COP at that temp. Still generally better than 1, though, so it still makes sense to run over resistive heat. If thats about the coldest temperature you ever experience, you maynot need a backup at all assuming your home is insulated well enough. But, having some sort ofbackup may be required depending on where you are. If you have a centrally ducted system this can be auxiliary, high-powered electric heating elements often known as heat strips which are placed in the air handler. Or you could be pairing a heat pump up with a gas furnace if you so desire. Thebackup can be as simple as a few space heaters, which might be ideal if youve chosen a ductlesssystem, although theyre not very efficient and can be dangerous if not properly used. It shouldalso be noted that simply bundling up and choosing to tolerate cooler indoor temperaturesduring those periods is also an option. The thing to keep in mind about these backups, though, is that they are needed only in exceptional cases. And becausemodern heat pumps will operate down to -25C, or -13F those cases can be quite rare. Goingback to that 2018-2019 winter season, here around Chicago we were belowthat temperature for about 32 hours total, all consecutive during that polar vortexevent. This past winter, it never got that cold. Again, I know were talking about what are today exceptionally good heat pumps. Plenty are on the market that dont perform that well, and wont performat all at those cold temps. But there are tons of places with much milder heating needs than here, and in those places the more average-performing models will be great fits. Thats why theyrepretty common already in the southern US. And lets not forget - were probably only going to get better at building heat pumps as time goes on. In fact, of that I am certain. Ill be surprised if in 10 years from now, a COP of 2.5 isnt maintained down to truly arctictemps. And also, I do just want to note that every home Ive lived in so far has had a single pointof failure when it comes to the heating system. When the furnace has stopped working, which it has, the space heaters come out until its fixed. Maybe dont fixate on the whole backupsituation all that much, is what Im saying. OK, so I hope were in agreementthat heat pumps are amazing devices and reduce our need for literally any source of energy in all but the most extreme temperatures. And to reiterate, that not only means we can burn less gas as we transition away from it, but also means we need fewer wind turbines, solarfarms, nuclear plants, batteries, hydro storagefacilities... literally whatever because reducingthe amount of energy we need to heat buildings reduces the need for all those things and so makes transitioning to an all-electric future much, much easier. I say again,with vigor; More pumping. More now. But what does that future look like? Well, that is in many ways up to you. Air-source heat pumps are really just slightly refined air conditioners, and they come in all sorts of shapes, sizes, and applications - some of which are really exciting! However, we also have many challenges we need to overcome some real, and some artificial. But this videos gone on pretty long as it is. I hope youenjoyed this new part 2? Part 2.5? of my heat pump series, and in part three well talk about what it takes to install a heat pump - both literally, as in, like, what the parts are, where they go, and how they connect together. And a look at why the process can be sohard - and what we need to do to fix that. importantly smooth jazz and air conditioners, and we're finally starting to collectively realize... hoo I'm out of breath! So... what's this one for. Well, heat pumps are at the t.... [haughhghhg noises] Largely because I ignored the developments that are already... whoops. That have happened! [inhales]. Hi. Hi. Hang on a second. My eyes are playing tricks on me. Which is this one. Right now. It actuallya mae.... I'm not gonna do that for you because I don't porsess... Oh crud. Porsess? I don't porsess the exportise? So, more pumping more now, amirite? Seriously, this is probably the single most impactful thing we could be doing in the immediate future for *so* many reasons and in *so* many ways. Manufacturers need to get cranking, and as we'll see in Part 3... American manufacturers in particular need to learn how to make a decent heat pump. They're really... quite mediocre at the moment.",
    "transcript_keywords": [
        "heat pumps",
        "heat",
        "heat pump",
        "pumps",
        "natural gas",
        "gas",
        "pump",
        "energy",
        "airsource heat pumps",
        "natural",
        "days",
        "winter",
        "airsource heat",
        "power",
        "heating",
        "COP",
        "electric",
        "heat pump space",
        "building heat pumps",
        "electricity"
    ],
    "transcript_entity_values": [
        "February",
        "todays electric grid",
        "2015",
        "2.5",
        "200%",
        "two",
        "3",
        "the winter",
        "about40%",
        "a few thousand",
        "2",
        "1 kilowatt",
        "two more days",
        "the entire year",
        "one",
        "Theyrealso",
        "only 9",
        "5",
        "about 4 megawatts",
        "The previous winter had13 days",
        "December",
        "days",
        "The year before",
        "only 14 days",
        "over ayear",
        "cubic meter",
        "2020",
        "the 1st, 8th",
        "the third week",
        "2018-2019",
        "Three",
        "American",
        "more than 9 megawatts",
        "ButIm",
        "the month of November",
        "winter season",
        "therm",
        "4 megawatts",
        "six days of the winter",
        "2016had",
        "This past winter",
        "100%",
        "only 141 hours",
        "hourly",
        "Only three",
        "the 25th of January",
        "some other years",
        "wecan",
        "5 that year",
        "only 6 days",
        "January",
        "the entire winter season",
        "three",
        "Fahrenheit",
        "141 hours",
        "2018-2019Chicago",
        "those days",
        "about 32 hours",
        "1",
        "many hours",
        "Chicago",
        "April",
        "decades",
        "10 years from now",
        "today",
        "every 1 kilowatt",
        "5",
        "6entire days",
        "2021",
        "Today",
        "winter months",
        "below 5 degrees",
        "kilowatt-hour",
        "2019",
        "8 days",
        "10 megawatts",
        "only 5 days",
        "5 degrees",
        "the 40%",
        "48 hour",
        "more than 5",
        "BTU",
        "95%",
        "some days",
        "May",
        "Goingback",
        "2 nights",
        "9th",
        "16",
        "the winter of 2018",
        "US",
        "theyrepretty",
        "March",
        "First",
        "second",
        "144 days",
        "the day"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "NORP",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "TIME",
        "TIME",
        "CARDINAL",
        "DATE",
        "DATE",
        "NORP",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "TIME",
        "DATE",
        "DATE",
        "TIME",
        "CARDINAL",
        "TIME",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "QUANTITY",
        "TIME",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "PERCENT",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "DATE",
        "DATE",
        "PERSON",
        "TIME",
        "ORDINAL",
        "DATE",
        "DATE",
        "GPE",
        "NORP",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "DATE"
    ]
}