{
    "id": "MfI9QDxvyAU",
    "title": "Nvidia stuck with 300,000 GPUs???",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2018-06-21T04:21:52Z",
    "video_url": "https://www.youtube.com/watch?v=MfI9QDxvyAU",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "nvidia",
        "geforce",
        "gtx",
        "zte",
        "us",
        "senate",
        "trade",
        "sanction",
        "samsung",
        "vibrating",
        "screen",
        "speaker",
        "bezel",
        "botnet",
        "ddos",
        "attack",
        "google",
        "health",
        "doctor",
        "emergency",
        "android",
        "messenger",
        "desktop",
        "facebook",
        "video",
        "ad",
        "brave",
        "browser",
        "advertisement"
    ],
    "views": 604930,
    "likes": 20489,
    "comments_count": 2232,
    "description": "Canadians! Hit up Memory Express for THE BEST electronics:    Twitter:  Instagram:  Facebook:   NEWS SOURCES:  NEWS SOURCES: US SENATE TO ZTE: J/K, GTFO      SAMSUNG TO FEATURE SCREENS THAT TALK?      GEFORCE GTX 300,000      QUICK BITS: CAN YOU RUN A BOTNET FROM PRISON?    GOOGLING YOUR OWN DEMISE    TEXTING FROM THE DESKTOP - OR \"TYPING,\" IF YOU WILL    URGENT MESSAGE? WATCH THIS FIRST    BRAVE ENOUGH TO RUN ADS",
    "description_links": [
        "https://www.memoryexpress.com/Policies/PriceProtection.cm.aspx",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://www.kitguru.net/lifestyle/mobile/android/damien-cox/us-senate-goes-against-trump-voting-in-favour-of-reinstating-zte-ban/",
        "https://abcnews.go.com/Politics/senate-votes-overwhelmingly-reverse-white-house-deal-chinese/story?id=55994166",
        "http://fortune.com/2018/06/19/zte-shares-trump-deal-sanctions-senate/",
        "http://www.ibtimes.com/samsung-galaxy-s10-might-come-sound-emitting-display-2690360",
        "http://www.trustedreviews.com/news/galaxy-s10-release-date-specs-rumours-3456012",
        "https://www.kitguru.net/lifestyle/mobile/android/damien-cox/next-gen-samsung-flagships-might-use-sound-emitting-displays-to-forgo-iphone-x-style-notch/",
        "https://gadgets.ndtv.com/laptops/news/nvidia-overestimated-bitcoin-mining-demand-stuck-with-excess-gpu-inventory-report-1870690",
        "https://seekingalpha.com/article/4182662-nvidia-appears-gpu-inventory-problem",
        "https://www.engadget.com/2018/06/19/arizona-man-sentenced-for-emergency-system-ddos/",
        "https://www.bloomberg.com/news/articles/2018-06-18/google-is-training-machines-to-predict-when-a-patient-will-die",
        "https://messages.android.com/",
        "https://www.recode.net/2018/6/19/17478116/facebook-autoplay-vide-ads-messenger-launch",
        "https://www.cnet.com/news/ad-blocking-brave-browser-starts-testing-its-own-ads/"
    ],
    "transcript": "Were you looking forward to buying a shiny new ZTE Phone *Fighting about Zee vs. Zed* after the Trump administration decided to let them off the hook for providing US-made hardware to North Korea and Iran? Well, you might want to temper your excitement a little bit as the US Senate has OVERWHELMINGLY voted to put the import ban on ZTE phones back in place by a vote of 85 to 10. I don't remember the last time this many senators agreed on something since Caesar was stabbed to death. *Et Tu Linus?* Anyway, the ban still needs to be approved by the house and, while President Trump could veto the bill, remember that two-thirds of Congress can override a veto if you think back to high school civics which might be likely if the Senate vote is any indication. The senators that voted for the ban cited national security concerns over jobs as their rationales. But, maybe it's all a conspiracy to increase Apple's market share. One phone maker that probably won't be banned from US shelves anytime soon though is Samsung who is looking at implementing a sound-emitting display into their upcoming Galaxy S 10. Instead of speakers, Samsung wants to use small vibrations within the display itself to create sound when a user presses the phone against his or her ear, eliminating the need for that top speaker. The technshzjns... *Forgets How To English* the technology is also coming to the Vivo Nex as phone makers are looking to pull as many tricks out of their bags as possible to make their devices as bezel-free as possible and of course avoid having to incorporate a controversial... Notch Not that controversial notch A previous report indicated that the front of the Galaxy S10 will be 93% screen so this fancy speaker-less design could go a long way toward making that a reality. Now if only we could find a way to bury the selfie cam under the screen instead of putting it on a very breakable looking... pop-up piece. Meanwhile, Nvidia, suddenly apparently stuck with a bunch of excess product that I hope they don't have to bury in the desert, Atari style. A report from Taiwan indicates that a major, as-yet-unidentified, board partner has sent back, allegedly, THREE HUNDRED THOUSAND GPUs; not because of any kind of defect but, simply because they had way too many of them. The blame for the glut of GPUs is being placed on NVIDIA's overestimation of not only demand from gamers, but also on how long the GPU crypto mining rush would last, and since NVIDIA has a history of being stingy with how many GPUs it hands out to board partners, this news is a pretty good indicator of just how badly NVIDIA may have messed this one up with some speculating that this is part of the reason that it's taking so long for us to see new team green graphics cards on the market. I wonder if they could just use all of those extra GPUs to mine themselves the revenue they lost. Now it's time for quick bits brought to you by: Memory Express Whether you're a gamer, a business owner, or literally anyone else who just needs some tech products Memory Express is your go-to destination in Canada for electronic products and services If it uses electricity, there's a good chance Memory Express carries it. Plus, with their Uber Price Beat Gaurantee; they'll beat any authorized Canadian retailer's price by 10% of the difference; both in store and online. Check out the link below for all the details. So, DDoS attacks are often carried out as pranks, but one Arizona man has earned a 20 month prison stay for his trouble or the trouble he caused as it were. He was convicted of DDoS-ing government infrastructure in Madison, Wisconsin, including 9-1-1 Dispatch Uhh... I don't think: \"It's just a prank Bro, it's just a prank\" is gonna smooth things over with someone who's waiting impatiently for those heart zapping paddles elsewhere in the city. Speaking of death You wrote heart zapping paddles in there. Don't give me crap about it! Speaking of death, Google's neural networks are now able to predict whether a patient admitted to a hospital will die After a patient has been in the hospital for 24 hours Google's AI is predicting outcomes with 95% Accuracy using medical histories, doctor's notes, and vital signs. I wonder how long it will be before? Ok Google: \"Is my aunt about to buy the farm?\" becomes a real voice command On a far lighter note, Android's Messages App is about to get another layer of Fanciness () as you're now able to go to http://messages.android.com/ Scan a QR code with your phone and send and receive text on the desktop, finally... Finally! Another nice feature to go with Google migrating the app to RCS especially if you still haven't gotten the hang of tappity tapping on your phone screen in just the right spot. Unfortunately, Facebook's messenger app is also adding functionality But it's probably not what anybody wants as they are set to roll out auto-playing video ads in the app after finding that less intrusive ads didn't affect usage patterns. But I can't imagine that users will be too pleased after commercials for stuff they don't want start eating into their data limits On the subject of ads the popular mobile browser Brave which is notable for blocking ads and trackers is now going to offer specific ads but with an interesting twist: You will be opting into the ads and you will get paid 70% of the gross ad revenue through a Cryptocurrency Exchange Could this be any more convoluted and sketchy sounding? No word yet on how much an average user could end up receiving, but I don't think for me personally you could pay me enough to sit through that \"What's a computer?\" spot from Apple again? And that's it for the news join us again on Friday to see what exciting ad will make you sit through right before Quick Bits Unless you're on Floatplane in which case, here's a quick message for you about Floatplane: You can go to https://www.floatplane.com/ and get No wait, no don't turn it off! Hold on I.. I think it won't affect their usage patterns, Let's just keep going.",
    "transcript_keywords": [
        "Fighting about Zee",
        "Zee vs. Zed",
        "Korea and Iran",
        "North Korea",
        "providing USmade hardware",
        "Trump administration decided",
        "hardware to North",
        "ZTE phones back",
        "ZTE Phone",
        "ZTE phones",
        "forward to buying",
        "buying a shiny",
        "administration decided",
        "hook for providing",
        "providing USmade",
        "USmade hardware",
        "Trump administration",
        "Memory Express",
        "shiny new ZTE",
        "Phone"
    ],
    "transcript_entity_values": [
        "Senate",
        "RCS",
        "Zee",
        "Atari",
        "One",
        "93%",
        "two-thirds",
        "US",
        "one",
        "NVIDIA",
        "the US Senate",
        "Google",
        "a Cryptocurrency Exchange",
        "9",
        "Trump",
        "the Vivo Nex",
        "Google's AI",
        "Congress",
        "Android's",
        "24 hours",
        "Arizona",
        "Madison",
        "Memory Express",
        "Samsung",
        "Friday",
        "North Korea",
        "85",
        "THREE HUNDRED THOUSAND",
        "Galaxy S 10",
        "10",
        "Floatplane",
        "Caesar",
        "Nvidia",
        "70%",
        "Facebook",
        "Canadian",
        "10%",
        "Floatplane",
        "Canada",
        "GPU",
        "DDoS",
        "Iran",
        "Taiwan",
        "ZTE",
        "Trump",
        "20 month",
        "Wisconsin",
        "Et Tu Linus",
        "95%",
        "Apple",
        "the Galaxy S10",
        "English"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "TIME",
        "GPE",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORG",
        "NORP",
        "PERCENT",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "GPE",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "PERSON",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "LANGUAGE"
    ]
}