{
    "id": "mfpUMiP8rgI",
    "title": "Customize Your Xbox 360 Controller!",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2015-11-10T18:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=mfpUMiP8rgI",
    "category": "Gaming",
    "tags": [
        "Xbox 360 (Video Game Platform)",
        "Xbox 360 Controller (Computer Peripheral)",
        "Game Controller (Computer Peripheral Class)",
        "Video Game Console (Invention)",
        "LED",
        "surface-mount",
        "Light-emitting Diode (Invention)",
        "Microsoft",
        "mod"
    ],
    "views": 111666,
    "likes": 2405,
    "comments_count": 76,
    "description": "Stock game controllers are boring. Let's see what it takes to customize an Xbox 360 controller with new LEDs and replacement buttons!  -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by Anitek (",
    "description_links": [
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "http://freemusicarchive.org/music/anitek)"
    ],
    "transcript": "Hey everyone, it's Colin. How's it goin'? I picked up a spare Xbox 360 controller the other day. I started to take it apart to clean it, when I got the idea that maybe I should customize it. These mods may not add much function, but they certainly add some fun. So stick around, and we'll see what it takes to replace the status LEDs and install different case plastics. Of course, before we can do anything, we need to get the controller taken apart. 360 controllers are kind of a pain, and it's because they use a special type of screw, known as a security Torx. It's basically a Torx bit with a hole in the middle of it to accommodate a pin in the head of the screw. There are seven of these in the bottom of the controller. Six are pretty obvious, but the seventh is hidden under the serial number label inside the battery bay. Once they're out, tilt the bottom housing up and towards the shoulder buttons to release it. Then, the vibration motors and main circuit board should just lift out. Set 'em off to the side for now. Let's talk LEDs. 360 controllers have a green ring of light around the Guide button, and this is powered by four surface-mount LEDs. The color of the LEDs dictate the color of the ring of light. Green's a little boring to me, so I opted to switch 'em to blue. The replacement LEDs to buy are known as 0603s. You can get 'em in all sorts of colors, and perhaps one of the easiest ways to buy 'em is on eBay. There are sellers who have put kits together specifically for controllers like this. That 0603 number actually refers to the size of the LED. It's a standard package size that's 0.6 x 0.3 millimeters in dimension. Now, I can't stress enough just how small these LEDs are. For reference, here's one on the tip of my index finger. Needless to say, you *absolutely* need a pair of tweezers to replace 'em. You'll also want some fine desoldering braid for removing the old LEDs. You're also going to need some way of testing the polarity. LEDs have positive and negative legs, and they won't work if they're wired in backwards. What I found that works well is a pair of double A battery holders wired up in series. This gives three volts, which is perfect for testing these LEDs. The LEDs in the controller are right in the middle of the circuit board. Their polarity needs to be tested before they're removed, and here's why: There have been several revisions to the 360 controller's internals, and the LEDs were rearranged each time. Touch the wires of your test battery to either end of an LED, and see if it lights up. If it doesn't, switch the wires around, and it should. Then, write it down, either do a little sketch, or just use a permanent marker right on the board like I did. Desoldering these tiny surface-mount parts can be pretty tricky, so some patience is necessary. Use desoldering braid on the pads at either end of the LED. Sometimes this is enough to get it to come loose. In my case, I found that there was still some solder holding the LED down. What I did was to heat up one end of the LED, then try to carefully hinge it up from the solder pad. Once one end is up, then heat up the other side to release it. Now would also be a good time to apply a little fresh solder to the pads. We need to repeat the same polarity test with the new LED. Get it oriented the same way the old LED was, then set it down onto the pads using the tweezers. It'll need to be held down while you solder the first leg, otherwise, it'll likely get knocked out of position or just go flying. Then, just tack down the other side. Work your way around the board replacing the LEDs one at a time, testing after each one by holding the controller's battery pack in place, and using the rubber membrane to activate the Guide button. I ran into a problem that you may encounter too: these solder pads are tiny, and it doesn't take a lot to damage 'em. I inadvertently lifted one of the pads while removing an LED; I think there was just a little too much solder left on it. This means that the actual copper layer that the component gets soldered to is no longer there. There is a bit of a workaround, though. I followed the place where the pad was back to the trace on the board. I carefully scraped off a bit of solder mask. You know, that green coating? This exposed the trace, and I managed to apply some solder to it. Then I got a very small piece of wire and soldered it in to bridge the connection. So the LED mod is done, but while cleaning the parts from my controller, I found that the thumb sticks were discolored and a bit worn out. And overall, even with the new LEDs, the controller still looks pretty ordinary. So I poked around on eBay and found that there are a ton of sellers who have replacement button and housing kits for really cheap, as low as a couple of bucks. I picked up a white kit, which got me all new buttons and a new inner panel to replace the original gray one. And you know that saying, \"You get what you pay for?\" Uh, well, that was certainly true in my case. I paid $4 for the kit, and it has a couple of problems. While the buttons and thumb sticks generally are fine, the fit and finish isn't quite as good as the original's. The same's true for that inner panel, there are some gaps that the factory one didn't have. And perhaps the biggest bummer is that they forgot to send me an A button, they sent two Bs instead. Oh well. In the end though, I'm still pretty happy with the results. The blue LEDs look great. They're plenty bright, almost too bright, really. And I got pretty lucky being able to work around that solder pad that I screwed up. And, even though they're not perfect, the new buttons still do a good job at making the controller look unique. I shouldn't have to worry any more about which controller is mine when I take it over to a friend's place. If you like the video, I'd appreciate a thumbs-up. If you haven't already, please subscribe. That would help me out quite a bit. And follow me on Twitter at thisdoesnotcomp. And, as always, thanks for watching.",
    "transcript_keywords": [
        "LEDs",
        "LED",
        "controller",
        "solder",
        "Colin",
        "pads",
        "board",
        "end",
        "bit",
        "pretty",
        "buttons",
        "button",
        "solder pad",
        "Guide button",
        "battery",
        "found",
        "pad",
        "surfacemount LEDs",
        "LED mod",
        "replacement LEDs"
    ],
    "transcript_entity_values": [
        "Torx",
        "Xbox 360",
        "0.6 x 0.3 millimeters",
        "4",
        "seventh",
        "two",
        "eBay",
        "0603",
        "three volts",
        "seven",
        "the other day",
        "four",
        "one",
        "first",
        "Green",
        "Colin",
        "Twitter",
        "a ton",
        "Six",
        "Guide"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "FAC",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG"
    ]
}