{
    "id": "MgJ3-Wr-q2I",
    "title": "THIS CHANGES EVERYTHING...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-05-15T13:51:00Z",
    "video_url": "https://www.youtube.com/watch?v=MgJ3-Wr-q2I",
    "category": "Howto & Style",
    "tags": [
        "portable air conditioner",
        "Portable Heater",
        "Best portable heater",
        "Ecoflow",
        "Ecoflow Wave 2",
        "Portable AC",
        "EcoFlowWave2",
        "AC",
        "Air Conditioner",
        "RV heater",
        "RV AC",
        "camping",
        "tent",
        "outdoors",
        "heat pump"
    ],
    "views": 922851,
    "likes": 29652,
    "comments_count": 1913,
    "description": "Twice as much heat for the same amount of energy?! The future is here. EcoFlow WAVE 2 The most powerful and compact portable AC, that can be used anywhere, anytime. Click the link below, use my code EFZACK88 and get an extra 8% discount on Wave 2 valid until June 15th. (1 use per order) EcoFlow Website:  EcoFlow Amazon:  And huge thanks to EcoFlow for sponsoring this video and letting us take their new tech apart!   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://bit.ly/3Mne30W",
        "https://amzn.to/41Ag4eS",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/ACnP4TvUoTN-kdVzL6dT8g?pm=link",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today we have the world's first wireless portable air conditioner that also doubles as a heater and can last for 8 hours. Perfect for people who want the inside to feel less like the outside...or the outside to feel less like the outside. If you're like me, you probably grew up with one of these bad boys, which is technically 100% efficient. All the energy coming in is leaving as heat. However, the technology inside of this new EcoFlow Wave 2 is 200% efficient, which is why it can be portable. The problem is, though, no matter how much I crank up the airflow, there's no way you can feel the 60 degrees worth of cold air, or 86 degrees worth of hot air. You can't even see the breeze through my hair. The only way to properly demonstrate the functionality here is with the teardown. Huge thanks to EcoFlow for sending this over. Let's get started. [Intro] The magic that EcoFlow is using inside of this Wave 2 is called a heat pump. And it'll make more sense when we can see it from the inside. On the outside however, we do have the display up top which can cycle between hot, cold, and fan only. As well as we have the directional air vents. Included in the box are some expandable ducts. These are all thanks to a dude named Rudolph Clausius back in the 1800's. Thanks to Rudolph and the buzzkill laws of thermodynamics, heat never really disappears. So for cooling down air, we have to take heat we remove from that air and pipe it somewhere else. That's the reason air conditioners are usually outside or placed in windows so they can get rid of heat. The collapsible ducts are pretty cool and the unit gets to temperature in about 5 minutes. Moving our way around to the front. So right here on the battery pack we also have power out. EcoFlow is a battery company after all. So it only makes sense that the 1100 watt hour battery is also a battery bank. If you look at the ports here on the side, we do have the ability to integrate 400 watts worth of solar panels to charge up the bottom of the battery. As well as we can just plug it into a wall or we can run it off of a 12 volt receptacle inside a vehicle. As far as seeing it from the inside, we can start with this panel here showing off the condenser that's visible from the exterior. To get to the rest of it we have to go a bit deeper. Obviously, the average person isn't going to take their Wave 2 apart. But this is my first time seeing a heat pump up close and personal, and especially one that's compat. So it's definitely worth our time. I like that this machine can be used indoors. Gas burning heaters like butane or propane get kind of sketchy sometimes. And this, with no internal flames, won't be catching any tents or RV's on fire. If you're into numbers, the Wave 2 has 5100 BTUs worth of cooling. And 6100 BTUs worth of heating. If I knew what a BTU was I would definitely tell you. There are a pair of high performance centrifugal blower fans. These guys move a lot of air and are much quieter than normal bladed fans, which also makes it good for indoor use. EcoFlow has been incredibly busy lately, With their robot mower, ice making portable refrigerator, and this AC unit all releasing in the same month, they make the smartphone world look like it's standing still. So you know that quote, any sufficiently advanced technology is indistinguishable from magic? Well, this is it. The best way to explain everything that's going on here is with a can of compressed air. You know, when you press the trigger on a can of compressed air [spraying sound], air comes out and the can gets really cold, really quickly. That same concept is happening right here. We have a Panasonic dual rotor compressor, as you can see on vibration isolators down there, that's taking a refrigerant called r290, and compressing it. That compression then goes through a release valve, which I think is right here. The black portion under there. And when it goes through that expansion valve, just like the can of compressed air, it gets really cold. That coldness is captured through these radiators, also called evaporators, and the 60 degree air is blown out into the room with the fans we took out earlier. But unlike the can of compressed air, this system is closed loop and it never runs out of refrigerant so it can keep happening over, and over, and over again. Now let's say we wanted to turn on the heater. Using the exact same components and the exact same system, plus this 4-way reversible valve, this guy right here, we can reverse the direction of the coolant in the system. So instead of expanding at the valve, it gets compressed at the valve and further compressed at the compressor, getting super, super hot. We can then steal that air, blow it off into the room while the cool air gets ejected outside through the conduit. This 4-way reversible valve right here is what makes all of the magic happen, reversing the coolant and allowing the 86 degree hot air to be ejected out into the room instead of cold air. Taking advantage, once again, of the compressor. And of course, if any condensation accumulates in humid areas, the liquid gets collected and dripped on top of the evaporator to dissipate. Or in humid areas there's a drain out the backside. EcoFlow thought of everything. So for the exact same amount of electricity that our parents' heaters were using in the past, we can get almost double the amount of heat with this current setup being more than 200% efficient. Science is pretty cool. Technology is pretty cool. And the EcoFlow Wave 2 is pretty cool. (See what I did there?) I'll leave a link down in the description for early bird pricing with some discounts if you want one of these for yourself. And I'll be spending the next week or so figuring out how it all goes back together. If you have any questions, leave them down in the comments. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "air",
        "compressed air",
        "wireless portable air",
        "heat",
        "Wave",
        "EcoFlow",
        "inside",
        "EcoFlow Wave",
        "worth",
        "compressed",
        "cold air",
        "valve",
        "hot air",
        "battery",
        "pretty cool",
        "cold",
        "cool",
        "wireless portable",
        "portable air conditioner",
        "feel"
    ],
    "transcript_entity_values": [
        "60 degree",
        "86 degree",
        "the Wave 2",
        "400",
        "86 degrees",
        "1800",
        "100%",
        "EcoFlow",
        "AC",
        "200%",
        "more than 200%",
        "8 hours",
        "Wave 2",
        "4",
        "the same month",
        "12 volt",
        "the next week",
        "Panasonic",
        "60 degrees",
        "about 5 minutes",
        "first",
        "Rudolph",
        "Rudolph Clausius",
        "6100",
        "EcoFlow Wave 2",
        "Today",
        "this Wave 2",
        "5100",
        "1100 watt hour",
        "one",
        "RV"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "PERCENT",
        "PERCENT",
        "TIME",
        "FAC",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "QUANTITY",
        "TIME",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "EVENT",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG"
    ]
}