{
    "id": "MhFTal2ZJOA",
    "title": "Happy 10th Birthday iPad! Cake Baking Collab with Joshua John Russell!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-12-10T19:00:57Z",
    "video_url": "https://www.youtube.com/watch?v=MhFTal2ZJOA",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 136991,
    "likes": 5900,
    "comments_count": 526,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, guys, it's Justine, and today, I'm doing a really fun collab. Of course, it's a virtual one, because 2020, but this is so much fun. I'm doing a collab with Joshua John Russell who is an incredible baker. He makes the most artistic cakes that I have ever seen. We've done some collabs before, in the past, but today, it's gonna be a very different one. So I'm basically just kinda sitting around, waiting for him to FaceTime me. They mailed me a big box of stuff that I don't even know what's inside of it. So we're gonna chat, open it up together, and then we're gonna make a cake. Oh my gosh! - Buddy! How are ya? - I'm doing well. How are you? - Hello from the East Coast. I'm actually doin' pretty good. - That's good. Can you believe it? It's been, wait, how many years has it been since we made a video? I was thinking the Nintendo Switch cake, when you were actually at my house. - Oh, that's right, but then you came to my house. I did. - Look at my new studio. - Oh my gosh, it's so nice. - Isn't it cool? - Wow! Mine is, uh, well, still the same. - Okay, are we ready? Are we doing it? - I think so, yeah. I'm gonna set you right here by my iPad. - Well, I don't have any, oh, I'll get a little cake stand. Here we go. I'll put you on a little cake. (Justine grunting) Look at this! This is cool. (blade clicks) - Whoa! - But I mean, come on now. - That's the one! I love that knife. All right, I'm gonna start pulling things out, 'cause I see boxes. - I'm still cutting. - It should be the same stuff in each box. - I'm not tall enough to reach in my box. (Joshua laughs) - She's struggling. - What's in here? - It feels cold, so- - Looks like little shoes, like a little shoe box. - Oh, it is cake. I got nervous for a second. - Oh my gosh, it is cake. Oh, this looks so good. So can I eat these or- - Yes, they're edible, so Brandon says - Okay, what's this? This is a skinny box. - I don't know. Let's do it. I'm scared. It's really light. - It is really light. - Wait. What is it? Oh my God. This is the Justine box, dude. - These are like two of my favorite things. - You made a cake for me with Doritos and Butterfinger, and I still haven't made one. I've never made a Doritos cake, but I told Justine that I would make one, after she made one for me. - It looks like I've got some icing. - I got icing, too. - (gasps) And I've got... - What is this? It looks like chocolate. Hold on, I gotta open it. - Oh yeah, that's not what I was gonna say. - Why do I have no knives, and I'm on the phone with Justine, and I don't have a knife over here? - You really should. - I mean, come on. Oh, this is mirror glaze. - It kinda, it looks like, it looks like potty. (both laugh) - Doo doo! Well, would you- (iPad clacks) Oh, you fell, you fell. When you open it, it smells like, like chocolate syrup. All right, is that it? What else do we have? - I also have some sprinkles. - I got sprinkles, too! - Mine say that they're luxury. - They are. You should taste them, though, because they actually have like white chocolate crispies in 'em, and they taste really good. - No way! This is so super fancy. Fancy. - All right, I got one more thing in here. - Gold balls! - Oh, these are like gold crispies. I use these. - These are really pretty. - Okay, how are you feeling? You feeling good about all this? Are you intimidated? Are you scared? - Are there any rules? - Okay, so we have to use a little bit of each of these, at least a little, but then you can add whatever you want. - Oh! So here's the thing. I haven't done any baking videos in a very long time. So I have basically nothing but sprinkles. Anything else that I have is probably expired. So thankfully, I've got this. - This feels like enough. Blind box challenge, we're gonna nail it. I already know what I'm doing, like it's already in my head. - I'm so scared. Okay, I'm ready. One, two, three. Team! This is gonna be such a challenge, because I have not done any type of baking in this kitchen, in a very long time. I just went through, and I had to get rid of a lot of my baking supplies, because they were all expired. So I don't even know what I have to make this cake happen. I basically have what I have in front of me. That's pretty much it. (gentle jazz music) (Justine trills) Okay. One cake. Two cake. It's the iPad's 10th birthday, this year, so I thought that maybe I could make a birthday cake for the iPad, but I got to figure out how to use all of these things. You know what I can do? I can blend them all together and put it on the inside, kind of like how Dairy Queen puts like the crunchy, little Oreo cookies in the middle. Tyler has a look of disgust on his face right now. I think it's good. Look! Sweet, salty. Sweet, salty. No? (bright jazz music) I don't know what I'm gonna do. Okay, I'm gonna make a birthday cake for the iPad. (bright jazz music) We are gonna mix Doritos and Butterfinger together. (sniffs) Oh my God, I love Doritos so much. Butterfinger! When you are a professional chef like me or a baker... That's the end of the sentence. I think that we should also put some balls in here, too. These are luxury. Oh, does that smell good. (Justine groans) Okay. Pulse. (blender whirring) (Justine laughs) I know! I know! It's brilliant! You don't even have to say anything. (blender banging) (toppings rattling) I think that smells nice. I need to taste my creation. (Justine crunching) I am a genius. - [Tyler] There's no way that tastes good. - Put that fork in there! Have a bite of that! Tell me what you think. (suspenseful music) If you didn't know- - [Tyler] Why is that good? - I know! So we have that. I'm gonna put that as a filler inside each layer. (solemn music) (giggles) This looks so good. Okay, think that's nice, looks pretty good. Yeah, let's probably sprinkle a little of that on there. Looks nice. I think I might put whole Butterfinger bars in the middle. Mm-hmm, we're gonna do that. (gentle music) I wonder if there's gonna be voting, like are we gonna vote on who wins the competition? Is it a competition? I mean, it's like challenge, but is this like a 2020 challenge where, you know, everybody wins? Looks good to me! (upbeat music) I'm dancing to royalty-free music, in my head. (upbeat music) Happy birthday to the iPad Happy birthday to the iPad (breath hissing) (chips crunching) (Justine laughs) Do we want to color the icing? Because, I mean, a colorful icing might be pretty. Let's see what we have up here. Oh, we have every single color imaginable. (upbeat music) Okay, I could be here all freakin' day, so we should probably stop, because we're on a time limit here. (upbeat music) This actually looks good. (upbeat music) (slurps) I have some ideas. Oh, I think I have like some gold powder. Ah yes, we do! Freaking come on, man. (Justine gasps) (upbeat music) I feel like... So who was the doctor that made Frankenstein? - [Tyler] The doctor's name is Frankenstein. - Wait, but then didn't he make a monster? - [Tyler] Yeah. - But then he named it after himself. Frankenstein's monster. - [Tyler] Yeah, but the monster's not named Frankenstein. (Justine gasping) - Really? I feel like, my entire life, everything that I knew is no more. What is Frankenstein's monster's name? - [Alexa] I can't get the answer on the HomePod. - Freakin' surprise! I think I'm done. Wow, this really took a turn for the worst. (Justine laughing) So now I'm gonna call Joshua back, and we will compare cakes and see what he came up with. He's definitely, I don't think he's gonna be able to top this. I mean, look at this. It's beautiful. Art! Maybe I should clean up first. I don't want him to see my kitchen, like what I've done to it. I guess he will see, because he's gonna watch the video. - Hello, friend. - Hi, how was your day? - You're not crying. Your house is not on fire. You don't have mess like buttercream all over you, so it looks like you did okay. - I've cleaned up. You don't even know what this place looked like. And I also have a robot vacuum that did most of the cleaning for me. - I can't wait to see the footage, though. (laughs) - So do you want to show me your cake first, or like, do we do like a reveal at the same time? I should go first, so I can set the bar super low. - (laughs) Come on, let me see. - So it's the iPad's 10th anniversary, this year, so I made a birthday cake for the iPad. - I love that! - Okay, I'm gonna put you down. Oh, there, okay! - Justine! - Okay, don't get, so if you get close up to it- - I'm so proud. That looks really good! - It looks better than I thought. There's a little 10. - I see the sprinkles. Oh, that's so nice. So it's just crushed, what did you put? What's the sandy-looking stuff, the topping? - So you know how I like to use a blender? I blended Doritos, the gold balls, the Butterfinger, the sprinkles. It is all in here. - Oh my God, that's gonna be so awesome. So I just did what I felt like doing. I wanted to do something that would make you smile. You totally like branded yours and made like a story out of it. I don't have a story. I just made a fun cake. So here it is. You ready? - Oh, shut up! What? Oh my God! - I decided to go rainbow, and of course, I added a tier, because I'm me and I'm super extra. Look, look, look, I made gold Doritos. - That's such an incredible idea, oh my God. - I dipped them in chocolate, so they'll stay crunchy and not get soggy, and then I painted them gold. - That is such a good idea. Wait, okay, so how did you, how did you do, how did you make it so tall? Well, I took the four cakes, and I cut them all in half, so that's eight layers. You'll see when I cut it. And inside it's all rainbow. - What? That's incredible, oh my gosh. Well, I just put full-on Butterfingers slices in here. - (laughs) I love that so much. - Okay, here we go. - Let's do it. All right, (laughs) that knife! That knife is so aggressive. (laughs) I love it so much. - Wow, I just cut through the layer of Butterfinger. - [Joshua] Oh, it's gonna look so cool. - [Justine] I didn't know, like that glaze stuff, I used that in the middle to stick my cakes together. - Hey, you know what? You were creative with it. Here we go. Boom! Rainbow! - Look how nice that is. You're so talented. - [Joshua] Rainbowy! - Wow, okay, so let me show you inside here. This layer here is Doritos. - Okay. - This one is full Butterfinger chunks. And this one is the mixture of the little dust that I made. - That looks delicious, for sure. Yay! A successful blind box challenge, right? This is the first one, and we both made cool cakes. I'm super excited. - I mean, this turned out way better than I thought. I was gonna try to figure out a way to put the iPad inside of it, but then I was worried I might ruin my iPad, so I didn't do it. - It looks so good, though. I'm super proud of you. That's awesome. - Yours is so good, though. That looks incredible. I'm very impressed. - Well, I had to do something that would make you smile. Hopefully soon, we can do this in person, 'cause I want you to come to my new studio. - I know. I want to check it out. It's awesome. - Thanks, girl. - All right, thanks. Bye! Thank you, guys, so much for watching. This was so much fun. Joshua is so incredibly talented, and I've been such a huge fan of his for so long, and he just started a new show called \"You've Been Desserted.\" I'll put a link in the description if you want to watch him make his incredible cake and a ton of other amazing videos. Don't forget to subscribe to my channel and to Joshua's. And I will think about how to improve my baking, next time. (uplifting electronic music)",
    "transcript_keywords": [
        "cake",
        "good",
        "made",
        "put",
        "make",
        "Doritos",
        "Butterfinger",
        "iPad",
        "Joshua John Russell",
        "box",
        "cakes",
        "birthday cake",
        "God",
        "Justine",
        "Frankenstein",
        "John Russell",
        "birthday",
        "nice",
        "inside",
        "Gold"
    ],
    "transcript_entity_values": [
        "Joshua",
        "second",
        "one",
        "iPad",
        "Justine",
        "Doritos",
        "Two",
        "Oreo",
        "Brandon",
        "2020",
        "three",
        "Joshua] Rainbowy!",
        "a ton",
        "' day",
        "Butterfinger",
        "FaceTime",
        "Dairy Queen",
        "Alexa",
        "HomePod",
        "10th",
        "iPad",
        "four",
        "Butterfingers",
        "half",
        "Frankenstein",
        "Joshua John Russell",
        "the East Coast",
        "eight",
        "today",
        "this year",
        "two",
        "Tyler",
        "first",
        "Doritos",
        "One"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "LOC",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "CARDINAL"
    ]
}