{
    "id": "mJ22d23rCXA",
    "title": "XPS 13 (2017) Review - 60% Faster!!!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-10-26T18:05:26Z",
    "video_url": "https://www.youtube.com/watch?v=mJ22d23rCXA",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Dell",
        "XPS 13",
        "Razer Blade Stealth",
        "HP x360",
        "HP envy",
        "best ultrabook",
        "best laptop",
        "best laptop for students",
        "gaming laptop",
        "best gaming laptop",
        "external GPU",
        "cheapest laptop",
        "best laptop for work",
        "best laptop for engineering",
        "college",
        "university",
        "highschool",
        "13",
        "15",
        "XPS 15"
    ],
    "views": 949272,
    "likes": 18378,
    "comments_count": 1699,
    "description": "Dave2D review of the Dell XPS 13. The best laptop from Dell for students and professionals. XPS 13 Here -  Skins from -    Their new thin and light laptop with the quad core 8th gen Kaby Lake R CPU. This thing is way faster versus the 7th gen CPU for multi-core applications.    Music Credits: Fili - The Day Dream  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2gFQ0L8",
        "https://dbrand.com/dell-xps-skins",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going? Dave2D here And in front of me is the XPS 13 This is running the latest 8th generation CPU from Intel, the Kaby Lake-R And I don't know if this laptop really needs an introduction because it's really well-known but for the people that aren't familiar with it I'll just do like a quick overview kind of thing for the stuff that hasn't changed Basically, this is a really well-built thin and light ultrabook with a 13-inch screen And this was one of the original 13 inch screen ultrabooks that rivaled the whole MacBook experience This is well built, it looks good, and it's just a really strong performer, and that was three years ago And they've kept upgrading them and refreshing them over the years and at this point This is really really solid. These are now running quad core processors so the stuff that hasn't changed it's still running a great screen. It comes in two options for the screen a 1080p panel and a quad HD panel you can't go wrong with either of them They're both very very good. Thin bezels They call them InfinityEdge displays and because the bezels are so thin the experience when you're looking at these screens is really immersive There's just very little material on the edges to distract you from what you're watching or what you're doing. Now the screen I'm running is at an 1080p panel. It's not touchscreen, but that's just a personal preference I don't really like using touch screens on laptops. I know a lot of people do but the one thing that XPS laptops are really good at is the touch screen thing. It's not that the screen is more sensitive It's because of the hinge so, the XPS lineup, the 13 and the 15, has a very stiff hinge It's so stiff that you can't even open it up with one hand like you can kind of do it But you got to jiggle it But the stiff hinge has a huge benefit when it comes to touchscreens because when you're poking at it There's just very little wobble when you're tapping at the screen, and a lot of laptops have loose hinges that are nice to open, easy to open But once you start touching them, it's really wobbly and that's a bummer, but this one they do it well. The keyboard is also unchanged It's got backlighting, the layout is good and most people will quickly adapt this keyboard and enjoy it It's not the most comfortable or the best keyboard out there It's actually very average for an ultrabook, but it is good, and if you use it for long enough You'll learn to type really quickly on it. The trackpad is also unchanged It's a little small, but it's running Windows Precision drivers right out of the box so tracking is good, gestures work perfectly It's a really good trackpad overall. The build quality has not changed, and that's a good thing I guess? I mean it's built really well It's actually very tanky for its size and weight, but I'm getting bored of its design It's not a bad design. It's not ugly or anything That's just we've been seeing this for almost three years at this point And I really wish they would at least change the color They are offering an Alpine white version, which isn't available yet But I really wish they'd had like a black version like they have the XPS 13 2in1 and this really nice black finish But in the meantime, I'm running a dbrand skin. This is actually black dragon. I think it looks pretty cool Now before I talk about performance and some of the things that have changed I want to touch on some things that haven't changed that I don't particularly love First is the issue of coil whine. I know this is something that bothers a lot of you guys It doesn't bother me too much I don't see it very often in laptops, but the XPS 13 and 15 some of the units have coil whine And this is actually the first review unit I've ever had that had coil whine and it's slight It's very very subtle, but it's there, and it doesn't bother me And I know that some people are really irked by this it's still present so that's something that really bothered you It's still there and if for people I don't know what coil whine is it's this slight hum or just electronic noise that you can barely hear, but it's there Another thing that hasn't changed is the location of the webcam It's still at the bottom of the screen so it looks up your nose when you're using the webcam It's not the most flattering video angle, but it's kind of the price You have to pay when you have such a thin bezel screen basically Every manufacturer that has an ultra thin bezel like this has some kind of weird webcam angle, okay The last thing that hasn't changed are the ports and this is kind of a good thing because the port selection is always good there's an SD card slot, 2 USB-A's and a Thunderbolt 3 But the things that I don't love the Thunderbolt 3 port yet again only uses 2 PCIe lanes so if you're running an external GPU you're not getting the full bandwidth which on a laptop like this running a four core Kaby Lake-R chip It would be nice to have four lanes of PCIe for an external GPU. I understand It's a very limited number of people that would actually use it for that But it would have been nice. The other thing is that the power connection still uses a barrel plug It would have been really nice to see a USB-C port there This thing can easily handle it, 45 watt adapter, plug it in USB-C, universal charging, everybody wins except It would have cost a little bit more for them to make. Oh well, okay Let's talk about the things that have changed and the big thing is performance, Kaby Lake-R processors, the 8th generation CPUs are phenomenal. The jump that you get going from the 7th gen stuff to the 8th gen CPUs We're talking like a 50 to 60% increase in multi-core performance and depending what you do or what apps you use That can be a huge difference in your workflow, and it's crazy because the 5th to the 6th to the 7th generation CPUs I mean those always like incremental increases like we're talking 10-15% each year, this... 50 to 60%. It's huge and it all comes from core count Not every application can take advantage of multi-core like this But you'll notice a significant increase in speed for processor intensive stuff This is running the Intel UHD Graphics 620 Which is a little bit of an improvement over the previous generation, the HD 620 If you're trying to play games, you're still not gonna have a great time You're gonna be able to play some really lightweight titles with low resolution and low graphic settings But if you want to play something even moderately demanding It's not gonna be good. The externa GPU like I mentioned before you're only getting two lanes of PCIe I plugged up a Razer Core to this. It does work It does connect, but it's not designed for gaming and that's the other thing I noticed this laptop doesn't have a High Performance mode. I don't know if it's because it's the review sample I was sent, but normally in Windows you can adjust your power plan and you can choose between Balanced or High Performance But I didn't have the option for high performance on this laptop So I couldn't really test it the way I wanted to. One thing to keep in mind though, this is a 15 watt CPU so Even though it's quad-core, there are quad-core gaming laptops out there that are 45 watt CPU such as triple the power consumption So you're not gonna be able to get the same kind performance on this quad core laptop as a gaming quad core laptop They're just not built that way But I will say this, this laptop, the 8th generation CPU is such a big improvement over the previous generation That it doesn't make sense for anyone to purchase the 7th gen CPUs It's just too much of a performance difference, and the battery life has improved a little bit I'm getting around 11.5 to 12 hours of battery life with the screen at 250 nits on the 1080p panel. If you have the quad HD panel, it'll be a little bit less I'm thinking, nine hours of battery life Maybe ten for lucky, but all-around great laptop. The drive on the inside is fast The RAM is still soldered on, it's an XPS 13 through and through Now I want to touch on one last thing before it closes off and that's customer support. The laptop industry doesn't have great customer support That's just the nature of the business I would consider Dell's to be slightly above average, not amazing, not even great, it's just slightly above average But if that's important to you, if you really want long-term customer support for your laptop I would put these guys a little bit higher on your list of short choices because we have, what I considered to be, above average customer support. Okay, hope you guys enjoyed this video! It's an easy choice if you're looking for a thin and light ultrabook, 8th generation XPS 13, two thumbs up. Okay, thumbs if you liked this, subs if you loved this video! See you guys next time!",
    "transcript_keywords": [
        "thing",
        "screen",
        "good",
        "laptop",
        "XPS",
        "running",
        "touch screen thing",
        "good thing",
        "performance",
        "changed",
        "quad core laptop",
        "High Performance",
        "generation",
        "laptops",
        "things",
        "generation CPU",
        "people",
        "screen thing",
        "core",
        "thin"
    ],
    "transcript_entity_values": [
        "InfinityEdge",
        "2",
        "Kaby Lake",
        "almost three years",
        "Dell",
        "8th",
        "Windows Precision",
        "MacBook",
        "10-15%",
        "2in1",
        "CPU",
        "45 watt CPU",
        "three years ago",
        "GPU",
        "45 watt adapter",
        "USB-A's",
        "Razer Core",
        "ten",
        "one",
        "50 to 60%",
        "11.5 to 12 hours",
        "XPS",
        "Alpine",
        "6th",
        "First",
        "nine hours",
        "each year",
        "7th",
        "SD",
        "Balanced or High Performance",
        "13 inch",
        "the years",
        "two",
        "3",
        "first",
        "13-inch",
        "four",
        "5th",
        "RAM",
        "13",
        "Kaby Lake",
        "the HD 620",
        "Intel",
        "15",
        "250",
        "USB-C",
        "One",
        "15 watt CPU",
        "1080p"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "FAC",
        "PERCENT",
        "MONEY",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "TIME",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "TIME",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL"
    ]
}