{
    "id": "MjGMeMrH73I",
    "title": "M2 MacBook Air Impressions: Midnight Madness!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-06-08T20:58:06Z",
    "video_url": "https://www.youtube.com/watch?v=MjGMeMrH73I",
    "category": "Science & Technology",
    "tags": [],
    "views": 5706133,
    "likes": 154918,
    "comments_count": 6601,
    "description": "Hands-on with the new MacBook Air with M2 chip!  My 2022 WWDC Reactions/Recap:   MKBHD Merch:   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "https://youtu.be/4U2ZxO7b8iM",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - All right, so this is Apple's hot new laptop for 2022, and the first with the new second generation with Apple Silicon inside. We have a new MacBook Air, and it's redesigned, it's pretty sweet. We got this announcement at WWDC on stage a couple days ago and I did get to spend some actual hands on time with the new laptop, which is what this video is. And after the half hour or so I actually gotta spend with it, I was left with one main thought and one new question. The thought about the color and the question about the lineup. So, first of all, I love the design refresh. Apple's new laptop design language, as we've seen from the previous MacBook Pros, is very squared off. So this MacBook Air is no longer a wedge shaped. It's very much rectangular with the sharper edges. But it's still an Air, it's still razor thin. 11.3 millimeters total Z height, less than half an inch, and 2.7 pounds. It kind of, to me, looks like two iPads sandwiched together, basically, still all metal, still really well balanced and easy to hold. Definitely earns the Air name, right? So on the right side, there's the headphone jack, with the new high impedance headphones support, and on the left, there's two Thunderbolt ports, and they added MagSafe, and it'll actually come with a color matched MagSafe cable, which is new, and it's a really nice touch. So there's four new colors of this laptop: silver, space gray, then starlight, and midnight. So each MagSafe cable matches the color of the laptop. You plug it into the side, it looks pretty seamless. I just love them bringing back MagSafe here. And then with MagSafe, they also added fast charging, up to 67 watts with an optional power brick. That's good for adding 50% charge in half an hour, which is pretty good. Apple also showed us on stage there was this slide of a dual USB type C charger, which looks pretty sweet. Just a heads up though, that one is not 67 watts. That's not the super fast charging, that is 35 watts. I got to actually hold it and read that on the back of the brick. So you can get either the fast charger or dual USBC charger. Anyway, this laptop also gets a new quad speaker set up. It's sort of those tucked in the hinge underneath the display, which is kind of cool, and a new triple mic array with Beamforming audio. I can't test that stuff in the limited hands on time I have with it in a huge echo-y Steve Job's Theater. So definitely get subscribed to see the review of that and all the other stuff I get to test when I actually get my hands on one. But I think really the biggest change that I'm gonna notice with this new laptop is at the front, it's the display. So in basically the same footprint as the last MacBook Air, they thinned out the bezels all the way around, making room for a slightly bigger 13.6 inch display, which is now also brighter at 500 nits, basically matching the 13-inch MacBook Pro. And of course it now has the notch, with the new 1080P webcam up there also. This is, again, part of the new Apple Pro aesthetic that honestly we are already getting used to as dorky as it looks when you just stare at it. But anyway, you also have a full height function row up at the top of the magic keyboard, with Touch ID in the corner, back-lit keys, the whole deal. I mentioned in the last video, midnight, this new dark color, might not be the way to go. And I say that reluctantly, 'cause we love a good matte black, but as you may know, from the name of the color, it's actually the same as the Apple Watch Series 7. So it's not quite black, it's slightly blue, as hopefully you can tell from my clips. But also in my very, very limited time playing with it, it picks up a lot of fingerprints, a lot, and it was kind of hard to clean off. So in my time handling it, getting fingerprints all over the thing and getting kind of annoyed with trying to clean them off, it made me lean way more towards just safe space gray or maybe silver, which would never show those fingerprints. I don't know, maybe you just get a DBrand ICONS skin, slap it on the back, and never worry about it. Maybe you just don't care about the fingerprints and you just deal with it. I'm just saying, just putting it out there. Can't say I didn't warn you. But the new M2 chip inside is, of course, super important, and this is what's gonna make this ultra thin and light laptop actually perform and be very, very impressive. Again, gonna do some testing and using it, but Apple's promising some broad things, like roughly 20% better CPU performance than M1, and 30 to 35% better GPU performance, which is a pretty big jump, over the M1, which is already very capable. All within the same 18 hours of video playback, really good battery life, so it's impressive. There's more memory bandwidth, up to 100 gigabytes per second. More maximum system memory at 24 gigs. But it's worth remembering, this is still very much the baseline chip, right? The M1 Pro and the M1 Ultra chips are definitely still higher end chips and we can expect new generations of I guess an M2 Pro and an M2 Ultra at some point. But yeah, this M2 is targeted for baseline, everyday computing, and then occasional, maybe some more demanding stuff. It can handle stuff like video editing, light gaming, stuff you wanna throw at it once in a while. But here's where it gets interesting. It is more expensive. So I had no problem recommending the M1 MacBook Air at $999, right? This is now, like two years or so later, this M2 MacBook Air starts at $1,199. So $1,200 laptop. It's a little more pricey. But they're keeping the two year old M1 MacBook Air with the old design in the lineup still at $999. So now, you know, at this price, it's not like an instant recommendation for me, and having a two year old laptop not drop in price is also a little interesting. But to me, the weirdest part of this whole announcement of this lineup is the one other machine that they put this new M2 chip in, is the M2 MacBook Pro. And this one got absolutely no redesign at all. It is the exact same body and display and outside as the M1 13-inch MacBook Pro, they just bumped a new M2 chip inside. And so that machine will start at $1,299. And I just wanna just talk about that for a quick second. Like I actually feel like you can make an argument that the M2 Air, which is cheaper, is actually a better computer for most people, for 90 something percent of people, you should probably just get the Air. Look at this chart. Expect a new M2 MacBook Air and M2 MacBook Pro to cost the same amount with the same specs, $1,499, right? At this price though, the Air is thinner and lighter, has the new better design, has a larger display, has Touch ID with a real function row, which is, I think, better than a touch bar. It has MagSafe with the color matching cable. It has fast charging that the Pro doesn't have. It has a much better webcam. It has new speakers and microphones and it literally has more ports than the Pro. So the only advantage to the Pro would be pairing the M2 chip with a fan, so the active cooling system can get you some extra performance out of sustained workloads, like long renders and gaming, I guess, and then the slightly longer battery life from the bigger laptop, having a physically larger battery. But if you're already a person that's thinking about performance for sustained workloads and things like ports, you're already gonna be looking towards the M1 Pro MacBook Pro, the 14 inch. So it's just kind of a weird sliver of people that I don't think are gonna actually get very many M2 MacBook Pros. Just my thoughts on that, real quick. Anyway, that's pretty much it. The Air is a really good machine. The one weird quirk about it that I noticed is it still only supports one external display, even though it has two ports now. Still only one, up to 6K, external display. But this is a good machine. It's fun to hold and use and carry around and it makes a perfectly reasonable computer. In a vacuum, the M2 MacBook Pro look like a pretty bad deal. Either way I am for sure gonna get my hands on and test this thing. Let me know in the comments which color you think I should get. I'm considering midnight, right? But we've seen the fingerprints. So I'm leaning maybe starlight, instead, or space gray? Anything but silver. I don't know. Let me know in the comments. Okay. That's been it. Thanks for watching. Catch you guys in the next one, peace.",
    "transcript_keywords": [
        "MacBook Air",
        "MacBook Pro",
        "Pro MacBook Pro",
        "Pro",
        "Air",
        "Apple Silicon inside",
        "Apple Silicon",
        "MacBook",
        "laptop",
        "Apple",
        "Silicon inside",
        "color",
        "Apple Pro",
        "pretty",
        "Pro MacBook",
        "MacBook Air starts",
        "previous MacBook Pros",
        "display",
        "Apple Pro aesthetic",
        "Silicon"
    ],
    "transcript_entity_values": [
        "the same 18 hours",
        "Steve Job's",
        "M1",
        "67 watts",
        "Apple",
        "M2",
        "Apple Pro",
        "11.3 millimeters",
        "The M1 Pro",
        "the Apple Watch Series 7",
        "one",
        "this MacBook Air",
        "the two year old",
        "14 inch",
        "USBC",
        "four",
        "DBrand",
        "half an hour",
        "30 to 35%",
        "1,200",
        "MacBook Air",
        "35 watts",
        "MacBook Pro",
        "the M2 Air",
        "M1 MacBook Air",
        "2022",
        "M1 Ultra",
        "90 something percent",
        "999",
        "M2 MacBook Pros",
        "MagSafe",
        "roughly 20%",
        "Beamforming",
        "M2",
        "first",
        "MacBook Air",
        "13-inch",
        "MacBook Pro",
        "Air",
        "13.6 inch",
        "midnight",
        "M2 MacBook Pro",
        "two years or so later",
        "GPU",
        "a two year old",
        "MagSafe",
        "second",
        "2.7 pounds",
        "a couple days ago",
        "the half hour",
        "50%",
        "1,199",
        "only one",
        "up to 100 gigabytes",
        "Air",
        "1080P webcam",
        "CPU",
        "1,299",
        "jack",
        "6",
        "Apple Silicon",
        "500",
        "two",
        "Touch ID",
        "MacBook Pros",
        "1,499",
        "WWDC",
        "USB",
        "24",
        "less than half",
        "iPads"
    ],
    "transcript_entity_types": [
        "TIME",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "NORP",
        "TIME",
        "PERCENT",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "PERCENT",
        "MONEY",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "TIME",
        "PERCENT",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "TIME",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "EVENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT"
    ]
}