{
    "id": "Mjusk3sDBw8",
    "title": "Samsung Galaxy S8 Review: Redemption In Glass",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-04-18T15:00:25Z",
    "video_url": "https://www.youtube.com/watch?v=Mjusk3sDBw8",
    "category": "People & Blogs",
    "tags": [
        "galaxy s8 review",
        "galaxy s8+ review",
        "galaxy s8 vs s8+",
        "galaxy s8 edge",
        "galaxy s8 camera",
        "galaxy s8+ camera",
        "samsung galaxy s8 review",
        "mrmobile",
        "michael fisher",
        "galaxy s8 vs lg g6",
        "lg g6 vs galaxy s8",
        "best android 2017",
        "best smartphone"
    ],
    "views": 673985,
    "likes": 18468,
    "comments_count": 1739,
    "description": "The Galaxy S8 and Galaxy S8+ are probably the most important Android smartphones of the year. To Samsung, they're a chance to regain the public trust; to gadget nerds, they pack more cutting-edge features than any other mobile; and to normals, they're the phones that are about to be plastered across every billboard and TV screen from here to the holidays. Im Michael Fisher and Ive spent a week with the Galaxy S8 and S8+; lets see if they deserve your dollars in MrMobile's Galaxy S8 Review/Galaxy S8+ Review!   [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  Samsung Galaxy S8/S8+ [Samsung]:   Samsung Galaxy S8 [Amazon]   LG G6 [Amazon]   Xiaomi Mi Mix [Gearbest]   TYLT Vu Qi Wireless Charger   Samsung Fast Wireless Charger   Samsung Gear VR 2017:   Lamicall Adjustable Phone Stand:    [ABOUT THE GALAXY S8 REVIEW/GALAXY S8+ REVIEW]  MrMobile's Samsung Galaxy S8 Review/Galaxy S8+ Review was produced following one week with a Galaxy S8 review device and a Galaxy S8+ review device, each on loan from Samsung. The devices were used on T-Mobile US in Greater Boston and the primary S8+ was paired to one wearable, a Gear S3 Frontier. Additional Bluetooth pairing took place with a Maven Chevy Malibu, and worked without incident. Software on each Galaxy S8 review unit was pre-production.   [LINKS]  Samsung Galaxy S8 Review [Android Central]   Samsung Note 7 Story [Reuters]    [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"Urban Odyssey\" by Jake Silver, available at Premium Beat:   \"Lifetime Travels\" by Cymatix, available at Premium Beat:   \"Beach\" by JAM Studio, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/1sy",
        "http://mrmobile.tech/1sx",
        "http://mrmobile.tech/1sz",
        "http://mrmobile.tech/1t0",
        "http://mrmobile.tech/1su",
        "http://mrmobile.tech/1sv",
        "http://mrmobile.tech/1t1",
        "http://mrmobile.tech/1qm",
        "http://www.androidcentral.com/samsung-galaxy-s8",
        "http://www.reuters.com/article/us-samsung-elec-smartphones-costs-idUSKCN12B0FX",
        "https://www.premiumbeat.com/royalty_free_music/songs/urban-odyssey",
        "https://www.premiumbeat.com/royalty_free_music/songs/lifetime-travels",
        "https://www.premiumbeat.com/royalty_free_music/songs/beach",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Narrator] This is the Samsung Galaxy S8 and from a couple different angles, it's one of the most important smartphones of the year. To Samsung, it's a chance to regain the public trust. To gadget nerds, it's a chance to go hands on with more cutting edge features than you'll find in any other mobile. And to normals, it's the phone they're gonna see plastered across every billboard from here to the holidays. I'm Michael Fisher, and I've spent a week with the Galaxy S8 and the S8 Plus. Let's see if they deserve your dollars. We're getting closer and closer to a world where phones are all screen, and everyone's taking a different route to that future. The S8 takes a little bit from every approach out there. Rounded corners, a stretched aspect ratio, and a curved fall off on the sides. Combine that with Samsung's new display technology, which adds HDR support to the best AMOLED panel around, top it off with the same Gorilla Glass 5 as on the back and you've got, basically, the perfect smartphone screen. I'm sorry if it sounds like I'm fawning, but really whether you're gaming or reading or hitting subscribe on that YouTube channel you just fell in love with, your eyes are gonna be very happy and your hands will be, too. Even at 5.8 and 6.2 inches, these are still manageable phones thanks to their narrow chassis. Allocating that much acreage to the display left no room for the usual home key, but you almost wouldn't know it thanks to clicky haptics that simulate a physical switch. The only real downside is kind of a big one. The fingerprint sensor has moved to the back and not in a sensible center line location, but higher up in a small crater that's hard to feel out and easy to confuse with the camera lens. Even after a week, it's awkward and clumsy and probably the worst thing on the phone. Fortunately, Samsung offers five other ways to unlock including the iris scanner. I've been pleased with how well it works, even in very dark rooms, and even through sunglasses. But bright sunlight still confounds it, and in any case it's not as quick as a well-placed fingerprint scanner would be. Beneath the unlock screen sits the most heavily customized Android version you're likely to see. A couple years ago that would have been a stinging criticism, but Samsung has put a lot of work into making its new interface look good. It's much more cohesive than its ever been, and it feels earned now. There's a pleasant melding of conveniences from stock Android and Samsung. Swiping the fingerprint scanner drops down the notification shade, flicking the home screen deploys the app drawer, and an edge screen gives you one-thumb shortcuts to almost anything you want. Oddly, the S8's biggest new software feature is only half finished at release. Bixby is a virtual assistant that's supposed to let you control your entire phone by voice, and Samsung is so serious about it that it gave it it's own button. But the voice part doesn't work yet, so for now it's mostly just this, a stack of info and app cards on your home screen much like Google Now. I found Bixby Vision to be more handy. It lives in your gallery and tries to recognize images to make it easier to buy products you photograph. It can also scan QR codes and stuff like that. Sometimes it works, and sometimes it doesn't. I'll revisit Bixby when it's actually finished. For now, I mainly know it as the button I accidentally press when I'm trying to lower the volume. Hop across the phone, double click the power button, and you launch the camera. Both cameras are new on the S8, and the most notable improvements are up front. The selfie camera brings auto focus, automatic wide angle, and masks. When you're ready to shoot some real photos, the main camera is once again excellent. I took some side-by-sides with a Google Pixel, whose camera I like a lot, and four times out of five I preferred the S8's shots. Partly that's due to Samsung's tendency to oversaturate. My inner two-year-old never got over his love of bright colors. Also, the phone is water and dust resistant. Even if you're not the type to film fully under water, it's nice to know you can get right down in there without worrying. And nestled away in the camera options are bonuses like slow motion video, always nice when you're curious about combustion, and Virtual Shot, a kind of faux 3D photography. I've only just scratched the surface of what you can do with this camera. I'll show you a few more samples here, and keep in mind that Android Central's Galaxy S8 review offers more photos and video. (jazzy techno music) The more time I spent with the S8, the more features I found, or remembered from my brief time with the Note 7. Game center lets you tune the phone for either performance or battery saving when you're playing a game. Shortcuts to photo and video editors are built right in so you don't have to hunt for them. And you control sound quality with the easiest equalizer I've seen. All those add-ons do take their toll. While the software is reasonably responsive, it's not what I'd call super speedy. Even the world's most complete spec sheet loses some luster when your software has a tendency to stammer, and some of this stuff is just vintage Samsung. The swipe over to Bixby has the same momentary delay that the swipe over to Flipboard has had for generations. Hopefully the 7.1 update will help with some of this, but who knows? I spent most of my review period with the larger S8 Plus, whose bigger battery usually saw me to the end of a 14-hour day with at least 20% to spare. Samsung's optimizations deserve some credit for that. The phone routinely puts unused apps to sleep and it ships with the display resolution set lower than the hardware is capable of. I think this is good. In my view most folks would rather have the extra bit of battery than an extra bit of sharpness. Fortunately, with both versions of the S8, you have no shortage of options for topping up the tank. Dual-mode wireless charging, fast wireless charging, and Quick Charge 2.0 via USB-C. Stick with me folks, we're down to the loose ends. It's sad not to see Samsung adopt dual cameras this year. Many of the shots I took would have benefited from the wide angle lens of the LG G6. Voice calls are great though. The phone is comfy to talk on and noise canceling works well, even through stiff Gloucester gusts. The speaker phone is in the exact wrong place for gaming because you're always gonna be blocking it by accident but at least it's loud. The S8 is compatible with the new Samsung Gear VR headset, now with a cute hand controller, and don't forget about DeX. That's the dock that turns it into a faux desktop computer which I'll review separately when I get my hands on one. Then there's some nice future-proofing. Bluetooth 5.0 and more acronyms than you can shake an antenna at, to give you gigabit speeds where available. Finally, the phone comes with $99 AKG earbuds that are apparently super fancy, but to my admittedly untrained ear, they sound like most earbuds out there. So, is all this worth the price of admission? Well, not if you're pinching pennies. $720 is the lowest price you're gonna see for the S8, and it tops out at $850 for the Plus. If you're shopping unlocked, you can get 75% of these features for 50% of the price, with something like the Moto Z Play or OnePlus 3T. But if you're buying from your carrier, as most Americans still do, then you're only talking 25 or 30 bucks extra a month and in exchange, you'll be getting something special. Samsung used to sell a lot of phones because it marketed the most, not necessarily because they were the best you could get. With the Galaxy S8, the marketing will still do the bulk of the work, but customers will also be getting one of the sleekest, most capable smartphones ever made. So yeah, buy it. Just keep in mind that your neighbors probably will, too. Subscribe to Mr. Mobile on YouTube for more videos just like this, and so you don't miss out on a big giveaway coming very soon. Til next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "Samsung",
        "phone",
        "camera",
        "Samsung Galaxy",
        "screen",
        "Android Central Galaxy",
        "Galaxy",
        "Bixby",
        "phones",
        "Samsung Gear",
        "important smartphones",
        "Android",
        "home screen",
        "Michael Fisher",
        "Samsung offers",
        "Samsung tendency",
        "works",
        "work",
        "vintage Samsung",
        "Samsung optimizations"
    ],
    "transcript_entity_values": [
        "AKG",
        "Virtual Shot",
        "Bixby",
        "Flipboard",
        "Samsung",
        "Android Central's",
        "720",
        "only half",
        "the year",
        "the Galaxy S8",
        "a week",
        "G6",
        "5.0",
        "YouTube",
        "Moto Z Play",
        "four",
        "AMOLED",
        "25",
        "Google Pixel",
        "75%",
        "Mobile",
        "two-year-old",
        "this year",
        "Gloucester",
        "OnePlus",
        "5.8",
        "A couple years ago",
        "7.1",
        "five",
        "50%",
        "the S8 Plus",
        "USB-C. Stick",
        "Samsung Gear VR",
        "Bixby",
        "Galaxy S8",
        "Bixby Vision",
        "Quick Charge 2.0",
        "LG",
        "30 bucks",
        "99",
        "14-hour",
        "Samsung Galaxy S8",
        "850",
        "6.2 inches",
        "Google Now",
        "at least 20%",
        "Americans",
        "S8 Plus",
        "Michael Fisher",
        "S8",
        "one",
        "Android",
        "YouTube"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "PERSON",
        "DATE",
        "DATE",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "MONEY",
        "MONEY",
        "TIME",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "WORK_OF_ART",
        "PERCENT",
        "NORP",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "GPE"
    ]
}