{
    "id": "MkEWujqmeMI",
    "title": "Protecting your data inside the Home of the Future",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-08-27T13:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=MkEWujqmeMI",
    "category": "Science & Technology",
    "tags": [
        "security",
        "digital security",
        "data",
        "data protection",
        "cybersecurity",
        "home security",
        "smart house",
        "smart home",
        "grant imahara",
        "data privacy",
        "privacy",
        "personal data",
        "internet data",
        "hacker",
        "data collection",
        "facebook cambridge analytica",
        "smarthome",
        "home",
        "future house",
        "future home",
        "modular home",
        "real estate",
        "building",
        "house",
        "prefab house",
        "future",
        "home automation ideas",
        "architecture",
        "technology",
        "gadget",
        "gadgets",
        "mythbusters",
        "tech",
        "latest updates",
        "how to",
        "diy",
        "review",
        "verge",
        "the verge"
    ],
    "views": 432105,
    "likes": 6325,
    "comments_count": 290,
    "description": "Homes have always served to protect both the occupants and their valuables. Our Home of the Future is no exception, except it now needs to fortify itself both physically...and digitally. Join Grant Imahara as he investigates the best ways to secure your home and all of its valuable data.  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(techno music) - The home of the future will be more secure than the house of the past, because it's protected by cutting edge technology. The front door has a smart lock, there are cameras around the perimeter that can give us a live video feed, and our front doorbell can alert us when someone's approaching. All this tech is meant to instill absolute confidence that I'm as secure as I can be from any intruders. But tucked away quietly in a corner of my home office is this, a simple unassuming printer. And in the home of the future, it has the potential to be an open window to my digital self. (techno music) - All these connected devices are somewhat like windows you're adding to this house. All of them are an opening that needs to be secured, an opening into the network in this case, into your data. The general security of your network is only as strong as its weakest link. - This is Nadir Izrael, co-founder and CTO of Armis Security. His job is to assess and secure computer systems. All the devices we see in this home are in fact computers. These are not just devices, they run code, they do everything your laptop can do, except they lack the inherent security that you can put on your laptop. - So I'm used to having my computer have anti-virus software, that's common but the other devices, the printer? - Right, these used to be dumb simple devices, but now they are basically computers. That printer actually runs a standard operating system. A very old one too. And that's very usual these days. What that means? It can itself contract viruses, malware, so it's not just a printer. - Or a thermostat, or a refrigerator, or a ceiling fan, or any number of devices that populate the internet of things. As we learned in our last episode of connecting this home, internet of things devices are still in their infancy. As a result, products are designed more often with connectivity first and security second. Okay, so you might be asking, should I be nervous that my smart light bulb could be used to hack into my bank account? Actually, it's not likely. - It's rarely the case where someone would target you specifically and your devices. What's more common is that you're basically a target of a wide scale campaign that's opportunistic. - He's right. Most cyber attacks aren't targeted at specific people. Since they rarely make much money off any single account. Hackers are trying to take over thousands of accounts at a time. So the best course of action is making yourself less of a target compared to other users. And it's not that difficult. Even basic security measures can put you ahead of many others. And in most cases using services like two factor authentication would put you in the top five percent of accounts. - It's basically around changing passwords, keeping software up to date, closing down connections you don't use, using password protection where you can, everything that you can do to kind of lower your profile, secure things. For example when you have a car alarm, it doesn't prevent a very motivated person from coming and taking your car. It just makes that care less of a target of opportunity. - There is however, another source of valuable data in the home. Its occupants. (techno music) In our home of the future, I can control almost every device with just my voice alone. Thanks to our Alexa and a slew of Alexa enabled products. But these abilities are also able to be tracked, cataloged, and stored. Building out a profile of my behaviors inside my home. And for tech's biggest companies, that data on my home life is extremely valuable. - An analogy could be the wild west. You know when it was all about the homestead. Grabbing the land. Having the square footage. Where the real value was what do you own under that land. We're advancing into all of this new digital interfaces while not considering the mining right to the real value which really is the data. - This is Anne Boysen. A futurist who runs a strategic consulting business here in Texas. And she doesn't see this business model changing. - The whole incentive is to share data, and I don't see that ending anytime soon. We're going to have to at some level opt in to that. - What a concept. Privacy as a commodity. - Right, exactly. Your home life becomes commodified, because you can use your data as a currency. You can use it to offset the costs that you always would have had and that becomes part of the business model. Take Vizio, a TV manufacturer who made a name for themselves offering quality TV's at aggressively competitive prices. Part of the reason they were able to offer their product at such a reduced rate was that they were collecting and selling their users data, and in 2017 Vizio had to pay 2.2 million dollars in fines because of illegal data collection on more than 11 million TV's. Despite those fines and all the bad press, Vizio TV's are still popular, and are still collecting this kind of data. Only now consumers have to choose to opt in. Instead of being signed up automatically. But it feels like a stretch that customers would read the terms of service before making a purchase. - If you're struggling to get by, you don't have the luxury to think about your privacy, and then you become much more easily a target for someone who will be willing to trade their personal data for that kind of convenience. - I don't have a personal assistant in my house. I don't have Alexa, or Echo, or Google Home, and the reason is that I don't wanna be recorded 24/7 and I understand maybe the processing has to happen somewhere else, but that's something that as a consumer I object to. And that's why I don't have that device. - Companies are already starting to hear the new demands and the fears from their consumers. Particularly in the aftermath of the scandal with Facebook and Cambridge Analytica, started a new awareness where people started to make more demands of the companies around them. - We didn't take a broad enough view of our responsibility, and that was a big mistake, and it was my mistake, and I'm sorry. - Well we've already recently seen in the EU, the sweeping new privacy legislation called the GDPR which already now have huge consequences for technology companies that are collecting data. I think we might be seeing some similar types of legislation. Perhaps not as pervasive, so we're starting to see already that the tech companies are starting to adopt a much more holistic view where it's not only about what can we do technology wise, but what do people actually want in their homes. - While governments, companies, and public opinion try to create order in this wild west of data collection, the best thing we can do as consumers and users of these devices is be aware of the trade offs. Because if we're gonna fully secure our home, we need to first decide what's worth protecting. Thank you so much for watching. Now you've seen how we're securing our home of the future, but what devices would you use, and how would you protect them. Let us know in the comments below and we'll see you next week with more.",
    "transcript_keywords": [
        "home",
        "data",
        "devices",
        "cutting edge technology",
        "protected by cutting",
        "cutting edge",
        "security",
        "companies",
        "secure",
        "target",
        "printer",
        "future",
        "home life",
        "Alexa",
        "Vizio",
        "house",
        "edge technology",
        "device",
        "things",
        "front"
    ],
    "transcript_entity_values": [
        "Cambridge Analytica",
        "Google Home",
        "Vizio",
        "CTO",
        "five percent",
        "Nadir Izrael",
        "Echo",
        "2.2 million dollars",
        "2017",
        "EU",
        "more than 11 million",
        "over thousands",
        "Armis Security",
        "Alexa",
        "two",
        "Anne Boysen",
        "Facebook",
        "GDPR",
        "next week",
        "these days",
        "second",
        "Texas",
        "Vizio TV's",
        "first"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORDINAL",
        "GPE",
        "ORG",
        "ORDINAL"
    ]
}