{
    "id": "mKoyH27643Y",
    "title": "Ive never hung a TV this large before... What is NanoCell 8K?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-07-31T13:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=mKoyH27643Y",
    "category": "Howto & Style",
    "tags": [
        "8K TV",
        "best 8k TV",
        "Nanocell",
        "LG Nanocell 4k",
        "Large tv",
        "big tv",
        "Nanocel TV",
        "nanocell vs oled",
        "nanocell vs QLED",
        "pure colors",
        "Nanocell TV 2020",
        "Best TV 2020",
        "Gaming TV",
        "lg nanocell 8k"
    ],
    "views": 1341393,
    "likes": 53348,
    "comments_count": 3169,
    "description": "Today we are giving this MASSIVE TV to some kids who deserve it. Huge thanks to LG for sponsoring this video! TV Prices are here: 86 4K NanoCell TV:  75 8K NanoCell TV:  (For promotions, click where to buy.) TV's are everywhere. And the technology for HUGE Tv's is always improving. Today we are going to hang a huge TV on a concrete block wall. Ive never hung a TV this size before... So it should be interesting! Huge thanks to the Boys and Girls Club of Salt Lake for letting me film. I hope you enjoy the TV!   See the comparison between OLED and QLED here:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://lgnanocell.co/Zacks4K",
        "https://lgnanocell.co/Zacks8K",
        "https://youtu.be/226kWMOVGGc",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "[Music] So personally, I think the solution to all the world's problems is education. If kids can keep their minds active and learning when they're young, they turn into smart, responsible adults. Today I'm at my local boys and girls club which is a safe place for kids to come and keep their minds active and productive in their down time. And at this boys and girls club, they left the facility today with a TV this size. And they'll be returning tomorrow with a TV this size. This is an 86 inch LG NanoCell TV, and I'll be mounting it on this wall for the kids. It should be pretty fun especially in a room this size. The large TV will fit perfectly. The boys and girls club is a national organization that's been around for about 100 years. And since it's a second home to a lot of kids, they are definitely deserving of a new TV. Huge thanks to LG for sponsoring this video. Let's get started. [Intro] *Razor cutting noise* Unboxing the TV is easy enough. LG makes it easy with just one piece of tape along the top. And then 6 of these little black plastic things that hold the two halves of the cardboard together. Once each of those are out the two halves can fall apart and the TV is very well protected with a bunch of white Styrofoam...and a giant metallic bag...which keeps the aliens from commandeering the TV during transit. Actually I have no idea, but it looks cool. Even without turning it on I think the kids are going to be pretty pumped to replace their current unit with this one. So inside the box, the TV does come with little legs of its own, but we are going to mount it to the wall to kind of keep it out of arm's reach and to have it, you know, a little more permanent and out of the way. So the back of this mammoth TV has 4 screw holes right here. And then over here I've already put this bracket in place. And then this bracket is the thing that clips onto the wall after we take that mini TV down. The little black spacers are to make sure that the screws don't go through too far or too deep, because if they go too deep they might damage the screen. Looks like their wall used to be purple. Now the whole wall will almost be black. So if you were going to install this TV in like a theater room or something, normally you want the TV to be eye level with wherever you're sitting so you're not straining your neck to like look up at it or anything like that. But since this is going in an area where people are going to be standing for one, and there's lots of kids around, we want it to be at least four and a half feet from the ground. So we're going to install it a little bit higher than we normally would in your theater room. Alright, so we have currently found the center of the wall and we have the height that we want the top of the mount to be. Now we're just going to level the mount so the TV will be level and we're done with it. So in the past you've seen me mount TVs on like a normal wall with a wood backing. This wall is made out of concrete blocks, which is a totally different ball game. This is a carbide tip drill bit and we're using a hammer drill to make the holes for the bracket. The difference between a hammer drill and a regular drill is that a regular drill just turns around. A hammer drill actually hammers at the same time it's rotating which is extremely useful when we're trying to go through concrete. I'll put a piece of tape around the drill bit so I don't actually drill too deep. [Drill sounds] So the mount is currently hanging on the wall. It has been tested to 500 pounds. The bolts we put in there are way beyond that, and the TV only weighs 115. So we should be plenty safe up there. Now it's time to lift it up and hang it. Oh wow. Higher. I'm in, you in? [Riley] Think so. [Zack] Double check. [Riley] It's not falling. [Zack] Woo! Alright, it is on the wall and so much bigger than the one that was here before. It's pretty crazy. So one thing that is nice about hanging it is that there are these little Styrofoam things on the sides. You don't want to put too much pressure on the screen as you're lifting it up. Most of the pressure needs to be underneath and behind because those are much more structural and not as fragile. Moment of truth. There we go! So at the beginning of this video I said this was a NanoCell TV, which means it's a bit different technology than what we've seen on OLEDs in the past. This particular technology is made up of a nanoparticle filter which kind of refines the projected image and makes what you see right here in 4K. That nanoparticle filter is able to filter out and reduce the impure colors and just leave behind the true colors that are more vivid and color accurate. It's similar to the LCD screen technology where it has the projected image in the front, and a back light behind it. The back light is still LED so it's still power efficient and has realistic colors, and still projects its 4K image at 120 hertz. Which, if you've been paying attention to modern cell phones, 120 hertz is a really fast refresh rate. Plus, with the speakers built directly into the TV right behind the image, it gives the sound a more 3-dimensional effect. So actually I kind of lied about LG donating a TV to the boys and girls club...cuz they're not just donating one TV, they are actually donating two because the NanoCell TV also comes in 8K. This is a 75 inch 8K NanoCell TV and it's going to a different boys and girls club that's also nearby. But I think they're going to be pretty excited about this one. That same NanoCell technology with the nano particle filter in front can be condensed down to display even more pixels. 8K resolution has quadruple the pixels of a 4K screen, which is pretty impressive. And NanoCell is more economically priced than some of the other TVs that we've seen. So if you're looking for a massive TV for your home theater setup or living room, NanoCell might just be the way to go. Since there's not a whole lot of content that's actually filmed in 8K resolution, LG has stuck in an A9Gen3 AI processor that does the upscaling from regular 1080p or 4K images and kind of changes them into 8K so everything just looks better. Huge thanks to LG for sponsoring this video and for donating two massive TVs to a good cause. I'm sure the boys and girls at the boys and girls club are going to appreciate it greatly. Now I'm going to box this one up and take it down to the other facility. I'll leave a link down in the description if you want to check out the current pricing of the 4K or 8K NanoCell. If you have any questions leave them down in the comments. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "boys and girls",
        "girls club",
        "wall",
        "drill",
        "problems is education",
        "NanoCell",
        "world problems",
        "girls",
        "boys",
        "kids",
        "club",
        "hammer drill",
        "minds active",
        "mount",
        "pretty",
        "image",
        "drill bit",
        "room",
        "bit",
        "size"
    ],
    "transcript_entity_values": [
        "NanoCell TV",
        "NanoCell",
        "about 100 years",
        "115",
        "Zack] Woo",
        "6",
        "8",
        "1080p",
        "Instagram",
        "two",
        "K NanoCell TV",
        "Zack] Double",
        "tomorrow",
        "the nano particle filter",
        "500 pounds",
        "A9Gen3 AI",
        "4",
        "120 hertz",
        "Styrofoam",
        "86 inch",
        "second",
        "at least four",
        "LCD",
        "today",
        "a 75 inch 8",
        "Riley",
        "3",
        "LG NanoCell TV",
        "one",
        "Twitter",
        "Drill",
        "LG"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG"
    ]
}