{
    "id": "MlD3u6XxtaI",
    "title": "Meta tracks you. I’m shocked.",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-08-13T04:15:41Z",
    "video_url": "https://www.youtube.com/watch?v=MlD3u6XxtaI",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Meta",
        "Facebook",
        "Instagram",
        "tracking",
        "iOS",
        "iPhones",
        "App Tracking Transparency",
        "javascript",
        "Facebook tracking",
        "Instagram tracking",
        "Meta tracking",
        "iOS apps",
        "app tracking"
    ],
    "views": 469912,
    "likes": 27924,
    "comments_count": 730,
    "description": "Sign up for PostHog today at:    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:   --------------------------------------------------- Timestamps: 0:00 and that's Techlinked!  0:06 Facebook, Instagram TRACKS YOU?? 1:16 Intel Arc A750 benchmarks 2:14 ByteDance employee allegations 3:18 PostHog 3:48 QUICK BITS 3:55 Meta chatbot attacks Zuck 4:28 Ring Nation 4:54 More foldables! 5:21 Google cloud gaming search results 5:53 Pole-mounted EV chargers  FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://lmg.gg/PostHog",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/hBA86",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- Tech news. It's what we all want. And now we all can, and that's TechLink. This week, frustrated tech nerds had to deal with news outlets circulating the shocking revelation that the iOS apps for Facebook and Instagram track user activity inside their in-app browsers. My whole reality! Scott... - [Man] Mark, how could you? - I will say that the source of the story, a blog post by developer Felix Krause, is interesting because it finds direct evidence that Meta's apps inject JavaScript code into every website a user visits, using those app's built-in browsers, which allows the monitoring of links clicked on, text input, and screenshots. Meta actually responded to Krause and gave him a bit more details about how things actually work which is almost enough to forgive them. Good job. I guess people think this is a big deal because Apple's app tracking transparency feature was supposed to prevent this kind of thing, which is why Meta waged a PR campaign against it. And now all the iPhone users who are like, \"Whew, thanks Apple. I'm safe now,\" are getting a little bit of a wake up call. - [Man] You're not safe. You're never safe. - I'll find you. Yes, Meta tracks you to the maximum it possibly can, and you should have known that. But I guess now we know a bit more how they do it, so... Intel is persevering in marketing its Arc Gaming graphics cards despite recent rumors that the whole product line could be delayed or even shut down all together. And that's what it means to be on a team. Team Blue! Team Blue! You're supposed to chant. Anyways, blue boys Ryan Shroud and Tom Peterson can be seen in a new video comparing the Arc A750s performance to that of NVIDIA RTX 3060, and the graphics guys appear to be pretty honest about the fact that the A750 wins some, loses some, and ties some, unlike whoever's in charge of Intel's CPU marketing. Sure, it's only DX12 and Vulcan-compatible games that are being compared, which gives Arc cards a bit more performance than in DX11 and OpenGL, but are any of us cheering for Intel to not release these cards? Just get 'em out there. Sure, they might not be the best, but you still gotta (squawk) send it. - [Man] I don't want the option to buy them. - Get it outta my site! And TikTok parent company ByteDance has at least 300 employees who used to work for Chinese state-owned media, and a dozen or so may still do so, according to a new report from Forbes. - [Man] I thought the rest still did. - I find it hard to imagine working 30 hours a day for two employers, but who knows? The report's writers based their claims off ByteDance staff's LinkedIn profiles, insinuating that the Chinese government may have some control over the company's operations. But some analysts are pointing out that being, well, any kind of journalist in China essentially means working for state media because almost all media outlets are state media over there. But of course, some analysts would say that, especially since the official guidance and ByteDance's official PR handbook, leaked by Gizmodo, instructs employees to downplay the fact that TikTok or ByteDance has any affiliation to China at all. Affiliation with China at all. As we've pointed out many times here, you're being tracked by Meta, China, maybe some aliens. There's a bunch of people. Living in the woods is still an option. Now it's time for Quick Bits, brought to you by PostHog. A suite of product and data tools built on the modern data stack. It has got everything product teams need: analytics, heat maps, session recording, and more, all in one easy-to-use platform. Best of all, PostHog is open source. So you can host it on your own infrastructure, giving you greater control over who has access to your user's data. PostHog's app system works seamlessly with tools such as data warehouses, both for importing and exporting data. Take your product analysis to the next level with PostHog, using the link below. Quick Bits. Ah, those are the best. I love those guys. - [Man] Those little dudes? - Those little duderenos. Last week, Meta released an AI chat bot called BlenderBot 3, as a way to research conversational AI, and the internet has pretty quickly gotten it to bite the hand that feeds. - This is just so Mark can speak. - Asked about Mark Zuckerberg, the bot told reporters that he did a terrible job testifying before Congress, and that it's concerned for our country. The AI went on to say Zuck exploits people for money and he doesn't care. However, it did admit to PC Gamer that Mark is cooler than Dragon Age, so maybe there's some parental love there still. Amazon-owned MGM Television has announced Ring Nation, a new reality show featuring lighthearted content captured on Amazon-owned Ring security cameras. You know, the ones that have repeatedly given police their footage without user consent? It seems like the show, which is hosted by Wanda Sykes, will only consist of content willfully submitted by Ring cam owners, But this is only a step or two away from a Black Mirror episode, so it still gives me the weeby-geeblies. That's what I call 'em. You thought Samsung foldable phones were the only ones in town? Well, yeah, they pretty much are, in North America at least. But Chinese customers will soon have the option to get the new Moto Razr 2022 with a bigger, 144 Hertz display and a new dual camera system. Or Xiaomi's new MIX Fold 2, which looks just like the Galaxy Z Fold 4, but thinner. This has been your semi-occasional reminder that yes, folding phones are a thing; they're just still too expensive. Don't worry. We'll keep you posted. Google's faith in Stadia has sunk so low that it's begun helping users jump into games on other cloud-gaming platforms. - [Man] So we all agree there. - Some users spotted a play button next to some game titles in Google search results recently, which took them right to that game's page on GEForce Now, Xbox Cloud Gaming, Amazon Luna, and yeah, of course, it did it for Stadia as well. Maybe Google's taking more of a hard parenting approach now, like Stadia has gotta enter the real world sometime. - [Man] It's tough love, Stadia. - You can't just stay on the bench. You gotta get up. It's gonna get destroyed. And a utility company called National Grid has partnered with the city of Melrose, Massachusetts, to install EV Chargers mounted up on telephone poles as a prank. You can't get to them. - [Man] What? - Good job. Good luck. - Lol. We still like oil. - No, just kidding. You connect with your phone and the charger lowers the cord down. This is a great idea. I didn't put this in here for any other reason. - [Man] You can climb buildings like a grappling hook. - And I wish there were more of stories like that, but we're fresh out. Come back on Monday for more and don't let anyone tell you different. Whoa.",
    "transcript_keywords": [
        "Meta",
        "China",
        "bit",
        "Stadia",
        "Mark",
        "Quick Bits",
        "data",
        "Facebook and Instagram",
        "Team Blue",
        "Meta apps inject",
        "Meta apps",
        "user",
        "Arc",
        "Instagram track user",
        "Chinese",
        "Blue",
        "media",
        "ByteDance",
        "app",
        "product"
    ],
    "transcript_entity_values": [
        "Arc",
        "Dragon Age",
        "Stadia",
        "TikTok",
        "A750s",
        "Intel",
        "Hertz",
        "Mark Zuckerberg",
        "one",
        "NVIDIA",
        "Gizmodo",
        "iPhone",
        "30 hours",
        "ByteDance",
        "a dozen",
        "PostHog",
        "Mark",
        "JavaScript",
        "Ring Nation",
        "MIX Fold 2",
        "Google",
        "Ryan Shroud",
        "Amazon",
        "National Grid",
        "This week",
        "BlenderBot 3",
        "Congress",
        "Massachusetts",
        "EV Chargers",
        "AI",
        "Tom Peterson",
        "Arc Gaming",
        "Zuck",
        "TechLink",
        "Instagram",
        "Last week",
        "Vulcan",
        "Samsung",
        "Quick Bits",
        "Xiaomi",
        "Stadia",
        "Black Mirror",
        "Xbox Cloud Gaming",
        "China",
        "North America",
        "Krause",
        "Chinese",
        "at least 300",
        "Facebook",
        "two",
        "Moto Razr 2022",
        "144",
        "the Galaxy Z Fold 4",
        "poles",
        "Felix Krause",
        "PostHog",
        "Amazon Luna",
        "Monday",
        "Forbes",
        "Scott",
        "Team Blue",
        "MGM Television",
        "Wanda Sykes",
        "CPU",
        "GEForce Now",
        "Melrose",
        "Apple",
        "Meta"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "LAW",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "GPE",
        "LOC",
        "PERSON",
        "NORP",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "FAC",
        "NORP",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG"
    ]
}