{
    "id": "mlVCK6UFwLs",
    "title": "The iPad is LIFE CHANGING!!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-11-30T18:06:43Z",
    "video_url": "https://www.youtube.com/watch?v=mlVCK6UFwLs",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "ipad pro",
        "ipad pro review",
        "procreate",
        "cory basil",
        "art",
        "ipad art",
        "painting",
        "something beautiful"
    ],
    "views": 354877,
    "likes": 10940,
    "comments_count": 1402,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Jusine and today we're talking about the brand new iPad Pro 2 that just came out. I'm really excited about this thing and I've been testing it out for the last couple of weeks and this thing is amazing. I told you I was gonna do a follow up video for my unboxing video but I was trying to think of, what is something different that I could do. The specs are out there, you've seen all of the Geek bench reports. The screen resolution is incredible, there's no face ID, there's no home button, the new Apple pencil to is really fast, you can dock it, you can charge it, it connects automatically. That's all really great but I think one of the most important things to take away from all of this is, you don't really need the latest and greatest tech to create, which is kind of ironic coming from someone who loves having the latest and greatest tech but I started with basically nothing. I made most of my first YouTube videos 12 years ago, kind of crazy to say that out loud, on just my computer with an eyesight camera, using the built in microphone. That's it. One of the things that for me is important is when you're creating, don't be hindered by what you don't have. Use what you do have and I wanted to introduce you guys to my friend Corey, who I've known for a really long time. Basically before I even started my YouTube channel and I've sort of followed his career creatively and most recently he told me that the iPad changed his life and I was like, what? Tell me more so I sat him down for an interview, hopefully we can get him to say that the iPad changed his life 'cause that's a really, really great quote. Anyway, let me introduce you to my friend Corey. (light music) - I'm Corey Basil, I'm an artist who does fine art painting, illustrating, writing novels, poetry. I'm also a musician, I sing, I write songs, I play guitar, I play piano. I currently live in Franklin, Tennessee, it's a little south of Nashville and every day I wake up in the morning, I ask myself, what can I make today? (light music) As much as I love working with traditional mediums, the Apple products have really revolutionized and changed the way I do everything and there's no way I could go back from it. The most recent thing I've done is release two songs and the iPad came in handy there. I was able to lay down voice memos of different ideas and how I wanted to sing different licks of the songs and I hand painted the cover traditionally with oil pant, took a picture with my iPhone, put it in the iPad, laid some text over it and the cover's finished. Beauty in everything but not That I have grown it's so hard to see Past my mind that knows Everything is falling apart What am I to do with my heart? I think one of the greatest myths is people think that success happens overnight and that's not it at all. I think that all success begins as a failure. There's nothing wrong with taking risk and failing, it's actually a quite beautiful thing to fail because you learn and you get up and you try again and then when you're finally successful, you have really a mountain of your own failures to stand on top of and it's, it may sound negative but it's a really beautiful thing to look back and see how far you've come and what you've worked through and persevered. I'm grateful for all of the challenges in my journey as a creative and I wouldn't have it any other way. (yelling) - Okay, cool. (laughing) - The liquid feature. - Oh my God, look, we're out of here. Just take a picture with your mind and draw it later. The world was on fire and no one could save me but you It's strange what desire will make foolish people do I never dreamed that I'd need somebody like you I never dreamed that I'd lose somebody like you - We have been friends for such a long time like. - Very long time. - 2006. I think before I even started my YouTube channel. - That's correct. - That's a long time. It's kind of cool because I feel like I've been following your creative career since that time and you've done so many different things. How did you even get started? I mean I feel you've been into art for like a very long time like since you were little, was that your first passion? - Yeah, art was first, drawing as long as I can remember and wanted to be a Disney animator when I was a little kid then I saw my first rock show when I was about 15, 14 maybe. - Yeah. - And that changed everything. - What was your first show? - It was DC Talk. - Wait okay so, weren't you opening for Kevin Max when I met you then? - I was, yeah. So kind of a cool circle in many ways. The digital transformation was amazing. First time I drew digitally, it was on one of those little tablets with the pen and it was very minimalist, it was probably like a three by three. - Oh, that's crazy. - And I was just blown away that I could draw and it would translate. So I got an iPad and the Apple pencil and that changed everything, I mean I use it for almost everything. The only exception is Photoshop, which I'm waiting for that to happen. - That'll be so soon, which is super exciting. - Soon? Amazing. - Yeah, I mean 2019, I'm assuming. - Yeah, I've written two books on the iPad, 110,000 word novel, a lot of poetry and short stories. I've done a slew of digital paintings. I then reproduce prints of and sell those at my gallery in Franklin. Laid down scratch ideas for songs. - [Justine] And what do you use for your illustrations? - I use Procreate. I love Procreate so far. - That's cool because you showed my that you can do time lapses of the drawings. - Yes, you can animate it. This is my first piece trying out the new iPad Pro and the new Apple pencil 2. I titled this piece, The Boy Who Hung the Stars. - [Justine] Tell em about the lunchbox. - Justine wanted a lunchbox so we have a lunchbox in the painting, it's a Fishboy lunchbox. - [Justine] What's Fishboy? - Fishboy is my novel, The Perils of Fishboy. And there's a lunchbox. - Co creates. (light music) Do you have a favorite piece that you've created like on the iPad? - I think my favorite piece is called, Lost in an Ice Age. It's got some primitive graffiti work. - So you also have a gallery. - I do. - So people can come in and buy things or see your work. - Yeah, I've got a little gallery in Franklin, Tennessee and it's appointment only or the first Friday of every month we have an art walk, which is really fun and I have wine and donuts and great art and there's a little trolley that goes by my place to pick you up and take you to other locations. - That's cool. - Yeah, it's great. - And donuts? - And donuts. - I'm sold, if any of you guys are in Franklin, you should definitely check it out. - [Corey] It's called Imaginebox Emporium. - I keep talking about how many things you've done because it's just, it is really overwhelming. I mean you're a graphic designer, I even remember sending you my old flash files. You guys probably don't even know this but I used to be a web designer and I was real into action script and flash and then you started getting into it. - Yeah, I loved it and I was having the hardest time figuring out mathematics or what have you of the animation and so you'd zip me up and send me a flash file and I opened it and I remember I just drew this rough sketch of a guy and I opened up the file and I hit the space bar and the guy's eye fell out and I was like, I lost my mind. That's amazing, it moved! - So you also just released two songs. - I did. - And I feel like, I don't know if a lot of creative people I feel like go through kind of like this round about way to get back to something that they have always loved to do. - Yeah. - And so for you, you kind of were into music and then kind of pulled away from it? - Kind of like everything, you just, if there's a door that opens, you just walk through it. I've been learning that the more and more, the older I get that we do as much as we can to try to plan and plot out, okay this is gonna happen, this is gonna happen. What's worked best is just to you see a door open, you just walk through it and whatever happens, happens. If the door shuts, so be it, another one will open. - Or maybe you're stuck in there and you're somewhere cool. - Yeah. - I just want to. - Just open a window. - What if there's no window? - Then I would leave. - Okay, that's true. - I need windows. - It's just crazy how technology has really changed everything and I think even for me to, if people weren't doing the things that I wanted so it's like you make your own career path and when people tell you no, this isn't something that you can do or should do and you should stop doing that, it's like if you're passionate enough and you just don't quit, I think that's another thing that has been interesting. - Please don't quit. - Is like well how are you still. - If you feel it, do it. - Yeah, like how are you still making YouTube videos after like 12 years 'cause I haven't stopped and I still really love what I'm doing and I think that is important so if there is something that you love doing and it may not be working now, I mean maybe several years later. - Yeah. - Now you're releasing music and it's super exciting. - I mean I was okay with just not going back to music. - Yeah. - I mean I have an old piano, imagine that, it's like 1900's. - He likes old things, like vintage. - I love old things. And I've always song written on the side just to. - Yeah. - To fulfill that inside of me and play my piano to take a break from painting but I never thought that I would put anything out or just kind of okay, now I'm doing the writing thing and I'm doing the illustrating and fine art painting and now I'm putting out music again so you never know. - You know, it's really cool. - Sorry, step on it. - Oh no, I was just saying that's cool. - It is cool. - So you actually did a painting for me and it's in my place and I think we talked about this. - It was a lot of fun. - Like two years ago. - We did. - [Justine] Yeah so I just recently got it, it's amazing and I feel like this is a different style than what you're normally doing. Is this like a different thing? - I've never been that into abstract painting before and I took three or four months and used that time to fail over and over again, took the risk to discover what abstract painting would be for me. - [Justine] Yeah. - I studied color theory, how that worked, how the balance works, composition work of others. So after all of that, all the color study, I was able to birth a whole new era of me that was abstract work and I thought who is gonna need this the most, who could use this, who could benefit from this vein of my work so I decided to start a whole branch and I call it Maison Basil and it caters to new home builds, interior designers, businesses, restaurants, that kind of thing. - As far as inspirations go, like who are your biggest inspirations? Art, music? - Inspirations in music, I've been listening to a ton of Sting. - I thought you said Stain. I was like, you guys remember Stained? - I do remember Stained. - Me too. - My cousin loves Stained. - I used to be a big fan. And it's been awhile - Mike Shinoda is from Lincoln Park and they were a big influence on me, not only sonically, musically of Chester's voice, all time favorite. Just in the spirit of how they wrote lyrics and music to really touch people and to really hit people where they are and that's always been such a huge part of why I write and really all of my art is just to touch a place in their heart that they didn't realize needed. - Yeah. - Needed it, you know. Both Hemmingway and Bukowski taught me to keep it simple. Painting, Carvagio is my favorite painter hands down. I feel a lot of similarities with Van Gogh. - Well thank you so much for sharing. I've always been so inspired by just the massive amount of work that you have created and I've always wanted to tell your story so thank you guys so much for watching, make sure you go check out Corey on Instagram, you're not on Twitter anymore. You're on Facebook. But go check it out, I'll put all of his links below so if you guys are in Franklin or anywhere nearby, Nashville, how far is Nashville to Franklin? - Nashville's just 20 minutes up the freeway. - Oh cool, go check it out. Thanks for chatting with us. We'll see you guys later. Bye! - Thanks, bye. - Shut up! Like a lot of it is self taught as well, right? - Yeah, all of it is. (laughing) So I got an iPad with the iPencil and that. - It's called the Apple pencil. (beeping) - I made the leap into the. - The iPad? (laughing) He got an iPad! - So I made the leap and I jumped into an I. - Pad. - So I got an iPad Pro. - Okay. - So I got an iPad Pro. - When did you get the. (laughing) - When did I? I got an iPad Pro - You got an iPad. Wait. Wait, you got an iPad? (laughing) So you told me before (laughing) that you got an iPad. Okay, the sun's gonna go down. So when did you get an iPad? (laughing) is that my dog? - Yeah, it is. - That's my dog, okay. So you got an iPad, that's cool. (beeping) (laughing) - Okay, ready? - Yeah. - Alright. Show my something beautiful today I don't have time to waste Show me something beautiful today I don't have time to waste Don't let it fade away, don't let it fade away Don't let it fade away Don't let it fade away Don't let it fade away Don't let it fade away",
    "transcript_keywords": [
        "Yeah",
        "iPad",
        "iPad Pro",
        "time",
        "thing",
        "cool",
        "long time",
        "things",
        "kind",
        "Franklin",
        "guys",
        "painting",
        "Apple pencil",
        "art",
        "people",
        "Apple",
        "Pro",
        "Jusine",
        "feel",
        "Corey"
    ],
    "transcript_entity_values": [
        "I. - Pad",
        "iPencil",
        "iPad",
        "one",
        "Imaginebox Emporium",
        "two years ago",
        "2",
        "the last couple of weeks",
        "Geek",
        "12 years ago",
        "Apple",
        "14",
        "Justine",
        "Fishboy",
        "Corey",
        "iPad Pro",
        "iPhone",
        "Photoshop",
        "Instagram",
        "three",
        "Procreate",
        "a ton",
        "2006",
        "Nashville",
        "YouTube",
        "Stained",
        "Twitter",
        "Maison Basil",
        "iPad Pro 2",
        "three or four months",
        "Mike Shinoda",
        "Bukowski",
        "Sting",
        "12 years",
        "Stain",
        "Fishboy",
        "about 15",
        "Jusine",
        "Hemmingway",
        "today",
        "Franklin",
        "several years later",
        "two",
        "2019",
        "1900",
        "Chester",
        "Van Gogh",
        "iPad Pro - You",
        "overnight",
        "just 20 minutes",
        "Facebook",
        "110,000",
        "Lincoln Park",
        "first",
        "Corey Basil",
        "Carvagio",
        "Tennessee",
        "Franklin",
        "Disney",
        "First",
        "Kevin Max",
        "the first Friday of every month",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "NORP",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "GPE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "GPE",
        "PERSON",
        "PRODUCT",
        "TIME",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "DATE",
        "CARDINAL"
    ]
}