{
    "id": "MLVDWiVDF7Y",
    "title": "What's in my Tech Bag! v5.0",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-11-25T15:30:20Z",
    "video_url": "https://www.youtube.com/watch?v=MLVDWiVDF7Y",
    "category": "Science & Technology",
    "tags": [
        "What's in my bag",
        "What's in my bag tech",
        "what's in my bag 2017",
        "What's in my Tech bag",
        "tldtoday setup",
        "tld setup",
        "Best Travel Tech",
        "Best Travel Tech 2017",
        "What's in my bag 2017",
        "Best Travel backpack",
        "jonathan morrison",
        "hershel supply co",
        "herschel supply co apex lawson",
        "apex backpack",
        "heritage bag review",
        "2017",
        "MacBook Pro",
        "Space Gray",
        "Space Gray MacBook Pro",
        "2017 MacBook Pro",
        "Review",
        "Unboxing",
        "AirPods",
        "Apple",
        "Sennheiser",
        "HD 4.50",
        "gadget backpack"
    ],
    "views": 428501,
    "likes": 15278,
    "comments_count": 720,
    "description": "New tech bag + my favorite gadgets of 2017. Enjoy!  BLACK FRIDAY 2017 TECH DEALS -  Sennheiser HD 4.50 Bluetooth Headphones!   iPhone X Accessory Deals!   Check out my last tech backpack!  Herschel Apex Lawson Backpack -  2017 Space Gray Touch Bar 15\" MacBook Pro -  DBrand MacBook Skin -  Samsung T5 2TB SSD -  Sennheiser HD 4.50 Bluetooth Headphones!  Belkin Valet Battery Bank/Apple Watch Charger:  Nintendo Switch -  Nintendo Switch D-Pad Mod -  Nomad Rugged Lighting Cable:  Anker PowerCore+ 26800 PD USB-C Charger -  Native Union USB-C Extension Outlet -   Reading Mean iPhone X comments -   Background music via Epidemic Sound:   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/FftItqLWaA4",
        "http://amzn.to/2A4BNSY",
        "https://youtu.be/1yClDITvctI",
        "https://youtu.be/3J_SM3ICVxw",
        "https://herschel.com/shop/backpacks/apex-lawson?v=10276-01619-OS",
        "http://amzn.to/2zkC6Wl",
        "https://dbrand.com/macbook-skins",
        "http://amzn.to/2A7dxPR",
        "http://amzn.to/2A4BNSY",
        "http://amzn.to/2hQQ1MI",
        "http://amzn.to/2zmXoTv",
        "https://www.youtube.com/watch?v=MCUo1SHc7es",
        "http://amzn.to/2A9xmnI",
        "http://amzn.to/2zqmOCs",
        "https://www.bestbuy.com/site/native-union-8-smart-hub-bridge-extension-cord-white/5947246.p?skuId=5947246",
        "https://youtu.be/lHQ4kwXfLbo",
        "https://goo.gl/rMbhQL",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Today's video is sponsored by Sennheiser. Yo guys, Jonathan here. It is time for a brand new \"What's In My Bag?\" Got some new tech and, more importantly, a really freaking cool backpack. So this guy sitting on my back right now, kind of blending into my shirt, is the Herschel Supply Co. Apex Lawson. If you love prime knit, if you love fly knit, or if you love yarn and knitting in general, you will dig this. I've been a fan of Herschel backpacks for a while now but by far this is my favorite in terms of looks and aesthetics because it is so unique from the rest. It looks great, it's comfortable, it's definitely held up in terms of tossing it around while traveling; especially at the airport. And I gotta say, as far as backpacks, this is definitely the most questions I've ever got in terms of, \"what is that on your back?\" Now as far as the backpack, there aren't a ton of compartments and pockets, which I kinda like for a couple of different reasons. One, I generally don't carry that much with me in the first place so it's not more than I need. And two, because it's so simple it keeps things nice and organized. Now as far as the main compartment, you got tons of room for activities. This will house a laptop up to 15 inches. I like the fact that there's plenty of padding and there's an additional compartment for things like a tablet or, in my case, I have a Nintendo Switch sandwiched inside. There's also a couple additional slots I'm using to carry a Samsung T5 SSD and a battery bank. And, really, there's not much that I dislike about this backpack. So, next up, these as the Sennheiser HD 4.50 wireless Bluetooth headphones. And I feel like I've been on a plane, like, every other week for the past two months now and these have been my go-to headphones. First and foremost, these feature active noise cancellation which is so, so amazing on airplanes. It's one of those things you don't truly appreciate until you have it and then you don't have it. But, regardless, it works fantastic on these headphones. On top of that, you are getting stellar battery life. So, without noise cancellation, these will last about 25 hours. But, if you do want to take advantage of that noise cancellation, you're still gonna get about 19 hours which is crazy and pretty much long enough for any flight out there. You have super cushiony ear pads which are gonna make these crazy comfortable. And they also fold up really nicely, which is perfect for traveling. More importantly, you guys that know Sennheiser know they make great, quality headphones. So sound quality is also on point as well. And combine that with active noise cancellation, I can't hear a thing right now and that is the recipe for a great pair of traveling headphones. Make sure you guys check out the link below. So from there, I got everything laid out from my backpack and we will start with the most boring out of this bunch and that is the USB-C Macbook Pro charger that of course goes along with the 2017 15 inch Macbook Pro. It's what I use to edit pretty much all my videos including the one you are watching right now. Got a sweet, leather dbrand skin on here. If you guys want to check that out for yourselves I will drop a link down below. Alongside the Macbook Pro, this is the Samsung T5 SSD which is easily one of my most used pieces of tech. It's compact, but this particular model is packing two terabytes of storage. So it's what I use to edit pretty much every single one of my videos. So the Macbook Pro combined with these crazy speeds makes it perfect for, not only on the go, but also for your desk as well. And, if you don't need this much storage, they also come in a few different flavors as well. Next, this probably the most interesting piece of tech in my bag, this is my Nintendo Switch that I take on the road for traveling, for gaming... But when I'm back, it's kind of become the office, Frankenstein, guinea pig Switch. In this case, whenever Kevin wants to get a crazy tweak or mod, this is what happens to it. In this case, we got this crazy, atomic purple, see through d-pad on here. If you guys wanna learn more about that, definitely make sure you check out his video, which I will link to down below. Next, this is probably the weirdest thing in my backpack, because it is solely used just to charge my Apple Watch when I'm traveling. It is a duel purpose battery bank. What's cool is, there is a built in Apple Watch charger right here, so it's almost wireless in the sense that you pop your Apple Watch on and you are magically charging. Now this would usually get me about four to five charges with my Apple Watch, so instead of taking something I plug into a wall, this is actually all I take on the road and it's perfect for charging my Apple Watch. Next, this guy right here, from Native Union is probably the best $50 that I've spent in a really long time. It's an extension cord, one. So, it's super helpful especially when you're traveling. You got this nice, braided cable and, more importantly, it's like this multi-tool where you got multiple USB ports, you got USB-C, and you actually have two outlets; one here. They're evenly spaced. And it has actually become one of the most useful things I've purchased all of 2017. So if you travel a lot, this has been so, so useful. I cannot recommend it enough. And from there, kind of rounding everything out, we got this super tough, rugged lightning cable from Nomad. So if you travel a lot, you're not gonna worry about this thing breaking or tearing or ripping apart. This I use alongside this monster ANKER power bank which is packing 26,000 milliamps of power. What's also crazy cool is there is a USB-C port and enough juice packing inside this guy to power a Macbook or Macbook Pro. Now, it's not gonna be your main source of power but it's definitely useful when you're in a pinch or in an emergency. And, definitely, if you use the Nintendo Switch, that's gonna be your partner in crime. (dogs barking) So thank you guys very much for watching and if you guys enjoyed this video, make sure you guys go \"dogs fighting in a park\" on that like button. Links to everything featured in this video are down below. This is Jonathan and I'll catch you guys later. (Jonathan laughs) (dogs continue barking)",
    "transcript_keywords": [
        "Macbook Pro",
        "Apple Watch",
        "guys",
        "USBC Macbook Pro",
        "Macbook",
        "Nintendo Switch",
        "Pro",
        "Apple",
        "Watch",
        "backpack",
        "traveling",
        "crazy",
        "Switch",
        "headphones",
        "noise cancellation",
        "make",
        "Macbook Pro charger",
        "Apple Watch charger",
        "things",
        "Sennheiser"
    ],
    "transcript_entity_values": [
        "two",
        "2017",
        "USB-C",
        "50",
        "Apple Watch",
        "the Nintendo Switch",
        "the Macbook Pro",
        "Sennheiser HD 4.50",
        "Sennheiser",
        "What's In My Bag",
        "about 19 hours",
        "the past two months",
        "Native Union",
        "Samsung T5",
        "USB",
        "26,000 milliamps",
        "Samsung T5",
        "about 25 hours",
        "Apex Lawson",
        "Macbook Pro",
        "first",
        "Kevin",
        "First",
        "about four to five",
        "one",
        "Frankenstein",
        "Switch",
        "15 inches",
        "Herschel Supply Co.",
        "ANKER",
        "Macbook",
        "two terabytes",
        "Herschel",
        "Nomad",
        "up to",
        "Yo",
        "Jonathan",
        "Nintendo Switch"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "TIME",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG"
    ]
}