{
    "id": "Mmlv3ksJ2BA",
    "title": "Apple's Sorry... But Not Really",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2019-03-28T18:12:42Z",
    "video_url": "https://www.youtube.com/watch?v=Mmlv3ksJ2BA",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "macbook pro",
        "macbook problem"
    ],
    "views": 1017231,
    "likes": 32753,
    "comments_count": 3112,
    "description": "I've reviewed the MacBook Pro every year but Apple finally admits to a problem on their keyboards that has persisted for 4 years. I hope the 2019 MacBook Pro redesign fixes this issue. A GOOD Apple Keyboard -   2D Discord Server -   Background Music Fili - Up Coast  Follow me:",
    "description_links": [
        "https://amzn.to/2WwCfRY",
        "https://discord.gg/Dave2D",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D"
    ],
    "transcript": "Apple came out with the statement yesterday where they publicly apologized for some of the issues that the third generation MacBook Pro keyboards have had so they said We are aware that a small number of users are having issues with Their third-generation butterfly keyboard and for that we are sorry and they're referencing the keyboards in the 2018 MacBook Pro So these are the kind of like the third generation of that butterfly switch keyboard, and it's Apple. It's a public statement It's a obviously curated statement that admits a little bit of fault, but doesn't open them up to like too much attack now To understand this issue a little better. I have to talk about their first Butterfly keyboard. It was 2015 They built this 12-inch MacBook that was super thin super light and in order to have a keyboard in this thing they had to build that new switch that could fit into that chassis and then a year later they Came out with these devices the 13-inch MacBook Pro and the 15-inch MacBook Pro very popular devices But keyboard issues start to happen right away like immediately there were issues with how these keyboards were performing Just not the keyboard experience, right? Like everyone's gonna have a different take on how these keyboards feel but the reliability and the durability of these keyboards are questionable right from day one and Because of the number of issues that people were having with these keyboards Apple actually put a page on their website to show people how to clean their keyboards with compressed air the issue Was that dust or other? Particulate matter was getting stuck underneath the key cap and messing up the switch mechanism and on a key switch That is so shallow with such a small travel distance. It is really easy to get jammed up. The thing is the problem persisted They continued selling MacBook Pros that had problems with keyboards. And then finally in June of 2018 they announced a keyboard repair program where you could take a MacBook or a MacBook Pro as long as I had a butterfly switch keyboard You could bring it to a store and they would fix it. Give it back to you in a week and then in 2018 they also announced their third Generation MacBook Pro and that's where we are today. This device here is a 2018 MacBook Pro This has a membrane keyboard and it was supposed to fix these keyboard issues They never publicly stated that the membrane was designed for this but in repaired documents sent to service centers, it was mentioned But here we are today in 2019 with a public apology from Apple stating that these third-generation butterfly keyboards Still have problems now my personal experience with these butterfly keyboards. I've had two machines go down I've owned a total of four key boards that have butterfly switches in them and two of them have had these issues my 12-inch MacBook as well as my 2018 13-inch MacBook Pro and this issue is very widespread If you go on Twitter or just search around on YouTube You will see a lot of content creators have had issues with these particular keyboards the big picture here, though Is that these keyboards undeniably have some sort of problem. It doesn't matter how much you like or dislike Apple a Keyboard on a laptop should not fail with this frequency. It's abnormal and it's just it's unfortunate now It's good that they've addressed it in the past and they will probably include the new 2018 third generation keywords into that list for the keyboard repair program But the biggest problem is that they are not actually fixing this problem They're not re-engineering a keyboard and putting a new problem-free keyboard in here They're using the exact same keyboard that your laptop shipped with they're not even putting the membrane version in the older ones. So They're not really fixing the problem. They're putting band-aids all over the place and I've seen a lot of reports on Reddit of people just going through their second third fourth repair process and it's just like That's what we have and it's because I don't think Apple can actually fix these keyboards in this chassis They've done what they can a membrane helps it a little bit. I'm sure but they're confined by the design of these laptops They're thin they're beautiful They're lightweight, but you clearly have issues with things like keyboard and other issues that I've mentioned in the past So my advice is this if you're thinking of buying a MacBook Pro right now? I would hold out. I really think that their redesigned this year. The 2019 version is gonna fix this I think they're gonna redesign the whole chassis because they have to there's a lot of issues with these devices The key word is one of the things that they need to fix",
    "transcript_keywords": [
        "MacBook Pro",
        "generation MacBook Pro",
        "Pro",
        "keyboard",
        "keyboards",
        "MacBook",
        "MacBook Pro keyboards",
        "issues",
        "butterfly switch keyboard",
        "Apple",
        "butterfly",
        "Pro keyboards",
        "keyboard issues",
        "butterfly keyboard",
        "switch",
        "selling MacBook Pros",
        "switch keyboard",
        "statement yesterday",
        "generation MacBook",
        "statement"
    ],
    "transcript_entity_values": [
        "yesterday",
        "MacBook Pro",
        "MacBook Pro",
        "third",
        "Twitter",
        "MacBook",
        "12-inch",
        "this year",
        "Apple",
        "a year later",
        "second",
        "15-inch",
        "a week",
        "today",
        "Generation MacBook Pro",
        "Reddit",
        "MacBook Pro",
        "2018",
        "MacBook Pros",
        "two",
        "2015",
        "first",
        "2019",
        "13-inch",
        "four",
        "MacBook",
        "YouTube You",
        "June of 2018"
    ],
    "transcript_entity_types": [
        "DATE",
        "EVENT",
        "ORG",
        "ORDINAL",
        "ORG",
        "FAC",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "EVENT",
        "GPE",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "DATE"
    ]
}