{
    "id": "mOO2vp7cB7I",
    "title": "Alienware at CES 2022: QD-OLED monitor, X14 laptop and Concept Nyx",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-01-04T18:00:29Z",
    "video_url": "https://www.youtube.com/watch?v=mOO2vp7cB7I",
    "category": "Science & Technology",
    "tags": [
        "alienware",
        "alienware laptop",
        "QD-OLED monitor",
        "X14 laptop",
        "Concept Nyx",
        "Concept Polaris",
        "gaming",
        "gaming laptop",
        "best gaming laptop",
        "best gaming monitor",
        "ces 2022",
        "best of ces",
        "best of ces 2022",
        "best gaming laptop 2021",
        "gaming laptop 2021",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge",
        "ces",
        "dell"
    ],
    "views": 157348,
    "likes": 3028,
    "comments_count": 172,
    "description": "Alienware has been busy during the past year, whipping up several exciting announcements in time for CES 2022. Weve covered the biggest ones, including its new 14-inch X14 gaming laptop, the 34-inch curved QD-OLED gaming monitor, Concept Nyx, and Concept Polaris.    Read more of our coverage here - Alienwares X14 is its first 14-inch gaming laptop since the Windows 8 era:   Alienware is resurrecting its eGPU with Concept Polaris:   Alienwares newest monitor features a 34-inch curved OLED from Samsung:  Alienwares Concept Nyx aims to let you cast your PC games to any screen you own:    0:00 Alienware X14 2:29 Alienware QD-OLED 34-inch curved gaming display 4:02 Alienware Concept NYX game streaming 5:10 Alienware Concept Polaris eGPU enclosure   Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/3mXeLVM",
        "https://bit.ly/3eQMBqQ",
        "https://bit.ly/3mUicfP",
        "https://bit.ly/3HCALNE",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat music) - So this is Alienware's new gaming laptop, the X14. As you might've guessed from its name, it has a 14-inch screen. As well as being more portable than the X15 or X17, the X14 still packs a good amount of power under the hood with Intel's latest 12th gen processors, up to NVIDIA's RTX 3060 graphics and speedy DDR5 RAM clocked at 5,200 megahertz. That is much faster than what's currently available in most gaming laptops right now. Designwise, the X14 looks identical to the X15 and X17. Its bottom chassis is black, while the top lid that encases the 14-inch 1080p display is clad in Alienware's Lunar Light colorway, It has a 14.5 millimeter thick chassis that Alienware claims is the thinnest of any 14-inch gaming laptop currently available. Though importantly, it doesn't feel compromised in any way. In the short time that I got to handle the X14 it's keyboard delivered a solid typing experience, much like the X15 that we reviewed before. The track pad feels generously sized and it has plenty of ports including two Thunderbolt 4 ports, an HDMI 2.1 port, a microSD card slot and more. Alienware is by no means the first company to produce a 14-inch gaming laptop. Asus's ROG Zephyrus G14 has been one of the go-to gaming laptops for people. And companies like Acer and Razor joined the ring with 14-inch models in 2020. Alienware traditionally doesn't entertain the idea of making laptops for casual gamers, but the X14 seems to be exactly that, a solid gaming laptop for people who don't sweat the graphical details too much. The best GPU that you can get in the X14 is the Midrange RTX 3060. So in other words, it should deliver a pretty smooth experience, but don't expect it to run every game at its highest graphical settings. The X14 is one of many gaming laptops being announced as CES 2022 that supports speedy DDR5 RAM. The X14 supports up to 32 gigabytes of it clocked at 5,200 megahertz. If you're interested in buying one of these laptops, you should think twice about how much memory you want. As Alienware told us that due to the X14's thin form factor, the RAM is soldered onto the board and can't be upgraded after you purchase it. That's the case for the X15 and X17 for 2022 as well, which is unfortunate, but not exactly unprecedented. There's better news for the storage in the X14 though. It has a single M.2 SSD slot, allowing up to two terabytes of storage and it can be upgraded manually after you buy it. In case you need to make the swap later on. As always, we won't know how this laptop performs until we get our hands on it. (tinkling music) Alienware has a few other exciting CES announcements, giving gamers a lot to look forward to in 2022. Starting with the most exciting one, it's launching a 34-inch curved Quantum.OLED gaming monitor with a panel sourced from Samsung. And I want this thing, give it to me. The QD-OLED monitor has an 1800R curve. At its native 3440x1400 resolution, Alienware's OLED display has a 175 Hertz refresh rate through display port or up to 100 Hertz via its HDMI 2.0 ports at the same resolution. Alienware says its Samsung OLED panel has a quantum dot pixel layer, which gives a better color uniformity for PCs with a recent NVIDIA graphics card inside this monitor supports G-Sync Ultimate, which in addition to making your games look smoother with adaptive sync, promises lifelike HDR, and better picture quality overall than other G-Sync monitors. And in case you were curious, you can of course use this monitor with the Xbox Series X or PS5, but it's positioned more as a high end PC gaming monitor than one that's tailor made for consoles. The dim lighting during its CES hands-on demo, made for an ideal scenario to see the perks of OLED inaction. It was running a demo of Destiny 2, and the game's worlds look crisp, bright and vibrant. I almost didn't want to keep looking because I knew it just made me want it more. Alienware intends to begin shipping the QD-OLED in March 2022. But sadly, we don't know the price yet, but don't expect it to be cheap though. (upbeat music) Alienware also has some conceptual plans that could turn into something really cool. Concept Nyx is Alienware's vision to let you stream multiple PC games around the house to a variety of screens, all from just one machine. The pitch sounds like something out of a commercial. Imagine you're playing Cyberpunk 2077 on your PC display, but you wanna move into the living room and play on a bigger TV. The idea is that you'll just be able to tap a button in the app, your game will swap displays. Then you can just hog the living room TV all to yourself, or go split screen next to a buddy on the couch. But compared to services like Google Studio or NVIDIA GeForce NOW, Concept Nyx is based on the idea that you'll be running the games at home on a dedicated machine, then distributing the streams over WiFi. And the company was actually able to pull off this demo for us successfully. Alienware says it's working on streaming up to four games at once, regardless of where you bought your PC game. Be it Steam, Epic Game Store or elsewhere. There's still a lot up in the air though, like internet requirements, whether Alienware intends to make its own PC hardware, when that might be, and importantly, how much it all might cost. Alienware discontinued its original graphics amplifier last year, but it's already resurrecting the idea. Alienware showed us Concept Polaris, its next to External GPU Enclosure coming out this winter. Unlike the previous model that used a proprietary port on older Alienware laptops, Polaris connects via Thunderbolt 4. In case you're unfamiliar with the concept of eGPU, it'll basically boost the graphical power of your laptop. Assuming it has one of those ports, and assuming you can actually get your hands on a powerful desktop GPU to put in a separate Enclosure. The Polaris should technically work with any laptop as a Thunderbolt 4 port that you'll get more customization options when you plug it into one of Alienware's laptops, since it has the company's software pre-installed. You'll be able to change things like the color of the Polaris' LEDs, as well as control its power levels and temperature limit. Concept Polaris has a more fetching design than Alienware's previous eGPU. And it seems built to allow for excellent cooling with large honeycomb pattern intakes on its size. This Enclosure will be able to fit up to NVIDIA's big RTX 3090. And to make room for big graphics cards to fit inside while keeping such a sleek profile, it ships with two external power bricks, instead of trying to cram a power supply inside of it. Alienware didn't have a price for Polaris, but it said it'll be coming out shortly in early 2022. Also, Alienware didn't share any performance metrics for how much it will boost your laptops performance. But if it's anything like previous eGPUs, it should be able to add some extra frames to your gameplay. Just don't expect it to be one-to-one performance with the gaming desktop though. I'm gonna get it on the first try. The best GPU that you can get in the... the best GPU that you can get... The best GPU that you can get in it, is the Midrange RTX 3060, so... Easier said than done. (Cameron laughs)",
    "transcript_keywords": [
        "Alienware",
        "gaming laptop",
        "gaming",
        "Alienware laptops",
        "laptops",
        "Alienware Lunar Light",
        "laptop",
        "GPU",
        "Alienware OLED display",
        "Polaris",
        "OLED gaming monitor",
        "game",
        "Concept Polaris",
        "Alienware OLED",
        "older Alienware laptops",
        "OLED",
        "Concept",
        "RTX",
        "NVIDIA",
        "Midrange RTX"
    ],
    "transcript_entity_values": [
        "just one",
        "G-Sync Ultimate",
        "last year",
        "Asus",
        "CES",
        "2.1",
        "ROG Zephyrus G14",
        "PS5",
        "Nyx",
        "one",
        "Razor",
        "5,200 megahertz",
        "32 gigabytes",
        "Lunar Light",
        "Quantum",
        "four",
        "External GPU Enclosure",
        "14-inch",
        "DDR5 RAM",
        "Thunderbolt 4",
        "GPU",
        "Concept Nyx",
        "G-Sync",
        "14.5 millimeter",
        "2",
        "Google Studio",
        "early 2022",
        "microSD",
        "2020",
        "Polaris",
        "3090",
        "up to 100",
        "Hertz",
        "3060",
        "Alienware",
        "1800R",
        "34-inch",
        "Samsung",
        "14-inch 1080p",
        "NVIDIA GeForce",
        "Polaris",
        "Designwise",
        "two",
        "3440x1400",
        "Acer",
        "March 2022",
        "HDMI 2.0",
        "this winter",
        "first",
        "NVIDIA",
        "up to two terabytes",
        "Intel",
        "175",
        "RAM",
        "Cameron",
        "X15",
        "2022",
        "Cyberpunk 2077"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE",
        "PRODUCT"
    ]
}