{
    "id": "mPoNmWiKl5E",
    "title": "I almost hurt myself opening this... - VIZIO P-Series Quantum TV",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-02-20T21:56:17Z",
    "video_url": "https://www.youtube.com/watch?v=mPoNmWiKl5E",
    "category": "Science & Technology",
    "tags": [
        "TV",
        "Display",
        "4K",
        "OLED",
        "Gaming",
        "Console",
        "Xbox",
        "Playstation",
        "PS5",
        "Series X",
        "Next Gen",
        "Best TV",
        "Linus",
        "Unboxing",
        "HDMI 2.1",
        "120hz",
        "VRR"
    ],
    "views": 496093,
    "likes": 23696,
    "comments_count": 975,
    "description": "Thanks to VIZIO for sponsoring this video! Purchase the P-Series Quantum 65\" Class 4K HDR Smart TV here:   For all of VIZIOs Top Deals, click here:   This TV is not huge but it's still relatively big! This is a pretty decent choice if you have been eyeing something to use with your Xbox Series X and Sony PS5.  Dont forget to follow VIZIO for all of their latest giveaways and sweepstakes! Facebook:  Instagram:  Twitter:    Buy Sony Playstation 5 On Amazon (Paid Link):      On NewEgg (Paid Link):      On BestBuy (Paid Link):   Buy Xbox Series X On Amazon (Paid Link):  On NewEgg (Paid Link):          On BestBuy (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "http://vizio.ink/BestBuy_P65Q9",
        "https://www.vizio.com/en/shop/top-deals",
        "https://www.facebook.com/vizio/",
        "https://www.instagram.com/vizio/",
        "https://twitter.com/VIZIO",
        "https://geni.us/ialJ",
        "https://geni.us/Lc3wm6",
        "https://geni.us/jKHve",
        "https://geni.us/JzNd69h",
        "https://geni.us/2RnXO",
        "https://geni.us/mfBcO",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- This... Aw! My wrist! Is the Vizio P... (David laughing) Is the Vizio P-Series Quantum 65-inch, and this unboxing is sponsored by Vizio. Now, it's a step down from the P-Series Quantum X, which means you're gonna have to make do with just 1,200 nits peak brightness and 200 local dimming zones on the 65, or 240 on the 75-inch, but it's chock-full of all kinds of other great features. It's still got Quantum Dot technology, obviously, still got their Ultra IQ processor. and still got HDMI 2.1, which means yes, my friends, we do have a PlayStation 5 sitting over there behind Jono. That's right! We're gonna be firing it up here. So let's get this baby cracked open, shall we? It is still mind-blowing to me how affordable gigantic TVs have gotten. I mean, this is not an entry-level TV by any stretch of the imagination, and the 65-inch one is 1,200 U.S. dollars. We got, uh, one foot. (foot clanks) Well, it's metal. Two foot. Also metal. Quick start guide. \"Important: do not touch the screen.\" Don't be that guy, you know? Don't be a screen-toucher. I get all kinds of comments on our videos whenever I touch screens. Got accessories. Okay. Wow. You know, I imagine a future where instead of numbers so that you can key in channels, because that paradigm will be dead, we're just gonna have a full remote full of all the different services that you can one-button access. Actually, I don't know what Xumo is. What's Xumo? - [David] I have no clue. - Sweet. See, these seem stronk, right? - Yeah. - Ope. (David laughs) It comes in a shopping bag. (Linus groaning savagely) Now... LTTStore.com, by the way. I'm gonna do the waiter pull-the-thing-out. One, two, three, go! (hardware clatters) Forget it. I'm over it. Sweet. Did we crush the remote? Oh, shoot. Hey. Hey, David. David, what am I doin' right now? - [David] Screwing? - Screwing up. - [David] Ah! - All right, here it comes. (groans) Barn raisin', but a TV. (Linus grunts) Nice. Round back we're pluggin' in power. We've got two built-in rear-firing speakers, so those'll probably sound about as good as you'd expect a rear-firing speaker to sound. That's okay, though. Vizio has a lineup of affordable sound bars, so that's pretty sweet. And then over here we've got our input. So this is an HDMI 2.1 TV, which means it can to up to 4K/120 hertz, and that is the case for HDMI-4 and HDMI-3. HDMIs 1 and 2 don't do 4K/120 hertz, but you still have some HDMI 2.1 features. Like, for example, HDMI-1 is actually the eARC port. So eARC is an HDMI 2.1 feature. It's like enhanced audio return channel for the aforementioned sound bar that you might hook up to it, and that's on HDMI-1. Ethernet. Ethernet and audio out. Coax, LOL. Optical, composite, and USB-2. Through the TV's smart features you can access streaming apps like Disney+, Netflix, YouTube, and more. We're actually firing up the Wu Tang app. This particular app is fairly heavily (clears throat) ad-supported. Wait a second. Is this an ad for... No, okay. This is a Vizio TV at least. We're gonna switch over to Calibrated mode real quick here. Yeah, in this bright environment we want Calibrated, not Calibrated Dark. Calibrated Dark's what David uses at home. You have a 2018? - 2018, yeah. - Ah! ProGaming Engine. It's great out here 'cause we're not in-game, but this is cool. So it means support for HDR tone mapping, Dolby Vision, in games, obviously, and variable refresh rate. So we swapped out the PlayStation 5 we were planning to use 'cause we found our Series X, which not only has a lotta games installed on it, which the PS5 doesn't, but also supports variable refresh rate. We'll get to gaming in a minute, though. First I wanna find somethin' real pretty to watch and check out this TV. How awesome is it, David, that TVs come with calibrated modes now? Where I don't have to play around with the settings for 10 minutes to get it to not look like trash. Man, you can get a lot of TV for your money. Let's switch over to something HDR though. It's got support for HDR10, HDR10+ HLG, and Dolby Vision, which I think I've already mentioned. Oh, look at that! (snaps fingers) Automatically picked up HDR10 mode. That's good. Man, there's so much hair on my shirt in this video. All right, let's fire up some games. Well, that's ain't right. We needed to switch the HDMI mode to 2.1 manually. This is a thing we've seen on a lotta TVs. There we go. Okay, let's try again. Boop. - There we go. - Yup. Now we workin'. 4K/120 hertz. Video modes? Allow all the freakin' things. Let's play some games. \"Gears 5\"? Sure. - Yeah. (Linus sighs) - [Linus and David] Aw! - Oh, you can see here in the menu, you get that glowing effect around bright objects on a dark background. That's normal on a full-array local dimming TV. Actually, David, from your angle it's way more. Yeah, switch over there and actually get to a normal viewing... You can barely see it anymore. - You see that? - That's really good. - Yeah, I'm... I could see it way more because I was looking down at it. But when I actually get level with it it's practically invisible. Joysticks. Joysticks should definitely be used for aiming a gun. I shot him right in the ankle and he kept running. That's stupid. What a stupid game. Okay, no, I'm kidding. If you love \"Gears of War\" then I don't mean any offense. Wait, so is this the whole map? It's just like a bunch of chest-high walls? Oh, but I can capture this. Uh, X to hold. And I'm dead. I don't even know what's goin' on. But hey, 120-hertz gaming, so there. We did have a bit of weirdness with variable refresh rate, but 4K/120 hertz/HDR is working awesome. Future Linus butting in here. We actually filmed this video in late 2020, but now if you buy it, variable refresh rate with the Xbox does work. Just make sure you're connected to the internet and you update to the latest firmware. God, this game looks so good. So in short, $1,200? Dang. That's a lotta TV. Go check it out at the link in the video description. Thanks again, Vizio, for sponsoring this video and sending over their P-Series Quantum 65 2020 edition.",
    "transcript_keywords": [
        "PSeries Quantum",
        "Vizio PSeries Quantum",
        "Vizio",
        "Quantum",
        "HDMI",
        "Yeah",
        "David",
        "Calibrated",
        "Quantum Dot technology",
        "Quantum Dot",
        "variable refresh rate",
        "video",
        "variable refresh",
        "refresh rate",
        "Calibrated Dark",
        "hertz",
        "Dolby Vision",
        "refresh",
        "HDR",
        "sound"
    ],
    "transcript_entity_values": [
        "the 65",
        "10 minutes",
        "PlayStation 5",
        "three",
        "HDMI-3",
        "Quantum Dot",
        "65-inch",
        "One",
        "4K/120",
        "1,200 U.S. dollars",
        "one",
        "Wu Tang",
        "2018",
        "240",
        "Xumo",
        "Gears of War",
        "late 2020",
        "1,200",
        "second",
        "200",
        "Dolby Vision",
        "75-inch",
        "David",
        "2020",
        "HLG",
        "Jono",
        "PS5",
        "1",
        "Netflix",
        "two",
        "Boop",
        "120",
        "Dark",
        "Linus",
        "Vizio",
        "Xbox",
        "Two foot",
        "2.1",
        "one foot",
        "2",
        "YouTube",
        "First",
        "just 1,200",
        "a minute",
        "ProGaming Engine"
    ],
    "transcript_entity_types": [
        "DATE",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "ORG"
    ]
}