{
    "id": "MPWuLVQH6o0",
    "title": "Always wanted a Mac? Try this. - M2 Mac Mini",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-02-03T18:30:12Z",
    "video_url": "https://www.youtube.com/watch?v=MPWuLVQH6o0",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "mac",
        "apple",
        "mini",
        "m2",
        "pro",
        "studio",
        "desktop",
        "macos",
        "pc",
        "cool",
        "new"
    ],
    "views": 607629,
    "likes": 17185,
    "comments_count": 886,
    "description": "Thanks to Secret Lab for sponsoring today's video! Check them out at   The new M2 Mac Minis are here and with their low pricing, it could be an enticing entrance to the Apple ecosystem for people who have been on the fence. Jake is here to see if the M2 is feature packed or if its small form factor limits what you can do with it.  Want us to unbox something? Make a suggestion at   Buy an Apple M2 Chip Mac Mini:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   COME TO LTX 2023:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   OUR WAN PODCAST GEAR:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 It may be small, but it's got power! 0:25 Unboxing 1:13 Ports and design 2:22 Specs 2:59 Sponsor - Secret Labs 3:21 Setup and comparison to Mac Studio 4:31 Testing WiFi 6E, SSD, and M2 speeds plus thermal test 6:37 Speaker impressions versus iPhone 8:12 Teardown 10:53 Pricing and overall thoughts  11:35 Outro",
    "description_links": [
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/7s34e",
        "https://geni.us/gZLSU",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/masponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Look, it's another Mac Mini, Apple's cheapest computer, and this time it has M2. It looks pretty much the same on the outside. It's a Mac Mini. We've got some specs. This is the eight gigabyte model, 256-gig storage, eight-core CPU, 10-core GPU. Is not the Pro one, which is actually kinda cool. That's a new product. The previous Mac Mini did not have a Pro, you had to go to the Mac Studio, but ours, we spec'd it with 10 gig internet, so it's not here yet. This is a very form-fitting box. Actually I guess I should use the Apple thing. (groovy music) Hey, look at that. You wouldn't wanna ship this without some extra foam 'cause the box is not doing anything. It seems like an unnecessary piece of plastic, I'm not gonna lie. Like, what are they protecting? Does this get scratched easily? Doesn't seem like it. All right. What else is in the box here? Propaganda. Cable. I pity the person in the Apple factory who has to, like, assemble these paper things, like, (puffs and laughs) this is awful. And that's it. No power brick. (explosion booms) Wow, that's a big Apple sticker. Whoa, let's just upgrade this thing right now. Look at how much more Apple we're gonna have. Oh, oh, that's brutal, that's brutal. I'm sorry, that was not intentional, it's just so sticky. On the outside we have a beautiful Apple sticker and logo on the front. Oh yeah, there's a little power LED there. Side, nothing. Other side? Also nothing. But on the back, ooh. Power button, our power jack, one-gig ethernet, you can also spec it with 10 if you want. Got two Thunderbolt 4 ports. HDMI, two USB-A ports, headphone jack, and a little cooling vent. If you upgrade to the Pro model you get four Thunderbolt ports like the Mac Studio, but other than that, it's the same IO as last time. I think it's HDMI 2.1 now, so we're gonna have to try that later with the TV over there. The specs page was not super clear about that. It doesn't say HDMI 2.1, but it does say you can do 4K. I think 144, no, 4K, 240 I thought it said. And 8K 60 at the very least. It's not, like, rubbery at all, so it doesn't, it doesn't keep it in place, you know, like, you could curl with this thing. It's very sleek. I think the top is actually. Oh yeah, yeah, it's got more friction on the top than the bottom. It's really bad, it's like it's even got bubbles underneath it. I'm usually the kinda guy that leaves it to troll you but it's actually bugging me at this point so I'm gonna. Oh, so much better. In terms of the internal specs, of course the CPU is an M2 instead of an M1. You can go up to 24 gigs of RAM instead of 16. You do get the nice ProRes encode and decode engine on the M2. The max storage is still two terabytes on the non-Pro, but if you go up to the M2 Pro version you can go up to a 12-core CPU or 19-core GPU. You get 200 gigabytes per second of memory bandwidth instead of 100. You can do up to 32 gigs of RAM and up to eight terabytes of storage. Any of the models can be spec with 10 gig internet on the standard port, or you can use a dongle with the Thunderbolt, that works too. Other than that, pretty much the same. I guess we should turn it up, but not before I tell you about our sponsor Secret lab. Their chairs are designed to keep you comfortable for those long nights of work and play. And their Titan EVO 2022 series chair offers four-way lumbar support, comes with a magnetic memory foam head pillow, and is offered in different upholsteries like hybrid leatherette, soft weave fabric, and Napa leather. Best of all, a five-year extended warranty is included along with a 49-day return policy. So you're covered if anything goes wrong. Head to the link down in the description to check out Secret Lab today. The cool thing about the Pro one, which we haven't gotten yet, is it has the same IO as the Mac Studio, and that was like kinda one of their things. \"It's got so much connectivity.\" This one has two ports but the Pro has four, and that's the same. One thing I would say about these, it would be cool if Apple- - [Siri] Quick start. Voiceover speaks descriptions of items on the screen. - It would be cool, (chuckles) it would be cool if Apple added, like, two Types-E ports to the front. Like, not everyone wants to plug everything in the back, especially if you're charging your mouse from the bottom of the mouse. Ah, something else I didn't mention. This Mac Mini has Wi-Fi 6E, which can do, like, above-gigabit speeds. So despite the ethernet port being gigabit, you can do like 1.5 gig on the Wi-Fi. So the Wi-Fi might actually be faster than ethernet on this particular one. Maybe I should charge the, this. - [Andrew] Looks great to me. - No, Andrew, it looks (beeps) stupid. Hi, Apple, it's (beeps) stupid. It's so stupid. Ooh. Slight correction, the Studio does technically have more IO, it has two Thunderbolts on the front and an SD card reader. So there's a little bit more, which is what they should do on this thing, but then how would they sell the Studio? All right, the first thing I wanna see is this Wi-Fi 6E. Is it fast? Is is it truly, brutally fast? We don't have any Wi-Fi 6E devices connected so theoretically they should be very fast. Wow. Truly. - Whoa. - Astonishing. Not that fast. I mean, the AP is, like, pretty far. It's in the ceiling, probably 20 feet away. 700 megabits, pretty good for Wi-Fi. Hey, so Wi-Fi 6E, pretty sick. I think if you had your AP closer you could do even better. I personally have tested Wi-Fi 6E at, like, one and a half gigabit, which is double even what we had here, so. It's fast though. I like that they're including it, I hope the new iPhone has it too. It's fine. It's, you know, one and a half gigabytes a second both ways, it's fine. To go to the 512 gig, that would be faster. You're looking at, you know, an extra $200. So for the price it's not bad. Let's try PassMark. Yeah, so it's like 6.8, 6.9%. I mean, there's a lot less samples but, I mean, for for one year, 7%, it's not bad. What score did we get? 16,000, wow! The thing to consider is that this M2 chip is gonna be in a bunch of different devices. So a bunch of the samples for this could have been done in a, like a MacBook Air that doesn't have additional cooling, and that could hurt. What I'm curious about is if this thing thermal throttles. Maybe just testing. Endurance, I think this is the one. Yeah, this one. Okay, cool. I believe this is made by the same guy. Yeah, it's made by the same guy that makes TG Pro, which is a really great app for monitoring your Mac. You can see all the different statistics. We do have a license, don't worry, we bought many, they also gave us some, but I don't wanna type in the server credentials so I'm just gonna use the trial. Don't get mad at me, I love you. This is obviously not a super realistic test because it is just cranking the CPU at 100% but it will be interesting to see if it does throttle. And we're only at 60 degrees. I suspect that this will not throttle easily. It's still at the minimum 1,700 RPM speed. Doesn't really seem like it's getting any hotter, which is great. So you're at least getting the full fat performance out of this M2 chip. I mean, it's an efficient chip, we knew that but great, cool. I wanna know if it has a speaker. I'm sorry buddy. (calm music) Oh, it does have a speaker. Maybe it's just bad when it's facing at you. (laughs) So let's try to be a little more realistic about how this would be set up if this was on my desk. So it's over there. There would be a wall behind me probably in the real world but we're just gonna ignore that part. Sounds pretty tingy so far. (upbeat music) That's maxed out. (energetic upbeat music) It's, like, serviceable. I think if all you were tryna do is not play music, you just need to do, like, a video call. (laughs) Anything that's not music, (laughs) that would be okay. What about, like, what about, like, Linus talking? - [Bell] Whoa, whoa, whoa, whoa. This is \"ShortCircuit.\" - Yeah, well, yeah, but you don't wanna watch- - Let me get this straight. This is a computer? - [Computer] I'm a computer! - [Linus] And- (Jake laughs) - It's pretty tingy. Now, what I'm curious about is, is my iPhone better or worse? Well, MacBooks, okay. Apple laptops, MacBooks, way better for sure. (energetic upbeat music) (energetic upbeat music) I'm pretty sure the iPhone sounds better. It's not great. Do Apple monitors have speakers in them? 'Cause I mean, this obviously doesn't have a monitor, you're gonna need to buy a monitor, that's part of why it's so cheap. But if all the Apple monitors have speakers and they're, like, decent, then I guess it's less of a concern. Either way, integrated speakers, worse than an iPhone. Not by much, but a little bit worse, I would say. Headphones, AirPods, you can use AirPods, AirPods are great. Should we take it apart now? Okay, look at this computer. How do we do this? Does anybody know? Bellavonts. Definitely. What? Cool. That was really easy to get off actually. Oh, there's little like, rubber thingies that sit on the screws. Okay, that seems pretty serviceable so far. There's a little screw holding the Wi-Fi connector on. It's very common for people to take their devices apart and just rip the Wi-Fi antenna out. So it's very good that they put that there. Okay, I got it off and I didn't break it. Hey, this is so cute. I mean, in terms of serviceability, this, the little, presumably BIOS batteries are right there. This has gotta be the power supply over here. Wow, it's so smart. Okay, look at this. See how it's at an angle? This part? Is that an angle? It's so you can get a screwdriver in there, a normal screwdriver. And you don't need, like, a really short custom, like, stubby one that would fit straight. It's at an angle. - [Bell] Geniuses. - I mean, I don't know about geniuses, it's just (chuckles) reasonably smart. I refuse to acknowledge it. (Bell laughs) This is such a... There's, like, nothing in here. Why don't they make this thing smaller? (Jake laughs) It's like half, it's half empty. Actually I don't know how to take off right there. Man, they're vibing with those dumpsters. Yo mama's a dumpster. (Jake laughs) That was pretty brutal, I'm sorry. (Bell laughs) \"Mom, he said you are a dumpster.\" See? Cool. I'm pretty sure this part just, like, kinda vibes off. Hey, there we go, okay. Wow. So there's the chassis with the power supply. Nice little integrated unit. I don't know how to take that part out. Oh, there's a screw right there, it's probably not that hard, but I don't need to do that. I think the power supply can just chill in there. And then this is the actual board. Oh, there's the speaker. (laughs) That's why it sounds like garbage, it's inside. It would fire almost entirely up into the metal (chuckles) but there is little vents here so that's the only place you're getting the audio from. That would explain why it's kinda crap. That's probably storage right there. Do I dare take the heat sink off? (upbeat music) - [Bell] If you have the confidence. - [Jack] Well, I'm not worried about it, I'm just- - Oh, then sure. - There's a lot of little things on the back of this board you could very easily knock off. This whole thing, this fascia piece, is connected here. So taking it off means the whole back thing is just vibing now. Okay, wow, that's not that bad. Hey, heat sink. Little tiny processor. It's kinda interesting that it's, like, half of an IHS. It's, like, cut. And then they have the memory soldered to it. It's very cute. I'm gonna reuse the stock thermal paste so that it's not really, like, altered characteristics. Hey, it's back together. Look at that. It's a Mac Mini. Now, to talk pricing. This particular one with eight gigabytes of RAM and 256 gigs of storage is 599, which is Apple's cheapest computer, it's almost half the price of an iPhone 14 Pro. If you wanna upgrade the storage, or the CPU, or anything else, that starts to add up very quickly. (laughs) Like I said before, it's $200 to go to the 512 version, so that's 799, and if you go to the Pro, which has a 10-core CPU, 16-core GPU, 16 gigs of RAM, and a 512-gig SSD, 1,299. But you do also get two extra Thunderbolt ports on the back. If you're in the market for a small computer from Apple and you don't wanna spend a lot of money, this is a great option. If you like this video, like it, get subscribed. If you wanna see other Apple content, maybe check out the M2 laptops that Alex just did. They're also pretty cool.",
    "transcript_keywords": [
        "Mac Mini",
        "Apple",
        "Mac",
        "Mac Studio",
        "Pro",
        "thing",
        "pretty",
        "cool",
        "WiFi",
        "Mini",
        "CPU",
        "previous Mac Mini",
        "yeah",
        "Studio",
        "Apple monitors",
        "Apple thing",
        "power",
        "great",
        "ports",
        "Apple cheapest computer"
    ],
    "transcript_entity_values": [
        "24",
        "Wi-Fi 6E",
        "Yo",
        "a half gigabytes",
        "4",
        "Thunderbolt",
        "8",
        "USB",
        "M2",
        "6.9%",
        "Bell",
        "Alex",
        "AirPods, AirPods",
        "Secret Lab",
        "1,700",
        "Napa",
        "IHS",
        "6.8",
        "10",
        "16,000",
        "one year",
        "200 gigabytes",
        "Linus",
        "MacBook Air",
        "today",
        "eight gigabyte",
        "ProRes",
        "M2",
        "20 feet",
        "PassMark",
        "7%",
        "the Wi-Fi",
        "256",
        "first",
        "60 degrees",
        "M1",
        "five-year",
        "two",
        "144",
        "200",
        "GPU",
        "SD",
        "CPU",
        "2.1",
        "eight",
        "MacBooks",
        "SSD",
        "Mac Mini",
        "This Mac Mini",
        "32",
        "Thunderbolt",
        "49-day",
        "the Wi-Fi",
        "Jake",
        "599",
        "RAM",
        "Andrew",
        "one",
        "iPhone",
        "AP",
        "the Mac Studio",
        "Mac",
        "almost half",
        "second",
        "799",
        "512",
        "12",
        "jack",
        "1,299",
        "Apple",
        "half",
        "AirPods",
        "100%",
        "One",
        "240",
        "700 megabits",
        "100",
        "eight gigabytes",
        "IO",
        "Wi-Fi",
        "two terabytes",
        "16",
        "TG Pro",
        "four",
        "19",
        "a Mac Mini",
        "1.5"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "LOC",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "FAC",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "LOC",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL"
    ]
}