{
    "id": "mQ92VJpNDVI",
    "title": "Quarantine Drone Review: DJI Mavic Air 2 Unboxing!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-04-28T01:31:52Z",
    "video_url": "https://www.youtube.com/watch?v=mQ92VJpNDVI",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 782538,
    "likes": 20468,
    "comments_count": 1604,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today we're doing a drone review in quarantine. Yeah, definitely something that I never thought I would be doing, but here we are, and we're gonna make this happen. This is the new Mavic Air 2, and I do plan on doing a follow-up video when we're allowed to leave the house again. Let's unbox. (jazzy electronic music) Tah-dah! (Justine inhales deeply) Smell of fresh technology is something that I love. That's it. This drone kind of falls somewhere in between the Mavic Air and the Mavic Pro 2. As far as size, this is closer to the Mavic Pro. This controller is, actually it's like quite massive. It also doesn't have an LCD on it, whereas most of the higher-end drones do. I just pop this up and put our phone in it. Now that I kinda like. Let's see what's in our accessories box. So we've got a USB-C, a charger adapter, all of the cables that we'll need to connect our phone to the controller, and our propellers. These are very clearly marked as to where to put them, so there's A and B. And I ripped the stickers off, so (laughs) if you did rip the stickers off, there are silver markings on the top of the propellers, and that silver marking matches up on the top of where you'll put the propeller. These are the B propellers, and they're black. How am I going to (laughs) review this drone in my house? (Justine sighs deeply) (playful music) This is the Mavic Air 2, and this is the first time that DJI is bringing some of their high-end drone features to a mid-range drone. With a starting price of 799, you'll get the drone, a battery, and the controller. The controller features Ocusync 2.0, which will allow you to get video transmission up to 10 kilometers, and for us basic Americans, that's over six miles. All right, let's put this in here. I do kinda like the placement of this. I like that it's above (dog barking) instead of below like normally when you're flying, (dog barking loudly) you'll have your (laughs) screen be here. Matthew, I'm trying to do a drone review. But I like the placement above actually a lot better. (dog barking) All right, I'm gonna download the app, update my drone, (dog barking) and then I'm not gonna go outside and fly it. I'm going to say in the house. It shoots up to 4K 60 video, and up to 1080, 240 frames a second for some incredible slow-mo. It also will shoot 8K hyper-lapses, HGR video and photos, and up to 48 megapixel photos in one mode. It features all of our favorite DJI quick shots, hyper-lapses, panos, smart photos, and of course focus track, spotlight, active track, and points of interest. These are all things that we've seen in previous DJI drones, so it's always great to see them back again and even better. With APAS 3.0 obstacle avoidance, this will allow your drone to detect and avoid upcoming obstacles by flying over or around them. This drone will get up to 34 minutes of flight time. That's the best flight time so far out of any of the Mavic drones. This is DJI's first consumer drone that includes AirSense technology. It provides safety warnings to drone pilots that there's other aircrafts nearby. Since the pandemic has created supply-chain issues that's out of DJI's control, the Mavic Air 2 will initially be available in two versions, one with AirSense receivers and one without. Since the FAA has implemented the strongest requirements for airplanes and helicopters in the US, the AirSense version will be sold here in the US, and the non-AirSense version will be sold in other countries. I think the future of drone flying is gonna be really interesting for us everyday consumers. There are a lot more restrictions of places that you can fly, so be sure to check your flight maps before you head out, because there's nothing worse than heading to a location that you think you're gonna shoot, and guess what? You can't fly there. So we're outside, can't really fly this far at all since I am in my backyard. I can't go anywhere, all the beaches are closed, all the parks are closed because of quarantine. So I'm gonna fly it a little bit in my backyard just to see how it flies. Maybe I can do a very short hyper-lapse throughout the backyard, and then I'll fly it a little bit in the house. I do have some prop guards for it, so just in case I hit the walls or anything. Just in case I hit the walls or anything. I gotta turn obstacle avoidance off (gentle creepy music) so we can fly free, (drone buzzing) free, free, free, free. No! (drone tumbling) Do you remember when I said I'm gonna turn obstacle avoidance off, and do you remember when I also was talking about the prop guards that I didn't put on? There's a reason for that friends, because I now have got a hole (laughs) inside of (laughs) these curtains. (Justine laughs) Learn from my mistakes. This is bad behavior, and this is, now I'm paying the price. (melancholy piano music) (upbeat funk music) So I thought maybe we would test out some of the slow-mo. Let's try the 240 frames a second. (drone buzzing) Trying to get a slow-mo hair flip. (upbeat electronic music) (drone buzzing) (drone buzzing) Bored in the house And I'm in the house bored (drone buzzing) - Now what are you gonna do? - Dude, I don't know. (drone buzzing) (chill electronic music) (device beeping) This looks so good. I've been flying the Mavic Mini for the past several months, so going back to a higher-end drone looks so amazing. The Mavic Mini is so great because it is small, compact. It's extremely portable and very light, but if you really do wanna get good quality 4K HDR video, you definitely do need to get a bigger drone. But this looks so amazing. I can't wait to take it out. I wanted to show you guys a size comparison between the brand new Mavic Air 2 and the previous version of the Mavic Air. This was a really great little 4K drone. It had 21 minutes of flight time, you could shoot 60 frames a second at 2.7K, but the biggest downfall was the Wi-Fi transmission. You'd only be able to get four kilometers at 720p, bu with the new Mavic Air 2, you can get 10 kilometers at 1080p. (drone buzzing) Now I'm testing 4K 60 on Mattie, come here Mattie. Come here, buddy. I've been flying DJI drones for quite a while now, and it's been interesting to kind of lay these all out and do some side-by-side comparisons. Here's the Mavic Air, the Mavic Air Pro 2, and the Mavic Mini. I've done unboxings and reviews on all of these drones in the past. If you guys wanna check those out, feel free to check the links in the description. Most recently I've been traveling and using the Mavic Mini the most because it's so small and portable. Even though it doesn't shoot 4K, the footage still looks really good. And the fact that it's so small, there's no excuse why I don't always have it with me. The Mavic Mini has been geared towards beginners, but the fact that it doesn't have obstacle avoidance, this might not be the best drone for somebody who is just starting out. If you are looking for an inexpensive drone, yes, Mavic Mini is perfect. But if you want that confidence of having obstacle avoidance, Mavic Air 2 might put your mind at ease when you're out flying. Thank you guys for watching. Jenna's actually outside flying her drone right now. I'm gonna put a link in the description if you guys wanna check out this drone and get more information, or if you wanna purchase one. I know this review is not one of my typical drone reviews, so I look forward to further covering this in a later video. But in the meantime, definitely put prop guards on if you plan on flying in the house. And obstacle avoidance is our friend, for the most part, unless you wanna fly reckless. Me, me, me, me, me Thought I'll be cocky",
    "transcript_keywords": [
        "Mavic Air",
        "Mavic",
        "Mavic Mini",
        "Mavic Air Pro",
        "drone",
        "Air",
        "Mavic Pro",
        "DJI",
        "Mini",
        "DJI drones",
        "Mavic drones",
        "fly",
        "put",
        "flying",
        "drones",
        "obstacle avoidance",
        "house",
        "Justine",
        "flying DJI drones",
        "Air Pro"
    ],
    "transcript_entity_values": [
        "Mavic Mini",
        "Mavic",
        "2.7",
        "second",
        "10 kilometers",
        "DJI",
        "one",
        "four kilometers",
        "The Mavic Mini",
        "799",
        "Justine",
        "48 megapixel",
        "the past several months",
        "Mavic Air Pro 2",
        "the Mavic Mini",
        "4",
        "the Mavic Air",
        "240",
        "LCD",
        "Tah-dah",
        "8",
        "Matthew",
        "21 minutes",
        "the Mavic Pro",
        "The Mavic Mini",
        "FAA",
        "over six miles",
        "Mattie",
        "1080",
        "today",
        "two",
        "Jenna",
        "Mavic Air 2",
        "60",
        "US",
        "AirSense",
        "the Mavic Pro 2",
        "HGR",
        "first",
        "up to 34 minutes",
        "Americans",
        "Ocusync 2.0",
        "the Mavic Air",
        "APAS"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "TIME",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "TIME",
        "NORP",
        "ORG",
        "ORG",
        "ORG"
    ]
}