{
    "id": "ms9G-DX1JN8",
    "title": "360 cameras are getting really good",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-07-01T14:00:34Z",
    "video_url": "https://www.youtube.com/watch?v=ms9G-DX1JN8",
    "category": "Science & Technology",
    "tags": [
        "insta360 one rs",
        "insta360",
        "insta360 one rs 360 review",
        "insta360 one rs review",
        "insta360 one rs vs gopro hero 10",
        "gopro",
        "360 footage",
        "gopro hero max",
        "gopro hero max 360",
        "insta360 one x2",
        "insta360 go 2",
        "insta360 one rs 1-inch 360",
        "best 360 camera",
        "best 360 camera 2022",
        "best 360 camera for motorcycle",
        "best 360 camera for car",
        "the verge",
        "tech",
        "review",
        "becca farsace"
    ],
    "views": 120162,
    "likes": 2675,
    "comments_count": 140,
    "description": "In 2020 Insta360 began betting big on modular cameras. Instead of replacing its entire system with each product cycle, the company started making cameras that allowed owners to upgrade a single part of the camera they already have. So even though Insta360s latest camera, the One RS 1-inch 360 Edition, looks wildly different than its predecessor, the One RS, it is built on the same processor and software Insta360 customers already own and know. What makes this camera special though is its dual 1-inch CMOS sensors that provide 6k 30fps footage. Becca put it head to head with the GoPro Hero Max and Insta360s own One X2 and One RS 5.7k 360 mod to see if that spec bump is really worth its $799.99 price.  If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:   You can get the Insta360 ONE RS 1-Inch 360 here:    Read more:    Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel: More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "http://bit.ly/2TQsqjB",
        "https://bit.ly/3Ia1JgJ",
        "https://bit.ly/3yC0DaM",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- Dual 1-inch CMOs sensors, 6K 30 frames per second, 360 degree recording, 62 minutes of continuous 6K 360 recording. This is Insta360's new RS 1-Inch 360 Edition. It's been a minute, buds, I've missed you. Let's get into it. (bright music) The One RS 1-Inch 360 edition has a bad name but it's due to the fact that the core of this camera is the same core that is Insta360's One RS, a camera that I didn't even review because it had very small changes over its previous version, the One R, but it did leave me thinking that Insta360 had to have more up their sleeves. And well, here is the more. It's a dual 1-inch CMOS sensor 360 camera mod with a larger battery and a mounting case that together with the One RS's core creates the most robust consumer 360 camera Insta360 has ever made. And also, absolutely the most expensive, at $800. And for how large that sensor and price tag are, I was hoping for just a bit more of a bump in picture quality. But first, the good. This camera, it feels amazing in my hand. It's made up of four parts. You have the plastic mounting bracket, a battery brick with a USB-C charging port, quarter inch tripod mount and USB-C plug to connect to the core, the main core piece with a USB-C port, micro SD card slot, and a very responsive 1.3 inch touchscreen, and then, of course, the dual 1-inch CMOS sensors and lenses. The larger lens mount makes a really nice lip from the grip that not only proves to be a great resting spot for my thumb, but also a perfect spot for the power button with the record button right underneath it. Basically, using this camera with just your thumb is incredibly easy. There are also these plastic side panels that display details about the sensor and the stabilization. And although they are not E-Ink, very sadly, they do kind of look like E-Ink, and I just think it's a sweet little touch. At 239 grams, the camera feels more robust but also made me fear that I would drop it especially when holding it out on a selfie stick. Insta360 actually warns that for action sports such as biking or if you're on a motorcycle, any selfie stick longer than four feet is absolutely not recommended, and I can feel why. It gets really heavy, really fast. There is a rubber lens guard that comes with the camera but when the camera's in use, I had constant worry of one of these lenses that cannot be user replaced being scratched or cracked. The system is also only rated IPX3 water resistant so you will not want to submerge this in any sort of water. Insta360 does offer a care program for $79 that covers a one time accidental damage repair and the shipping fees for one year after purchase. And for an additional cost, folks can add Insta360's extended warranty to cover unlimited free repairs and replacements for two years. But I much prefer GoPro's $50 year subscription service that in most cases offers two replacements a year, along with cloud storage and discount on gear. I have heard some lens protectors might be coming, but for now, those sweet 360 shots where you throw the camera up into the air and then catch it, they just might not be the best idea. All right, but it's about what's on the inside, right, buds? So the dual 1-inch CMOS sensors, capable of filming 6K 360 degree footage at 30 frames per second or 50 frames per second in 3K. I mean, this is the same size sensor that was in Sony's RX100 line but it's not the only consumer 360 camera to have a 1-inch sensor, there was the QooCam 8K that came out in 2018, then Ricoh had the THETA Z1 that came out in 2019. And unfortunately, both those cameras had underwhelming results and they also failed to gain large popularity. But now it's Insta360's turn to take a shot at the 1-inch sensors in a 360 camera. And they claim that their sensors are gonna provide better low light performance and more dynamic range. So I put just that to the test. In low light, well, it's a bit better compared to its previous version, the One RS with the 5.7K 360 mod. The stabilization is absolutely much smoother, less jagged but under an LED streetlight there's really only a slight difference in how well the 1-inch edition handles the low lights. If we're really pixel peeping, there is definitely less noise on the 1-inch edition, but it's just not like the big jump in quality I was hoping for. On blue sky days though, man, these sensors really shine. Bright colors, such as the green of trees, are punchy and bright, and the image doesn't feel overprocessed or too sharp. And of course, everything is very stable, something we've come to expect from Insta360. I also noticed that the image quality on the stitch line is a bit sharper than both the GoPro Max and the One RS 5.7K. (bright music) (camera lens clicking) On the photo side, there is an HDR mode that produces balanced images without looking too processed. But the downfall comes in how long those photos take to capture. You're looking at around 1.5 seconds to take a quick shot. I just ended up recording video and taking screen grabs instead. My favorite mode though by far is the time lapse. I've seen loads of TikToks with 360 cameras in people's mouths, which is a very funny perspective but putting this out on a selfie stick in front of you and walking through an arch, that's a 10. The battery life has been right about where I would expect it. You're looking at about an hour and a half of straight use which will bring you from a hundred to a clean zero, which doesn't sound particularly impressive. But when you consider all of the playback on your phone you'll be doing and the heat this much processing can cause, it all checks out. The most impressive thing about this camera to me is the core's ability to stay paired with my phone and how quickly you can review shots. The playback gets pixelated and laggy with longer clips, if not downloaded directly to your device. But for a quick review, it all works well enough. The camera, also, it does get toasty to the touch but it never got hot enough that it would pose a problem if mounted to say someone's chest. Insta360 has put a lot of time and effort into their app and it shows. And it has come so far since I first started reviewing their cameras. But if editing is not something that you do often and if the word key frame means nothing to you, well, think about what you're gonna do with all that 360 degree footage when you have it. Using their app to edit your footage will take time, patience, and practice. And if you are not willing to put that in, you shouldn't be buying a 360 degree camera. But for us editors, I am happy to report that Insta360 has significantly improved their desktop app. It has a better design, far more intuitive icons, you can see thumbnails of all of your clips and you can continue to edit even when a clip is exporting. I also really love the sound that the program makes when an export is complete. (computer chiming) It's just like really happy, and same, I feel equally as happy when an export is done. Let's bring it on home though. So the Insta360 1-inch, nope, yeah, got it. The Insta360 One, nope. The Insta360 One RS 1-Inch Edition. (crowd cheering) It has a larger sensor, heavier weight, and a polished app experience. And it feels like a breath of fresh air in a rather stagnant 360 degree camera market. But unlike its predecessors, it is not an action camera. I mean, not only does it have hella glass that is just asking to be scratched but it also doesn't have a robust repair program. It doesn't have high frame rates, it doesn't have a rugged build, and it is absolutely not water resistant, like the GoPro Max or Insta360's own One RS and One X2. And at $800 for the full system, which does include the core, the mounting bracket, the battery and the lenses, it is very expensive, and I don't yet feel this system's minor upgrades in low light performance and resolution, I mean, we went from 5.7K to 6K, y'all. I just don't think that's worth almost double the price of what is already available. And for existing One R and One RS users, the 1-inch 360 lens battery and mounting bracket are available for $650. Though for One R users, I would wait till there was a bit more testing done with that older core in this new system. None of that is to say that I'm not excited about this camera. I think it's great because not only does it feel better in my hands, but with every product released, Insta360's software gets better and better. And by putting a larger sensor into a camera that has gained significant popularity and has also been limited to a much smaller sensor size, well, it signals to me that the entire consumer 360 market is about to get a lot more exciting. This video is dedicated to my producer, Phil, who is quite literally a boss on inline skates. (upbeat music)",
    "transcript_keywords": [
        "camera",
        "CMOs sensors",
        "sensor",
        "core",
        "sensors",
        "CMOs",
        "Edition",
        "feel",
        "degree camera",
        "cameras",
        "battery",
        "USBC",
        "degree",
        "Dual",
        "larger sensor",
        "absolutely",
        "lens",
        "low",
        "bit",
        "mounting"
    ],
    "transcript_entity_values": [
        "zero",
        "a hundred",
        "239 grams",
        "TikToks with 360",
        "one",
        "30",
        "four",
        "1.3 inch",
        "1-inch 360",
        "USB",
        "Phil",
        "around 1.5 seconds",
        "one year",
        "650",
        "GoPro",
        "about an hour and a half",
        "1-inch",
        "RS 1-Inch 360 Edition",
        "two years",
        "CMOS",
        "50",
        "Ricoh",
        "two",
        "One",
        "6",
        "GoPro Max",
        "800",
        "5.7",
        "RS",
        "50",
        "2019",
        "79",
        "second",
        "Sony",
        "2018",
        "quarter inch",
        "micro SD",
        "first",
        "RX100",
        "Insta360",
        "62 minutes",
        "10"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "TIME",
        "DATE",
        "MONEY",
        "ORG",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "TIME",
        "CARDINAL"
    ]
}