{
    "id": "mTS7juj9N1E",
    "title": "ASUS GL503 ROG Strix - Best Gaming Laptop Screen for $1000",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-09-15T18:39:57Z",
    "video_url": "https://www.youtube.com/watch?v=mTS7juj9N1E",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "asus",
        "the best gaming laptop",
        "best screen",
        "gaming laptop",
        "cheapest gaming laptop",
        "cheap gaming laptop",
        "strix",
        "GL503",
        "GL703",
        "Acer",
        "GTX 1050",
        "GTX 1060",
        "GTX 1070",
        "Max Q",
        "Nvidia",
        "Awesome gaming laptop",
        "powerful gaming laptop",
        "cheap",
        "budget",
        "adobe RGB",
        "sRGB"
    ],
    "views": 1885093,
    "likes": 30563,
    "comments_count": 3165,
    "description": "Dave2D review of the Asus GL503 ROG Strix - The best laptop from Asus for affordable gaming with high quality screen. Great for video/content editing!  Available Here -   Music Credits: Background: Fili - H2O  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2xqGFA8",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going? Dave2D here, and this is the Asus GL503. So this is a laptop that's equipped with a GTX 1050. It's on like the lower tier in terms of gaming laptops but it's relatively inexpensive. It's built quite well and this is something that Asus has brought into the market to, just be a little bit different from every other gaming laptop. So the first thing I noticed when I picked this thing up is that the design language on this laptop is a little bit different from what they've gone for in the past. Normally, the ROG line is very much Black and Red. I think that Asus is like one of the original companies that did the whole Black and Red gamer thing. I feel like this is like the transition phase. I feel like we're on the edge. Next year, I really think that we will not be seeing as many Black and Red laptops as we've been seeing this year in the gaming industry. So this thing has no external Red accents. There's some Red in the exhaust vent and the ROG logo lights up Red but that's it. Everything else is Black, even the Keyboard lights are configurable to whatever color that you want. It has a metal top surface and the design of this is actually very similar to the Asus GX501 which is like their flagship laptop. And it's kind of weird to see the same kind of design language on a laptop that's significantly cheaper. So this thing starts at around $1000 and the build quality is quite good. The hinge is good, the paneling feels solid all around. And overall, it's a well built laptop. Now the bottom panel does not remove readily so There's like an access panel that you can remove to access the RAM, the Hard Drive and the SSD if you want to put one in. But the rest of the bottom panel is very difficult to remove. I tried for a little bit and I couldn't get it to come off. So if you need to kinda clean out the fans or access anything else like, maybe the Wi-Fi card in there, I'm sure it's doable but I didn't want to break the review unit. It's a little bit tougher than your average gaming laptop. If you'll notice there's only one RAM slot. The good thing is that it already comes with 16 gigs So if you want to upgrade it up to 32, you just need to buy a single stick of 16 and pop it in. The port selection on this thing is pretty good. You get one USB-C, it's not Thunderbolt 3 though. You get four USB threes, a couple of display outputs, an ethernet and an SD card slot. The audio jack that's on here is one of those combined ones so it has headphone and earphone at the same time. So you might like that, you might not. I personally prefer this type. When you crack it open you get a great Keyboard. The layout is nice, it's got a number pad and everything so you got that leftward Shift. But the keyboard feels very nice to type on. The keystrokes are a little bit softer than some gaming laptops. But I think that most people will like this thing pretty quickly. One feature I do like are the audio keys up top so you get volume Up/Down and Mute and it just makes it a little bit easier to control your sound in game. The fourth button is the ROG button and it launches the Asus ROG App for performance stats, fan control, and other things like that. The other app that Asus has is the ROG Aurora Core and This is the App that lets you switch the colors on the Keyboard. So there's four different zones and you can switch them to any color you want. The Trackpad down here is nice. It's smooth, it's plastic and it uses Windows Precision drivers. Which, in 2017, that's what you want. You want a Windows Precision driver based trackpad because everything else is not as good. The button mechanism is okay. It's good, it's just not perfect. There's a little bit of play before it actually depresses as I click. It does feel good though overall. The speakers are about average for a thousand dollar gaming laptop. They're not bad or anything. They're just not amazing. They get reasonably loud but they're not particularly clear. The screen is where I feel like this laptop shines. So a lot of times when you spend a thousand dollars for a gaming laptop, you're gonna get some better performance, but you're gonna get some not great displays. This display panel is quite good. Color accurate, bright and it just feels like a high quality display. Now there are variants of 120 hertz and other types of panels, but even the standard panel looks really good. So if you want to do some color accurate Work or video edits, this is a great screen to do it with. For the people interested this is what the webcam looks like. I guess this is what the Mic sounds like. The image looks a little dark, I mean it's a little bit underexposed. The resolution is there but, Underexposed Performance on this machine is going to vary depending on how you configure it. This ones running a GTX 1050. You can get a GTX 1060 for it. But for the 1050 model, it performs as you would expect. I ran some light and moderately demanding Games. And, because it's a 1050 you're not gonna get blistering performance. But, it's not bad. And the thermal output on this thing is easily handled with the cooling system. But if you configure yours with a GTX 1060, performance will be better but it will run hotter. The Fan noise on this laptop was louder than I thought it would be. It's a GTX 1050 right? So I was hoping for it to be a little bit quieter but this is is just how thinner gaming laptops are. The good thing though is that it is able to maintain comfortable temperatures when you're playing games. So with the Asus GL503, you're getting a laptop that starts at around $1000. You're getting great build quality and very little Red accents. The screen is great. It's only 1080p, but you're getting great color accuracy and good brightness. The keyboard is comfortable to use and you get four color zones to customize. The trackpad is accurate and uses Windows Precision drivers. On the inside: the GTX 1050, and the Kaby Lake CPU are good performers and are properly cooled. The RAM and the two drive slots are upgradeable. And down over here, the 64-Watt Hour battery gets around five hours of battery life depending on what you do. I ran my tests with the screen at 250 nits. So, who is this laptop for? Because this thing starts at around a thousand dollars. You can get gaming laptops with this kind of performance for around $800. Granted, the extra money in this thing goes towards better build quality, and a significantly better screen. So if that's what you're looking for, check this thing out. I really like this one. Okay, hope you guys enjoyed this video. Thumbs if you liked it. Subs if you loved it. See you guys next time! And, this thing's not black and red. I mean, that's worth $1000 by itself. [Outro music]",
    "transcript_keywords": [
        "thing",
        "laptop",
        "Red",
        "Asus",
        "good",
        "gaming laptops",
        "Black and Red",
        "Asus ROG App",
        "bit",
        "gaming",
        "GTX",
        "Black",
        "ROG",
        "Windows Precision",
        "laptops",
        "Asus ROG",
        "Red laptops",
        "Keyboard",
        "good thing",
        "performance"
    ],
    "transcript_entity_values": [
        "Black and Red",
        "1000",
        "a thousand dollars",
        "1060",
        "the Asus GL503",
        "Windows Precision",
        "around $800",
        "only one",
        "CPU",
        "Asus",
        "ROG",
        "thousand dollar",
        "the Asus ROG App",
        "USB",
        "one",
        "the Hard Drive",
        "this year",
        "the ROG Aurora Core",
        "around five hours",
        "fourth",
        "Black and Red",
        "the Asus GX501",
        "jack",
        "around $1000",
        "16",
        "GTX",
        "Next year",
        "SD",
        "120",
        "Mute",
        "3",
        "two",
        "only 1080p",
        "SSD",
        "first",
        "2017",
        "64-Watt Hour",
        "around a thousand dollars",
        "four",
        "32",
        "1050",
        "RAM",
        "the Asus GL503",
        "250",
        "USB-C",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "FAC",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "ORDINAL",
        "LOC",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORDINAL",
        "DATE",
        "TIME",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}