{
    "id": "MUU0BjJjAvk",
    "title": "The Future of Smartphone Cameras? Sony Xperia 1 IV!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-05-24T00:17:02Z",
    "video_url": "https://www.youtube.com/watch?v=MUU0BjJjAvk",
    "category": "Science & Technology",
    "tags": [
        "Sony Xperia",
        "Sony",
        "Sony smartphone",
        "Xperia 1 iv",
        "Xperia 1 IV",
        "Xperia 1",
        "Xperia 1 MK 4",
        "MKBHD",
        "Sony Xperia 1 review",
        "optical zoom",
        "Sony phone camera",
        "smartphone zoom"
    ],
    "views": 2815431,
    "likes": 105005,
    "comments_count": 4121,
    "description": "Sony might be onto something here with the Xperia 1 IV...  Sony Xperia 1 IV:  MKBHD Merch:   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   Phone provided by Sony for review.  ~",
    "description_links": [
        "https://amzn.to/3yUXeEv",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - Hey, what's up? MKBHD here. So this is the back of the iPhone 8, one camera. Then this is the back of the iPhone X, two cameras. This is the iPhone 13 Pro, three cameras. This is the back of the Galaxy S22 Ultra, four cameras. And you better believe there are some phones out now with five cameras. We've just gotten very used to the idea of smartphones having lots of cameras on the back. It's even become a little bit of a status thing. Like when you see that phone with several cameras on the back, you kind of know that that's one of the more premium ones. So this Sony phone may look like a bunch of the other ones that we've talked about and kind of just like a lot of other Sony phones, and it has all the Sony stuff that we've come to expect over the years, but it has one really key feature up its sleeve that makes it very different. See, those other types of phones, when they have three cameras, for example, they have three native focal lengths. Typically it's an ultrawide, a standard, and a telephoto. So that's awesome if you just hit the .5x button for an ultrawide or just hit the 3x button for that telephoto shot. Those are basically native optical zoom, but everything in between is just going to be digitally zooming between them. So if you zoom into 3.5x, that's basically the same as you cropping in slightly to a photo from the 3x camera after you take it. If you zoom into 2.5x, that's just zooming way in to the 1x lens with digital zoom. You're not getting more detail. The photo won't necessarily look better. It's just purely for convenience. So that's why you notice that little snap that happens when you get to the 3x and it switches to the next camera. That's how you can tell your photo will be better. But this Sony Xperia 1 Mark IV brings back the legendary continuous optical zoom through this telephoto camera. So last time we saw this was in the ASUS ZenFone Zoom back in 2015, which was a much worse camera and that kind of fell on its face. So the tech has come a long way since then. So there's still a 1x camera, yes, there's still a 0.7x for your ultrawide shots, but the telephoto camera is now behaving kind of like a full-size zoom lens with a focal length range of 85 millimeters to 125 millimeters. So it now lets you smoothly zoom between 3.5x and 5.2x with real optical zoom. And yes, that means there are moving parts inside the phone to make this happen. So Sony's been working on this for a little while. You might remember the Xperia 1 Mark III that I also reviewed, which is this one, which also had a pretty wild telephoto camera setup. This one with magnets snapped between 70 and 105 millimeters. So that was technically variable optical zoom, which is still super cool. It's like having two cameras in one in that telephoto camera. This one with continuous zoom is like having dozens of different focal lengths and dozens of cameras in one just in that telephoto. Now, any focal length between 85 and 125 millimeters will be perfectly native optical zoom. But again, it's more like having a real continuous zoom built into the back of a phone. Now, in practice, you can see here the zoom range is relatively small, 3.5x to 5.2x is not a huge zoom, but it does actually achieve its goal. This was the Xperia 1 III at 70 millimeters, then snap to 105 millimeters. Both of these are optical. Then this was when it was right in between, so just digital zoom. Now, this is the Xperia 1 Mark IV, first at 85 millimeters, then all the way in at 125 millimeters, and then here it is right in between. It's subtle, but it maintains better sharpness throughout this whole range while behaving just like a regular camera. And that is why I think this is, or at least logically should be, the future of smartphone cameras. We've been trying to get good variables, different focal lengths, on the back of smartphone cameras for a while now. Like I said, we've just accepted a bunch of different cameras on the back. So Galaxy S22 Ultra right now, what does that have? That has a regular camera, an ultrawide, a 3x telephoto, and a 10x telephoto so that it can balance between a variety of different focal lengths. Of course, 3x will be perfectly optical and then 10x will sharpen again. But again, it's still gonna be a little bit blurry in between. That's why this is ideal. This is literal perfect optical zoom throughout the whole range. You just can't beat physics. Now, of course, the tech has a lot to improve on. Probably the most obvious piece being it's gotta cover a wider and wider focal range as it gets better. Like I said, 3.5x to 5.2x turns out isn't a whole lot of zoom right now. But imagine a version that goes all the way from 2x to 8x and then maybe something does all the way from 1x to 10x. You know, suddenly you don't need a separate primary and telephoto camera anymore. And so I was just kind of logically extrapolating. It seems like it would be such a cool idea if we went from one camera on the back to two to three and then as the tech gets better and better, we go from three back to two and then back to one. But, but, the more I think about it, I don't actually think that we can expect to reduce all of the cameras on the back of the phones now all down to one just because the physics problem is incredibly hard. Like if you look at a mirrorless camera, you have one sensor but you still need to change lenses to go from ultrawide to a normal field of view to a telephoto. Even if they all can zoom, you really don't see often some casual lens that can do everything, like a 18 to 400 millimeter lens. Actually, I take that back. I just looked it up. There are some that exist. I just found on B&H there is an 8 to 800 millimeter lens, but it's the size of like a microwave. It's 53 pounds and costs $165,000. And that is the point here. This is a physics problem basically and all of the pain points of trying to solve that problem get magnified when you shrink it all down into like a tiny smartphone camera like this with these little itty-bitty sensors that don't gather that much light and where there's not a lot of room for high-quality optics. But high-quality optics really is the key here. So that ZenFone Zoom that we talked about earlier, that phone had a single camera that did 28 to 84 millimeters. So that's about 1x to 3x zoom. And I had never owned that camera or that phone, but from all the reviews I read, they all killed it for having really poor-quality optics and really bad images as a result. And so that means the technology has definitely gotten significantly better since then and hopefully that trend can continue. So I love that Sony's working on this. They stay really clever with it, obviously starting with turning everything sideways within the phone for the periscope zoom, and then using magnets to move around the optical elements inside in a super precise way. That is very impressive, what they've achieved so far. So file this down as yet another Sony phone with a super impressive, technically well-executed enthusiast feature, and then the rest of the phone built around it is exactly what you'd expect from Sony. It's an upgrade from the Xperia 1 Mark III that I reviewed less than a year ago. It's the same tall matte black shape and design. You can barely tell the difference from the outside between the phones, but they do have some year over year upgrades thrown in. They've still got their incredibly overkill 6 1/2-inch, 4K, 120 Hertz OLED display, but this one's even brighter, up to a thousand nits. So it's more visible outdoors and even more of a battery hog. The battery, though, is also bigger. It's up to 5,000 milliamp-hours now, and they've bumped it up to a Snapdragon 8 Gen 1 chip with 12 gigs of ram, half a terabyte of storage. There's updated loud speakers and a new 12-megapixel selfie camera. All three cameras on the back can shoot 4K 120 frames per second videos and 20 photos per second in bursts with Sony's awesome eye-tracking auto focus. And hey, I gotta hand it to Sony. I was gonna say, I think they're the only smartphone brand that's never had a notch in any of their phones, but I did look it up, there was actually once a Sony phone that had a notch and it was pretty brutal. But they've been remarkably consistent with this design. They're also one of the only ones keeping a headphone jack around despite being one of the companies selling tons of wireless earbuds too. So they've added a bunch of new software features around this phone centered around gaming and livestreaming. But at the same time, with all those pluses, there are definitely also still some classic Sony downsides. First starting with the fact that it's being unveiled now but isn't coming to the US till September. So you can sort of map out the hype curve dropping between now and then. And they very much still lean into the enthusiast Sony Alpha camera-like shooting experience, which is an upside for some people, but that also means there is no simple point-and-shoot portrait mode or night mode. You do have to dive straight into Sony's camera app, which obviously isn't for everybody. Also, fun fact, the box it comes in just has a phone. Yeah, just the phone. No charging brick. Also no USB-C cable, no paperwork. Just the phone, that's it. And it's gonna retail when it does land in the US for $1,599. So yeah, not for everybody. But hey, I gotta give Sony props because this is one of those things, like I really enjoy using these Sony phones. The software experience on them has kind of quietly become one of my favorite near-stock Android experiences on any Android phone. They get their updates. They're smooth all the time. And they consistently deliver some innovative, new stuff in every new phone they drop and they refuse to be notched or headphone-jack-dropping like kind of the rest of the phones out. So I'm glad it exists. All right, that's been it. Thanks for watching. Catch you guys in the next one. Peace. (upbeat music)",
    "transcript_keywords": [
        "Sony",
        "zoom",
        "camera",
        "cameras",
        "back",
        "phone",
        "telephoto camera",
        "Sony phone",
        "optical zoom",
        "telephoto",
        "phones",
        "millimeters",
        "optical",
        "Xperia",
        "Sony camera",
        "kind",
        "focal",
        "Sony Xperia",
        "Mark III",
        "Mark"
    ],
    "transcript_entity_values": [
        "2.5x",
        "some year",
        "two to three",
        "three",
        "2015",
        "Gen 1",
        "1,599",
        "one",
        "85 millimeters to 125 millimeters",
        "70 millimeters",
        "Xperia",
        "Hertz",
        "0.7x",
        "the Galaxy S22 Ultra",
        "four",
        "up to 5,000",
        "ZenFone Zoom",
        "2x",
        "Mark IV",
        "13",
        "Sony",
        "3.5x",
        "8 to 800 millimeter",
        "the ASUS ZenFone Zoom",
        "105 millimeters",
        "12",
        "20",
        "the years",
        "Galaxy S22 Ultra",
        "Android",
        "five",
        "between 70",
        "4",
        "half",
        "first",
        "18 to 400 millimeter",
        "84 millimeters",
        "28",
        "85 millimeters",
        "Snapdragon 8",
        "dozens",
        "First",
        "about 1x to 3x",
        "125 millimeters",
        "Sony Alpha",
        "53 pounds",
        "165,000",
        "between 85",
        "Xperia 1 Mark IV",
        "second",
        "US",
        "6 1/2-inch",
        "two",
        "3x",
        "September",
        "less than a year ago",
        "1x",
        "120",
        "12-megapixel",
        "night"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "EVENT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "LAW",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "TIME"
    ]
}