{
    "id": "mUwNreEyzec",
    "title": "If you HATE driving... get this! - Audi e-tron Sportback",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-07-20T19:00:26Z",
    "video_url": "https://www.youtube.com/watch?v=mUwNreEyzec",
    "category": "Science & Technology",
    "tags": [
        "Audi",
        "e-tron",
        "EV",
        "electric vehicle",
        "battery",
        "range",
        "anxiety",
        "performance",
        "comfort",
        "SUV",
        "EUV",
        "lane assist",
        "climate control",
        "Alex",
        "Unboxing",
        "Car"
    ],
    "views": 603744,
    "likes": 26387,
    "comments_count": 1752,
    "description": "Remotely monitor and manage your server or PC with Pulseway at   The Audi e-tron is an impressive EV at the luxury level, but it sacrifices a lot of driving performance/feedback for comfort. Let's see what Alex thinks in this \"unboxing\"!  Thanks to Openroad for lending us the Audi e-Tron Sportback! Check them out at  and check out their Portfolio system at     GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/pulsewayteams",
        "https://lmg.gg/16cb9",
        "https://lmg.gg/LzJgD",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Today we have the Audi e-tron Sportback. And the first thing about this thing, Oh my God it's massive, look at this. (upbeat music) I thought it was kind of just like a wagon, but no it is proper big. Now you can get the SUV version and that's comes, you know, it's higher in the back, it gives you a bit more room, but the Sports back, it drops down and I think it looks fantastic. Now you do get looks in this car, but not by you'd expect in the Porsche everyone looks at it everyone loves it in my like fun colored golf. Kids think it's awesome. And this right here, it's like retired women that are rich. They see this thing go past and they're like, yeah, I can dig that. If you want to set some Cougar traps, this is the car to have, it says a ground up electric SUV, but there are a lot of like electric car things that it just doesn't really have. So right here, you can have another charging port on this side. We'll come around, come on, Andy, you have your charging port on this side, this right here gets you 150 kilowatts of charging. Given the battery's massive, it still does take some time to give it all the juice. But if you have a charger at your house, you're going to be fine. 350 kilometers of range. That's like really quite good. Normally an electric car when you get in, you expect to just start. Whereas this one you'd have to press the start button and another thing that's kind of weird and old school. So you don't get a frunk, instead You get like a half frunk, I guess this is all it is. it is where they store Okay, it's fine. This is where they store the charging cable. You do get a high voltage one out of the box. Very nice. Some of them charge extra for that. It just doesn't feel great. Oh, well that doesn't really take away from the experience of driving or owning this thing. The side profile here is what you're paying for though. Like this swooping back. Well, if you think that model X's are boring, this is what you get. All of those do have the gull wing doors. Those are pretty sick, different kinds of trade-offs just to give you an idea of how heavy and just generally massive this thing is, these are 21 inch rims. Look at how much tire there still is here. There's what 265/45 R 21s. Freaking massive, also this paint rate here is 600 bucks. Like I said before, you are losing some trunk space by having the sport back, it comes down, it looks sexy, but there is still loads of space in here. Like if you want to stash a body. Easy, done. No one was suspected either mall bosses. Invest in these hopefully have appeal. You still have this on your car, Andy. Oh, wow. Look at how shiny that is. How long do you think this shiny thing is going to stay shiny, Andy? - Anyway. Under the trunk here, you get a spare tire. Love to see it, a lot of them only have the repair kits. I'm not a fan. Do have to blow this one up, but whatever. And a good bit of space down here for whatever you want. I like stuffing frozen goods down there. So it doesn't get hot in the sun, or you can get another person in there. You might have chop them up a bit, does this come out? What's this? - Wheel locks? Oh yeah, there you go. Of course you can also fold the seats down flat. I guess you kind of have to go all the way around to do that, but it works. popping in the back, this is rather comfortable. It's my first time back here, it's quite nice actually. We have the cup holders only small ones though. Oops. Did we get dual climate for the back? This is the best of your climate control I've ever seen. Yeah, also heated rear seats, very nice. Down here, we have two type C ports down at the bottom and privacy screens. Cool. This of course is where you plan on spending most of your time probably heard that there, there is enough space for an LTT water bottle to go in the door, but there's no lining inside of it. So it rattles around and makes quite a racket. It's annoying. I have felt liners in my goal. Why don't they have it here? Come on badge. The level of comfort in here overall is quite good. These seats are incredibly comfortable, heated and vented loved the venting very hot here right now. My only complaint really is that the armrest on the door here doesn't extend far enough back. So I kind of have to bring the seat further forward than I would like so that I can hit this. I really wish they had just brought it over onto the B pillar and had just a little bit here as well. And then I could be a lot more comfortable. Yeah. Tall people problems. My biggest concern about this car was the touchscreen down below, and at first it was pretty bad, but it turns out that on both of these, they come with haptic feedback enabled, turn that off works great. So you can swipe here, do pretty large amounts of temperature in one easy go. All of these are pretty clear, easy to see, easy to hit while you're driving. I have no real complaints. I'm pretty surprised, honestly. How did Porsche screw theirs up so bad guys just steal it from Audi. They haven't given you much for buttons in here, but they did give you the ones that are important. So you have a volume knob next song, last song. And almost most importantly for me, a hard button for enabling and disabling the parking thing. So it can be so annoying at times when it just starts beeping at you and you're looking at a drive-thru or something you're like, shut up car. You can just press that and turn it off. Wicked. Also the 360 camera and the parking stuff works really great. Awesome to have in a car that's this big. For the steering wheel, it feels really great, but we do have, of course the perennial problem of 2021 piano black here, it looks disgusting. Well, it looks good for about three and a half minutes, and then it looks disgusting. You touch it once, which these are designed to be touched. Looks terrible forever. Same with like, I know that this piano black that's here looks really nice for the first little bit. Cause it, you know, brings this in the display together, but you touch it once you have some dust collect on it. Look at that terrible. I'm sorry to sound like a broken record on the piano black, but it is legitimately terrible under the infotainment. Like it's a German luxury car. Your first week with this thing, it's going to be terrible. It's going to there's so many settings, just settings on settings on settings. And you have to figure out which ones you like as for how this works. It's actually a Samsung chip, that's powering this pretty fast, no real complaints, but the biggest and most bestest thing is you don't get wireless Android auto, but you can at least plug your phone in and can get wired Android auto. So you do that and you have all of these things here. You're never going to touch it again. One mild annoyance that I have is that when you do navigation through Android auto, it doesn't pop up on the navigation display up here. You have to do that through audio thing, which is bad and worse than Google maps. So you're going to only ever use this screen. One thing that's slightly annoying is that there's not really good spot in here to put the cable for your phone. It doesn't matter if you have an apple because there's a charger and there's wireless apple Car Play, but there's a pass through here. You're probably going to keep your phone in the center, most of the time. My biggest complaint with this setup though, is that you have your cup holders right here and your USB-C charging ports right beside it that are angled down. So any coffee spills it's going to get in and collect right in your charging ports, that'll be fun when those stop working in two years or whatever. One more, very small gripe about this area here. The 12 volts thing slowly, rotates itself while you drive. So it can never be perfectly straight, probably not a deal breaker, but if you're Andy, it might be. Although I wouldn't say this interior is striking. It is very striking at night. Everything that's here and here and there lights up, it looks fantastic. During the daytime that's fine. But every single material around here just feels great. This is actually ash, volcano ash. Apparently I liked the look of it now to get in gear, you use this little thing here. It actually works quite well. So you pull it all the way back. That's drive, push it forward. You hit reverse. And if you are in drive, you can also do a little half forward. And that puts you into boost mode. So you normally get 350 horsepower boost mode brings you up to 402, but it's still a little bit slow, but let's go and tell you that. But not until I tell you what our sponsor I remembered this time. Be proud of me, Johno, Thanks to Pulseway for sponsoring today's short circuit, Pulseway lets you centrally manage all your desktop servers, network devices and cloud infrastructure from one place. You'll be the first person to know when a user has an issue or when there's a problem with your IT environment. You get out of the box commands to take actions such as kill processes, reset user passwords, run PowerShell commands, backup files, and even remote control with powerful auto remediation pulseway can automatically resolve critical IT issues like low disk space, high CPU usage, or even restart your services. Try now for free at Pulseway.com or at the link below. Driving the E-tron is, well, if you like driving, don't get this car. It's not an accelerating drive, but if you don't like driving, this is an exceptional machine, the adaptive cruise in this is like no other car that I have driven. I have had stop and go adaptive cruise before, but I've never trusted it for that last, like 15 kilometers to stop. It's just never been quite smooth enough. I'm going to do no steering inputs. We're going around this corner. It's breaking quite nicely for the people in front of us. Come up here. I do need to tell him like where to go. And then it just slows us down. That was really good. That was the gentlest that a car has ever stopped me before. Now, the lane assist also is very good. It's lane centering and it's very easy to turn on and off. It's just right on the stock, press the one thing. So you don't have to worry about, you know, getting in your way when you're on kind of a tight and twisty road. And then you can just turn it on and sort of zone out when you're on your commute home. The lane centering in this is also excellent. So I'm going to my hands on the wheel, but I'm not turning it. Don't just put an orange on here. That's a terrible idea. This thing can't self-drive you need to have your inputs on occasion. Now in a lot of cars, I screw around with like the different drive modes, a whole bunch, and this I've just set it to auto. And I have not worried about it, one bit. This is not a sporty car. It's it's a heavy car. It's a real chunker. Even though you have the better part of 500 horsepower, it's slow. This thing is really slow. Now out of the box, this has automatic brake region. It works terrible. I hate it. I'm surprised how much I use and like these little floppy panels. So you have two levels. One of them's not quite single pedal driving, but pretty close. The other one's what I'd say is kind of like manual transmission car levels of engine braking. And that's where I left it most of the time I asked for the actual driving experience, it's pretty quick, but it doesn't shove you into the back of your seat. It kind of like nudges you back and I'm pretty sure that's due to like Audi's tuning of the throttle as opposed to what it's actually capable of. As for corners. It's fine. It has an electromechanical steering rack. Let's put it in here. I have no clue what's on the go. There's not much engagement. Like the steering weight's always very low, even in the sports setting. Like I do wish that they'd given me a bit more of a raw steering feel as opposed to the more, I guess, jelloy feel that there is here. We do have Android auto. So play Crabrave. - Crabrave by Noisestorm. Sure. Playing on Spotify. - I love having a useful voice assistant. Thank you, Google. We are going be in an O sound system and it is really good. There's not a lot of bass, but the base is there. If you're middle-aged, this is the perfect sound system. If my mom was to drive the Taycan, she would be terrified of hitting the gas, whereas in this thing right here, go into this corner flant it, that'll be exciting, but not terrifying. You know, for the person that I think is going to buy this it's really well done. For myself, I'm a bit of an SUV hater. I think wagons are just as practical and almost every situation handled way better. So I guess if you have the money to spend on one of these, should you get one? Maybe I guess it starts at 77 US realistically are in it for about a hundred once you put the options on here that you want. One that makes me really mad is that they don't give you rear side curtain airbags, $350 option. Increase the MSRP of the car by 350 bucks. I don't want someone's kid's head going through the side window cause you didn't spend that. For me, I'm not going to buy it. It's very expensive and not very fun to drive, but I could see a lot of people really liking it. You are looking at a very similar price to a model X, but the interior of this is a lot more comfortable. It's really great how it does just smooth out the ride. It makes it super quiet. It is compelling if you don't like driving and just want to get driven around, wouldn't buy it. But I do like it. It's a huge thanks to open road for getting us this. This is part of their premiere package where you can kind of like swap, swap luxury cars. If you want, you could just be driving this thing for not all that much. And yeah, hit like, get subscribed. Let us know how we can change these videos, cause we still haven't made very many car ones, and just have a great day. Ooh.",
    "transcript_keywords": [
        "thing",
        "car",
        "Audi etron Sportback",
        "back",
        "etron Sportback",
        "bit",
        "pretty",
        "driving",
        "kind",
        "good",
        "Android auto",
        "Sportback",
        "great",
        "lot",
        "charging",
        "drive",
        "electric car things",
        "time",
        "Andy",
        "works"
    ],
    "transcript_entity_values": [
        "half",
        "One",
        "265/45",
        "one",
        "US",
        "a great day",
        "12 volts",
        "two years",
        "150 kilowatts",
        "Cougar",
        "350 kilometers",
        "2021",
        "Google",
        "night",
        "a little half",
        "Pulseway.com",
        "Andy",
        "Porsche",
        "PowerShell",
        "21 inch",
        "LTT",
        "350",
        "Taycan",
        "daytime",
        "Audi",
        "Samsung",
        "Noisestorm",
        "Audi",
        "350 bucks",
        "600 bucks",
        "Pulseway",
        "first",
        "15 kilometers",
        "X",
        "about three and a half minutes",
        "two",
        "first week",
        "350",
        "Android",
        "German",
        "500",
        "Spotify",
        "about a hundred",
        "Car Play",
        "402",
        "CPU",
        "today",
        "Johno"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "DATE",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "NORP",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "NORP",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON"
    ]
}