{
    "id": "mVFlHC7aL9Y",
    "title": "How the Despacito producers use online sample stores to create hits",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-09-03T13:00:13Z",
    "video_url": "https://www.youtube.com/watch?v=mVFlHC7aL9Y",
    "category": "Science & Technology",
    "tags": [
        "sampling",
        "despacito",
        "music sampling",
        "music",
        "production",
        "music production",
        "splice",
        "latin pop",
        "andrés torres",
        "dani deahl",
        "the future of music",
        "future of music",
        "mauricio rengifo",
        "hip hop",
        "pop",
        "dance",
        "genius video",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "review",
        "microsoft",
        "verge",
        "the verge",
        "despacito producers",
        "splice samples",
        "make reggaeton beat",
        "andrés torres & mauricio rengifo",
        "how to sample",
        "sample",
        "sampled music",
        "sample tutorial",
        "hits",
        "ableton"
    ],
    "views": 98627,
    "likes": 2461,
    "comments_count": 123,
    "description": "In this episode of The Future of Music presented by Aloft Hotels, we visit the studio of top latin pop producers Mauricio Rengifo and Andrs Torres, most famous for their hit Despacito, to see how they make and use samples to create music. Sampling has influenced every genre of music from hip hop to dance, and its become a global industry where producers can buy and sell recorded sounds in online marketplaces to use in their work.   The Verges sponsors play an important role in funding our journalism, but do not influence editorial content. For more information about our ethics policy, visit   Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://www.theverge.com/ethics-statement.",
        "http://bit.ly/2luJtIS",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat electronic music) - Have you ever heard a new song and thought it sounded familiar? That might be because it is. Sampling is the creative art of cutting and pasting audio, and it's been used to create hits for decades. That catchy melody in Drake's Hotline Bling, (Holine Bling music) it's a *Timmy Thomas sample from 1972. (Timmy Thomas music sample) And the horns in Beyonce's Crazy in Love, (Crazy in Love) that's a Chi-Lites sample, also from the 70's. (The Chi-Lites music sample) Sampling has influenced every genre of music from hip-hop to dance, and it's become this global industry where producers can buy and sell sounds online to use in their own work. Top Latin pop producers, Andres Torres and Mauricio Rengifo, make and use samples to create global hits, most notably this song. (Despacito) We went to L.A. to check out how they use these snippets of audio samples to build a song. This is cute! Oh my gosh, look at this little backyard! - Welcome. - Hi! - Are you ready? - Yeah, I'm totally ready! - We started with a guitar, yeah. (guitar cord) And, then we were just found the quickest drum we can found. (guitar and drum) We will record in now some bass. (guitar, drum, and bass) Then, with this you can already start to write a song, and then you probably would add more stuff and make sections and make all that. But this took us 10 minutes to build, now we need to do the real thing that is write a song and then produce it. - Yeah no big deal. (laughing) Sampling started with people cutting up existing recordings to take bits like a melody or a single drum beat and use them in a new song. That still happens, but now musicians also create sounds specifically as samples. They can be purchased on online market places, like Splice or Sounds.com, and for a subscription fee you can use any of their sounds. - [Andres] So - [Andres And Mauricio] This is - Splice, it's like a bank of samples and is much more than that nowadays. It has a lot of things that we can play with, but we mainly use it as source to get samples. - So a lot of producers and really famous people that has great sounds and a lot of character on their productions put their samples there and they share them. So you download them in your song. - [Woman] Andres and Mauricio have released their own pack of samples. - That's the snare and this is the kick. - [Woman] Oh that's nice. - That's like a fiddle. - That's a nice tail-end on that. - Yeah. - Are there any sounds from Despacito in your sample pack? - There are, there are. - Probably, yeah. - Like a lot of percussion that we have used that are real people that we recorded, for example the cymbals. (Cymbals) Yeah, that's there, - The snare. - 100 percent. (Snare Drum) - That's there. (Bongo Drum) - [Woman] That's nice. - Yeah (Despacito) - Alright, so what project are we looking at now? - This is Runaway by Sebastian Yatra, Jonas Brothers, Daddy Yankee, and Natti Natasha. - [Woman] That's a lot of people. - Yeah - So basically, the track is half vocals, half instruments. - 'Cause there's a lot of artists. - So what part of the song uses a sample? - All the drums are sample, every drum in this song. The kick is even in our sample pack. - Actually the snare too. - Like this is, this is in our sample pack and this is, this is many sounds together. (Runaway) - [Woman] These market places let other musicians buy sounds from Despacito, Runaway, and other hit songs legally and for pennies. - Having one central place with really powerful search that lets you kind of dive in from a lot of different vectors right. You can come in and just browse what's new, you can search and see what's hot charts, or you can do an exact search for I need a flute in the key of B right now, you know. And like, what we watched was it just really evolved the way people think about creation and songwriting. - [Woman] Before these market places, samples were usually created by taking clips without permission, but that can land artists in hot water, including Vanilla Ice. - My lawyers handle all the stuff, I haven't talked to Queen or anything. It's no big deal, all it is is sample David Bowie and Queen. (Ice Ice Baby music) (Under Pressure music) - Back then, if you really wanted to clear something, when you pulled it from a track, it could never get done. People would try to extract it from the set where they heard it and hope no one notices and release their track and if their successful get sued. This library is made so that you can do what you want with it and not worry about that. And that to me is like, when you see the number one song using it, your like wow this is amazing. - So if you buy a sample on Splice, that's it, it's yours to use? - Yeah, I mean there's like, in your works, you don't have to do any attribution. It's yours to use, royalty free. That's the key, that's the term, royalty free. There's like, you know, minor things like you can't just resell the sample and things like that, but in your commercial works, you are good to go. (upbeat music) Have you guys heard any songs that have used sounds from your Splice pack? - We have heard a lot of drums being used and a song a Why Don't We. They used our, one guitar from our sample, but they tweaked it and the song is really awesome. (Come to Brazil music) ( Guitar sample) - I totally recognize it. - Yeah. - Yeah. - We're proud. - We feel super super cool about it. Yeah, you can, you can sit down with your guitar and start thinking about cords and all that or you can download something and you don't even know what cords are they. - And it doesn't matter. - 'Cause you start singing to it. - You have the samples, you have the plug-ins, now you have everything. - [Woman] Sample market places are beneficial for musicians on both ends. They provide instant and legal access to millions of sounds and have also become a way for more established artists to make money. Producers, like Andres and Mauricio, get paid in advance to make sample packs for Splice and again when someone downloads one of their sounds. - We're at this era where software is the primary instrument and also because of all the progress in distribution, you know, you can actually heard, you can actually make a living more. You don't need a record, a huge record deal, to break it or get enough money to go into a studio. - The most important thing if you go a little deeper than music is that it's equal, and that's the way art should be. To do music production, it was very expensive and very difficult to get stuff. - [Mauricio] That computer wasn't enough. - No. - [Mauricio] You needed a lot of stuff. - Now if you can get a computer that is already expensive, but once they get it they have access to the same things that we have and everybody can do the same quality of music and that for me is the world evolving and being a better place for art. (upbeat music) - Hey all I hope you enjoyed the video. It was brought to you by Aloft hotels, different by design. Thanks for watching. (Clap) - [Camera Man] Got it. - Good clap sounds. - [Camera Man] Yes. - Sample it. (laughing)",
    "transcript_keywords": [
        "sample",
        "Yeah",
        "song",
        "samples",
        "sounds",
        "Drake Hotline Bling",
        "lot",
        "Timmy Thomas sample",
        "Splice",
        "sounded familiar",
        "thought it sounded",
        "sample pack",
        "people",
        "make",
        "Andres and Mauricio",
        "pack",
        "Hotline Bling",
        "Timmy Thomas",
        "Drake Hotline",
        "heard"
    ],
    "transcript_entity_values": [
        "Jonas Brothers",
        "Brazil",
        "one",
        "Sounds.com",
        "Despacito",
        "Love",
        "millions",
        "Yankee",
        "Runaway",
        "Aloft hotels",
        "Splice",
        "Latin",
        "L.A.",
        "Mauricio",
        "Queen",
        "Splice",
        "a Chi-Lites",
        "half",
        "Vanilla Ice",
        "Natti Natasha",
        "Sebastian Yatra",
        "70",
        "Holine Bling",
        "Andres",
        "Bongo Drum",
        "10 minutes",
        "1972",
        "Drake",
        "decades",
        "David Bowie",
        "Despacito",
        "Timmy Thomas",
        "Beyonce's Crazy in Love",
        "Despacito",
        "Mauricio Rengifo",
        "Andres Torres"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "NORP",
        "GPE",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "LOC",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "TIME",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "GPE",
        "PERSON",
        "FAC",
        "PERSON",
        "PERSON",
        "PERSON"
    ]
}