{
    "id": "mVV2fF352qk",
    "title": "The Best Laptops of CES - GTX 1050 vs GTX 960M!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-01-11T23:54:53Z",
    "video_url": "https://www.youtube.com/watch?v=mVV2fF352qk",
    "category": "Science & Technology",
    "tags": [
        "CES 2017",
        "Razer",
        "Project Valerie",
        "Inspiron",
        "Acer",
        "Asus",
        "Nvidia",
        "GTX 1050",
        "GTX 1060",
        "GTX 960 vs GTX 1050"
    ],
    "views": 272822,
    "likes": 5951,
    "comments_count": 600,
    "description": "The best laptops from CES including some GTX 1050 and GTX 1050 Ti Benchmarks vs GTX 960M, GTX 970M and GTX 1060. Dell Inspiron 7000 -  Acer VX15 -   Music Credits: Intro: Tyler Touch - Act Of God ft. Jason Gaffner (Robotaki Remix) Background: Fili - The Break  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2j8Tp8f",
        "http://amzn.to/2ieb3I1",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Last one dude. You gotta get this, this is it. Oh! (Missed) Hey, how's it going guys this is Dave 2D and I just got back from CES 2017. Now, I don't go to this event with the intention of making a particular type of video, I just kind of go in if I see something cool I make a video, last year, at the beginning of 2016 Skylake H processors are coming out, and in the middle of last year the GTX 10 series for laptops came out and those things just blew the laptop industry wide open. They basically provided the graphics powers to make your laptop into a desktop replacement it was that awesome so that kind of big step up in performance you're not going to get that from the processor upgrades that we're getting right now that we saw at CES so we're getting the Kaby Lake H processor so the quad core Kaby Lake processors, the big graphics cards improvements are the new GTX 1050 and the GTX 1050Ti now I was able to play with both of them I was kind of disappointed because my expectations were unrealistically high I was so blown away by the 1060 to the 1070, 1080 cards those things are just amazing I kind of thought that 1050 would be also really cool, it is it's just that it's more tuned down so I would say that the 1050 is about a 20% maybe 25% improvement over the 960m from what I saw I had limited time working with it the 1050Ti we're looking at has slightly better performance than a 970m actually in some cases equivalent to the 970m but overall very cool cards I'm excited to give you full reviews of those shortly, the two laptops that kind of stuck out for me. First, the Dell Inspiron $7,800 laptop; GTX 1050; Kaby Lake CPU, it's a very capable machine and the pricing is really good; I think it looks better than last year's model and the trackpad feels nicer than last year's trackpad I wouldn't say it's a perfect trackpad or anything but for $800, pretty good value the other one is the Acer VX 15, it's also the same kind of idea; $800 gaming laptop, reasonably priced; good performance. Now, both of them have that black and red thing going on which I don't love but overall the performance for the money, I'm very happy with. Now on that note in general I think companies are kind of cluing into the fact that we don't love black and red gaming laptops, I mean maybe they sell in a particular type of demographic that I'm not familiar with or just maybe it's just my personal distaste for black and red gaming laptops but I mean this, those are just so played out. Look at this laptop, it's called the Samsung Odyssey they probably spent a good chunk of money in terms of R&D to develop this thing and comes onto the market looking very dated. Now again maybe this stuff sells really well in Asia or something but for me personally I'm just not a fan. Other cool stuff that I saw; I finally got to play with the Acer 21X predator, we saw this thing a few months ago at, I forget, some convention, but this thing is a beast $9,000; 20 pounds; but I mean it's 20 pounds of just sheer awesomeness. 120 Hz G-Sync panel; mechanical keyboard; and I mean like a real mechanical keyboard. I think these are Cherry MX browns. Great sound system and the whole laptop is just completely over the top now I tried to get a battery life estimate from one of the reps there and he wouldn't really give me one, he kind of danced around the topic but I think if I play this thing with max screen brightness, max gaming volume, max like everything across the board with RGB lighting going, I think I could kill the battery in like 20 minutes. It's kind of nuts it's not supposed to be a super portable device but it's just a very impressive product to begin with. $9,000 kind of makes it not really affordable for most people but yeah it's a pretty cool thing another thing I got to play with was Razer's super cool working concept called Project Valerie. It's based off the Razer Blade Pro but with three monitors. Now, I got to be honest when I first saw this thing and press like before the event I thought it was cool-looking but I didn't think it would be very practical but after using it in person it's really changed my perception of usability and even desirability, I mean it's still not something that I think everyone's going to buy or should buy but the triple monitor gaming thing is more immersive than I thought it would be, now I've played with triple monitors on my desktop before in the past and because your screen is kind of a certain distance away from your face, you just, I mean the immersion is there on a desktop as well but when you're playing on a laptop your face is just naturally closer to the screen and the immersion is just that much better. Now in terms of getting applications and programs running on this the Razer Media Suite didn't have them running so I couldn't really test a premiere on this thing, but I legitimately want to try one when they come out. One other thing to note I mean they don't work right now but they're aiming for automatic deployment like you press a button and the screens will automatically come out and get into position. How cool is that, right? Another thing I saw was the Asus water-cooled laptop. It's not new but let's step back for a second and understand what is going on here. This is a water-cooled laptop. They're pumping water into this laptop and then cooling it with a rad (radiator) to maximise overclock ability. Now in terms of just practicality, we're looking at a solid zero but in terms of like sheer coolness it's over 9000. Ok other cool stuff, the Dell 8k monitor, it's super sharp; super-high resolution, it's not the first of its kind but it's the first one that's kind of hit consumer grade, It's still a very expensive five thousand dollars and it needs a ridiculously powerful card to run it. You're looking at a GTX 1070, maybe a 1080 to power those pixels, and you need 2 displayports powered so if you have a Mac and you try to set this up you're gonna have to use 2 of your USB-C ports to get this thing going, actually they might have an adapter that can do... I don't know. It needs a lot of power, it needs a lot of cables to make this thing run but it's an 8k screen and it looks awesome Dell also had something called the Canvas which is a 27-inch monitor that's touch enabled. Reminiscent of the Microsoft Surface studio, but they market this thing as a secondary screen. Now I actually got to spend quite a bit of time on this thing I don't know how useful it is for my particular workflow because they didn't have Premiere installed, I tried to get used to I forget what video editing application they had going on there I mean it's entirely software dependent so I can't really give this thing even like a rough opinion. I would need to try it on Premiere but the idea is really cool, I definitely want to check it out when I can get one in. The TVs were on point as usual, lots of super thin stuff with great image quality. There were a lot of cars, Volkswagen in particular had a sweet electric concept with blue tires, I mean these blue tires will turn black on the road in like five seconds but it looked super cool in the show floor hence their inclusion in this video. 1 last thing I have a couple items that are still under NDA that are sitting, one of them is actually right off frame there, I can't do a review of them quite yet because the NDA has to lift but when it does and it will be soon, you'll be seeing a full review on a couple cool things that I'm pretty sure you guys will be interested in these are things that I'm like the super amped about personally. That's the end of this video, hope you guys liked it, thumbs if you liked it, subs if you loved it, it's been nice, see you guys next time.",
    "transcript_keywords": [
        "thing",
        "kind",
        "Kaby Lake",
        "laptop",
        "cool",
        "Kaby Lake CPU",
        "Kaby Lake processors",
        "GTX",
        "red gaming laptops",
        "things",
        "laptops",
        "core Kaby Lake",
        "gaming laptops",
        "super",
        "pretty cool thing",
        "Lake",
        "gaming",
        "Kaby",
        "Razer super cool",
        "monitor gaming thing"
    ],
    "transcript_entity_values": [
        "the Kaby Lake H",
        "970",
        "2",
        "8k",
        "NDA",
        "1060",
        "Dell",
        "800",
        "three",
        "Premiere",
        "Dave",
        "G-Sync",
        "Razer",
        "five thousand dollars",
        "1070",
        "Asia",
        "Asus",
        "One",
        "Acer",
        "about a 20%",
        "GTX 1050",
        "CES",
        "one",
        "Samsung",
        "27-inch",
        "Volkswagen",
        "Cherry MX",
        "9000",
        "First",
        "zero",
        "second",
        "RGB",
        "1050Ti",
        "1",
        "7,800",
        "GTX",
        "Canvas",
        "the Razer Media Suite",
        "Microsoft Surface",
        "120",
        "two",
        "first",
        "2017",
        "Kaby Lake CPU",
        "10",
        "2016",
        "1050",
        "like five seconds",
        "20 minutes",
        "960",
        "Kaby Lake",
        "20 pounds",
        "25%",
        "Mac",
        "1080",
        "last year's",
        "the middle of last year",
        "15",
        "last year",
        "a few months ago",
        "9,000",
        "Project Valerie",
        "the Razer Blade Pro",
        "max"
    ],
    "transcript_entity_types": [
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "LOC",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "TIME",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON"
    ]
}