{
    "id": "MW0kem1BKgg",
    "title": "Retro Tech: Macintosh Color Classic",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2017-02-07T16:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=MW0kem1BKgg",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "Macintosh",
        "Color Classic",
        "Mac",
        "computers",
        "retro computing",
        "vintage",
        "retro tech",
        "Mystic mod",
        "Takky",
        "LC III",
        "Color Classic II",
        "CCSCC",
        "Club for Creating the Strongest Color Classic",
        "Stuart Bell",
        "Applefritter",
        "mod",
        "hack",
        "Japan",
        "MacWorld Expo",
        "This Does Not Compute"
    ],
    "views": 111439,
    "likes": 4262,
    "comments_count": 207,
    "description": "The Color Classic may have been the last of the compact Macs, but it certainly left an interesting legacy.  -----------------------------------------------------------------------------  Sources and reference material, in order of appearance:  -- Jeff Keacher,  (Mac Plus image) -- Reddit user SeanEqualsYes,  (Classic II setup image) -- Wikipedia user Danamania,  (Classic II and SE studio images) -- Macworld magazine, April, 1993 (review articles) --  (LC III image) -- Jonathan Zufi,  (Color Classic II images) -- Low End Mac,  (Color Classic II specs screenshot) -- Lyle Hiroshi Saxon,  (MacWorld Expo 1993 footage) -- Mystic Room,  -- Imgur user 3583Bytes,  (LC 520 image) -- Stuart Bell,  (Mystic enabler, Takky portmanteau, motherboard connector relocation, stereo speakers and slot-loading CD-ROM screenshots) -- S. Watanabe,  (Mystic, Power Color Classic desk setup, G3 upgrade and main page screenshots) --  (Performa 5400 motherboard image) -- CCSCC English page,  -- John Stocker,  (Power Color Classic build page screenshot) -- New York Times article \"A Long-Discontinued Macintosh Thrills Collectors to the Core,\" August 24, 2000,   -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by Epidemic Sound ( Intro music by BoxCat Games (",
    "description_links": [
        "http://www.keacher.com",
        "https://www.reddit.com/r/retrobattlestations/comments/280v1l/68k_week_my_newly_functional_macintosh_classic_ii",
        "https://en.wikipedia.org/wiki/User:Danamania",
        "http://www.cuk.ch/articles/4133",
        "http://iconicbook.com",
        "http://www.lowendmac.com",
        "https://www.youtube.com/user/lylehsaxon",
        "http://web.archive.org/web/20050305174058/http://www.bekkoame.ne.jp/~t-imai/maine.html",
        "http://imgur.com/gallery/vYoOmyd",
        "http://www.applefritter.com/?q=powercolorclassic/stuartbell",
        "http://web.archive.org/web/20091217191523/http://homepage.mac.com/wtnb/index.htm",
        "https://compidiaries.wordpress.com/2011/09/08/ethernetkarte-fur-macintosh-performa-5400",
        "http://web.archive.org/web/20030623011714/http://kanchan.hn.org",
        "http://web.archive.org/web/20010712145042/http://glowsoft.com/sfs/pcc/modelb.html",
        "http://www.nytimes.com/2000/08/24/technology/a-long-discontinued-macintosh-still-thrills-collectors-to-the-core.html",
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "http://www.epidemicsound.com).",
        "http://www.box-cat.com)."
    ],
    "transcript": "Hey everyone, it's Colin. How's it goin'? The classic compact Macintosh is an icon in the retro computing world, but one particular model really took on a life of its own. This time, let's have a look at the Mac Color Classic. [ Music - Intro ] The year was 1993. Color screens on Macs were the norm, yet Apple's all-in-one computer, the Classic II, still sported a black-and-white display. Having debuted a year and a half prior, the machine was showing its age. On February 10th, Apple released the Color Classic. True to its name, it continued with the compact form-factor, but for the first time in the series, it featured a ten inch color display. It was powered by a 16 megahertz Motorola 68030 processor, and came with four megabytes of RAM and a 40, 80, or 160 megabyte hard drive. The design of the Color Classic was in some ways, the biggest change. Previous models were boxy and flat-sided, while the Color Classic made extensive use of compound curves. The machine was the first to use a new Apple design language called \"Espresso,\" which would soon be seen in other products as a replacement for the previous style, known as \"Snow White.\" Despite the Color display and fresh new appearance, the Color Classic garnered mixed reviews. It was praised for its crisp Trinitron screen and the addition of an expansion slot on the motherboard. But the design was a radical departure that some found jarring. What's more, its performance was considered just mediocre and its maximum RAM limit of ten megs was a major limitation. Another Mac, the LC III, launched alongside the Color Classic, and was considered a superior value because of its faster processor and higher RAM limit. As you might imagine, the machine didn't sell terribly well. Apple tried to remedy this by releasing the Color Classic II later in the year. It was essentially the same machine, but doubled the processor speed and bumped the maximum RAM to 36 megabytes. Yet curiously, the company only launched it in a few select countries in Europe, along with Canada and Japan. Sales remained slow and ultimately, the Color Classic was discontinued only about a year after its launch in March 1994, with the Color Classic II following suit in May. They would be the last compact Macs Apple would ever make. But that's not the end of this story. One country that happened to take a liking to the Color Classic was Japan. Its introduction had been held at the Tokyo MacWorld expo, and as some predicted, it found popularity due to its small footprint and color screen. Some who bought it simply accepted its limited performance, but others did something about it. A group of technically-minded owners banded together and formed the \"Club for Creating the Strongest Color Classic.\" They would end up pioneering the three major modifications that offer the biggest improvements to the computer. The first involved changing the screen resolution. 512x384 was similar to what previous compact Macs had used, but was too low for some software to run, such as games. A method to boost this to 640x480 was figured out, which involved delicate modifications to the system's high voltage analog board. This led to the first performance upgrade for the Color Classic. Apple had introduced the concept of a slide out motherboard with the system, meant to make the installation of RAM and expansion cards easier. It was a design the company continued with subsequent models, like the LC 520 from mid-1993. One particular computer, the LC 575, was the key to a solid Color Classic upgrade. It offered a 33 megahertz 68040 processor, which gave a notable performance increase and allowed the installation of Mac OS 8. Its motherboard was pin-compatible with that of the Color Classic, so one only needed to swap the two and then either perform the screen resolution mod, or simply install a software extension. This would eventually be called the \"Mystic Mod,\" after the supposed codename for a Color Classic III project that Apple canceled. An even more daring modification was developed sometime later. As Apple made the switch to PowerPC processors, it retained the slide-out motherboard in some models. But the boards were bigger and simply didn't work if slid into a Color Classic's chassis. Two members of the club devised a process called the \"Takky mod,\" a portmanteau of their screen names, \"Tak\" and \"Akky.\" It involved completely disassembling the machine, and not only replacing the motherboard's edge connector and rewiring a substantial portion of it, but also moving it further back in the chassis. It took a lot of work and was fairly risky, but ultimately produced Color Classics that were many times more powerful. As time went on, an English translation of the club's website became available and some Color Classic owners around the world began performing the modifications. This spurred some new ideas as well, like installing stereo speakers, G3 processor accelerator cards, and television tuners, and swapping out the floppy drive for a slot-loading CD-ROM. Color Classic modding reached its peak in the late '90s. And while doing so was by no means common, it did garner some curious attention. A number of sites dedicated to the topic sprang up, and even the New York Times ran an article on the practice in August 2000. The desire to upgrade these machines has long since faded. Even in their most powerful form, they're simply no longer capable of running modern software. They were fairly uncommon machines to begin with, and their numbers continue to dwindle. These days, Color Classics routinely sell for several hundred dollars on eBay. While it may not have been the most powerful or successful machine of its time, the Color Classic certainly ended the era of the compact Mac, on an interesting note. One could argue that no other computer since has enjoyed quite as fascinating of a life... after death. If you like the video, I'd appreciate a thumbs-up. Be sure to subscribe if you haven't already. You can follow me on Twitter and Instagram at thisdoesnotcomp, and as always, thanks for watching.",
    "transcript_keywords": [
        "Color Classic",
        "Mac Color Classic",
        "Color",
        "classic",
        "Color Classic III",
        "Strongest Color Classic",
        "Color Classic upgrade",
        "Color Classic made",
        "Color Classic chassis",
        "Color Classic owners",
        "Color Classic garnered",
        "solid Color Classic",
        "produced Color Classics",
        "Color Classic modding",
        "Color Classics routinely",
        "classic compact Macintosh",
        "Mac Color",
        "Apple",
        "color display",
        "compact Macs Apple"
    ],
    "transcript_entity_values": [
        "33 megahertz 68040",
        "the Color Classic",
        "Motorola",
        "Mystic Mod",
        "the New York Times",
        "Macs Apple",
        "36 megabytes",
        "ten megs",
        "March 1994",
        "several hundred dollars",
        "the Classic II",
        "two",
        "Apple",
        "eBay",
        "640x480",
        "80",
        "Akky",
        "Instagram",
        "later in the year",
        "only about a year",
        "Europe",
        "three",
        "Classic",
        "These days",
        "16 megahertz",
        "Macintosh",
        "Mac",
        "May",
        "February 10th",
        "Japan",
        "Takky",
        "mid-1993",
        "four megabytes",
        "Mac OS 8",
        "160 megabyte",
        "512x384",
        "520",
        "English",
        "40",
        "first",
        "one",
        "RAM",
        "the Color Classic II",
        "Canada",
        "575",
        "August 2000",
        "One",
        "the Tokyo MacWorld expo",
        "G3",
        "the late '90s",
        "Colin",
        "Trinitron",
        "Two",
        "Twitter",
        "1993",
        "the \"Club for Creating the Strongest Color Classic",
        "Espresso",
        "a year and a half",
        "Color Classics",
        "ten inch",
        "Snow White",
        "Color Classic",
        "Macs"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "LOC",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "LANGUAGE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "FAC",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "ORG"
    ]
}