{
    "id": "MWR2Y6ch2Wo",
    "title": "Are we CRAZY for buying 6 of these!? - Blackmagic URSA Mini Pro 12K",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-10-13T23:00:27Z",
    "video_url": "https://www.youtube.com/watch?v=MWR2Y6ch2Wo",
    "category": "Science & Technology",
    "tags": [
        "Blackmagic",
        "Ursa Mini Pro",
        "12K Resolution",
        "PL Mount",
        "V-Plate",
        "Film",
        "Recording",
        "Movies",
        "TV Shows",
        "Film Production",
        "Camera",
        "Digital",
        "8K",
        "120 FPS",
        "60 FPS",
        "240 FPS",
        "Cinema",
        "Brandon",
        "Unboxing"
    ],
    "views": 590827,
    "likes": 28364,
    "comments_count": 2711,
    "description": "The Blackmagic URSA Mini Pro 12K is an impressive piece of hardware, which also records in 12K resolution. You're going to be able to do many amazing things, but why did we buy 6 of them?  Buy Blackmagic Ursa Mini Pro 12K Camera on B&H (PAID LINK):  Buy Blackmagic URSA Mini Pro 12K Accessories On B&H (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/0XGnqne",
        "https://geni.us/R5oJDxy",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Six cameras. We bought six of this single camera. What camera? The Blackmagic URSA Mini Pro 12K. An 80 Megapixel cinema camera. Let's see what's in the box. You have the DaVinci resolve studio SD card that gives you a full copy of resolve. A black magic sticker. A little welcome quick start guide. This foam is really solid. That's good. Ah, there she is, beautiful. So, it comes with a power supply. Though in this box, I believe, it doesn't feel like-- you have some cables for a DIY V-Mount plate and then this power brick. However, the power brick doesn't come with a power cable. So, hopefully, you have a spare at home because Blackmagic doesn't include it. And here is the main event. The Blackmagic URSA Mini Pro 12K. It feels Toshiaki. Definitely feels 12K. I haven't looked at the URSA Mini since the first generation 'cause we never had a G2 LMG but when I saw the specs for the G2 and the way it was built I was pretty impressed with what Blackmagic was doing and there was a point in time where we considered picking up a few of the 4.6K G2. I'm glad we didn't 'cause now we have six of these. Before I do a physical tour, I'm sure many of you are asking does anyone need 12,000 Pixels in a camera? And the answer to that is absolutely not. Is it really cool? Yes. Is resolution everything? No. We've been using RED cameras here at LMG for about three years and those are already 8K which is in itself already almost too much resolution and here we are Blackmagic has made a 12K camera. I think because they really wanted a marketing spec to push and beyond the resolution this thing has a lot going for it. So, on the left of the camera you have a display for time code and your audio meters. This is pretty much standard ENG camera style which I personally love. Blackmagic has done a really good job of taking everything good about news gathering cameras or documentary cameras and just laid it out exactly how you would if you were building a camera like that. You have your ISO dials shutter, all the buttons that you would need, audio adjustments right here without even opening the display. It also has built-in ND filters why don't we actually have a look at those while looking at the 12K sensor. There it is 80 Megapixels. 12,288 Pixels by 6,840. I have never seen a higher resolution sensor. It also comes standard with a PL Mount which is a standard cinema professional mount. So, the URSA has two, four and six stops of ND not the highest ND you've ever seen but the fact that it has it in such a affordable camera is pretty awesome. On the inside, we have two CFS card slots more menu buttons, record buttons, more audio stuff. Top of the camera has the standard URSA four quarter 20 ports along with two XLR ports which we will test in a second. The rear of the camera has SDI out, SDI in a timecode in and the 12 volt power. The right of the camera has another SDI out. This one's only 3G and then 4-Pin XLR and a Rosett. So, you can use the Blackmagic control grip or a side plate. Also on the front and the top is the built in microphone which in my experience has been quite good for scratch audio. Like every camera that I've been checking out lately it also has a flip out screen. So, the URSA comes in with no battery mount at 4.87 pounds 4.8 pounds, is it gaining weight? It's gaining weight. Did you see the number? The number is growing. It was 87, now it's now .88, now it's .89 settled in 4.89 pounds. Now, in comparison, our RED Epic-W completely stripped down of all the mounting just has the lens mount and the battery plate weighs 4.67 pounds. So, they really are very similar in weight. However, the URSA has built an NDS, built in audio you wouldn't necessarily need to add that much more besides a top handle and maybe a side grip and some rods. Whereas with our RED, especially our RED setup gets quite a bit heavier because it doesn't have any belts and audio doesn't get it. It doesn't have built-in ND filters. So, you ended up having to rig this quite a bit more and it will end up weighing quite a bit more. So, it is honestly impressive that in less than five pounds Blackmagic has packed in everything you need for a documentary camera with the exception of a top handle lenses and some bottom support. But you really, if you don't want to,you don't have to do that much in terms of rigging for this camera. For those of you who have never bought an URSA or RED or any sort of camera that is modular in any degree you have to choose what battery plate that you want V-Mount or gold mount, it does not actually come with a battery plate. So, technically out of the box the only way you would be able to use this camera is with the power supply. But no, one's going to do that. Before we wrap up with the physical tour actually one last thing I wanted to mention is the bottom plate of the camera. This is true on the 4.6kg to URSA mini as well but they're all quarter 20 ports. Whereas on our RED cameras, it's quarter 20 and three eights, which is far more useful in my opinion and much more secure because quarter twenties while they work well for accessories and stuff the fact that this camera only has quarter twenties is a little bit annoying, not a huge deal but a small thing that might just be annoying for compatibility if you like put a plate directly on the camera and don't have any rod setup of any kind. Okay. So, with a PMO unlike the F Mount you don't just put it in and turn it and it locks you actually just line it up to the pin and then you lock it like this positively and then it is very tight. The boot time is not as long our RED cameras take forever to turn on. This was maybe like eight seconds or so. The menu in the URSA is similar to all Blackmagic's cameras. They standardized it among their cameras a couple of years ago and this particular URSA only shoots in Blackmagic RAW, which is their compressed RAW format similar to RED RAW, which is what we shoot on a daily basis. Blackmagic basically just has their own. You can shoot 5:1, 8:1 12:1 or 18:1 compression ratio which is great because the 1801 is pretty similar to the 20 to one that we use on our REDs. So, in terms of frame rates this camera can shoot up to 12K up to 60fps which is insane because even our RED camera is the best one that we have can only shoot up to 60fps at 8K. It can shoot up to 8K 120fps and if the 8K somehow isn't enough for you it also has 4K with that you can go up to 240fps with a super 16 crop. So, you have to crop the sensor quite a bit but it has 4K and 240fps in a camera that costs less than $10,000. The two cameras in closest competition to this one are the Sony FX9 which is a full frame camera and the C300 Mark III. Both of those don't do frame rates over 180fps and their FX9 currently can't do it internally. It can only do up to 120fps in HD. Granted that is a full frame sensor but the C300, for example, can only do 120fps in 4K. So, the fact that Blackmagic has managed to shove 240fps at 4K, yes, it's cropped thank you, Blackmagic. Okay. Why don't we do the audio test? So, this is what it looks like with the URSA shooting directly at the short circuit set in the same lighting that we were just looking at and I'm recording directly into the camera with a Sennheiser-416 Mic you guys can be the judge whether the audio is good or bad or acceptable. Still more testing to be done but here's the first impressions. We are also shooting only in 8K for this test. 12K still has some post workflow stuff that we need to work out. So, you guys can be the judge of what you think of the audio and video quality compared to what you're used to seeing on short circuit. So, this camera first impressions wouldn't be complete without showing you guys some footage and he actually took one of the cameras one of the six cameras that we bought out over the weekend and here is some footage that he got. (upbeat music) So, you might be asking why we bought six of these cameras. Now, the hope is that they can replace most of the cameras we have in the studio so, that we have a unified system where every camera is the same and all the parts and media everything is the same. It's gotten kind of crazy with the amount of cameras that we have. So, we are trying to simplify things. It remains to be seen if we're going to keep all six because we still have a lot more testing to do more post workflow stuff to figure out but on paper and in first impression this does seem like a great camera and we'll see if we ended up keeping all six. Watch out for the full review online detectives. If you guys have any specific questions please leave them in the comments down below and thank you for watching. Subscribe to ShortCircuit - Yaaaah - lttstore.com",
    "transcript_keywords": [
        "camera",
        "Blackmagic URSA Mini",
        "Blackmagic",
        "URSA",
        "cameras",
        "URSA Mini Pro",
        "URSA Mini",
        "RED cameras",
        "Blackmagic URSA",
        "RED",
        "audio",
        "Blackmagic cameras",
        "Mount",
        "plate",
        "Mini Pro",
        "power",
        "Mini",
        "Blackmagic RAW",
        "shoot",
        "good"
    ],
    "transcript_entity_values": [
        "60fps",
        "180fps",
        ".88",
        "ND",
        "RED RAW",
        "Toshiaki",
        "12,288",
        "three",
        "the weekend",
        "8",
        "about three years",
        "LMG",
        "4",
        "one",
        "NDS",
        "1801",
        "the 4.6kg",
        "quarter twenties",
        "C300",
        "4.89 pounds",
        "4.87 pounds 4.8 pounds",
        "20 to one",
        "6,840",
        ".89",
        "XLR",
        "K",
        "ISO",
        "second",
        "Blackmagic",
        "240fps",
        "only 3",
        "12,000",
        "The Blackmagic URSA Mini Pro",
        "the F Mount",
        "80",
        "less than $10,000",
        "Rosett",
        "daily",
        "first",
        "all quarter",
        "Blackmagic RAW",
        "8:1 12:1",
        "Sony",
        "URSA Mini",
        "16",
        "ShortCircuit - Yaaaah",
        "DaVinci",
        "two",
        "120fps",
        "4.6",
        "four",
        "5:1",
        "PMO",
        "12 volt",
        "87",
        "less than five pounds",
        "12",
        "G2",
        "a couple of years ago",
        "K 120fps",
        "SD",
        "six",
        "four quarter",
        "4.67 pounds",
        "URSA",
        "like eight seconds",
        "Blackmagic",
        "20",
        "18:1",
        "quarter 20",
        "12K.",
        "two CFS"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "LOC",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "TIME",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY"
    ]
}