{
    "id": "mYly1irRrBE",
    "title": "Muama Ryoko WiFi (Scam? Or Just Misleading?) - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2021-04-23T17:59:54Z",
    "video_url": "https://www.youtube.com/watch?v=mYly1irRrBE",
    "category": "Science & Technology",
    "tags": [
        "Muama Ryoko WiFi (Scam? Or Just Misleading?) - Krazy Ken's Tech Talk",
        "Ryoko WiFi",
        "4G LTE",
        "WiFi",
        "Apple",
        "iPhone",
        "Smartphone",
        "Personal Hotspot",
        "Smartphone Tethering",
        "Mac",
        "MacBook Pro",
        "Cellular Data",
        "Tech Scam",
        "False Advertising",
        "WiFi Hotspot",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer Clan"
    ],
    "views": 1044959,
    "likes": 36027,
    "comments_count": 2448,
    "description": "You can support this channel on Patreon! Link below Muama Ryoko offers WiFi with no contracts and no hidden fees. OH, REALLY?! Is it a scam, or just REALLY misleading? Let's find out. Watch more scam-busting episodes    Check out this other fishy WiFi device   Watch the insane Blaux scam-buster   Download our epic wallpapers   Subscribe and listen to our podcast (April 26)    Support our channel and get cool stuff   Subscribe for more tech videos!    Follow us on Twitter   Like us on Facebook    Muama Ryoko WiFi (Scam? Or Just Misleading?) - Krazy Ken's Tech Talk   Patrons got to see this episode early (and in much higher playback quality). They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #KrazyKen #ComputerClan",
    "description_links": [
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1riKzQK3dHt6c9_6D2lVwr78",
        "https://youtu.be/uDzMn9tfFUI",
        "https://youtu.be/GQdtfRHJTHQ",
        "https://thecomputerclan.com/wallpapers",
        "https://applekeynotechronicles.transistor.fm",
        "https://Patreon.com/KrazyKen",
        "https://subscribe.thecomputerclan.com",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "(upbeat music) - Hey guys, how are you all doing? If you're new here, welcome. My name is (beep) Hm, that was weird. Let's try that again. Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken. And I apologize for the network issues lately. 10 stories underground in the lair here. Networks can be a bit spotty. But then I found this Muama Ryoko device and it solved all of my problems, kinda. I received a lot of requests to look into this potential scam product. So of course, I went ahead and bought one and Hey, it's real. It actually arrived really quickly to my surprise. But there's a lot more to the story. So let's go ahead and dive in right now. So this is the Muama Ryoko. No, sadly not \"Ryuko\" but Ryoko. It claims to be an invention that everyone in the U.S is going crazy over. In this video ad read by a beautiful computer voiceover, they claim you can get your own WiFi anywhere, anytime, without a contract or hidden fees. - [Computer Voiceover] How to get your own WiFi internet anywhere, and any time without contract or hidden fees with this ingenious new device. - Good start, I guess. And now we dive into the backstory of this product. They claim Mike Anderson and John Moore are two network engineers who discovered a way to get fast internet. They used to work for a cell phone carrier company and they were displeased with the company's efforts to hide the best free WiFi hotspots by analyzing your data usage and tracking your location. Therefore tricking you into an expensive cell phone contract and saving more bandwidth than speed for their top paying customers. Yeah, look at this guy. He's the brains behind the whole operation. Him and his private plane and his Windows. Ultimately, Mike and John were disgusted by the company's more grabbing attitude, more grabbing. So they packed up their plants and started looking for a better way. Thus giving birth to the Muama Ryoko, a device which creates a wifi network using 4G LTE. Okay, where do we begin? All right, let's start taking a look at what's wrong with this ad. First off, Mike Anderson and John Moore aren't real people. Like we've seen in patterns earlier on the show, this type of stuff is just stock footage compiled together with a fake story. And you can actually get the stock clip on pond5.com. If you wish. second, this speed test shows an unrealistic 600 plus megabits per second download speed. Where in reality, this device can only theoretically top out at one 150. But that aside, one of the fishiest claims is that there's no hidden fees and you never have to worry about how much your internet connection costs. Now, there's two things I've learned in life. One, cooking oil is not an appropriate substitute for tanning lotion. And two, there's no such thing as a free lunch. In my opinion, these advertisers are making it seem like you don't have to pay for your data. There's no mention or disclaimer of any type of data charge anywhere, but they keep talking about this no limit sort of philosophy. But we'll dive more into that in just a sec. The ad also makes it seem like this thing is some sort of revolutionary product that was created by two underdogs to shake up the industry. But it really isn't. Tons of companies sell the sort of stuff. And the technology for it has been around for years. Heck, even your smartphone has a hotspot feature built in. You can turn that on and turn your phone into a wireless hotspot. So for most people, they already have a phone and they already have a data plan. You don't really need to pay for an additional data plan and carry around another device. It's not practical for most consumers. Real quick, here's the basics to how a personal hotspot works. Let's say you want to connect your MacBook Pro to the internet, but maybe you're somewhere where there's no WiFi in the area. However, there might be a cell tower. But the Mac can't connect to a cell tower, that's where the hotspot comes in. The hotspot device receives a signal from a compatible cell tower. In this example, a 4G LTE signal. Then the device routes the signal over WiFi radio waves. Now, a non cellular device like this MacBook Pro can connect to the internet. Some people may refer to this as tethering because you can physically plug your phone into your computer to use this feature. But with wireless becoming more mainstream, the word hotspot has grown more common. Different carriers have different bundles and features. And sometimes personal hotspot data is an extra charge. So read the fine print. And this brings us to another issue with the advertisement. It claims you can have internet access anytime, anywhere but your internet speed and reliability is only going to be as good as what the cell tower can give you. Think of those moments where you lose bars on your phone. You're in an area with a weak signal, the bars go down and the connection becomes really slow. The same thing will happen to these devices, they're not magically immune to it. So that's another issue I see with this ad. And the ad doesn't disclose who provides the data for this device. So it's kind of hard to check what coverage options are available. But we're just getting started. Now let's take a look at their web presence. There's some questionable review articles floating around about this Ryoko product. A big thing that tips me off is two different articles allegedly written by two different people that have the exact same headline. Oh, wait. This article has a disclaimer saying this is an advertisement. Well, that's perfect. Now, they can't be held accountable for the BS they're spewing to our consumers. I think, I'm not a lawyer. Whew, that was a close one. Anyway, one of these fake-y articles claims this is a Japanese invention. But on the back of the device, it says, developed in Europe. Now, I'm no geography expert but I'm pretty sure Japan is not part of Europe. But I guess the inventors could have been Japanese and they just happened to live in Europe. Articles aside, their main website is one of the nicer ones I've used during all of these scam tech investigations but it's still problematic. For starters, this pop-up chat appeared and Morgan's profile picture looks a little more suited to Tinder than support chat. For fun, I asked them if this product was a scam. And while we wait for an answer, let's poke around some more. Another issue is the homepage says, no limits. Which makes me think what's the catch. I couldn't find any disclaimer saying that a data plan is required. A proper website like this iPad website would disclose that information to the consumer. I assumed if I keep moving through the order process, I would eventually run into the catch behind this whole no limits, no hidden fees claim. So I'm just going to keep pushing forward. There's also some reviews which are questionable. I've seen other YouTube videos which show the reviews part of this website. And it looks like the review text has changed over time yet the reviewer's name and profile picture stays the same. And when you click on any of the interactive buttons on the review section, you're redirected to the Ryoko Facebook page. Many of the comments on the page were spam links to other products, but some looked like legit customers but their comments were usually asking why their order hasn't arrived yet. Real quick though, let's take a look at that chat. Nope, still no reply. Come on, Morgan. Don't ghost me now, please. Back on their website, their dedicated review page actually looked legitimate, more legit than the fake crap I usually deal with. it looked like a functional page and it appeared that a Ryoko moderator was replying to comments too. So I can give you a thumbs up there. However, I noticed something weird in the hero image. Recognize this guy, oh, yeah. This was the Hong Kong inventor from the Blaux Portable AC scan busting investigation. So the plot thickens a... Hey, if you haven't seen those episodes by the way, go check them out. It was a crazy three-parter. It was a lot of fun though. And you can buy this stock photo on Bigstock if you want by the way. Also another one of their sales pages contradicts itself. It shows a speed of 318 megabits per second in this screenshot. But then it says only 150 megabits per second in the sales copy. Red flag. All right, let's check in on that chat again. Nope, 24 minutes and no reply. Typically replies within four minutes, my ass. - Can't innovate anymore, my ass. - Apparently, Morgan doesn't want to talk with me. Can't blame you. When I searched for this product on YouTube, I found these crappy thumbnails which looked eerily familiar to the Blaux Portable AC ones. I'm really curious to see if there's some single graphic designer that these companies keep hiring 'cause they all look crappy and they all look the same. But if you thought the thumbnails were bad, the video is gonna wreck you. In the videos, there's some similar patterns to the Blaux videos such as this, \"Watch until the end graphic\" and this \"pros and cons\" comparison. But the worst part is, this ear rape of a narration. - [YELLING NARRATOR] HELLO FRIENDS!!! I welcome to all of you in this new video. - Look, look, look, look, look you don't need to yell into your microphone, you'll hurt its feelings. And also full disclaimer, I'm not saying this video was set up by the official company, it could just be a third-party reviewer. But I always find it weird that these sketchy products usually have these very cookie cutter videos that say, \"Oh, is it a scam or not?\" So it just seems like someone's pulling the strings here. Oh, and guess what I found on one of these channels? Another video about another fricking air cooler. Why do these people keep pushing air coolers? They don't live up to the hype. They're not magic, they suck. Stop it. So this whole thing feels pretty scammy. But again, on a technical level, this is totally feasible. But one question remained, how were they pulling off this whole no limits claim? I knew it was too good to be true, but less tech savvy consumers may not know better. So of course, I went ahead and bought one. I filled out my information, clicked the big green button and then boom, there it is. After the transaction was complete and they took my money, that's when they hit you with an upsell for the data. You only get 500 megabytes included with your purchase. Full perspective, if you stream a 4K movie at 16 megabits per second, you will exceed that data in about four minutes. That doesn't sound like no limits to me. Heck, even their most expensive plan at 39 euros a month, only has a 10-gigabyte limit. The data is provided by Viaota by the way unless you dig into the FAQ section on the website, a helpless consumer may not realize that they're going to get charged for data. You don't see the data plans until after your payment method is charged. So I think that kind of defeats the whole \"no hidden fees\" claim that might be up to debate, but I think that's a little fishy. So then they offered me a $20 upsell for three to five days express delivery. Here, why not? Then they tried to upsell me on a bunch of crap with this very salty no thanks message. \"I'm confident that I'll never have any dents water damage \"or internal component damage and am okay \"paying the regular replacement costs of any product.\" Ha, jokes on you. I've never water damaged any of my tech except my iPad Air. That was an expensive mistake. So after the order, I got an email saying, \"welcome to the team.\" Did I accidentally just submit a job application, what? Four days later, I received saved an email saying that the estimated dispatch time was three weeks. So I paid the $20 for the faster shipping and they're saying three weeks, they're doing quality checking c'mon. This is just a drop ship product. You don't have to do all of this quality checking for it. That was just a bunch of BS. Then five days later, I received an email saying they were packing the product up. And then I kid you not, a couple hours later, it arrived in the lair. So either their emailing system was all messed up or they stole the Amazon Portal Shipping that I showed in my Starscope episode. After the order, I ended up receiving a ton of spam emails and text messages, including yep, the dreaded Blaux. (laughs) These guys just don't want to leave me alone. So now that the product was here, it was time to test out how well it worked. Let's find out. As for the product itself, I actually liked the way it looks. It's pretty simple and really small. The SIM card installation was a little bit finicky especially with the flimsy plastic, but I got it to work. I pressed the power button and, voil The screen turned on showing me the default password and indicating it was connected to an AT&T tower. On my iPhone, I connected to the Ryoko WiFi and it worked on the first try. Then I ran a speed test and the 336 millisecond ping time was concerning to me. But the download speed wasn't terrible at 33.5. It certainly was no 150 but that's going to fluctuate based on your location. So I'm going to ignore that. The upload speed actually surprised me. At 22.5 megabits per second, that's about the same speed I get through my internet service provider. For a comparison, I connected to my carrier's LTE, and ran another test. That clocked in at 101 down and 25.9 up with only a 25 millisecond ping. It just makes sense to use my iPhone as a hotspot if I need to, instead of a device like this. So yeah, if you want to buy one, go ahead. Just make sure your expectations are in check and remember there's no such thing as a free lunch. But at least it's real. At least it showed up. There's some things I investigate that never show up. Heck, the first thing, the lip mobile the first thing I looked into still hasn't arrived. And just as a reminder, if you see other knock-off tech or scammy tech stuff, feel free to app me or DM me on Twitter @thecomputerclan and go ahead and follow along if you'd like as well. And if you'd like to help me buy more questionable products to look into, feel free to pledge on my Patreon and in exchange, I will give you some cool perks for your support. So thank you very much. And my new podcast launches on April 26th. If you're a Steve Jobs/Apple enthusiast, you're going to love this one. And Hey, if you like this episode, you know what to do. Thanks for sticking with me. Catch the crazy, pass it on. (upbeat music)",
    "transcript_keywords": [
        "data",
        "Muama Ryoko",
        "Ryoko",
        "product",
        "device",
        "Muama Ryoko device",
        "thing",
        "speed",
        "hotspot",
        "internet",
        "WiFi",
        "hidden fees",
        "Hey",
        "data plan",
        "phone",
        "cell",
        "cell tower",
        "claim",
        "website",
        "video"
    ],
    "transcript_entity_values": [
        "Muama Ryoko",
        "only 150 megabits",
        "Blaux Portable AC",
        "three to five days",
        "SIM",
        "five days later",
        "39 euros",
        "April 26th",
        "this MacBook Pro",
        "third",
        "10-gigabyte",
        "a Steve Jobs",
        "Viaota",
        "600 plus megabits",
        "Ryoko",
        "years",
        "a couple hours later",
        "33.5",
        "John Moore",
        "two",
        "FAQ",
        "25.9",
        "Four days later",
        "LTE",
        "Bigstock",
        "AT&T",
        "101",
        "25 millisecond ping",
        "500 megabytes",
        "Europe",
        "Amazon Portal Shipping",
        "16 megabits per second",
        "iPad",
        "Japanese",
        "Mac",
        "YouTube",
        "U.S",
        "Krazy Ken",
        "Japan",
        "Patreon",
        "Mike",
        "one 150",
        "Blaux",
        "336",
        "four minutes",
        "4",
        "Mike Anderson",
        "318 megabits",
        "Windows",
        "one",
        "first",
        "10",
        "Ryoko Facebook",
        "Morgan",
        "Tons",
        "One",
        "MacBook Pro",
        "Morgan",
        "iPhone",
        "24 minutes",
        "First",
        "John",
        "second",
        "about four minutes",
        "iPad Air",
        "Starscope",
        "20",
        "22.5 megabits",
        "Hong Kong",
        "sec",
        "three weeks",
        "three"
    ],
    "transcript_entity_types": [
        "PERSON",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "WORK_OF_ART",
        "ORDINAL",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "DATE",
        "TIME",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "LOC",
        "ORG",
        "QUANTITY",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "TIME",
        "ORDINAL",
        "PERSON",
        "ORDINAL",
        "TIME",
        "PRODUCT",
        "ORG",
        "MONEY",
        "QUANTITY",
        "GPE",
        "ORG",
        "DATE",
        "CARDINAL"
    ]
}