{
    "id": "mylziFLfn4g",
    "title": "Surface Book 2 Hands-On: Now In Jumbo & Junior Sizes",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-10-17T13:00:21Z",
    "video_url": "https://www.youtube.com/watch?v=mylziFLfn4g",
    "category": "Science & Technology",
    "tags": [
        "surface book 2 hands on",
        "surface book 2 review",
        "microsoft surface book 2",
        "surface book 2017",
        "surface book vs macbook pro",
        "surface book 2017 review",
        "mrmobile",
        "windows central",
        "michael fisher",
        "windows 10 fall creators update"
    ],
    "views": 248413,
    "likes": 7517,
    "comments_count": 734,
    "description": "For the past two years, the Microsoft Surface Book has sat at the apex of my ideal-Windows-device pyramid. When I reviewed its Performance Base upgrade last year, the Surface Book's funky four-in-one form factor won me over, its vast capabilities making up for its ponderous size and prodigious price tag. Today, Microsoft reinvigorates its halo notebook with the Surface Book 2, a duo of devices offering the same look and feel of the Surface Book, but with revised specs and two available sizes.  The Surface Book is a special line of machines, and the Surface Book 2 is just the shot in the arm the portfolio needed. Microsoft calls it twice as powerful as the MacBook Pro, and the company seems to be targeting Apple even more aggressively than it did last year, retaining the Surface Books USB-A ports and SD card reader while adding USB-C support. That kind of offering seems tailor-made for would-be Windows converts like myself  and itll be a miracle if I get to the other side of my Surface Book 2 review without buying one. Until then, hop on in to the Surface Book 2 hands-on, and let me know what you think of Microsoft's latest contender in the comments!   [SUBSCRIBE]     [ABOUT THE MICROSOFT SURFACE BOOK 2 HANDS-ON]  MrMobile's Surface Book 2 Hands-On was produced following two hours with Microsoft Surface Book 2 review devices at a press event hosted by Microsoft. The devices were preproduction hardware running a prerelease build of Windows 10 Pro with the Fall Creators Update.    [MUSIC]  Rule the World by Gyom, available at Premium Beat:   Days and Days by Eternity Bro, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.premiumbeat.com/royalty_free_music/songs/rule-the-world",
        "https://www.premiumbeat.com/royalty_free_music/songs/days-and-days",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] For the past two years, the Surface Book from Microsoft has been my most coveted notebook computer, the device I would switch to in an instant if I wasn't so dependent on a MacBook Pro for video editing. Well, not anymore. My new favorite non-MacBook to drool over is the Surface Book 2, and it's a much bigger upgrade than it might first appear. I'm Mister Mobile, and these are my first impressions from a two-hour hands-on. (upbeat music) The biggest change is in choice. The Surface Book 2 is available in two sizes, a 13 1/2-inch model like the current one and a new 15-inch trim. The Surface Book has never been a small computer thanks to its tall 3:2 display and the special fulcrum hinge, and the 15-incher feels truly mammoth as a result. While the hinge might look the same on the outside, it's been stiffened internally to accommodate the added mass of the larger clipboard, so you shouldn't get any more wobble than with the current Surface Book when you're using it as a touchscreen. Microsoft says it's reduced the time it takes to eject the clipboard too but to me, the difference was negligible. The net result is a Surface Book that, in both sizes, sticks firmly to its roots. The clipboard itself is a self-contained PC with a display that can register over 4,000 levels of pressure sensitivity, so you can use it with the Surface Pen. It runs Windows 10 Pro out of the box. On the 15-inch, that's powered by an eight generation Intel Core i7. And if you step it down to the smaller model, you've got the option of sticking with that same silicon or saving some dough with a seventh generation Core i5. Drop the clipboard into the keyboard dock and on the higher end models, you get an upgraded graphics processor with between two and six gigs of dedicated memory. That'll help when you're running 3D-heavy programs, video editors, and games. You also get a backlit keyboard with key travel only slightly shallower than last year, and you get access to a whole bucket full of batteries, approximately 80 watt-hours combined in the big one and 70 watt-hours in the junior Book. Microsoft says you should be able to squeeze five hours out of each in tablet mode and 17 hours when docked. Between you and me, that seems outrageously optimistic probably because it's a result of a looping video test but we'll have to wait for the full review to see if it pans out. Speaking of, subscribe to the Mister Mobile on YouTube so you don't miss it. That's a ton of power under the hood but my favorite features are visible right on the surface. See, unlike Apple, Microsoft isn't interested in courageously pushing the envelope by stripping its laptops of ports that professionals still use, so both new Surface Books come with two full-sized USB-A plugs, an SD card reader, and a new USB-C port that works for both data transfer and charging. To get the same options out of my brand new $4,000 MacBook Pro, I needed to buy a fistful of inconvenient adapters. While Microsoft did have to ditch the display port to make room for USB-C, I think the trade-off is well worth it. Are there decisions here that might give people pause? Yes. As beautiful as this design is, it's basically unchanged from the very first Surface Book, so some might find the aesthetics a bit stale. Also, between 3 1/2 and 4 1/4 pounds, these are not small machines. And with prices starting at 1,499 and 2,499 for junior and jumbo sizes respectively, they're not exactly competitively priced either when you take other Windows notebooks into account. But the Surface Book was never meant to compete with lower cost laptops, it was built to take on the MacBook Pro, and that's not blogger hyperbole either. Microsoft name-dropped the MacBook a lot at the launch event calling the Surface Book twice as powerful and reminding us all that it could be used as a laptop, a tablet, or a hybrid. Now add to that what I mentioned before, how frustrated some professionals are with Apple's insistence on forcing us into a USB-C future that our cameras and peripherals just aren't ready for yet, and then consider that the Surface Book starts at about the same price as a MacBook Pro. Even if you're like me, so reliant on Apple's software that moving over just isn't an option right now, you've got to admit, it's tempting. The Surface Book 2 is available for preorder November nine with a launch date of November 16 in the US. Mister Mobile's full review will hopefully be up around then covering all the little stuff from speakers to lapability that didn't make it into this quick look. In the meantime, let me know what you think. Do you own an earlier Surface Book, or are you maybe an Apple user on the brink of making the jump? Drop a line in the comments, let me know, and subscribe to the Mister Mobile on YouTube so you don't miss that full review. Until next time, thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "Surface Book",
        "Surface",
        "Book",
        "current Surface Book",
        "Surface Book starts",
        "earlier Surface Book",
        "Mister Mobile",
        "MacBook Pro",
        "Microsoft",
        "Pro",
        "Mobile",
        "Surface Pen",
        "Mister Mobile full",
        "Apple",
        "Mister",
        "current Surface",
        "MacBook",
        "coveted notebook computer",
        "clipboard",
        "junior Book"
    ],
    "transcript_entity_values": [
        "1,499",
        "the Surface Book",
        "the past two years",
        "a ton",
        "the Surface Book",
        "over 4,000",
        "eight",
        "15-inch",
        "two-hour",
        "a MacBook Pro",
        "between two",
        "USB-C",
        "November nine",
        "13 1/2-inch",
        "a Surface Book",
        "Microsoft",
        "Apple",
        "MacBook Pro",
        "last year",
        "YouTube",
        "USB",
        "15",
        "the Surface Book 2",
        "Mobile",
        "the Surface Pen",
        "4 1/4 pounds",
        "the Mister Mobile",
        "US",
        "first",
        "3:2",
        "Michael",
        "two",
        "MacBook",
        "seventh",
        "2,499",
        "November 16",
        "six",
        "Intel Core",
        "The Surface Book 2",
        "the MacBook Pro",
        "approximately 80 watt-hours",
        "Windows 10 Pro",
        "4,000",
        "The Surface Book",
        "70 watt-hours",
        "SD",
        "17 hours",
        "five hours",
        "between 3 1/2",
        "Surface Book"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "GPE",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "QUANTITY",
        "PRODUCT",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORG",
        "TIME",
        "TIME",
        "CARDINAL",
        "WORK_OF_ART"
    ]
}