{
    "id": "Mz-gyg93ks8",
    "title": "iMac $500 Nano-Texture Display vs. Standard Display - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-09-04T02:36:02Z",
    "video_url": "https://www.youtube.com/watch?v=Mz-gyg93ks8",
    "category": "Science & Technology",
    "tags": [
        "iMac $500 Nano-Texture Display vs. Standard Display - Krazy Ken's Tech Misadventures",
        "Nano-Texture",
        "Nano-Texture iMac",
        "2020 iMac",
        "Apple",
        "Pro Display XDR",
        "Glossy Display",
        "iMac",
        "Mac",
        "Macintosh",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Tech",
        "Computer",
        "Computer Clan",
        "Nano-Texture Glass",
        "Reactions"
    ],
    "views": 82099,
    "likes": 2455,
    "comments_count": 378,
    "description": "Apple's new 2020 iMac offers a $500 nano-texture display optiona feature which reduces glare on the screen. However, what are the tradeoffs? And is it worth $500 for the upgrade? Let's find out while Krazy Ken unwraps the iMac and tests it; you'll get his raw reactions and analysis.  Join our channel and get cool stuff!   Watch my 2020 iMac review   Subscribe for more tech videos!    Like us on Facebook   Follow us on Twitter    Krazy Ken's Tech Misadventures - iMac $500 Nano-Texture Display vs. Standard Display   Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!   Contact Us    Want music for your videos?   (We use these guys a lot. They're good.)  Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #KrazyKen #ComputerClan",
    "description_links": [
        "https://bit.ly/clan2JGWYhz",
        "https://bit.ly/clan2Ddznp6",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://Patreon.com/KrazyKen",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "https://bit.ly/clan2Dr3M3e",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- So I recently purchased Apple's new 2020 iMac. And I actually did a review episode about that. So go check that out. But that model has the glossy display. They introduced the nano-texture recently into the iMac line and I wanted to give it a try for the first time. So if you're ready. Let's take a look. (upbeat music) Hey guys, how are you all doing? Really that's just great. You know, I'm doing pretty great today too. If you're new here. Welcome. My name is Krazy Ken and this is a 2020 iMAC sitting right here with the nano-texture glass. So as you can see, I have not popped the cherry on this thing yet. So we're in this together. So this is just gonna be a quick one today because I wasn't planning on shooting this so soon actually. The computer actually arrived 14 days ahead of the shipping schedule. So good job Apple. All right. Just gonna hide back here for a little bit. All right. And I'm gonna neatly fold this instead of just crumbling it and throwing it away like I did on the live broadcast. And of course the static wrapper or whatever this is called is on here. So we don't get the full effect yet, but I can already kind of see it. Alright, let's peel it off. Oh, this is interesting. The eyesight camera has like a dedicated circle cut around it because they can't put the nano-texture glass in front of the camera. I'll just beam it into your face there. You can already tell just by looking at the reflections that the light is more diffused. It has more of that frosted look because the glass is, I don't know what the technical term is, but actually will just say in such a way where the light bounces off of it and scatters more, which reduces glare. So that's what got me excited, but I did have a YouTube comment say that although the glare is reduced, text looks kind of fuzzier and I'm not sure if I'm gonna be okay with that trade off, but we'll compare the reflectivity between the two. And we'll also compare text sharpness because honestly if text isn't sharp, I'm not gonna like that. I would rather go with the regular glossy display them. But first impressions, it looks really beautiful with that nice, like frosted glass kind of look. I also heard that you could only clean the nano-textured glass with one specific type of cloth that Apple says to clean it with. And I have not seen that yet ever in video or anything. And it really looked though I wanted to kind of save all this for myself, but I'm guessing it's in here somewhere and yep. This is new. I've never seen this in an Apple box before but I'm guessing this is the proprietary cloth you need to use to clean that screen. Cause I guess it's just really fragile or something, but yeah, let's have a look. Yeah. That looks like a slightly different material than what you would normally get. And you gotta use that. That's Smooth, oh yeah. That's smooth. Yeah, I guess he used that to clean the display. Alright, well again, I'm gonna try to keep this in like as pristine condition as possible. Because again, if I don't like this computer, well, the display I have to return it. The computer itself though is bad ass. Other than that, you know, AMD glitch, you know, everything else is really solid. Again, check out my review episode. It was pretty cool. I just wanna see if the instructions say like do not use any other type of cloth on this screen stickers. Oh yep. There it is. Right there. Cleaning the display for additional polishing clause con clause. It's been a long week, for additional polishing cloth contact AppleCare. They'll give you more cloths. That's so fricking cool, but yeah. Okay. I guess you can use, I suppose alcohol on here. I did not think you could, but I got plenty of that line around. So now let's compare them side by side. Hi. All right. So here we have the glossy display and here we have the nano-texture display but that was probably pretty clear at this point. As you can see, we're kind of really reflective over here and over here, the light is nice and soft. Now I'm gonna bust out my handy dandy little LED. You may remember this guy from my Pro Stand episode. Good times. Let's take a look and I have a monitor set up as well. So I can also see what the reflection looks like from your point of view. So, yep. It's not exactly a mirror it's not supposed to be. It's slightly darker. I think also there's like a bit more blue in the hue because when this like anti-reflective or anti-glare coating filters out light the blue hues escape still. But yeah, it's definitely better than what it was like in the like early Apple glossy display days. Those were pretty bad, but still pretty reflective on here. Yeah. It's just like a nice soft spotlight, pretty reflective, nice and diffused. Let's do it from like this distance here. Yeah. As you can see the white, just like I said earlier, it's scatters more so it's spread out more, but it's more soft and less like bright. And over here it's more concentrated. I think we all knew who was gonna win this little test, the nano-textured glass. But now the ultimate determining factor, how does text and other fine details look on the nano-textured glass here, because that is going to make it or break it for me. But thankfully Apple has an amazing completely 100% money-back 14-day guarantee. Thank goodness. So, let's put this thing up and try it out. You just gotta love that fresh Apple product smell. Well okay. Yeah. The desktop just logged in here and I mean, it looks really good. Like it's so cool that I have these lights up here and everything and the glare is just super, super, super subtle. So that is really cool. I'm kind of torn to be honest, cause it's really cool that there's like no glare and everything still looks beautiful but yes, text is super, super, super, slightly softer and there's a little super subtle texture you can see, especially on brighter images, man, I'm a little stuck. I don't really know which one I want to stick with. It feels like there's an extra layer of material that I just wanna rip off of this thing. And in a way there kind of is, but there isn't, it's still the same glass. It's just, I don't know. Acts differently or whatever. This is a trickier decision than I thought it would be. Honestly, I'll keep testing it out but I think I'm gonna return this one. So here's the thing, without business discounts and stuff, it's an extra $500 for the nano-textured glass. But I think you're probably better off like what I said in my first impressions, better off not doing the nano-texture. Saving the 500 bucks and just controlling your room, adjust your office or whatever. So there's no light just beaming in reflecting stuff off of your display. But I guess if you go with the nano-texture, you're probably gonna be working more with images than with text, I would assume. So it's probably not a bad trade off. Now, if you were like in the typography or writing then, yeah then you probably wouldn't wanna go the nano-texture route. Okay. So my demons and I talked it over and the consensus is I'm 99% sure. I'm gonna return this. So, I'll keep testing it a little bit more. Follow me on Twitter if you're not already cause I'll post some followups there, but yeah, it's kinda nice, but the trade off doesn't make it worth it to me. Plus the extra 500 bucks, super doesn't make it worth it to me. I hope you enjoyed coming along with me just on this quick little experiment here and hey, it was worth trying, right. Apple has an easy return policy. But I still wanna hear everyone else's thoughts. So, let me know what you think if you've tried this out in person before, but yeah, that's all I got for today. It was just a quick little experiment. Thanks for sticking with me. Catch the crazy and pass it on. (upbeat music)",
    "transcript_keywords": [
        "yeah",
        "Apple",
        "recently purchased Apple",
        "glass",
        "display",
        "kind",
        "super",
        "nanotexture",
        "purchased Apple",
        "nanotextured glass",
        "glossy display",
        "pretty",
        "text",
        "light",
        "Apple glossy display",
        "cool",
        "nice",
        "recently purchased",
        "cloth",
        "clean"
    ],
    "transcript_entity_values": [
        "14 days",
        "2020",
        "500 bucks",
        "display days",
        "a long week",
        "99%",
        "two",
        "Apple",
        "YouTube",
        "today",
        "Krazy Ken",
        "100%",
        "an extra $500",
        "first",
        "one",
        "Pro Stand",
        "AMD",
        "iMac",
        "iMac",
        "Twitter",
        "14-day",
        "AppleCare"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERCENT",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG"
    ]
}