{
    "id": "MzaQrNUrXoY",
    "title": "Buying a Cheaper Gaming Laptop in 2018",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-04-25T19:24:10Z",
    "video_url": "https://www.youtube.com/watch?v=MzaQrNUrXoY",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "cheap gaming laptop",
        "gtx 1050",
        "gtx 1060",
        "970m",
        "960m",
        "best gaming laptop",
        "cheapest gaming laptop",
        "best value gaming laptop",
        "$600",
        "$500",
        "best laptop for students",
        "best laptop for college",
        "budget",
        "cheaper",
        "refurbished",
        "used laptop"
    ],
    "views": 725683,
    "likes": 16753,
    "comments_count": 1069,
    "description": "There are a lot of 6-core gaming laptops coming out with the new 8750H CPU but for gamers, the new CPUs aren't really needed. Save some money with the previous generations! $600 Gaming Laptop -  XPS & Alienware Refurb -  Acer Refurb -   Laptops with the 6700HQ and 7700HQ from the previous generation still put out very comparable numbers in gaming performance.  Music: Fili - Dollar for my thoughts  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2Hs5Nx0",
        "http://outlet.us.dell.com",
        "https://acerrecertified.com/",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "(Super Cool animation ) Hey how's it going? Dave 2D here So, Right now in early to mid 2018 We actually see a lot of laptop companies Coming up with their 8th generation laptops So they are Coffee Lake H Processors Which are really powerful And for like the right user For CPU intensive applications, they are awesome So if you're a streamer Or if you do video editing Or if you do like 3D stuff machine learning 6 cores is excellent But for alot of people specially gamers thoes extra cores aren't all that useful So you can actually find some very comparable performance from previous generation laptops and just save a lot of money So This is kind of like a guide or some kind of like I don't know Just a video to kinda guide you in the right direction So, we gonna look at 2 things Refurb options and Used options So, the first thing is refurb Refurb devices like refurbished devices They're sometimes a stigma when it comes to like buying refurbished stuff like it's like...oh it used or whatever... but here is the thing a lot of refurbished laptops are coming from corporate devices, you like have that 45, 50 year old executive at a company that like gets new devices every year. part of the company perk right? (I wish :(( and one year later they get swapped out for a newer device and so that older device goes back to the laptop manufacturer they recondition it sometimes they swap out the battery and then they resell it at a severely discounted price point sometimes which is awesome And so those devices that comes from corporate ownership are just they so lightly used that they basically brand new and if you can get your hand on some of those Sometimes, it's like really good pricing So, refurbished options are excellent If..if you buy it from right brand So, apple they have excellent refurbished options like some of the stuff that comes from apple is basically brand new when you buy refurbished it gets all the warranty and everything but if we talk about gaming laptops the one brand comes to mind the one brand that really sticks out as like gaming a excellent option for me is dell They have what I consider They have very big corporate market So, they have a ton of consumers out there and that whole corporate ownership that I just described, happens alot with dell devices XPS line, like they have tons of them at are just 25 30% off. very significant and Same thing goes with their alienware lineup If you want like dedicated gaming same thing goes there So there are some other brands that have the refurbished thing as well Um.. Acer Asus, they all do it but the difference here is that the discount is not substantial I think alot of that comes from volume I think dell just have very big corporate enterprise market So this is how alot of this stuff do in this refurb cycle Um... they other option is buying used and when it comes to buying used your price going to vary very wildly You can get some sweet deals here and there but i'm just kinda gonna go through I don't know a few points that peoples should keep in mind when it comes to buying used Um..ok..First... Try to find a GTX 1050 or 1060 graphics card So, the 10'th series graphics cards are such a significant jump in performance from 9 series that you should try to get one if you can They just better at performance for lower voltage which means less heat and when you buying used, less heat is good! ok, so second thing want to keep in mind is thermal performance You dont want to buy a used laptops that didn't have good thermal performance because you never know how these things were treated right? If the previous user was constantly running their laptops at full tealt and had bad thermal performance...then yeah... You wana avoid device like that Now the last thing you want to keep in mind is That if you buying a device locally So, you can actually go check this thing out before you actually pay the guy money You wana stress test it Don't just like go there and take a look at it and play some games You wana bring a USB key loaded up with AIDA 64 or 3D mark or any kind of benchmark swift that you are comfortable with Bring it there. test it out. because if there is a problem with the laptop It will probably appear in stress test but you might miss it when playing games or something like that so stress test it if you can I know It feel dorky to go there and be like ...hey man can I use this USB key and stress test?... like just do it, like you going to pay this guy alot of money So do your do diligence Make sure to check it out as thoroughly as you can Ok that's basically it I mean there is alot of cool devices coming out right now 6 cores devices really powerful but for gamers This is just really good way to save some money Ok hope you guys enjoy this video Thumps if you like it Subs if you love it See you guys next time subs by RF",
    "transcript_keywords": [
        "refurb Refurb devices",
        "devices",
        "thing",
        "Coffee Lake",
        "Lake H Processors",
        "refurbished",
        "things Refurb options",
        "laptops",
        "alot",
        "buying",
        "Refurb",
        "performance",
        "excellent refurbished options",
        "refurbished options",
        "corporate",
        "brand",
        "refurb Refurb",
        "kind",
        "stress test",
        "device"
    ],
    "transcript_entity_values": [
        "2",
        "1060",
        "50 year old",
        "8th",
        "Dave",
        "CPU",
        "Coffee Lake H Processors",
        "early to mid 2018",
        "USB",
        "one",
        "XPS",
        "64",
        "First",
        "just 25 30%",
        "second",
        "GTX",
        "9",
        "a ton",
        "one year later",
        "first",
        "dell",
        "45",
        "6",
        "every year",
        "Acer Asus"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERCENT",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG"
    ]
}