{
    "id": "MzHCOtmI2kg",
    "title": "How a TikTok ban could actually work | The Vergecast",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-04-19T08:03:57Z",
    "video_url": "https://www.youtube.com/watch?v=MzHCOtmI2kg",
    "category": "Science & Technology",
    "tags": [
        "The Vergecast",
        "Vergecast",
        "The Verge",
        "Tech",
        "Technology",
        "podcast",
        "gadgets",
        "smartphones",
        "android",
        "samsung",
        "google",
        "oneplus",
        "apple",
        "iphone",
        "cameras",
        "review",
        "tiktok",
        "ban",
        "china",
        "montana",
        "bill",
        "legislation",
        "news",
        "policy",
        "explainer",
        "oled",
        "tv",
        "television",
        "buying guide",
        "micro LED",
        "CES",
        "screens"
    ],
    "views": 2409,
    "likes": 49,
    "comments_count": 3,
    "description": "Today on the flagship podcast of quantum dots:  Makena Kelly explains the various attempts from the US government to ban TikTok, and how that could actually work. Allison Johnson explains the state of the Android phone market, and where its headed next this year. Chris Welch explains why this may be the best time to buy an OLED TV. #Tech #News #Podcast  VOTE for us in the Peoples Voice Webby Awards for Best Technology Podcast:    Further reading: TikTok ban: all the news on attempts to ban the video platform:   Inside the US governments fight to ban TikTok:   The best Android phone to buy in 2023:   This is the best time in a decade to splurge on a premium OLED TV:   Making sense of new TV features in 2022:    00:00 - Intro 01:22 - TikTok banning attempts 21:41 - The best Android phones 46:09 - Premium OLED TVs",
    "description_links": [
        "http://bit.ly/3moCTDs",
        "https://bit.ly/3MPa7qw",
        "https://bit.ly/3Hhygmb",
        "https://bit.ly/43gsY3s",
        "https://bit.ly/41aTjP3",
        "https://bit.ly/3UO0LNI"
    ],
    "transcript": "Welcome to the Verge, the flagship podcast of Quantum Dots. I'm your friend, David Pierce, and I'm sitting here at my desk trying desperately to figure out the exact color temperature that my ring light should be. Liam, our producer, keeps telling me that I look weirdly tan and sort of gross on our video podcasts. So I'm sitting here trying to figure out how to balance the big glass doors on my left, the bricks behind me and outside, and the dark basement everywhere else. Basically, I just slide the thing until I look weird and orange, and then I slide it back until I look weird and blue. Somewhere in the middle. There is a right answer, I think, but I have kind of lost hope that I'm ever gonna find it. Okay. Sorry I have to stop this and focus. We have a great show coming up for you today. We're gonna talk about the TikTok ban, which I don't think is gonna happen, but if it does, we're gonna talk about how it might work. Then we're gonna talk about the state of Android phones and how it happened that really only two companies make phones worth buying anymore. And finally, we're gonna dig into old LED TVs and why these gorgeous, but flawed and very expensive screens are becoming a much better buy. All that is coming in just a sec. But first I think I'm gonna buy another ring light because that'll fix it, right? More ring lights I can't figure out is better than fewer ring lights. I can't figure out. I don't know. Here goes nothing. This is the verge cast. We'll be right. Welcome back. We've talked a bunch on this show about the various attempts by the US government to ban TikTok, and after a hearing a couple of weeks ago with TikTok, C E o, Shazi Chu, it's starting to look more and more likely that some kind of ban might actually happen, or at the very least that the government might try really, really hard to make it happen, but it won't be easy to do. The most current thing happening right now is a bill in Montana that would explicitly ban TikTok and would find any entity like an app store that makes it available to users. That would be a big deal for lots of obvious reasons that Bill has been passed, but hasn't been signed by the governor, at least as we're recording this. But things could change fast, and if that bill does become law and goes into effect in 2024, it will test. Big way, whether a TikTok band is actually legal and even possible. The Verges McKenna Kelly has been tracking this band for a while and was at that hearing the other week and has been looking into what might happen next. So she's here to explain. Hi McKenna. Hi. You survived the TikTok rallies, the great TikTok rallies of 2023, right, and I'm back and alive and there is more TikTok stuff happening. I was thinking about what I wanted to do here, cuz I feel like we've talked a lot on this show, including with you about whether a TikTok ban is a good idea. Correct me if I'm wrong, but I think fairly succinctly, neither of us. Think it's going to solve the problem it purports to solve. Is that fair to say? That's definitely fair. Okay. Uh, there's a lot of problems lawmakers say they have with TikTok, few of which either have evidence to justify them or would be resolved by a ban. Okay, good. So let's just leave that there for now. I wanna talk about like what it looks like to actually ban TikTok. And I think that if we're gonna do this, we have to start several years ago when Trump tried to do this, right? That was the first time that there actually was a ban happening. There was a lot of discussion before then about TikTok being a national security risk, um, asking other governmental bureaucracies to evaluate it. But it was Trump in 2020, right? When he signed that executive order banning TikTok. And of course, like WeChat and other Chinese affiliated services like that, that was like the first ban we ever had. Okay. That obviously didn't work. We still have TikTok. I just used TikTok before we got on this call. Like it still exists. Can confirm why didn't it work? Like what is between Donald Trump saying TikTok is banned and actual TikTok ban. Why? What happened? What fell apart there? Right. So it was an executive order. It was the president saying through some regulations with the executive branch that he is flat out going to ban TikTok. These powers have not been executed in this way before for something so flat out a direct ban on a specific company. So as soon as he signed that executive order, basically instantaneously, and I think we can. Just say that this will happen with any attempt to ban it. There was a series of legal challenges. TikTok sued the Trump administration at 1.3 influencers sued the Trump administration. And then there was also a third lawsuit, I believe, um, from a TikTok employee saying that this was unjustified. It had no legal grounding. And then of course, through the next couple weeks and months, I think it was only about three or four months, several US judges said that Trump had overstepped his power in the executive branch and was unable to do. Okay. And if I remember right, one of the justifications back then was essentially there's no evidence for this. You're, you're saying a bunch of things about Chinese involvement and the Chinese Communist Party, all of which could be big problems, and there could be real risks here, but you've provided us with essentially no evidence or justification for why you're doing this. Is that, am I remembering that correctly? Correct. And that's kind of what's been happening throughout these past couple years. I also wanna remind listeners in 2020 what was going on then? That was a presidential election. Uh, Trump was running against Joe Biden, and at that time, of course, Republicans, their campaign arms or campaign branches are trying to find something to get Joe Biden on or something that would snag Democrats on if Democrats were able to, you know, take over the White House again, and in which they did. So now you've seen this over the past couple years and over the, you know, the beginning and now we're getting to the end of Biden's first term, this pressure from Republicans to even Democrats now trying to get the administration to be tougher on China. And at this point it seems like TikTok, since it's such a well-known app, people use it, uh, it's become kind of this poster child for more than just, you know, AAU app that's got lawmakers pissed off about the how to pass out challenge national security, things like this. Uh, but just like the USS Beef, um, with China Rising as like a global superpower. That context, I think helps make sense to me of things like the, the Restrict Act, and we've had this run recently of people trying to pass legislation that sort of makes what Trump tried to do a couple of years ago possible to do now, right? Like, is that, are we just trying to sort of ret con that ability back to the president to ban an app if he feels like it, right? So look, so Trump tried to do this thing. He tried to ban the app. The court said no. Next step there is the legislative branch to be like, how do we as Congress, as elected officials of the people write a law that would allow a president to do this or. Allow the creation of some kind of process to essentially do that. And so we had the Restrict Act come out in March. People are really upset about it, uh, justifiably I think in many ways. And that creates a process. Now, it wouldn't be the president doing this, but it would be the Commerce department. Um, essentially taking about 180 days, whatever it is in the bill to create this process of analyzing foreign-owned technologies. Um, figuring out whether or not they pose a threat. And then, um, being able to roll out some kind of restrictions, punishments, whatever for these. Then, I guess, you know, investigated, evidential based, you know, moves to either ban or divest or things like that to better protect American data. Okay. So it's the kind of thing that, it was just like two years ago, there was nothing specifically allowing this, so it was very hard to pull it off. And now the goal is like, let's actually lay out the terms by which this is allowed. And then we can do it. Correct. Okay. Real quick, pause on the Restrict Act, just because this has come up a bunch and I'm curious to get your thoughts. The sort of two takes on the restrict act that I've read are, this is great, we need it Ban TikTok and all the way on the other side. This is a massive overreach. This essentially lets the president like Snoop on your browser history and do whatever they want to, anything. It's a total invasion of privacy and it'll destroy the internet as we know it. Where on that spectrum do you fall and do you feel like this bill actually. Right. So there has been so much said about this bill, and again, I don't want to diminish people's concerns because we've been through the Patriot Act. Uh, we've been through a lot of these oversteps of the government's power when it comes to the Restrict Act. We've spoken to Mark Warner specifically. He, his intention was not to, this is what he says, right? This is what he tells us. His intention was not to allow the government to snoop into your dms was not to fine you 20 million or what it is for downloading a vpn. That's not the intention. But of course, when you get down to legislative text, the words need to be very precise. Otherwise, you could get into a world where maybe a new administration decides that, oh yeah, we want to use this to justify some kind of program, uh, to justify something, you know, at the scale of like nsa. Citizen spying, things like that. I think that's extremely justified. And so right now, I don't think the intention of the, of the build is to do that. But when we talk to experts, people who are civil liberties experts, people who are digital privacy experts, there needs to be a process here. This is the first introduction of the bill. If it goes anywhere, it's likely to be rewritten. There's going, it's going to be amended, things are going to change. We're in this phase of the restrict act right now where I think everyone kind of needs to pump the brakes, um, about being scared, even though it is justified, and realize that the legislative process is going to play out. You know, people are going to introduce amendments. Uh, you're going to have civil liberties, think tanks, writing letters, um, trying to cooperate with lawmakers to make a better bill or to just stop it out. Okay. Let's assume that either the Restrict Act or something that looks kind of like it gets passed at some point in the Reserv near future, which I would argue is pretty likely, right? Like it, the, the momentum behind something like this seems fairly undeniable at the moment. Yeah, I, I think we're at a moment, and so the past couple weeks after the TikTok hearing, Congress went away for their spring break, which is a funny thing to say, but Congress goes on spring break and so they came back, uh, to Capitol Hill today, and there's a handful of things that are happening in Congress that really needs to be reckoned with. I think we're going to see a return of discussion on TikTok, but then we're also having the debt ceiling. Uh, what if America defaults? That's really scary. Um, that's probably the top priority for congressional lawmakers right now to solve. You know, I think over the next couple weeks we'll see a lot of things start to shake out, um, what Congress is really thinking at, if they're wanting to ban it outright, if we wanna see something like the restrict act. The thing is, is that they are kind of running out of time. I hate to say that you feel like our legislative officials would be a bit more agile, uh, with a whole year to get a lot of stuff done. But there's a lot of things and a lot of infighting and a lot of partisan issues going on. So I don't imagine something like TikTok happening too fast at the federal level. But of course, even with issues that we've talked about in the past with this, you know, on this podcast, we've seen a lot of momentum around data privacy. Well, where did that log go? We've seen a lot of momentum around antitrust. Where did that go? Where did it go though? It went to the states who can move a bit more agilely than, um, the federal. You know, lawmakers that we have. Right. That's a good segue into the next thing I wanted to talk about. So like, let, if we, if we get to a point where this becomes a thing that the government can do and get away with it, I still cannot wrap my head around what it looks like to do. And maybe the easiest place to start is with this bill in Montana that seems like it's winding, its way through actually being signed by the governor and maybe being law. Because at some point you have to decide how do we ban it? Because it's like, these always make me think of like, did you ever watch the office? Not really. You didn't watch the, okay. So anyway, so this is a totally pointless diversion, but there's a moment in the office where Michael Scott, the main character, is like having money problems. And somebody says what you have to do is declare bankruptcy. So he walks out into the, into the office and he just yells, I declare bankruptcy. And then somebody has to come up to him and be like, you know, that's not anything. Right. That's what these bands make me think of. It's just somebody's gonna come out and be like, I banned TikTok. Everybody's gonna be like, what? What does that mean? Right? So like if you're a Montana and you wanna ban TikTok, what do you do? What does that actually mean in practice? So essentially, that's exactly how it's going to play out. You're going to have the governor, if he decides to sign this bill, it would be him with a pen in his hand saying, I declare a TikTok band, like you said, amazing. But then there would be that person who comes outside, right? Who taps him on the shoulder and says, Hey, that's not how we do this. And what would happen is, I do imagine we've seen this with other bills. California had a section two 30 bill, uh, things like this, you have legal challenges. Maybe TikTok would sue the state of Montana over this bill. Uh, maybe it'd be influencers again, that's very hard to predict. Maybe the A C L U even would, uh, put together some kind of lawsuit. And so that would be up to a. A judge could decide initially when these cases are brought up, if they wanted to have an injunction, basically saying that we're gonna not be on the app. The app's going to be allowed, like we saw during Trump, there was injunctions allowing the app to stay live while we sort this out in the courts. Now, if a judge decides he doesn't want an injunction and TikTok just gets banned, that would be in the state of Montana. And I have a very hard time trying to understand how one state goes about doing this. We've seen this in Texas where Texas banned TikTok and government devices. That's fairly easy to do because you're able to, you know, go to the network settings on like government, uh, wifi networks and ban a specific app. It's like banning Minecraft on your student's iPad. It's pretty easy to. Is Montana going to work with telecom providers in some way to ban that at the, you know, at the pipes level? That's something that I haven't heard people talk about and especially, you know, we talk about this on a government-wide skill. I guess you could understand maybe they're being more of a strategy in that way, but on such a small scale level, especially without government control, you know, with privatized internet communications, it's very difficult to see how that would happen. Yeah, it seems like there's one version of it that you basically like compel the app stores to do it, which solves part of your problem, but then the web version still exists and it's very hard to compel those app stores to do those things. You could sort of do it like you're saying at the network level with the different ISPs, but that's also pretty easy to get around. You could do it with, I don't know, different like router providers. It just, it seems so complicated to me to figure out like where in the stack do you try to cut off TikTok and. If you do, I mean, it's like e every young person on planet Earth knows how to use A V P N right now. Like I, I just can't get past this idea that there basically is no such thing as banning TikTok and I don't know how anyone is gonna do it. I'm eager to see if it's possible to do, but I kind of don't think it is. Something that I have been thinking a lot about is app credentialing, location-based credentialing and whether TikTok could be forced through some sort of ban to say like if we see that someone is using this app in a certain zip code in a certain area, maybe they just don't allow use there. That could be something, but it's not something I could imagine TikTok just doing without like suing the state or without suing the government, you know, for some type of ban legislation or something. Right. Is there any precedent for something like this? Like have we ever seen even on a smaller scale, something like this happen? Yeah, so I wouldn't say a ban, but when you talk to Mark Warner who of course introduced the restrict act, he likes to point out cuz Bursky, you know, your safety software in Russia and, and things the government did there. I think another good one is something that we're actually gonna hear about a lot this week is um, Hua. N zt, zte, Chinese telecom providers, which are a lot easier. That's something where it's hardware, right? You know, if, if a telecom company bought Huawei, they can say, oh, we can just take that out and not use it anymore. If it's spanned, that is a physical object, right? That is a lot easier to take control of than this, you know, app, this service that goes over the internet than something that's just like a pole or equipment. Yeah, I mean, ironically, it seems like the best solution to that would be to build something a lot like China's great firewall. Which again, like irony in the truest sense of the word. Mm-hmm. That that is a thing that's gonna get bandied around as something to do. But it, it feels like if you really want to do it, you're gonna end up having to build something that comprehensive. Right. I imagine. So, and that gets to the heart of this, which a lot of people bring up, is, is this even something in accordance with American values? If something we're gonna talk about is, you know, being opposed to censorship, something that is like hot on the mind of Republicans right now with big tech companies. Like, do we even want to do this? Is this something that you know, is patriotic or, you know, even American the way in the sense that we've grown up viewing the country operating. So one last question on the Montana thing, it just made me think of the way we used to talk about right to repair stuff, which was that there was this belief in the right to repair community that if one state would make really intense right to repair rules, everybody else would have to follow along. Because if you're Apple, you don't wanna make one iPhone for Massachusetts and another iPhone for the rest of the country. So the idea was, as long as we can sort of make that first domino fall, everybody else will just play along. We'll get what we want even without a broader law. Do you think something like that works in this case too, that like if, if Montana does successfully pass and defend a law like this, that it could have bigger ramifications outside of Montana? Or is this just gonna be one small fight in many other much larger fights? So we've seen this a handful of times, and I'm not gonna say this has happened, you know, with a app like TikTok before, but when we look at a lot of like clean air regulation, uh, car regulation, when you look at even like biometric facial recognition that was in Illinois. Illinois passed that bill, a lot of companies have been sued, you know, for violating that law, um, in the state of Illinois. So this has happened before on different scales and levels. So if Montana does, and this is really, you know, I'm really going out on a limb to say if Montana does approve this bill, if it survives a legal challenge, I imagine that it's going to be like a pain in the butt for TikTok going forward more than anything. Yeah, I think people are still going to use it in other states. I think it's gonna be really, really hard for this to apply elsewhere. Also, like Montana is not a very densely populated state. I think like losing all. Users in Montana really won't hurt TikTok that much. Sure. But if you're enforcing it in a state like California or a state that's like larger New York, Texas, something like that. I could imagine that having a bit more weight than Montana, unfortunately. So all the listeners out in Montana, I'm sorry, I'm from Nebraska, it probably wouldn't happen there either. Yeah, no, that's fair. And it does seem like part of it, like you're talking about with the Illinois lawsuits, is that just ongoing threat of there are going to be people in Montana who keep using TikTok, even if TikTok gets banned in Montana. And I suspect that what the state of Montana is hoping is that that happens and Montana then has just an endless run of litigation against TikTok that it can use for all of the money in the world and hopefully just like scare TikTok far, far away in order to not have to pick that particular fight. Like it's weird that Montana believes it has that much power, but it does seem like underneath it, that's. Part of it, right, is like there are gonna be people who get around it and we want to have an angle through which we can cause trouble for TikTok. True. It also sets the precedent. So if Montana itself could have, you know, passed this bill, that's telling other, presumably I'm going to assume these are red states, that they would be able to pass similar legislation. It would give the green light to them. Cuz now all of a sudden there's precedent in the courts saying that, well, Montana did it. They got away with it. Now other red states or blue states, if it gets to that level, uh, could, you know, could approve some kind of similar ban and uh, have the justification for it to take place. And I would say just to like make the TikTok users feel a little better. Two things seem to me to be true, and I'm curious if you agree with both of them, and then we should take a break. The first is that all those hurdles you just described, the the passing, the law, the legal fights, the actual implementation of it, If those are even possible to get through, which I don't think they are, they're gonna take a really long time. So I would say it's like overwhelmingly unlikely that this is gonna happen. And if it does, it's not gonna happen for a long time. Do you agree with that? Am I, am I too optimistic on the TikTok front there? That's fair. And I think that there is a lot of momentum now even building in Congress in the civil rights communities and just like organizers period, uh, saying that we don't want this to happen and there is going to be a fight. I think for a long time no one wanted to be on TikTok side here, uh, at all vouching for them. And we're definitely getting to a point, at least over the last couple months, where people have become a lot louder and a lot more outspoken about what a ban would mean, whether that's for free speech, whether that is, you know, government oversight, government having too much power. Uh, I think that we would definitely see a bigger opposition campaign movement to a ban like this. Okay. All right. Well then I suspect we're gonna have many chances to talk about this. It's gonna be a long year, but yeah, it really is. We're gonna talk about TikTok so much this year, uh, but at least we can talk about Twitter less so it's like, it's kind of a victory. I don't know. Anyway, McKenna, thank you. We need to take a break and then we're gonna come back and talk about all the best Android phones on which you can watch TikTok. Thank you McKenna. We'll be right back. Bye. Welcome back. It's mid-April, it's about to be phone season. We're gonna hear about the new version of Android at Google io in a couple of weeks, and then the new version of iOS. A few weeks later at wwdc, Samsung's gonna launch some stuff. Google's gonna launch some stuff. If a's coming, lots of other companies are gonna tell us about their new smartphones. So it felt like a good time to bring in the verges, Allison Johnson, to talk about the state of the Android market in particular, and where all of this goes next. Alison, hello. Thank you for being here. Hello. Thank you for having me. Okay, so I wanna start by telling you about a thing I just did on the internet, uhoh, which is a weird thing to say. I probably shouldn't have said it like that, but here we go. So you just wrote, uh, you know, you updated our guide to the best Android phone for 2023, and the state of the Android phones is basically. Like there's sort of two companies that exist and really not that much else, and so I was like, okay, has it always been this way? So I went back 10 years and just Googled best Android phone 2013, and I landed on an Android Authority page. Mm-hmm. It's a good article. And just going through the list, it recommends an HTC phone. Mm-hmm. A Google phone, a Samsung phone, a Sony phone, an LG phone, and a Seuss phone, which is a wild take even then, but we'll, we'll give them that, uh, a Motorola phone, another Sony phone. So the point is there was this like big teaming ecosystem. Yeah, of Android phones out there and then I go through yours and it's just like Samsung and Google. Samsung and Google. And then like on the side, if you don't want one of those one plus. So my question is like what happened? Like is the, how did it end up that essentially like for all intents and purposes, the only Android manufacturer that exists is Samsung and then there's like some other ones on the side, but it's just Samsung's world and we live in it now. How did we get to this point? Well, I think the big disclaimer on that is that is a hundred percent the case in the US fair. If you live somewhere else in Europe and Asia, you have a lot of other choices that we don't get for certain reasons. I think some of it's down to the stranglehold that carriers have over our wireless industry here. But yeah, it. It's, I don't wanna say bleak, but when you're going through and they're really good fonts. I mean, we have great phones from Google and Samsung to choose from, and I don't feel like if you get one of those flagships, I don't feel like there's huge things you're missing out on. But yeah, it's not as like vibrant and you don't have kind of as many like weirdo options or companies trying. Strange little things and like LG kind of before they fell out, you know, the things they were doing with like the wing and Yeah. Yeah. I think it just became a like a numbers game and they just didn't sell enough of those weirdo phones and Samsung. Kind of consolidated its lead and made it hard for some of those other companies to compete here. At least that's my read on it. No, I think that's fair. And I think, I think you're right. We're lucky to some extent that these phones are very good, right? Like you, you mm-hmm. Kind of land on the best Android phone for most people is the Samsung Galaxy S 23 Plus, which is an excellent phone in almost every respect. And the ways in which it sucked. We're gonna talk about it in a minute, but I do think it's true that there was a weirdness to all those old phones that we used to get. Motorola was trying with like the modular stuff, and they had swappable things in different colors. And LG with the Wing was like, what if you're screen swiveled? And everybody's like, no thanks, but like, I'm glad that existed. Right? And it, it does feel like, especially in the us, we have just landed. This is what a phone looks like and roughly how it works, and you actually kind of are not allowed to change that anymore. Mm-hmm. And that just sort of makes me sad. I know. I mean, the, like, the one thing to add to that is foldables in, like, that'll definitely be a theme in the upcoming year. We'll hopefully see, you know, Some competition for Samsung in, again, in this country mm-hmm. Where Samsung rules. But yeah, at the end of the day, if, uh, galaxy Z fold is a, is a phone that goes like fault. It's not Yeah. You know, it doesn't, the screen doesn't like swivel. Yeah. There's nothing you can like magnetically attach to it like a transformer. Yeah. I, it's, it's like good and bad. Yeah. I think that's fair. Okay, so let's talk about the phones that do exist. And you did a thing right at the top of your guide, which is very good, where you basically laid out four things that you're looking for in a really good phone. And I feel like this, we, we can sort of imply that, you should assume that like performance is good and the battery doesn't die in five minutes. Right? Right. But beyond sort of basic phone stuff, the four things you landed on were longevity, a great screen quality cameras and wireless charging. My immediate question on reading the floor of those is that wireless charging seems like by far the least important of those. And I would not have necessarily even put it on the list. So why did you put it on the list? Why does it belong on the floor? I think it's, when you look at kind of the top phones available, they've all kind of agreed on a, a set of specs that they're gonna have. You're gonna get a 120 hertz refresh rate screen, you're gonna get an IP 68 rating. What separates like a phone you would really like from maybe the phone that's not right for you is like a kind of narrowing list of things. Interesting. Personally, I don't use wireless charging, so it's, for me, it's not a deal breaker at all. But it's one thing I hear about when it's not on a phone and the wireless charging fans come out and say, no, this is bad. Right. But it, yeah, it is one of those things that's like, you are starting to be able to just expect it from a flagship phone. So when it's not there, it's just sort of worth noting. Yeah, that's totally fair. And I think that's actually one way to think about how things have changed over 10 years ago. Like in 2013, it was very possible to buy a bad smartphone. Mm-hmm. Like a lot of smartphones sucked so much in 2013. They were slow, they had bad software. The cameras were awful. The, like, we were still doing that thing where it had the, like, really the, the scroll lag as you would move around on Andrew. Like it was bad times. And it does seem like now it's true that if you buy sort of any of the like reputable. Android smartphones in 2023. They're pretty much all like different degrees of at least very good, right? Mm-hmm. That's a good thing. That's progress, right? And even down to like 500 do what you can get for a phone on $500 is kind of silly. I just reviewed the Samsung A 54. It has a great screen, like really good build quality, has some waterproof resistance. If I set it next to a S 23 plus and I like go across the room and look at it, I can't tell the difference and it costs $500 less. So just like across a board, you can get a. Pretty good phone. Like you have to try pretty hard to get a bad phone. I think somewhere somebody is holding their LG wing being like, no, I don't. I don't have to try that hard. It's right here. Longevity was the other one that jumped out to me. Cuz I think for me, the thing for years has been I, I feel like phones were becoming increasingly just like vehicles for cameras. And it was like, if you wanted to know the difference between phones, most of what you had to talk about in terms of like regular people use cases was the camera. But to some extent I feel like that has almost flipped now where like all the cameras are pretty good, right? They have funky stuff, they take fake pictures of the moon, like mm-hmm it's fine. The cameras are good on, again, almost all of these phones. And so it was interesting to me that you put longevity at the top of that list. Because now we're getting back to really interesting stuff where like you want to keep your phone for longer, which makes sense because they're better and they're really expensive. And so questions about like, how long is this physical object going to hold up are way more important than I think they were even a few years ago, when people are still upgrading their phones more often. And that's one place where it seems like all phones are very much not created equal. Right? Yeah. And I think this is kind of like. A bright spot in the past few years is Samsung has really come out with a really strong support policy where basically all their flagship and even the mid-range phones will get four OS updates, um, like version updates. Mm-hmm. And then five years of security patches. And it like slows way down. You know, by the fifth year you're not getting a security patch every month, but that is really good if you just want to hold onto your phone. You don't wanna keep buying a new phone every two or three years and it'll, it'll remain like relatively. Safe and it'll keep working. So like they sort of came out with that and that has pushed one plus came up with a, I think matches that policy. I could be wrong, but Google extended theirs. Two, they promised five years of security updates in only three of OS version upgrades. Which is weird cuz they make the os. But you think that would be easier for them? Yeah, I don't know. Give it three years and Google will have like changed its mind about smartphones 30 or 40 more times. So you never know, three years is a long time, uh, in a, in a Google products life. But it's kind of good news all around like you are getting new, you know, os version upgrades for longer. You're getting security updates for longer. It's like a win. Yeah, no, I mean that's good. And what about on the hardware side? I think waterproofing. Kind of became a thing everybody talked about and then did we like hit a point where it was pretty good so everybody stopped talking about it because it doesn't feel like that's kind of first on the list anymore. Nobody's really like dunking their phones in the water to test them anymore. Is that cuz they're good or did we just stop caring? I think it's cuz they're good like i p e 68, which is total dust resistance and some ability to like throw your phone in a pool of fresh water and it'll be okay. You know, you can drop it in a puddle or the toilet, like whatever. We've all done it, Alison, don't feel bad. These, these things happen to everybody. I have lost a phone that way. Okay. Thank you. R i p my iPhone se That's why you shouldn't buy small phones people. Ah, don't that be a warning. They will fall. I didn't even know it was in my pocket. That's a thing. Anyway. Small phones are good. So that's sort of the baseline. And I, I don't think there's, like, aside from going to like military standards of like, you can shoot it with lasers or like water jets. There's not much more like, Practical use in like anything that's more robust than that. So there's, it is sort of a, um, baseline in the flagship class and there are a few outliers and they're still pretty dust resistant, water resistant, but they're just not quite up to that level, which is worth knowing if you're spending seven or $900 on a. So it seems like the big debate that you had to make in making a guide like this is Samsung versus Google, especially between the Google Pixel seven and Pixel seven Pro and the Samsung Galaxy S 23 and X S 23 plus. How do you think about, just like philosophically, the differences between those things? Because I've always had a very hard time explaining it. It's like, do you want Samsung? Specific pros and cons and so does Google and it's sort of hard to know which one you like. How do you think about the differences there? Yeah, it's hard and I, especially with that kind of top recommendation, which I gave to the S 23 plus, I went back and forth a lot between the seven Pro, the Pixel seven S 23, and I just sort of come down to like what is the, what is the crowd pleaser here? Like what is going to meet the needs and not just needs like what? What people really. From a phone for the most people. And I think the S 23 plus has a very big, very nice screen, which is people want a big screen. So that kind of rules out the smaller phone. Even though we've acknowledged on this show that 6.1 inches is the correct screen size for a smartphone. It is correct. Yeah. So maybe I'll write a guide to like phones that are the actual right size and which ones are the best. There's the best phone and then there's the right phone. Yeah. And they're different things. Yeah. And I understand. I, I get you. Thank you. Thank you. Okay, so big screen help tip it. What else kind of tipped you in Samsung's favor? I keep coming back to Lu Crowd pleaser. It's, it's sort of easy to just pick up and feel really familiar with. It's predictable, reliable, that I think the cameras are go, I mean, you're, if you're going up against a pixel camera, like it's gotta be really good. Yeah. Pixel seven Pro will give you, you've gotta telephoto lens, so there's an advantage there if you're inclined towards telephoto photography. But the S 23 plus this portrait mode is so good and I think it beats the pants off of the pixel portrait mode. And that's just, that's what I want. I wanna be able to pick up my phone. Put it in portrait mode, take a picture of my toddler and move on with my life. Pixel seven Pro has a ton of like cool features that are sort of, you're sort of like a beta tester mm-hmm. As you own your phone, which I think is, some people want, like, I, I think that's fun for some people and you don't have to go in with that attitude, but there is a little bit more of kind of like a, you know, it's gonna change, it's gonna evolve as you own it. It's gonna do different things and, and I think someone who's excited about that, that is the phone for you. But when you have to give a blanket recommendation to just anyone on the internet who's going to come to the verge.com and try and find out what phone to buy, just the S 23 plus. Okay. That's fair. I will say my only quibble with that is that I think you undersell the extent to which Samsung's software is really annoying. Yeah, yeah. And the thing for me is just I continue to have a hard time explaining why there are so many app stores and where all these notifications are coming from and why are there ads here. And it's just, it's gotten better over the years. Yeah. Uh, it's absolutely true. And you, but you, you point this out in your piece too, that for the cost of these phones, it just feels like unpolished in a way that I think is, is borderline unacceptable, but at the very least, really frustrating to me. Yeah. And it's just they're, there're these little things that the phone doesn't make sense in a way that you just want it to make sense. And there are some things about stock Android, like you were saying, that are kind of a mess. And Google does some weird stuff with the pixel too, but, Samsung software has just always been 25% too much for me and, and maybe that's just me. I don't know. I think too much is a good way to, to describe it. I pulled down the notification, like the control settings on a Samsung phone. I'm like, dear God, why are there 200 things here? Yeah, yeah. It just balloons like I give you that it is not my favorite. I knock on Samsung software, like in every piece of writing I do about Samsung. And the thing is always like, oh, it's a lot of settings you can change. And it's like, sure, but there's 600 places to change those settings. Yeah. None of the menu titles make any sense. Like God help you if you want to change those settings, but it is technically possible. Yeah. So I will say when you go into the settings and you're looking for something and you go to the logical place, it should be, they're very good about giving you a little popup. It's like, where are you looking for the side key settings? I'm like, well, yes I was. It's like my friends, maybe you should have put it here if you knew I was gonna come here looking for it. Maybe you should have put it here. It's just a thought. Yeah, it's a roundabout way of, of getting things done. So the only company on your list that isn't Samsung or Google is OnePlus. And I feel like OnePlus a few years ago was trying to be very different, right? They were doing the cheaper, but still just as good thing. They had some wacky ideas about how phone should work. Now it feels like it's just kind of a down the middle Samsung competitor. Is that fair? Am I, am I not giving one plus enough credit? Well, they've sort of done this roundabout thing where they, they went like a little too far into like this is a real flagship. It costs as much as a Samsung phone. It does 80% of what a Samsung phone does. And then that didn't work. So they kind of came back around to like, okay, well we, we like just cut a couple things and it's much cheaper and you get the Snap Dragon eight Gen two processor mm-hmm. Which is really good. And it's not a Samsung phone, which is something, it is a good deal. It's, I think, again, for a very specific kind of person, if you've heard of the brand one plus, then that's a signal that maybe you're, you're in that group. It's really good performance and software that's a little less cluttered and unpleasant. Yeah. It just, it felt very telling to me that the category you put it under is best alternative to Google and Samsung, which is not nothing like, there are people who don't want either of those companies products, but the fact that that is kind of the most compelling thing about it. Says. A lot. Um, were there other challenger brands who even like, deserve honorable mentions in this guide? I do actually have Aus on here. Oh, you do? That's right. The small phone. Yeah, that's the guy, the small guy, which is just me trolling everybody. Um, so I guess that's like, yeah, you, you really kind of have to dig to get to in this category, I think. And the Zen phone nine is a lovely small phone with a great processor, but it is again, one of those things that like you have to be in the market for a small Android phone to get there. But yeah, I think in the budget category there's a, at least a few, a couple more. Like there's Motorola, they just really have not brought anything to the US in the premium space that has been worth anyone's time really. So yeah, that's where, that's where we are. We're down to. Samsung and Google. And then the, the alternative mantra. Yeah. On the price front, the, the kind of heuristic I got from people a few years ago was the top of the market is interesting. The very bottom of the market is interesting. And in between there's kind of nothing, because for most people who are willing to spend $600 on a phone, they're probably willing to spend $800 on a much better phone. Is that still kind of the case? Is there anything interesting happening in that middle $500 range? Well, it's the same story kind of. It's like very much dominated by Samsung and Google. Oh, there you go. Yeah, yeah. In the US with a asterisk on that. But they've kind of like played this game of chicken, I feel like over the past couple years where like the six, you know, the Pixel six A is like slightly better in this way and then the A 54 is slightly better in this way. So that's not, I wouldn't say it's like interesting, but I think has has turned into like you have a really good option at $500. And the other thing is like trying to figure out how much a frigging phone costs in this country is, oh, I know. Is just a game that will drive you insane. It's like, you know, there's the M S R P, but then there's like some companies will instantly like knock that down $150 and you're like, what was the point of having a price tag on your phone? And then there's the carriers and. There's the deals. You know, a lot of people in this country get their phone through the carrier and they don't pay for the phone. I did the deal with Verizon the last time around, but you know, you, you pay through being on your phone plan for the next three years and Right. Yeah. T-Mobile is forever. Like if you find a battery on the street, bring it to us and we'll give you a Samsung phone for free. And it's like, just mail it. Mail it in. Yeah. If you've ever seen a smartphone, we will give you a Galaxy phone for free. And it's like, yeah, right. Is that free? No, because you just pay for it by being a T-Mobile subscriber, but it makes it really hard to sort out how much am I actually paying for this phone, which I guess is deliberate. And if it ends in everybody having nice phones that they like, so be it. But I think you're right. And I wonder if that's part of the difference in other countries where it is just much more obvious when you walk into a store and there are phones with price tags and you make your decision really differently than you do by just like getting whatever's on promotion at your carrier store. Yeah, I think it probably makes things more interesting just trying to decide what is a mid-range phone. You go look at what phones cost. Right now the pixel seven is like $450 or something, right? Like the is, is it a flagship phone? Is it a mid-range phone? You who can tell? So yeah, it's hard to, um, compare apples to apples like in that way I think. Yeah. Yeah. No, that's very fair. So, okay, so looking ahead, we're about to hit sort of the beginning of smartphone season again. We're gonna get new Android, we're gonna get potentially a pixel fold, maybe possibly a Google io. There's some smoke around that. But who knows new Samsung phones probably in the fall. Lots of stuff coming. Like what, what is this going to be the year of in smartphone world? Is this the year foldables become a real thing, like what's coming? I think it is. I'm nice. I'm excited. I hope so. I am. I think it's the either year of foldables and maybe that'll mean you see more than like one person out in the world with a flip phone or a fold. Yeah. I think when, when, and if Google goes in, that'll be, you know, not as, I don't think we're gonna like know a lot of people who go out and buy it, but they're gonna know about it and that's gonna make it a little more mainstream. And then I think that opens a door for competition, which would be lovely. The Z fold four and the Z flip four from Samsung are, they're very good phones, but they're Samsung's just doing like victory laps with that. They're like, the last generation was like barely different from the one before that. And it's sort of like, come on, we could eat. This is cool. Like put a bigger screen on the front, make it do other stuff. Like throw stylus in there. And they kind of have been like, eh, No. Right. Meanwhile, every, every other company has been like, look at this meat prototype that we made, and you're like, when are you gonna make that into a thing that someone can buy? And they're like, who knows? Yeah. I'm still waiting for the phone. That like unfolds like a scroll. Ooh. Yeah. I like that. Like that LG thing we saw a million years ago that the rollable screen. Yeah. Listen, all I know is I used to see a Z flip four. I was commuting more often and would see a Z flip four on the train like three times a week. And I was like, wow, this phone must be really popular. And then realized I was just on the same commuting schedule as someone, and it was the same woman every single time. But she would get on the train, sit down, she would prop it up and she would watch something on the top half of the screen while she just like, Dinner thing and I was like, oh my gosh, you get it. Like this is the future. Yeah. Fancy kickstands. This is, this is it. This is all I need. It's kind of great. I was sitting at a coffee shop next to someone doing the same thing like a few months ago, and I restrained myself and I didn't ask them a bunch of questions like, Hey, why'd you buy that phone? I, I really do hope this is the air cause I think, I think you're right that we've probably gone as far as Samsung will go without someone pushing them. And so I'm hopeful whether it's the pixel fold or something else, that there is a real kind of push and pull in this, in this space for a while. And I hope people keep making flip phones. Yes, dear smartphone manufacturers, I don't care about your foldable phones nearly as much as I care about your flip phones. Bring flip phones back. Vote Pierce 2024. That's, that's, that's my, that's my platform co-signed. There we go. There's no fun. I think that, okay. I'm only write another buying guide for, um, phones that are fun. Oh, I like that idea. Yeah. Z flip four is the Deleter right now. Phones that are maybe a bad idea, but you'll have a delightful time with anyway. By Allison Johnson is like a, that's a thing that should exist. I'm into it. It's coming up. All right. We should take a break. But Allison, thank you. Appreciate it. Fun as always. Thank you. It's been delightful. Okay, next up we're gonna get deep into the weeds on the latest in TV technology. FairWarning. This segment is going to make you wanna spend too much money on a new television. We'll be right back. Welcome back time for TV Talk. We don't talk enough about TVs on this show, I don't think, and in part that's because TVs have been, I don't know, kind of stale for a while. There are a lot of good TVs out there, but it's been a while since we had a big sort of foundational change in the tech that makes your TV work. But the verges, Chris Welch just wrote a story about how that's about to change. He says that old led TVs, which have long been promised as the next big thing, but have mostly just been the next really expensive thing that most regular humans will never buy, are starting to go mainstream, and they're starting to get really, really good too. So I figured we'd get Chris in here to tell us all about O Ledd and see if it's time for you and me and everybody to upgrade our big screens. Hi Chris. Hello. Good to be back. Yeah, good to have you. It's been a while. I was just thinking about that. We haven't tested some headphones in earbuds torture tests lately. I know. I mean, it's about to be earbud time. So for all the listeners who hate that segment, I'm so sorry, but it's gonna come back. This year right now is TV season. New TV season is upon us. This is very exciting for me because reading this very good piece that you just wrote about o led TVs made me realize I am like staggeringly far behind. I'm the guy who like goes to Best Buy Memorial Day weekend and just buys the cheapest TV I can find, and this is the life that I leave. But you sort of started this story with the premise that we're in like a, a magical moment for TVs that like you kind of can't buy a bad TV anymore to some extent. Are we in a truly magical moment for televisions? What's going on here? I think we are. Uh, I mean part of that is that, uh, these companies that sell cheap TVs like TCL and Roku and Heen, uh, just sell all of your data, you know, your personal data to, that's how they managed to make, uh, such affordable, nice, uh, smart TVs. But yeah, like I bought a new TV a few months ago. It's the Hyen U eight H. I got it. $800, $900 and it's like the brightest tv, like on the market basically one of them. So like for that, at that price, like there were downsides to it. Like you can nitpick some like very small, uh, picture quality stuff, but like for gaming and movies, 800 bucks in and out, you know, it's got Google tv, it's got all the features, airplay, uh, most of what you'd want. And I'm not really someone who really cares about my, like, TV viewing habits being sold. I don't know, not sure where that cutoff comes from. Like my personal data is like, you know, I wanna keep that private like TV viewing, like what I'm watching, who cares. That's interesting. And is it, is it really that simple? Cuz as I was preparing for this, that was one of the things that occurred to me is like maybe what changed is all the TV makers figured out. They don't have to make any money on the TVs anymore because they can just sell you crappy software and then sell the data from you using that crappy software. And this is just the TV business now? Like is this just the TV business now? I think so. I mean it's, no, that's, and also like all the panels have gotten better, you know, it's been many, many years since the first Smart TVs, you really can't buy a dumb TV anymore, uh, from anybody. Yeah, that's the point that we reached. But yeah, I mean you've got the many L led D TVs, like this one, the Hiene that I like quite a bit. And uh, those are pretty cheap and you get big picture performance from those. Uh, but the new ones I covered from LG and Samsung are their new high tier flagship olis. Right. Yeah. So let's talk about those cuz that's, that was the thing that you, you most recently wrote about that these are on the list of amazing TV technology. We've been promised o lets have been around about as long as anything I can think of. Mm-hmm. And it seems like they're finally, they're not to the. You know, walk into Best Buy and grab one off the shelf for a few hundred bucks territory, but they're down to like, reasonable people can afford them territory. Is that, is that fair? Is that kind of where we've gotten? Uh, yeah, for sure. I mean, there are some big sales on the LG seat too that we covered over the last few months on Verge deals. And so yeah, I mean, you can get one of those for like $1,100 I think. Uh, so, okay. Yeah. That's totally reasonable for a lot of people, not everybody. Yeah. Obviously some people don't wanna spend more than like 400, $500 on a tv, but Yeah. Well it's, I mean, we all know the benefits. You've got those perfect black levels, great contrast. Uh, you can watch them from anywhere in the room when they look great. And, uh, so now the brightness is the new war that we're into, uh, between algae and Samsung. Yeah, walk me through that a little bit because the, again, this is where I get very dumb about televisions, that the only thing I've known about televisions is not to worry about the brightness because you, you walk into the store and they're all cranked up as bright as they go and is contrasty as they go. And so the picture you see has nothing to do with the actual reality of watching that television. Yeah. But now you're saying the bright. Fight that especially Samsung and LG are having is really important. Like, why should I care about brightness in my television for years, like the counterbalance to OLE has been that they're not great for bright, sunny rooms. So if you have like a really bright living room, you might want go for some kind of like LCD TV from Samsung or Hyen or tcl that can just get brighter at all times. Uh, be it for SDR or hdr. And that's just because it's lighting the whole panel all at once, all the time. Right. Instead of just kind of individually lighting pixels that too. And also just Ola just couldn't get that break. Okay. For its peak brightness was always like fairly low compared to like the best like mini l e d, like those have like back lighting systems that like turn off pixels or parts of the screen as you don't need them. Uh, but yeah, for a few years it's been, uh, there's been like a fairly clear cut win for many l i d on the overall brightness. That kind of changed last year, uh, with the LGC two and Samsung's cutie odes with both, which both use two different types of ole panels. Uh, so like LG has their usual panels that have white, red, green and blue subpixels. And then Samsung came out with the QD olad, which stands for quantum dot. And those are pure rrgb panels. And so that benefit is you can like go higher on brightness while maintaining like full color luminance and like keep colors looking like nice and vivid even at like full peak brightness. Whereas LG not quite as good. I mean, these are things you wouldn't really notice unless you were side by side in like a viewing Sure. Test room. So like it's not a huge difference, but the overall brightness, uh, from both companies got. Quite higher last year, and this year it's gone up even more. So they're hitting like 1500 nets, you know? Oh, wow. 2000 nets, which those numbers don't mean much to anybody, but it's just very bright, very, very bright. It's bright enough. Yeah. That's the, that's past the threshold of like, you probably don't need to worry about it in just about any space. Right. And like more of the screens now how like, uh, these coatings, uh, that kind of like not just fend off the reflections so you can put 'em in like a bright spot and they're not gonna be just a hellscape of like, reflections of your bedroom or living room, you know, which can, which did happen with my previous LG C 10 that I had. That would be annoying. But yeah, both Samsung and LG now, how that figured out as well, plus all the usual benefits. Those black levels, they all do really good at gaming. Uh, these are the best TVs for gaming that you can buy. But of course, they come outta price. Like for the 65 inch G three TV names. Boy, I'll tell you, uh, inch LG G three and the Samsung S 95 C both cost $3,300. So that is a far cry from like your typical TCL or something like that. You get what you're paid for if you want the absolute, absolute best. But if you've been holding off for like a big TV upgrade, if you've got an old, you know, some old LG Ola that's six or seven years old and you've, you know, you just want maybe nicer hdr you wanna be dazzled, then uh, this is kind of the year to kind of, uh, just go out there and splurge, I think. And he'll be pretty happy. Yeah. You just made me realize though, I, I've never been in like a fancy TV testing room. And you have, and I know you just went to LG to see all their cool new stuff, I think in la, is that right? Yeah. What are these rooms like? What, what ha is it just, you just like walk into a like sensory deprivation chamber and there's a TV in there? Like what, what are these places like? Yeah, they all do their own thing. Sony does this all the time where you just come into a room and there're TV side by side, and it's always their, it's that company's brand new TV versus Lash to yours best. So right by that, it's like, it's like by that nature alone, it's an unfair comparison. Yeah. Uh, but they all show the same footage and they like point to like some very, uh, small thing on this screen and say, look how we do this better. You know, this color is more accurate on our tv. And so they all just do the same old song and dance, but they all look nice at the end of the day. Like, you know, all TVs if you spend over a certain price, You're gonna be pretty happy. And so it's like a very nitpicky home theater nerd type stuff that you would choose one over over the other for. That's fair. So while we're, while we're doing TV nerd stuff, I think every once in a while we should sort of update our like, here are the words and acronyms you should look for when you're buying a television. Yeah. So let's, let's do that a little bit because especially I think as we talk about, oh, LED a lot and we talk about Q led and we talk about micro l e d and we talk about just regular l e d and now there's Q D O led and just like the landscape is enormous. But if I'm just like a regular person who wants to buy a new TV this year, is there one of those you think most people. Should want and be happy with Should everyone who can upgrade for the O ld because it's worth it. Like what's, what's your sense? Yeah. As long as you go for an O LD or a mini l a d TV Q light is kind of like a misnomer. It's kind of, uh, just the same old LCD TVs that might have like mini L led D backlighting, but they just call that because, uh, they wanna like, uh, just focus on the quantum dot and like the whiter color gamut. But like, by and large, they're pretty similar to the, the best of many LED TVs. That's my favorite thing about the TV companies by the way, is when they all just come up with different names for the exact same thing, just to make it impossible to know how to do anything. Or comparison shop. It's really delightful. Right. And that was so blatant. People were like, oh, we like, people seem to like these ole TVs, so let's just call them qed. And yeah, just confuse people actively I, I know, in hopes of more cells. So yeah, it's a, it's a fun market to shop at, but as long as you're looking for oed Yeah, just that mini l e d or the features I would encourage people to look for. Uh, we've got a thing on the site I think maybe after last ces, uh, that's basically like a glossary of like TV terms and stuff that I'd encourage people to check out cuz it can get kind of, kind of overwhelming all the new terms and stuff that come out every year. But go for oed, go for mini l e d as far as brands go. Samsung, lg, hs, tcl, Sony, you know, all the brands you'd expect. In the OED space, why are Samsung and lg the only two sort of relevant players? If I'm remembering right, it was basically just LG for a long time. Right. And then Samsung kind of showed up recently, like, where is the rest of the market here? Uh, they'll just buy panels from lg, honestly, if they make ods at all, uh, which, uh, most TV makers don't. Uh, so for a long time, yeah, it was just algae, uh, display dominating the whole, the whole scene. And then, uh, finally last year, Samsung came along and said, we think we can do this. And their TVs did review slightly better. Uh, Samsung uses their panels obviously, and also Sony uses the Samsung QD ODE panels for their high-end TVs. And they did, uh, get some pretty good reviews. They also, uh, there was a test from ings, like a torture test where they kind of like test them for burn. And there were signs that these new TVs, these new panels do show burn quicker, but also like, these are tests that like no normal person would ever do. Like, you're not gonna watch CNN for like 60 hours and like ruin your new television. God help you. Yeah. Yeah. So as long as you use them, normally you change the content you're watching that be that games or movies or Netflix, you're gonna be fine. So it's not something to worry about. So was the problem on these tests that like the CNN logo in the bottom right was like burning into the tv? Right. That's really funny. That's like if you do that on your tv, like you have different things you should think about in your life I think. Yeah. Uh, so when I buy a tv, like I actively try to avoid, uh, news networks for all. You don't have to, but just that's an old habit that I've not really gotten out of. But yeah, don't worry, I'm just buy your TV and use it like a normal person in, you won't have to worry about burning, uh, no matter which kind of ole you buy. But yeah, so there is more competition now, which is great to see. Finally, it's kind of this two-way horse race between LG and Samsung. So hopefully that'll bring prices down over time. Cuz right now they are quite high. So maybe like come the fall, uh, we should see some deals on, on these TVs as the holidays and, and that that whole season approaches and maybe they'll, uh, fall below $3,000. Cuz Yeah, that's a lot to spend on a tv no matter how much of a home theater nerd that you count yourself to be. And the prices have been super high for a long time. Right. So I guess is it, is it already a sign of the competition that these prices are starting to come down even after just a year or so of both companies being in this. I think so. I mean, there are only so many models to go around, so it's not like there's a huge selection of competition to juice between, but even just like two or three models is enough to kind of, you know, have that one upsmanship between Samsung and LG to just get the price down. Uh, but right now they're at the same price, so they're kind of just doing that to, uh, stay on the same level. But yeah, there have been some good reviews. If you check out my favorite TV review orders, since I don't do them too often. Uh, there's Caleb Dennison over at, uh, digital Trends who does great work and also, uh, Vincent Teo of HDTV tests. And if you want to check out new TV reviews from them, we're gonna have some over the next few months as well. But, uh, if you want like the nitty gritty, those are good resources to check out and they both seem to love both of these new TVs. Is there an appreciable difference between the two of them? Like if these are the two sort of main players from the main players, is there anything that sort of sets them apart from each other in meaningful? Uh, Samsung still does not support Dolby vision after all these years, which is, well that's dumb kind of a cause for, uh, for a headache from some people. They've got their HDR 10 plus standard, which has made its way to more movies and more services, but Dolby vision is kind of a big deal somewhere. Ni Eli just started shaking his fist. He doesn't even know why. He's just mad because Dolby doesn't exist. Yeah. So if you wanna light up all the lights, uh, like Neil always says you're gonna want to go for the lg, I think. Uh, okay. And also they've just been around longer. They're software I prefer a bit. I mean, neither company does great TV software. You've got the ties in OS on Samsung and then I think it's Web OS 23. Version this year. Wow. All right. So, uh, it's kind of a mess in some ways. Yeah. These new TVs let you like customize the quick settings. You can put all the, the, uh, stuff you want right on the first page. You don't have to scroll through, you know, who knows what and like that. And like most people just use like an Apple TV or a Chromecast or a Roku, and they're gonna be, you know, just like in that world once of the time anyway. Once they, once they set up the settings the way they like, it's fine. But yeah, I guess, uh, the main difference is gonna be the Adobe vision. So you've got that with lg and you don't have it with Samsung, but does that matter to you if you're spending this much money? Maybe it does matter, but by and large, you know, they both look great. They both sound really good. They, uh, they both have really nice speakers. They both do like 120 hertz 4K gaming for your Xbox Series X or a PS five. They've got all the HTM I t 0.1 features you want that's finally settled out now, so. Mm-hmm. Uh, you get everything. You just gotta pay a, pay a whole boatload. And I am someone who is happy to just pay $800 and settle for quite good, uh, future quality. Yeah. You and me both my friend. So, but I, it does seem like. We, we had this run where it was like everybody had LCDs and LEDs were like the super expensive thing that slowly came down in price and then LEDs came down in price and now Olet is kind of moving along that path really sort of for the first time it's gone from like bonkers prices to slightly above regular prices and then it'll come down to regular prices. So it seems like, I don't know, a couple of years from now if things keep going this way, ODS could be sort of a mainstream display technology. Yeah, absolutely. I mean, even right now, if you don't wanna settle for like the, like if you don't have to have the absolute brightest panel, you can buy the L LGB three series, I think like they're base level and that's like super affordable. You know, it's like, uh, most things that you want, the absolute best it's gonna cost you, but you can settle for fairly good panels for $900, you know, $800. Or a thousand bucks and, and so yeah, I think in like two or three years it's gonna come down even further and we'll see where we are then as far as like micro, l e d, even more buzzwords. And that's where I was going with this one cuz it's, yeah I, it seems like if you then cast out and say, okay, well what's the next one that's gonna start to go on this road from like, it costs a million dollars and there's only six of them, but they showed at CES every year and it's very cool. Which is where micro l e D is right now. Is it the next one that you think is gonna start to sort of slowly move down the price curve? Is that ever gonna happen? That's what Samsung's been saying for years. Every Cs they like show a new version of the wall or like some new micro L e D TV that's still hugely absurdly pricey. Yeah, those are like a hundred thousand dollars for like, you know, but they look so good. They do look beautiful. Plus it's like modulars, you can make any size screen you want, you know, you can do a whole wall in your house if you want, if you have, God knows how much money to burn. But I think it's gonna be many, many years before that actually makes its way into like, Baseline consumer televisions. So I think for the foreseeable future, if you want really good quality, I think Oli is gonna be, uh, where you go. And that's not gonna change anytime, anytime soon. Okay. It's, yeah, I just, I'm not the type of person to like stand in front of a large screen and be like, I must have it. Mm-hmm. But there's something about that wall that Samsung shows every year, and they're like, would you like this 19 foot television that costs a hundred thousand dollars? Yes. Yes. So you put a gun to my head and say, you have to have this giant sized television on your, in your, in your house. I would, I would not complain. Yeah. And there's something about, they make it like a bunch of tiles and it's, I'm always like, yes, of course I do want one. That's the. Width and height of my wall. Like what a terrific idea this is. How does this not exist? Uh, it's probably for the best that that's a hundred thousand dollars because if it were $3,200 right now, I would be like sitting with one in my cart. Yeah. Not even remotely being able to afford it, uh, but having to talk myself out of buying it and it feels like it's for the best that that's not yet the case. Yeah. I mean, a hundred thousand dollars and still no Dolby vision. That's that's harsh. Can't let all the lights, man. You can't, can't win 'em. Just can't let all the lights. Yeah. So is there any other tech along those lines, like what else should we be looking out for in, in TVs over the next few months? Like obviously CES was a good preview of it a few months ago. That stuff is starting to roll out. Like anything else you're seeing that is cool and exciting in this space? Uh, they're the. Uh, first party TV is from Roku. So they're first self branded sets, you know, they're following, uh, there are the fire TV sets from Amazon, and so now they're trying to get in the same game and price them super aggressively. So you're talking $200, $300 for an okay TV that's gonna have Roku. You know, people love Roku City. That's screensaver. It's the only good thing about having a Roku tv. Yes. I hate, I hate my Roku tv. It gets slower every day. Mm-hmm. It refuses to work at anything ever. It just updates all my apps every day for no reason. It drives me absolutely insane, but I love the screensaver. Yeah. It's, it's so good. And, uh, these are super cheap, super affordable. I mean, case in Point, Warner Company is gonna sell your data for ads and like, that's Roku's whole business now is advertising basically. So those are gonna be in the market soon. They already are, I think. And so, yeah, that's like the bottom end. If you want something simple. And then go for a Roku tv. If you want the top, top, top cut and the lgt three is gonna be where it's at. And then somewhere in the middle there are a ton of great options from uh, TCL licenses everybody. It does seem like that four to $700 range mm-hmm. Is just full of great TVs. Yeah. In a way that it never really was before. Even a few years ago, I feel like I would sort of start at like, okay, let's get like a four or $500 TV and then pretty quickly it's like, okay, well the thing I actually want is like somewhere between like eight and $1,200. Now it's like you can buy a truly kick ass TV for $500. Yeah, absolutely. And like the worst thing you settle for is like, okay, maybe there's only one or two hdm I 2.1 ports that do the best gaming for consoles. But if that's the worst trade off you have to make. I think most people aren't gonna mind that. So yeah, I mean, I bought one. I'm gonna have this for who knows how long. I don't buy TVs very often and I buy phones all the time and new earbuds constantly. But TVs, I can just, uh, be more disciplined. You just go straight from this to the wall. That's the, that's the next move just by the wall. I'll wait. I'll wait for micro l e d from this point up. Yeah. All right, Chris, thank you as always. Thank you, sir. Uh, if you do upgrade, let us know what you end up with. I'm very curious. I shall appreciate it. Bye later. All right, that's it for the Vergecast today. Thank you to Chris, Allison and McKenna for joining the show, and thank you so much for listening. There is, as always, lots more from all of our conversations@theverge.com. We'll put a bunch of links in the show notes, but as always, go to the website, it's good stuff. Oh, and also vote for us in the People's Choice, Webby Awards for the Best technology podcast. That link is also in the show notes, and I'm not gonna lie to you. I really, really, really wanna win. I so appreciate everybody who's voted for us so far, and please keep it coming. The voting actually ends tomorrow, April 20th. So if you have a minute, please get to it. Also, if you have thoughts, questions, feelings, or a Samsung Wall TV you wanna sell me, you can always email us@vergecasttheverge.com or keep calling the hotline. It's 8 6 6 Verge 11. We love hearing from you. Send us all your thoughts and questions and ideas for what we should do on the show. It's one of my favorite things about the This Show is produced by Andrew Marino and Liam James Brook Min is our editorial director of Audio. The Vergecast is a Verge production and part of the Fox Media podcast network. Eli, Alex and I will be back on Friday to talk about electric cars chat, G P Ts, social networking, and presumably a lot more CarPlay. We'll see you then. Rock and roll.",
    "transcript_keywords": [
        "yeah",
        "Samsung",
        "phone",
        "kind",
        "Samsung phone",
        "thing",
        "good",
        "things",
        "phones",
        "TikTok",
        "people",
        "Montana",
        "years",
        "sort",
        "lot",
        "Google",
        "ban",
        "talk",
        "Android phones",
        "make"
    ],
    "transcript_entity_values": [
        "American",
        "New York",
        "2013",
        "Chris",
        "Allison",
        "Android",
        "2.1",
        "McKenna",
        "Webby Awards",
        "Biden",
        "nsa",
        "WeChat",
        "CarPlay",
        "0.1",
        "Andrew Marino",
        "three",
        "a.",
        "zte",
        "the L LGB",
        "1,100",
        "SDR",
        "ODS",
        "150",
        "only two",
        "the end of the day",
        "three years",
        "a few years",
        "Smart",
        "300",
        "the White House",
        "Audio",
        "the past couple weeks",
        "OED",
        "a couple of years ago",
        "2024",
        "every year",
        "2023",
        "Snoop",
        "March",
        "Two",
        "the upcoming year",
        "HTC",
        "Heen",
        "TCL",
        "Chris Welch",
        "This year",
        "April 20th",
        "Aus",
        "Alex",
        "a couple of weeks",
        "LG C 10",
        "TikTok",
        "Asia",
        "Fox Media",
        "a hundred thousand dollars",
        "80%",
        "3,200",
        "Donald Trump",
        "500",
        "the beginning of smartphone season",
        "LG Ola",
        "every day",
        "Huawei",
        "a million years ago",
        "David Pierce",
        "Massachusetts",
        "Andrew",
        "Seuss",
        "the fifth year",
        "200",
        "OnePlus",
        "about 180 days",
        "A few weeks later",
        "this week",
        "6.1 inches",
        "third",
        "mid-April",
        "olis",
        "54",
        "digital Trends",
        "Baseline",
        "Trump",
        "AAU",
        "Shazi Chu",
        "2000",
        "Verge",
        "Google",
        "O Ledd",
        "a few months ago",
        "2020",
        "Ola",
        "iPad",
        "the People's Choice",
        "these past couple years",
        "tcl",
        "Samsung",
        "Russia",
        "clean air regulation",
        "CNN",
        "25%",
        "Google tv",
        "PS",
        "Galaxy",
        "600",
        "a million dollars",
        "Quantum Dots",
        "Allison Johnson",
        "800 bucks",
        "Dolby",
        "800",
        "Vincent Teo",
        "this year",
        "China",
        "Wing",
        "la",
        "Texas",
        "Illinois",
        "Netflix",
        "10 years",
        "Lu",
        "first",
        "Friday",
        "40",
        "Minecraft",
        "hdm",
        "a long year",
        "Roku",
        "Chinese",
        "Twitter",
        "10 years ago",
        "Deleter",
        "a ton",
        "last year",
        "23",
        "QD",
        "between like eight",
        "LCD",
        "Alison",
        "only one",
        "the next couple weeks",
        "30",
        "the next three years",
        "two or three years",
        "Verizon",
        "Chromecast",
        "a couple of years from",
        "T-Mobile",
        "Democrats",
        "the holidays",
        "LG",
        "Hyen",
        "nine",
        "LGC",
        "1500",
        "Mark Warner",
        "California",
        "US",
        "8",
        "the USS Beef",
        "Samsung Wall TV",
        "the Restrict Act",
        "Bursky",
        "20 million",
        "19 foot",
        "a Google io",
        "four or $500",
        "like 60 hours",
        "Congress",
        "Liam",
        "the Chinese Communist Party",
        "Joe Biden",
        "Android Authority",
        "Adobe",
        "a thousand bucks",
        "Eli",
        "a couple of weeks ago",
        "LCD TV",
        "Zen",
        "spring",
        "the Patriot Act",
        "us",
        "4",
        "Trump",
        "Liam James Brook Min",
        "200",
        "six or seven years old",
        "five",
        "TV Talk",
        "C E o",
        "the past couple years",
        "Roku City",
        "Alison",
        "Michael Scott",
        "Point",
        "the other week",
        "1.3",
        "tomorrow",
        "below $3,000",
        "the year",
        "Hiene",
        "65 inch",
        "sec",
        "Commerce",
        "N zt",
        "Kelly",
        "a minute",
        "more than like 400",
        "3,300",
        "Olet",
        "only about three",
        "CES",
        "the last few months",
        "450",
        "one",
        "five years",
        "Apple",
        "500",
        "Best Buy Memorial Day weekend",
        "four",
        "Earth",
        "a hundred percent",
        "just a year or so",
        "today",
        "eight",
        "Xbox Series X",
        "Europe",
        "Reserv",
        "six",
        "120",
        "the next few months",
        "only six",
        "Hua",
        "dms",
        "a few years ago",
        "Bill",
        "Trump",
        "Montana",
        "months",
        "years",
        "the years",
        "a few hundred bucks",
        "several years ago",
        "every month",
        "the S 23 plus",
        "95",
        "Caleb Dennison",
        "1,200",
        "half",
        "America",
        "2023",
        "Republicans",
        "two",
        "five minutes",
        "Neil",
        "Nebraska",
        "Pixel seven",
        "Motorola",
        "Amazon",
        "Capitol Hill",
        "lg",
        "Oli",
        "G P Ts",
        "the past few years",
        "Sony",
        "hs",
        "Ni Eli",
        "four to $700",
        "only three",
        "Warner Company",
        "iPhone",
        "600",
        "the last couple months",
        "two years ago",
        "seven",
        "900",
        "the Hyen U"
    ],
    "transcript_entity_types": [
        "NORP",
        "GPE",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "GPE",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "LOC",
        "ORG",
        "MONEY",
        "PERCENT",
        "MONEY",
        "PERSON",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "GPE",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "LAW",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "GPE",
        "PERSON",
        "GPE",
        "GPE",
        "GPE",
        "ORG",
        "DATE",
        "PERSON",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "NORP",
        "PERSON",
        "DATE",
        "PERSON",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "GPE",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "LAW",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "MONEY",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "LAW",
        "GPE",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "MONEY",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "LOC",
        "PERCENT",
        "DATE",
        "DATE",
        "CARDINAL",
        "EVENT",
        "LOC",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "GPE",
        "DATE",
        "NORP",
        "CARDINAL",
        "TIME",
        "PERSON",
        "GPE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG"
    ]
}