{
    "id": "N4zVExS5mgg",
    "title": "A mini iPhone is coming",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2019-06-26T16:48:18Z",
    "video_url": "https://www.youtube.com/watch?v=N4zVExS5mgg",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "iphone 11",
        "iphone 12",
        "next iphone",
        "mini iphone",
        "small iphone",
        "5.4 iphone",
        "6.7 iphone"
    ],
    "views": 1276394,
    "likes": 31340,
    "comments_count": 2412,
    "description": "A 5.4\" OLED iPhone is expected to launch next year. Not as small as a new iPhone SE but this new small iPhone would be a nice addition to their lineup.  iPhone XI Leaks from: OnLeaks X Cashkaro    Wheat wallpaper from -   Background Music Fili - Pressing Forward  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://twitter.com/OnLeaks",
        "https://cashkaro.com/blog/exclusive-iphone-xi-camera-bump-design/106400",
        "https://twitter.com/ultralinx",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "The last really small iPhone that Apple made was the iPhone SE it's a three year old device at this point So it's a little bit dated but it's still a very popular device mostly because of its size It's also relatively inexpensive at this point, but it still runs the latest version of iOS it's still a great phone for what it's meant to be but people have been wanting a small or like a updated small iPhone for a while because if you want any of the new kind of user interface iPhones with face ID and stuff You need to get one of the bigger phones But there have been reports recently from Apple analyst Mingchi Guo of a new upcoming small iPhone So as we smaller than iPhone X and XS But not as small as the iPhone SE and supposed to be rocking a 5.4 inch screen so the regular iPhone X right now has a 5.8 inch screen this supposed to be a little bit smaller and a 5.4 inch OLED screen that retains the same aspect ratio as their existing current devices Would fit actually quite well into their existing or like the old iPhone 6 to iPhone 8 chassis design So this kind of more traditional chassis design. This actually houses that screen size really well It's not as small as like the iPhone. Se we've seen a bunch of renders pop up on the Internet of the iPhone SE 2 which would look awesome but a 5.5 screen won't fit on to the size physically like the biggest thing you get on this is maybe five inches but the classic iPhone 6 to iPhone 8 chassis can hold a 5.4 inch screen just right now this screen is also Supposed to have a punch hole camera. So instead of the notch that we've seen on the iPhone X iPhone XR and XS these new phones are supposed to have a punch hole camera system up front Now this type of technology isn't new right when we look at the kind of existing phone lineup we have on the market today If you look for a smaller phone with an OLED panel with thin bezels all round and a punch hole camera The Samsung Galaxy S10e fits that ticket, this is one of my favorite phones of the year It's super comfortable to hold in my hand and as much as I liked the S10 and S10 plus I'm a huge fan of smaller phones that fit comfortably in one hand for one-hand usage and to hear that Apple is considering making a Small phone again for people without huge hands. It's nice to hear Mingqi Guo also mentions other sizes for these iPhones There's that really small one Similar size one to the iPhone XR in terms of screen size and also an even larger plus size so right now the iPhone X Plus is a 6.5 inch screen these new ones are supposed to have a six point seven inch screen just little bit bigger But a completely new design to house that larger screen The other characteristic that's cool about these three phones is that they're supposed to be finally running USB C, it's kind of crazy. We've lasted this long running lightning ports on these iPhones so it's about time now the Unfortunate thing despite all this cool information about these new phones is that these phones are supposed to be coming Next year not the ones coming out in a few months, but in 2020 So according to quote we're seeing stuff like 5G technologies new designs bigger screens and smaller screens But just a completely redesigned to the iPhone see the 2019 iPhone allow that's coming out in a few months That's been leaked like crazy and from the images we've seen it's not a huge step up from the current generation of iPhone It's got a triple camera system, maybe some bigger batteries, but the overall design and usability of the 2019 iPhones remains quite Unchanged with the 2020 ones with a new size and 5G technology That's a pretty significant change in just what the iPhone is So if you're someone who appreciates a smaller iPhone or you want to upgrade your iPhone SE or if you just want a smaller iPhone, I wouldn't get the 2019 models I would totally wait for the 2020 because that 5.4 inch screen looks pretty promising. Okay? Hope you guys enjoy this video.Tthumbs if you liked it subs if you loved it. See you guys next time.",
    "transcript_keywords": [
        "Apple analyst Mingchi",
        "analyst Mingchi Guo",
        "iPhone",
        "inch screen",
        "updated small iPhone",
        "upcoming small iPhone",
        "Mingchi Guo",
        "user interface iPhones",
        "analyst Mingchi",
        "small iPhone",
        "inch OLED screen",
        "screen",
        "small",
        "supposed",
        "popular device",
        "punch hole camera",
        "screen size",
        "size",
        "existing current devices",
        "inch"
    ],
    "transcript_entity_values": [
        "2",
        "2020",
        "the iPhone X Plus",
        "iPhones",
        "three",
        "5",
        "XR",
        "iPhone X iPhone",
        "six point seven inch",
        "a few months",
        "5.5",
        "iPhone X and",
        "the year",
        "one",
        "Se",
        "XS",
        "Apple",
        "USB C",
        "Mingqi Guo",
        "iPhone",
        "today",
        "iPhone SE",
        "Small",
        "S10",
        "Next year",
        "2019",
        "OLED",
        "three year old",
        "Mingchi Guo",
        "5.4 inch",
        "five inches",
        "6",
        "6.5 inch",
        "S10",
        "5.8 inch",
        "8",
        "iPhones"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "NORP"
    ]
}