{
    "id": "N5TVaHbvgMc",
    "title": "Is Microsoft even TRYING? - Surface Duo 2",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-11-08T22:20:04Z",
    "video_url": "https://www.youtube.com/watch?v=N5TVaHbvgMc",
    "category": "Science & Technology",
    "tags": [
        "Microsoft",
        "Duo 2",
        "Surface",
        "Smartphone",
        "Mobile Device",
        "Dual screen",
        "Fold",
        "Picture",
        "Cameras",
        "Multi cameras",
        "Snapdragon 888",
        "Multi-task",
        "Multitask",
        "Productivity",
        "Two screens",
        "Speakers",
        "Riley",
        "Unboxing",
        "5G"
    ],
    "views": 560766,
    "likes": 23822,
    "comments_count": 1447,
    "description": "Get a new skin from dbrand today at   Microsoft made some significant improvements with the Surface Duo 2, but it feels like their hardware team doesn't talk to the software team. Please fix this Microsoft, we really want to like this phone.  Check out the Microsoft Duo 2 smartphone at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - Intro 0:41 - Unboxing 1:41 - Microsoft Duo 2 exterior impressions 2:47 - Camera info 3:46 - Pricing 4:13 - Sponsor - dbrand! 5:44 - Software 6:47 - Specs comparison Duo 2 vs Duo 7:50 - Microsoft software impressions 10:02 -  Testing out the camera 10:57 - Continued software impressions 13:17 - Speakers impressions 14:23 - Notification glance bar impressions 14:50 - Final thoughts",
    "description_links": [
        "https://dbrand.com/shortlinus",
        "https://lmg.gg/McRh6",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- You know me. I'm a bit of a quirky boy. I'm a quirky boy. (both laugh) I like when like device manufacturers are like, \"You know what? We're not gonna make a normal phone. We're gonna get kooky with it. We're gonna get wacky.\" The Surface Duo One really kind of scratched that itch for me, which is interesting because as a online person, I like to cover those kinds of weird kooky things. Would I buy them? Do I shop for them? No. Unlike Jono who pre-orders every shiny new thing that pops up in a tweet, I'm more like, \"I'll just wait for the reviews and stuff.\" But I don't have to wait for the reviews. We have the Surface Duo here and I get to unbox it. Let's take a look. Oh, it's beautiful. The paper they chose, sustainably sourced probably. I don't know. It's probably not, I don't know. It's got some heft to it. I do have the Surface Duo One here. So we're gonna do some comparisons, but, oh wow, look at that. I mean, right off the bat I remember that the first phone did not have a giant camera bump like this. Oh, I ripped it. Oh, you're supposed to open it. (grunting) This is the weirdest unwrapping situation ever. Interesting. (yells) (laughs) Jono. You should not bring me on for these. I like the texture on it. Look at that. The older one, I don't think it had, or this is a D brand skin. (laughs heartily) Of course. What else is in the box? This is probably just documentation and a SIM card removal tool. And do I need to know any of this? No power adapter. Everyone's doing it. Save the planet. Copy Apple. You know, Microsoft's taking another gander at this and they look very similar. Although the most obvious difference looking at them here is the curved screen. This is a flat screen on the first Surface Duo. And on this one, you can see that the inside of the screen, like the screen curves into the inside a little bit into the hinge. So that when you close it, you can see a little bit of the screen, and apparently there'll be notifications there. So on the top we got nothing, on the side we have a very similar setup, except we have this fingerprint sensor that's separate from the power button and the volume rocker on the Surface Duo Two. I think that the fingerprint sensor is integrated into the power button volume rocker, and the SIM card slot is now on the bottom of the device, next to the centered USBC port, which I believe is a faster port as well. That's exciting, isn't it Jono? (slams table) Dang it Jono! Are you pre-ordering something? Get it out of the cart. Get it out of there. So the other obvious difference with these two devices is the camera. So on the first one we had a single, I think, right? Yeah, a single camera on the inside. And their reasoning here was that like, \"Okay, it's a selfie camera because you know, it's like a regular phone here and you're using it like a selfie camera. But then if you want a rear camera, you just flip it over. It's still a phone from that side too. And now it's a rear camera. I got you.\" And people complained a little bit about that. I mean the five people who bought the phone. (chuckles) I forget how much it started at, but it was like $1,500, $1,600 something. And then by the end they were selling it for like 500. But on the Surface Duo Two, not only do we have more than one camera, we have three cameras on the back and then also a single camera on the inside once more. We got 400% more cameras. (both laugh) So yeah, there's a lot of stuff to be excited about with the new device. Although how much does it retail for? It starts at 1500 again. Wow, the confidence. This is basically two like wide phones strapped together, which is not like a super new thing in the industry. LG has has their two phone system thing. There's the Galaxy Fold, obviously that's a single screen, but it's just wacky. All right, I'm going to turn it on now, Jono. Is that okay with you? - [Jono] No. - No? We'll just stay in this space and just reflect? - [Jono] Yep. - On what brought us here? So we're going to take a look at the actual software of the device right after, I tell you about our sponsor. Which is of course, D brand. They sent us this? They're so nice to us. What is... Is this a poop emoji? (laughs) Jeez Louise, whose idea was this? (balloons colliding) Is there a theme or a reason? What if I release all the helium into the atmosphere, and it causes global warming? (balloon pops softly) (air hisses out of balloon) - For today's sponsor read, I've been handed this very crumpled piece of paper. Thanks D brand. As I read through this script, it's becoming increasingly obvious that I won't be advertising any of D brand's products. Instead, I'm apparently going to be reading a tongue twister. Betty Botter bought some butter, but she said the butter's bitter. If I put it in my batter, it will make my batter bitter, but a bit of better butter will make my batter better. So she bought some better butter better than the bitter butter. And she put it in her batter and her batter was not bitter. So `twas better Betty Botter bought a bit of better butter. (takes deep breath) (Jono laughs) My editors are now going to put a link on the screen where you can purchase D brand products. Each purchase will go towards funding what I can only imagine is an entire department dedicated to tormenting us. In conclusion, don't inhale helium because the internet says that's dangerous apparently. And also, put a D brand skin on your sh... So the software is one of the big reasons people were kinda disappointed by the Surface Duo One. They did not do enough to smooth out the experience. They had some cool, like multitasking and multi window features, but it didn't take the cake. It didn't cut the cheese, slice the omelet. (chuckles) One thing really annoying off the bat though, is that there's no double tap to wake. And maybe that setting is disabled, but like that's a pretty standard feature on like every phone nowadays, right? Okay, starting up the shield. That was a little slow, but what are you going to do? Snapdragon 888. A big upgrade over the Snapdragon 855 in the Surface Duo One. When this released around a year ago, it was already late. It was already old. Everyone was running Snapdragon 888s already. Put a Google Tensor in there. (claps hands, imitates explosion) Every fricking Android manufacturer has to have their own slide over thing. Is this Bing? You tricked me Microsoft. It is 1350 by 1800 on the old one and 1344 by 1892 on this one. That means that this has a 4:3 aspect ratio and this has a 13:9? So the fact that the aspect ratios are slightly different, but the resolution is slightly different points to the fact that they have the same PPI. So these are basically the same screens. They haven't like pixels per inch, pixels per square inch. But this one also has a 90 Hertz refresh rate as opposed to 60 on the older one. 800 nits? HDR, 100% sRGB, DCI-P3, Corning Gorilla Glass Victus, which is the new thing. They stopped numbering it. 5.8 inch Amoled here, 5.6 inch on the older one. Eight gigs of RAM versus the six gigs on this one. They have a 512 gig storage option this time around. Little bit bigger battery. And the three cameras as we talked about. They really are trying to impress you this time around. I think with this one, they were kind of like, \"It's all about the form factor. It's wacky.\" (imitates hitting sounds) So this is Microsoft's launcher. It's been a little while since I took a look at Microsoft Android launcher, obviously. About a year, I'd say. Swipe down to do something. Swipe down from. You told me to swipe. Okay, this is the same thing, I remember this. Oh, okay, you can switch between web search and apps. And web search I'm assuming uses Bing, of course. What is it doing here? Look at this. You see that? The keyboard's over to the side. Oh no, it's happening again. It's happening! I don't know why they would do that. This is Android 11 by the way, if you couldn't tell. I think it's supposed to be. It's not Android 12 yet, but it probably will get a update. The Surface Duo One is supposed to get an Android 11 update and it launched with 10 so. This is weird. This is 90 Hertz? This is supposed to be a 90 Hertz display? Tom Green Drew Barrymore. It thought I would wanna see that for some reason. Yeah, oh, I can check my scalp from here. You know what I'm coming up with, sometimes it doesn't recognize your gesture. I want to go home. You know what I'm saying? - [Jono] Yup. Like, look at that. I just tried to swipe up and it thought I was starting to type something. Go home. Go away. You're free. Get outta here. I'm having a stroke. So the big thing you want to do with the dual screens phone, run two apps at the same time. I hear that they made this a little easier. What am I looking at Jono? Scan and solve. Oh, this phone lets you cheat on your homework. Oh, there's the multitasking. Oh tabs. What is this app? Is this a browser? From the multitasking menu you can either... Okay. I want this app to be just on this screen or I want it to be just on this screen, or I kind of want to bring it in the middle and span both screens. So that's kind of cool. Select news article or video. No that's politics. Oh my gosh, stop. Are my kidneys going to explode because I'm addicted to coffee? Let me know Microsoft. Okay so this is cool. We're in one app. I'm scrolling two different feeds in the same app. That's pretty cool. Apparently there's like a drag and drop situation where you can like drag a file in. I want to see that. Okay, so here's what, here's what we're going to do. Let's take a photo and then I'm going to send you the photo in Teams. Preview looks pretty good. How do I see? So this is interesting. They got the nice new cameras on the back. If you want to see these nice new cameras, you have to hold it like this. There's some things to get used to, which I like. I like weird things. Whoa, look at this cool bokeh. Do something crazy. That was so lame. (both laugh) Okay, that's a nice ultra wide on there. Oh man. I can get cinematic with it. Jono watch this. That's definitely not the smoothest it could be. Now we're going to add that to our realtor listing for this house. They got slow-mo, they got photo. Jono look at me. Edge one note, one shortcut. What? (laughs as he slams table) That was supposed to open it up , on each screen, I'm pretty sure. All right. So I wasn't signed into edge, so it freaked out. Okay, so now I'm signed in. If I'd press this now, it should open up, yeah, okay. So we're back into the workspace. So if you often, you know, watch a YouTube video and like take notes on the other side, there's a way to save that as a workspace and add it as a shortcut to your home screen. I don't know how to do that, but apparently you can do it cause I just did it. So that's kind of cool. Let's get back to what we were doing. So I'm gonna go to photos. I'm going to take the photo of you and I'm going to drag... No, it won't do that in the Photos app. Do I need to go to like the Files app or something? (exasperated chuckle) Can I drag that? What can I drag Microsoft? I just want to drag something. What? So there's no drag and drop. They lied to me. Has this been updated? (chuckles) Okay, interesting. So they didn't enable this sort of drag and drop file thing across the board. It's only between Microsoft apps. (chuckles) Wow, that was a lot of spit. Did you see that? (Jono chuckles) Okay, no. I'm in OneDrive. This is just a shortcut to the OneDrive app. We've got two app shortcuts right here that go to the same app. Throw this in the garbage. I was so excited. (both laugh) I was so excited to check out this phone. (Jono continues laughing) Jono. I don't know how much longer I want to like illustrate the point that Microsoft's UI on Android, their flavor of Android is still half baked. How do I go to the home screen? Disappointed! Aye Yai Yai. All right. I closed OneDrive, reopen OneDrive. I should be signed in. I'm signed in now. Microsoft. Okay, honestly, it's borderline unusable when I'm trying to be quick with something. Like if I want to pay attention and I'm like, okay, I'm bringing up the multitasking menu and then I'm scrolling around and then I don't want that anymore. And I flick it. But if you're trying to do anything fast, it doesn't do what you wanna do. I'm trying to bring up multitasking. Hello. Prep Brave. What if I dual screen it? (exasperated chuckle) This is breaking my brain a little bit, but it's more intuitive than I thought. So that's a super weird speaker setup. There's one here and one here. And I guess they're like, \"That's stereo speakers.\" Would you ever watch a video like this? It's obviously YouTube is not optimized for the dual screens experience yet. I think like Google wants to release their own optimizations for Android that'll make it better for foldables. Max volume. But now I'm not in stereo. (energetic music) It's not the worst smartphone speaker experience I've ever had in my life. But yeah, it's not great. Look at it. It doesn't go flush because they added this huge camera bump now. That's a lot less satisfying than the old Surface Duo One that goes completely flush. Microsoft! It's all like the same problems. Okay, iPhone 13 max volume comparison. (energetic music) Way better. Yeah, this is just obviously way better. It doesn't make this like absolutely horrible. It's fine, it's fine. Right, I wanted to see the notification doohickeys on the inside here. So I'm ready for the notification Microsoft. I don't see anything. (blows on phone) Surface Duo features, glance bar, okay. Will that not do Teams? (exasperated chuckle) Why would they not have Teams? Let's say I go to Teams, I check the notifications. All right, I'm just going to have it like this, because I feel like maybe the lights were too bright, I couldn't see it. I got nothing. Man, I was really hyped. I mean, I knew that it wasn't going to be like revolutionary. I had seen the reviews. People were like, \"Obviously it's a lot better.\" They improved a ton of stuff on this one, but it suffers from basically the exact same issues that the first one did. They fixed the chip, they fixed some of the hardware. But what is the point of having really cool hardware when your software still sucks ass? Microsoft! (frustrated growling) Two strikes Microsoft. Subscribe to TechLinked.",
    "transcript_keywords": [
        "Surface Duo",
        "Duo",
        "Surface",
        "Microsoft",
        "screen",
        "camera",
        "Jono",
        "Android",
        "Surface Duo features",
        "phone",
        "thing",
        "app",
        "bit",
        "drag",
        "cameras",
        "cool",
        "Microsoft Android",
        "kind",
        "brand",
        "screens"
    ],
    "transcript_entity_values": [
        "USBC",
        "About a year",
        "half",
        "1350",
        "5.6 inch",
        "100%",
        "400%",
        "three",
        "SIM",
        "One",
        "1344",
        "Hertz",
        "RAM",
        "60",
        "one",
        "Tom Green Drew Barrymore",
        "a ton",
        "13:9",
        "90",
        "Microsoft Android",
        "Google",
        "Max",
        "Betty Botter",
        "Android 11",
        "around a year ago",
        "YouTube",
        "Surface Duo One",
        "the Surface Duo",
        "Microsoft",
        "1,500",
        "Jono",
        "LG",
        "DCI-P3",
        "1800",
        "10",
        "first",
        "Surface Duo",
        "UI",
        "two",
        "Jeez Louise",
        "Android",
        "TechLinked",
        "the Surface Duo One",
        "Copy Apple",
        "500",
        "4:3",
        "Aye Yai Yai",
        "the Galaxy Fold",
        "more than one",
        "Snapdragon",
        "1892",
        "Eight",
        "512",
        "12",
        "Two",
        "1,600",
        "six",
        "five",
        "5.8 inch",
        "YouTube",
        "1500",
        "OneDrive",
        "today",
        "the Surface Duo Two",
        "800"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL"
    ]
}