{
    "id": "NAjmQmIdHgY",
    "title": "A Mysterious Coca-Cola Surprise...",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2017-02-28T21:24:37Z",
    "video_url": "https://www.youtube.com/watch?v=NAjmQmIdHgY",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "coca-cola",
        "coca cola",
        "cola",
        "coke",
        "soft drink",
        "pop",
        "soda",
        "technology (industry)",
        "innovation",
        "best",
        "iphone",
        "new inventions",
        "new gadgets",
        "futuristic",
        "amazing",
        "cool technology",
        "crazy",
        "test",
        "inventions",
        "things",
        "new technology",
        "iphone 8",
        "2016",
        "samsung",
        "awesome inventions",
        "most expensive",
        "expensive",
        "iphone vs android",
        "taste test",
        "taste",
        "life hacks",
        "experiment",
        "fun",
        "diy",
        "trick",
        "vs"
    ],
    "views": 3056877,
    "likes": 94142,
    "comments_count": 2706,
    "description": "(   ) --- Today's Mystery Video -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/GOnPmumWfU8?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "There's always something new around here Every time I come here and I tell you guys that stuff just shows up I think it might be the last time I say that but of course it isn't Because this is Unbox Therapy The boxes are never gonna stop showing up That says \"Coca Cola\" on it Now I don't know about you but I have a few ideas of what might be inside here Did I order this? NO! Who doesn't want a soda machine? But then I'm thinking like is it like a fridge? Is it some kinda... What is it? Who has there own soda machine? I'm not really sure But this brand right here *knock* *knock* *knock* That got me excised on it's own amiami Am I Pouring fresh Coca Cola is that what's happening in this studio now? Couse if so... guys like Jack will never leave Tom forget it dose that guy look like he's left anytime soon? I feel like it's Chiasmas morning because you know how when there's two boxes connected to one another like Maybe one of like some sort of combo gift I mean in case you didn't realize ether look how fragile it is Oh boy (LOUDER) Oh boy! Oh Official Coca Cola brand product American retro LLC Is this what it would of looked like once a pawn a time? This is like a old school retro fridge Do you plug it in? like what's happening there? This thing goes on the outside here And it caches the bottle caps And the power cable This guy goes out here Alright let's check the other box Oooohh ho Woah It's Unbox Therapy Coke I never thought I'd see the day I I don't even feel I could drink this Looks like there's one more thing in here *laughter* The custom Unbox Therapy Coca Cola We got some Coca Cola glasses Oh and check it out The opener as well Cause you godda do it Classy When your doing the classic Welcome to your new home and best wishes for 2017 from your friends at the Coca Cola company Never thought I'd see the day Unbox Therapy Coca Cola it's official The classic with your boy the classic I'm not sure why the picked that expression right there I mean you can tell I've seen better days I did a little bit of reading from the note that was inside of here, this thing is a replica of what these machines would of looked like in the 1930s and 40s if you walk in to a store to buy Coca Cola a small convenient store or some reason this is where you would have been buying your Coke from just like that Now they made two versions One that you would put ice in to so it wouldn't have any kind of extra option to keep it cool it would just be ice inside of here and then insolation And they made another version that would actually circulate ice water underneath the fit Now this one is modernized so it plugs in there's a refrigeration unit on the bottom It even mention how these screws in the top of the liner where part of the original so they went the extra mile on putting those in as well So its like this is like a peace of history inside the studio now so I I appreciate that I think its cool gift for the new studio never mind the added touch Of the Unbox Therapy limited addition Coca Cola classic it self Oh that's smooth Smells like regular Coca Cola mmmmmm Its the real deal I promises you that is actual Coca Cola with my face on it its so bezoar I'd never thought I'd see the day Jack never thought he'd see the day maybe next time its gonna be Jacks face Or just be a face with a question mark",
    "transcript_keywords": [
        "Coca Cola",
        "Therapy Coca Cola",
        "Unbox Therapy Coca",
        "Unbox Therapy",
        "Cola",
        "Coca",
        "Official Coca Cola",
        "Therapy Coca",
        "Coca Cola classic",
        "Unbox Therapy Coke",
        "Coca Cola brand",
        "day Unbox Therapy",
        "fresh Coca Cola",
        "Coca Cola glasses",
        "Coca Cola company",
        "buy Coca Cola",
        "addition Coca Cola",
        "regular Coca Cola",
        "Coca Cola mmmmmm",
        "actual Coca Cola"
    ],
    "transcript_entity_values": [
        "two",
        "2017",
        "One",
        "40s",
        "Unbox Therapy Coca Cola",
        "Coke",
        "Couse",
        "Chiasmas",
        "Coca Cola",
        "the Coca Cola company",
        "amiami Am",
        "Tom",
        "LLC",
        "the 1930s",
        "Jack",
        "American",
        "one"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "NORP",
        "CARDINAL"
    ]
}