{
    "id": "nap1BsPKrnA",
    "title": "Week with iPad Mini!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-04-13T16:32:42Z",
    "video_url": "https://www.youtube.com/watch?v=nap1BsPKrnA",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "ipad mini",
        "new ipad mini"
    ],
    "views": 481198,
    "likes": 12239,
    "comments_count": 956,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and today, we're doing a follow-up to the iPad Mini. This is the week with iPad Mini video, and honestly at this point, it's probably been a little bit over a week, but it's okay. Who's counting? I know, you are. I have been loving this so much. I've been watching movies, I've been watching shows, I've been watching Netflix. I've also just been kind of like doing email and text messages and stuff like that. I still sometimes do wish that they would have done an updated design, but the thing is this has been a consistent design for the past several years so all of those accessories, all of the cases, all of the sort of point of sale things too that businesses use, they can still use those with this. So I think that's one of the things that a lot of people have sort of been forgetting. People are using these for different things, not just content consuming devices, so being able to still use the things that they have been using for years but getting an updated device, I think, is really crucial. Also, the price point. Having something that isn't as crazy expensive as the iPad Pro, but still have the functionality and be able to use the Apple Pencil is also incredible. Of course, I'm not an illustrator. I mean I can use Photoshop and I'm still a designer, but as far as drawing and things like that, it's definitely not something that I'm good at. But I have been enjoying using Procreate and just kind of like doodling and drawing and just having fun. Like, this is beautiful. This is a work of art. Another thing that I like about the iPad Mini is just being able to take it with me, like, basically everywhere. Now I was joking about being able to put this in my yoga pants, but it actually does fit in my yoga pants pocket. Also, I was using this to fly my drone, which is kind of crazy, so being able to have a bigger screen to be able to see where I'm flying at, amazing. You do have to get an additional adapter to be able to use this on any of your drones, but it's definitely worth checking out if you do want to have a bigger screen. Speaking of drone flying and bigger screen, I got one of the DJI Smart Controllers, so I'm so excited to test that out, so stay tuned for that video. Like I was saying before, the Apple Pencil support is one of the biggest things in the new iPad mini and in the iPad Air. I really wanted to give you guys a demonstration on how illustrators and designers are using this. Now, I can't really draw at all, so I am going to bring in someone who can. Okay see, it's gonna be like magic. Ready? (Justine claps) - We've been talking about the week with iPad, and you guys might remember Cory. Say hi to my friends. - Hello friends. - You were in my iPad Pro video, and since then, you got your own iPad Pro, and-- - I got an iPad Pro. - You did, and you launched a line of greeting cards - I did. of which you've drawn all of those illustrations on the iPad. - [Cory] Every one of them was drawn on the iPad. - [Justine] That's really cool, let's see that. - [Cory] Well, these are the printed versions. - [Justine] How cute! - [Cory] \"If a pelican, so can you.\" - Jenna actually... I gave her one of those cards. She didn't get it. - It took her a while. - It took her a few minutes. I like the little buffalo. - Well, I branded the card company around the buffalo. It's called Lonely Buffalo Press. - How cute! - Yeah. - I love it. - He's fun. - Did you have the illustrations on your iPad? - I do actually, yeah. Well, here's a new one. \"You're as cozy as sweater weather.\" - [Justine] Oh, that's so cute. - [Cory] So that one will be coming out soon. - That seems like it's a nice holiday... - Here's an apology card that I'm working on. \"It's not ewe, it's me.\" And here's the buffalo and the roaming gnome. Procreate is so incredible. I love it. - [Justine] So is that what you use to do every-- - [Cory] Yeah, I use Procreate. You can build layers here. You can get in real close and detailed. - So I had Cory back here to do another illustration on the iPad Mini. So as you guys know now, all of the iPads work with the Apple Pencil. Now, the iPad Mini and the iPad Air only work with the first generation iPad Pencil, and the reason for that is because they're still using the old design. The new Apple Pencil charges magnetically. - Yes. It's so much better. - This is-- such a great design. So this one still charges the old way, which is you put it in the bottom here. - [Cory] It's incredibly awkward. - It is. It's super silly. - But they did come out with that, that little add-on over there. - Oh yes! - I wanted to show you guys this, - Yeah. - This is really cool. I completely missed this in the unboxing, and as I was going through to make sure I didn't throw anything else away, I found this. It comes with an extra tip, and it also comes with this little dongle here, so you can plug the Apple Pencil into the dongle and then you can actually have a cord that goes into it so you don't have to use your iPad to charge it. - Because I would rather have a cord hanging off than to walk around, especially with the other iPad, - Yeah. - with the thing sticking out when you had to get a quick charge. - So you were working on an illustration. You haven't showed it to me yet, so it's going to be a surprise. - No. So I was working on a new greeting card idea. Right now, the season is Mother's Day coming up. - Oh! - So I worked on a new greeting card for Mother's-- - Am I allowed to look at it? - I mean, you can look at it. - This is so cute! \"Mom, I'll always be your \"technical support.\" Oh my gosh, I love it! - That's not my mom. That's more grandmotherly, but y'know - Yeah. it works for the cute factor. - My grandma is so tech savvy. Like, half the time, she's telling me how to fix things. (Cory laughs) It's crazy. I love it! I like her little polka dot outfit. So how long do one of these usually take you? - So if you're in Procreate and you go to Video, and then you can hit Time Lapse Replay and it'll show the replay. You can see me kind of sketching here, figuring out what the character is going to look like. The great thing about working in layers is you can constantly change colors or bounce stuff around and move things. This probably took me 4 hours, maybe. It's really hard for me to pick a background. A lot of greeting cards are just pretty much stark white, so I'm not sure if we're going to go with purple on this one but so far I like it. - Guys, what color do you think that he should make the background? We should let them decide. Oh, I do like the blue. - See, there's the blue. - [Justine] But then you have a lot of blue cards already. - That's the problem, yeah. - It is a problem. - I love that shade of blue, - So maybe the purple? as you can tell. - [Justine] Oh that yellow actually, too. I like that. Oh my gosh, there's so many good color options. - That's not a good one. - Using Procreate on here, coming from the iPad Pro, what were the main differences for you? - This wonderfully fits right in here. Very simple. - Does the iPad Pro even fit in there? - Since I've switched to the iPad Pro, it does not fit in there, so that's a nice thing is the portability. If you carry a smaller satchel or a smaller bag, you can just slip that guy in there. I also like it for when I carry a moleskin around for a quick sketch as a poetry of whatever. - Obviously, yeah, I do that all the time. Let me get out my pen and pencil. - Well that's how a lot of my poetry and writing starts, is just with a pencil or a pen and a little moleskin. And so, this is akin to that where I could just pop this out, do a quick sketch if I see a building I like or a tree or something that catches my eye. - You could even take a picture of it too. - Do what? - Take a picture of it? - Why would you do that? - I don't know. - Or you could sit down and draw it. - You could do both. - You could. Sometimes I've had to do that. - I mean whatever, whatever whatever you want to do. I'm shocked at how much I really like this thing. - [Cory] Yeah. - [Justine] I think I unboxed ne of these, I think it was like 2015? I was joking that it was like the size of a phone, and I also was joking that this could honestly pass as Apple's next phone. So since you've been using the new iPad Pro and the new Pencil, what are the main differences for you when using the different pencils? - Oh my goodness. Just to start with, the feel of this is so much more like a regular artist utensil. Just like the polish, the matte finish to the polished finish here. It is so much better to use this. - Yeah. - [Cory] I haven't gotten completely into the jesters yet. - 'Cause there are different things that you can remap them to, but I'm not sure what they are. - [Cory] Yeah, I'm not sure either. - I haven't done that at all, because clearly I'm not an artist, so I just kind of am drawing for fun. But if I were to pick which pencil I thought looked better, I think this one look better. - I think that was rose gold. - Oh my gosh. - You got an engraving, right? Your name was on here. - Yeah, my name on it. This is great. So if anybody is like, \"You stole my \"Apple Pencil,\" I'd be like, \"Nope. My name's on it. I also got the engraved iPods. iPods, oh my gosh! AirPods! But I got it engraved with iJustine, because you could put a lowercase on the pencil. You couldn't use lowercase. So I got Justine, because a capital I in front of Justine just looks like LJustine and it's not cool. Another thing that I liked about the new iPad Mini is, I'm sure you probably haven't tried this yet, but you can sync up a Bluetooth keyboard to it. - Oh no, I haven't. - [Justine] Yeah, so you can just go like this, hook up a Bluetooth keyboard, and type away. Show us some more of your drawings. - Alright. - Show us something cool. Look at how cute this one is! - This is my favorite one by far. I always wanted to be an astronaut when I was a kid. - I wanted to be an astronaut too, but they told me that my eyesight wasn't good enough, and then basically crushed my dreams, so here we are. Is this a greeting card as well? - [Cory] This will be out very soon, in the next print run. - Yeah, I was always like, \"Well, maybe I can change my \"contacts in space, but I don't think that was going to \"work out so well.\" I can put my space mask on, - Zero-gravity? try to put it through my mask. - But at least you could find a contact if it dropped in space, I would imagine, because it wouldn't drop and you wouldn't be like, \"Everybody, nobody step on it\", because it would just be floating by. - It would be floating, but then it could just like stick to something, so it would just float up and probably stick to the ceiling. I've done zero-gravity before, so if you lost it and then it just had a slight bit of... - Momentum? - A push, yes. - Okay. - It'd keep going until it hit something. Well thanks so much for hanging out with us. - Thanks for having me. - I'll put all of his links in the description below. Check out your greeting cards and your Instagram and your fine art Instagram too, which I'm a huge fan of. Maison Basil. So, I'll put all the links below. Thanks! - Thanks, bye. - I'm gonna go play on my iPad now. Being able to connect a Bluetooth keyboard to this thing is also really cool. So I've been using this little stand. It's really cute. And then I put my little iPad right here. I'll turn this here so you guys can see it. (keyboard clicks) Have you seen anything more impressive? Look how fast I'm typing! Nonsensical letters. And this is just one of the ones that came with my old iMac, and it looks like a tiny little iMac. Look at how cute! So this is the little adapter that we were just talking about, and I haven't got to try this out yet, so let's open it up. What a great idea! So this just plugs in, just like that. It's basically a lightning to lightning dongle. And then you can plug in another cable, just like so, and then you can charge your pencil like this. This looks like a little fishing pole, like I'd be going fishing. I feel like this is a much better option than sticking it into your iPad, but if you don't have a cable or this dongle, obviously that works too. Well guys, thank you so much for watching. I hope you enjoyed this video. I've really been loving the iPad Mini. Also a huge thank you to Cory for being in my video and doing an illustration on the iPad Mini for me. If you guys want to check out his Instagrams, I'll put all of his links below, but you can check him out at CoryBasil, LonelyBuffaloPress, and MaisonBasil. I'll see you guys in my next video. Bye! (ending music plays) (ending music plays) (ending music plays) (ending music plays)",
    "transcript_keywords": [
        "iPad Mini",
        "iPad",
        "iPad Pro",
        "Apple Pencil",
        "Pencil",
        "Yeah",
        "Mini",
        "Pro",
        "things",
        "iPad Mini video",
        "Apple",
        "thing",
        "guys",
        "iPad Pro video",
        "put",
        "iPad Air",
        "cute",
        "Apple Pencil charges",
        "iPad Pencil",
        "video"
    ],
    "transcript_entity_values": [
        "zero",
        "the iPad Pro",
        "one",
        "iPad",
        "iJustine",
        "iMac",
        "iPad Air",
        "CoryBasil",
        "LJustine",
        "Apple",
        "Justine",
        "MaisonBasil",
        "the iPad Air",
        "iPad Pro",
        "Instagram",
        "years",
        "a few minutes",
        "Procreate",
        "2015",
        "the iPad Pro",
        "iPad Mini",
        "the week",
        "the Apple Pencil",
        "the iPad Pro",
        "Maison Basil",
        "Lonely Buffalo Press",
        "half",
        "Netflix",
        "Photoshop",
        "polish",
        "Zero",
        "the iPad Mini",
        "Apple Pencil",
        "the iPad Mini",
        "today",
        "Cory",
        "iPods",
        "the DJI Smart Controllers",
        "iPad Pencil",
        "4 hours",
        "Instagrams",
        "the past several years",
        "LonelyBuffaloPress",
        "first",
        "Apple Pencil",
        "Jenna",
        "iPads"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "LAW",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "DATE",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "PERSON",
        "ORG"
    ]
}