{
    "id": "nAzfZ0lQJO0",
    "title": "Want a BLACK screen on your RED iPhone 7?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-03-24T23:39:55Z",
    "video_url": "https://www.youtube.com/watch?v=nAzfZ0lQJO0",
    "category": "Howto & Style",
    "tags": [
        "Red iPhone 7",
        "Unboxing",
        "review",
        "product red",
        "iPhone repair",
        "Screen replacement",
        "fix",
        "how to",
        "iphone",
        "apple",
        "smartphone",
        "best smartphone",
        "best looking smartphone",
        "iphone 7",
        "iphone 7 plus",
        "apple iphone 7",
        "iphone 7 hack"
    ],
    "views": 7912328,
    "likes": 98641,
    "comments_count": 9529,
    "description": "The new RED iPhone 7 looks absolutely amazing. I wish there was a black screen option. Luckily... I have an extra phone and some tools laying around, so I can build my own. This video shows the step by step method that I used to build my own black screen Product Red iPhone 7. Maybe Apple will be able to offer this version in the future. You will lose the water resistance if you do it yourself.   The main problem is the home button. Apple claims security is the main reason they wont allow home button swaps, but its pretty simple to cover up with a skin or sticker. Hopefully MKBHD will help us out with that.   Here is a FULL screen replacement video with more tips:   Cell Phone Replacement Parts:  Awesome Smart Phone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/hIs6vLdHHKI",
        "https://goo.gl/8e9zgI",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2iZ67Ty",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "Today Apple released a brand new iPhone 7. This goes hand in hand with their (PRODUCT)RED line that donates a portion of their profits to AIDS and HIV programs with the hopes that eventually we will have an AIDS free generation. Charity is always a good thing, especially from one of the largest businesses in the world. When you buy the (PRODUCT)RED iPhone, it comes with a white screen. And while that does look pretty darn good, I think a black combination would look even more dope. Lets give it a try. [Intro] I turn the phone completely off and then remove the bottom two silver pentalobe screws. While I dont recommend attempting this project yourself, since it is pretty difficult, I will be linking all the tools and replacement parts that you might need in the video description. As we know, the iPhone is water resistant which means there is a thin band of adhesive running around the edge under the screen. Im going to use a heat gun to warm up the glass until its just barely too hot to touch. Then Ill use a large suction cup to lift up the edge of the screen enough to slip my thin metal pry tool between the plastic edge of the screen and the blood red metal body of the phone. Now this part is kind of tricky. Its where most people will damage their displays. There are some very fragile ribbon cables along the right side of the phone, so as you are cutting through the adhesive, its important to keep the tool from penetrating too deep inside of the phone and slicing that important stuff. You also cant lift the bottom edge of the screen very high or it will put stress on the ribbons as well. Youll see what Im talking about in just a second. The screen comes away from the device by pulling away ever so slightly on the display to release the top clips and then the whole thing folds open like a little booka very good looking red book. I think the inside of this thing looks better than the outside. The anodized red colored coating is all throughout the device and not just the exterior. Im definitely a fan. For the next step Ill switch to my wide triple zero bit since Apple likes to use weird screws inside of their phones. There are 4 screws holding down the metal plate over the battery connector, fingerprint connector and LCD ribbon connector. Ill set that off to the side next to the screws to help keep them organized. Now we need a Phillips head double zero screwdriver for the top screws next to the earpiece and front camera. If you think its weird that Apple has 3 separate screw types inside of their phone, youre not alone. I think its pretty strange as well. After the two screws on the top bracket are off I can unclip the front camera and the earpiece ribbon, and the screen is free from the iPhone body. Now depending on where you get your screen from there might be a few more steps. If you buy the replacement screen linked in the video description, youll have to transfer over your earpiece, back metal plate, and home button to your new screen. I show that in my iPhone 7 screen replacement video. For the sake of time though for this video, Ill be using a screen and home button that I pulled off a fully functioning matte black iPhone 7. Its already got all the components attached to it so its a direct swap and slightly easier. Ill start by plugging in the ribbon cables from the black screen. There are two down by the battery and then one more up at the top. Each of them will clip in like a little Lego. Make sure to plug the battery cable in very last; its safer that way. The two metal plates go over the top of the cable connection. And then the 6 screws hold everything tight. Remember each screw is different so keep them organized and put them back in the same hole they came from. The phone will fold shut just like a very expensive book and then the top edge of the screen gets tucked up into place before the rest of the display clicks down. Im going to use the black screws that I pulled from my other black iPhone 7 for a cleaner look. Replacement screws are also pretty easy to find. Ill link some below the video as well. And its time to turn our ultra good looking, one of a kind cell phone on. And here is where we run into the first problem. Apple has this thing where if you ever need to fix or replace your home button, they just kill the functionality of it altogether. Its incredibly frustrating from a repair perspective, but thats a story for a different day. Apple claims its for security reasons, which is valid, but there are other ways to protect your device besides killing functionality. The last warning that popped up was to tell me that I have to use the on screen home button now instead of the physical button, and thats kind of annoying. While I love the look of the all black on red, Im not about to lose functionality solely for aesthetics. Its time to reinstall the original home button the white one. See, iPhones and their home buttons are paired at birth and remain together for the entire duration of their lives like some kind of weird National Geographic documentary instead of a cell phone. To remove a home button there are 4 screws and then the home button unsticks from the plastic frame and drops out from the front of the phone. Then all I have to do is tuck the white home button back up into place on the black screen, and then use the same screws to hold it in. And thats it for the home button. Its still definitely white, but this time its functional and there are no error messages. Now one way around this would be to take the main board from the black iPhone and plop it into the red frame. That way the black home button would remain paired together with the black screen. But I would recommend against that because the more components that you remove from the phone, the higher chance you have of something breaking and going wrong and it never working again when you put it back together. I might compare this project to Legos during the video, but its slightly higher risk than that. The simplest solution is to just get a small black skin and put it over the white home button; incredibly inexpensive and at least the skin isnt covering the whole display. Now I dont have any skins at the moment, but I know a guy who does. Im going to send this phone over to MKBHD to let him work his magic on that home button. The phone is his to keep or giveawaytotally up to him. What color combination do you think looks best? Do you like the white screen, or do you think Apple should have made a black and red iPhone variant? Let me know in the comments. Luckily I was able to grab two of these red phones. Ill be testing the scratch resistance of the new color in my next video, so if you havent subscribed, now would be a good time. My Twitter followers got the inside look of this phone as it was happening. So follow me over there to stay ahead of the curve. And thanks for watching. Ill see you around.",
    "transcript_keywords": [
        "home button",
        "screen",
        "phone",
        "home",
        "button",
        "screws",
        "black",
        "Today Apple released",
        "RED",
        "black screen",
        "Ill",
        "iPhone",
        "screen home button",
        "white home button",
        "Apple",
        "black iPhone",
        "video",
        "black home button",
        "RED iPhone",
        "top"
    ],
    "transcript_entity_values": [
        "Phillips",
        "two",
        "zero",
        "LCD",
        "Today Apple",
        "iPhone 7",
        "iPhone",
        "3",
        "National Geographic",
        "Apple",
        "iPhones",
        "iPhone 7",
        "Lego",
        "6",
        "one",
        "first",
        "second",
        "4"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL"
    ]
}