{
    "id": "NcEG4mHBCTk",
    "title": "Turning my house into a LEGO Super Mario World",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-11-06T22:00:10Z",
    "video_url": "https://www.youtube.com/watch?v=NcEG4mHBCTk",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "LEGO",
        "NINTENDO",
        "MARIO"
    ],
    "views": 292330,
    "likes": 11350,
    "comments_count": 658,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today, we are about to embark on a Lego Super Mario challenge. A huge thank you to Lego for sponsoring this video and making one of my dream videos come true. Ever since they announced these, one of the things that I really wanted to do was make a huge, massive course in my house. So to get things started and to use the entire Lego Super Mario world, you need the starter kit. So this gives you Mario, your start pipe and your end-goal flag. This is what you need to start, and this is what you need to end with. And what you do in between those is, basically, up to your imagination. Also in the set, you get a little Goomba, you get Bowser Junior, and you get a coin block. Mario has a built-in gyroscope, accelerometer and speakers that react to his movements and the bricks that he hits. There's even a sensor in the bottom to make all of that possible. And it's cool because you can see all of the actions take place in the LCD on his belly. This is also a color sensor, so it'll react to different colored bricks. So red is fire. Green is the ground. Yellow is sand, and blue is water. All of the expansion sets can be built within the start and end-goal. They also have some really cool character packs and they have some power-ups for Mario. So you can change his outfits. And depending upon which outfit you choose, is determined how he reacts to the course. We have Lego Mario, which comes in the starter kit. There's Builder Mario, Fire Mario, Propeller Mario, and Cat Mario. So when you hit the start pipe, Mario will put 60 seconds on his clock and then you have to collect as many coins as possible. There is a timer block that you can hit that will give you an extra 30 seconds. But for this challenge, we have to build a course and collect as many coins as possible. I'll put a link in the description where you can find all of the Lego Mario sets. So now it's time to get started with my Lego Super Mario dream course. My house has been cleared out. We have over 500 Lego base plates, and we are gonna cover the walls and the floors, and make one of the most fun, interactive Lego Super Mario courses that we can come up with. I am so excited for this. I have some of the sets already built, and some of them we're gonna be building, and then we're just gonna go for it and see what happens. My sister Jenna is here and my friend Ed is here to assist with the building process, and Maddy's helping too; helping. (upbeat music) I am gonna start building the first set. This is the Bowser expansion set. Ed and Jenna are gonna start working on figuring out where the background elements are gonna go. Ed's planning a waterfall coming off of the fireplace. This is gonna be incredible. (jazzy music) You, so, what are we doing here? Do we, what, anyone? (jazzy music) - You got that time lapse. Sure made this look like it was pretty quick, huh? - [Ed] There's thick towels of sweat over- - 10 hours later. - [Ed] Nobody could see. (playful music) - We need to start working on the actual course back here. And we also have another little, like, TV stand thing that I think I'm gonna bring in here just to add like a little, another extra level. Maybe put some grass on that. It's gonna be cool. (playful music) So I'm trying to link together the ground and the water, so we have a lot of these really cool little elements that we can just pop in to kind of get each piece to start flowing into the whole course. (playful music) - I should have looked up what the clouds looked like before I made one. - [Ed] (laughing) Clouds. (playful music) (epic music) - 15 hours later, the course is officially done, and we're gonna go for the run. (epic music) Are you guys ready? Please say you are. Because I have never been more ready. - Here we go! (epic music) _ [Justine] Oh (laughing)! (epic music) (jazzy music) - Oh! What did we get? What did we do? Oh my gosh, I'm freaking out! 148! This is crazy. So this shows you all of the coins that you got from each thing that you hit; 148. (upbeat music) 148 coins; You guys, this was probably one of the most fun videos, not only to make, but to work on and edit, and just see it all come together. But the fun isn't stopping here, because I'm tagging Papa Jake, who is going to be making a course and also running the same challenge. I'll put a link in the description where you could check out his channel and all of the other creators who participated in building a fun Lego Super Mario course. I'll see you guys in the next video. Bye! (upbeat music)",
    "transcript_keywords": [
        "Lego Super Mario",
        "Super Mario",
        "Mario",
        "Lego Super",
        "Lego Mario",
        "Lego",
        "Lego Mario sets",
        "Super Mario challenge",
        "start",
        "Super Mario world",
        "Super Mario dream",
        "Super",
        "fun Lego Super",
        "entire Lego Super",
        "Justine",
        "interactive Lego Super",
        "Propeller Mario",
        "Builder Mario",
        "Cat Mario",
        "Mario sets"
    ],
    "transcript_entity_values": [
        "500",
        "Fire Mario",
        "one",
        "Papa Jake",
        "Justine",
        "10 hours later",
        "Goomba",
        "Maddy",
        "Lego Mario",
        "Cat Mario",
        "LCD",
        "Lego",
        "148",
        "Bowser",
        "Bowser Junior",
        "15 hours later",
        "Mario",
        "Ed",
        "Lego Mario",
        "today",
        "60 seconds",
        "first",
        "Lego Super Mario",
        "an extra 30 seconds",
        "Jenna"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "TIME",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "TIME",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "TIME",
        "ORDINAL",
        "ORG",
        "TIME",
        "PERSON"
    ]
}