{
    "id": "NdAmZvXsbwg",
    "title": "Nintendo E3 2018 press conference in 5 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-06-12T18:19:43Z",
    "video_url": "https://www.youtube.com/watch?v=NdAmZvXsbwg",
    "category": "Science & Technology",
    "tags": [
        "Nintendo E3 2018",
        "nintendo switch",
        "e3 2018",
        "switch games 2018",
        "super smash bros switch",
        "Super Mario Party",
        "Pokémon",
        "metroid prime 4",
        "nintendo",
        "nintendo switch 2018",
        "e3",
        "switch",
        "the verge"
    ],
    "views": 86392,
    "likes": 1296,
    "comments_count": 153,
    "description": "Nintendos E3 keynote focused more on soon to be released titles that people will actually be able to play in the coming months like Super Smash Bros. Ultimate, Super Mario Party, and Pokmon: Lets Go! rather than offering updates on no-shows announced last year likeMetroid Prime 4. If you missed the presentation, though, heres everything youll need to catch up. Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "When we watched Nintendo Switch, our vision was a home system you could play together anytime, anywhere. Where will Nintendo Switch take you next? A few weeks ago, we showed you Pokemon Let's Go Pikachu and Pokemon Let's Go Eevee. Add the transformative power of Nintendo Switch and you can play as you like anywhere where you like. Or, for the first time in the series, catch or battle Pokemon on one system with a friend. You can even transfer a Pokemon into the game from Pokemon Go. This is a Pokeball Plus. You can use it like a Joy-Con controller with Pokemon Let's Go Pikachu and Let's Go Eevee or play the entire game with it alone. You can put a Pokemon into the Pokeball Plus, then bring it with you. Mew comes exclusive with every Pokeball Plus and can join you on your journey through the game. Pokemon Let's Go Pikachu, Pokemon Let's Go Eevee and the Pokeball Plus will available on November 16th Let's check out something else we cant' wait to show you. (upbeat music) - Yes. (groans) - Oh come on man. - Hey. - What's up? - What are y'all doing? - Come play. - Okay. - [Boy] Gotta change it up though. - [Girl] That's gonna go to fast, let's do it this way. - [Boy] We need to have like some angles. - Okay, that looks cool. Ready? Hit it. (game noises) - [Boy] Oh game on. One, your goin'. - [Girl] Okay. Agh! - [Boy] Oh, really? Come on. - Oh no. (laughing) (upbeat music) - I can't wait to drop off the battle bus and meet some of you on the battlefield in Fortnite and on Nintendo Switch, you can have the complete battle royale experience. Whether playing together online with friends in the same room or around the world available at 10 a.m. Pacific Time today. (upbeat music) Your support for indie games on Nintendo Switch has been inspiring. Let's pull back the curtain on a few more. Aspiring chefs ready your cleavers, pots and cutting boards in Overcooked! Two arrives on August seventh. Let' take another action-packed look at some more experiences coming soon to Nintendo Switch. (upbeat music) - Hi, I'm Masahiro Sahurai from Sora Limited. Today, I'd like to introduce you to the new Super Smash Brothers game for the Nintendo Switch. Many fighters have appeared in this series. I'm sure you're all eager to find out who will be joining the roster this time. (revving) That's right. Indeed, absolutely every Super Smash Brothers fighter ever is in this game, whether they were originally DLC or only appeared once in the past. Simply put, this is the biggest crossover in gaming history. So, your starting roster may be as small as the original Nintendo 64 game. We've streamlined the conditions for unlocking fighters and we want to make the process interesting so it feels like you're constantly recruiting popular characters to your side. Eight player battles are also making a return. We've got something special for your playing pleasure in Super Smash Brothers Ultimate. Nintendo GameCube controllers can be used in Super Smash Brothers Ultimate. For many of you, it just isn't the same without them. We do have one more announcement. Please, take a look. (crash) (upbeat music) We now have the female version of Pikachu complete with a heart-shaped tail. Did you notice Pikachu Libre is a girl?",
    "transcript_keywords": [
        "Nintendo Switch",
        "Super Smash Brothers",
        "Pokemon",
        "watched Nintendo Switch",
        "Nintendo",
        "Smash Brothers",
        "Super Smash",
        "Smash Brothers Ultimate",
        "Switch",
        "Pikachu",
        "Pokeball",
        "game",
        "watched Nintendo",
        "Smash",
        "Brothers",
        "Super",
        "Brothers Ultimate",
        "Eevee",
        "Smash Brothers game",
        "play"
    ],
    "transcript_entity_values": [
        "Today",
        "one",
        "10 a.m.",
        "Masahiro Sahurai",
        "a Pokeball Plus",
        "today",
        "Nintendo GameCube",
        "Pikachu Libre",
        "November 16th",
        "Pacific Time",
        "August seventh",
        "Fortnite",
        "Pokemon",
        "Eight",
        "A few weeks ago",
        "Super Smash Brothers",
        "the Nintendo Switch",
        "the Pokeball Plus",
        "Two",
        "One",
        "Nintendo",
        "the Pokeball Plus",
        "Pokemon",
        "Super Smash Brothers Ultimate",
        "Sora Limited",
        "first",
        "Pokemon Go",
        "Nintendo Switch"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "TIME",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "EVENT",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG"
    ]
}