{
    "id": "NDyoDyl6qDw",
    "title": "Acer at IFA 2018: ultra-thin laptops and gaming thrones",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-08-29T21:25:23Z",
    "video_url": "https://www.youtube.com/watch?v=NDyoDyl6qDw",
    "category": "Science & Technology",
    "tags": [
        "Acer",
        "laptop",
        "gaming",
        "gaming laptop",
        "predator",
        "acer swift 7",
        "acer predator",
        "pc gaming",
        "best gaming laptop",
        "technology",
        "bezels",
        "display",
        "top 10",
        "tech review",
        "review",
        "gadgets",
        "new tech",
        "new technology",
        "tech",
        "unboxing",
        "upgrade",
        "latest updates",
        "how to",
        "how to make",
        "diy",
        "mkbhd",
        "marques brownlee",
        "apple",
        "MacBook Pro",
        "google",
        "android",
        "dell",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 63404,
    "likes": 880,
    "comments_count": 54,
    "description": "Acer announced a ton of cool products at IFA 2018 in Berlin: the Swift 7, which Acer is calling the thinnest laptop in the world; the Predator Triton 900, a 2-in-1 convertible gaming PC; and the massive Predator Thronos motorized gaming chair. But most of them arent actually at the show, and prices and release dates are scarce.  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey, it's Chaim with the verge, and I'm here at IFA 2018 at Acer, where they just announced a whole bunch of new products at their press conference. There's the new swift five, there's the swift seven, the thinnest laptop in the world, there's this ridiculous Predator Thronos Gaming Chair, there's a convertible, Predator, Triton 900, tune one gaming laptop. The Predator X, there's a giant gaming tower. The problem is that while a lot of this stuff is super cool and super interesting, a lot of it just isn't actually here. (upbeat music) So yeah, Acer announced a lot of cool products, and yeah, some of them are actually here, and we'll get into those, but most of them aren't, and that's kind of a habit for Acer these days. For example, take the Swift five. In May 2018, earlier this year, Acer announced the Swift five, taking the 14-inch Swift five screen, replacing it with a 15 point six inch one, for would be the lightest 15-inch laptop around, and it was pretty cool at the time, but they didn't actually have a working one there in May, just a dummy prototype unit, so here at IFA, in August 2018, they've got a working Swift five, and it looks good, the screen looks great. It's got Intel's latest Whiskey Lake processors. Plenty of RAM, feels a little cheap, but I guess that's the sacrifice you make, when you're making a super light laptop. But the problem is, is that it took months to get to this point, where it's even here and real, and it's gonna be months more before you'll actually be able to buy one, November for Europe, and January 2019 in the U.S. Next up is the chair that's behind me. Acer's Predator Thronos, this is a completely ridiculous device, it's a 485 pound gaming chair. It's got a mechanical arm that can support up to 327-inch screens, just encompass your entire field of vision, it has motorized footrest. It has a motorized foot-pedal, in case you don't wanna use the motorized footrest. The keyboard swings out, you sit down in this, and it just encases you, like a cage of gaming joy. I actually got to try it out for a few minutes here, and I love it, it's just completely ridiculous in the best kind of way, so I just hit this button? - Yeah, yeah. - Oh my God, oh my God, it's, it's eating me. Goodbye everyone, I live here now. Okay, that's really cool, you can like feel each individual bullet shot, 'cause the chair has hacker feedback, I'd really like to see more companies embrace this level of ridiculousness, in, in all their products, going forward. I love it, the problem though is that it's here. It's great, but there's no price and there's no release date, so we have no idea how much it'll actually cost, or when you'll actually be able to buy one, which is about to become a really recurring theme here. It's a similar story by Acer's Predator Triton 900. It's a new two in one convertible gaming laptop, that they just announced, and it's here at IFA, sort of. They have one prototype, locked under a glass box, that we've been able to look at, but we can't try it out. We have no idea how it works, and it looks pretty cool. The screen flips around, you can adjust it. You can move it around, so that it's in different places, in different angles for gaming, but there's no price, there's no release date. There's no word on specifications, and we have no idea when you'll be able to buy one. It's a similar story by the Predator X, which is Acer's new gaming tower. It's supposed to be this ultra powerful gaming desktop. It has two of Intel's xeon processors, which are usually put in servers, and it also is here, it's an unmarked black box. We can't see anything running bound it, and we have again no idea of price, release date, or any of that information, and last, there's Acer Swift seven, now Acer showed this off at its keynote on stage, in a slide, they showcase the incredibly small bezel. It has a 92% screen to body ratio. The bezels are just over four milometers, and it looks awesome, but that's all we can really say about it, because that's all Acer told us. They don't have even a prototype here that we can see. They haven't released any word on specs, there's no price release date, there's barely any information, other than a picture, and that's sort of the problem. All this is really cool, and it's really cool to look at, but right now without any details, it's hard for us to even get an idea of what these products are gonna be like, when they come out in months, or even years, with all that said though, it is still really fun just to see that Acer is willing to take these risks and make these innovative products, even if all we can really do is see them, and not actually try them out here at IFA, and who knows, there's always C.E.S. Hey, it's Chaim with the verge, I'm here at IFA 2018, at Acer, and there is a loud banging noise. There's no release date, we have no idea when you'll be able to pick one up, or how much it'll cost, when you did, when you will, when it does.",
    "transcript_keywords": [
        "Acer Predator Thronos",
        "Acer",
        "Acer Predator Triton",
        "Acer Predator",
        "swift",
        "Predator Thronos Gaming",
        "Predator",
        "Predator Thronos",
        "Gaming",
        "Acer Swift",
        "Acer announced",
        "release date",
        "ridiculous Predator Thronos",
        "cool",
        "IFA",
        "press conference",
        "Thronos Gaming Chair",
        "idea",
        "Gaming Chair",
        "gaming laptop"
    ],
    "transcript_entity_values": [
        "May 2018",
        "May",
        "August 2018",
        "November",
        "one",
        "485 pound",
        "14-inch",
        "the Predator X",
        "Predator Triton",
        "92%",
        "just over four",
        "327-inch",
        "15-inch",
        "Europe",
        "Chaim",
        "a few minutes",
        "years",
        "months",
        "Predator, Triton 900",
        "Acer Swift",
        "Whiskey Lake",
        "two",
        "IFA 2018",
        "Acer",
        "Predator Thronos",
        "these days",
        "2018",
        "five",
        "15 point six inch",
        "January 2019",
        "Intel",
        "Predator Thronos Gaming Chair",
        "seven",
        "The Predator X",
        "IFA",
        "U.S.",
        "earlier this year"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "LOC",
        "PERSON",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "LOC",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "GPE",
        "DATE"
    ]
}