{
    "id": "nEq7jBRkQGg",
    "title": "Microsoft is going all in on AI | The Vergecast",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-03-18T14:00:34Z",
    "video_url": "https://www.youtube.com/watch?v=nEq7jBRkQGg",
    "category": "Science & Technology",
    "tags": [
        "microsoft",
        "ai",
        "google",
        "artificial intelligence",
        "Copilot",
        "openai",
        "github copilot",
        "ai robots",
        "open ai",
        "what is ai",
        "what is artificial intelligence",
        "ai art",
        "ai technology",
        "chatgpt",
        "google ai robot",
        "artificial intelligence robot",
        "ai robot",
        "google ai",
        "artificial intelligence tutorial",
        "google's artificial intelligence",
        "artificial intelligence uprising",
        "the verge",
        "vergecast",
        "vergecast podcast"
    ],
    "views": 1245,
    "likes": 32,
    "comments_count": 2,
    "description": "Microsoft announced Copilot, their new AI-assisted vision for the future of work documents. #AI #Tech #Microsoft  The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Shop The Verge's merch here:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Read More:  Community guidelines:  Wallpapers from The Verge:  Follow on Twitter:  Follow on Instagram:  Listen to our podcasts:  Read More:",
    "description_links": [
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "https://shop.theverge.com/",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://goo.gl/XTWX61",
        "http://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com"
    ],
    "transcript": "(upbeat music) - Microsoft announced direct integration into Office products, Google announced the same. Let's start with Microsoft, just because that is GPT-4. By the way, the silliest mystery in tech was solved this week. When Microsoft announced Bing, we kept asking them if it was GPT-4, and they kept intimating that version numbers were not the right way to think about it, and OpenAI would make a big decision about version, and then now it's just GPT-4 and they kept to it. Cool mystery, Microsoft. (group laughter) But James, walk us through what's happening with the Office products and GPT-4. - Well, I mean, I don't wanna say it 'cause everyone's gonna say it, but it's a souped up Clippy, right? It is a little assistant called Copilot that has a nice little logo that lives in your sidebar of whatever Office app you are using and you can give it instructions. And I think this is actually a pretty good product and actually could be very useful, because a lot of this stuff it's doing is tasks that in my experience, these bots actually can do quite good at. And it's things like summarizing documents, it's saying, \"You've got a a lot of meetings here and we're gonna pull out the three key points. You have a presentation, and we'll turn it from a Word document into a slideshow.\" Now of course, the proof is in the pudding. We don't know how good this stuff is gonna be until we can start using it ourselves and we haven't been able to do that yet. We will very soon. But I think in theory this is the sort of limited task that these systems can be quite good at. I think one of the big mistakes that we've seen in the tech world with language models is thinking they'll be good at search, but hallucination, making up information is such a bad problem when you point something at such a large array of information, that we're never gonna get over that, well, not never, but it's a tricky one. Whereas if it's quite a short document, it can fit inside the context window of the language model, which is the amount of information it can sort of hold in its short term memory as it were, then yeah, it's much less likely to make mistakes, and it probably will do some useful drudgery for you. So I think this is actually potentially really useful. - It's funny because hallucination is a problem in search, but it's not for your average corporate PowerPoint. It's like, \"Hallucinate a good idea for me, that I can tell to my boss,\" and like Clippy will just do it. - Well, but I feel like the thing about that and I think the constraint that James you're talking about is really important, and is the thing that we're seeing, right? Like it seems like the first killer app, or at least the first profitable one, is going to be, feed this AI some subset of our corporate data and have it make sense of it, right? Like, \"Who should I invite to this meeting?\" \"What should my email say?\" \"What is this thread about?\" \"Where does this information live?\" It's like that is the kind of thing, because it's constrained, because it's a relatively small amount of data, it's just not getting enough information from which to make a lot of really aggressive, spectacular mistakes. And they're gonna be easier to catch, because it is in theory, information that everybody already knows, it's just doing a better job of like distilling it and organizing it for you. The thing that is amazing to me about this is like, A, I think this is going to be a truly magical thing in Excel, which is the kind of application that can do almost anything and you kind of know what you want it to do, but you don't know how to do it, and just being able to tell a thing like, \"Hey, the thing that's in here, can you put it in all these other places too?\" Is gonna put like a bunch of TikTokers out of business immediately. (group laughs) But the other thing is like, I just can't stop thinking about this as like, all of these companies telling on themselves. Where it's just like, \"Do you know how many people's job it is in the world to take a Word document and turn it into a 10 slide PowerPoint presentation?\" A lot of people do that more or less for a living, or write summaries of email threads for the person that they work for, so much of modern work is this stuff. - I mean, you know my dream, David. My dream is to arrive at a point in my career where I no longer use software at work. (group laughs) And if I can just get there, I will know I have succeeded. And if that requires using invisible software, just like commanding an AI to print out my emails for me and summarize them, that's fine. - Printed summaries of Slack, 10 times a day for Nilay. - But as long as I'm not using a graphical user interface I will have succeeded. Like, I'm not using some piece of enterprise software and I'm just yelling at a robot. That's fine. That's totally fine. The thing that you're saying though, Microsoft has been at this forever, this is where Clippy came from. - Yeah. - They've always known the products are too complicated. They have not been able to build a natural user interface. I mean this is like nineties Microsoft dreams. And Nadella is a lifer at Microsoft. He grew up in the cloud of Bill Gates' dreams that Clippy would do it for you, and he could compete with Steve Jobs, and now he's here, and he's like, \"Here's what you do. You tell Excel to act like an accountant and develop a business model based on these five inputs that you have, and Excel will generate an Excel spreadsheet for you.\" And just like GPT writing SWIFT code to make an iOS app, Excel is a computer. People have built \"Doom\" inside of Excel. It is a programming environment. So you've now built a natural user interface for one of the most powerful programming environments that has ever shipped at scale, and that's rad. And then over here you've got people be like, \"I need to make a PowerPoint presentation about the battle of 1812 for my eighth grade class.\" And maybe along the way we've destroyed the American educational system, who knows? But the Excel thing is really cool, so we're definitely gonna do that. (group laugh) - Yeah, it's basically right. No, I think we're in this place now where, we've talked a lot about kind of AI writing in general, and to me I think the sort of generative writing thing is the thing that seems to click for most people first, where it's like, \"Oh, I can have this write me a poem in the style of my favorite poet or write my eighth grade essay for me.\" But I think the thing that has jumped out to me is, and especially this goes back to Microsoft too, is like, you know what's super boring? Is most work emails. And we get really precious about writing, 'cause it's what we do for a living. Most people just need to make a marketing brief that doesn't get them fired, and need to put all the information into a document, and I feel like so much of this stuff is so low stakes and so straightforward, that the idea of having my AI summarize and write an email for me. There was one thing in Google's marketing materials where it was like it was a whole thing and you typed into the Google AI, \"I'm on it,\" and it wrote this like flowery three paragraph email about like, \"I will prepare this information for you ahead of our next meeting. Thank you all so much for your contributions.\" And it's like, on the one hand that makes me wanna die. On the other hand, that's how people talk. - I'm telling you man, that's the robot internet. You don't understand, that thing, where we are now sending AI generated emails to other people's AIs to decide whether that should result in a calendar invite so humans can talk to each other is just gonna silo itself away, and then my dream of never using software at work will come true. (upbeat instrumental music)",
    "transcript_keywords": [
        "thing",
        "announced direct integration",
        "Microsoft announced direct",
        "Microsoft",
        "Microsoft announced Bing",
        "Excel",
        "Microsoft announced",
        "information",
        "people",
        "make",
        "direct integration",
        "Office products",
        "good",
        "Clippy",
        "Office",
        "Excel thing",
        "announced direct",
        "lot",
        "work",
        "announced"
    ],
    "transcript_entity_values": [
        "Bill Gates'",
        "GPT",
        "American",
        "this week",
        "one",
        "Clippy",
        "the Google AI",
        "three",
        "AI",
        "Slack",
        "Bing",
        "1812",
        "Google",
        "eighth",
        "Office",
        "Nadella",
        "Excel",
        "TikTokers",
        "Steve Jobs",
        "eighth",
        "David",
        "Clippy",
        "five",
        "Microsoft",
        "first",
        "James",
        "PowerPoint",
        "Nilay",
        "10"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "NORP",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "LANGUAGE",
        "CARDINAL"
    ]
}