{
    "id": "NexnMz0tkC4",
    "title": "Hands-on: Microsoft Surface Pro 9, Surface Laptop 5, Surface Studio 2 Plus",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-10-12T14:00:11Z",
    "video_url": "https://www.youtube.com/watch?v=NexnMz0tkC4",
    "category": "Science & Technology",
    "tags": [
        "microsoft surface pro 9",
        "surface pro",
        "surface pro 9 2022",
        "surface pro 9 unboxing",
        "surface pro 9 5g",
        "surface pro 9 microsoft",
        "surface pro 9 trailer",
        "microsoft surface pro 9 5g 2022",
        "surface pro 9 5g microsoft",
        "surface laptop 5",
        "surface studio 2+",
        "windows 11",
        "surface pro 9",
        "microsoft surface pro",
        "microsoft",
        "surface pro x",
        "surface pro 8",
        "pro 9 5g microsoft",
        "pro 9 microsoft",
        "surface pro 9 5g 2022",
        "tech"
    ],
    "views": 291311,
    "likes": 5228,
    "comments_count": 317,
    "description": "Microsoft is launching a single Surface Pro 9 lineup for 2022. It marks the blending of Surface Pro X and Surface Pro, as you can now pick between Intel or Arm. We also got a look at the Surface Studio 2 Plus model which upgrades both the CPU and GPU inside. Plus, The Surface Laptop 5 arrives with Thunderbolt 4 but no AMD options.   0:00 Intro 0:35 Surface Pro 9 2:58 Surface Laptop 5 4:04 Surface Studio 2 Plus 5:05 Surface gaming PC? 5:45 10 years of the Surface line 7:41 Price and availability  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- Microsoft just announced a bunch of new Surface's. The Surface Pro 9, the Surface Laptop 5, and the Surface Studio 2+. So, that's exciting, but it's also the 10 year anniversary of Surface, a line that's become usually successful and ambitious for Microsoft. So, we wanted to know how's that changed over the last 10 years, and what's coming next? So, we came out here to Redmond, Washington, to meet with Panos Panay, the \"man\" behind Surface and Windows. But first we got to see what Microsoft has his store for Surface this fall. Out of the three new Surfaces coming later this month, the Surface Pro 9, really has the most changes, both on the outside and inside. New this year are colors across the entire Surface Pro device, so it's not just on the type cover anymore. That matches what we've seen on the Surface Laptop, and I have a bit of a soft spot for the forest green color and the new sapphire blue. If you really want to get fancy, there's even a special Liberty limited edition, that has been laser etched with a custom design. It's great to see more than just type covers for customization here. Now, the other big story is Arm. Microsoft must be confident in its Windows on Arm work, because the Surface Pro 9, now comes in two options. There's a regular Intel edition with 12 gen chips, or an Arm powered version powered by the SQ3, a chip designed by Microsoft and Qualcomm. That's right, the Surface Pro X is merged into the mainline and the only real difference on the outside, is that the Arm version feels a little bit lighter but there's obviously some really big differences inside. Top of those differences is that the SQ3 Surface PRO 9, ships with 5G support for the first time. Now, we tested it briefly in Microsoft's Surface roll back room, where you can't see in or out of the windows, and 5G reception wasn't that great, but setup was seamless and just a matter of putting a SIM card inside. Unfortunately you won't be able to get 5G support on the Intel version as Microsoft is keeping this exclusive to the SQ3. The SQ3 version also has a neural processing unit, which is a fancy way of saying it can run AI tasks without hitting your CPU and GPU. Microsoft is bringing impressive background and portrait blur across all video conferencing apps on Windows with this SQ3 chip, and even a voice focus feature that is particularly good at removing background noise. We've seen similar efforts from Invideo, Discord, Zoom, and plenty of other apps, but all of those are hitting your CPU and GPU, whereas this is running separately on a chip. This is a big next step for Surface, but it's not a reinvention of the line that defined the last 10 years of tablets. So, I asked Panos, where does the kickstand go over the next 10 years? - I think the thing that will be here in 10 years, is the need to create the kickstand itself. It might be here, but it's more about how does a product adapt to you? So, like when we did the kickstand, it was all about if we were gonna move from consuming to producing and you and I talked about this. I think the mode switching is here to stay and the mode switching from leaning back to leaning in, is my way of saying it. So, creating versus consuming. - Next up is the Surface Laptop 5. Much like the previous Laptop 4. This year's model will come in a variety of colors and options to pick between the 13.5 inch or 15 inch displays, an Alcantara material or a metal finish. There's a slightly lighter green sage color that's new this year alongside the regular Matt Black, Sandstone, and Platinum Alcantara. Spec wise, you're picking between pure Intel this time though. Like the Surface Pro 9, Surface Laptop 5, will be powered by 12 gen Intel chips, with the base model starting with a Core I5. So, AMD is nowhere to be found here. Microsoft is also finally adding Thunderbolt for support to the Surface Laptop this year. So, you'll have those super speedy file transfers. There's also Dolby vision support for the display and Dolby Atmos for the sound. Microsoft had our step inside their super fancy Anechoic Chamber, one of the quietest places on earth. The silence was met with a thundering demo of Dolby Atmos sound, which was an impressive and slightly surreal experience. But this same Dolby Atmos support is also available on the previous Surface Laptop 4 model. Finally, Microsoft is refreshing its Surface Studio 2, with a new 2+ model. It's largely the same outside, although Microsoft, has added free USBC fundable four ports at the rear. The 28 inch display still supports pin input and touch, but it won't come cheap. With prices starting at $4,299, you've really got to want that movie display. Inside the internals have also been improved, but as we're about to enter Intel's 13th gen era, the Surface Studio 2+, will only ship with 11th gen Core I7 H-Series chips. Microsoft squeezes these chips into a tiny case below the display, so it says it went for reliability, rather than the latest CPUs. Frankly, it's disappointing, but thankfully, there's now a RT Expert360 inside with 6G of VRAM. That's enough to power plenty of games at 1080p, and it should also be a step up for creative tasks. I'd still like to have seen something slightly more powerful though. I've been asking for Surface to take gaming seriously for years, and I think the Studio 2+, probably comes as close as we're gonna get. But will Microsoft ever do a Surface gaming PC? - Here's what I'll say. Our gaming customers on Windows are amazing. In like what we want now from the Windows side is to make sure we're doing things like direct storage, or DX12, or just the elements that you just built the gaming right there. So, we're now in this world of how do we make sure we're giving the gamers their best experience? So, I don't think it's about Surface hardware actually. We have incredible OEMs right now that what they're delivering, whether it's Legion, or Omen, or Alienware like Razor, these products are phenomenal. - So, don't expect a Surface Gaming Laptop anytime soon. What I thought was most interesting about meeting with Panos and the Surface team this week, is a revelation that Microsoft started Surface not just to take on the iPad with its own tablet. Panos tells me it began with a vision for a tablet, a laptop, and a PC to uplift the entire ecosystem. The Surface team only shipped the original Surface 2-in-1 device a decade ago. Now, 10 years later, we've got the Surface Pro 9, the Surface Laptop 5, and the Surface Studio 2+, that really mark the success that Microsoft has had in building PCs. Microsoft seems confident that Surface could be around for another decade and well beyond. - It's just the first 10, Tom? - Yeah. - It's just the first 10. I mean, there's another 10, right behind it, and I think the first 10 years have been pretty amazing, but at the same time, we're just starting on the journey for what's tomorrow? - None of this success was guaranteed, and it was a huge risk that involved Microsoft engineers working in rooms without windows, but the result has changed the PC and Laptop space forever. Everyone has copied the Surface Pro, and it's become the default 2-in-1 device now. Thanks to Microsoft giving away its reference designs, pen technology and much more. I thought I'd end my time by asking paddles about the haters. There were many people doubting, Microsoft would even keep Surface around, and hey, there was Apple there saying, that the Surface of Windows 8, were merging a fridge and toaster, but now it's a $2 billion business. - What do you say to all those sort of haters, shall we say? About the doubted in the product. It look's great isn't it. - Yeah. - What do you say to that? - I think, I say thank you. That's what I say, like thank you. Thank you for motivating us and thank you for being on this journey now. I think, don't get me wrong, like there's a little bit, I know there's a team here that has a bit of a chip I'm sure, but it gets buried very quickly, in the what's next? - Yeah. 'Cause you believed in it, right? - Yeah, we always believed, and we still do. - Both the Surface Pro 9, and Surface Laptop 5, start shipping on October 25th, and a price starting at $999. And then there's a Surface Studio 2+, which also start shipping October 25th, but the prices there start at $4,299. So, definitely get saving if you want that PC. Thanks for watching, and we will see you in the next one.",
    "transcript_keywords": [
        "Surface Pro",
        "Surface",
        "Surface Laptop",
        "Surface Studio",
        "Microsoft",
        "Surface Gaming Laptop",
        "Laptop",
        "Surface Pro device",
        "Pro",
        "entire Surface Pro",
        "previous Surface Laptop",
        "Microsoft Surface",
        "Microsoft Surface roll",
        "Microsoft started Surface",
        "Surface gaming",
        "Windows",
        "Surface team",
        "Studio",
        "Dolby Atmos",
        "years"
    ],
    "transcript_entity_values": [
        "another decade",
        "USBC",
        "the Surface of Windows 8",
        "Windows",
        "Razor",
        "AMD",
        "three",
        "Laptop 4",
        "the last 10 years",
        "2",
        "Surface Laptop 5",
        "the Surface Pro",
        "5",
        "CPU",
        "Sandstone",
        "the Surface Pro 9",
        "28 inch",
        "6",
        "the Surface Studio 2+",
        "Anechoic Chamber",
        "Core I5",
        "the Surface Pro 9",
        "Microsoft",
        "Surface Laptop 4",
        "a decade ago",
        "11th",
        "10 years later",
        "this week",
        "GPU",
        "the next 10 years",
        "15 inch",
        "$2 billion",
        "Tom",
        "Alcantara",
        "Panos Panay",
        "Liberty",
        "iPad",
        "Surface 2-in-1",
        "Qualcomm",
        "12",
        "13.5 inch",
        "Dolby",
        "this year",
        "the Surface Pro X",
        "Redmond",
        "The Surface Pro 9",
        "later this month",
        "10 years",
        "first",
        "Matt Black",
        "Surface Studio 2",
        "the Surface Laptop",
        "10",
        "4,299",
        "Surface",
        "Invideo, Discord, Zoom",
        "Washington",
        "Windows",
        "AI",
        "Thunderbolt",
        "October 25th",
        "Windows on Arm",
        "1080p",
        "Legion",
        "Intel",
        "13th gen era",
        "tomorrow",
        "Panos",
        "Dolby Atmos",
        "Platinum Alcantara",
        "one",
        "Apple",
        "four",
        "999",
        "year",
        "the first 10 years",
        "years",
        "Alienware",
        "two",
        "this fall",
        "Dolby Atmos",
        "Surface Pro",
        "10 year anniversary"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "EVENT",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "LAW",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "LAW",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "LAW",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "GPE",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "DATE"
    ]
}