{
    "id": "Nht_Wa3M088",
    "title": "Why Xbox Series X games don't look BETTER",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-05-07T21:47:17Z",
    "video_url": "https://www.youtube.com/watch?v=Nht_Wa3M088",
    "category": "Science & Technology",
    "tags": [
        "xbox series x",
        "series x",
        "xbox",
        "xbox series x gameplay",
        "gameplay",
        "xbox series x game",
        "xbox series x games",
        "game",
        "games",
        "ps5",
        "playstation 5",
        "microsoft",
        "sony",
        "console",
        "game console",
        "halo",
        "playstation",
        "ps",
        "assassins creed valhalla",
        "the test drivers",
        "test drivers",
        "this is",
        "austin evans"
    ],
    "views": 1129336,
    "likes": 36762,
    "comments_count": 7065,
    "description": "Now that we've seen Xbox Series X gameplay what do YOU think? Our hands on with Series X:  I tried to build an Xbox Series X:   My new podcast The Test Drivers!  Our second channel This Is!  I stream on Twitch now!  We have a new Discord:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/7Fjn4GRw8qE",
        "https://youtu.be/GaeCarDBMQY",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "https://discord.gg/sQ8Sw27",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- So we've just gotten our first real look at Xbox Series X gameplay, and I think the sentiment might be slightly underwhelming. So there were certainly some games that were standouts. Of course we have \"Assassin's Creed: Game of Thrones\", I mean \"Assassin's Creed Valhalla\". But really the one that jumped out to me was \"Medium\", which I think they're really good job of not really leaning heavily into the very, sort of, neon baked aesthetic of like some future world, but instead, something which actually looks really grounded in realism, especially with the ray tracing put on top. But this, of course, brings up a very big question. With so many of these games being cross-gen, where you buy it an Xbox One, you get it on Series X, we shouldn't expect the envelope to be pushed that much, but why exactly there's so many of these games look very, very similar to stuff we could have seen last generation? I remember the first time that I saw 3D graphics running on the original PlayStation. It was mind-blowing to me to see the realistic looking cars in \"Gran Turismo\" or the enormously detailed worlds of \"Final Fantasy\", in a console that I could actually play at home. My next console was the Nintendo GameCube, back when Nintendo really were on top of their game from a technical perspective, You look at games like \"Smash Bros. Melee\" or even something like \"Pokemon Colosseum\", which I played a ton of, and it was a huge step forward. And then when I got an Xbox 360, that was almost the biggest leap yet. Now, at the time, I actually was still using a CRT, but even so when I first put in that Mirror's Edge DVD and got to really experience not only the incredibly clean art style but that incredible world, I was like, \"Wow, where are we gonna go next?\" But the problem has been that we really haven't gone that far over the last 15 years. With the Xbox One and PS4, while graphics looked better, when you consider there was seven years between the 360 and the Xbox One, the actual improvement in graphics wasn't that impressive. Certainly nowhere near what we had seen with previous generations of consoles, and now that we're going into the Xbox Series X and PS5, there's a real question here of why don't these games look better? Why don't we see these massive leaps like we used to going from PS1 to PS2? Well, a little bit complicated, but I don't think that we're seeing those massive gains anytime soon. The game has completely shifted, these days. So take the original PlayStation 1, for example. This launch with a 33 megahertz processor and three megabytes of RAM, which was impressive enough to actually run full 3D games, for maybe not the first time, but it was certainly a huge step forward. But a mere six years later, we got the PlayStation 2, and it was an order of magnitude more powerful. We went from 33 megahertz processor to almost 300 megahertz. We went from three megabytes of memory to over 30 megabytes. And that was only in six years, right? It's crazy to think about just how fast advancements really happened in those early days of 3D. Another six years later and we got the fat boy himself, the PlayStation 3. This two things up to a whole nother level, as we went from a single-core 300 megahertz processor to a seven core SPU, essentially seven 3.2 gigahertz CPU cores, and that was backed up by another almost tenfold improvement in memory. And when you look at games, like the \"Last of Us\" toward the end of the PlayStation 3's lifecycle, it is clear that this was a quantum leap over the PlayStation 2. Not an actual quantum leap. That's probably a little bit harder. But it was a huge, huge improvement. So when 2013 rolls around and we get our hands on the PlayStation 4, what we see is a very different Sony and a very different gaming industry as a whole. So you see Sony is that company, sort of had this weird mentality where they were very focused on this thing called making a profit, and that is something that the PlayStation 3 famously did not do for a very long time. So the issue of the PS3 was that even though it was wildly expensive out of the gate, it was like five, 600 bucks. But, even at that exorbitant price tag, Sony were still probably losing money with every single console they sold. Now, ultimately, toward the end of the generation they had been able to work out the kinks, drop a lot of the features that were in the launch PS3, and they're able to make at least some of their money back. But the problem was that while the console was very much ahead of its time, making money, pretty important. So when it came time to bring out the PlayStation 4, it was more conservative in pretty much every single aspect. So, yes, it did have eight times as much memory, which is pretty much on par with what we had seen jumping from previous generations, but everything else was a little bit more subdued. So, yes, five times the graphics horsepower sounds great, except that in previous generations we were getting like 10 times the graphics performance, going from generation to generation. And one of the real downsides with PlayStation 4, was it is downright an anemic CPU, right? So, I actually went to a GDC, one year, or maybe it's PlayStation Experience, but I went to a Naughty Dog talk right after they had ported \"The Last of Us\" from PS3 to PS4, and they had, in some of their simulations, seen that the PlayStation 4 CPU was actually less powerful than what they had been working with on the PlayStation 3. Now, generally speaking, I think that might be slightly overblown, but there is absolutely no doubt that this was not the huge 10 times leap in performance that we had seeing with previous generations, and sadly, it seems like that trend is just going to continue going into the next generation. Seven years after the Xbox One and PS4, how does this new generation stack up? So I'm gonna take the Xbox Series X here, for this example, because it is clearly the more powerful of the next generation consoles. And there's some good and some bad. So first of all, on the processor side, we see a four times improvement to performance, nice. Maybe not quite as big as we used to see in those early days, but obviously an improvement is an improvement. And the graphics are also a nice step forward. We're getting eight times the teraflop number, and realistically, probably, even a little bit more than that compared to the Xbox One. Now, the memory side isn't quite as impressive, we're only getting double the memory, but still, there's a lot of good stuff here. But the issue is that while the Xbox One and PS4 were built to a spec that was essentially equivalent to a low to mid-range game PC from 2013, these new consoles are basically at the bleeding edge of PC hardware, which means that they've pretty much gone as far as they can. Short of any of the crazy stuff that Sony used to do with the PS3 or something, we've hit sort of peak console in that then it really is almost hit parody with the PlayStation. PlayStation? PC. PC and PlayStation, not the same thing. But, of course, the PS4 and Xbox One are not the only consoles of this generation, as they both got mid-cycle refreshes. The PlayStation 4 Pro, as well as the Xbox One X, and when you compare those to the new consoles, it's not quite as impressive of a jump. So the Xbox One X was famously much, much more powerful than the original Xbox One, which means that if you get all the number soup out of your head, the Series X only has a little bit over double the graphics horsepower and only about 1/3 more memory. Now, there's certainly other advantages in the SSD and the CPU, but we're not on par to see any kind of 10x performance across the board with these new consoles whatsoever. They're very good, but they're just simply limits that we're starting to hit that consoles really have not hit in 20 years. For a very, very long time, Moore's law meant that we really did get doubling of transistors and therefore performance, every couple years or so. Now that continued for a very long time. But these days, it is really tough to get those doublings and four times and 10 times performance like we used to, right? The best way to think about it is like this. After 20, 25 years of console development in 3D space, if there's an easy way to get more performance, someone's definitely done it, right now, right? All the easy stuffs off the board, which means that for every couple of percentage of performance improvement on the memory, on the processor, on the graphics, all that stuff takes an enormous amount of work, which just means that we don't see those 10x performance increases at all anymore. Which is fine, bit it just means that our expectations of what consoles are going from one generation to the next have to shift with that. Another element as to why games that are on the next generation don't look better is actually a little bit of a simpler one. At a certain point when games start looking pretty real it takes a whole lot more power to bring it from pretty real, to really, really real, right? There's a very steep curve. There's a law of diminishing returns. It's tough to basically make something go from good to great. It's easy to go from bad to okay to good, but that next level is way more difficult. So let's take an example of what was something really impressive to me back in the day, which was \"Ryse: Son of Rome\", a 2013 Xbox One launch title. This game looked incredible, it really did show the performance of the next-generation consoles. And while, yes, it might not be quite as nice looking as a later generation launch, but it still was a major step forward. However, what do you do to make this look better? Sure you can add more detail to the faces and sort of build bigger worlds, there are things you can do, but it's sort of just taking that good and just making it a little bit better. It doesn't really sort of bridge the gap in a way that previous generation consoles were able to do. If you look at something like \"GTAV\", going from last generation to current generation, what you saw was that, yes, the resolutions went up, the performance went up, you got more graphical options, but at their core, these games were very similar. They were just enhanced versions. And that really goes for, I would say, the vast majority of Xbox One and PS4 games compared to their previous generation counterparts. You can make bigger worlds with more memory, you can make more detailed character models, but there's nothing that really separates these two consoles beyond just the mere four times more performance or five times more performance that the hardware is capable of. Now that's fine when obviously that's all you have to work with. But there is an ace in the hole for these next-generation consoles, that does go beyond just a few more vertexes and pixels, and that is ray tracing. I'm sure you're sick of the RTX On memes at this point, but there really is something to be said for ray tracing being the next level in adding realism to games, and especially considering that not only do the PS5 and Xbox Series X have ray tracing standard, but PCs are very quickly adopting it. It's already on most NVIDIA GPUs at this point, AMD has already committed to adding it. And the thing is, while, yes, ray tracing is in its infancy right now. A lot of the demos being kind of cool on PCs but not making a big difference. When the install base is there, when pretty much every gamer has access to ray tracing and developers have more time to really fully integrate it into their games, we're gonna see some major advantages. Now you might be asking, what exactly is ray tracing all about? So previously, with, pretty much, games since the dawn of 3D gaming, lights were fairly static, right? Sure, they might be able to move a little bit, but they were always faked. It wasn't actually the way the light works in real life. However, ray tracing does its best to emulate the way that real light actually bounces and scatters. I mean, there are some great versions of \"Minecraft\" with RTX, not only the PC but also on the Xbox side, that show this off nicely, and that likes to bounce multiple times just as it would in real life. And this, I think, is a real key to making these next-generation games not just look like a HD HD remaster of a PS3 or PS4 game, but something which is legitimately different. Now, of course, we're going to take advantage of the more powerful graphics and processors to build bigger worlds. The SSDs are going to help not only with load times but also helping enable some of these huge worlds. But that's not really going to push us that much farther, right? The ability to do ray tracing, and of course, some of the other stuff that comes with it, right? So I know Sony is obviously taking advantage of their Tempest Engine to sort of not really do ray tracing for audio but to give you a much more visual experience. When you can completely transform the look, the feel and the sound of a game to be much more realistic than sort of the approximations that we've had up until this point to give you a graphic experience that looks kind of decent, that's really where we're going to see these major advantages. Now are we there yet, right now? No. But these new consoles and PCs in general, right now, are laying the groundwork for over the next couple years what we're going to see are some legitimately revolutionary gaming experiences. If you go all the way back to 2005 and 2006, to the dawn of HD gaming as we know it with the 360 in the PS3, they pushed forward on a lot of aspects, and one of which was to push more resolution, right? Those consoles were capable of gaming at 720p without many compromises, obviously depending on the game. Now we jumped up to PS4 and Xbox One, really the target was bigger worlds at 1080p. it wasn't massively pushing the envelope, it was just nicer looking games, more detail, but ultimately it was about pushing that resolution to 1080p. Now, when we got the mid-cycle upgrades, so the PS4 Pro as well as the Xbox One X, those consoles were pretty much entirely designed around taking those 1080p games that you were running on your current console and playing them at 1440p or 4K, right? More pixels was good. But the thing is, while, yes, the PlayStation five and Xbox Series X can technically run 8K, but we're not going to see that and I don't think any games are really going to be targeting 8K. I mean, no one really has 8K TVs to begin with. Where these new consoles are putting their extra power is not only with stuff like ray tracing but also by giving you better pixels. So this is something that I feel like most people are probably familiar with from the camera space, right? So, yes, your iPhone that you buy today, that it might cost you $1,500, has a 12-megapixel camera, whereas, for that same money, there's a Samsung Galaxy S20 Ultra with 100 plus megapixels. Now that, on paper, sounds like of course you want the more megapixels. But the thing, is just more of something doesn't necessarily make a difference, especially when you consider that if you don't have an 8K TV or 16K TV you can even tell the difference. And even if you did, as you're sitting six-inches away from the screen you might not be even able to tell. Which is where focusing on higher quality pixels, focusing on new features like ray tracing, focusing on more detailed worlds and honestly just bigger and more expansive worlds, is really the key here. We're not chasing the resolution war anymore, we're chasing the ability to give you a more immersive experience across the controller, across the sound, across the visuals. You get the idea, right? There are a lot of things that have been laid here that I think over the next few years are really going to prove to be hugely instrumental in bringing gaming from the uncanny valley to maybe not fully realistic, but much, much closer. So, no, we will probably never again see the days of 10 times the performance across the board in just a few short years between generations. What we can get, for just a few hundred dollars, is a box that gives you an incredible level of fidelity with decades worth of experience and work put into it, that completely blows away anything I could have ever imagined when I first got my original PlayStation.",
    "transcript_keywords": [
        "Xbox",
        "Xbox Series",
        "games",
        "PlayStation",
        "Assassin Creed Valhalla",
        "consoles",
        "ray tracing",
        "generation",
        "times",
        "performance",
        "Assassin Creed",
        "years",
        "time",
        "ray",
        "tracing",
        "Game",
        "Series",
        "console",
        "real",
        "graphics"
    ],
    "transcript_entity_values": [
        "only about 1/3",
        "PlayStation five",
        "SPU",
        "K TV",
        "first",
        "Minecraft",
        "two",
        "four",
        "12-megapixel",
        "Moore",
        "one",
        "the PS4 Pro",
        "a ton",
        "Gran Turismo",
        "20 years",
        "Assassin's Creed Valhalla",
        "almost 300 megahertz",
        "PlayStation 4 Pro",
        "seven 3.2 gigahertz CPU cores",
        "decades",
        "2005",
        "Assassin's Creed: Game of Thrones",
        "the PlayStation 4",
        "Pokemon Colosseum",
        "PlayStation 4 CPU",
        "the Xbox Series X and PS5",
        "the PlayStation 2",
        "300 megahertz",
        "PlayStation",
        "the day",
        "33 megahertz",
        "2006",
        "Xbox One",
        "Samsung Galaxy S20 Ultra",
        "these days",
        "PlayStation 3",
        "six years later",
        "16",
        "SSD",
        "1080p",
        "1,500",
        "seven years",
        "seven",
        "PlayStation 2",
        "today",
        "just a few short years",
        "PS5",
        "The Last of Us",
        "six-inches",
        "Smash Bros. Melee",
        "the PlayStation 3",
        "600 bucks",
        "AMD",
        "Series X",
        "CRT",
        "10",
        "eight",
        "Another six years later",
        "100 plus megapixels",
        "Final Fantasy",
        "Xbox",
        "three megabytes",
        "Sony",
        "GTAV",
        "the Xbox Series X",
        "every couple years or so",
        "Xbox Series X",
        "the last 15 years",
        "1080p",
        "CPU",
        "PlayStation 1",
        "the days",
        "those early days",
        "Seven years",
        "20, 25 years",
        "PlayStation 4",
        "Mirror's Edge",
        "RAM",
        "Nintendo",
        "six years",
        "the next couple years",
        "Xbox 360",
        "PS4",
        "4",
        "8",
        "the next few years",
        "one year",
        "Medium",
        "PS3",
        "five",
        "PlayStation 3's",
        "2013",
        "1440p",
        "GDC",
        "Ryse: Son of Rome",
        "Tempest Engine",
        "NVIDIA"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "WORK_OF_ART",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "WORK_OF_ART",
        "PRODUCT",
        "EVENT",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "WORK_OF_ART",
        "PRODUCT",
        "MONEY",
        "ORG",
        "LOC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "EVENT",
        "DATE",
        "PRODUCT",
        "DATE",
        "TIME",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "TIME",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG"
    ]
}