{
    "id": "NI0YUEtYfro",
    "title": "What's on my OLD iPhones?",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-01-30T02:22:26Z",
    "video_url": "https://www.youtube.com/watch?v=NI0YUEtYfro",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "lastpass",
        "lastpass login",
        "password",
        "password generator",
        "lastpass chrome",
        "lastpass download",
        "lastpass premium",
        "random password generator",
        "generate password",
        "password manager",
        "recover",
        "lastpas",
        "laspass",
        "lastpass premium features",
        "delete account mobogram",
        "lastpass.com",
        "how secure is my password",
        "last password"
    ],
    "views": 927186,
    "likes": 23022,
    "comments_count": 1729,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Today I'm going to be reacting to some of the content that's on my old phones. I went and got a couple of them out. One of them, I'm so upset, I cannot for the life of me remember the passcode. I keep trying, but it says my phone is disabled for 1,167 minutes. disabled for 1,167 minutes. These kind of feel like a time capsule. It's like a portion of my life just frozen in phone form. in phone form. A huge thank you to LastPass for sponsoring a portion of this video. And this could not be a better video to integrate LastPass into because, one of the things, if you guys don't know, I always have a lot of different phones. They even have this great feature where if you don't want to come up with a new unique password, they'll make one for you! So with LastPass, it will remember all of my passwords. I'm able to quickly login to new phones, and devices, and computers. It works on IOS, Android, Windows, Mac. I love LastPass, I've been using it for the past couple of years. It's made it a lot quicker and seamless when I get a new phone to review. I just login to LastPass and I instantly have access to all of my accounts. So thank you LastPass for sponsoring a portion of this video. Now I cannot wait to get into seeing what's on my old phones. So these are the main phones we're going to be checking out today. This is the iPhone 6, which came out in September of 2014. It's been my dream to be first in line for any Apple store event. This is it, like, we're here, we're first. (crowd cheering) This is the iPhone 6S which came out in 2015. It's the day of the iPhone 6S launch, and puppy is not coming with us. You don't want to come. Well there's nobody else here, surprise. The middle of nowhere in North Carolina. First in line for the phone. Is anybody here yet? Open up, I'm ready. One of the newest features is the force touch, so you'll be able to \"peek in\" as they said. They have definitely seen some better days. I almost always have had cases on my phones. So they're not in too bad of a condition. So let's first boot up the iPhone 6 and see what's on it. I did turn this on already, and I didn't want to connect it to wifi because I didn't want all of these apps to update. This is the first page of my iPhone 6. This is the first page of my iPhone 6. The craziest part is seeing Vine on here. So just going through I feel like I have a lot of the same sort of apps. It's just funny to see like the old logos, because obviously in 2014, a lot has changed since then. I guess this would be the end of 2015 then when I got rid of this phone to upgrade to the iPhone 6S. The Aging Booth. The Ugly Booth. I used to go to Hot 8 Yoga all the time. Looks like I was still potentially, maybe using Canon. Ship, that was a really great shipping app. But they went under. Clash of Clans, oh my god I used to be obsessed. What I really want to see though is what are some of the old photos that I have on my phone. The last few photos that I have on here are me buying this phone. are me buying this phone. I was in North Carolina, I remember I was on family vacation. So there it is. Me buying the new phone. And there's my little Matty! Oh my gosh, he looks like such a rat dog. This was us in the car on the drive to North Carolina. I was measuring Matty to see what his size was in relation to the Apple watch. in relation to the Apple watch. What a perfect doggy! Here's Matty playing Nintendo. (video playing) (laughing) He had such bad allergies. He used to just like lick and itch. Poor little buddy. (dog barking) That's Matty hiding under my drone. So it looks like in 2015 I was using Sony, but I was also still using Canon. Little Matty the DJ! Little Matty the DJ! He's perfect. He's perfect! I was making his meal. Are you hungry? (dog barks) Oh my god! Are you hungry? He's so small. I just can't believe all these cute little pictures of my dog. (video playing) One of the craziest things though, is going back to this older phone. Which is still a really good phone. I know a lot of people that still have iPhone 6's as their main phone. Like, it's running very well. I kind of almost miss this fingerprint reader. It's just really, really nice. I wonder what some of my last email was. Doesn't look like anything that interesting. A bunch of spam. I only have like three pages of apps. What the heck? What is Peach? Well it's not loading. I think it was another social network. I don't know what happened to it. Oh my gosh this is my old setup, in the white room. My office was so different then. Oh my gosh! It's me and Ro and Cookie! Of course more Matty content. What an angel. What an angel! Look at that little face! Let's see what some of the last things were that Jenna and I were talking about. How's Matty? Do you need food? I plan on coming back but this vid took forever. He is good. We just napped. Nothing at all has changed in our conversations at all. This is the original iPhone. Look at this thing. It's so beautiful. This is the one that I bought on Ebay. So this one actually does turn on. If it is charged. (music playing) This looks pretty legit. (upbeat music plays) This over here is was my original first iPhone. I feel like this phone, I've got a lot of history. This was what like made my first viral video. You're beautiful, and you're perfect. Don't let anyone tell you that you're not. And then I saw that I did an iPhone original versus iPhone 11 video. It was really fun because we went out and took some photos. I'd say video but this didn't shoot video yet. So we basically just did a photo comparison of the original iPhone to the iPhone 11. It was really pretty shocking how good these photos still were, considering how long ago this phone was released. 2007. Here it is. The original iPhone with one page of apps. The original iPhone with one page of apps. (laughs) Let's take a little picture, shall we? What an incredible device. Like, this changed everything. This is another one that I got. This one wasn't mine. I did have this phone. This is one that I did an unboxing of on my channel. Man, I wish that this other phone would start up. It's not letting me do anything. iPhone is disabled. Try again in 1,170 minutes. Try again in 1,170 minutes. Alright. I guess I'll keep trying. See you in five years. Well thank you guys for watching this video. This was really fun, just to go back and see what apps were on my phone. And also I'm so happy that I found this one phone, because I never had my stuff backed up to the cloud back then. If you guys have a dog, or a pet, then you totally get it. Anyway, thank you again for watching. If you guys like this video make sure you give it a thumbs up. Be sure to subscribe for more of my videos. Ane let me know if there's anything else you guys would like to see me make here on my channel. I will see you guys in the next video. Bye. (closing music)",
    "transcript_keywords": [
        "phone",
        "iPhone",
        "Matty",
        "video",
        "phones",
        "North Carolina",
        "original iPhone",
        "LastPass",
        "lot",
        "apps",
        "original",
        "guys",
        "Carolina",
        "North",
        "Apple",
        "phone form",
        "page",
        "minutes",
        "photos",
        "perfect"
    ],
    "transcript_entity_values": [
        "iPhone 11",
        "2014",
        "Matty",
        "one",
        "1,167 minutes",
        "Apple",
        "Hot 8 Yoga",
        "2007",
        "Sony",
        "iPhone",
        "three",
        "2015",
        "the past couple of years",
        "the day",
        "North Carolina",
        "The Aging Booth",
        "1,170 minutes",
        "Nintendo",
        "the end of 2015",
        "today",
        "The Ugly Booth",
        "Ro and Cookie",
        "Android",
        "five years",
        "first",
        "some better days",
        "LastPass",
        "Windows, Mac",
        "First",
        "Vine",
        "Jenna",
        "IOS",
        "Canon",
        "September of 2014",
        "Ebay",
        "One"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "DATE",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "GPE",
        "PERSON",
        "TIME",
        "PERSON",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL"
    ]
}