{
    "id": "nidnvlt6lzw",
    "title": "This Laptop is so HARD to use! - Wingdings Tuxedo Laptop",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-07-16T21:47:02Z",
    "video_url": "https://www.youtube.com/watch?v=nidnvlt6lzw",
    "category": "Science & Technology",
    "tags": [
        "Linux",
        "Laptop",
        "Linus",
        "Windings",
        "Font",
        "Typing",
        "Hard",
        "Reading",
        "Translation",
        "Understanding",
        "Confused",
        "Difficult",
        "Unboxing",
        "Typeface"
    ],
    "views": 1404932,
    "likes": 49762,
    "comments_count": 3125,
    "description": "Get 20% OFF + Free Shipping at Manscaped.com with code CIRCUIT at   I can't believe I spent over an hour trying to use this laptop, but hey at least it has Linux!  Check out the Tuxedo Laptop at  Check out the Wikipedia Page on Wingdings at   Buy Intel 10th Gen Laptops On Amazon(PAID LINK):  On NewEgg (PAID LINK):  On BHPhoto (PAID LINK):     Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://mnscpd.com/TECH",
        "https://lmg.gg/uH6xY",
        "https://en.wikipedia.org/wiki/Wingdings",
        "https://geni.us/sHrRJH",
        "https://geni.us/YFCvY6v",
        "https://geni.us/qcpract",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- On the surface there is nothing remarkable looking about this laptop. This has to be the most generic, \"yep, we re-branded a CLEVO laptop\" packaging that I have ever seen in my life but I guarantee you that on the inside, ho ho ho, there is nothing generic about this machine. First of all, it's from Tuxedo Computers. See, you can see they got their little silk screened logo on there, which means it is designed to work out of the box perfectly with Linux. Number two is (items falling on table) all this stuff. That's just cardboard. Ah, okay, you get a Tuxedo Computers notepad. You get another Tuxedo Computers notepad, just in case you don't have a computer to do things digitally but you do 'cause you just bought one, whatever, small details. Pelle, help me out here. Solenserior Tuxedo system meets... (speaking in foreign language) - [Pelle] Nope, I'm not getting anything. - You got nothing? All right, I tried. Oh if you have ordered a Tuxedo system with full encryption or if you subsequently set up encryption via web FAI, please note the following information, default password et cetera, oh, very cool. Hey, encryption, security, that's good shiz. Okay, you get a postcard in German and no other, there's no... What is the intention here? Okay, Pelle help me out here, what do we got here? (speaking in foreign language) Okay, I think this says start with Tux. Why is so much of the packaging in German? I guess these guys are German, so that's cool. We also get a Tuxedo Computers USB key. This has their web FAI information on it presumably. I don't know, I'm gonna plug this in later. Cleaning cloth and look at that, all the little parts that you're gonna need if you wanna do some little upgradey grades, like add another SETA drive or whatever the case may be. Ooh and a licensed copy of Windows. (beep) So do you guys know what's up with this thing? Pelle, do you have any idea? - [Pelle] No. - Okay. Actually before I reveal this, I need to reveal our sponsor for today: Manscaped. Manscaped's new Weed Whacker nose and ear hair trimmer is here. It features the same proprietary skin safe technology to help reduce nicks and tugs and a premium 9000 RPM motor powering its 360 degree rotary dual blade system. It trims your nose and trims your ears, well not your nose and ears but the hair in your nose and your ears, which is good, instead of being very painful and you can get 20% off and free shipping on the performance package when you use code CIRCUIT at the link down below. Hold on, let me get this all, let me get this all centered in frame and beautiful. (dramatic music) Okay, the big reveal's coming, are you ready? One of the services Tuxedo Computer offers is fully custom engraving on your key caps. So I was like, for a lark (laughing) we should do one where it's Wingdings. This is it. To my knowledge, the world's only Wingdings laptop. Yes my friends, you too can type your messages in flag, hand wavey, smiley face, scissors, pointing left, thumbs down, because you think about it, the cool keyboard snob thing to do, right? Is to have blank key caps, so that anyone who doesn't touch type can't use your computer. This is next level, right? Like, this isn't just withholding information, this is providing like, (bleep) information that is the opposite of helpful. I love it so much! Let's fire it up. Okay, oh, initial boot. So it goes straight into, oh okay. Look at this! So we've got Windows Boot Manager and Ubuntu, they've got it set up to dual boot for me right out of the box. Okay, they know their audience. The craziest thing about this is that I actually don't know if I'm gonna be able to use it. Even numbers have Wingdings, so it's like, what is that? A couple of diskettes? No it's a... So one to nine is file folder, insert file, document, several documents, full like, cabinet, hourglass, keyboard, mouse and in terms of built quality, I would say this is pretty standard kind of CLEVO fare. So it's not remarkable but it's also not bad. Plastic bottom, metal top surfaces. In terms of IO, we're looking at, got a couple USB type As over on the left here, I like that. Separate headphone and microphone jacks, the combo ones are great but having a separate one can also be nice, depending on what kind of configuration you have, saves you having to use a dongle if you happen to have one that is not a four pole. Got your barrel DCN, no USB type C charging as far as I can tell. You know what, I guess we can test it because there is a USB type C port over here. We've also got another USB type A, mini display port, HDMI, DSD slash MMC? I think they mean SD card? Okay, yeah, SD card slot and I love these, one of these nice little hinged ethernet jacks 'cause the machine overall is actually quite slim, too slim to have an ethernet jack on it but they still managed to get that hardwired network connectivity in there, which personally, I really appreciate because while Wi-Fi is fast enough for the vast majority of what I would do these days on a computer, it's more about the stability of a hard line connection when you wanna do something like, for example, livestream. I would never try to livestream on Wi-Fi, if I can at all avoid it. Oh wow, okay, that's a long thing to type. I'm sure there's a faster way to do this but I wanna show off my Wingdings typing skills. Pseudo add apt repository PPA colon OBS project slash OBS dash studio... (beep) What's tripping me out about finding this Thunderbolt option in here is that the only type C port on the device is labeled, here you can actually see it pretty clearly here, is labeled USB 3.1. So that's not Thunderbolt. (beep) This is just a hub from Anker. It's got Thunderbolt. What does, why, if you're gonna go to the effort of silk screening a label on the side of the thing, you'd think you'd silk screen it like, the best thing that it is. (beep) I still wanna know what kind of hardware it's running. Details? Oh look at that, that was easy. So we've got a 10th gen core i7, 16 gigs of RAM. What are Mesa Intel UHD graphics? See me control C-ing right there without seeing? Oh okay, maybe this is just Intel's Linux driver name? UHD graphics 620 though. Okay, so why don't we grab Steam? All right, how to pseudo get Steam? I wanna do it through command line, that's the cool way. I'm actually having fun, I can see why people get into this. It's like re-learning how to do things you already knew how to do but like, it's fun. You've held broken packages. Well they weren't broken when I was still holding them. Ha ha, get it? So now Steam can grab the additional packages. Oh what? No, I have broken packages again! Pins potentially out of date, rebuilding. I'm really not doing myself any favors here by changing up my operating system and my keyboard at the same time. How to fix pseudo 1N-S, lib 64, oops. X86 underscore, oh shoot, where's my underscore at? There it is. So I missed the shift, I hate the short shift. There's a lot of updates that are going on up in here but hey, at least we're not gonna have to reboot when we're done. Hey, take that, Windows plebs, bam! While we wait around for these updates, I wanna do something that I'm sure you guys have all been waiting for since this video started. (beep) I didn't realize that LibreOffice does not have Wingdings pre-installed. Oh bloody hell, so now we need to go on a journey to Mount Doom to figure out how to install a font on Linux. Can I, okay, is this just gonna install? Come on, Linux! I just double click a font, it just installs, right? Oh my God, what is the Boomerbuggy X? I'm clicking an ad for the first time in my life. It's a mobility scooter but you don't get rained on. Wow! Wingdings is now installed. I'm sure it's not gonna show up here, I'm probably gonna have to restart the program, okay. Okay, here it is! We are typing in the native tongue of my forefathers, hold on a second, okay! All right I'ma text you a coded message. I'ma type y'all a coded message. Okay, here we go. Boom! (upbeat electronic music) What do you think it says? Come on, wild guess. (upbeat electronic music) - [Brandon] Ittstore.com. - Oh yeah! What's the bomb? Oh the bomb! M is the bomb. So dot com is like, flag. (impersonating explosion) Overall thoughts, obviously, kitting out your laptop with a Wingdings keyboard is not the best idea, especially if you're learning an operating system that you don't use very often but I just thought, I just wanted to highlight this 'cause I thought it was so cool that Tuxedo Computers, whose computers you don't have to use on Linux if you don't want to, offers this service where you can have quite literally anything you want printed on the legend of the keyboard. So I thought that was really neat and I wanted to do an unboxing and I just wanted to have a Wingdings laptop. Now that I have it, I'm not sure why I wanted it but hey, there it is. So don't miss this and more amazing Short Circuits by making sure you're subscribed to this channel. Thanks to Tuxedo Computers, by the way, for sending this over.",
    "transcript_keywords": [
        "Tuxedo Computers",
        "Tuxedo Computers USB",
        "Tuxedo Computers notepad",
        "Tuxedo",
        "USB type",
        "Computers",
        "Wingdings",
        "services Tuxedo Computer",
        "Tuxedo Computer offers",
        "type",
        "Tuxedo system",
        "USB",
        "Computers USB key",
        "computer",
        "Linux",
        "thing",
        "Computers USB",
        "Computers notepad",
        "Wingdings laptop",
        "system"
    ],
    "transcript_entity_values": [
        "Brandon] Ittstore.com",
        "Anker",
        "Thunderbolt",
        "Wi-Fi",
        "Tuxedo Computer",
        "10th",
        "Intel",
        "Linux",
        "One",
        "RAM",
        "20%",
        "USB",
        "DSD",
        "LibreOffice",
        "Tuxedo Computers",
        "OBS",
        "620",
        "Windows",
        "nine",
        "second",
        "IO",
        "Pelle",
        "1N",
        "Wingdings",
        "Linux",
        "64",
        "9000",
        "Windows Boot",
        "Mount Doom",
        "Mesa Intel",
        "the Boomerbuggy X",
        "Wi-Fi",
        "DCN",
        "Linux",
        "UHD",
        "first",
        "these days",
        "HDMI",
        "16",
        "Weed Whacker",
        "German",
        "four",
        "FAI",
        "ho ho ho",
        "Manscaped",
        "one to",
        "Number two",
        "SETA",
        "SD",
        "First",
        "today",
        "CLEVO"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "LOC",
        "ORG",
        "FAC",
        "LOC",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "NORP",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG"
    ]
}