{
    "id": "nIk8YnCGckw",
    "title": "$549 AirPods Max Impressions: Has Apple Lost Their Minds?",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2020-12-08T22:08:04Z",
    "video_url": "https://www.youtube.com/watch?v=nIk8YnCGckw",
    "category": "Science & Technology",
    "tags": [
        "AirPods",
        "AirPods max",
        "AirPods Pro",
        "AirPods Pro max",
        "AirPods max review",
        "AirPods max unboxing",
        "AirPods max hands on",
        "apple",
        "AirPods Pro vs AirPods max",
        "AirPods max headphones",
        "AirPods vs Sony",
        "Apple vs Sony",
        "tld",
        "Jonathan Morrison"
    ],
    "views": 357356,
    "likes": 12382,
    "comments_count": 2228,
    "description": "AirPods Max Impressions! $549. Has Apple lost their minds? Or will these be great? Subscribe for my AirPods Max hands on review!  Apple M1 music review impressions!   we made a song out of the MagSafe sound :o  Shot on iPhone 12 Pro - HDR Dolby Vision Footage + channel!   14 inch MacBook Pro?   Giving the iPhone 11 to strangers  -   Follow me (if ya want) -",
    "description_links": [
        "https://youtu.be/VB78wqZHclE",
        "https://youtu.be/mugdii5TJpI",
        "https://youtu.be/zAS8AOoiWug",
        "https://youtu.be/1VV8e3BOOzc",
        "https://www.youtube.com/watch?v=AbuDm0C4vt0",
        "http://www.twitter.com/tldtoday",
        "http://www.instagram.com/tldtoday"
    ],
    "transcript": "- That's a boss ass move, just getting a pair of AirPods Max and engraving it with a single emoji. What is that emoji? (suspenseful music) So AirPods max or PS5, but like for real though. (bullet sounds) - Mother are you out of your damn mind? - Yo, Jonathan here, Apple did a thing today. They definitely did a thing. AirPods Max are official. We've heard the rumors. We've seen the concepts, the renders some thought we'd see them this year, some thought they'd be delayed until March of 2021. Tim Cook was like, \"Nah, let's drop them today.\" So there's a ton to break down here. And there actually is quite a bit of cool tech packed inside the AirPods Max, that name just isn't rolling off the tongue yet. I want to say AirPods pro max, that feels and sounds better. Definitely make sure to subscribe if haven't, and if you want to get these in and drop any comments you guys want to see in the full review. But first we got to talk about that price because Twitter was not having it. (somber music) Bro was like F you take, leaf blower. Is it a leaf blower or a vacuum? Damn he's got the dice and out. Obviously we can't truly assess something until we get it in and try it out. But I think most of us were expecting a price tag of 399 even 499 would have hurt a lot less, but I think for 549 bucks those Sony XM4's are looking real good right now. There's a couple of things going on but I think one, we kind of got to look at this as a completely new product line for Apple. Yes, they've done Homepods, yes, they've done AirPods. But in terms of an over ear noise canceling headphones this is brand new. With that said, I wouldn't say that it's a first gen product because Apple is really good at developing tech, putting RND into one product, and then implementing that into another. I think a really good example of that was the original HomePod, right? When that came out, the general consensus was, this sounds incredible for what it is, but it's overpriced and it's a mediocre voice assistant. But because of that, the end result was a dedicated audio team and RND that would eventually trickle its way down to things like AirPods, AirPods pro, now the HomePod mini, even things like spatial audio in the iPhone. And now it's kind of coming full circle where we're not only seeing HomePod tech, but even things like the digital crown, which comes from the Apple watch. So these are a pair of Beyer dynamic DT 990 Pros. You need a decent deck or interface to get the most out of them. And there's going to be an argument, \"Well, why would you pay 549 bucks when you can get something like this?\" I don't think in terms of audio quality or fidelity it's not going to outclass a pair of headphones like this but again, this is something completely different. Apple's goal here is not to compete with Sony or Bose clearly it's with that price. But I think there's two things going on here. One, Apple probably knew they weren't going to manufacture a ton of these. So they figure as a business, whose goal is to make money, What they're going to miss out on quantity. they'll make up on margin. Second, you can almost guarantee a huge chunk of this price is because of the RND that went into these headphones. Things like the magnetic ear cuffs or the design or the material or things like the accelerometer which plays a huge role in spatial audio. So the reality is most people won't and shouldn't buy these and the people who are they already pre-ordered them before this video went live. The closest thing I could relate these to is what Dolby tried to do with their dimension headphones, which really didn't take off. But I think in terms of what Apple has done with audio there's a much better chance here. The other thing to think about is there's more than likely going to be at some point next year, a pair of AirPods pro max, which will hopefully drive the price down on these and lead to a mid range product somewhere hopefully between the AirPods pro in that 399 price tag, or hopefully even less. What is cool with these though is unlike regular AirPods or AirPods pro, which have come in one in one color only, we actually get five different options here. So we have silver, space gray which I think might look the best, blue, pink and then finally green. I actually pre-ordered a pair of sky blue to be exact because something about blue just always calls me. But I'm curious to hear if you are interested in these, what is your favorite color? So now that we kind of got that out of the way again there is a lot of cool tech packed inside these starting with the H1 chips. So we're going to get that quick instant pairing like we're used to... Pew news update, Peuds is coming out of retirement for this stuff... It's actually two H1 chips, one in each ear cups. So I'm curious to see what that translates to as far as performance and audio quality. Everything that we've seen on AirPods pro, so active noise cancellation, transparency mode, adaptive IQ but on a bigger scale. What is new though and something we don't scan AirPods pro is spatial audio with head tracking. So again, a lot of the costs here is from tech like this and the RND. So the end result is a handful of sensors that effectively react and adapt to your head movement. And if you tried spatial audio, it is no joke. Sounds are not only coming from left or right, but from the front, from behind and as you move your head it's almost like you're immersed in that space. How I assume it would work, especially if there is spatial audio tech in iPhones and iPads is pretend you're watching a movie and the dialogue is directly in front of you. If you were to move your head the sound of that dialogue would then shift over. So that's where I think there's some next level stuff going on on here. There's a total of nine, nine microphones inside these. So that's going to help with things like the noise cancellation or transparency mode or even the adaptive EEQ. So again, there's a lot going on here. Couple other things to consider, is the actual headphones themselves as the main body that houses the ear cups are made at a brushed aluminum, so you have going over something that's plastic. The actual ear cups themselves attach magnetically which is neat. And then there's some smaller intricacies like the left and right texts being woven into the enters of the ear cups. What I'm especially curious about is how comfortable these are going to be. They seem adjustable, they seem flexible, but that top part which has this mesh lining, that's going to be the make or break thing here as far as comfort. Also, there is a corresponding case that comes with the AirPods max, which is definitely a choice as far as how they look, that's definitely up for debate. But the good part is, is it comes with a case as far as the overall design on these, I'm not sure if I'm on board or off board. I will definitely kind of withhold my final opinion until I get them in, but they are polarizing no doubt. It's almost very cyber truck or pro display XDR where it's futuristic and it's either going to age well or awful but it's interesting that they don't look like any other pair of headphones, maybe a little Bowers and Wilkins, but at the very least, there's no Apple logo. So Apple wants you to know these are AirPods without that Apple logo. That aside though, AirPods Max's are a thing. Again, definitely stay tuned for my full video review on those coming very soon and quick update all the M1 coverage and goodness and madness is coming up next. Spent too much time with the M1 MacBook, air MacBook pro and Mac mini got everything you could possibly need to know on those coming soon. And if you want a sneak peek, got some impressions over on Jonathan and friends, which I will link to down below. Thank you guys so much",
    "transcript_keywords": [
        "AirPods Max",
        "AirPods",
        "AirPods pro",
        "AirPods pro max",
        "Apple",
        "Max",
        "things",
        "pro",
        "audio",
        "pro max",
        "thing",
        "boss ass move",
        "spatial audio",
        "boss ass",
        "single emoji",
        "pair",
        "price",
        "tech",
        "headphones",
        "RND"
    ],
    "transcript_entity_values": [
        "Bose",
        "two",
        "iPhone",
        "AirPods Max",
        "One",
        "five",
        "Twitter",
        "Sony XM4's",
        "H1",
        "RND",
        "AirPods pro max",
        "AirPods, AirPods pro",
        "M1 MacBook",
        "Beyer",
        "iPhones",
        "399",
        "Apple",
        "iPads",
        "499",
        "549 bucks",
        "a ton",
        "AirPods",
        "Wilkins",
        "Peuds",
        "Second",
        "the AirPods Max",
        "M1",
        "nine",
        "Homepods",
        "next year",
        "first",
        "Bowers",
        "one",
        "Tim Cook",
        "Pew news",
        "MacBook pro",
        "HomePod",
        "today",
        "March of 2021",
        "AirPods Max",
        "this year",
        "AirPods or AirPods pro",
        "DT 990 Pros",
        "AirPods max",
        "Sony",
        "Dolby",
        "PS5",
        "Jonathan",
        "Mac"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG"
    ]
}