{
    "id": "NL0XaZx9Aco",
    "title": "Every M2 is friggin fast, but this one is best for you",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-02-06T15:00:27Z",
    "video_url": "https://www.youtube.com/watch?v=NL0XaZx9Aco",
    "category": "Science & Technology",
    "tags": [
        "apple",
        "m2",
        "m2 macbook",
        "macbook pro",
        "macbook mini",
        "14 inch macbook",
        "macbook",
        "best macbook",
        "apple buying guide",
        "laptop buying guide",
        "best laptop",
        "which macbook to buy",
        "best laptop 2023",
        "new apple laptop",
        "new macbook",
        "apple 2023",
        "apple event 2023",
        "iphone",
        "new iphone",
        "apple watch",
        "m2 macbok review",
        "m2 macbook review 2023",
        "the verge",
        "tech",
        "apple event",
        "apple watch ultra",
        "apple silicon"
    ],
    "views": 136748,
    "likes": 3299,
    "comments_count": 213,
    "description": "With Apple's recent release of the new 14-inch MacBook Pro, 16-inch MacBook Pro, and Mac Mini, there are now four different MacBooks and a desktop that you can buy with M2 chips inside. That's great for Apple fans, but can also be... intimidating. Becca Farsace, Monica Chin, and Chris Welch break down each of these M2 devices, what it's good at, and who it's for. Help us help you. #Apple #M2 #MacBook   0:00 - Intro 0:20 - MacBook Air & 13\" MacBook Pro 5:06 - Mac Mini 8:46 - 14\" & 16\" MacBook Pro 14:24 - Still confused? Here is the TLDR on M2 chips  Read more:   You can download the wallpapers we used in this video here:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "http://bit.ly/3Ybf6oq",
        "http://bit.ly/3DLJbCy",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- Apple's M2 chip is now in five devices, ranging from the $600 Mac mini all the way up to the most specked out $6,500 MacBook Pro. There's a device for just about anyone with a fast and efficient M2 chip. So we created these mini reviews for every M2 device so that you can make the best decision about what is best for you if it's time to upgrade. (gentle music) - The base M2 chip is Apple's everyone chip. That doesn't mean it's the best chip for everyone, but it is very likely the best chip for most people. If you are seeking a computer for hanging out on Reddit, or binging Netflix, or sending emails, or calling your parents on Zoom, the M2 chip is fast, it's long lasting, and it's more than enough for you. Apple makes two laptops with the M2 chip inside. There's the M2 MacBook Pro, and there's the M2 MacBook Air. Now, the words Air and Pro might imply that the Pro is more expensive, but these devices are actually priced pretty similarly. So the MacBook Air starts at $1,199 and the MacBook Pro starts at $1,299 but they both max out at $2,499. The difference between these laptops that does matter the most in my life is size. So the Air is 0.17 inches thinner and 0.3 pounds lighter than the Pro. And while those numbers may seem small they make a big difference. I've brought the Air on vacations, I've brought it to conferences, I bring it to and from the office all the time, and no matter how packed my bag is, I know I'll always be able to fit it in. That is a huge benefit that I hadn't anticipated. The other major benefit is that the Air has a gorgeous display. It's taller than the Pro, there's a lot more room, and it's not that the Pro's display is bad, but the Air's is better, you'll notice. There are a couple other differences on the outside. So the Pro has this touchscreen touch bar, and the Air doesn't have that touch bar but does have this notch up top where the camera lives. The Air has a slightly better webcam. The Air supports MagSafe charging, and the Air has some additional color options. Basically, the M2 Air has a lot of little benefits that add up to make it a really solid computer. Now, you may be wondering, with all these great things about the M2 MacBook Air, is there any reason at all to buy the M2 MacBook Pro? The answer is maybe, because the M2 MacBook Pro has one key feature that the M2 MacBook Air does not have, a fan. While the M2 MacBook Pro and the M2 MacBook Air have the same performance inside, the Pro can use its fan to keep that chip from overheating without bumping its performance down. And this showed in benchmarks, the Pro is able to loops Cinebench over and over with no decrease in performance, while the Air's performance started dropping shortly into its Cinebench run. I have to emphasize, I've been using the M2 MacBook Air for three months as my primary computer, and I have never once been in a scenario where the the lack of a fan was a problem. I am a tab hoarder. I will regularly run 20 to 30 tabs on this machine, with Zoom calls over top and music or YouTube running in the background. It has never felt slow. It's a non-issue, but there are some of you for whom that fan might make a difference. For example, gamers. I do not regularly game on a MacBook. I do not recommend that you buy a MacBook primarily to game, but if you've decided that you want to do that, you will have a better time on the Pro. We saw 20 to 30% higher frame rates on the Pro, and the Air gets hot after running games for a while. I have never seen the M2 MacBook Pro get hot, like ever, in my life. Similarly, if you are frequently working with video, graphics, virtualization, VFX, Xcode, workloads that are CPU and GPU heavy, and you are doing that stuff all day, you will see longer battery life, less heat, and noticeably better performance on the Pro. With all that said, if you work in one of these fields and you can save up for the 14-inch or 16-inch MacBook Pro with M2 Pro and M2 Max, I would recommend you do that instead. I know these are expensive, but they are significantly faster than the M2 in these programs and you will save yourself quite a bit of time. The other benefit these larger devices will have, for creative professionals in particular, is their port selection because not only do they have an HDMI and an extra USB-C port, but they have an SD card slot. Neither M2 model has that, but assuming you're not looking for a giant screen or a super hardcore processor, either the M2 MacBook Air is the best choice for you, whether you'll be using it at home, in the office, or both. I was skeptical at first that something this thin and light would be able to handle my giant spreadsheets, and 400-page documents, and Photoshopping, and all the Chrome tabs that I use for work. If you're worried about that, don't be. Just get the Air. It's worked perfectly for me and paying for a more expensive MacBook would be throwing my money down the drain. - Apple's Mac mini is the most affordable way to own a Mac, buy a long shot. Take everything we just talked about from the M2's, the speed, performance, and put all of it in a tiny desktop computer and this is what you get. But like always with the mini and as Steve Jobs once said, it's BYODKM. - Bring your own display, keyboard, and mouse, okay. (audience laughing) - All you get in the box is the actual computer and a power cord, but that all starts at $599. Now compare that to the M1 iMac, which costs at least $1,299 and you start to see the Mac mini's appeal. It's much cheaper, and in a way, way more versatile. You don't have to stick with some builtin screen that you can't ever change or upgrade. Instead, you can go as big or as wide as you want. There are two processor choices with the new Mac mini. One is the the regular M2 chip that we covered before. This is perfect if all you want is an everyday Mac around the house somewhere. It's more than capable of all the basics, whether that's productivity work, or web browsing, video calls, and light photo and video editing, and so on. Okay, so I know I just mentioned how this model starts at $599 and as tempting as that is, you really shouldn't get that one because it only has eight gigs of RAM and even with Apple's more efficient unified memory, you're gonna push up against that ceiling pretty quick. You want this machine to last, so I'd at least spend $799 on the mini with 16 gigs of RAM, plus if you want more storage, that's $999 and up. As you can see, the price does go up pretty fast but even if you get a 1TB SSD, you're still spending less than you would on an iMac and you get faster performance on top of it. The new Mac mini also now has Wi-Fi 6E and Bluetooth 5.3. So it's got all the newest things on a spec sheet But for those who need more power, there's an even faster M2 Pro version of the Mac mini. That's what I've been testing. It's got 12 CPU cores and 19 GPU cores. And folks, this thing is an absolute screamer. In our benchmarks, it outperforms the M1 Max in single core and multi-core tests. It's not quite up to par with the Max on the GPU side, but those extra cores still give you a big boost. What you get here is plenty for creative workflows. I spent a ton of time editing large 40 megapixel raw photos from a few events I shot last year and the mini tore through that work without breaking a sweat. 4K video editing should also be no problem. Spending more on the M2 Pro model, gets you a total of four Thunderbolt 4 ports. The standard M2 mini just has two, and you get a better HDMI 2.1 port. That lets you connect up to three external displays, or one giant 8K display if that's your thing. Plus the M2 Pro Mac mini also supports refresh rates up to 240 hertz. That's far beyond what Apple's own Studio Display is capable of, but again, it can get pricey in a hurry. This model we tested cost $1,800, which is not cheap, and the mini still has things about its overall design that I don't love. Apple, why are all the ports still on the back of the mini? Nobody wants to have to reach around just to plug in headphones or a USB drive. Let's add some to the front next time. And unlike the MacBook Pro's and Mac Studio, there's no SD card reader on the Mac mini, but as I said before, the MAC mini is all about versatility. It can be as modest or as mighty as you want based on which specs you choose. If you want a casual Mac for everyday computing, the M2 chip is more than enough. But if your job demands more power, go M2 Pro. But I think the Mac Studio is overkill for a lot of people, and that's where the Mac mini really fills that slot between the iMac and the Mac Studio very nicely. But it is always gonna live on your desk. - Inside the 14 and 16 inch MacBook Pro is the most powerful M2 chip money can buy for now, and it is for folks who need absolutely the most powerful and portable machines. I've been using a 16-inch MacBook Pro, that cost a whopping $4,299, to make this video. And you can spec this machine all the way up with 96 gigabytes of memory and eight terabytes of storage for $6,499. It is fast, it is efficient, it is incredibly expensive, and even most creative professionals probably don't need this much power. There's physically no way to tell the difference between a 14 or 16 M1 or M2 MacBook Pro. There are still three Thunderbolt 4 ports, and HDMI port that is now 2.1, an SD card slot, a headphone jack, a MagSafe port, and a notch. The notch continues to not bother me, and more importantly, this design has eliminated my need for dongles, so long as you live the USB-C lifestyle. And if you are coming from a MacBook Pro that has a touch bar, the port selection on this computer is almost more exciting than the boost in performance. The battery life will also be surprising. Last week I was editing in Premiere every afternoon for about four hours, and I was able to consistently go two days without needing a charge. The 16-inch MacBook Pro, it has an 100 watt-hour battery, the largest you can bring on a plane coupled with a very efficient chip that adds up to noticeably long battery life. The 14-inch model has a 70 watt-hour battery which I haven't been able to test because we don't have a review unit of that in, but it is safe to assume that you'll get all day battery life with that model as well. Now, choosing between the 14 and 16-inch models is hard for another reason. I've spent a lot of time with an M1 14 inch MacBook Pro, and while it's incredibly portable, it's only 3.5 pounds it is incredibly straining on the eyes especially if you use programs with lots of windows like DaVinci, Premiere, After Effects. The 16-inch model is a lot easier on the eyes, but it is a total tank. It is 4.7 pounds and when I put it in my laptop sleeve, well, it barely fits for starters. And then I also usually have a camera or a tripod in my bag as well. All that weight adds up and you feel it on your back. Let's talk about chips. The M2 Max chip is fast and what I notice the most in my workflow is the lack of time I have to get distracted between renders or exports. I have this terrible habit, when something is is rendering or whatnot, I'll like go do something else, 'cause, you know, there's always a slack, there's always a text message, there's always a Google search to embark on. With the M2 Max chip, there was less time in those moments to go get distracted and because of this it made me a faster editor. But even with that glowing endorsement, I don't think everybody needs the M2 Max chip, and then that's mostly because it's incredibly expensive. But that's also because the M2 Pro chip is really fast as well. I have a 16-inch MacBook Pro here with an M2 Pro chip. It's best export time in a 3:41, 4K video with B-roll, essential graphics, and color from Adobe Premiere was 2:03. M2 Max did that same export in 1:15, it's fast. And an M1 Pro did it in 2:41. Yes, the M2 Max is much faster, but both M2 chips are faster than the M1 Pro, and both are that much faster than our $16,599 Mac Pro. On the CPU bound synthetic benchmarks we ran, the M2 Max and the M2 Pro scored very closely. But on Geekbench compute, the M2 Max displayed over a 40% increase over the M2 Pro. Though it is worth noting that neither system is coming close to the M1 Ultra that is in the Max Studio. If you are gonna be taxing the GPU, that means that you are gaming or doing any heavy graphical work, then you're gonna want the M2 Max, but that also means that you gotta fork up the cash to pay for it. Now, there's one more thing about the MacBook Pros that I don't think enough people talk about, and it's not necessarily new, but it's important to me. The mics, I think that they are super clear and crisp and well I'm talking to you now on them. I actually use them to record VO for videos quite often and I think that they're even better than the mics on the 2nd Gen AirPod Pros, which, yes, I wear these headphones on almost every call, but I usually end up switching the microphones to the mics on the M2 MacBook Pro, and yes, the M1 MacBook Pro, the 14 and 16-inch, also had great mics. So Pro Tip. Okay, MacBook Pro 14-inch, 16-inch, M2 Pro, M2 Max, what the heck do you buy? Well, first and foremost if you are coming from an M1 MacBook Pro, I don't think you need to upgrade. These speeds aren't that much faster. But for everyone else, first and foremost, think about how much you're gonna use this device as a standalone laptop, that's not hooked up to an external monitor. If the answer to that is a lot, you definitely want the 16-inch. The 14-inch screen is too small, especially if you are someone who uses DaVinci, Premiere or any program that has a lot of windows or tools. So then the chip, M2 Max or M2 Pro, like we said, if you are someone who is going to use the GPU heavily. You're doing 3D work, any sort of animation, I don't know, like editing 100 megapixel photos, but even then I think the Pro would be fine. Or like editing 8K content or even 4K content over maybe an hour long, you're gonna want the M2 Max. Or, if you have $3,100, just get the M2 Max. I mean, it is an incredible chip, but for everybody else who maybe doesn't have that much money or their workloads aren't that heavy, I think that the M2 Pro will feel plenty fast, and you'll be really surprised with how great the battery life is as well. - If you're still wondering what to buy, my advice is to look at the M2 lineup and think how much power do you need? For a lot of you, the answer to that question is easy. On one end of the spectrum is someone like me, who uses their computer almost entirely for typing in Google Docs and watching YouTube videos. If I want something I can carry around, the only computer on this list that I should be buying is the MacBook Air. If I don't need something portable and I already have a monitor, a mouse, keyboard, and a desk set up ready to go, I should buy the Mac mini with the M2 chip. On the other end of the spectrum is someone like Becca. Becca shoots and edits video for a living. Becca is working in Premiere Pro every day. It would not make any sense for Becca to buy the 13-inch Air or the 13- inch Pro. And of course, this category isn't limited to the video production field. There are software engineers, audio engineers, people in all kinds of intensive fields who will greatly benefit from the increased power of these chips, and you know who you are if that's you. If they want something they can carry around, these people should be buying the 14 or the 16-inch MacBook Pro. If they want something that can live on their desk, they should buy the Mac mini with M2 Pro, or the Mac Studio because the M1 Ultra is really good. I just can't go a whole video without mentioning the Mac Studio, I apologize. And then there are the people in the middle, people who are mostly using these laptops for everyday home and office tasks, but every so often are running games, or editing raw photos of their kids, or producing their band's music, or working on personal coding projects. You all probably know you don't need the M2 Max, and you probably want something more powerful than the Air, but maybe you're wondering if you should buy the 13-inch MacBook Pro or whether you should splurge on one of the bigger M2 models. My general rule of thumb is, if you don't know for sure that you need the M2 Pro, you are probably fine with the regular M2 chip. The 13-inch MacBook Pro can handle a lot of these tasks, and while it won't do that as lightning fast as the M2 Pro and M2 Max will, it's a chip that will get the job done. But if you'll have lots of money to spend, there are other reasons that you might prefer the 14-inch MacBook Pro with M2 Pro. It has extra ports including that crucial SD slot. It has MagSafe charging, it has better speakers, it has physical function keys, and it has a much better looking display. And I can't benchmark those benefits. You are the one who has to decide how much money those benefits are worth. - All of the wallpapers that are on the laptops in this video are are verge wallpapers. You can download them in a link down below. I hope you well, buds. Good luck picking an M2. I am also struggling, so I hope this helped, be well.",
    "transcript_keywords": [
        "MacBook Pro",
        "Pro",
        "MacBook Air",
        "Mac mini",
        "Air",
        "Pro Mac mini",
        "MacBook",
        "Mac",
        "max",
        "Mac Studio",
        "inch MacBook Pro",
        "chip",
        "Pro Mac",
        "Mac Pro",
        "Pro chip",
        "MacBook Pro starts",
        "mini",
        "Max chip",
        "MacBook Air starts",
        "Apple Mac mini"
    ],
    "transcript_entity_values": [
        "M2",
        "2:03",
        "M2 MacBook Pro",
        "2.1",
        "Premiere Pro",
        "three",
        "Reddit",
        "Adobe Premiere",
        "Air",
        "2:41",
        "40 megapixel",
        "CPU",
        "20 to 30",
        "Steve Jobs",
        "the M1 Ultra",
        "MacBook Pro",
        "Chrome",
        "One",
        "an hour",
        "1:15",
        "2nd",
        "3,100",
        "96 gigabytes",
        "YouTube",
        "799",
        "the MacBook Pro's",
        "RAM",
        "M1 MacBook Pro",
        "400",
        "M1",
        "at least $1,299",
        "the M2 Pro",
        "599",
        "the M2 Pro",
        "the Mac Studio",
        "the Max Studio",
        "GPU",
        "iMac",
        "M1 Max",
        "the M1 Pro",
        "M2",
        "M2 Max",
        "USB",
        "1,800",
        "Google",
        "1,299",
        "70 watt-hour",
        "MacBook Pro",
        "three months",
        "every afternoon",
        "VFX",
        "YouTube",
        "600",
        "40%",
        "12",
        "0.3 pounds",
        "DaVinci",
        "MacBook",
        "Last week",
        "Netflix",
        "Pro Mac",
        "first",
        "the M2 Pro",
        "M2",
        "a ton",
        "two days",
        "4,299",
        "last year",
        "Premiere",
        "20 to 30%",
        "Xcode",
        "6,499",
        "14-inch",
        "M2",
        "Thunderbolt 4",
        "only 3.5 pounds",
        "16 inch",
        "up to three",
        "8",
        "Becca",
        "19",
        "1,199",
        "16-inch",
        "Studio Display",
        "6,500",
        "the M1 iMac",
        "4",
        "SD",
        "about four hours",
        "4.7 pounds",
        "five",
        "16 M1",
        "Zoom",
        "1",
        "Mac Studio",
        "one",
        "Mac",
        "100 watt-hour",
        "Apple",
        "0.17 inches",
        "four",
        "MAC",
        "999",
        "Cinebench",
        "M2 Pro",
        "14",
        "Mac Pro",
        "eight",
        "Geekbench",
        "2,499",
        "the MacBook Pro",
        "M2 Pro",
        "a MacBook Pro",
        "MacBook",
        "Wi-Fi 6E",
        "240 hertz",
        "DaVinci",
        "the M2 Air",
        "100 megapixel",
        "two",
        "all day",
        "MagSafe",
        "MacBook Air",
        "the M2 Pro",
        "16,599",
        "13-inch",
        "Google Docs",
        "M2 Max",
        "Max",
        "Mac",
        "the MacBook Pros",
        "the MacBook Air",
        "16",
        "3:41"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "TIME",
        "TIME",
        "ORDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "PRODUCT",
        "MONEY",
        "FAC",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "PRODUCT",
        "LAW",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "QUANTITY",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "PERSON",
        "MONEY",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "FAC",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "NORP",
        "QUANTITY",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "NORP",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "LOC",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "EVENT",
        "MONEY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ]
}