{
    "id": "NM3u-0eKVFE",
    "title": "Don't Buy The Wrong Gaming Laptop CPU in 2018!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-02-18T21:59:13Z",
    "video_url": "https://www.youtube.com/watch?v=NM3u-0eKVFE",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "kaby lake G",
        "vega GL",
        "vega GH",
        "benchmark",
        "ryzen mobile",
        "ryzen APU",
        "coffee lake",
        "kaby lake R",
        "MX150",
        "GTX 1070",
        "GTX 1080",
        "GTX 1060",
        "6 core",
        "8 core",
        "4 core",
        "gaming laptop",
        "best gaming laptop",
        "cheapest gaming laptop",
        "best laptop for students"
    ],
    "views": 499428,
    "likes": 13222,
    "comments_count": 1035,
    "description": "With Coffee Lake, Kaby Lake-G, and Ryzen mobile APU available this year, this is a guide to help you purchase the best gaming laptop CPU for your needs. AMD Vega APU Laptop -   Coffee Lake H is going to be a BEAST with 6 core 12 thread CPUs. Kaby Lake - G brings an impressive CPU and GPU combination to the market. Those devices can be 17mm thin with low weight while having good performance for 1080p gaming. AMD Ryzen Mobile is a low wattage (15w) APU that can still deliver solid gaming performance in thin and light ultrabooks.  Music Credits: Fili - Sunday Vibes  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2C7LGBb",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey ! How's it going ? Dave 2D here. So traditionally when it comes to buying gaming laptops, The CPU is a pretty easy decision. I mean There's just not that many choices to choose from. So, last year It was the i7-7700HQ, and if you couldn't afford that You'd get the i5, and the year before that it was the 6700HQ, And it's just always been really few options which was a kind of a good thing, 'Cause it just made the process a lot easier, But right now, in 2018, for whatever reason, There's so many good CPU options for gaming laptops. We already have the 8th-gen U processors, the Kaby Lake Rs, And those are quad-core 15-watt packages, And if you pair that up with an MX 150, which a lot of laptops do, You actually get a pretty respectable gaming laptop. It's not like a hardcore gaming laptop, But you can play a lot of games with really respectable frame rates. And as long as the laptop is cooled properly, which not every company does, But if it is, you're good to go for, like, light to moderate gaming. Now the H processors coming out are more exciting. The i9 is gonna be nutty, but the two more common ones are these two : The i7 and the i5. That i7 looks ripe. 6 cores, strong turbo, And it's in the same 45-watt package as the previous generation, So you don't have to have any kind of crazy thermal solution. And we've seen some preliminary benchmarks pop up, and it really does look promising. Compared to the current i7-7700HQ, It's like 30 - 35 percent better for multi-core benchmarks. Now, in the past, A lot of developers haven't put in the time to optimize their games for just more than 4 CPU cores, But because of Ryzen last year, and just the state of the industry now, Where core count is kind of creeping up slowly, I think companies will put in the time. So there's another batch of CPUs made by Intel, the Kaby Lake G, And there's five of them. These are kind of a collab between Intel and AMD. So they're running Intel CPUs with an AMD Vega GPU. There's two different GPUs : The Vega MGL and the Vega MGH. GH being the stronger, more powerful one of the two, The performance is good, like, really good for the wattage. And I think that's its biggest advantage, efficiency. It's energy efficient, It's space efficient because they're packing the CPU the GPU and the vram all into one chip. It's still not an APU, it's a CPU and a dedicated GPU, But it's just packaged into one thing, So you can build something that's smaller thinner and lighter Than a laptop that uses a discrete GPU from Nvidia. Now, the preliminary benchmarks have been pretty interesting, We're looking at something between a 1050 and a 1050 Ti for the GL, And then for the GH, the better one, the performance is gonna be something around a GTX 1060. And they'll both be quite energy efficient, But the big disadvantage I see with these is pricing. The GH model in particular is gonna start at like 1,200 bucks, maybe even more, And you're getting... Remember, GTX 1060 performance, for $1,200. And I feel like at that price point, you can get something that's like a 1070 from Nvidia. It's gonna be thicker, it's gonna be louder, it's gonna be bigger, but You're gonna get better performance for your money. Um...The last ones are the AMD chips. So they have eight-core and six-core Ryzen laptops that are using these desktop CPUs, Which are really powerful, but I mean they're desktop CPUs, So that doesn't really count in this conversation. They're also just stupidly expensive. The ones that are most interesting to me are there new Ryzen Mobile APUs, And their integrated GPUs on these things are so much better than the integrated Intel GPUs Like the HD 630, or even the UHD 630, It's just... miles ahead of the Intel integrated GPUs. It benchmarks well, but the games are just so poorly optimized, With these drivers that just looks like a crappy card. If they can fix those drivers - and they will, But if they can fix it quickly enough, It'll be a strong competitor for casual gaming. And if you see what devices are putting these into, Like we're talking ultrabooks and just really thin devices, It's pretty cool, you can bring something like this to school to work, And just kind of kick it for some light gaming at home. So, this video has been filled with tons of, like, nerd numbers and stuff like that, I'm just gonna break it down really simple : Right now if you're looking for a CPU for a gaming laptop, There's obviously a lot of choices to choose from, It's obviously harder this year to choose one than last year. If you want something that's like the best of the best and you have the money, Then, the i7 and the i9 that's popping out from Intel soon will be a good bet, But if you have something like a smaller budget, And you're just looking for a thinner device That gets decent gaming performance, Take a look at the Kaby Lake G from intel. So these are the intel cpus combo'd with the AMD Vega GPUs, It's good performance, and you should comfortably break 60 frames per second for most games, And if you don't care too much about image quality or resolution, You can drop down to U processor paired up with the nvidia MX 150, But if you want something that's like really budget And you're looking for something that's like thin and light that doesn't cost too much, Those upcoming Ryzen Mobile APUs should be pretty good. Some of them are already out, is just that the drivers aren't great, And if you just give it some time from the flash out, I think they can be great for just the casual gamer, with a smaller budget. Okay, hope you guys enjoyed this video, Hope it clarified some things, Thumbs if you liked it, Subs if you loved it, See you guys next time.",
    "transcript_keywords": [
        "gaming laptop",
        "gaming",
        "AMD Vega GPU",
        "Intel",
        "Intel CPUs",
        "Kaby Lake",
        "CPU",
        "CPUs",
        "AMD Vega",
        "good",
        "GPUs",
        "Ryzen Mobile APUs",
        "laptop",
        "buying gaming laptops",
        "respectable gaming laptop",
        "Dave",
        "integrated Intel GPUs",
        "Intel integrated GPUs",
        "lot",
        "GPU"
    ],
    "transcript_entity_values": [
        "AMD Vega GPU",
        "six",
        "1060",
        "8th",
        "60",
        "Ryzen",
        "Dave",
        "miles",
        "AMD",
        "1070",
        "CPU",
        "GPU",
        "Ryzen Mobile",
        "i7-7700HQ",
        "30 - 35 percent",
        "one",
        "GH",
        "just more than 4",
        "this year",
        "nvidia",
        "45-watt",
        "150",
        "eight",
        "second",
        "AMD Vega",
        "the year before",
        "2018",
        "GTX",
        "the Kaby Lake G",
        "15-watt",
        "intel",
        "two",
        "6700HQ",
        "five",
        "the Kaby Lake G",
        "the Kaby Lake Rs",
        "1,200",
        "1050",
        "the Vega MGH",
        "GL",
        "Ryzen",
        "APU",
        "6",
        "Intel",
        "1,200 bucks",
        "Thumbs",
        "last year",
        "Nvidia",
        "MX"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "GPE",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "FAC",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "LOC",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "NORP",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "ORG",
        "PRODUCT"
    ]
}