{
    "id": "NMH3Fm8GHyk",
    "title": "The Best Sounding Smartphone Ever?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-07-27T16:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=NMH3Fm8GHyk",
    "category": "Science & Technology",
    "tags": [
        "zte axon 7",
        "axon 7",
        "zte",
        "axon",
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "axon 7 review",
        "axon 7 unboxing",
        "android",
        "google",
        "smartphone",
        "best",
        "apple",
        "iphone",
        "samsung",
        "phone",
        "2016",
        "android (operating system)",
        "vs",
        "video",
        "galaxy",
        "galaxy s7",
        "s7 edge",
        "apple inc. (publisher)",
        "galaxy s7 edge",
        "smartphone (video game platform)",
        "apple iphone 6s",
        "iphone 6",
        "futuristic",
        "zte axon 7 unboxing",
        "zte axon 7 camera test",
        "zte axon 7 speed test"
    ],
    "views": 3221019,
    "likes": 64870,
    "comments_count": 5965,
    "description": "ZTE Axon 7 -  Follow me on Twitter -  (   ) --- Today's Mystery Video -   This video features the new Axon 7 from ZTE. The Axon 7 puts an emphasis on audio with forward facing stereo speakers and an upgraded DAC / amp for your headphones.  From the manufacturer -  The ZTE Axon 7 is the one 'unlocked' smartphone that delivers the best acoustic experience unlike any other device in its category with its ground breaking High-fidelity audio experience along with its attention to design detail and performance of a high end smartphone that these discerning consumers have come to appreciate and expect.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://hubs.ly/H03s0960",
        "http://twitter.com/unboxtherapy",
        "https://youtu.be/3BKqnoRqQuU?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "So today we're checking out a new smartphone from ZTE, the Axon 7 I have checked out the previous version I get some audio testing because the.. audio performance is a big part of what ZTE is trying to do here with the Axon lineup. Special bonus they sent me two of them, they said, \"Hey, Lew check out the new Axon 7 but also give one away to a lucky viewer\", so I'll do that on twitter as I normally do. What is this phone all about it's kind of like it's like a budget version of a flagship phone. 400 bucks, the latest in terms of hardware internally and maybe a better audio performance than what you're getting in some flagships that's the angle here. This model has a dual-sim card slot.. Unboxing experience so far so good Look at that guy there, Oh, so it looks like I've got the gold model here aluminum on the back, a power brick, quick charge, the device features USB-C and.. quick charge a USB-C cable and then also a headset now the concept here again is to take advantage of this somewhat superior headphone amplifier digital-to-analog converter that exists inside of the Axon 7. This metallic finish to match the device,.. a screen protector Oh, look at that! It's a sim card tool fits into that unit and now you can put it on your key chain. Because you never have one of these when you need one. Micro USB to USB-C. A case! One of my pet peeves though, with a lot of smart phones out there is that you if you're not listening with headphones- *Protective cover removal sound* So nice.. More often than not you don't have forward firing speakers not the case here. Big speaker grills, stereo speakers facing you when you're watching it. Forward facing camera right in that location and see the fingerprint sensor lives in this location the mic as well as the USB-C connector Hello Axon *Singing the do do song* Adding various parts of my finger here. Let's go ahead and test his fingerprint scanner out. Ohhhohoh, Man these things are getting snappier.. Here we go Bingo! A fairly stream lined interface here. So you gotta 1440p display here AMOLED, I mean what what more do you want? Look at this.. this is the tray, expandable storage, sim card or dual sim How are you going to tell me that's a bad thing? You're the 264 gig man. Ain't nobody gonna hold you down oh no I got to keep it moving *Music playing from Axon 7* okay check this out Dolby Atmos, so this is like your ability to really configure the equalization and dynamics of the audio file you're working with I'm going to play the demo for movie.. WHOO! yeah *Rain audio from the phone* Volume leveler, dialogue enhancer, surround virtualizer and of course graphic equalizer these are all options built right in I'm gonna keep listening.. look how many versions of me exist there Wow how about that noise it makes when it caught focus. Boom! You wanna get a little more.. manual with it let's see what I do here so now I've got a level there shutter speed is selectable, ISO, exposure compensation, white balance, interval, shooting for time lapse, a manual focus control Holy smokes. Video is currently 1080p 30 FPS, H.264, but can go all the way up to 4k, 30 FPS, and the new H.265 supported What about that slow motion OHHHOHO yeah! That guy right there that's a package this whole deal it's a package for 400 man has the smartphone space got a lot more competitive how about ZTE putting it together?",
    "transcript_keywords": [
        "testing because the.",
        "Axon",
        "ZTE",
        "audio testing",
        "previous version",
        "audio",
        "USBC",
        "audio performance",
        "Axon lineup",
        "ZTE putting",
        "quick charge",
        "sim card",
        "card",
        "device features USBC",
        "Man",
        "phone",
        "Lew check",
        "the.",
        "sim",
        "today"
    ],
    "transcript_entity_values": [
        "Lew",
        "USB-C",
        "264",
        "FPS",
        "today",
        "Micro USB",
        "30",
        "Axon",
        "4k",
        "1080p 30",
        "two",
        "One",
        "ZTE",
        "Dolby Atmos",
        "ISO",
        "400 bucks",
        "400",
        "USB-C.",
        "one"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}