{
    "id": "nmYu7DZHYHU",
    "title": "I'd rather have NOTHING! - Unihertz Luna",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-04-15T20:01:00Z",
    "video_url": "https://www.youtube.com/watch?v=nmYu7DZHYHU",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "nothing",
        "phone",
        "unihertz",
        "luna",
        "cool",
        "led",
        "street",
        "gimmick",
        "budget",
        "affordable",
        "flagship"
    ],
    "views": 278292,
    "likes": 10100,
    "comments_count": 617,
    "description": "Check out the Vessi StormBurst and their other styles at   Use code SHORTCIRCUIT for 15% off your entire order and free shipping.  The Nothing Phone (1) was an amazing looking phone, but it had some quirks that prevented it from being an easy recommendation. Luckily (?) Unihertz is here with their Luna phone which is uhhhhh \"inspired\" by the Phone (1), but with a mid-range price tag and spec sheet. Will Bell be impressed or should you just tape RGB lights to your existing phone?  Buy a Nothing Phone (1):  Check out the OPPO Find N2 Flip on AliExpress:  Buy a Poco X5 Pro:  Buy a Google Pixel 6a:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 This phone looks familiar... 0:24 Unboxing 1:15 Design impressions 3:31 Sponsor - Vessi 4:01 Included case and fingerprint scanner speed test 4:51 Speaker/Display impressions and comparison 6:55 Gaming impressions and Labs' results 9:14 Trying out the Cameras 14:10 Trying out the rear LEDs 18:24 Setting up the Hot Keys 19:27 Pricing, competition, and overall thoughts 20:11 Outro",
    "description_links": [
        "http://vessi.com/ShortCircuit",
        "https://lmg.gg/r1j5r",
        "https://lmg.gg/67Xa1",
        "https://geni.us/WFUfvuG",
        "https://lmg.gg/bJw5V",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Wow, the Nothing Phone sure looks cool. It'd be a shame if someone just, I don't know, ripped it off completely. Today, we have the Unihertz Luna phone, which takes what you love most about the Nothing Phone, the transparentness and LEDs, and puts it in a budget case. But can it surpass the kind of middle of the road performance of the Nothing Phone and create something spectacular? Probably not, but let's find out. The box has the glyphs on it, which will be probably the patterns of the LEDs on the back of the phone. Luna on the side and some information on the back, but I don't want spoilers. Let's open it up and take a look at what's inside. Just a piece of paper and the SIM popper, which we'll take out, as we'll need later. All right, in the paperwork here, I can see we already don't need the SIM card because it does not have an SD card slot, but it does have a dual physical nano SIM slot. So if you travel a lot, that's definitely convenient, but losing the SD card slot, I mean, not great, especially because a lot of these budget phones do have that. Otherwise, nothing interesting. A lot of spoilers for what we're gonna see in here. We have the phone itself. Let's put it to the side and see what else is in the box here. For a charger, we have a 12 volt. It feels very cheap, like something you get at 7-Eleven, but I guess as long as it charges your phone, that's good. We also have a charging cable, which is an A to C. Nothing too crazy there. All right, first impression, just picking it up. I haven't even looked at it yet, this is heavy. It feels like a brick, which is surprising, because again, this is a more budget-oriented phone, and this is heavier than an iPhone. It's heavier than probably a folding phone, which is nuts. It comes with a case on it, which is interesting. I don't know what's wrong with the camera bump, but it looks a little odd. It's a little too low for me, maybe. I don't know what it is. It's small. There isn't a huge actual bump, but it's because the phone is really thick, really thick. If it's hard to tell, this is a headphone jack, and look how much space is around it. Yeah, it's quite thick. It's thicker than the Nothing Phone and the camera bump. It looks like a cheaper knockoff. It is just so small and in such a weird spot, but hey, it's something. It's a design choice, and maybe you like it. You like the look of the iPhone. It looks like a razor, like the iPhone does, or kind of a stovetop, as people call it, but just really small for some reason. On the front, we have the 6.8-inch Full HD Plus display. They don't say what refresh rate it is. We'll see when it turns on, but I'm assuming it's 60, because otherwise it would probably be gloating about it. On the right side of the phone here, we have the fingerprint scanner and volume rocker. Buttons feel kind of mushy. They feel a little close to the phone, when you turn it sideways here, you can see there's not a whole lot of lift off of the rest of the body, so it doesn't feel great. It doesn't feel awful, though. The power button being flush, I'm not a huge fan, though. On the top, we have a, you always make fun of me, but a mic hole. We've got the mic hole, the antenna lines. We have a headphone jack with ample space on either side, and we have an IR blaster. Great, prank your neighbors with it. On the left side of the phone, we have two hotkeys, so you can set that up to be whatever you want. I can see one being camera and the other being maybe your assistant, if you like that, but I don't know, Genshin Impact quick launch. And on the bottom, we have the speaker grill, USB-C charging, and the dual nano SIM card slot. Nothing too crazy on the body here. We can see there's a bit of a cutout for the front-facing camera there. Again, I cannot understate how heavy this is. Let's actually give it away to see just how heavy it is. Give it away. 300 grams, that is heavy. And again, for what isn't really super spectacular looking, like it's a plastic body for sure. Part of what could be making the phone heavier is it's 5,000 milliamp hour battery. Maybe that's part of it. Let's turn it on, see what it has for specs, and let's also tell you about our sponsor, Vessi. Thanks to Vessi for sponsoring today's video. Vessi claims their shoes are 100% waterproof. Their new Stormburst shoes combine the comfort of a sneaker with the grip and coverage of an outdoor boot. They said it was impossible. Vessi has added extra layering for added warmth, as well as extra grip to prevent you from slipping and sliding in unfavorable weather conditions. The Stormbursts are feature packed and will make great gifts with the unpredictable spring weather coming up. Check out the Vessi Stormburst and other styles at Vessi.com/ShortCircuit, and use code ShortCircuit for 15% off your entire order. The whole thing. Oh, I forgot to talk about the case. So yeah, it came with this on, which was odd. Not just like in the packaging, like some of the previous phones we've looked at. And it's that crappy, plastic, rubbery one that comes with a lot of budget phones. This phone is huge, and this case will not stand a chance if you drop it, but hey, free stuff. Let's take a look at the fingerprint scanner. Curious to see if it performs well. I mean, I assume, seems like a hard thing to mess up, but I have been surprised before. This one here is in the power button, so very convenient for most people. They enjoy that. It is definitely growing on me. I've said before that I didn't really like it, but again, I'm using the Oppo Flip right now, and it has a built-in to the power button, and yeah, it's fine. All right, let's see how fast it unlocks here. That's pretty slow. It also has face unlock, so if you find that too slow or you just wanna raise your phone and have it wake up and unlock, you can do that, but I'm more of a fan of the fingerprint scanner. At least it's a little bit more secure. Sure, the fingerprint scanner's slow, but that doesn't matter. We wanna know how Crab Rave does, so let's pull that up here. (upbeat music) It's okay, so audio quality-wise, it sounds fine, but the major downside and what's kind of odd, it's only out of the bottom speaker, so it doesn't use the earpiece speaker at all, and it is very noticeable and sounds very odd only coming out of the bottom of the phone. Sound quality is okay. It definitely sounds a little muddy, and maybe it's because of that lack of separation, but I wouldn't say it's awful. The phone doesn't get especially bright. I turned it up to max brightness, and it's not really that impressive. I actually went in to turn it up more and realized that it was at the max. We don't know the specific amount of nits that the screen has, and Labs isn't quite ready to be able to test that yet, so stay tuned for future videos when we can do that, but yeah, it's not very good, and I also think it might sound worse than my flip phone, which in a thinner body shouldn't be the case, but let's compare and find out. (upbeat music) Yeah, the Oppo Find 2 Flip sounds way better, so it has the earpiece as one speaker and then the main chin speaker as the, obviously, main speaker, and the brightness on this one is at half, and it's brighter than the Unihertz Luna at 100%, so something to keep in mind, and the brightness is a bigger deal because using it outside is gonna be a little bit rough, so take it as you will. Another interesting thing about this phone is that it doesn't use Gorilla Glass. It uses Panda MN228 Glass to be specific, which is just a cheaper alternative to Gorilla Glass, so you'll still have some scratch and drop protection. Something to be aware of is that it's not gonna be quite as competitive to other phones that use Gorilla Glass, like the Poco phones or Xiaomi phones we've used in the past. It's so satisfying. I do think the colors and everything do look good on this, though. I don't think there's any major complaints on the actual quality of the screen, and even the fact that it's the Full HD Plus display, it does look good. It looks sharp enough. I was actually pretty impressed with just how the trees and everything look at the intro for Crab Rave, but yeah, the brightness is a major bummer. Speaking of major bummer, it's gaming time, so I had Labs take a look to see how games perform on this phone. It should be good in theory, right? Well, not so much, so first of all, we had to cut there for a second, and it loaded forever. It took ages to get into the game, and then when Labs actually went to do performance tests, they were not impressed. Let's take a look at the settings, because Genshin Impact will actually tell you what it expects performance to be like when you change the settings around. All right, so we have it open to, this started on highest graphics details, and it says it's gonna be overclocked, which makes sense. So let's try lowering it down to high. Okay, medium overclocked is a little bit of a red flag, as on the Pocophone, it was still able to run 60 on medium, but let's try low. Okay, low is dangerously close to the overclocked. It's balanced, but it is probably like 90% full on that bar for performance-wise, so let's see lowest. 50% full, that's a smooth play, but having to go lowest on a new phone in 2023 for Genshin Impact is a little, I don't wanna say embarrassing, but you probably should be doing better. So when Labs took a look at this, they were playing on the highest graphical settings, and they said it was getting 13 FPS. Playing at that is a struggle, and I don't think that's something you should have to deal with when this can be played on like an iPhone 7. What's even worse, this has a 1% low of three FPS. So when this game is struggling, you're loading a new area or anything like that, it's gonna slow to an absolute crawl. Now, I'm playing on lowest settings right now, and it looks okay. It is not smooth still. Let me make sure, actually, let me make sure this is low, because this is actually not smooth. Again, at highest or medium, do not expect a smooth experience. I've been saying what's even worse a lot, but what's even worse than that is that this gets dangerously close to thermal throttling. So even though this is a huge body, huge, lots of space, the temperature gets to 45.8 degrees, where it has a limit of 47 degrees. The CPU and GPU in this got to 61 degrees, and it has a thermal throttle limit of 63. Again, these are not impressive numbers. So gaming, big yikes. Don't try to go into a COD Mobile tournament with this. But maybe the cameras will save this. For cameras, we do have a 108 megapixel Samsung sensor camera, which is your main camera. We have a two megapixel macro camera, which is an OmniVision sensor. And then we have a 20 megapixel night vision camera with a Sony sensor. So that's pretty interesting. Not really anything I've ever seen before. And I don't know when you would really wanna use it, but we'll try it out and see what it looks like. And for the main camera, right out of the box, it's shooting at 12 megapixels. So it's taking 108 megapixels, bending down to 12, like most of these crazy high megapixel cameras do. Let's try to take a picture of that 108 megapixel resolution as well, though. Taking a look at the photo right away, I'm not super impressed. It's kind of grainy. It is challenging lighting. It's very dark everywhere, except for where I'm sitting and the bright lights that are right ahead of me. So it is something to consider, but most of these cameras get tested in a pretty challenging environment. And these aren't super sharp. The colors don't look very good. And it is fine if you need to send a quick picture of your grocery list to your partner, but I wouldn't be like, heck yeah, I can't wait to show this. Let's take a look at the zoom though. See if that zoom photo looks all right. You know, actually this doesn't look bad for a 10 times digital zoom. Obviously it's not gonna look super sharp, but whatever it is doing, it doesn't look too painting-like. I can see Sven using this as his team photo. This actually looks quite a bit better. Even just the contrast from that big main light, it's not completely blown out. The background still has the darkness. It's not super grainy. Things do look sharp. This is more impressive and more in line with what I thought the photo would look like in that 12 megapixel photo, just that you'd be able to zoom in farther. Even Andy far away in the background, hidden behind cameras, looks good and sharp. Yeah, and the colors look good too. On the red and these numbers, the colors look way better. All right, we're taking a video. We're talking. We're panning around. See how the not optical image stabilization does. Yeah, you can definitely see every bit of wobble that I'm creating, but the exposure is doing pretty well and it's pretty darn quick. Yeah, the video's impressive. I've actually found that a lot with these more affordable phones, that the video performance is usually pretty strong. The mic is very clear. It definitely gets the high tones of my voice instead of the lowness, which is good and bad. It was very easy to understand what I was saying, but I wouldn't say it was true to what I actually sound like. One positive though, it doesn't seem like there's any filters built in, so be it to be yourself. All right, let's test out this macro camera. We have our subject here and it says the best distance for macro photography is four centimeters. Here? I'm not good at eyeballing distances. - [Sven] Get a ruler. - It would be nice if it told you when you were close enough because you have to look over the camera to see how far away you are. It looks like a two megapixel photo. The color is pretty inconsistent. The dust pad turns pretty yellowy off to the right side. That closest stripe is a lot more yellow than the back ones. It doesn't feel sharp at any point on the Tiger or the dust pad. It feels like you've taken a picture of the flip phone from, you know, the late aughts. Let's try out the night mode though. I'm not gonna pretend to be an infrared whiz. I'm not the camera host, that's David, but infrared is used in a lot of security cameras. It gives you a clear image of what you're looking at in darkness, but is black and white. So obviously taking a picture while there's big lights on is gonna be very bright, but maybe we can turn the lights off and see what it looks like. Wow, instant darkness from my clap. The photo looks all right. It's definitely missing a little bit of focus, but you can see what's going on and that's pretty much what infrared is meant for, is you can see what's going on, but it's not gonna be the highest quality or anything like that. So definitely neat, but let's see if I can go over to the WAN set where it's a bit darker, try taking another photo and the infrared video. It does look good. So this bright light you're seeing on the top right is actually just the infrared from our security cameras, but from here, it is almost pitch black where I'm standing. It looks pretty darn good. You can definitely tell what's going on. And obviously when we pan over here where it's more regular lighting, you can see it's quite a bit brighter, but again, a little hard to get that focus, but not too bad. The infrared video is obviously a lot more impressive when you're in somewhere a lot darker. The footage does look pretty darn good. Really cool stuff. Oh, it's 'cause it's off to the side. Weird. I don't take a lot of selfies, so I'm not used to the fact that, you know, I'm looking straight ahead, but it's off to the bit of an angle. Another interesting thing is the photos are very cool. It's very, very white. It makes it seem like it's almost blue lighting or that I'm right out front of a window on a cloudy day, but the photo is definitely sharp. It's a 32 megapixel Samsung sensor, so it does make sense that it does have that sharpness, but yeah, overall, not bad. The colors look all right. Sharpness is decent. The film grain is tasteful in this kind of contrasty dark background. It's nothing amazing, but it'll do you a solid. And for our video, let's see how this sounds. I'm gonna do a spin. I look pretty sharp. I look pretty sharp, which again is not necessarily a bad thing, but it's something to be aware of depending on your stylings. I am not a fan as somebody who has facial hair and imperfections. Unbelievable, I know, but it just makes them really, really noticeable. I don't think it's bad, again, for a quick video call or something like that. It's fine, but I wouldn't make this like your main vlogging phone or the TikTok or whatever they call it. Maybe not. So you might be like, whoa, a normal phone unboxing. That's not what we're here for. And you're right. It's for these two unique features about this phone, the programmable keys and the glyphs on the back, which interesting is that with the glyphs, you can't use them in the camera. So the Nothing Phone will actually let you light up the glyphs to light up the subject while you're taking a picture. This one doesn't have the option. It's just flash. So let's go into the settings and see what you can do. So in the settings here, you can see there's one for LED lights. So you can turn it on and off. You can change the brightness, what ringtone and notification sounds and always on. I don't know why you'd want your LEDs always on. Like it's in your pocket and just on, but I guess you can do that if you'd really like. So for showing y'all what it looks like, let's have it always on. I swear it's not just a nasty yellow. These are actually full RGB compared to the Nothing Phones, just white LEDs. So it's pretty interesting to be able to change it. This default color looks like it's not on purpose and is gross though. So let's change it up. Okay. It turned off and on by accident. I turned it back on. It's a different color that's even grosser. The color is changing and it's getting worse somehow. You won't be able to tell on camera, but in person you can count each LED easily through the back. It's not diffused enough to give it just that fade through. It looks straight up bad. It also keeps turning off randomly, even though always on is on. And when you change the brightness in the settings, nothing happens. That's cool. Oh, it just turned off always on by itself. That's really neat. And then there's different patterns. Let's see. These are just colors, not patterns. And again, it looks gross on camera and it looks grosser in person. I think this is supposed to be a solid color and you can see some LEDs are brighter than others or slightly different hues than other ones in it. It's like purpley blue down here to purpley pink up here. And there's just individual dots that are mish-mashed colors of the multiple it's trying to show. Yeah. Stinky. That's what this consensus is behind the camera. Let's see if it does something cool with notifications. It sure doesn't. So it actually gives you the option to switch through these different tones, but it's not doing anything. I'm just going to try turning off always on. No, it sure does nothing. Wow. That's so cool. - That one did! - Oh, that one did. It also was not in sync with the music. Oh no. Oh, there you go. This sucks. It's not in sync at all. And it's showing glyphs for all of these, but it's not showing up on... Oh, yeah. It's not showing up all the time and it's not showing up for all the patterns. This one did show it once and now it's... Barely showing it. Come on, man. Also has an ambient light feature where other LED features will be disabled. That's all it tells you. There's no other explanation. Who knows? But I have the original here, the Nothing Phone. So let's check out what I would say a solid implementation looks like. So for this one, there actually are surprisingly a little less options. This one only has one color. So you do get the brightness changing, but you can't change the pattern necessarily. It's all just changing the ringtone and the glyphs are assigned to a certain ringtone. Ooh, there's a Nothing Machines 2 now. There was only 10 sounds. They've added 11 more. So we're gonna use those because I don't know what they are. So you see, these are much more dynamic, a little bit more eye-catching and they have the tactics to go along with it. So you can really feel the phone vibrating, which I enjoy. And it actually works first try. The Nothing Phone also lets you use the glyphs as a fill light instead of using flash, which like I'd said earlier, you cannot do on the other phones. So now when you're taking a picture, you'll use this to light up your subject, get them looking at your phone because it's so cool and fancy, and then take the picture and move on. The battery charging speed for this thing sucks. We've been running out of battery consistently through this shoot and it takes ages to charge. Barely a couple of percent for the few minutes we've been trying to charge in between. And that's with like a fast charger meant for a much larger device. Not the apparent 18 watt fast charging that it does, which we only found on a different website because there's not a whole lot of specs for this in the main one. And there's no wireless charging. So you're not gonna be able to just put it on your desk and have it be charging while you're doing other things. It sucks to not have. I'm using the Oppo N. It doesn't have wireless charging and it blows. Can't charge it in my car. Can't just like have it on my desk sitting there charging. When it's this thick, it should have wireless charging. On the back here, it looks like it has it. I went and tried it on a wireless charging pad and it didn't work. So disappointing. But back to these hotkeys. So to change the settings for the programmable keys, we just go into the intelligent assistant menu and then down to shortcut settings. Kind of briefly touched on it earlier. There are a couple of different ones. Freezer is like hiding different apps. I don't know why they called it freezer. Scan is QR code stuff. And the other stuff is pretty self-explanatory. Func one and func two. I don't know why they wouldn't just say function. They have a lot of space here, but hey, func is cool. And then here we have the different options. There's a push to talk, which is cool. You can have it set up to like a walkie talkie or call apps. I'm gonna push it and immediately contact somebody. The programmable key. So you can have it be a media key or symbol key. That's probably what I would use it for. I find that super helpful. I'm always listening to music on my phone. So I'm able to reach down, push this, start playing music, double click to skip the song. Very helpful. Or you can set it to open up a certain app. So let's try screenshot. And long press will be flashlight. Interesting that flashlight's not available for short press, only long. And then double press, we're gonna do, well, I'm a gamer. So we're gonna have an open Genshin Impact. That's super handy. I had pretty low expectations, but I think having those options is great. And this phone costs $300 on pre-order or $330 when it's actually launched, which is affordable, but there's also a ton of competition at that price. For example, the Poco X5 Pro. We've covered Poco phones here before. You can watch those videos. And those are pretty darn solid at very accessible prices. And by the time we're filming this, I don't know if it still is, the Pixel 6a is on sale for $300. That phone rocks. That beats this in literally every single way. So for $300, should you buy a phone that has a cool feature that Nothing Phone has, but worse? I'll let you decide. This isn't a review, but would I buy it? Absolutely not. As Labs wrote in their notes, this is a hard do not buy. Thank you so much for watching this rage-inducing video. Why not check out our video on the Nothing Phone? It isn't a fantastic phone, but it's definitely better than this.",
    "transcript_keywords": [
        "Phone",
        "phones",
        "camera",
        "pretty",
        "lot",
        "Yeah",
        "good",
        "Unihertz Luna phone",
        "Poco phones",
        "bit",
        "flip phone",
        "video",
        "cameras",
        "Genshin Impact",
        "charging",
        "cool",
        "photo",
        "budget phones",
        "sharp",
        "settings"
    ],
    "transcript_entity_values": [
        "Genshin Impact",
        "OmniVision",
        "330",
        "the Unihertz Luna",
        "2023",
        "5,000 milliamp hour",
        "COD Mobile",
        "Samsung",
        "the Nothing Phone",
        "10",
        "12 megapixels",
        "Luna",
        "50%",
        "300",
        "2",
        "today",
        "IR",
        "20 megapixel night",
        "18 watt",
        "Panda MN228 Glass",
        "SIM",
        "Stormbursts",
        "The Nothing Phone",
        "Andy",
        "like 90%",
        "Today",
        "the few minutes",
        "11",
        "only 10",
        "max",
        "David",
        "Genshin Impact",
        "1%",
        "first",
        "Sony",
        "the Nothing Phones",
        "two",
        "GPU",
        "12 volt",
        "the Nothing Phone",
        "SD",
        "CPU",
        "Crab Rave",
        "32",
        "TikTok",
        "108 megapixel",
        "one",
        "iPhone",
        "12 megapixel",
        "300 grams",
        "second",
        "13",
        "63",
        "47 degrees",
        "Pocophone",
        "WAN",
        "Sven",
        "12",
        "jack",
        "45.8 degrees",
        "half",
        "100%",
        "three",
        "108 megapixels",
        "One",
        "60",
        "6.8-inch",
        "the Nothing Phone",
        "61 degrees",
        "Labs",
        "Poco",
        "108",
        "Gorilla Glass",
        "7-Eleven",
        "Stormburst",
        "USB-C",
        "RGB",
        "the Poco X5 Pro",
        "15%",
        "Vessi",
        "four centimeters",
        "the Vessi Stormburst"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERCENT",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERCENT",
        "DATE",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERCENT",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "PERSON",
        "QUANTITY",
        "ORG"
    ]
}