{
    "id": "nNRIsC27bA8",
    "title": "FIIL Diva Pro Review: Wireless Headphones From The Future",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-09-14T20:44:54Z",
    "video_url": "https://www.youtube.com/watch?v=nNRIsC27bA8",
    "category": "People & Blogs",
    "tags": [
        "wireless headphones 2016",
        "bluetooth headphones 2016",
        "bluetooth headset 2016",
        "bluetooth headset",
        "wireless headset",
        "fiil diva pro",
        "fiil wireless bluetooth headphones",
        "iphone 7",
        "fiil diva pro review",
        "best bluetooth headphones",
        "best wireless headphones",
        "best wireless headphones 2016",
        "mrmobile",
        "michael fisher",
        "captain2phones",
        "bluetooth",
        "bose qc35",
        "headphones",
        "headset",
        "pocketnow",
        "android central",
        "mobile nations"
    ],
    "views": 126857,
    "likes": 4351,
    "comments_count": 333,
    "description": "Thanks to the iPhone 7, wireless headphones are about to blow up in a big way  and the FIIL Diva Pro is the most high-tech Bluetooth headset ever to cross MrMobile's desk. With touch-sensitive controls, active noise cancellation, 4GB of onboard storage and a stylish illuminated logo, the FIIL Diva Pro blends beauty with brains: it's even smart enough to know when you've taken it off, and pauses your music automatically! But at almost $300, FIIL is playing in a space heretofore reserved for more established players like Bose. Does the Diva Pro live up to the challenge? Find out in MrMobile's FIIL Diva Pro review!   [SUBSCRIBE]     [ABOUT THIS VIDEO]  The MrMobile FIIL Diva Pro review was published after three days testing a pre-production FIIL Diva Pro test unit running pre-release firmware. Because this is shorter than the preferred review duration, the narration makes clear when certain data is incomplete. The FIIL Diva Pro was tested with a Huawei Honor 8, Alcatel IDOL 4S and ZTE Axon 7.    [PRODUCTS IN THIS VIDEO]  FIIL Diva Pro at Kickstarter:   Bose QuietComfort 35:    [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"Nonstop\" by Kevin MacLeod (incompetech.com) Licensed under Creative Commons: By Attribution 3.0 License  \"Electro (Sketch)\" by Kevin MacLeod (incompetech.com) Licensed under Creative Commons: By Attribution 3.0 License    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/1j",
        "http://mrmobile.tech/1k",
        "http://creativecommons.org/licenses/by/3.0/",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] If you're planning on buying the new iPhone seven, you've probably heard that it doesn't have a headphone jack. While you could fiddle with adapters, or deal with the proprietary connector to take in your tunes, you might consider going wireless with your headphones. And, if you do, you should also consider these. I'm Michael Fisher and this is the FIIL Diva Pro, the most futuristic wireless headset you'll see today. (upbeat music) - [Michael] If you've seen my previous headphone review, you'll already know two things. First, I absolutely adore the Bose QC35, so the Diva Pro has a lot to live up to. And second, I'm not what you might call an audiophile. So when I test headphones I focus more on features and the overall experience. In that arena, the Diva Pro has a lot to offer. The table stakes are all covered. The headset weighs less than half a pound. The synthetic leather ear cushions are very comfortable. And, the set looks great. Next to the charging port and buttons, there's 3.5 mm headphone jack if you want to bypass Bluetooth and go wired. And, my new favorite feature is here, active noise cancellation. FIIL claims a 28 dB reduction in background noise when it's turned on, but that seems like a stretch. That's 36% better sound suppression than what the QC35 is capable of, and I think the Bose product is the better noise canceler by a hair. I do like that you can toggle the Diva Pro's noise cancellation on and off though, and even tweak it. There's a monitoring mode that lets some frequencies in so you don't feel so isolated in public, a wind mode to combat breezy days, and an open mode that actually amplifies your surroundings. As for the sound itself, it's crisp and quite lovely. FIIL makes a lot of claims about adding width, height, and depth to music. I don't know about any of that, but there's no denting that I've been able to hear more detail in some tracks than with the crappy ear buds I used to wear. Where the Diva Pro goes next level is in its interface. Instead of fiddling with the buttons to control the phones, all you need to do is swipe, forward or back changes the track you're listening to, while up or down controls the volume. You can also use your voice to tell the headset which track you want to play. And get this, if you're listening to music and take the headphones off, the song automatically pauses. And, when you put them back on, it resumes. This is my favorite kind of innovation, the kind of feature that you only need to use once to wonder why it's not in every other product. You control the Diva Pro with an Android or IOS app from your phone. You can control which noise cancelling mode you're in, tweak the equalizer for bass or treble, and add some of that dimension I talked about earlier, with 3D sound. The app also helps you load music directly onto the headset. The Diva Pro has four gigs of onboard storage, so it can function as a stand alone music player, if you want to leave your phone behind for some reason. I've only used the Diva Pro for a couple days, so to be honest, I've only had the opportunity to take two calls on it, one to an automated banking system and another from a real human. They went well, as long as I spoke up. I also haven't been able to run the battery for a full cycle yet, but the headset arrived with about a half charge, and after five hours of wireless usage, I still had 20% left. I have no trouble believing in the stated endurance of 30 hours on a charge. Other claims are flimsier. The company says the Diva Pro will stay connected up to 330 feet away. I managed less than half that when connected to a phone in a wide open parking lot. While 140 feet is still impressive, the Bose QC35 did almost as well. And, indoors, the Diva Pro is nothing special. It's basically the same as nay other Bluetooth headset, after 30 feet, give or take, it's kinda useless. And about 15% of the time, taking the headset off didn't automatically pause playback, or playback resumed before I put it back on. FIIL has warned me that this is pre-release software and hardware, so hopefully some of these shortcomings can be fixed before the projected November ship date. The FIIL Diva Pro is a Kickstarter project. At press time, backers have several discount options, and the final product should retail for around $300. So, is it worth it? Well, even at full price, it's $50 less expensive than the Bose QC35 I love so much. And aside from lagging slightly in noise cancellation, the Diva Pro delivers comparable audio., while bringing more features and a hipper look to boot. So, yeah, if I had it to do over again, there's a good chance I'd spring for this set. Especially if I got in on the early bird pricing. The only thing that might hold me back, and the thing I'd most advise you to consider, is post sales support. I'd rather put my faith in a 50 year old company than one founded last year. As to whether there's any merit to that concern, well, only time will tell. And, you know, sometimes it takes a new company with fresh ideas to deliver a really cool looking, really capable product that doesn't cross the line into too futuristic. Be sure to check out that Bose review for more headphone thoughts from Mr Mobile and subscribe so you don't miss future videos just like this one. Til next time, thanks for watching and stay mobile my friends.",
    "transcript_keywords": [
        "Diva Pro",
        "FIIL Diva Pro",
        "Diva Pro noise",
        "Diva",
        "Pro",
        "FIIL Diva",
        "Diva Pro delivers",
        "planning on buying",
        "FIIL",
        "Pro noise cancellation",
        "headset",
        "Bose",
        "noise",
        "Pro noise",
        "headphone",
        "noise cancellation",
        "Michael Fisher",
        "headphones",
        "headphone jack",
        "lot"
    ],
    "transcript_entity_values": [
        "about 15%",
        "Bose",
        "First",
        "Bose",
        "20%",
        "FIIL",
        "less than half",
        "36%",
        "the Diva Pro's",
        "the Diva Pro",
        "30 hours",
        "Kickstarter",
        "the Diva Pro with an",
        "the Diva Pro",
        "140 feet",
        "last year",
        "the Diva Pro",
        "four",
        "Mobile",
        "around $300",
        "today",
        "iPhone",
        "about a half",
        "jack",
        "Michael",
        "3.5 mm",
        "two",
        "28",
        "IOS",
        "The Diva Pro",
        "the Diva Pro for a couple days",
        "50",
        "second",
        "30 feet",
        "up to 330 feet",
        "November",
        "seven",
        "50 year old",
        "Michael Fisher",
        "Android",
        "five hours"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "WORK_OF_ART",
        "FAC",
        "TIME",
        "GPE",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "TIME"
    ]
}