{
    "id": "NNzcqxUtz7g",
    "title": "The Best Keyboard... Now Even Better?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-09-10T18:16:39Z",
    "video_url": "https://www.youtube.com/watch?v=NNzcqxUtz7g",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "das keyboard",
        "das",
        "keyboard",
        "prime 13",
        "das keyboard prime 13",
        "prime",
        "13",
        "mechanical keyboard",
        "cherry mx",
        "cherry mx keyboard",
        "cherry",
        "mx",
        "best mechanical keyboard",
        "gaming",
        "gaming keyboard",
        "video games",
        "pc gaming",
        "cool keyboard",
        "backlit",
        "backlit mechanical",
        "backlit keyboard",
        "das prime 13",
        "das prime",
        "test",
        "best",
        "2016",
        "video",
        "cool",
        "inventions",
        "futuristic",
        "cool gadgets"
    ],
    "views": 2980400,
    "likes": 45202,
    "comments_count": 4749,
    "description": "iPhone 7 Event discussion video -  Das Keyboard on Amazon (USA Link) -  Das Keyboard on Amazon (International) -   The Das Keyboard Prime 13 adds backlit keys to a legendary keyboard. I've been using Das Keyboards in my studio for years and they are some of my favorites. The Das Keyboard Prime 13 carries your choice of Cherry MX switches.  From the manufacturer -  Das Keyboard Prime 13 is a minimalist mechanical keyboard designed to take productivity to the next level. Free of fancy features, the Prime 13 delivers an awesome typing experience by focusing on premium material and simple design. Featuring an anodized aluminum top panel, Cherry MX switches with white LEDs, USB pass-through and an extra-long braided cable, the Prime 13 is the ideal mechanical keyboard for overachievers who want get the job done.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/K4cQcz4meJE",
        "http://amzn.to/2c65Lts",
        "http://geni.us/miposz",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "You may have heard of these guys before. They're called daskeyboard. In fact I think I recall that I've done videos on various daskeyboards in the past but they've got something new that they're bringing to the game now if you're unfamiliar with them, they do mechanical keyboards that are legendary *taps cardboard box* They're like Mavis Beacon's best friend *awkward silence* Mavis Beacon reference? She taught you how to type as a kid. *more tapping* Home row? I still don't type properly No I'm like picking and pecking. Anyway what I noticed that didn't exist on my previous daskeyboard is now white back lighting. It's called the Prime 13 high-performance mechanical keyboard. The ultimate experience for badasses and they wrote it right on the box. It's kind of aggressive. Now you can get it with other switches if you prefer MX blue or so on Anodized aluminum top panel for improved durability. That's cool Full n-key rollover faster for gaming or typing USB port right on it And a keycap puller to remove keys, to place keys and so on Legends in the keyboard game and they got the newest, they got the latest and they got the greatest Here's what we're looking at. My understanding is the top deck is now completely aluminum which I'm pretty pumped for. Jack, you've got a daskeyboard on your desk right now. They're not messing around. This up here Yes, that's aluminum. It's black but it's kind of got like a luminescence to it like it's picking up the light a little bit and almost looking kind of gray Clicky but there's no like switch click *clickety clack* I mean if that's the noise that turns you on You got it here. They went for the traditional feet on there. I kinda like that. I think you might switch to this one. You probably wanna switch to this one Well I don't know if you can or not. I might switch to this. Braided cable in here. Now it terminates into two USB cables. Gold-plated, pretty nice and the reason for that is you do have another USB port here. Now it's only USB 2.0 and I guess it could have been nice for those 3.0 but that should work for at least charging up your phone, connecting a USB thumb drive, etc. It's nice to have an extra one right on your desktop. So that's all fine and dandy Lou. But what about the new features and functions? What about the backlight? So let's dim some lights here and watch this baby glow Boom! Comes to life which is really nice white backlighting as you can see Now there are levels to it you can control that up here via the f keys you see they sort of utilized the side of the keys along top to show you the different functions available, from volume, the media buttons over here for play pause next and so on and then controls for the brightness of the backlight whether you want it on or don't want it on I mean why would you want a backlit keyboard? I guess it's pretty obvious you're in a dimly lit environment or you just want more contrast on the keys when you're working at night. What I like about daskeyboard is it's a little bit understated When they do something it's like, yeah, we get it you want to game, alright We want to give you the mechanical key switches We know you're a power user but we're not going to go over the top with it You can have a nice white backlight, pick your key switches and end up with something a little more subtle but still functional The new Prime 13 daskeyboard I don't know if it's the first backlit version but it's the first one that I've seen and I think it's just a little tweak on something that's already really good Like I said this one is on Jack's desk right now while the old version of it",
    "transcript_keywords": [
        "Mavis Beacon",
        "Mavis Beacon reference",
        "USB",
        "daskeyboard",
        "keys",
        "nice",
        "Beacon",
        "Mavis",
        "USB port",
        "kind",
        "switch",
        "top",
        "Beacon reference",
        "keyboard",
        "mechanical",
        "key switches",
        "game",
        "aluminum",
        "nice white",
        "switches"
    ],
    "transcript_entity_values": [
        "two",
        "MX",
        "13",
        "USB",
        "3.0",
        "first",
        "USB 2.0",
        "Anodized",
        "Mavis Beacon's",
        "Mavis Beacon",
        "Jack",
        "Lou"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON"
    ]
}