{
    "id": "nO2mi9s8XnQ",
    "title": "Retro iMac iPhone X Cases!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-06-03T16:19:19Z",
    "video_url": "https://www.youtube.com/watch?v=nO2mi9s8XnQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "classic imac iphone cases",
        "iphone x case",
        "cool iphone x cases",
        "new iphone x cases"
    ],
    "views": 416994,
    "likes": 12170,
    "comments_count": 1096,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys what's up it's Justine and today we've got something pretty exciting. I know that I say every time I unbox something its exciting because usually it is exciting. But this particularly is super exciting and I can't even tell you how many of you guys have tweeted me, sent me messages, comments to get these cases. These are iPhone cases to replicate the old school iMac colors. There's also this one which is the classic original iPhone which I have one right here. I have a bunch of videos coming out with this. I have an iPhone 10 vs original iPhone video. I also have one showing you guys how I managed to get this thing to work. Those 'll be out after WWDC but in the meantime here it is, it's beautiful, it's working and I'm so happy about it. And now I have an iPhone 10 case to match. So this isn't a sponsored video but they did send me these to check out because I went to the website and they weren't available yet. So thank you guys for giving me an early look, for giving us an early look and thank you to you guys for sending me this as a suggestion because these are so cool. Also the iMac has a very special place in my heart. It was one of the first computers that I got from my grandmother so I went there with her to get it and she got the lime green one. If you guys don't know, shout out to my grandmother because she is so tech savvy, like you guys don't even understand. I know I've showed you guys those before but every holiday my grandma makes me a really cool book of my past year adventures. It's so cool I get to go back and look at all of the cool things that I've done and it's awesome because my grandmother has made these for me, and it's so awesome. So thank you grandma, I love you, I miss you and do you remember the lime green Mac. I'm pretty sure she still has it. Anyway, tangent, let's open this up. Look at this stuff, isn't it neat wouldn't you think my collections complete. Spigen commemorates it's 10th anniversary by introducing you to this limited edition case inspired by the original iPhone. I'm just gonna jam it in there. Jamming it in there is definitely not in the directions. There are specific installation instructions right here. And here it is, the original iPhone case. Let's see what it looks like, next to the original iPhone. It is a little bit bigger, it's a little bit taller. I think it looks pretty good I mean that's pretty dead on. I think that's gonna be my WWDC look, for sure. So what if I take a picture of myself with the original iPhone, with the original iPhone case on my iPhone 10. Is that, what does that mean. (laughs) That's a weird inception right there. Well let's take a look at some of the other cases because we've definitely got a couple more to take a look at. As I was editing this video I realized I kept messing up the names of the colors. I didn't realize there were so many variations throughout the years, I found this handy little color chart. So moving forward, these are the proper names and the colors and the year that the iMacs were released. Oh here's a commercial for the iMac graphite's, wow. - [Voiceover] Aerodynamic design. (lounge music) breath taking acceleration, air cooled, turbo charged. Standard built in DVD player. - Standard built in DVD player, it's a thing. So we have the graphite, we have the lime, we have the strawberry. It really is crazy how quickly technology has changed. Okay let's open the rest of these up. This looks so good, like I can't believe how awesome these look. It's crazy because the phones that we're using now are almost more powerful than the computers that we were using back then. Here's the graphite one. I love that this inside case, it says hello again. If you guys remember the, I guess it's essentially like the tagline or the slogan for the iMacs, was hello. It was basically like a reintroduction for Apple. These iMacs really helped Apple step back into the spotlight, it reinvented them as a company. Where did my phone go, here it is. I'm trying to decide which case I'm gonna wear for WWDC. I'm thinking I might wear this one because it is kind of a really cool retro throw back to the original iPhone. I'm so excited for you guys to see the videos that I've been shooting with it. So let's pop this off and take a look at one of these other cases would look like. Man these look so great. Like I just I wanna wear them all but I can't wear them all at the same time. I care more about my iPhone cases than I do about what I'm actually wearing in real life. Clearly that's not new information to any of you that have been following me for a while. So these just, snap the bottom off, pop that back in. You can still see the Apple logo through the little cut out there. I don't even know which one is my favorite. I think the graphite, could be. It's a nice subtle look, let's try it on another one. (phone case crashing) These cases are a little difficult to get off. It's not just these cases, I feel like all iPhone cases are sometimes a struggle. Oh this is gonna look so great. I've pushed so many buttons and taken so many screenshots by accident. Wow, shining, shimmering, splendid. So here's all the cases, they should be available really soon. Which ones are your favorite colors? Have any of you guys had these original Macs? I feel like we had, I think It was like the snow white one. That wasn't a part of the original ones. Oo it was call the eMac, I'm having so many flashbacks. I feel like one of these days I have to do a history of my Apple usage, so I'll go through the timeline of when I started to where we are now. It really is crazy thinking back to all of the computers that my family did have throughout the years. We've always been an Apple family because my mom was a teacher. So back then most teachers or people in education they offered educational discounts. So usually most of the people who had Apples were in the education system. So it's very very lucky to have always had Apple computers in our family. My mom was sending me pictures of one of our old computers. It was one of the Macs, it was the one megabyte version but I do have a very fun surprise for you guys coming up also sort of a some what soon. I've been doing a lot of ebaying recently so I've got some fun vintage videos coming out for you and it's been so much fun to sort of see where things have sort of started. Not necessarily started started, but started for me in the sense of what was the computer out when I was born because you know when I was born you know exactly what the computer is that I'm talking about. So it's, I get really emotional when I'm talking about this stuff. I'm not really sure why, but it's I can't control how I feel, its how I am. Call me dramatic, wouldn't be far off. Such a tangent but stay tuned because I've got some fun things for you guys. These cases are awesome, thank you guys so much for suggesting for me to check these out. They will be out very soon. I think this is what I'll be wearing to WWDC. Make sure you guys are following me on Twitter and Instagram because I'll be posting tons of updates from WWDC. Also make sure you are subscribed to my YouTube channel and be sure to hit the bell so you guys will get notifications when I post a new video. Because I may be doing a few live streams from there as well and you do not want to miss it. Alright guys, I'll see you in my next video. I'm going to put these all back in their boxes because they're beautiful and they need to be preserved just as so. I'll see you guys later, bye. Come here little, is it a boy or girl. Am I doing a reboxing right now, is that a thing? I mean I feel like it should be a thing. Hey guys, welcome to my first reboxing. You know, what can I say. Okay I'll see you later, bye. (upbeat pop music)",
    "transcript_keywords": [
        "original iPhone",
        "guys",
        "Justine and today",
        "iPhone",
        "original iPhone case",
        "cases",
        "original",
        "iPhone cases",
        "Apple",
        "case",
        "back",
        "exciting",
        "WWDC",
        "Justine",
        "original iPhone video",
        "video",
        "cool",
        "computers",
        "feel",
        "started"
    ],
    "transcript_entity_values": [
        "WWDC",
        "WWDC",
        "iMac",
        "one",
        "Apple",
        "Apples",
        "Justine",
        "iPhone",
        "Spigen",
        "Instagram",
        "one megabyte",
        "the years",
        "YouTube",
        "10th",
        "the year",
        "iPhone 10",
        "iMacs",
        "today",
        "iMac",
        "Twitter",
        "eMac",
        "first",
        "Macs"
    ],
    "transcript_entity_types": [
        "EVENT",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG"
    ]
}