{
    "id": "nOz4Kf5AL7Q",
    "title": "Note 7 Scratch Test - CORRECTION VIDEO - Gorilla Glass 5",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-10-10T06:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=nOz4Kf5AL7Q",
    "category": "Howto & Style",
    "tags": [
        "Note 7 scratch test",
        "Gorilla Glass 5 scratch test",
        "Controversy",
        "Gorilla Glass 5",
        "Gg5",
        "Mohs Scale",
        "Hardness Scale",
        "JerryRigEverything",
        "tempered glass",
        "durabilty test",
        "explosion",
        "recall",
        "Note 7",
        "Samsung"
    ],
    "views": 583416,
    "likes": 18507,
    "comments_count": 1696,
    "description": "The Note 7 has a few problems.  But scratching early on Mohs Scale is not one of them. This video explains the problem I ran into with my Mohs scratch kit during my first test.  The ONLY phone that this problem effected was the Note 7. None of my other other tests were compromised by this issue.   I try my best to make my durability reviews fair and unbiased... Hopefully this video will clear up any confusion as to why MY Note 7 was scratching easy.  As always, putting protection on your phone is recommended.  A case and a screen protector. Not only will it protect your phone from damage, but it will increase the resell value when it comes time to upgrade your phone in the future.  As always, let me know what you think in the comments below.  The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/1R7Ltic",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "The Mohs Scale of Hardness is a general scale for finding the relative hardness of different minerals. Among other things, It does a great job of showing the difference between Plastic, Glass, Pure Sapphire, and diamonds. For more specific and precise measurements, the scale is not ideal. With real science, any particular test or experiment would be performed multiple times across multiple devices, eliminating any statistical outliars. But since I pay for all of my own devices, it's not financially feasible to bulk purchase phones. After my initial scratch test on the Note 7. I did purchase a second Note 7 to double check my results; since they did seem kind of strange. And the second device scored the same. Scratching at a level 3. So at that point, I felt confident in publishing the results of my tests to YouTube. I didn't think that my Moh's Picks would be the inconsistent, and incorrect variable. When purchasing this set of $100 Mohs picks, they come extremely sharp. Since you need a sharp object in order to perform a scratch test. Obviously. This particular kit that you see me opening on screen now, was purchased after my Note 7 scratch test and BEFORE the release of the iPhone 7. Its important to note that the iPhone 7 screen, and camera lens tests were performed with a brand new set of Mohs picks. This new set of picks will be repeating the scratch test on this Note 7. I'm fairly dedicated to reviewing smart phone durability, and I'm equally dedicated to accurate results during my tests. With this new set of picks and a new phone, The Gorilla Glass 5 scratches at a level 6, and again at level 7. These results are perfectly on par with previously tested smartphones. So why was my previous Note 7 scratch test so drastically different? It actually took quite a while to figure out. My investigation (and this update video) was slightly hindered by the world wide Note 7 recall. But here is what happened. Included with the Mohs kit is a sharpening stone. This is meant to keep the tips sharp, so they can perform scratch tests. But as this stone is used, little fragments of the sharpening stone became embedded into the pick tip. This stone is made from is a combination of Aluminum Oxide and Silicon Carbide, both of which are around an 8 or 9 on Mohs scale. And since these little fragments of stone are microscopically stuck in the tip of the 3... instead of the 3 being a 3... the three becomes an 8. And since a level 8 is outside of the normal glass realm... the glass gets scratched. This wouldn't be a problem in the real world of testing rocks, and minerals, and concrete hardness, BUT the contamination is clearly an issue with glass scratching. My picks failed me during that first test, and in turn, my results were skewed. The Gorilla Glass 5 definitely does NOT scratch at a level 3 as I erroneously stated in my previous video. Gorilla Glass 5 is the same relative hardness as other tempered glass screens; like Gorilla Glass 4. In the future I will not be sharpening any of my picks with this stone. Ill just purchase a new Mohs kit when I need to. Remember NONE of my previously tested phones, including the iPhone 7 or the iPhone 7 camera lens were scratched with contaminated picks. This testing issue ONLY effected the test on the Note 7. This is my daily Note 7 That I used without any screen protector or case for about a month, Just daily riding around in the pocket of my jeans. So depending on the phone design, and what materials the screen comes in contact with during every day use the glass can still get scratched. Its still not invincible. Also remember that we are looking at these scratches in perfect light on a high quality 4K camera. So in real life theses micro abrasions aren't as prominent, especially when the screen is turned on. Nevertheless A screen protector is always a good idea. The Note 7 is literally my favorite phone and my current daily driver. While scratching may seem like a non-issue compared to the exploding fiasco, its still important to me to have the correct information to compare to the rest of my previously tested phones. The Gorilla Glass 5 scratching super early on Mohs Scale is not a problem with the Note 7, So keep that in mind IF the phone ever goes on sale again... As my channel has grown in popularity, I have a responsibility to maintain accuracy. Especially since I am the only person on the internet systematically testing smartphone durability... As always, leave any questions or comments down below the video. Thank you for watching! And Ill see you around.",
    "transcript_keywords": [
        "Note",
        "Gorilla Glass",
        "Glass",
        "Mohs Scale",
        "Mohs",
        "scratch test",
        "Pure Sapphire",
        "test",
        "Picks",
        "Mohs picks",
        "scratch",
        "Gorilla",
        "Scale",
        "screen",
        "stone",
        "Mohs kit",
        "tests",
        "Moh Picks",
        "phone",
        "results"
    ],
    "transcript_entity_values": [
        "every day",
        "9",
        "8",
        "Aluminum Oxide",
        "100",
        "Glass",
        "three",
        "6",
        "Moh",
        "4",
        "the iPhone 7",
        "about a month",
        "Mohs Scale",
        "5",
        "the Note 7",
        "daily",
        "first",
        "second",
        "Pure Sapphire",
        "Plastic",
        "the iPhone 7",
        "3",
        "YouTube",
        "Mohs",
        "7",
        "Silicon Carbide"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "EVENT",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}