{
    "id": "nPnJIn9tlLY",
    "title": "The BENT GAMING Mystery Tech",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-06-20T15:32:04Z",
    "video_url": "https://www.youtube.com/watch?v=nPnJIn9tlLY",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "how to waste",
        "amazon",
        "wish",
        "tech",
        "unboxing",
        "samsung",
        "galaxy",
        "z flip",
        "galaxy z flip",
        "razer",
        "razer opus",
        "razer kishi",
        "tcl 10 pro",
        "tcl 10",
        "mhkbd",
        "fortnite",
        "plasma speaker",
        "plasma loudspeaker",
        "plasma",
        "nintendo switch",
        "ps4",
        "playstation",
        "switch",
        "controller",
        "robosapien",
        "robosapian",
        "roboraptor",
        "the test drivers",
        "test drivers",
        "this is",
        "austin evans"
    ],
    "views": 1990941,
    "likes": 53691,
    "comments_count": 2113,
    "description": "Watch me fool Marques Brownlee with tech:  The MHKBD phone stand on Amazon:  Razer Opus wireless ANC headphones on Amazon:  Razer Kishi smartphone gaming controller on Amazon:  TCL 10 Pro phone on Amazon:  Sunnytech Plasma Loudspeaker on Amazon:  Robosapien, Roboraptors questionable cousin on Amazon:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  My new podcast The Test Drivers!  Our second channel @thisis!  I stream on Twitch now!  We have a new Discord:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/AEuCh_79z2U",
        "https://austin.tech/mhkbd",
        "https://austin.tech/razeropus",
        "https://austin.tech/razerkishi",
        "https://austin.tech/tcl10pro",
        "https://austin.tech/plasmaspeaker",
        "https://austin.tech/robosapien",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "https://discord.gg/sQ8Sw27",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hello my friends, and welcome back to Mystery Tech, where I have a very special guest. Construction noise. (construction taking place outside) Oh! Oh, what's up? I caught it, I'm so fast like, Sanic. All right, first item is, (sighs) I already don't like this. Oh, is this the stupid MHKBD thing, or whatever it's called? - [Ken] Yeah. - So, recently on Twitter, I found that there is a company, called MHKBD, or MKHBD. It looks like MKBHD, and every time I read the name, I feel like I'm dyslexic. But they make these wonderful little wood creations, like this, which is a phone stand, right? - [Ken] Yes. - All right, so, let's give this a try. Wow, how lovely that is. Truly, a magnificent side hustle for Marques and his secret wood working company. But look how nice this is, I can have it rotate around, I'm not entirely sure why this moved, because I don't see any reason for it to move. Oh, oh okay, I see. So, you can rotate the moose so you get different angles on your phone. How, - [Ken] That's so smart. - He's, what a, what a clever gentleman. That Marques. If only we had recently done a This Is episode with Marques, all about whether or not he can guess tech and phones correctly, linked in the description. - [Matt] I'm definitely taking that. We can put it right on the fun station. - Here you go, man. (Matt laughs) It's all yours. - Look it. (soft music) Yay! (snaps fingers) - I hope you have some headphones, Ken, I'm feeling in the mood for some music. (thud) Hey! Wait, did you actually have headphones already ready? Okay, cool. These are the Razer, Opus, wireless noise-canceling headphones, so, I've actually heard a lot about this, so, we actually got a really brief look at this at CES earlier this year. But essentially, the idea is that these are very similar to something like the Sony 1000X Mark 3s. However, they're only $200, and by most accounts, they are almost as good in certainly most categories, and obviously a lot cheaper. So, Ken, I know, you spend a lot of time with the 1000X Mark 3s. So, generally speaking, they're regarded as some of the best sort of over-ear noise canceling headphones. However, at 350 bucks, they're very expensive. So, if these can even get close to the same level of comfort, noise, well noise rejection, I suppose, as well as audio quality, I'll be really impressed. Wow, I mean, these look almost identical to the Sony's. But that's not a bad thing, I feel the Sony's have a very classic design, it's just very unusual, that of all companies, Razer are the ones who brought these out. I mean, yes, they're certainly not gaming focused headphones, but of course, you have to consider Razer makes a lot of other products, including their own phone, only natural for them to get into the sort of, higher end audio space, that's not just necessarily just for like, a gaming headset. - [Ken] And they also own THX. - They do own THX. Oh. Okay, initial impressions. The passive isolation is nuts on these things. Like, legitimately, I could believe that these were on, just by putting it on. Like, that's actually a massive difference. Usually, I'm not a big fan of downloading apps, for well, most of the things on Mystery Tech. However, I will download the Razer Opus app because not only, I'm sure they use this for things like updating your firmware and what not. But supposedly, you can actually tune it fairly accurately, I guess, with the EQ and everything. So, I'm connected, Auto Shutoff. Oh, Auto Pause, Resume, when the headset's removed from your ears, that's a nice feature. Obviously, with a lot of sort of like, in-ear buds, you know, you take out your AirPods or whatever, it'll pause your music. It's a little bit of a less common feature for a proper full-sized pair of headphones. It's a really pleasant sound. Like there's nice sound stage, but it's not. It's very easy to listen to, it's not like, sort of like cranked up on like the highs and especially the bass, like a lot of headphones, especially like Bluetooth headphones. All right, verdict. - So, I do agree, there's definitely not as much of a punchy, bassy sound to it. The one thing I really like is that this actually has physical buttons instead of the Sony, where, the Sony has touch controls that, I feel like get in the way of everything. - I like these, almost purely for the fact that they like automatically play and pause. Like, I've really gotten used to that with Bluetooth headphones, with like the Galaxy Buds and like AirPods and stuff. That's a really nice feature. - That is really seamless. - It's super quick, the one thing I don't like is when you turn on and off ANC, the music pauses for a second. Which sounds kinda like jittery. - These sound really good for $200. - All right, okay, well I see more Razer stuff. Is this just the Razer sponsor episode, Ken, are you just sneaking your sponsors in already? - [Ken] Well, I kinda need to eat. - So, we have the Razer Kishi, another item that we did take a look at at CES. We also have the TCL 10 PRO. Wait, hold on, walk me through this for a second. Have you bought anything in this episode, yet? Have you just been fully, like, taking advantage of that sweet sponsor money the entire time? - [Ken] This one of the cheapest Mystery Techs we've ever done. - Well thanks, after the last one was like $400,000, I'm pleasantly surprised. Okay, now, so, let's start with the Kishi. Okay, that's a pretty straight forward looking controller. Oh, yeah. - [Matt] I would not do that with the, no. - [Ken] Why do you subject your Galaxy Fold? - Flip, my Z Flip, you know what? No, the Z Flip is durable. - [Ken] One bad moment, and your phone's gonna be cut in half. - No look, it's even sturdy, look, it's like the Folds not gonna flip in half. - [Matt] Oh, that's not sturdy. - Look, it's fine. - [Matt] There's so much flex. We gave you a phone to use. - Oh right, I forgot. I will immediately say one thing, I like the gray finish on the back, that actually does look kind of unique. This is every bit as good as a OnePlus, or a Galaxy, it's nice sort of, metal machining on the sides. You've got a tapered edge, which honestly looks like it's straight off of something like a OnePlus 7. Oh, we've got a headphone jack. How wonderful. Although I will say the notch is looking a little, a little on the old side. I was about to say, \"what a nice freebie in the box,\" but Display Greatness is burned onto your case, so I don't like that at all. All right, well, I mean I'm not impressed with this fingerprint, sensor right now, it is taking like a solid 2 seconds for it to register right now. Maybe it'll be a little bit faster later. Choose dominant hand, left hand or right hand? So this is a Snapdragon, 675, which is actually pretty solid, 675 is probably, we'll see in like Pixel 4A or whatever. Oh, my God. It burned in a watermark, a TCL watermark. Display Greatness, Display Greatness, Display Greatness. Selfie portrait. I mean, wow. - [Ken] Whoa, what? - Did you see how far like, delayed that was? I mean, that does not look good. That is not my best selfie. What the fu, okay, so we have three cameras running right now. - [Ken] Whoa, that's cool! - Original, ultrawide and low light video. - [Ken] That, that, what? What? Oh that, that's, that's gonna haunt me forever, four Austins? I thought one was enough. - Hey, guys! This is a phone! Okay, so, you know what? The camera seems to be about as good as a $450 dollar phone should be, unless your name is Google Pixel. Why don't we try a game here? One slight problem with this, it covers up the proximity and the light sensor, so, the phone immediately went completely dark, I've to manually adjust that up. So, now that we have Fortnite downloaded, there are a couple of issues. So, first of all, the Kishi does seem to work, at least for the menus and all the buttons are being registered. The problem is that the phone is defaulting to low resolution at 20 FPS, so I cranked up the limit, but I don't have high hopes for the performance of this guy, wouldn't even let me turn up the graphics to medium. I didn't think that the 675 was that sort of low end, but like, it looks terrible. Like, it definitely looks like it's running at like 360p or something. Wow, it's not even 30 fps right now, I'm at like 21, 22. Yeah, this thing is not impressive. - [Ken] You know what phone would play this really well? - What? - [Ken] The iPhone SE. - iPhone SE would absolutely do a great job. Do you see how the world was like spawning in as I walked around the corner there? Look, the thing is, the controller, I'm on board with, this feels good. It's not a perfect fit for all phones, but something like this, I think it works well enough. The problem just is with the TCL, it's a nice bit of hardware, but the performance is bad, like there's no other way around it. Like this just looks terrible. Whoa, what the? I had no idea how to play Fortnite but, theyve added a lot of stuff since the last time I played. - [Ken] You say that every time you play Fortnite. - Sunny tech. Okay, what is this? What is that? I see a capacitors and is this like the Tesla coil? - [Ken] This is part two. Yes! Okay, nevermind, I'm excited again. - [Ken] So this Plasma Loud Speaker is $80. - Excuse me, did you say the words, Plasma Loud Speaker? - [Ken] Yes I did. - This looks so nefarious. I don't even know where to begin. So, we have what looks like a power supply here and then we have like a motor or something? And then it goes to this, which is, I guess just a couple of copper contacts. Are you sure there are no instructions of any kind? - [Matt] You're the one who opened the box. - There was nothing in there. - [Matt] I'd say just go for it. Coward. - [Ken] Oh, look to see where to you plug in the headphone jack. - What the (beep) was that? Okay. - [Matt] There's plasma. - What is that, how do you do anything with this? - [Ken] Turn it off. - [Ken] Oh, that is definitely. - Okay. (video playing on the phone) Whoa, did you see it's jumping over? What the f. - [Matt] I hear it crackling. (crackling) Oh, oh! - What is happening? - [Ken] It's jumping. - It is like going all over the place. - [Ken] That's sick. - So, the thing is, this is a really interesting device. The problem though is this is not all that loud, it's very cool, they're literally using electricity in a plasma arc to listen to music. But it's incredibly quiet, you would never wanna listen to this as like, a real speaker, right? You'll almost hear sort of more of the hissing than anything else. But that being said, as a Science toy, it is actually really interesting. It also scares me. But I mean, what else is new? Lots of things scare me. Oh wow, what lovely background noise, if only I had my active noise cancellation headphones. Oh well, instead I have a PS4 controller. Wow, oh gee, whatever can I do with this? And, what the (beep)? What the (beep), Kenneth? - [Matt] This is a family channel. - This is the May Flash, Magic-NS Wireless Controller Adapter for Switch and PC. Are you trying to tell me that this turns a PS4 controller into a Switch controller? - [Ken] In theory. - All right. My friends, I come bearing a solution. This may look like a normal TV to you, but in fact it is not, because it is the ultimate Nintendo Switch Pro that we very carefully customized on the Building the Ultimate Nintendo Switch. I'm using this because I wanted to show off my craftsmanship, not because I can't find another Nintendo Switch dock which is not glued to the back of TV. That looks really bad on camera, why did I even talk about that? - [Matt] It looks even worse than I remember. - 'Kay, so, this is pairing, that's probably a good, oh, oh, oh, oh, oh, oh, it worked, it worked, it worked, wait. Wait, why is it not, what? Wait. Wait, it paired, it's paired, what? It's paired, it's paired, do you see its paired? Can you see it's paired right now? Look how blue that is. This should be working, why isn't this working? - [Matt] I don't see a single positive review past 2018. - Okay, you know what? This thing doesn't work, we're moving on with the, you know it's fine 'cause the ultimate Switch doesn't need a PlayStation controller, it's good enough as is. - [Matt] Now, we put that in the trash. - What is that? Why are you giving me more things? I don't even have room on the table. Is that another Roboraptor, Ken? Did you give me another (beep) Roboraptor, what the? We've had Robraptor, we've had Roboraptor X. That Megaraptor, we've had that weird pink raptor, we've had like five or six others that I can't recall off the top of my head. But now, we've completely given up and now we have Robosapien, a (beep) Gundam. - [Ken] You know Robosapien is like the more famous cousin of Roboraptor, right? - I mean, it's from the same company. Are you trying to tell me that Robosapien is more popular than Roboraptor? - [Ken] Actually, yes. - Really? Who doesn't want a robot dinosaur? - [Matt] Who doesn't want a little brother? - I have one of those, and thats not worth it. - [Matt] Oh, whoa. - [Ken] Whoa. - [Matt] So. We should really take those knives away from you. - That's okay. - [Matt] You watched too much Naruto. - Dattebayo... - That was the most yikes moment of my life. - [Ken] I am leaving. (running footsteps) (silly music) (music grows a little upbeat) - You know, I wonder why people don't take me seriously sometimes, and then moments like this, I'm reminded of why no one takes me seriously sometimes. - [Matt] Austin \"I make tech on the internet videos\" Evans, thing, I messed that up. - Can we name this \"the Cringe Episode of Mystery Tech\"? Or is that just every episode? (Roboraptor growling) 'Mkay, all right. He's not happy about his new-found brother. - [Matt] Put his hands back on right now. - I'm putting his hands back on. Yes, yes, there, there, calm down. Okay, so we have Robosapien, he doesn't look as high quality as Roboraptor, he's just black and just generic looking. - [Matt] Wow. He is (voice fumbles with Austin's) - That's kinda cool, actually. - [Ken] That's why Robosapien is actually really popular, he's most known for dancing. - [Matt] What are you? What? Why are you like, what? Oh, God. - [Ken] Oh, Jesus Christ. - [Matt] Why are you the way you are? - He has two feet full of batteries. (laughs) - [Matt] Do we have that many? - I don't know, I need a screwdriver to find out. - [Matt] What is that, like eight AAs? - (coughs) I assume 4 and 4. Oh (beep) no, they're two Cs. - [Matt] Two Ds! - Oh (beep), you're right, yeah, two Ds. Double Ds my friend, Double Ds. Did you just break your nut? did you nut so hard you broke it? - We dont have Ds? Are you trying to tell me that this Mystery Tech is officially over now that we don't have batteries for Robo-Lamo? What do we do now? - [Matt] Chipotle? - Yeah, sounds good. Thanks for watching, see you guys next time. (boxes crashing lightly) Robo-Lamo.",
    "transcript_keywords": [
        "Mystery Tech",
        "thing",
        "headphones",
        "phone",
        "Display Greatness",
        "Tech",
        "good",
        "Razer",
        "Nintendo Switch",
        "Switch",
        "Roboraptor",
        "lot",
        "Sony",
        "special guest",
        "things",
        "sort",
        "nice",
        "ultimate Nintendo Switch",
        "Mystery",
        "controller"
    ],
    "transcript_entity_values": [
        "the Galaxy Buds",
        "half",
        "ANC",
        "first",
        "two feet",
        "Sanic",
        "TCL",
        "jack",
        "Two",
        "Twitter",
        "two",
        "Matt",
        "Switch",
        "four",
        "Razer",
        "one",
        "Kay",
        "CES",
        "$450 dollar",
        "the Razer Opus",
        "21",
        "360p",
        "Robo-Lamo",
        "Austins",
        "Ken] Turn",
        "six",
        "Opus",
        "22",
        "Cs",
        "Magic-NS Wireless",
        "400,000",
        "PlayStation",
        "Ken",
        "Robo-Lamo",
        "Austin",
        "Display Greatness",
        "past 2018",
        "the Cringe Episode of Mystery Tech",
        "4A",
        "Robraptor",
        "Galaxy",
        "Fortnite",
        "Razer Kishi",
        "only $200",
        "FPS",
        "MKHBD",
        "Gundam",
        "MHKBD",
        "Marques",
        "Jesus Christ",
        "OnePlus",
        "675",
        "Double Ds",
        "EQ",
        "Kenneth",
        "Coward",
        "eight",
        "AirPods",
        "MKBHD",
        "Snapdragon",
        "Google Pixel",
        "Tesla",
        "Nintendo Switch Pro",
        "Sony",
        "2 seconds",
        "200",
        "Galaxy Fold",
        "Fortnite",
        "One",
        "Mystery Tech",
        "this Mystery Tech",
        "Kishi",
        "Razer",
        "three",
        "Nintendo Switch",
        "Robosapien",
        "350 bucks",
        "Naruto",
        "X. That Megaraptor",
        "Razer",
        "Roboraptor",
        "4",
        "80",
        "30",
        "PS4",
        "4",
        "Evans",
        "second",
        "Fortnite",
        "five",
        "the May Flash",
        "earlier this year",
        "20"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "MONEY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL"
    ]
}