{
    "id": "nr4kmlTr9xw",
    "title": "Ask me why I'm Mining in 2023...",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-01-18T19:44:50Z",
    "video_url": "https://www.youtube.com/watch?v=nr4kmlTr9xw",
    "category": "Science & Technology",
    "tags": [
        "gpu mining",
        "heating house with gpu",
        "pc heating",
        "using gpus to heat my garage",
        "does a pc heat your room?",
        "graphics cards"
    ],
    "views": 1914160,
    "likes": 61288,
    "comments_count": 5685,
    "description": "Try Zoho One free for 30 days with no credit card required here:   It could take decades to break even with GPU mining in 2023, so why would I install a new GPU mining rig in my garage NOW? Would you believe I actually have a good reason?  Discuss on the forum:   Buy a ASUS Prime B550-Plus: [ \"\") Buy a AMD Ryzen 5 3400G: [ \"\") Buy a SilverStone Hella 2050 Platinum: [ \"\")  Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:  Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:02 How cold is it? 2:30 The Plan 3:00 Curtains 6:24 Building the PC 10:34 Turning it on 11:50 Wall-mounting it 13:40 Did it work? 17:04 outro",
    "description_links": [
        "https://www.zoho.com/one/lp/linus.html",
        "https://linustechtips.com/topic/1482311-ask-me-why-im-mining-in-2023/",
        "https://geni.us/8hGfVh](https://geni.us/8hGfVh",
        "https://geni.us/CNsa9](https://geni.us/CNsa9",
        "https://geni.us/laaQOu](https://geni.us/laaQOu",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- As part of the renovation on our new house, I added this workshop test bench area to the garage which has already come in handy when working on product reviews. The problem is that the garage is in Canada and Canada has winter, meaning it has been so bloody cold that I can't do any work out here. So, \"Heat the garage\", I hear you saying, but that would be expensive and frankly too easy. I've got a reputation to uphold. Luckily, I have a second problem. Because we often need to retest hardware months or even years after it first releases, I have a warehouse full of things like random motherboards, weird Crypto mining power supplies, and GPUs. If only I could take my two problems and put them together somehow, I bet you can see where this is going. Directly to this message from our sponsor. Zoho One. With Zoho One there's no more worrying about using multiple platforms and software to manage your business. Zoho One provides you with a single unified platform that's both comprehensive and easy to use. Start your 30-day trial using the link down below. Since many of you don't even believe that Canada's a real country, the first thing we'll be doing is establishing that, A, I am in fact real and B, it is indeed cold in here. So I've got this Fluke thermometer and a K-Type probe that I'm going to be taping to the chair in my test bench corner where I'll sit and work on like notes for product reviews or, most recently troubleshooting the random restarting issue that I've been having with the Play Button PC. That's interesting. It claims that it warmed up like three degrees since we first started taking the temperature. But if I go like this, you can see it's dropping rapidly. It's just from me standing here. - [Brandon] It's 10 degrees in here? It doesn't feel even that warm. - Well, because it's not. If I'm whooshing around the air you can see it's dropping. - [New Employee] It's more like nine and a half. - Yeah, yeah, it's about, it's about nine degrees in here. Which is honestly not that cold until you consider what the temperature is outside. It is five degrees outside the garage, meaning that the delta between outside and inside is only about four to five degrees. We had a cold snap recently where temperatures plunged below negative 10 degrees Celsius. Meaning that it was well below zero in here and not only unpleasant for me, but also for my electronics, particularly in my laptop the liquid crystals in the display turned to more like gel crystals with extremely pronounced motion blur. Even just moving the mouse around, it's kind of hilarious. Obviously in a perfect world I would heat the entire space. But instead I'm going to be laser focused on the area right around this desk. And that's for a couple of reasons. One, it's large with high ceilings, meaning that a lot of the energy is going to be wasted heating up the areas that I don't even occupy. Two, there is currently no heating system in here whatsoever, meaning I would have to install something from scratch. Finally three, this house was not designed for the garage to be heated, and therefore the insulation in it is absolutely atrocious. So enter my solution, heavy curtains from Amazon which I'm going to put up just around this corner in an attempt to kind of hold in some of the heat. I don't know that this will work very well but what I do know is that I have a second K-Type probe and we are going to take our temperature in two places: at the chair, which I showed you before, and also kind of out here to see if we are actually able to maintain a temperature difference. Oh that's right, the original plan was shower curtains because the plastic would keep the hot air from moving at all. At risk of the air quality in there not being as good. Anyway the point is that they were too short. They were only going to go to like here. Well this seems fine, right? - [Brandon] Don't you want me to take down this stuff? - What? Why would I take down this stuff? - [Brandon] There's a chainsaw up there. - Yeah, that's where I keep my chainsaw. What? It's safe. Oh my goodness. You sound like people on Twitter. Okay, I post a picture of my garage and everyone's like, \"Well it is, the chainsaw is going to fall on you.\" The chainsaw's not going to fall on me. Look.. Ah.. Ah. Ah.. Hold on. - [Brandon] Linus! - Wait for it. Ah! Chainsaw's not falling down. Don't worry. Fine. Ah, come on. What the hell? How are you supposed to get this stuff out of here? I need a knife. Ah, but that's okay because I have a perfectly organized garage, meaning that I can find something immediately no matter what it is. Go ahead Brandon, ask me to find anything. - [Brandon] Where's your JerryRigEverything knife? My JerryRigEverything.. Oh, well. (falling tools jangling) Oh crap! Wait, I actually know the answer to that (fast forward tape squeaking) - [Brandon] About 16 seconds, not bad. - In my backpack upstairs. That was a hard one because it wasn't actually in the garage. We've got a couple of options here. We can either go between this post and the wall, or we can mount it to the front of the mezzanine here. I guess I'm just not really going to overthink this. I'll just kind of go for it, right? (Linus humming) Yeah, because that would keep it as close as possible. Nope, new plan. Things are about to get janky. I'm taking the L bracket off and I'm just going to put it in the bottom like this. Yeah, good thinking, Linus. That'll get it as flush as possible. What was I doing on the ladder before, Brandon? This is way smarter. There we go. Ah, dang it. There we go. Ah dang it. Okay, there we go. Ah dang it. There we go. I guess I need to put the curtain on it. Yeah, this seems like a good idea. Hey Brandon, make sure you're rolling if I die. I've said it time and time again but you guys got to monetize that video. That'll be my final gift to the company. It's the right thing to do, Brandon. I have found a small fly in the ointment. My chainsaw appears to be in the way as does my leaf blower. Now I know what you're thinking, Brandon. \"Oh, thank goodness he's going to take down that chainsaw\" But I've got another idea. Wait for it. Yes! - [Brandon] Still dangerous. - And after only minor trials and tribulations, it's done. Not bad, right? Swings open a little something like that and look it's even still compatible with my chainsaw storage. Now it's time for us to kick things up a notch. And that is where this comes in. We found this old mining frame kicking around from.. man that must have been like four years ago or something like that Anyway, from an old video we did. And what I like about this one is that it seems like if we get a little creative we should be able to wall mount it. Because like I said, I don't just want to throw heat into this area, I want to throw heat at my chair. So I'm kind of thinking like here. Or if I can swing it, maybe even at an angle so it's blowing down. This is a perfect time to take our \"before\". We are at exactly not.. Really? It's probably because I'm close to it. Okay, well we're at 9.3 and 9.4 degrees, respectively, inside the workshop and outside in the garage. So what I'm going to do now, da da da da da da da da is close it. Because I am expecting there to be a slight increase just from the approximately 200 watts coming from me and Brandon combined. Plus actually this is probably another 100, 150 watts. If we do see a change in temperature in the workshop compared to the rest of the garage while we're building up the mining rig, that would suggest that the theory behind this is sound. And I'm not just going to be trying to heat this entire space with a thousand or so watts, which would like be negligible. Wouldn't work at all. Okay, let's build a computer, shall we? Brandon, help me decide. Should I go with the Firestarter 5000, or this unit from a reputable brand? - [Brandon] Oh, it's so hard. - Firestarter 5000? - [Brandon] Yes. - With the Bitcoin logos on it. - [Brandon] Yes. - Sorry, SilverStone, you're too reputable. Not enough fun. Now I'm sure the mining enthusiasts out there are going to be cringing at some of my hardware choices. But let me tell you something, efficiency in this case, not actually necessarily a benefit. If I have a less efficient power supply, that just means I'm kicking out more heat. Oh, I guess I should talk about the cards that we're going to be using. These are all examples of GPUs that we're not using right now but that I will almost certainly need at some point in the future. So I've got, I think this is a 2080 Ti, a 3080.. Now that the 40 series is out you're going to see a lot fewer 30 series cards in our projects. And then I've actually got our matching pair of RTX 2080 Supers, which we might need if we ever wanted to do a retrospective on an SLI or something like that. So in that case, I will climb up on my ladder, rip the GPU off the wall and take it into the office. For now, it heats my garage. I know that that there are plenty of gamers out there that could be using these GPUs right now. But the problem for us is that the cost of selling them and then reacquiring them at some point in the future when we need them, is extremely high and it's super time consuming. And so we've found it's better to just store them. I put all the GPUs on before plugging in all of these little PCI Express riser boards. I mean, yeah, mining content's so out of fashion now, you guys might even forget these things. Basically what they are is little PCI Express to USB adapters. So apparently USB has enough conductors for a PCI-e by one link. So then that goes up to this little board here that accepts a 16X GPU. Mining is not particularly bandwidth intensive over the slot. And then you power this little board with a six pin PCI-e connector. Unfortunately, I screwed in all my GPUs before installing these so now I get to do this the hard way. I'm only going to plug in one of these GPUs for now because even under the best circumstances, this mining stuff tends to be a little bit flaky. And the more GPUs you run, the more chance of encountering instability. I do not want this thing to shut off because then I'll get cold. Oh my goodness, this thing's heavy. And, oh wow, this frame is just like.. (fake crying) Wall mounting this is going to be a challenge. But I have good news. Check this out. There's now a difference of .3 degrees between in here and out there. That means the theory is sound. Hold on a second. Can this thing even take a 120 volt input? I can't remember. Shoot, it can't. And I just plugged everything in. You know what? Screw it. Let's take lunch. And it's done! Switching the power supply has another benefit. There's actually one screw hole here that aligns with the PSU, so the whole rack is now self-contained. All we need to do is see if it works. This is going to be a lot of power. Hmm.. I have questions. Nice! Okay, we've got display, power, USB. We good to go? Boop! Whoa! Okay, only one of these GPUs is actually plugged into PCI-e so far, and you might have noticed I'm plugged into the motherboard for graphics. That's why we needed to use a G variant of AMD's Ryzen 3000 series. So it's the 3400G because we want all of our dedicated GPUs dedicated to mining. Now Windows isn't necessarily the best operating system for mining. But it's here. How long does this benchmarking process take? - [New Employee] Uh it was like 15 or 20 minutes per card. - Oh my God, what? You know what? No, it's fine. Basically what I had planned to do was plug them in one at a time. Instead we're just going to plug them all in and hope for the best. And we'll let them all do their benchmarking thing. We've got another video to shoot here today anyway so we'll go do that while we wait. Obviously we want more, but two of them are actually mining already and we're sitting at about 975 watts. Not too bad. But we still have some problems to solve like how to put the heat exactly where I'm going to be sitting. The idea that I have in mind, as you guys know I'm something of a ceiling and wall mounting enthusiast. Is I want it right here. And then I want fans that are kind of blowing the heat down. What do you think, Brandon? Genius or moronic? It should be right down the line. Okay, these are at about 18 inches, which is doable. Awesome. All I have to do then is just drill some holes in the mining frame and put it right into the wall. What could go wrong? Wait. Oh, they're all mining now. that explains why we're at 1200 watts. Man, that kicks off a lot of heat. Exactly what we need. All right, let's shut it down and get it bolted to the wall. I would never recommend drilling near working hardware components. (drill whirring) (drill clunking) Oh.. What did I just break? Oh, the drill bit. Oh, well there's a hole. - [Brandon] You want help? - Nope, I got this. (drill whirring) Oh yeah, she bit, she bit. (drill whirring) Please tell me I hit a stud. (drill whirring) Did we get it? Oh yeah, that's not going anywhere! And after only minimal troubleshooting which involved enabling 4G decoding and changing all of our PCI-e slots to Gen Two, we are up and running 1200 watts from the wall. And, I got to tell you guys, I can feel the heat. Now all we need to do is let it run for a while and see if it works. Long story short, it didn't. Our temperature delta is only about a degree and a half which, if you guys remember, is not that much different from just having a person in here working. I think I know why though. We've got our FLIR thermal camera going here. And you can see that the warm zones around the mining rig are actually in completely the wrong spots. A ton of our heat is kind of leaking away over here. A ton of it's flying off over this way. And we are sending some down, but it's clear that the position of our fans is not ideal for blowing the heat down toward the user. It's almost like thermal management is like a whole industry with engineers, scientists. But who needs engineering When you have L brackets? Here's what I'm thinking: Three L brackets on the wall, I bend them in the vice, and we blow the heat that way. I had my lovely assistant help me bend these brackets. Good job. Sure, how about here? I mean at this point I feel like the ship has kind of sailed in terms of this looking decent. I like how this video started out like, \"Yeah we've got a plan, this is going to be kind of done well.\" Now this. I mean, how does that look? - [Brandon] It's a vibe. (Linus snickering) - Oh crap, I just ripped the screw out of the wall. All good. I'll just make a new hole. No one will ever know, except all of you people watching. And it appears that I've put holes in my wall for nothing. The grand total difference in temperature between the curtained area and the outside is one degree (party horn blowing) at best. (snapping sound) Oh, zapped a bug. But at least there's no bugs. I mean, is it even.. What about here? Like it feels warmer. Okay, it is warmer. It's like 12 and a half that close. I think for me too I just need to get it closer. At the end of the day even if it's only a degree, it's free real estate though, right? Because we're making money mining. Nope, we're actually losing a dollar a day. But that's okay because as the keen eyed among you might have noticed earlier in the video, our ultimate plan is not to mine on it.. Well, the ultimate plan might not be to keep it at all if it's not actually going to heat in the space. But whatever the ultimate plan was to run Folding@home. We've got a great Folding team on the LTT Forum, which is a great community, by the way, if you haven't seen it. And you know what else is great? This message from our sponsor. Zoho One. Do you own or manage a business? Zoho One can make your life easier. Zoho One takes the essential elements of any business like accounting, marketing, HR, and combines them into one unified operating system. You can build your own website from the ground up and maintain it with intuitive customization and personalization options. You can send out purchase orders, create marketing campaigns, manage shift scheduling, all in a few clicks. You can track metrics and use data to make key decisions to increase revenue. And I mean, do you have everything all set up? Well, you can start automating your processes so you never have to worry about them again. Working on the go? No problem there either. Zoho One includes mobile apps so you can run your business anywhere. So don't wait. Take control of your business the way that you see fit with Zoho One. Follow the link below to try Zoho One for free for 30 days with no credit card required. If you guys enjoyed this video, why not check out a blast from the past when we did a series on what the heck mining is and how it works. It doesn't make any sense at the moment, but who knows. Maybe the Crypto Ponzi scheme will take off again and some new people will join the bottom of the pyramid and it'll be a rip roaring time for everyone involved.",
    "transcript_keywords": [
        "Heat",
        "mining",
        "garage",
        "Brandon",
        "wall",
        "Yeah",
        "GPUs",
        "Zoho",
        "degrees",
        "kind",
        "chainsaw",
        "put",
        "temperature",
        "time",
        "thing",
        "good",
        "meaning",
        "Wait",
        "watts",
        "guys"
    ],
    "transcript_entity_values": [
        "Brandon] Linus!",
        "Twitter",
        "40",
        "30 days",
        "a thousand or so",
        "three degrees",
        "one",
        "second",
        "PCI Express",
        "first",
        "100",
        "about 975 watts",
        "Brandon",
        "da da da da da da da da",
        "Two",
        "One",
        "only about four",
        "12 and a half",
        "K-Type",
        "2080",
        "zero",
        "A ton",
        "winter",
        "approximately 200 watts",
        "the LTT Forum",
        "Zoho",
        "the Firestarter 5000",
        "150 watts",
        "watts",
        "16X",
        "GPU",
        "15 or 20 minutes",
        "10 degrees",
        "today",
        "the end of the day",
        "Boop",
        "9.3 and 9.4 degrees",
        "120 volt",
        "About 16 seconds",
        "Three",
        "Amazon",
        "3080",
        "PCI",
        "FLIR",
        "years",
        "the Play Button PC",
        "months",
        "30",
        "Bitcoin",
        "AMD",
        "Gen Two",
        "4",
        "Zoho One",
        "PSU",
        "five degrees",
        "three",
        "Chainsaw",
        "Canada",
        "30-day",
        "four years ago",
        "3400",
        "SLI",
        "six",
        "Zoho One",
        "USB",
        "about nine degrees",
        "SilverStone",
        "Linus",
        "1200 watts",
        "only one",
        "two",
        "about 18 inches",
        "more like nine and a half",
        "Windows"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "LOC",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "DATE",
        "DATE",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "NORP",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "GPE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG"
    ]
}