{
    "id": "NRY7MAF_HoU",
    "title": "They told us it couldn't be done… - Fractal Ridge",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-12-15T22:02:33Z",
    "video_url": "https://www.youtube.com/watch?v=NRY7MAF_HoU",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "fractal",
        "ridge",
        "case",
        "sff",
        "small form factor",
        "pc build",
        "build guide",
        "cool",
        "fashion"
    ],
    "views": 713339,
    "likes": 20046,
    "comments_count": 836,
    "description": "Thanks to Secret Lab for sponsoring today's video! Check them out at   Small form factor cases have come a LONG way, with many requiring fewer and fewer concessions when it comes to PC parts and the new Fractal Ridge lets you push the limits of hardware while staying fashionable and compact.  Buy a Fractal Ridge Mini-ITX Case:  Buy a PNY VERTO GeForce RTX 4090 (Newegg):  Buy a PNY VERTO GeForce RTX 4090 (BestBuy):   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Big PCs are out of fashion 0:39 Unboxing 1:29 Front IO and internal design 4:00 Sponsor - Secret Lab 4:31 Parts list for the build 6:03 Building experience 10:07 GPU time..! 12:57 Finishing touches and overall thoughts 14:40 Outro",
    "description_links": [
        "https://lmg.gg/SecretlabSC",
        "https://geni.us/ZBBprj",
        "https://lmg.gg/g62E2",
        "https://lmg.gg/c7obn",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Computers, I love them, you love them, but don't you think they're just a little too dang big? Gross. What I'd rather have is something small, like the Fractal Ridge. Look at that, it's just little. I mean it's not the littlest you can get, but it's pretty dang small. At just 12.6 liters, it's supports up to a three and maybe even a half slot graphics card that's over 337 millimeters in length. Let's take a look! I live in a small apartment because I live in Vancouver, and real estate prices are absolutely obscene, which is why I like a small computer. This Fractal Ridge comes in white, but it also comes in black, and that's the one we're gonna unbox today and build a computer in. Ooh, what fun. So we got Ridge accessories, I appreciate Fractal's attention to detail and just putting in a clearly-labeled box. It's not just a non-descript box that you'll forget in the future. We have a block that I am uncertain as to what it's for, and we have a base stand. So this case can be mounted both vertically and horizontally depending on where you want to put it. We got a bunch of screws. We got a PCIe Gen 4 adapter. Interesting, I thought we had a riser cable. Inside the box is the case itself. A nice recyclable paper packaging and some nice, I can't remember what this is, PFT, P... This is the styrofoam that keyboard nerds want. So I'm gonna give this to Plouffe as a gift. For front IO, we have a combo 3.5 millimeter headphone-microphone jack, two USB 3.0s, and a USB-C. It's 3.2 Gen 2, not Gen 2x2, I don't believe. Oh, and it's a magnetic front panel. This has a nice fabric, it is pretty thick. Every single panel on this is removable, which is gonna be great because when you're working in a small form factor case, things can get a little tricky, trying to get into all those tiny crevices. And so here, we see the included 140-millimeter fans. As you can see right here, there's a split down the middle. You would put your motherboard and the rest of your components here, and then an entirely separate section and intake on one of the sides for your GPU. So these two fans will affect the thickness as you can, I don't know if you can really see it, Mark, but as you can see, it kind of clips over for the third slot, so your mileage may vary. I also appreciate captive thumb screws. That makes things a lot easier. So these side panels, they don't like just slide off. They actually have these two ball mounts, or what are these called? I don't know. They got those two balls that you stick in there. (chuckles) So this top panel is actually screwed in on both sides on a 140-millimeter fan, and no one does that anymore. So here's where you already can mount the 80-millimeter fans. Sadly, we can't mount on the top because we have our IO cables that come in here, as well as a pass-through cable so that we can mount our power supply, which is going, I think this is where the power supply is. We do have to take this off to get our power supply in there. So we're just taking off the top panel 'cause we're gonna get to building. Now from what I've seen so far, it looks like there is two 2 1/2-inch SSD mounts. For 3 1/2-inch drive mounts, it looks like there actually isn't any options, which is disappointing. I tend to store a lot of media and like having backups and stuff like that. And so usually, my computer always includes some sort of large-capacity hard drive. Instead of a riser cable, you can see they actually have a riser board. So this will plug into the motherboard, and then it passes on through to this side so that you can plug your GPU in. A great value add, it's nice that they include that. There are still some cases that don't include it or they include it for an extra cost. Usually, it's like 30 or $40. Cable management looks okay in an empty case. It looks like we'll have a decent amount of space in this kind of middle area, but it can always get hairy once you get hardware involved. We have some mounting channels along this middle bar right here that are actually specifically for cables. Other than that, I don't see other specific mounting points, I guess around here if you're running a cable along the edge. But we'll see what happens when we build it after this message from our sponsor. Thanks to Secret Lab for sponsoring today's video. Secret Lab chairs are engineered to keep you incredibly comfortable for long hours at work and play. Their new TITAN Evo 2022 chair keeps you feeling comfortable for longer. Four-way lumbar support, ultra comfortable line of different seat materials, and even more. I sit in one every single day, and it served me quite well. All chairs come with up to a five-year extended warranty and a 49-day return policy. And if you don't know if you love a chair by 49 days, then you don't know anything. So that's a pretty solid return policy. Head to the link of the description and check out Secret Lab today. For our build today, we have a few options. We've brought some things 'cause I wanna make some tests for sizing and fitting. We're using ASRock Phantom Gaming B650E. It's the only AM5 ITX board we have. We're gonna be putting in some Kingston FURY Beast DDR5. We got 32 gigs of that. A Ryzen 7600X, and it will be cooled by an NH-L12. Now CPU cooling is gonna be probably the biggest sacrifice you'll have to make if you're going for a gaming machine here. There is just not much vertical space for cooling. You're not gonna be able to get a super large cooler. This does have radiator support. Basically where these fans are, you can fit a 280-millimeter rad. That basically will limit you to probably a single-slot graphics card at best, and those don't really exist unless you're water cooling, which would be a pretty bold loop to try and put a 240-mil or a 280-millimeter rad in here. I'm not gonna try it. (chuckles) I've also brought a selection of GPUs so we can do some size tests to see what you can fit in 'cause sometimes, they say the dimensions, but if you really believe and are willing to force things into their spot, you can fit in a little bit more. So I'm gonna break a 4090 today. (steady music) The maximum cooler height is 70 millimeters, which is not very tall. Yes, 66 millimeters tall, so it just slides in under it. Something we won't be able to do is put a 120-millimeter fan on the top. We probably will not have space for that. (steady music continues) Yeah, this... (chuckles) - Oh no, it's a solid. (steady music continues) - We've encountered some fitment issues with our selected cooler. The issue is that with the way we've currently installed the brackets, it'll either go over the top, or if we put it the other way, it's gonna block that PCIe slot just barely. And because it uses a board and not a cable, pretty close, actually, I think we're okay. So while the cooler does technically fit, we also kind of need to be able to screw this riser in, I think from that side. Maybe we can screw it in from the other side and be okay. No, 'cause we need the pressure coming in. So this is gonna be not ideal. Okay, I'm trying to put the motherboard in. It's something to note. This pass-through from the power supply to the back is gonna get in the way of you installing your motherboard. So we'll need to just quickly take this out. (screwdriver ratcheting) In the accessories, you get some rubber washers for vibration dampening, some SSD mounting screws, SSD storage screws, case screws. Which ones are the motherboard screws? It would be nice, Fractal, if you labeled these in the future. So this case can support a SFX or an SFX-L power supply. SFX, SFX-Long. Just to make my life easier, I'm gonna go with the SFX power supply 'cause it's gonna give me more space to work around in. So this is kind of gonna be fun. (laughs) I got to screw through all of that. This is pretty bad. Okay, okay, let's try this again. Oh, you know, I did this little backwards. Don't make fun of me, internet, 'cause sometimes I forget the good advice that I'm supposed to provide, and I put the power supply in without any of the cables plugged in, and now it's gonna be a whole pain in my tuchus to get everything wired incorrectly. Mistakes were made. Fun fact about these fans, they come with a four-pin and a three-pin header so you can daisy-chain them together. So you'll only use one port on your motherboard for both of the fans, wow. You know how I talked about how this is gonna be an issue screwing it in? It's not because look at this, look at what Fractal thought about. You can take out like that, and now I can screw this back on and insert it directly into the PCIe slot on the board. Also, the computer's not POSTing, but we'll figure that out. Don't you worry. We put everything into the case, we tried to test to see if it worked, and it didn't. After a little bit of troubleshooting, we're here on another day, and we have a new entire system in it. Turns out that it was the CPU that was the issue. So now we have a ROG Strix X570-I motherboard with a Ryzen 5800X CPU, we have 32 gigabytes of DDR4 3,600 megatransfers per second of RAM, and then the rest is the same. One of the nice features is that they have this great pass-through so you can get cables to the other side of the computer. That's a lot of extra cable that I'm gonna have to contend with especially 'cause this is just gonna have the side panel on it. So as with any ITX case, you should always consider maybe getting custom-length cables. Since this is a tool-less mount, it should be as easy as just kind of pushing around there. Hey, look at that. Yeah, Fractal gave us the included cable ties, which is great 'cause as you can see, there's a lot of cables here. As I showed earlier, there are these 80-millimeter fan mounts just in here. You won't be able to fit them in with the one 140s just 'cause of this lip. You might have to do the 140s afterwards. Also, you should know that this removes some of the potential height of your GPU. I think using these 80-millimeter fans at the top, it's not a terrible idea. This is the divider. That means that this case is not separated into two chambers. So as your CPU heats up, that's gonna kind of just exist because there's no intake or outtakes on the CPU side. You're kind of gonna rely on your CPU fan just pulling away heat or blowing heat out. We have it configured to blow upwards and exhaust heat taking away from the motherboard. But if you start to saturate it, it is gonna kind of just linger in the case. So this might be a better way to get some more exhaust. Man, it is so nice that you can take off literally every side of this. That made building in it so much easier. Well, but what about a 3080 Ti? That looks like it's gonna fit no problem (David laughs) with the Founder's Edition, at the very least. Now there's a lot of really beefy 3080 Ti's. This is a 4090, famously thick. I'm not hopeful. That's a no-go. I think it's gonna be the plastic shroud with this, but I can't like- - [David] Well, get rid of that fan and see what happens. - We'll get rid of the other fan. - [David] Yeah, you don't need them. There's fans right here. - Yeah, I know, right? And because it's like a four-slot GPU, it's gonna go right up against the intake. - I think it's 3 1/2 slots. - It's four slots. It's more than three, it's automatically four. There's no such thing as a 3 1/2-slot GPU. Moment of truth. So dang close. If we just get a little bit of a extending action go- - Yo. - Oh, yo. Shut the front door, does it actually go in? What is it? What is preventing me from succeeding here? (screwdriver ratcheting) Holy crap, if this actually works. I don't think that this is actually designed to support cards this big, but we're going to places where Fractal would probably not recommend going. Who says I need a 4090, but I also need small form factor? Again, it's slightly separated so we're probably gonna be okay. Come on, just a little bit of that. - Just a little bit. - Just a little bit of that. And then are you supposed to go in there? Do you slide into these little brackets? I gotta slide this thing into, this is such a heavy card. What, huh? Well then, this is not mounting. I don't know how it would work with another card then. Oh my God, what have I done? I'm bending the (censored) out of this case. It's okay, it's metal. It bends back. (riser board clatters) Yeah, that came off. They gave you this little extender that extends the height here. So now we're cooking with gas. If you want a 4090, and I don't recommend doing this, you're gonna want to have at least one of these little bracket parts unattached 'cause you're gonna need some bending to happen here. Yeah, it'll get back into shape. It's just like me, I say that every year. How am I gonna connect the power? (laughs) That's gonna be the issue. It's in all the way, - Oh, I get it. - this just needs to be - Pressed up, yeah. - pressed up, so... I think we're gonna fricking do it, oh no. I forgot about this piece. Shut up, we're still good. - Hell yeah, bro. - We're still good. So we're using a little bit of extra manpower. - Yeah. - Yeah, but you've got ample extra manpower tho because this is not how it's supposed to go and we need to put a little bit of extra pressure to get these screw holes to line up. We're almost there, I'm just getting this last panel screwed on. We put a 4090 in it. I guess through our bending and tomfoolery, this button doesn't really press at the front now when we put the magnetic front panel on. So that doesn't really press in like it used to, and maybe even is actually pressing it right now and is turning it off. - Hmm. - I think that's literally what's happening. This is $130, which is a really good value for a small form factor case. These can get very, very expensive. There's lots of $250 like specialty cases that are gonna be of a similar size to this. Thermally, this looks like it won't be the best performer. It's probably not as ideal as say a sandwich layout where you can fit a couple more radiators. But at just 12.6 liters, I think Fractal has really succeeded in making a product that is both accessible not just by price, but to build in, and would be a great place to begin if you want to start messing around with small form factor stuff. So you can either put it vertically on this stand, you'd put it on the stand like this, or you can mount it horizontally. Now the eagle eye among you might have noticed that there's some random little big holes all over this. That's not just for mounting fans, it's also for mounting this case on its side. And then you can have your case in a console-like fashion. So it can fit in as a home theater PC. You can keep hearing it turning off. I think Fractal has a winner on their hands. This is a great case at a great price. It's easy to build in. It's very flexible In terms of configurations. Thermally, I think it will perform pretty well. I have heard some other reviews saying that there have been some issues just because you're limited by your CPU cooler height. You could put in a rad, but then that's gonna get all sorts of complicated over on this side. But 130 bucks, it's an awesome deal. Good job, Fractal. I really like this case, I kind of want it for myself. If you like this video, why don't you go and watch our video on the Fractal North, which is a bougie-ass-looking case. I can probably say bougie-ass. Can I say that?",
    "transcript_keywords": [
        "case",
        "Fractal",
        "put",
        "Fractal Ridge",
        "Yeah",
        "side",
        "CPU",
        "power supply",
        "fans",
        "cable",
        "kind",
        "small",
        "bit",
        "power",
        "fit",
        "motherboard",
        "cables",
        "panel",
        "GPU",
        "supply"
    ],
    "transcript_entity_values": [
        "7600X",
        "4090",
        "half",
        "32",
        "Fractal",
        "3.2",
        "2 1/2-inch",
        "66 millimeters",
        "USB 3.0s",
        "49-day",
        "ROG Strix",
        "This Fractal Ridge",
        "three",
        "Plouffe",
        "One",
        "RAM",
        "long hours",
        "70 millimeters",
        "250",
        "one",
        "240-mil",
        "another day",
        "just 12.6 liters",
        "Mark",
        "Vancouver",
        "280-millimeter",
        "3080 Ti's",
        "3 1/2",
        "130",
        "Secret Lab",
        "second",
        "the Fractal North",
        "Evo 2022",
        "over 337 millimeters",
        "Four",
        "IO",
        "PFT",
        "80-millimeter",
        "40",
        "120-millimeter",
        "David",
        "at least one",
        "3 1/2-inch",
        "one every single day",
        "32 gigabytes",
        "Kingston FURY Beast DDR5",
        "third",
        "140-millimeter",
        "Ryzen",
        "Edition",
        "3,600",
        "five-year",
        "49 days",
        "two",
        "the Fractal Ridge",
        "3.5 millimeter",
        "four",
        "130 bucks",
        "GPU",
        "30",
        "Gen 2x2",
        "ITX",
        "Ridge",
        "CPU",
        "140s",
        "ASRock Phantom Gaming",
        "today",
        "more than three",
        "SSD"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "EVENT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "DATE",
        "QUANTITY",
        "PERSON",
        "GPE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORDINAL",
        "FAC",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "ORG",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "NORP",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "FAC",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG"
    ]
}