{
    "id": "ntGrG11mDb4",
    "title": "These made me question everything - Kiwi Ears Orchestra Lite",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-11-16T22:22:05Z",
    "video_url": "https://www.youtube.com/watch?v=ntGrG11mDb4",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "hifi",
        "audio",
        "earphones",
        "headphones",
        "music",
        "audiophile",
        "bass",
        "highend",
        "mp3",
        "song",
        "IEM",
        "monitors",
        "earbuds",
        "wired"
    ],
    "views": 168031,
    "likes": 5864,
    "comments_count": 431,
    "description": "Thanks to Kiwi Ears for sponsoring this video! Check out their line of IEMs: Orchestra Lite:  Quintet:  Quartet:  Cadenza:  Dolce:   Kiwi Ears sponsored us to check out their Orchestra Lite IEMs, which they developed to compete with ultra high end competitors. Will these earbuds reap the fruits of their hi-fi labor? Join Adam as he takes these audiophile-tuned earphones for a spin!  Want us to unbox something? Make a suggestion at    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - Intro 1:23 - The Drivers 2:18 - The Cable & The Tips 3:37 - Adam's Thoughts 4:56 - Labs Results 6:30 - Comfort 6:57 - Price & Conclusion",
    "description_links": [
        "https://lmg.gg/kiwiearsorchestralite",
        "https://lmg.gg/kiwiearsquintet",
        "https://lmg.gg/kiwiearsquartet",
        "https://lmg.gg/kiwiearscadenza",
        "https://lmg.gg/kiwiearsdolce",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "Kiwi Ears is yet another brand to come out of the Chinese hi-fi scene, also known as chai-fi, which as a white man, I feel a little uncomfortable saying every time I say it. Kiwi Ears has sponsored this video and they sent us over a whole bevy of delicious IEMs. We got the Dolce's, we got the Cadenza's, we got the Quartet's, we got the Quintet's, and we got the orchestra light, which is what we're gonna be looking at today. Now, I've heard of Kiwi Ears, you know, people often bring them up in discussions with other companies, but I actually haven't had an opportunity to listen to Kiwi Ears before, so I'm actually pretty excited about this. Today we're looking at their orchestra light IEMs, which has eight balanced armatures in each headphone. That's crazy. For those of you who don't know, a balanced armature is a type of headphone driver, so that's what makes the sound. One way to think about it is it's kinda like a diving board. It wiggles up and down like this, and that's what produces sound, as opposed to being like a cone, like a typical speaker, or a dynamic driver. But that's not the case for this. This is balanced armatures all the way down, and eight of them, which is kind of crazy to me, because that is a lot of little speakers for some very, very tiny headphones. I'm immediately, I love these already. Kiwi Ears says that these are made with a medical-grade epoxy resin, and that they're hand-soldered, and I believe it, because I don't know how else a machine would make it in this exact fashion. It's pretty dang cool. These are gonna be your balanced armatures that are focused on bass right at the top of those two big boys. Then along the side, you can see one, two, three, four. It's kinda tough to see the fourth one of the mid-range drivers. And then you also see that tiny little pair right there. That's two. Those are gonna be handling the treble. That's so cool. I love that you can see right inside of these. Oh, I love these so much. These are so cool. We need to see what else is in the box. Foam carrying case, which is nice. Something to know about these Orchestra Lite IEMs is that they're like a refresh, or I guess a different version of the Orchestra IEMs that they've already released, but they're at like half of the price or something. Kiwi Ears says that they've found a lot of ways to make these more efficiently and on a cheaper budget, and they're trying to pass the savings on to you, but half the price mean half the performance? Well, Kiwi Ears claims that that's not true, that these are gonna be just as delightful and wonderful as their Orchestra IEMs, which I have not listened to. Now, back to what's in the bag. So you get a nice custom hand-crafted cable. Not the longest cable. What the hell was that? I mean, to be fair, it was held on by tape. It looks like the cable doesn't have much memory, which means it's not bouncing back and trying to reform into the coiled ball that it was in here. Elsewhere in the bin, we have, wow, a lot of eartips. We've got eartips in three different sizes and three different styles. I'm not sure if there's any actual difference between the styles of eartips. They all look pretty similar. One thing I do wish that was included was maybe a set of foam eartips. I prefer foam eartips, but that's all we're gonna have to do. Let me grab my favorite pair and let's dress them up. I will say that to get the three-way crossover of all of these balanced armatures, the nozzle on these has to be quite big. And if you're somebody with small ear canals, like yours truly, these could cause issues for fit. I guess there's nothing left to do, but take a listen to them. The nozzle on these are quite large and I can feel it in my ear canal, but I'm still getting a really good seal. My ears are plugged. Cable noise is actually quite good. There's still a little bit of lower vibrational noise, but I think that it's pretty good from what I've heard. It's not ringing or really resonating. So, good job, Kiwi Ears. One thing that Kiwi Ears set out to do was create an IEM that's gonna have a sound signature that's gonna please a lot of people. They're probably gonna be doing something like targeting the Harman curve, which is what we base our own headphone target here at LMG on. And I think they've probably done a great job at that. They're fun, they have punchy bass, they're still rich, and they have a lot of detail in the highs. And I think specifically the way they've tuned the highs, it gives it a feeling of space that you don't get with a lot of headphones. And I find that that soundstage really resonates with these IEMs. And I think that that's pretty impressive because IEMs, it's always kind of difficult to make it sound like it's bigger than just the head that's wearing them. I think that Kiwi Ears is actually getting quite a bit out of the eight armatures in here. They have those two bass balance armatures, give it plenty of punch. And the two treble ones provide actually quite a bit of detail. I would border on maybe a little bit too crispy for my taste but I'm sure if I spent a little bit more time with them, I would probably adapt quite well. It's definitely not offensive, that's for sure. You might find that these will benefit from like a dedicated DAC and amp, especially if you're going for like really critical listening. But if you're also looking for some versatility, allowing you to maybe just take these when you travel, you don't wanna bring a whole proper source with you, I think you're also gonna be pleased. But that's my opinion. Let's take a look at some squiggly lines. Looking at our labs results, we can see that it does actually follow our curve pretty nicely. I think it's funny that Kiwi Ears calls out like a bass boost, a bass bump. But to me, it sounds like it follows the Harman curve pretty well. I wouldn't call it very like boosted, but it definitely has the fun that is typical of a Harman curve based headphone. And I thought it sounded quite delightful. You might find that there may be a little bit of honk if you're particularly sensitive to that. That kind of sounds what it is. Maybe like horns and treble section sound like they're more like, meh. But as we go up, we see that the treble looks actually a little bit laid back compared to our target. Just in the lower brilliance region, we see a dip of about six dB around 7K, which might be where I'm finding the dryness is I think that that dip might be making things sound a little bit less full in the high end and making things sound a little bit more brittle because we have an increase in brilliance for the rest of it. Moving on to noise isolation, you can see that these have a pretty solid attenuation of the high end, which is exactly what you'd expect for earplugs. And then as we get lower down into the bass and sub bass region, they don't attenuate so much. This is completely normal. Usually, if you wanna get rid of any noise below the kind of like low mids, let's say like 500 Hertz, you're gonna need to use active noise cancellation, which these don't have. They don't have microphones of any kind. But I found that, yeah, I got a really solid seal with these and they plugged things up hecking quiet. It's, you guys have to yell. It's like, I've not listened to anything and it's very plugged. My ears are very plugged. In terms of actual comfort, I find that the shape makes them very lovely. It's a kind of, it's a very common shape that we've seen a little bump here that kind of balances the weight of that earphone. So it doesn't sit like, it doesn't feel like it's hanging out of your ear and it nestles nicely into this part of your ear. There's a term for it. I don't know it. I'm not a scientist. And I think that they're actually pretty comfortable, assuming that you have the ear canals that are big enough. You can get the Kiwi Ears Orchestra Lights for 250 USD. That's dollars, my friends. And if this is out of your budget, don't worry, Kiwi Ears has got you covered with a whole beverage of cheaper options that I don't have time to check out today, but I will be checking out in my own time because I like headphones and I like you. Thanks so much for watching and thanks Kiwi Ears for sponsoring this Short Circuit. If you liked this video, well, we have so many more that you can watch. You just gotta click on the button at the bottom. This is Short Circuit and then you can go there and then it'll have all the videos and then you can click on other videos and you can watch them. You can watch ones that I'm in. You can watch ones that other people are in. There's so many good videos on Short Circuit. Please watch Short Circuit.",
    "transcript_keywords": [
        "Kiwi Ears",
        "Chinese hifi scene",
        "Ears",
        "Kiwi",
        "Kiwi Ears Orchestra",
        "Chinese hifi",
        "Ears Orchestra Lights",
        "ear",
        "Short Circuit",
        "bit",
        "kind",
        "Kiwi Ears set",
        "pretty",
        "Kiwi Ears calls",
        "orchestra",
        "IEMs",
        "Kiwi Ears claims",
        "balanced armatures",
        "sound",
        "orchestra light"
    ],
    "transcript_entity_values": [
        "half",
        "Orchestra",
        "the Kiwi Ears Orchestra Lights",
        "Hertz",
        "Harman",
        "three",
        "One",
        "one",
        "LMG",
        "Quintet",
        "about six",
        "Cadenza",
        "DAC",
        "Dolce",
        "Today",
        "Quartet",
        "Orchestra Lite",
        "Kiwi Ears",
        "Chinese",
        "Harman",
        "two",
        "this Short Circuit",
        "250 USD",
        "four",
        "500",
        "Short Circuit",
        "eight",
        "today",
        "fourth"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL"
    ]
}