{
    "id": "NTlDSUCattc",
    "title": "The electric Porsche Taycan is ready to take on Tesla",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-11-27T15:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=NTlDSUCattc",
    "category": "Science & Technology",
    "tags": [
        "porsche taycan",
        "porsche",
        "taycan",
        "ev",
        "evs",
        "electric vehicle",
        "electric car",
        "porsche electric",
        "new car",
        "2020",
        "new porsche",
        "tesla",
        "tesla cybertruck",
        "cybertruck",
        "tesla model x",
        "model y",
        "model s",
        "test drive",
        "test ride",
        "first ride",
        "first look",
        "hands on",
        "tesla model s",
        "driving",
        "electric",
        "porsche vs tesla",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "mkbhd",
        "apple",
        "google",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 427331,
    "likes": 6878,
    "comments_count": 752,
    "description": "Porsches first electric car, the Taycan, is finally here. The storied German sports car manufacturer has made an electric performance car that makes a few sacrifices compared to its combustion engine counterparts. The Verges Senior Reporter Sean OKane took one of the first pre-production Taycans for a five-hour drive through the mountains east of Los Angeles, California to get a taste of Porsches electric future.  Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/35FCDSB",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(energetic music) - Hey, everybody. This is Sean from the Verge, and I'm standing in front of Porsche's first eclectic car, the Taycan. Now, we've known about this car for a few years, but today, we're actually gonna' spend about five hours taking it on a road trip outside of Los Angeles to really get a sense of what it's all about. So, let's go. (energetic music) - [Sean] So, one of the first things you notice when you sit down in the Taycan, is that it's just full of screens. The sort of crown jewel of all of that is this big boomerang-shaped display up behind the steering wheel. I actually really, really like it. It's probably my favorite thing about the car so far. Everything is crisp and sharp. Then we have the main information touch screen in the center of the dashboard, and that's where all the infotainment stuff happens this is where CarPlay happens, there's no Android auto on the Taycan, just so you know. And, then there's this touch screen in the center console which is for climate, settings, and some other car settings and things like that. What's interesting about this center console touch screen is that it has haptic feedback. It has also a little bit more give to it, so there's a sort of funking that's happening, like a little buzz that's happening to give you some feedback, and let you know that your taps are being registered. So, all the haptic feedback on this center console is nice in theory, it's not really doing a lot to help me solve the problem of not really knowing exactly where I'm tapping. It also doesn't help that I'm still not familiar with the infotainment system and everything and I'm sure you could get more used to it. (energetic music) So, electric cars are relatively quiet. But, what Porsche did, it created this thing called the Electric Sport Sound. It is a $500 add-on to the Taycan. So, a 150,000 or 180 some thousand, plus $500, and this is the result. I actually kinda like it. It's louder than I expected. Ready? (car accelerating) It's this very futuristic, smooth, (car accelerating) almost like sing-songy sound. It's kinda wild. For 500 bucks it better be. All right, so we are at about the half-way point. We've driven for about two hours now. The car's down to 52% battery, 121 miles. We actually don't have the full EPA estimate for range, so, it's you know, mid-to-high 200's right now based on the European model. Maybe a little bit less when the EPA finally releases its range figure. The best part about this drive is that the rest of it is going to be almost completely through this really twisty, mountain road with lots of elevation changes which is wonderful because everything we've talked about up until now, is really all about like, the (mumbles) of the car, and the technology that you'd use every day. But, this is ultimately a performance car, a sports car with how fast it is, and that's what a lot of the people who are gonna' be buying this car are really going to be buying it for. And, this is gonna' be a good chance for us to put some of that performance to the test. All right, ready? Zero to 60 in three seconds. - Oh! (laughing) (car accelerating) (laughing) - Oh, man. - Yeah, that'll move ya'. - [Sean] Tesla's similar, like launch mode, definitely is as powerful as this. There is something about this one though. What Porsche did is it put a two-speed gearbox in this one, almost specifically for those moments where you're taking off from zero, so that there's one gear dedicated to getting you off the line as quick as possible. I have not felt something that snaps like that, even in another electric car. That was really wild. (upbeat music) Porsche has spent a lot of time, actually, working with electric motors. This may be its first electric car, but, Porsche has spent years putting electric motor technology into its motor sports division and then transferring that to the road with some of its hybrid cars like the Porsche Panamera S E-Hybrid. And, so, all of that is really coming together here in the Taycan, as the first electric car from Porsche built to perform like crazy. So, this car has got the lowest center of gravity out of any Porsche ever made which is great because that means that it's a little bit easier to make it through these turns than it normally would be in a car that weighs over 5,000 pounds. The battery being all across the floor, like, is the case in a lot of E-V's means that it's just gonna' settle right wherever you wanna' put it. You have to be a little careful on the breaks because the breaking isn't rock-solid like you would expect in a super car, or something built for the track. But, the weight kind of helps you out with that. But, breaking is not what's fun about this car. What's fun is hitting the accelerator and going fast, and that works pretty well. (playful music) So, we've made it to nearly our final destination. We are clearly in a big-box parking lot getting some charge from the electrify America chargers which is the network being built out by Volkswagen, which is Porsche's pairing company. We came out of the mountains with about 24-ish percent of the battery left after a good solid four plus hours of driving and in just under 20 minutes we've just added 50% of the battery back to it and that's not even reaching the full, sort of charge rate this thing can take. For whatever reason, we're not getting it from the charger right now. In the mountains I was working the car pretty hard and at one point, got the battery down to about low 70 miles and low 20% battery capacity but the good thing is that we were coming down out of the mountains so the car was regenerating a bunch of energy back into the battery, and for a good 45 minutes we didn't lose any range. Everything we were using to go fast, we were making right back up by going right back downhill. Big picture, a lot of people aren't going to own this car. It's a very expensive car. This wasn't even the most expensive spec by any stretch of the imagination. And, even the cheaper version that's going to be coming out, that is slightly under the performance capabilities of this, is still gonna' cost around $100,000. So, we're talking about cars that are at, or even in some cases, more expensive than the other best performing electric cars on the market. A lot of people have asked me who I think this car is for, and you know, it's for people who want to own a Porsche and maybe wanna' change up how that Porsche is powered. That's basically the simplest way to put it. This is not necessarily something people are gonna' run out and buy because they wanna' feel a little bit better about the environment. This is something that people with the money to buy a top-tiered Porsche are going to buy, and the good thing is that it feels very much like a car that makes no sacrifices, compared to other Porsche's. As for the really big questions, like, is this better than a Tesla? I can't really answer those after just five hours in the car. What I can tell you for sure after driving this car today, is that we're gonna' be asking those questions for a very long time. Thanks everybody for watching. Make sure you like and subscribe. If you're really curious about Tesla, and you haven't seen our video about the Gigafactory last year, we had a whole big feature on what they're doing out in Reno, Nevada. The batteries, the electric cars, and the future of the company. Go check it out.",
    "transcript_keywords": [
        "car",
        "Porsche",
        "electric cars",
        "electric",
        "Taycan",
        "cars",
        "lot",
        "battery",
        "Los Angeles",
        "thing",
        "people",
        "center",
        "good",
        "center console",
        "touch screen",
        "Porsche Panamera",
        "bit",
        "hours",
        "put",
        "back"
    ],
    "transcript_entity_values": [
        "zero",
        "Los Angeles",
        "about five hours",
        "last year",
        "four plus hours",
        "Android",
        "one",
        "121 miles",
        "20%",
        "over 5,000 pounds",
        "around $100,000",
        "Volkswagen",
        "EPA",
        "today",
        "Tesla",
        "Porsche",
        "Verge",
        "three seconds",
        "just under 20 minutes",
        "60",
        "a few years",
        "years",
        "52%",
        "half",
        "America",
        "Gigafactory",
        "two",
        "24-ish percent",
        "50%",
        "about low 70 miles",
        "a good 45 minutes",
        "just five hours",
        "Reno",
        "Sean",
        "CarPlay",
        "Nevada",
        "180 some thousand",
        "500 bucks",
        "first",
        "about two hours",
        "500",
        "European",
        "Zero",
        "150,000",
        "Taycan",
        "the Electric Sport Sound"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "GPE",
        "TIME",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "TIME",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "TIME",
        "PERCENT",
        "QUANTITY",
        "TIME",
        "TIME",
        "GPE",
        "PERSON",
        "FAC",
        "GPE",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "TIME",
        "MONEY",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "FAC"
    ]
}