{
    "id": "Ntp5Ikkaamk",
    "title": "This was SO CLOSE to greatness... - LG S95QR Soundbar",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-08-18T20:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=Ntp5Ikkaamk",
    "category": "Science & Technology",
    "tags": [
        "Soundbar",
        "unboxing",
        "impressions",
        "review",
        "unbox",
        "audio",
        "home theatre",
        "lg",
        "buy",
        "dont"
    ],
    "views": 570891,
    "likes": 17876,
    "comments_count": 853,
    "description": "Save 10% on XSplit's video tools at   Dan's here to see if the new LG S95QR Soundbar is worth its high price tag in the world of great Sony and Sonos soundbars. Will it live up to the competition or should you stick to your TV's speakers?  Buy an LG S95QR Soundbar:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 I've got high hopes 0:30 Unboxing 1:00 Exterior impressions and what's included 1:57 Features, buttons, and ports 2:57 Wireless satellites  3:51 Wireless subwoofer 4:46 Sponsor - XSplit 5:23 Trying to use the app  5:53 Dolby Atmos demo impressions 6:53 Tuning the soundbar and trying again 8:03 Trying different sound modes 8:36 Crab Rave time 9:13 Sine Sweep impressions (ft. Linus) 10:33 Overall thoughts 11:26 Outro",
    "description_links": [
        "https://lmg.gg/xsplit",
        "https://geni.us/rD0R",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "(upbeat music) - No, I was gonna pop up. - [David] Oh. (beeps) (upbeat music) - Oh, hello there! Today, we have a nice refined offering from LG, the S95QR. 9.1.5 channel surround system soundbar, two satellites and a subwoofer. Really excited about this today. If I like it, I think I want it for my house, but the price is little high. It's 1,799 U.S. So we'll see if the price matches the performance. (Dan grunts) It's heavy. (cutter slitting) We're starting right on top with our soundbar. Oh, it's a big boy. (Dan grunts) Look at that whole length of the box. Box of peripherals, cables, that sort of thing. (Dan grunts) Big boy. (plastic crumpling) And here, I think we have our little satellites. Well, they're not so little, but they look nice. That's for sure. (plastic crumpling) And that's about it. (box thuds loudly) It's heavy. Look at that. So, it's got a nice brushed finish on this. Doesn't look like it's picking up fingerprints that badly. This guy is long. It's 47 inches long. Got a nice cloth covering at the front there. Some little rubber feet on the bottom. There's our AC input. Got our three up firing speakers. And I believe we have 1, 2, 3 in the front. This type of soundbar would be great for a 55 to 65-inch TV. Anything bigger or smaller might be dwarfing it a little bit. But looking at this, with the size of the speakers and its construction, I have high hopes, which I would expect for the kinda money they're charging for this. Got a remote. Feels a bit plasticky. Oh, comes with batteries. Yes! Love it when they come with batteries. And an HDMI cable. I was wondering if they were going to include that. I've already got one set up. So we won't use that right now. Got a nice online manual. It's not like a PDF or something. It's more like an intractable webpage which can be a little bit frustrating at the start, but it actually works quite well. Soundbar has pretty much every technology under the sun. All on the back here, it's got this nice tattoo IMAX Enhanced DTS:X, Dolby Vision, Dolby Atmos, Bluetooth. It's even got HDMI. All that there. Nice subtle branding on the top. None of this big giant LG stuff. Got some touch buttons right in the center there. And for ports, what do we got? We've got optical again, which is nice. But this one actually does come with HDMI. Comes with three in fact. We've got two HDMI ins and an HDMI out to the TV, which supports eARC and ARC which is the Audio Return Channel. So you can throw your stuff into your TV, have it come to this, and it'll all work properly with audio. We've also got a five volt USB port here which can deliver up to half an amp which will power little things like maybe a Chromecast or something like that. Unfortunately, I'm noticing it's immediately picking up an incredible quantity of dust. Every tiny little thing just shows up really nicely. It's not catching fingerprints but it's really catching lots of dust. What you might have noticed with the ports is that there's no connections for the sub or the satellites. Thank God, they're all wireless. Now, let's have a look at one. (plastic crumpling) Oh! (plastic crumpling) It's nice. The styling is kind of subdued. It's covered in a sea of that same metal is on this, which is picking up dust like nothing. And on this guy, all we get is just a little pair button and power at the bottom. Nice cable trail for that too. They feel kinda hefty and sturdy. We've got our up firing speaker 'cause this is a five 9.1.5 channel system. So it has five up firing speakers, which is what the 0.5 at the back is for. They're labeled right, nicely there. And it looks like we do have a mount for the wall on the bottom there. Believe each of the satellites of the back has about three speakers in it. One at the top, one at the front, and one for the side. I'm not entirely sure. I think it's probably that way. Finally, let's have a look at this sub. Oh! (beep) (plastic crumpling) The weight is encouraging. I'll tell you that. (plastic sliding loudly) Ta-da! A lot of companies these days are doing these nice thin subs. So instead of having the speaker down like this and taking up a massive quantity of floor space, you've got the speaker at the side. Your bass reflex port at the front. This is like a nice finished wood, sort of a similar finish to the metal on that soundbar. (plastic crumpling) But it's not catching fingerprints. It's still catching all little tiny pieces of dust. You can hear the texture on that. And like the satellites, this one just has AC in and a pairing button. Big speaker on the side. I believe this is 220 watts, which is pretty impressive. All the rest of the speakers are more like 40 to 45 watts which is not bad when you have so many. Before we get this all set up at our nice TV, I wanna tell you about our sponsor, XSplit. Thanks to XSplit for sponsoring this video. XSplit is a trusted live streaming and recording software designed for gaming, presentations and live events. It offers useful features like XSplit Broadcaster and all-in-one streaming and recording solution designed for content creation. Connect: Webcam, which turns your smartphone into a webcam. Presenter, which lets you add personality, flare and interactivity to presentations. Capture, which lets you capture images and record your screen. So you can add annotations, a voiceover, and share as a link in seconds. And VCam, a fantastic virtual background tool for webcams. Use code LINUS at the link below and save 10% today. And here we are. Everything is beautifully set up and ready to go. The soundbar itself also has a nice little display on the front of it. I've also got the LG app here. So I'm gonna connect to it and see if we can get everything set up. They can see it slowly getting covered in dust. Oh, this looks exciting. It still says WiFi. Display is a bit brighter now. Mute all function WiFi. And let's see. It's already found all the other speakers. I didn't have to do anything. Should we start by doing some AI Room Calibration? What do you think? It is now updating the devices. So we get to do nothing. After the update, I couldn't seem to get it working on the app again. So let's just give her a go. We'll see if we can get some signal through it and watch some stuff. So this is the standard Dolby Atmos demo that I have used before. The problem-- Bill just connected his phone to the unit to try and get it set up on WiFi and it's disabled my output. It would be really nice if there was an output to the display when you're setting it up to let you know what's happening and maybe what steps to do, that sort of thing. Okay. Well, I do a Dolby Atmos. - [Voiceover] Now, sound moves around you in three dimensional space (bomb bangs) with breathtaking audio quality. - [Boy] Whoa! What is this place? - It's pretty good actually. I'm not entirely sure all the Atmos is functioning. Sound feels at the very sides are not really there. These are definitely working. Sub is slightly too boomy for me. I would probably tune that down a couple dB. It's probably not mode or node related because it's all the sub, just the sub is too loud. I'm just going through the menu here. It would be really nice to have a display. TV remote is on auto power. So really, I just get to choose if I have surround on or if there's auto power. Can we tune it? So we got WFCO CAROV treble base WFCO VC. So we got WFCO CAROV treble base WFCO VC. (intense music) (bombs explodes) (intense music) I've turned the bass down by five. It sounds a little bit better now. I do wanna get my ear up nice and close to see if we are doing up firing. (intense music) Yeah, they're-- They are working. That's for sure. (intense music) (air whooshing) (intense music) This is weird. Definitely doing its 9.1.5 or whatever. Side is little weak, but the behind is really good. I didn't have to do anything in the app to get everything paired. Everything's nice. I want more controls over it. Believe it's designed to use the app and I can't use that now. So I'm upset. Could be different tuning. So we've got Standard, Music, Cinema, Clear, Sport Game, Bass or AI, whatever the hell that means. Instead of just Cinema, see if that makes it anything worse. - [Voiceover] Dimensionality (bombs explodes) - That's a lot bass here now. Cinema mode is damn crispy. All of the preset EQs are all quite nice and I can see them being used for different things. There's a lot of variation in the bass level and the highs and the crispies. For movies, I think I would really enjoy Cinema. It's kind of reduces the bass slightly, maybe adjusts the crossover point and makes everything louder and brighter. Just wanna remark. This is like volume on 21. So it can go even higher. These things will put out some audio. I'm putting that. (upbeat music) (loud upbeat music) (upbeat music) No, it's not YouTube and compression. There is something missing there. So I identify that in the sine sweep. It's not a normal place that I would normally see a missing audio, but it's kind of creates a bit of a hollow sounding like a (screams softly). (soundbar bleeps softly) (soundbar bleeps loudly) There were a couple spaces there where I was moving my head around and the sound was actually changing. So I think we actually do have some modes and nodes here. So the thing that it was missing was I set up my room badly. I'm really close to this wall. You really don't want that. With a setup like this, you have to pay more attention to the layout of your room. You want a long rectangular room and you wanna sit at the center of the short side. So if I was sitting on this side of the couch, my experience would be different than if I was sitting on the other side of the couch. Just 'cause I'm here, we're getting weird reflections. It was more apparent in the 300 to 400 degree hertz range where moving my head six inches was taking me in and out of the nodes. I think the positioning of these speakers might be slightly incorrect. But from that sort of experience, hearing those modes, all of this was very even, maybe a little weak in the bass end but I can't control from that because of the modes and nodes. The large frequencies, you're canceling each other and creating big volume dips. That will be different depending on your physical location around your living room or home theater. However you wanna put this in your house. The music's nice and crisp and clean. The connectivity is a major issue. I think having the app not work and not allowing me to adjust some of the settings that I wanted to is kind of a deal-breaker for me honestly. The app had like two stars out of five which is kind of sad honestly. Setting it up initially was super easy. As a recommendation for this amount of money, I would certainly try something else that gives you more control, maybe a better app. The speakers themselves are good. Having a 9.1.5 for under a ridiculous sum of money, I think is very reasonable. This setup will require more effort on your part to make sure that it's installed correctly. Make sure that these are the correct distance from you. Make sure that the soundbar isn't creating any vibrations, that sort of thing. Our ceiling is just a big plastic sheet rather than a real reflection. And it's also way higher than you would normally expect. If you like this video and wanna see another ones, Linus did a great unboxing of a Sony soundbar that's in a similar price category and also really good.",
    "transcript_keywords": [
        "nice",
        "speakers",
        "soundbar",
        "Dolby Atmos",
        "HDMI",
        "side",
        "bass",
        "kind",
        "app",
        "bit",
        "big",
        "set",
        "speaker",
        "thing",
        "WFCO",
        "Dolby",
        "Atmos",
        "Audio",
        "Room",
        "front"
    ],
    "transcript_entity_values": [
        "3",
        "Webcam",
        "0.5",
        "2",
        "47 inches",
        "six inches",
        "three",
        "Soundbar",
        "One",
        "65-inch",
        "five volt",
        "U.S.",
        "USB",
        "WFCO VC",
        "300 to",
        "Chromecast",
        "400 degree hertz",
        "220 watts",
        "Today",
        "dB.",
        "about three",
        "seconds",
        "Cinema, Clear, Sport Game, Bass or AI",
        "today",
        "Dolby Vision",
        "AC",
        "Cinema",
        "1,799",
        "VCam",
        "LG",
        "21",
        "1",
        "these days",
        "Sony",
        "two",
        "10%",
        "55",
        "Audio Return Channel",
        "Standard, Music",
        "up to half",
        "Linus",
        "IMAX",
        "Dan",
        "Dolby Atmos",
        "five",
        "LINUS",
        "Atmos",
        "YouTube",
        "Ta-da",
        "XSplit",
        "PDF"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG"
    ]
}