{
    "id": "NXpeXn0SKPU",
    "title": "2023 Roadmap to Master Hacker",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2023-01-01T15:00:12Z",
    "video_url": "https://www.youtube.com/watch?v=NXpeXn0SKPU",
    "category": "People & Blogs",
    "tags": [
        "cybersecurity",
        "cybersecurity jobs",
        "hacking",
        "comptia",
        "comptia a+",
        "comptia network+",
        "wireshark",
        "vmware",
        "sql",
        "sql injection",
        "comptia security+",
        "python",
        "golang",
        "perl",
        "digital forensics",
        "database",
        "cryptography",
        "ethical hacking",
        "hacking jobs",
        "hack the box",
        "try hack me",
        "pico ctf",
        "htb",
        "thm",
        "cyber security career",
        "cybersecurity careers",
        "ceh",
        "oscp",
        "ine",
        "elearn security",
        "ejpt",
        "oscp certification",
        "ctf for beginners",
        "first job",
        "cybersecurity job",
        "kali",
        "kali linux",
        "comptia certs",
        "mindset"
    ],
    "views": 478612,
    "likes": 19341,
    "comments_count": 612,
    "description": "This is your path to becoming a master hacker. From zero to getting the skills you need to be successful.  // MENU // 00:00 - Coming up 00:43 - Top skills for hacking 01:34 - The Hacker Mindset 01:49 - Analytical/Problem Solving Skills // Be creative 05:34 - Persistence // Never give up 08:50 - CompTIA A+ and basic computer skills 09:21 - Networking skills // CompTIA Network+ and virtualisation 09:47 - Linux // CompTIA Linux+ 10:18 - Virtualization 12:02 - Basic Wireshark knowledge // Practical Packet Analysis 13:48 - Security concepts and technologies // CompTIA Security+ and Hackers Arise Security+ Training 15:48 - Scripting skills // Python and GO 17:40 - Database skills // SQL injection 19:04 - Web application skills  19:57 - Forensics background // Understanding what you leave behind 21:28 - Learn more on Hackers Arise 22:35 - Cryptography skills 23:42 - Conclusion  // Videos mentioned // Top hacking books:  Wireshark with Chris Greer:  Vickie Li Bug Bounty Bootcamp:   // BOOKS // - Linux basics for hackers by Occupy the Web:  - Gray Hat Hacking Sixth Edition, The Ethical Hackers Handbook by Various Authors:  - This is how they tell me the world ends by Nicole Perlroth:  - Hands on Hacking by Matthew Hickey and Jennifer Arcuri:  - Penetration Testing by Georgia Weidman:  - The Science of Human Hacking by Christopher Hadnagy (social engineering):  - Getting started becoming a master hacker by Occupy the Web:  - Black Hat Python by Justin Seitz and Tim Arnold:  - Hacking Connected Cars by Alissa Knight:  - Hacking: The Art of Exploitation by Jon Erickson:  - The Pentester Blueprint by Phillip L. Wylie and Kim Crawley:  - Hacking APIs by Corey J.Ball:  - Bug Bounty Bootcamp by Vickie Li:  - Network basics for hackers by Occupy the Web (coming in 2023)  // David's SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // Occupy The Web's SOCIAL // Twitter:   // OTW Discount // Use the code BOMBAL to get a 20% discount off anything from OTW's website:   cybersecurity cybersecurity jobs hacking  comptia kali kali linux  Disclaimer: This video is for educational purposes only.   Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel  #kalilinux #hacking #cybersecurity",
    "description_links": [
        "https://youtu.be/trPJaCGBbKU",
        "https://www.youtube.com/playlist?list=PLhfrWIlLOoKO8522T1OAhR5Bb2mD6Qy_l",
        "https://youtu.be/QqrK294l_oI",
        "https://amzn.to/3A2oJM1",
        "https://amzn.to/3TkI0Pr",
        "https://amzn.to/3NWj3st",
        "https://amzn.to/3WImAia",
        "https://amzn.to/3UL1i1D",
        "https://amzn.to/3UssbaM",
        "https://amzn.to/3EmguNa",
        "https://amzn.to/3yQIdTD",
        "https://amzn.to/3G5cRN5",
        "https://amzn.to/3ElVhTI",
        "https://amzn.to/3WIoGP4",
        "https://amzn.to/3EfXDT5",
        "https://amzn.to/3GlG8U3",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://twitter.com/three_cube",
        "https://davidbombal.wiki/otw"
    ],
    "transcript": "OccupyTheWeb: They can't comprehend that kind of timeframe, but how long it takes to be able to get inside of highly secure systems. So once that happens, then you get hooked on it, right? Once you've been able to hack a system, a real system, then there's a certain amount of addiction that takes place that you want. Then you start getting into it and finding different ways of doing it. And I think that is one of those skills that we can't overlook. There are some areas and some disciplines where it's not that important, but in this area, it's key to being able to be a good hacker. David Bombal: Hey, everyone. David Bombal back with OccupyTheWeb. I've got a whole bunch of books here. These are the books that he's authored. Well, some of these books. Linux Basics for Hackers. Fantastic book if you want to learn Linux from a hacking point of view. He's also written Getting Started Becoming a Master Hacker. He's also written other books, which are hopefully coming out soon. And in a previous video, which I've linked below, he tells us or discusses the books that he recommends that you buy if you want to get into hacking. OccupyTheWeb, welcome. OccupyTheWeb: Thanks, David. It's good to be here again. David Bombal: It's great to have you back. In today's video, you are going to be telling us the top skills that you recommend someone get if they want to become a hacker. Is that right? OccupyTheWeb: Yes. I think we're going to talk about some of the skills that they need and the mindset as well. Let's talk about some of the mindset, which I think oftentimes is overlooked in terms of becoming a really good master hacker or a hacker in general. One of the things that is often overlooked is that, to become a hacker, to be an effective hacker, you have to have analytical or problem-solving skills, unlike some other disciplines where you can basically follow a cookbook to be able to do the job, to be able to effectively become, say... I don't mean to pick on anybody, but say a database administrator. Right? A database administrator has lots of books that are written out. You get trained and you know what to do. Not necessarily the case with hackers. Hackers have to think creatively. They have to be able to think outside the box, to use a well-worn clich. So they have to be able to do problem-solving. Some of the metaphors I like to use is that, for most people who have to use a computer, that's similar to, say, being able to drive the car. If you just have to use the computer for whatever, sending emails, browsing the web, getting information, creating documents, that's very similar to just being able to drive the car. On the other hand, a hacker has to not only know how to drive the car, but they have to know how to disassemble the car and then reassemble it as well and still have it work at the end of it. So it's a whole different skillset than most people who are using computers. We have to be able to tear it down, to tear the car down to every little piece, and then rebuild it and have it still work at the end of it. So that's the kind of skillset that requires that to be an effective hacker. And it requires these kind of problem-solving, analytical skills that are relatively rare. One of the things, early in my life, that I did is that I was an automobile mechanic. And I think that was some of the best preparation that I did for being a hacker because you have to be able... When you're an automobile mechanic, you have to be able to diagnose the problem, then take the car apart, and figure out how to put it back together, hence my metaphor about the car. Yeah. That kind of analytical thinking is one of the keys to being a good hacker. David Bombal: So the question always is, and I don't want to interrupt if you want to say something else, is it by nature or can you learn it? OccupyTheWeb: I think it can be learned. But I think like so many things in life, there's an element of both nature and in being able to acquire the skills. So there are some people who just... they need a cookbook. They're never going to be able to be problem-solvers. That's just not going to be part of their makeup. But most people can, they're trained, and spend lots of time practicing at it. So it requires a lot of practice. It means breaking things down to the component pieces, understanding how they work, and then putting them back together. And I would say that diagnostics are the key to being a good hacker. And diagnostics are how does this thing work and what's going wrong with it now? And I would say that that skill is critical if you're an auto mechanic, if you're a medical doctor, if you're a hacker. Those all require good diagnostic skills. And I think that that is one of those skills that we can't overlook. There are some areas and some disciplines where it's not that important, but in this area, it's key to being able to be a good hacker; these diagnostic and problem-solving, analytical skills that make for being able to understand how things work, how I can take them apart, and how I can put them back together and make them work. So that's number one. Number two I think is persistence. David Bombal: We haven't even got technical yet. Yep. OccupyTheWeb: We haven't got technical yet. Persistence. You don't give up. Audio: Never give up. OccupyTheWeb: Right? You just keep at it, you keep at it, and you keep at it. Because unlike other disciplines, the first time, it's not necessarily going to work, unlike in the YouTube videos and the TikTok videos where everything works in 30 seconds or less. Right? In hacking, it might take you weeks, months, years to get what you want. So you got to have persistence. You don't give up once you see some type of failure. Audio: Never give up. David Bombal: Yeah. I think you used the example of Stuxnet last time. It was another interview. It was five years or something crazy. OccupyTheWeb: Yeah. How long they actually worked on it internally, we don't know exactly. But we know, externally, they worked three years to get it to work. So it had been out in the wild three years before it actually did what it was supposed to do. I've heard figures of five and seven years, but we know for sure at least three years. For most people who are starting out in hacking, they can't comprehend that kind of timeframe, how long it takes to be able to get inside of highly secure systems. There's lots of systems out there that are not highly secure. Those, yes, you can do those in 30 seconds or 60 seconds or six weeks. The highly secure systems, you have to be persistent to get inside. In the YouTube videos and in the books, what we do is that we show you insecure systems because that's the place to start. One of the things you need to do is you need to be able to hack a system that's insecure and understand how that works and also have the joy of actually taking control of a system and hacking it. So once that happens, then you get hooked on it. Once you've been able to hack a system, a real system, then there's a certain amount of addiction that takes place that you want. Then you start getting into it and finding different ways of doing it. I know one of the criticisms that people have about the YouTube videos and books, and I'm one of those people, is that they often are working with insecure systems. But that's where you start. That's where you start. And then you move up into more secure and more secure and more secure systems as you go along. David Bombal: I think it's like any discipline. In networking, as an example, if you gave people a really complex network, they couldn't even start. You've got to give them the most basic stuff just so they have a quick win. OccupyTheWeb: Exactly. David Bombal: Once you have a quick one, then it motivates you. OccupyTheWeb: Exactly. Once you have a quick win, then you can move on to the more difficult stuff and keep on building upon that success. So those are the skills that are necessary, at least I think are necessary to be successful in the industry in terms of non-technical skills, more of a mindset that is necessary to be able to... what often are referred to as intangible skills. And I have those in Getting Started Becoming a Master Hacker, by the way. David Bombal: So you cover that kind of stuff in this book as well, don't you? OccupyTheWeb: I do. David Bombal: Because you teach mindset and then you get technical, right? Yeah. OccupyTheWeb: Exactly. And now let's get technical. So I do have that in the book. So I think it goes without saying that you need to have some basic computer skills. You need to know how to use a computer. You can do simple things like create a document and browse the web and send emails and what have you. And then you have maybe what's covered in, say, an A+ class, the CompTIA A+, that level of skill, so you understand a little bit how it's going on behind the scenes. So that's what I would say. If you're starting off in this industry and you're looking at certifications, maybe the first one you do is A+. Then you need to have some networking skills. This covers nicely the Network+, the CompTIA Network+. It's kind of a basic networking certification, I like that, to create a foundation of skills that you need. This is where you're going to start from. We're not even getting into cybersecurity or security at all. We're just creating some foundational skills. Next, I would put on there Linux skills. Of course, I have the book Linux Basics for Hackers, which is designed specifically for that purpose. David Bombal: And what about Linux+ or something like that from CompTIA? I suppose if you're after certs, that can help you, I suppose. But otherwise, you get a book. Yeah. OccupyTheWeb: I would say that Linux+ is a good certification to have, but you don't have to have a certification for any of these. But those are good certifications to validate the fact that you know what's necessary to take the next step. You've done several recent videos on virtualization. I think that's something that you need to have those skills and that knowledge of how to virtualize a system. Because many times, in a training environment, learning environment, you don't want to go out and be hacking systems in the real world. That's dangerous and that's illegal. Right? So what you do is you create systems internally on your own internal network that you can practice your hacking on. And to be able to do that effectively, you need to understand the virtualization systems that are out there, the Parallels, the VirtualBox, the VMware. And they're similar. They're not exactly the same, but they're similar. But understanding the basics of how they work will really help you in being able to practice your craft on a daily basis. David Bombal: I love what you said because in our interview, you said build your own little network so you don't get into trouble. Build something that you can test with. Yeah. So virtualization is one of those basic skills, isn't it, today? OccupyTheWeb: Exactly. It's a basic- David Bombal: I think you have to understand- OccupyTheWeb: Yeah. That way, you can stay entirely internal. You're not out there getting yourself into trouble. You can put different OSes in there, practice on different OSes, different types of servers before you have to actually go into a real-world environment of pen testing and what have you. And, of course, you can always put in different levels; the easy ones to the more difficult ones. But you can't do that if you don't understand the basics of virtualization. It's also important that... Virtualization has become one of those foundational skills of just working in the IT industry- David Bombal: Yeah, exactly. OccupyTheWeb: ... in 2022. And so you need to understand how these systems work and what they can do and what they can't do. Next, I really think that you need to have a Wireshark, tcpdump type of background. Wireshark is a sniffer, as you know, and allows you to do analysis of packets as they're going across the wire. And it's not necessarily one of those things you're required to have, but I would say it's recommended that you have because you can analyze the traffic and the packets in a way that you can't with any other tool. So you can see what's traversing the network and then analyze it, and then alter it, edit it, block it, sniff it. Audio: Twist it. Pull it. OccupyTheWeb: All these things are possible with Wireshark that you can't do. Well, there's other tools similar to Wireshark. But the idea is to have what's often referred to as a protocol analyzer or sniffer to be able to see the traffic on a network to be able to manipulate that traffic. David Bombal: I'll say this. I'll put a link below. I've done a whole bunch of videos with Chris Greer, Wireshark. He lives and breathes Wireshark, I think. Yeah. Go on. OccupyTheWeb: And he's written a book on Wireshark, I think. David Bombal: No, he hasn't written a book, I don't think. I don't know if you've seen this book. I don't know [inaudible 00:13:16]. OccupyTheWeb: I do see that [inaudible 00:13:17] David Bombal: Is this the one you were going to recommend, or is it a different one? OccupyTheWeb: No. Actually, I thought Chris had written a book. But Practical Packet Analysis is a good book, it's real simple, it's not specifically for security. It's a good book to get started with in Wireshark. I also have a chapter in Getting Started Becoming a Master Hacker on Wireshark as well. You can get a little introduction, a primer to Wireshark. So that's the fifth skill. Next, we have security concepts and technologies. So this would be something that might be covered by certification like Security+. Security+ is, once again, a CompTIA introductory-level certification. It introduces you to the concept. So you know what's going on in the field of security. So here's the first time that we're moving into cybersecurity. All the other skillsets up to this point have been foundational IT skills. Now we're starting to move into the security concepts. And the Security+ certification is a good introduction to it. It's not simple, but it's ground-level of getting into this field. Things like what is an IDS? What's PKI? What are firewalls? How do they work? What kind of encryption is used? Those are all things that are covered in Security+. And that's a good place to get a good foundation in security concepts that'll allow you to move to the next level. David Bombal: Don't you have a course on Security+? OccupyTheWeb: I do, yes. I have a course on Security+. Yeah. David Bombal: That's great. I'll put a link below to the... So you've got a course on your website, but otherwise, there's a lot of books, a lot of training out there on Security+. What I really like about your stuff is you don't... and it's a plug for me and just for your stuff, is you don't approach it from the typical way. You come from a hacker's mindset on everything, which is great. OccupyTheWeb: Exactly. Yeah. I do have a Security+ boot camp that is available. It's been very popular, and it gives people a good foundation of security skills. So, moving on. Security+ or just the security skillset, the cybersecurity skillset, which can be covered in other places, but Security+ gives you a good, well-rounded foundation in all the terminology, all the technologies. It's not going to make you an expert. In some jobs, it's a requirement. In a lot of the government jobs and others, a requirement to get the job, you have to have Security+. Just so you know that's out there. Next, I like having scripting skills. This is primarily going to be Python, but it can include things like Ruby and Perl. Early days of hacking, we saw a lot of stuff written in Perl. And there's still stuff written in Perl that's out there, but Perl is largely being deprecated from the industry. Metasploit is written in Ruby, so all the Metasploit exploits are written in Ruby. Probably 80% to 90% of what goes on in cybersecurity and hacking is done in Python. As we mentioned in another video, Go is coming on. Go is Google's language. It's making inroads into our industry. Right now I would say learn Python first and then maybe go afterwards. David Bombal: I don't know what your experience is, but for me, if you learn one language, it's much easier to pick up another language because the concepts are the same. OccupyTheWeb: Right. Once you've learned to program, it's easy enough to learn a new syntax. David Bombal: Yeah. Exactly. OccupyTheWeb: Basically, the difference between the programming languages is there's different syntaxes and different ways of doing things. But programming is a mindset. And once you've got that mindset, then you can apply it to many different programming languages or scripting languages. Go out and develop that mindset in one of the scripting languages. If you've already got, say, a C background or a C++ background or another language, you'll find Python relatively easy to pick up. So if you didn't learn that in college but you learned C, you'll find Python pretty easy to work with, and probably easier than C. David Bombal: I would say. Yeah, I would say. OccupyTheWeb: Yes. Python is the key. Perl, Ruby, Go are secondary or tertiary languages to learn after Python in our industry. Next, I'd like to see people have some database skills. Oftentimes, the goal of the hacker is to get to the database, right? Because the database is where all the goodies are at. It's the Golden Fleece of the hacker. That's where you have PII information, that's where you have credit card information. Oftentimes, you need to have some fundamentals of SQL, okay, to be able to get into those databases. SQL is the language that is used in databases. To be able to be an effective SQL injection hacker, you need to have some basic SQL skills. SQL is a pretty easy language to learn, easier than some of the others that we've mentioned like Python or C. It's a basic language of logic, of extracting information from a database. And it varies slightly between different database manufacturers, whether it be MySQL or SQL Server or Db2. But 80% of it, something like that, is the same between each of them. So if you learn that language, you can apply it to other ones and just pick up the small differences between them. So when you're attacking a database, you should have some basic SQL skills, and you have to know what type of database you're attacking to apply the proper SQL to it. Next, you need to have a little bit of web application. You should understand how web applications are built. Oftentimes, as a hacker, we're attacking the web application. And if you understand how those web applications are built, you have a better chance of being able to break them. That's one of the things that Vickie Li, that's her name, who's done the Bug Bounty hacking book, does for you. She basically shows you how to break the various web applications. For bug bounty hunting, breaking web applications is the primary area where people are making their money is in breaking web applications. So she shows you how things are built and how they can be broken, how to test a web application. And so you really can only be effective and making money as a bug bounty hunter if you have these web application skills and know how to break them. I like my people to have a forensic background. I like my people to have a forensic background because if you don't know what can be extracted about you as a hacker, then you can't keep yourself safe. You need to understand what the other side is doing. One of the things that we always talk about is that we want our defensive people, the people who are involved in defending networks, to have a hacking background so they understand what the hacker is doing. And I recommend that they also have a forensic background, that could be network forensics, that could be just the standard law enforcement forensics as well, so that you understand what you're leaving behind every time you go into a system. What can people find out about you every time you're on the internet? What can they find out about you when you actually enter a system? If you know that, you can better avoid that. And I did a class recently on remaining anonymous on the internet. And one of the things that- David Bombal: [inaudible 00:20:59] I was going to just interrupt you. I was thinking about that. So, everyone, please comment below. Do you want OccupyTheWeb to do a video where he tells us how to be anonymous online? OccupyTheWeb: I'd be happy to do that. Okay. Maybe that's the next one we do. So I think, forensics, understanding forensics, whether it be [inaudible 00:21:15], whether it be network forensics, whether it be law enforcement forensics, those are all important to understand so that you can better avoid being detected in those environments. If you don't know what you're leaving behind, you can't avoid it. David Bombal: If someone hasn't got that background, how can they acquire that knowledge? OccupyTheWeb: Well, of course, I teach classes in all of those. David Bombal: I like that plug. Well done. OccupyTheWeb: But yeah, I teach OSINT, I teach network forensics, and I teach the standard forensics. We actually have the standard forensics coming up this winter, so it'll be coming out January, February. I think we have both digital forensics and advanced digital forensics in January and February at Hackers-Arise. So if you're interested in forensics, which I think, as a hacker, is important... As I mentioned earlier, you need to know what you're leaving behind as evidence if you're going to be anonymous. David Bombal: And you mentioned OSINT there. Is that part of that or is that another skill that's coming up? OccupyTheWeb: It's a separate course at OSINT. So we have OSINT, we have digital forensics, we have advanced digital forensics, and we have network forensics. So there are four different forensics courses that we offer to be able to train the hacker in what kind of evidence can be gathered about them. Then next is cryptography. Cryptography. And when I say cryptography, I don't mean being able to be a cryptographer. What I mean is that we need to understand the various cryptographic algorithms. We understand what they are, how they can be used. We need to understand PKI. We need to understand these things that are used both to secure data and, of course, as a hacker, how to break those algorithms, how to break cryptography. I just got done teaching a class in cryptography. It's called Cryptography Basics for Hackers, which might become a book somewhere in the future. David Bombal: You better start writing. You've got lots of books to write. OccupyTheWeb: I write every day. I have a lot of books to write, so this might be a book in the future. I really want to write SDR for Hackers. David Bombal: Yeah, that'd be another good one. Yeah. OccupyTheWeb: I think that, really, nobody has written that yet. I think it would be well-received. And in my upcoming Network Basics for Hackers, I have a chapter on software-defined radio for hackers in that book. I think that's probably the most important skillsets. Of course, these are things that we want to develop as a foundation to become a hacker. Of course, there's lots of other skills of trying to learn the tools that we have in our industry. But I think if you've developed this mindset in these basic skills, you'll go far within this industry. David Bombal: I love that. And what's nice, you've given a roadmap, so start with A+ and then go to Network+ and then Linux virtualization. I think it's fantastic. You can't understand Wireshark if you don't understand networking. You have to have some understanding of networking. And I love that you went to cryptography at the end, which is public, private keys, symmetric, asymmetric encryption. It can be quite tough to understand if you don't understand the basics [inaudible 00:24:32]. OccupyTheWeb: And hashing. And hashing. David Bombal: Yeah. Hashing. OccupyTheWeb: Hashing. All of our passwords are all hashed. You got to understand how the hashing works to be able to break the hashes. David Bombal: I think that's fantastic. You obviously teach courses in almost all of this, I think. OccupyTheWeb: I do. I teach courses in just about all of this. David Bombal: So just for everyone who's watching, if you want books, here's, again, a list of books that we discussed in a previous video, which I'll link below. Top books to get if you don't want to attend a class, you prefer reading. But there's so much good stuff out there. I always want to plug OccupyTheWeb's website because he gives us so much fantastic information for free on YouTube. OccupyTheWeb, I really want to thank you once again for sharing. This is what's so cool about this for me personally. You've got 20 years experience or whatever it is, decades of experience, and yet you're willing just to share it with the next generation. So thanks so much for doing that. OccupyTheWeb: You're welcome, David. I always enjoy being on your show. David Bombal: Just for everyone who's watching, put in the comments below as always, things that you want to see. How to stay invisible online might be another video. OccupyTheWeb's got so much knowledge, such a broad and deep knowledge of all these topics. I really want to get him back for lots and lots of interviews. So please put comments below, stuff that you want us to see. OccupyTheWeb, thank you. OccupyTheWeb: Thanks, David.",
    "transcript_keywords": [
        "David Bombal",
        "Bombal",
        "David",
        "OccupyTheWeb",
        "hacker",
        "skills",
        "security",
        "basic David Bombal",
        "Yeah",
        "understand",
        "things",
        "good",
        "book",
        "Wireshark",
        "books",
        "forensics",
        "people",
        "basic SQL skills",
        "Hackers",
        "network"
    ],
    "transcript_entity_values": [
        "first",
        "OccupyTheWeb",
        "YouTube",
        "IDS",
        "January, February",
        "PKI",
        "months",
        "Getting Started Becoming a Master Hacker",
        "20 years",
        "VirtualBox",
        "this winter",
        "at least three years",
        "30 seconds or 60 seconds",
        "Perl",
        "decades",
        "the Golden Fleece",
        "C++",
        "secondary",
        "January",
        "One",
        "Number two",
        "four",
        "80% to 90%",
        "Wireshark",
        "Wireshark",
        "Ruby",
        "Linux Basics",
        "the CompTIA Network+",
        "YouTube",
        "OSINT",
        "daily",
        "Google",
        "today",
        "David",
        "2022",
        "number one",
        "Chris",
        "Early days",
        "Metasploit",
        "Python",
        "SQL",
        "Linux",
        "February",
        "David Bombal: Yeah",
        "one",
        "five years",
        "Linux Basics for Hackers",
        "OSes",
        "Linux",
        "Stuxnet",
        "six weeks",
        "VMware",
        "80%",
        "SDR",
        "five and seven years",
        "CompTIA A+",
        "C. David Bombal",
        "three years",
        "weeks",
        "Cryptography Basics for Hackers",
        "fifth",
        "30 seconds",
        "Network Basics for Hackers",
        "Wireshark",
        "TikTok",
        "Ruby and Perl",
        "OccupyTheWeb",
        "Db2",
        "David Bombal",
        "CompTIA",
        "Chris Greer",
        "Vickie Li",
        "OSINT"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "GPE",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "TIME",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "NORP",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "ORDINAL",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON"
    ]
}