{
    "id": "NXVeSJ1WAt0",
    "title": "Reacting to the WORST Tech Ads",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-02-06T18:00:41Z",
    "video_url": "https://www.youtube.com/watch?v=NXVeSJ1WAt0",
    "category": "Science & Technology",
    "tags": [
        "reacting",
        "linus reacts to",
        "yvonne",
        "james",
        "reacting to commercials",
        "banned ads",
        "banned commercials",
        "commercials with nudity",
        "old tech commercials",
        "msi",
        "asus",
        "old linus commercials"
    ],
    "views": 3290539,
    "likes": 126946,
    "comments_count": 7074,
    "description": "Check out the Meta Quest 2 + Quest Link Cable at Best Buy:   Learn more about NexiGo's family of webcams here:   Technology companies are notorious for bad advertising campaigns. We react to some of the worst of the bunch!  Discuss on the forum:    GET MERCH:   COME TO LTX 2023:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:00 ASUS 1:48 Apple 2:26 Atari 3:06 DustOff 4:13 Nintendo 4:34 GoDaddy 5:25 Apple 6:05 MSI 6:58 AOL 8:05 ASUS 10:30 MSI 11:34 Microsoft 12:14 IBM 12:59 Asrock 14:48 Nintendo 15:38 IBM 16:10 Samsung 17:12 Microsoft 17:45 ASUS 18:06 MSI 19:00 Dell 19:39 Intel 19:54 Microsoft 10:26 CM Launcher 20:59 Nintendo 21:48 Linus Media Group 23:48 Outro",
    "description_links": [
        "https://lmg.gg/8qyVQ",
        "https://viraln.link/LTTWebcams23",
        "https://linustechtips.com/topic/1486521-reacting-to-the-worst-tech-ads/",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Bad commercials come in all sorts of different flavors, but tech companies in particular seem to have a knack for green-lighting truly awful marketing campaigns and then, when the public response is predictably terrible, backtracking and pretending the whole thing never happened. Fortunately for us and unfortunately for them, the Internet never forgets. And for today's video, we're gonna be taking you along something we call The Bad Commercial Cruise. It's gonna be so full of cringe that you'll laugh, you'll cry, and you might even pee a little. - But not related to laughing? - That's not a thing that people do? I can tell you something people do. Check out this message from our sponsor, NexiGo. Whether you're in need of a webcam or accessory for your VR device, NexiGo has a great selection of products to choose from. Learn more about them at the link down below. (muffled electronic music) (metal clinking) (transition beeping) (upbeat electronic music) - You the report. - Oh, goodness. I've seen this one. - Hey, Steve. (playful music) I think those girls are checking us out. - Yeah, Steve. - I think you're right. (Linus laughing) - Here they come. - Excuse me. My roommate and I just wanted to say that we love your asses. - We've been into asses for a few years now. - This commercial is horrible. - Are you guys into asses? - Okay, who actually calls it that? I don't think I've heard anyone ever pronounce it that way. - Well, I don't know what they're talking about yet. - What? Really? - Our asses swivel. - Asses. - You ladies are into ASUS. (Linus chuckles) - Oh. - You like ASUS products. - Here's a hint for brands. If you want people to pronounce the name right, then spell it right. - Okay. I wanna know who approved that. 'Cause even if you're trying to get people to pronounce it correctly, doing a commercial like that is just horrible. - Well, I think the idea- - They're- was that it would go viral. - But they're also just driving. They say the name ASUS so many times. - Yeah. - Ugh. - I disagree with this practice, generally. I think that's dangerous. - [Announcer] That's why we make the most advanced personal computers in the world. - How is he holding that mouse? - [Announcer] And why soon there'll be just (phone ringing) two kinds of people. (phone clicking) (gentle music) Those who use computers. (gentle music) - Yeah, I'll be home for breakfast. - And those who use Apples. (Yvonne laughing) - He's on the phone when they say those who use computers. - Because this actor has clearly never touched a computer in his life. Did you see how he was using the mouse? - [James] Wow. - [Linus] What is that? (laughing) - Amazingly, it's still so Apple-y in that they spend only 2% of the commercial actually showing the product and the rest is just lifestyle. - [Driver] You look like a real jerk. - How wide is the person- - Well, I am a- - You're driving past? - Corporate executive. - So whatcha doin'? (Yvonne and Linus chuckling) - Well, Muffy, Buffy, Biff Jr., and I are going on our Sunday drive. - [Driver] Oh no you're not. - How? - You're gonna play full position. (car engine whirring) - What is going on? - What? (upbeat music) (family yelling) - I actually love this commercial. - Oh my God. Someone just wrecked. Your kid is dead, sir. - [Linus] Is she trying to take her helmet off? - I don't understand the point of this commercial. - It's fun for the whole family. - [Announcer] It'll turn your eyeballs into steel. (Linus chuckles) - Oh my goodness. - Oh my God. That is awesome. That is like fodder for parodies 20 years later. - Oh, I love it. - When it comes to keeping your gaming gear at peak performance, oh, the games people play. I'll tell ya. - This seriously reminds me of your early YouTube videos. - Really? (James laughing) - Yeah. - That's harsh, Yvonne. - That's not nice. - Oh, man. Just look at all that crap flying out of there. (Linus chuckling) - I can't see what you're talking about. - Enough skin fragments to clone yourself. (video pinging) - Now that's good. That's- - Mom would be so proud. (laughs) - No. - Now. (James laughing) - Okay, we have done that before. - Yes. - Do not use a vacuum. (vacuum whirring) Vacuums can cause (James laughing) static discharge. - That was awesome. - And could severely damage your computer. - That is a very good point. - That's a tech tip. - Oh my gosh. How long is this? - Do they play this in movie theaters? Like how am I not gone by now? Is this a commercial or is this just... - This seems like- - A short film. - An instructional, yeah. - Falcon Dust-Off is totally a thing. I guess they just did a gamer brand, like gamer skin, on their existing products. - No music the whole time. No background music. - Who would watch that? - What I wanna know is how popular these videos actually were. - As Nintendo begins to take on new forms, it's important that we can measure how addictive they truly are. - Animal testing. (chuckles) I don't think they would touch that these days. (mouse squeaking) What? - This is a Nintendo commercial? (Yvonne laughing) - [Presenter] The new Game Boy Micro, extremely portable, extremely stylish. (James clapping) (truck engine humming) (truck clanging) - There was a lot of really edgy gaming- - [Yvonne] Aww. - [Linus] Commercials. Oh, really? - They actually got that shot of the puppy in the air. That was awesome. (gentle music) And that shot of the car going by it. I wonder if they did that in two shots, or if there was actually a risk it would've got run over. - I'm so glad you made it home, because I just sold you on this website I built with GoDaddy. - Oh my gosh. - Ship 'em out. (dog whining) (James laughing) - Wow. - Again, completely would not fly today. I'm running a puppy mill. - I just don't even have words to describe (Linus scoffing) the feeling for that one. (laughing) - I am so, like I'm angry. I mean, I guess if the commercial's supposed to make you feel something, mission accomplished. - Yeah. - Yep. - I guess what they're going for is you can sell anything. - Yeah. - But they spend the whole buildup of the commercial demonstrating this dog's loyalty and love. Just for you to be like, boink. - See you later buddy. - I was writing paper on the PC, and it was like (imitates bleeping). And then like half of my paper was gone. (playful music) It devoured my paper. It was a really good paper. - What's wrong with her? - You just don't have a teenager yet. - Okay. - I'm Ellen Feiss, and I'm a student. - I wonder how Ellen's career is going. This is one of those ads where I feel like Apple should have been smart enough not to break that cardinal rule, don't insult your customers. - Mm. - If you didn't even know what a switch was, like I don't even know what that commercial's for. - Which one? - They're just saying- - Apple switch. Yeah. - Like slash switch is like switch to Apple. - Yeah. - Oh. The commercial meant nothing to me. I was just like, \"What is this?\" Anyway. - I think Apple counts on you to know Apple. - Okay. - [Voiceover] I'll tell you guys a little secret. I'm also a hardcore gamer. (upbeat music) (bullets firing) I travel a lot and have joined many worldwide gaming- - Of course this is MSI. - Competitions and events. - Yes! (James laughing) - That was definitely on purpose. - (chuckles) You said it, not me. - Woo hoo. Yes. - There are two types of memory, Long DIMM and Short DIMM. - A, (beep) no. I think you mean DIMM and SODIMM. And B, there's no way that voice came out of that person. - Why did you , \"Of course, MSI\"? - Because MSI is just... Look, what percentage of this frame is breast? (Yvonne laughing) It's gotta be MSI. - Check out the girth on that cable management hole in that dresser over there. - Yeah, what the hell is that? - That's a glory hole. - Hey, Dan. Ready for the game? - Are these the same guys? - Yeah, those guys look way too similar. - [Linus] Yeah, the two generic 80s guys. - I've gotta send something from my mom's birthday. It's tomorrow. I'll then book plane tickets for our trip next week, and my kids gotta go to the library to look up dinosaurs. - I didn't ask for your life story, pal. - America Online can do all that? - Yeah. How about sending your mom some nice flowers? All you do is click on Marketplace. We place an order. - I can't get flowers that fast today. (Linus laughing) - I feel like this is the kind of thing your aunt would've signed up for. - Ah. - This commercial would've worked. - You know what? I'm actually noticing that the things that they're doing with it are high wife approval factor things. - Yeah. (laughing) - Look babe, I'll be able to buy you flowers and take you on a trip. Can I please have access to my own bank account? - Now we're getting into the men's stuff. - Our priorities, man. - Yep. - Yeah. - Fantasy football. - Fantasy football? - Call now- - Worldwide E-mail? - Of course, there's my personal favorite, live chat. That's how I met my new- - Ooh. Oh. - Oh, hold on, hold on. Met my new- - This guy. - Kayaking buddies. - Oh. Yeah, right. - We'll check it out Later. - Yeah, sure. - After the game. - His desk has a glory hole too, probably. (Linus chuckles) - Do you know what a glory hole is? - I think so. (Linus chuckles) - I'd like to preface this one by saying that this series was a major inspiration for me. It showed me that no matter how bad my ideas were, no matter how bad my production values were, there was definitely a worse waste of money than booking with Linus Media Group, Incorporated. (Yvonne laughing) (playful music) - Okay. - Okay, look at that set. - Now I'm gonna compare it. - Guys, check this out. ASUS has given me its latest high-tech product. (audience laughing) - Chinese food is delicious. - You're right. I just love sushi. - You're just jealous. I'm gonna get Patty. (grunts) - It's hard to even begin. (Linus laughing) It reminds me of a Morgan Freeman quote. He said, \"Acting is reacting.\" These guys are not reacting to each other at all. They're all in a vacuum. Now for no reason whatsoever, they get curious. - Holy Megatron. - Big Bang Theory already was widely criticized for just being utterly tone deaf in its profiting off of geek and nerd culture. - Like, say nerd word. Everyone laugh. (audience laughing) - [Linus] This is really hard to watch. - [Yvonne] Yeah. - I know that we're in the TikTok generation now with no attention span, but it's hard to believe things were this boring. - This was particularly boring. - Like nothing is happening. - Yay. - You're gonna be the first to see it. - I wanna see it so much. - I think you're gonna really impressed. This is- - \"I wanna see it so much.\" - It was like this when we opened the box. (audience laughing) - Yeah. You brought back a defective product. - Are they talking about me? (audience laughing) - No. No, of course not. (quirky music) This is the Eee Pad Transformer. - Holy. What a twist. I can't believe it took that long to finally show what your product does. - What's with all the women in these? - That's just how women are. According to tech marketers. - Yeah. - Now, it gets better. They produced not one, but five episodes of that dross. - [Writer] Six. - Six. Sorry. - Is that because it worked? - No, it's because they- - Or they just did six? - Invested in- - Okay. - A gigantic set and all these actors and scripts, and basically produced the entire campaign before showing it to anyone, at which time they realized, \"Holy crap, this doesn't work at all and is not funny at all.\" - If they had cut that down to 30 seconds, it would've been not good, but better. (Linus laughs) (upbeat music) (Linus laughing) Now this guy's competing for your budget. And here's Jake Paul. - (laughs) I actually love this. - What? Yeah. - What? Yes. This is like YouTube era hailing. What? (Linus laughing) - Okay. Wait, hold on. - How are they doing this? Did they just play it in reverse? - No. No, no. This is fake. It has to be fake. - Well, yeah, they're not throwing them at his ass. - (laughs) I don't know. - The first one looked convincing. - (laughing) Yeah. - It's a little too much at this point. We get it. (Linus laughing) - He's catching it the same way every time. And that is Jake Paul. What are they trying to say about the product? - It's thin. That's awesome. - (laughs) Okay. I love it. - I feel like if this was updated, I would see this on on Facebook or TikTok. - Yeah. There's- - As like a little short. - There's a modernness to it. - Yeah. - I don't know why these guys are all dressed in unitards. Are they wrestlers? - I love it. - It doesn't quite get there for me, but it's close. - I'm very into it. (hand slapping) - Oh, this is like a music video style. - Oh no. \"YO!\"? \"MS Raps\"? (upbeat music) - I feel like this is taking the piss, like this is a parody of itself. I feel like it's self-aware. We're introducin' something new. It's essential for all, the many and the few. - They did a good job rotoing that. - I was gonna say they've got shadows and everything. Sues DOS has - The pattern with all of these is that they're like 10 minutes long, and I just don't know when they were ever screened. - I can't tell who they're pitching. Okay, so they're pitching partners. - So those people waiting to hear the Lunch and Learn seminar were super bored, but now they're stoked. Yeah. So, it's partners. Do you think you really Want a clone No way - I've heard of this one. (Linus laughing) Do you think you really want - Are you the one who sings this in the office? No - No. I don't think so. - I've heard people sing this around the office. - I've heard Linus sing it, but I don't know about at the office. - I don't know if I remember seeing this or if I remember similar like Gateway ones. - I never saw this one. I don't think this is Gateway. This is a buck a day. - Something else. - Like the the $1... Who did the $1 a day financing? It was a big thing at this time. My friend financed a computer, and I remember telling him what an idiot he was because by the time he finished paying for it, he would've paid so much he could have bought two computers. I was like... But then he could play in real tournaments. So he had the last laugh. This is a first-party IBM commercial? - That's like the biggest banger yet. - Yeah. (muffled electronic music) - Hell yeah. - Okay. Apparently it works. (laughs) - Here we go. (electronic music) - Are you kidding me? - Okay. - Is that even the same person? - [Presenter] ASRock build M8, with the master of vehicle design. - What did that have to do with computers? - I mean, it was obviously pure sexy teacher fetish. - Yeah. Imagine a hot teacher comes in, and then she just rips all her clothes off and you're like, \"Whoa, this is really going down.\" And then, she has a new PC, and you're like, \"Shut the front door.\" - [Presenter] The functionality of this gaming beast, including a comment with G-Sensor. - And then they had the budget for all these glam shots, but they didn't have the budget to make sure that the English translation of the script makes any sense at all. And this is new. This is from like four or five years ago. - No. - Yeah. - Yikes. - Yeah. ASRock M8 is not old. - Oh. Okay. - 15? - 2015? Yeah. - Oh. Okay. - Like you could find a voice actor on Fiverr. She's leaning over for absolutely no reason, (electronic music) other than for her to be leaning over. They could just move the computer closer. (electronic music) - What? - Oh, the face that she's making? (laughs) Yeah. It's kind of creepy. She looks like someone who'll smile with her teeth when she's like genuinely smiling. There you go. (electronic music) - SSDs make her genuinely happy. - Why is she still wearing a bikini? - What? You want her to take that off too, Yvonne? - Gross. - Can I see her clothes get ripped off again? I want to see if it is the same person. - (laughs) Yeah, sure. - Yeah, well he's curious. - Seriously. Her hair color changes. Okay. It's just muted colors right now, so. - And then her hair's down and she doesn't have the glasses. All right. - I think the colors just freaked me out before. I was like, whoa, she was a brunette, now she's a redhead. - [Narrator] Life isn't all about money. Nah. - Easy to say when you have it. - I guess what I'm really trying to say is how much will it cost to keep this from your mother? - Oh. - [Announcer] $39.95. That's all you need for these super cool Nintendo 64 games. - That's the second Nintendo commercial where I'm like, \"Really?\" - Yeah. - I knew they did some edgy stuff, and Sega did some even edgier stuff, like the, \"Sega do what nintendon't\" commercials, where they like tried to be even edgier than Nintendo. But there is no way you make that commercial today. - It's like they're trying to say the prices of the games are so low you can afford them even with a bribe from your cross dressing father. - Yes. - I would think that guy's gonna give him quite a bit of money. (Linus chuckles) It just seems like it's fighting itself narratively, you know? - Yeah. - It is the year 2000, but where are the flying cars? I was promised flying cars. - This is definitely a \"Matrix\" thing. - Flying cars. Why? Why? Why? Because billions of people all over the world can work together on the web 24 hours a day, seven days a week. You don't need flying cars. (Linus laughing) - We were busy working on the web. (claps and laughs) Okay. Are we supposed to know who that is though? - [Writer] Avery Brooks, Captain Sisko. \"Deep Space Nine\". - Oh, I never watched \"Deep Space Nine\". - Oh yeah. Yeah. I recognized him. - Definitely a real actor. Well, I like it. - They really hammered home the \"Where are the cars\". (upbeat music) (skier laughs) - Creepy. - Oh, hey. - Hey. - [Friend] Yeah. How's it going over there, man? - It's incredible. - [Friend] Oh, I'm so jealous. (blonde skier laughs) - You wanna see something cool? - Yeah, sure. - Here, give me your number. Just say it. - Oh my God. - Tech does not get girls. From the folding phone to the new sports car, if I wanted to pick up dudes with facial hair. (James laughing) Attention from women? Negligible. - Yeah. I think the subtext here is that the guy on the other side is just so gross. - Yeah. - So she's just... She'll take anything here. - Oh, it keeps going. Oh no. And he's taking lots of pictures of her. \"Hey, I didn't realize you were following me down the hill.\" - [James] Taking pictures. (upbeat music) - Yeah. (Yvonne laughing) - This also is only like seven, eight years ago. - That's brutal, man. That should have ended- - That's so much. - On the chair lift. - It keeps going. And he could've just taken a selfie with it. That's enough. - Hey, she was clothed. That could have been a beach scene. - That's true. True. - Can I borrow your laptop for a minute? - Sure. - Who's this? - That's my girlfriend. - It's porn. - Oh God. (gulping) - (indistinct), really? (woman retching) (Linus laughing) What? Yes. (Linus laughing) - Do you suffer from O.M.G.I.G.P., or Oh my god, I'm gonna puke? (woman retching) (vomit splattering) - Okay. - If you share a computer with this guy, you might. Tell him to download Internet Explorer 8. - Really? - And you'll never be surprised by hairy (beep) .com again. - That commercial's better than the entire browser. - [Presenter] Kiss me. Mm. - Okay. (upbeat music) - [Presenter] Touch me. - Well that's not subtle. (battery beeping) (drums banging) Oh, they're bunnies. (upbeat music) It's Energizer. Here we go. No it's not. - Nope. - Oh, from the people who brought you \"The Big Bang Theory\". - It's Eee Pad story. - \"Power to charm\"? (upbeat music) (Linus sighs) - I've seen this one. Yep. Okay. - Hell yeah. RGB. At least she's got great cooling. (Linus scoffs) - At least she has her hands on the right part of the keyboard. - [James] Screwdriver could use an upgrade. - [Linus] (chuckles) Yeah. - They actually have progressed since last time. - Hey, guys. We're going to show you how to build a gaming PC with an MSI motherboard. - Yeah. The voiceover is better. - This is straight up dubbed. You know this has to come from the very top of MSI. - Otherwise they wouldn't keep doing it. - Like the marketing officer met with the CEO and he was like, \"This is my vision for our company's brand voice.\" And they were like, \"Are ya sure? 'Cause this is a really bad move.\" And he goes, \"Goddammit. I'll accept nothing less.\" - MSI at least has had the good sense to private that video. We had to find it somewhere else. But we did. That video was one of the main inspirations for this video. - Mom, Dad. Hey, it's me, Steve. This year to avoid any confusion. - I love this guy. - I'm putting my wishlist on video. All I want is a computer. It's just $849. And Dell will throw in a free DVD upgrade. - I'm sorry to all- - And Dad- - The Steve's. - I know how much you love free stuff. - I actually love this. - Happy Holidays. Your son, Steven. - He had to think about it for a minute. - Yeah. Steve became like the quintessential kinda Chad name. Wait a second. (James and Linus laughing) - [Writer] They made something like 40 of those. - Really? - Wow. - Okay. If I move back from the sun, that's the Earth. - Your kids will use computers to learn. - That's about the same. - Oh, this is cute. We're looking out from the inside of a computer. - I see how far Saturn is. - That's pretty cool. - Wow. - I'd buy that for him. - Yeah. - He deserved it. (woman exhaling) - Oh my God. - You were hilarious on laughing gas, by the way. (woman screaming) She doesn't remember it. - Ah. Oh my God. - What just happened? - The body horror. (James laughing) - Okay. - Wait, is this kid growing? - Yes. Yes. - Yeah. Yeah. (kid screaming) - He has shame now. (kid screaming) - Oh. - Oh. - How many times has he circled the globe? (kid screaming) (air roaring) - Okay. (grave exploding) - I wish parenting were that easy. - This is an Xbox commercial? - Weird. - Okay. - I don't- - Wanna have a cool theme, make your phone look special? Follow me. (upbeat music) Shine bright like a diamond Let me show you some fantastic effects. - Is this like a hobbyist, fan commercial? Or is this a real commercial? - [Writer] As far as I can tell, it's official. Official CyanogenMod. - You know what? I'd go out with with this guy. He seems pretty cool. - All right. Okay. All right. - Moonwalk? Hell yeah. He brought that with him. - Like it? Download CM Launcher 3D now. (camera lens shutters) (James mimics explosion) - It's to the point. I don't feel the need to click away from it. Oh wow. - Happy birthday. - [Linus] What an awful party. - Thanks. (paper tearing) - Oh! - Oh! Happy birthday to you - This feels like if Larry David directed a commercial or something. Like it's just really uncomfortable. - Whoa, whoa, whoa. What the (beep) is this? (cake banging) (mother gasping) (Linus and James laughing) (beep) spongecake? (James laughing) (rock music) - (laughs) Okay. That fuck. - Do you think we needed to see which game he opened before that? Or do you think it's better if we don't know until the end? - I think it's better we don't know. I think the party should have been people were having fun and it was wholesome before, though. It looked like... - Kind of depressing. - Yeah. - Yeah. - Overall, that's a B plus. (amorous music) - Oh, no. - Imagine... (confetti popping) (part horn blaring) - [Child] Are we there yet? - Yes. Yes. We are here. (playful music) - Is that your uncle? Did you invite him? - No. He- He- He must've... - (stammers) Look, it's fine. - This is not the worst acting we've seen today, guys. (metal clanging) I'm actually pretty impressed. - Al's amazing, by the way. He's not my actual uncle, but I would totally go camping with him. - One misstep in this commercial is the character- - Wait. Von. Von! (water splashing) (Linus laughing) The character of Uncle Al was never introduced. We still haven't been close to him. The camera never gave him a medium close up. - Yeah. This video shoot was the moment when I realized what a terrible father I'd been, because both of my children, especially my son, thought that this was camping. - You told him you were going camping? - No. I told him we were doing a video shoot and it was camping, and he thought it was actual camping though. 'Cause he's young. - 'Cause he hadn't been camping? - And he'd never been camping. - Oh. So like- - We've taken them every year since then. (playful music) (Linus laughing) He goes for it. So that was definitely a little different. I hope you guys enjoyed (Linus laughing) this little LTT short with my Uncle Roy. And I- Yeah, that's a concept that didn't continue. Which leads us- - They honestly would get- - To the other big star- - As many conversions- - Of the show. - Just with this part. - The big giveaway. You can find the- - Probably more. Will be taking home not- Okay. Yeah. Shut up, Linus. Not the end of it. It's the end of it. Just like it's the end of the part of this video where you don't hear about our sponsor. - Best Buy and the Meta Quest 2 VR Headset. Easy to set up, the Meta Quest 2 all-in-one VR system allows you access to an expansive library of games, immersive live concerts, entertainment, and movies. The high resolution display, 3D positional audio, hand tracking, and haptic feedback make virtual worlds feel real. The Quest Link Cable allows you to connect your Meta Quest 2 to your PC, unlocking a whole new library of VR ready games. So check out the Meta Quest 2 and the Quest 2 Link Cable at the link down below. - If you guys enjoyed this, (upbeat music) maybe check out us reacting to weird PC builds from China. They're weird.",
    "transcript_keywords": [
        "Yeah",
        "Commercial",
        "guys",
        "people",
        "love",
        "Hell yeah",
        "MSI",
        "Meta Quest",
        "God",
        "guy",
        "video",
        "Hey",
        "Quest",
        "Bad Commercial Cruise",
        "feel",
        "computer",
        "Nintendo commercial",
        "Nintendo",
        "Apple",
        "computers"
    ],
    "transcript_entity_values": [
        "40",
        "one",
        "only 2%",
        "Roy",
        "One",
        "1",
        "RGB",
        "the Eee Pad Transformer",
        "30 seconds",
        "G-Sensor",
        "ASRock M8",
        "Jake Paul",
        "Dell",
        "Xbox",
        "Deep Space Nine",
        "LTT",
        "Marketplace",
        "Linus",
        "Facebook",
        "the year 2000",
        "Nintendo",
        "Ellen Feiss",
        "Linus",
        "Gateway",
        "seven days",
        "M8",
        "Steve",
        "Mm",
        "Earth",
        "Sega",
        "Sisko",
        "ASUS",
        "just $849",
        "English",
        "Larry David",
        "Apple",
        "first",
        "Steven",
        "Muffy",
        "Fiverr",
        "Shine",
        "billions",
        "Biff Jr.",
        "Linus] Commercials",
        "MSI",
        "YouTube",
        "Six",
        "Saturn",
        "eight years ago",
        "six",
        "a few years",
        "Apples",
        "tomorrow",
        "This year",
        "10 minutes",
        "Chad",
        "two generic 80s",
        "Ellen",
        "four or five years ago",
        "20 years later",
        "Linus Media Group",
        "Uncle Al",
        "China",
        "The Quest Link Cable",
        "James] Wow",
        "James] Screwdriver",
        "Game Boy Micro",
        "Patty",
        "five",
        "TikTok",
        "24 hours",
        "CyanogenMod",
        "Sunday",
        "James",
        "next week",
        "SODIMM",
        "15",
        "YO",
        "two",
        "Dan",
        "these days",
        "IBM",
        "Matrix",
        "second",
        "39.95",
        "like half",
        "the Quest 2 Link Cable",
        "Learn",
        "only like seven",
        "Chinese",
        "Yvonne",
        "today",
        "The Big Bang Theory",
        "Apple-y",
        "Lunch",
        "Internet Explorer 8",
        "YouTube",
        "Morgan Freeman",
        "DIMM",
        "Avery Brooks",
        "a minute",
        ".com"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "LOC",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "LOC",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "LANGUAGE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "TIME",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "NORP",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "NORP",
        "WORK_OF_ART",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "ORG"
    ]
}