{
    "id": "O-uwljuMp7w",
    "title": "FIGHT Coronavirus From Home! - Folding@Home",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-04-10T17:02:49Z",
    "video_url": "https://www.youtube.com/watch?v=O-uwljuMp7w",
    "category": "Science & Technology",
    "tags": [
        "COVID-19",
        "Folding",
        "Research",
        "Super Computers",
        "Processing",
        "Xetabyte",
        "Group",
        "Sourcing",
        "Crowd",
        "Contribution",
        "Cure",
        "Development",
        "Medicine",
        "Vaccine"
    ],
    "views": 211026,
    "likes": 11827,
    "comments_count": 851,
    "description": "Get 50% off your first 3 months of FreshBooks when you sign up for a paid plan at   How does the Folding@Home project make ordinary home computers part of one of the world's most powerful supercomputers to tackle disease research?  Techquickie Merch Store:   Follow:   Leave a reply with your requests for future episodes, or tweet them here:",
    "description_links": [
        "https://www.freshbooks.com/techquickie",
        "https://www.lttstore.com",
        "http://twitter.com/linustech",
        "https://twitter.com/jmart604"
    ],
    "transcript": "- When you think of a super computer, you probably picture a bunch of server racks, covered in blinking lights in a lab somewhere. But did you know that you easily make your home PC part of a super computer, for free and for a good cause. The subject of today's video is a project called Folding@home and no, we're not talking about laundry. Folding@home started at Stanford University but is now run from multiple sites around the world and the goal is to research protein folding. But how does it do this home computers and what the heck is protein folding anyway? Well, stay with me here because protein isn't just the stuff that weightlifters drink by the bucket full. Your body uses all sorts of different proteins for everything from building muscle fibers to intercellular signaling and the crucial thing to remember about proteins is that their function depends heavily on their shape, which is where the term 'folding' comes in. After a protein is assembled it has to fold into its proper shape to be useful, kinda like how you can't throw a piece of paper across the room until it's in the correct shape. I choose ball. But unlike a paper airplane, which you can just follow simple instructions for, protein folding is much more complicated. You see, proteins are made up of 20 different kinds of small units, called amino acids and while they're structurally similar, all 20 of them have different side chains that, as the name implies, stick of to the side of the molecule. When you connect a bunch of amino acids together, linearly to form a protein, these side chains interact with each other in ways that cause a protein to fold, depending on how their shaped and their electrical properties as well. As you can imagine, the more amino acids, the more complicated these interactions become and the typical protein might be hundreds of amino acid residues long. And of course, it's critical for a protein to end up in the correct shape or conformation because otherwise it couldn't function. For example, cells have proteins on their surfaces that serve as signaling receptors and they only function because they are shaped in a certain way that allows them to bind with this signaling molecules or other proteins from outside the cell, kind of like two puzzle pieces coming together. The TLDR is that understanding how proteins fold has very important implications in medicine. For example, understanding how viral proteins interact with cell membranes to invade cells is critical to finding treatments to some viral diseases. So the team behind the project is currently using Folding@home to research the novel coronavirus that causes Covid-19. The better we can understand what parts of the virus especially the ones that bind to human cells, could be attacked with the drugs, the more likely it is that we can develop medicines that can treat or cure the disease. But anyways, this is tech quickie not biology quickie so let's tie this all back to the Folding@home project. It turns out that simulating protein folding patterns is very difficult to computationally. In nature, proteins fold in a tiny fraction of a second but it can take years of computer time to sort out exactly how a protein will fold, given a certain amino acid sequence and a big part of the problem is that we don't yet fully understand the mechanisms behind protein folding. So the idea behind Folding@home, is to leverage spare home computing power in order to solve these difficult problems. All you need to do to participate like I am, is install a client onto you home PC from the Folding@home website. The program will then give your system part of a folding simulation to run and then send back to the program servers. You can specify how much of your PC spare computer muscle to use, depending on how much you want it to affect your power bill and you can also choose whether to run the simulations only when the system is idle or also when you're actively using them or maybe you choose depending on how hot your house is already. If you have a high-end graphics card, you're gonna help even more. The highly parallel nature of GPU architecture, which you can learn more about up here, can really speed up simulations but you also don't need super fancy hardware. The current version of the client support CPUs all the way back to Pentium four. Now, it might seem like the impact one system makes on the project is minuscule, but all that spare computing power really adds up and taking collectively the Folding@home network is up there with the world's top super computers. This has enabled real scientific breakthroughs that would've been much harder to reach otherwise. Hundreds of scientific papers have been published from the project's findings and have also been useful for those involved in drug discovery. So, if you can spare a bit of power, download the Folding@home app today. Join the LTD Folding team and make a difference, your PC might even wind up finding a cure for the coronavirus, which could not only safe lives but also finally put an end to all these people hoarding toilet paper. What's up with that anyway? Geez, it doesn't make you poo more, you poo the same amount. Anyway, this video is brought to by FreshBooks. FreshBooks allows you to easily manage your back-end processes so that you can spend more time focusing on your main business. Automatic late payment reminders let you avoid awkward conversations with clients about overdue payments and award-winning customer service allows you to handle situations without having to wait. Just take photos of your receipts to automatically log them on to your account and select to apply them to invoices. You can get 50% off of your first three months of FreshBooks when you sign up for a paid plan at freshbooks.com/techquickie. So thanks for watching guys, if you liked this video, give it a thumbs up, get subscribed and hit us up in the comment section with your suggestions for topics that we should cover in the future.",
    "transcript_keywords": [
        "protein folding",
        "Folding",
        "protein",
        "home",
        "proteins",
        "research protein folding",
        "covered in blinking",
        "blinking lights",
        "proteins fold",
        "simulating protein folding",
        "protein folding patterns",
        "amino acids",
        "amino",
        "fold",
        "project",
        "computer",
        "Stanford University",
        "project called Folding",
        "shape",
        "super"
    ],
    "transcript_entity_values": [
        "TLDR",
        "LTD Folding",
        "your first three months",
        "one",
        "Folding@home",
        "Folding@home",
        "second",
        "hundreds",
        "FreshBooks",
        "Pentium",
        "two",
        "Stanford University",
        "four",
        "GPU",
        "50%",
        "Hundreds",
        "years",
        "Folding@home",
        "20",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE"
    ]
}