{
    "id": "o2JNv8t97jQ",
    "title": "Nintendo Switch Review Re-Do [2018]",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-05-17T20:43:51Z",
    "video_url": "https://www.youtube.com/watch?v=o2JNv8t97jQ",
    "category": "Science & Technology",
    "tags": [
        "nintendo switch review",
        "nintendo switch review 2018",
        "nintendo switch 2018",
        "nintendo switch revisit",
        "nintendo switch games",
        "michael fisher",
        "mrmobile",
        "imore"
    ],
    "views": 389228,
    "likes": 10482,
    "comments_count": 919,
    "description": "[NINTENDO SWITCH REVIEW RE-DO 2018]  You don't need me to tell you that the Nintendo Switch is a blockbuster success; all you need to do is look at the numbers. Thirteen months after its debut, Nintendo's new console has sold about 18 million units, putting the company's profits up 500% year-over-year   and keeping the Nintendo Switch price firm at the same $300 it launched at. But while the console world and the smartphone world are two very different domains, the question we'd ask about a Galaxy S8 still apply to the Switch: should you still buy one today, this long after its launch? What light can the growth of its ecosystem shed on its future prospects? And what accessories have proven themselves valuable after a years' worth of usage? Those questions and more answered above, in MrMobile's Nintendo Switch Review Re-Do for 2018!   [SPONSOR]  Brought to you by dbrand. Get your Nintendo Switch skins here:    [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S NINTENDO SWITCH REVIEW RE-DO]  MrMobile's Nintendo Switch Review Re-Do / Review 2018 was produced following thirteen months with a Nintendo Switch retail device purchased by Mobile Nations. A secondary Nintendo Switch review unit was provided by dbrand.    [PRODUCTS IN THIS VIDEO]  Nintendo Switch:   WaterField Designs Surface Accessory Pouch:    [LINKS]  Nintendo Switch: Everything you need to know [iMore]:    [MUSIC]  No Major Delays by Julian Bell, available at Premium Beat:   Groove Science by Olive Musique, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "http://dbrand.com/mrmobile-switch",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/4nv",
        "http://mrmobile.tech/4n2",
        "https://www.imore.com/nintendo-switch",
        "https://www.premiumbeat.com/royalty_free_music/songs/no-major-delays",
        "https://www.premiumbeat.com/royalty-free-tracks/groove-science",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Narrator] One of the great pleasures of revisiting a product after a year is watching a gamble pay off. 13 months after its debut, the Nintendo Switch has sold about 18 million units, making it an unqualified hit and keeping its price firm at the same 300 bucks it started at. I'm Mr. Mobile, and the question we're here to answer is whether you should still buy one, in the Nintendo Switch Review Re-Do, brought to you by dbrand. (upbeat music) I normally stick the dbrand drop at the end of a video, but I'm so pleased with how this one came out that I just couldn't wait. I went with the carbon fiber skin on the console and a mix of flat white and iridescent green for the Joy-Cons, which just shine. More importantly, the skins protect it. These weren't around at launch, so as you can see, my day-one Switch has its share of scars just from bangin' around in my bag. The wrap feels really nice on the console too. The link is in the description, if you wanna protect your own Switch with dbrand. And a word of warning as we slide out of the sponsor spot. Ya might want to invest in a screen protector too. The soft plastic won't shatter, but it does pick up scratches and scuffs faster than Jumpin' Jim in Excitebike. Or you can pick up a travel case. One that works well is this pouch from WaterField Designs, which was actually made to hold accessories for Microsoft Surface, but it's perfect for the Switch. No sponsorship there. I just like the thing. Other than that, the hardware has held up pretty well. I've somehow managed to avoid breaking off the flimsy kickstand, though to be fair, that's probably just 'cause I forget it's there. I usually play with the Joy-Cons on the sides or with the unit docked and casting to the TV. The Switch gets pretty hot when it's working hard, and I was concerned that that would mean degraded battery life, but that hasn't yet come to pass. I'm still seeing the same staying power I did at launch, which is about three hours when playing a big old game like Mario Odyssey. I would like a bit more endurance so I don't need to worry so much about the charge level on the go. Fortunately, the Switch takes juice just fine off my usual battery pack. iMore has a nice run-down of the top packs in this category. Generally speaking, though, the best options are banks with USB-C power delivery for the fastest charger. The place the Switch needed to prove itself most urgently was in games. That is, how many were made for it. Now at launch, there were only a dozen or so with the only big one being Zelda, Breath of the Wild, which was amazing, by the way. Well since then, over 600 games have hit the platform with 200 more confirmed before the year is out. Now heads up, lots of those are smaller indie titles, so keep your expectations in check. The one everyone's buzzing about these days are Nintendo's Mario games, and for good reason. Odyssey is as beautiful and engrossing as you've heard with the perfect balance of bright, beautiful new worlds to explore and fond looks back at its namesake games that started it all. And then there's Mario Kart 8. All right, take it from someone whose last experience with Mario Kart was on a Super Nintendo. There's almost no learning curve. You just pick it up and your fingers naturally gravitate to where they need to be, the game responding just as you'd expect. Nintendo's strength for intuitive controls is undiminished here. Speaking of the controllers, the versatility of the Switch has only gotten sweeter over time. If you don't like playing with the Joy-Cons docked, you can keep 'em down at your sides or across your arms. Aging less well, it maxes out at 1080p when exporting to a TV. So if you're looking for Xbox-level graphics, well, buy an Xbox. For me, the number one thing missing from the Switch has been the ability to play old NES titles. Fortunately, as of September, that hole will finally be patched with Nintendo Switch Online. This'll cost 20 bucks a year, and it'll let ya play against remote rivals in games like Mario Kart. But I'm mostly excited that it'll also bring 20 classic NES titles to start, including my personal favorite, Super Mario 3. One of the things that hasn't come to the Switch in a meaningful way is an app ecosystem. I mean, Hulu is here, but that's about it. No Netflix, no browser, unless you hack your way in. Now that doesn't bother me, because as you may remember from my Kindle Oasis review, I like the idea of dedicated devices for specific tasks. I consider the Switch a gaming deck and nothing more. But if you feel differently, you'll be happy to know that an unpatchable exploit was discovered in April that will soon let the HomeBrew community empower you to do a ton of stuff with the Switch that it was never designed to do. Sadly, and here we come to my other major complaint, that probably won't include enabling Bluetooth headphones. The Switch uses Bluetooth to communicate with the Joy-Cons, but if you want audio in your ears, you gotta hook up a cable to your cans. That introduces another level of inconvenience on the go, unless you wanna spring for yet another accessory and get a dongle that plugs into the headphone jack. On the brighter side of spending money, I bought my first amiibo at PAX East and aside from being a pretty sweet statue, the wedding tuxedo it enables for Mario in Odyssey is sleek. And in more useful news, you can use amiibo to port character features and abilities to someone else's Switch, get exclusive abilities, et cetera. There's so much more I could say about the Switch after a year, but the most important one is this. If you're a Nintendo fan, new or old, and the only things holding you back are concern about the quality of the experience or the viability of the platform, buy it. There's not likely to be another Switch for awhile, and game development is only accelerating. More importantly, there's nothing currently on the market that does what the Switch can do. Give an awesome game experience on the big screen, in the hand, and now with Labo in new form factors. And at the risk of sounding like a Nintendo shill, one last point. You might ask, with all the smartphones I review, why I don't just use them for my mobile gaming? Well, I do, but I never really love it because of the limitations of phone games. The Switch, with its big display and, most importantly, its physical controls, well it's just a better gaming experience in every possible way. I love it, and even at its original price, I think you will too. Folks, I wouldn't have known about half of this stuff without the input of my producer, Justus Perry, and of Russell Holly over at iMore. Thanks to both of them. Links to the iMore stories are down in the description below. Please, subscribe to theMrMobile on YouTube so you don't miss all the reviews coming this busy spring season. Until next time, thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "Switch",
        "Nintendo Switch",
        "Nintendo Switch Review",
        "Nintendo Switch Online",
        "Nintendo Mario games",
        "Nintendo",
        "Mario Kart",
        "Mario",
        "great pleasures",
        "pleasures of revisiting",
        "revisiting a product",
        "gamble pay",
        "Switch Review ReDo",
        "games",
        "Nintendo Mario",
        "Switch Review",
        "Switch Online",
        "game",
        "Mario games",
        "Mario Odyssey"
    ],
    "transcript_entity_values": [
        "300 bucks",
        "600",
        "about three hours",
        "only a dozen",
        "Mario",
        "PAX East",
        "Microsoft Surface",
        "Nintendo",
        "Super Nintendo",
        "Switch",
        "USB-C",
        "NES",
        "20 bucks",
        "iMore",
        "Justus Perry",
        "the year",
        "the Nintendo Switch",
        "YouTube",
        "Jumpin' Jim in Excitebike",
        "200",
        "a year",
        "Super Mario 3",
        "Mobile",
        "April",
        "WaterField Designs",
        "1080p",
        "20",
        "one",
        "One",
        "Kindle Oasis",
        "first",
        "Labo",
        "these days",
        "Zelda",
        "Hulu",
        "the Joy-Cons",
        "September",
        "Mario Odyssey",
        "the Nintendo Switch Review Re-Do",
        "Mario Kart",
        "the Joy-Cons",
        "about half",
        "Russell Holly",
        "this busy spring season",
        "Nintendo Switch Online",
        "Netflix",
        "13 months",
        "HomeBrew",
        "about 18 million",
        "Xbox"
    ],
    "transcript_entity_types": [
        "MONEY",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PERSON",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "ORDINAL",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "FAC",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}