{
    "id": "O2kAR-SKgpI",
    "title": "Microsoft's Pushy Web Browsers",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2021-12-28T19:06:27Z",
    "video_url": "https://www.youtube.com/watch?v=O2kAR-SKgpI",
    "category": "Science & Technology",
    "tags": [],
    "views": 331864,
    "likes": 18746,
    "comments_count": 1148,
    "description": "Check out the Drop x Sennheiser HD 6XX Headphones at   Microsoft Edge has made the news for trying to shame you out of using Google Chrome, but Internet Explorer was also incredibly pushy in its own way.  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Secretlabs Gaming Chairs:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  TechLinked:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://dro.ps/tq-6xx-holiday",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/SecretlabLTT",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/GMGLTT",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Nobody likes pushy notifications from software, but I got to give Microsoft credit for positively turning this into an art form. Like when you go to install Google Chrome, Windows might hit you with zingers like, \"That browser is so 2008,\" or, \"'I hate saving money,' said no one ever.\" But even though some reviewers have praised the Chromium-based Edge for a vastly improved feature set over past iterations, it's not exactly fair for Microsoft to imply that Google Chrome, a browser that's also continually being updated, is somehow stuck in the past. Of course, this is far from the only time Microsoft has gotten a big eye roll over how it chooses to compete in the web browser space. I'm of course talking about how Internet Explorer started raising eyebrows as far back as 1996, when Microsoft began bundling it with their ever popular Windows 95 operating system. Microsoft had already caught the attention of antitrust regulators a few years prior because of how dominant Windows itself was. But including a browser didn't seem like a huge deal at first to most users. That quickly changed, though, when Internet Explorer 4.0 came out in 1997. It drew a huge amount of controversy because it integrated quite tightly with the operating system itself, including Windows Explorer, meaning Internet Explorer became difficult if not impossible to remove, especially for less tech savvy users. And all this came at a time when the internet was rapidly exploding in popularity as worldwide internet usage roughly doubled each year during the late 1990s. That's crazy. Critics saw this as Microsoft unfairly using its dominance in the operating system space to get an advantage over its main rival, Netscape Navigator, in the browser space. And it wasn't just users who were irked about being unable to remove a piece of software that had clear problems. The US federal government claimed that Microsoft was violating an earlier agreement, which forbade them from linking sales of other Microsoft products to Windows itself. So how did Microsoft get away with this? We'll tell you right after we thank Drop Sennheiser HD 6XX headphones for bringing you today's video. They're one of Drop's all time bestsellers in collaboration with Sennheiser. The headphones feature an unchanged driver and sound structure as the HD 650 for a balanced mid-range and natural sounding bass. They come with a detachable six foot cable and Sennheiser's long-term support, so click the link below to join Drop today. Okay, so Microsoft's offense was basically saying that Internet Explorer wasn't a separate product, but rather a feature of Windows. Perhaps this was part of why they began integrating IE more fully into the operating system to the point where Windows wouldn't even function properly if IE were removed. But that doesn't exactly comport with the fact that most people viewed desktop web browsers as separate programs, which I think you'll agree is still true today. This explanation really didn't fly with the feds either, as they and 20 individual US states sued Microsoft in 1998 for anti-competitive behavior, especially as Internet Explorer was very similar to Netscape in a technical sense as they were both based on an older browser called Mosaic. Although a federal judge initially ordered a breakup of Microsoft, this was overturned on appeal and Microsoft ultimately agreed to a settlement that crucially allowed them to keep tying other software to Windows. But at the end of the day, this settlement wasn't even approved until 2004, and by then alternate browsers like Firefox were really starting to make headway against Internet Explorer anyway, as IE sucked enough for people to really start looking for competing browsers by that point. But IE did continue to be included in Windows all the way up till Windows 10. And although you could disable and hide it in your system settings, there was still no option to remove it completely. It wasn't until Windows 11 that Microsoft stopped including IE, but to absolutely no one's surprise, there's no easy option to remove its successor, Edge, since Microsoft uses Edge to promote its own services to you, the latest being that Buy now, pay later feature people don't particularly seem too enthused about. Instead, you have to perform a little trickery in the command line to actually remove it, which is better than nothing, but I'm still surprised it's been 25 years since Microsoft started bundling a web browser and they still kind of act like the ex who just won't go away. So thanks for watching, guys. If you liked this video, hit Like, hit Subscribe, and hit us up in the comment section with your suggestions for topics that we should cover in the future.",
    "transcript_keywords": [
        "Internet Explorer",
        "give Microsoft credit",
        "Microsoft",
        "Google Chrome",
        "install Google Chrome",
        "Windows",
        "Internet",
        "Explorer",
        "including Windows Explorer",
        "art form",
        "pushy notifications",
        "credit for positively",
        "positively turning",
        "browser",
        "give Microsoft",
        "Microsoft credit",
        "Internet Explorer started",
        "operating system",
        "meaning Internet Explorer",
        "Windows Explorer"
    ],
    "transcript_entity_values": [
        "the late 1990s",
        "Netscape",
        "Drop Sennheiser HD",
        "25 years",
        "US",
        "one",
        "Drop",
        "Chromium",
        "1998",
        "Windows",
        "Windows",
        "Sennheiser",
        "Google Chrome",
        "Mosaic",
        "Microsoft",
        "Edge",
        "Explorer 4.0",
        "2004",
        "a few years",
        "each year",
        "1996",
        "first",
        "Explorer",
        "1997",
        "Firefox",
        "Windows 10",
        "Netscape Navigator",
        "six foot",
        "Windows 95",
        "Windows Explorer",
        "the end of the day",
        "Windows 11",
        "2008",
        "20",
        "today"
    ],
    "transcript_entity_types": [
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "DATE"
    ]
}