{
    "id": "O72IIyQiM-I",
    "title": "The WEIRD Side of CES 2020",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-01-11T16:30:23Z",
    "video_url": "https://www.youtube.com/watch?v=O72IIyQiM-I",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "ces",
        "ces 2020",
        "tech",
        "gadgets",
        "consumer electronics show",
        "weird tech",
        "consumer tech",
        "best of ces",
        "worst of ces",
        "weirdest gadgets",
        "review",
        "technology",
        "amazon",
        "shaquille o'neal",
        "shaq",
        "guy fieri",
        "flavortown",
        "ar",
        "cool gadgets",
        "new gadgets",
        "weirdest tech",
        "weird",
        "mysterytech",
        "mystery tech",
        "cool tech",
        "amazon gadgets",
        "latest gadgets",
        "best tech",
        "gadgets 2020",
        "new technology",
        "nanoleaf",
        "future",
        "video",
        "youtube",
        "matt ansini"
    ],
    "views": 115559,
    "likes": 4230,
    "comments_count": 150,
    "description": "You saw the best of CES, now Matt looks at the rest... Sneaker Culture Explained with  @Jacques Slade:  The Pokmon Sword & Shield Controversy, Explained!:  Apple TV+ Has ALREADY Failed:  How China  Gaming:  The ORIGINAL Console War:   Subscribe! \r Twitter: \r Instagram:",
    "description_links": [
        "https://youtu.be/w1K4ro4z__g",
        "https://youtu.be/mFx2scjbUHs",
        "https://youtu.be/OIyl0e_MAVk",
        "https://youtu.be/xsLAY8qqvvY",
        "https://youtu.be/kvVq3p-qr5E",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, welcome to a very special episode of This Is, CES edition. Matt, it's weird here. - Yeah, there's a lot of weird stuff around here. Here, we have perpetual motion. Is that not what that is? - It's a bunch of fans on a wheel, but, I think we're about to get even weirder. Matt, are you excited for CES right now? - I am so excited for CES! I got to have drinks with Shaq, I went to Flavortown with Guy. I mean, what more could I want? So Austin, we found you a hat to help you with your receding hairline. - It's not receding, it's perfectly healthy. - What it does, is help you stop the hair loss. It's gonna keep the hair that you have today, and you're gonna be the same 20, 30 years from now. - Can I just wear the hat normally? I mean, it's a very stylish hat. - The hat, it's on right now, but you don't see the lights because it has some sensors. You don't see them because, it's for safety purposes for a kid that picks it up, looks at it. You don't want the lasers to be hitting them in the eye, so when you put it on... If you see, it detects that it's on your head, so it turns on. So, by wearing it for six minutes a day, you'll start seeing the results in a period of three to six months. - So as the office loves to bring up, I am the old man of the office, so it looks like I'm gonna have some anti-aging work done. If I sit here... Ah! I mean, does the chair come with this, because I think it's a great selling point. (laughing) - Here at the This is, beauty is our number one concern, and I'm about to become absolutely beautiful. I mean regardless, this actually feels lovely, so it's warm. I do feel that something is on my face. - [Ken] For the record, I can't exactly take you seriously when you're talking to us with the mask on. I'm sure it's helping you, but... - I'm actually not gonna lie, this is like, the most relaxed I've been all CES, so what's the regimen for this? Do I do this nightly? Do I have to do just de-aging, or can I do de-aging on one day and my acne control on another? - Well, for the best results, you should choose the color that you want to target for your primary skin concern. Then when you've achieved that result, you can move on to you're secondary skin concern. - So we're going around here, looking at what we think is super weird, but for some people, this is pretty normal stuff. I mean, we're in the health section right now. You focus so much on the laptops, or the VR or whatever, but there is so much more here than just that. - [Ken] You look younger already. - I feel younger! I feel 20 years younger. I'm not, but I feel it. - What did we just find? - We found a very rare pinecone from an LED tree. - So what we've got here, is essentially the world's biggest PC case, 'cause it's like a giant lamp. - There's so much stuff around here that looks cool, but you're like, why? - So, last year's CES, we took a look at a very impressive device, The Royal Flexpai, which at the time was the very first foldable phone. However, in the time since, it came out and it was well, not very good. So, because they didn't sell any of them, they built an entire tree of Flexpai's. - This is great, because we live in Southern California where we don't get a whole lot of rain. Each one of these is a phone, essentially. It's a screen from the phone, and if you look closely enough, they all have a little computer fan behind it to keep them cool. It's subtle, but they are flapping in the wind. It's great, and you can have whatever tree you want. You can have a This Is tree, and now we've got the Neorest Smart Toilet. I mean, I need this in my life. Not only is it just beautiful to look at, but it is full control for your toilet experience. You've got a little bum wash, little bidet, little bidet, to you too. There we go - Matthew, can I just say that I actually just installed, literally four days ago, a not Todo Washlet, but a bidet in my house, and it is the greatest thing I've ever done. Every day I've been here in Las Vegas, I miss it. - Oh, oh, oh. I just found a booth a little bit more my speed. So, for those of you who don't know, I love me a good adjustable bed, and these look right up my alley. Hello, I think you guys should consider incorporating the RGB into the mattress. I mean, that's a design choice. It's bold. - Yeah. - I just, it'd be great. So, when me and Ken share a bed, I get the cool side because, let's face it, I'm cooler, but he can have the warm side, that'd be perfect. Now, having walked around CES for the past four days, I can tell you wholeheartedly, that I think every booth should have a bed like this at it, because I would be all over every booth. So, this wall is great because when you stumble home after a few too many adult pops, you know exactly how your path was when ya, run down the wall. This one says CES. Well, I want it to say, This Is. - So, we found the Botboxer, which Matt is currently about to get into, so it's taking advantage of a magically AR headset, as well as a robotic bag which you actually can legitimately hit, and essentially it's all super imposed with the hologram with the magic leap, so as he's seeing the boxer go at him, he has to duck and dodge, and he can punch the real bag. Also, in case you're curious, Matt used to box, so he better be good, or I'm gonna make fun of him. On one side, we have the Botboxer, a punching bag that will punch you with magic leap, and on the other side we have Matt Ancini, one of the most talented boxers who have ever graced the This Is channel. All right, here we go. Oh, oh, that was a jab, that was jab. That's another jab, oh! There we go, oh! Oh, he's got him, he's got him - I'm getting hit a lot though. - He is getting hit a lot. Matt actually is slightly behind right now. - That was way more of a work out than I thought it was gonna be, but that was awesome! So, thank you for watching our coverage of CES. I mean, there's just some crazy stuff here. That just used up the last of the energy I had. I'm done. We'll see you at, This Is. I'm just really happy that Matt and I have the same CES voice now. (laughing)",
    "transcript_keywords": [
        "CES",
        "special episode",
        "CES edition",
        "Matt",
        "great",
        "weird",
        "hat",
        "feel",
        "stuff",
        "found",
        "lot",
        "tree",
        "side",
        "year CES",
        "day",
        "concern",
        "excited for CES",
        "phone",
        "weird stuff",
        "younger"
    ],
    "transcript_entity_values": [
        "CES",
        "three to six months",
        "one",
        "Southern California",
        "Guy",
        "The Royal Flexpai",
        "20, 30 years from now",
        "Shaq",
        "Matt Ancini",
        "today",
        "Flexpai",
        "VR",
        "Flavortown",
        "Matt",
        "RGB",
        "the Neorest Smart Toilet",
        "Austin",
        "the past four days",
        "Las Vegas",
        "one day",
        "20 years",
        "first",
        "Ken",
        "six minutes",
        "Botboxer",
        "last year's",
        "CES",
        "four days ago"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "CARDINAL",
        "LOC",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "ORDINAL",
        "PERSON",
        "TIME",
        "PERSON",
        "DATE",
        "NORP",
        "DATE"
    ]
}