{
    "id": "O8gCqSmtkrM",
    "title": "This Broke One Week out of Warranty... Can I Fix it for Cheap?",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-06-05T16:54:26Z",
    "video_url": "https://www.youtube.com/watch?v=O8gCqSmtkrM",
    "category": "Science & Technology",
    "tags": [
        "Asus",
        "VG27AQ",
        "VG27AQ1A",
        "Gaming Monitor",
        "DIY",
        "Repair",
        "Broken Monitor",
        "Tech Tips",
        "Monitor Repair",
        "Power Cycling"
    ],
    "views": 1545313,
    "likes": 62821,
    "comments_count": 2294,
    "description": "See what makes Gorgias different from other help desks at   Check out AMDs great deals on CPUs and GPUs from June 5th to July 1st, using the link below:    Plouffe's old Asus VG27AQ monitor broke after three years of service, just out of warranty. We're not sure WHY it's power cycling, but a new mainboard is inexpensive enough and we're comfortable tinkering with electronics... what's the worst that could happen?  Discuss on the forum:   Buy an ASUS TUF 27\" VG27AQ Monitor:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:57 It's Dead, Jim 2:30 Replacement parts 4:00 Teardown 6:35 Replacing Parts 9:00 Uh Oh 11:45 Try Again 13:30 Conclusion 15:48 Outro",
    "description_links": [
        "https://partner.gorgias.com/LTT",
        "https://amd.ryukyu/3PmqR6k",
        "https://linustechtips.com/topic/1511262-this-broke-one-week-out-of-warranty-can-i-fix-it-for-cheap/",
        "https://geni.us/aJxRCB8",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- This is one sad man. He was just one week outside of the three-year warranty period for his monitor when this happened. Yeah, look at that. The panel seems to be fine, but there's somethin' going on in the brains of this little guy that's causing it to power cycle all day long. Now, he could just go out and buy a new one, but that's gonna cost about 300 USD. And besides, this one's already broken, what's the worst that could happen if we tried to fix it? (screw driver clicking) Oh. (screw driver thudding) (Nicholas laughing amusingly) (beep). I mean, it's already broken, I don't (beep) care. - Maybe right here actually. (upbeat rhythmic music) - Great deals on AMD Ryzen processors and AMD Radeon graphics cards are yours for the taking, including amazing game bundles, for a limited time from June 5th to July 1st. Check them out the link below. - Tell me what happened. - Yeah, it was just power cycling. I woke up in the morning, it would just do this for a while. It would do the whole logo at first- - Right. - And then it kept getting worse, and worse, and worse. (Nicholas laughing amusingly) I'd just turn it off, unplug it, plug it back in. Hey, it would work! I did that for about a week. - Okay, so then what you're telling me is that you're a week out of warranty, and you knew about this for a week before you contacted anyone. (laughing) So, if you had actually just... - Yeah. (laughing) - Cool. Always consult a doctor as soon as your symptoms develop, friends. Well one way or another, you're out of warranty now. Which means we need to fix it ourselves. Now in a perfect world, we'd get replacement parts directly from the manufacturer. But unfortunately Asus, like many other manufacturers, doesn't really stock replacement parts for their older devices. So, it's off to eBay... PicClick. - Yeah. - PicClick. - It's great. - Where we're going to run into another Asus problem. This is super cool. Just the density of these results is amazing. - Yeah, don't you hate searching through eBay and you gotta sort through all the parts? Like, it takes forever to find the thing you actually want. - Like \"valve index clip cable\"... Cable clip. I need a cable clip, I lost my cable clip for my index. - Boom! - \"Genuine OEM Valve Index\"- - \"Cable Clip Replacement for Back of Headset.\" - That's the one I need! - Wow, the system works. - Oh, it opens in a new tab. Oh because of course it does, 'cause it's a really well-designed website. - 'Cause they know you're gonna want to click five tabs of these things. - Oh, this is kinda awesome. - It's really good, eh? (laughing) - Alright anyway, back to your monitor. (clearing throat) But, it doesn't save us from that Asus problem I mentioned. Some of their products, laptops for instance, have part numbers that differ only by the last couple of characters to indicate a different internal configuration but for the same model of product. For monitors, on the other hand, we've got results for the VG27AQ, that's what we have. And also the VG27AQ1A, which is a completely different product. If we bought a replacement board from that one and tried to put it in here, that would not work. So even if Asus support can't sell you a replacement part, I would suggest contacting them for some guidance to ensure you don't order the wrong thing. For our part though, we managed to find this replacement board for... Really? 50 bucks shipped. - Yeah. - Not bad! - There's some other ones on here that are like $112, so I think we actually saved a bit of money. - Yeah, that's awesome. I mean, it's used, so who knows how long it's gonna last. But personally, for that price, I'd rather take my chances than wait the months that Asus quoted us to get a new part. - Yeah. - Really, it came packed like this? - Ha-ha, yup! Used parts. (laughing) - Wow. I really hope this works. Anyway, this should be everything we need. A main board with low voltage differential signaling, speakers, and... Oh, I guess there's the daughterboard for the joystick control at the front of the monitor as well. (Linus clicking tongue repeatedly) So, you've got everything then. - Yeah, yeah. It's basically a full replacement because I don't know which part exactly in the chain is busted, so we just got it all. - Okay, well let's crack open the existing monitor. (plastic clicking) - From the back, (laughing) where there's like no protective anything too. Hey, look at this! This looks kinda like the same size as this, huh? - Okay. I couldn't help noticing this is quite... Is that how this was taped in here? (laughing) - Yeah. - Huh. - That's a monitor for ya. You know, it's a little less impressive when you look at the inside, eh? - Wait, no, no, it's actually like this. - Yeah, it's actually like this. We did open it up to take a look at it and everything, so it has been opened before, but yes, it was legitimately mounted with tape like this. - But, at an angle? - Yeah. - Okay 'cause I've opened a fair number of monitors in the past, I've never seen one that was mounted at an angle. - Sometimes, they look a little better than this, yeah. But it's at an angle for the rest of the case, right? You see how these two HDMI ports here? - Ooh! - Yeah, they're at an angle on this side, or this side, I can't remember. - For the IO! - But yeah, exactly. 'Cause we gotta replace all these ribbon cables. - Oh, uh... - Oh, we only three. - One second, yeah, we only got three ribbon cables. - Well, I really... Oh, they're labeled. Okay, so CN1- - [Linus Sebastian] I have two. - [Nicholas Plouffe] Two, and this is three. - [Linus Sebastian] So hopefully, CN4 works. (laughing) - Yup, I sure hope it does. - That's a lot of ribbons between the main board and the panel. I don't think I've seen that many before. 1440P 165 Hz, right? - Yeah, it does do HDR, but I'm pretty sure it's just single panel, you know, there's no actual full array local dimming. So, I'm not sure why it's got so many ribbon cables. - Are we even gonna bother replacing the joystick and the menu buttons? I don't think so. - It's probably fine without it. - Yeah. - Let's do everything else, see if it works. If it doesn't, then hey, we know what the problem is. - I see some manufacturing shmoo on here, but there's nothing that's obviously just shorted, or popped, or anything like that. - Yeah. The new one looks cleaner, which is nice I guess, but- - I mean, that also has manufacturing shmoo on it. - Yeah, not as much though. - Now, this is interesting. You're getting a new revision of the board. - [Nicholas Plouffe] Oh! - You're getting Rev A11 instead of A00. - Ay, that's a huge upgrade! - Is it? - I don't know. (laughing) - Do we know that this new board works even? - Uh, not yet. - Okay, so it could be more broken than it was to start with. - You never know. - (laughing) Neat. - We should probably replace this guy too. - Really, what does that guy do? - I don't know. - Power supply, maybe? Probably power supply. - Yeah, and you know what, if it's power cycling, I'm kinda concerned that it's part of the power supply is the issue. - Oh. Okay, what's going on here? Because the DC In comes in on this board, but I don't see anything resembling a power supply on here. - Yeah, and it doesn't connect... Where does it connect to this guy? I mean, it's got this cable here. - Like, way over here. Why don't we do one thing at a time, why don't we figure out what the actual problem was? Why don't we just try a new power supply to start? Okay, so original board. Doop. - You're not gonna short the board out or anything. - Yeah, don't worry about it. I mean, what, it's gonna get more dead? Pop! Okay, power! - If it breaks at this point, this is on you. - Hold on, hold on. No, no, you were here supervising. It was your responsibility to stop me. - Yeah, but this was your idea. Yeah, it's... Nah, it's still flickering. - Okay, it's still flicking. Okay, cool. - Yeah, it's still power cycling. - Let's replace parts one at a time then. - [Nicholas Plouffe] Okay. - I kind of like the idea of trying this new power supply here. - Yeah. If there's anything that has failed, my money's on the power supply just because it's a weird power cycling thing. It's not like I suddenly lost, you know, an input, or it just doesn't do the OSD navigation, or anything like that, so. - Yeah, and if there's anything that I've learned in all my years doing this, it's that if a problem is unpredictable or a flaky- - Yeah. - It's RAM or power supply. - Yeah. (laughing) - And this doesn't have RAM, so ready to try this? - Yeah, power supply, okay. - And power. - No. - [Andrew Moore] No. - It's still dead. - It's still a wrecked... Yeah, it just power cycled a couple times, yeah. - [Andrew Moore] It did something, but yeah. - Alright, well it was worth at least exploring because think about it this way. Even if we weren't able to buy one individual part for our repair, if we determined that hey, it was only the power supply that was dead, now we can resell this and maybe recoup some of our costs. - $20! - Well yeah, but hey- - Yeah, no, no, out of 50 bucks, that's almost half my cost. - Yeah! - Yeah. - Exactly, that's what I'm sayin'. And I suspect you could get more than 20 bucks for this- - Just 'cause it's a standalone part, good luck lookin' for it. - Yeah, exactly. - Yeah. - And it's the main part. - Yes. - New board. - After we've done this, if it's still messed up, then maybe it is a cable. - Oh yeah, I guess that's true. - Not a loose connection, but maybe one of them is just shorting out for whatever reason, or- - Just bad. - Yeah, just bad. 'Cause that's the other thing that often goes wrong. If it's not RAM or power supply, we spend an hour and a 1/2 troubleshooting a busted cable. (laughing) - I can't wait until we make our own cables. - Oh yeah, yeah. That's happened to me at least like two or three times on different videos, so I can't imagine how many other times it's happened to other people too. - Oh, so that's the new power supply. Pro tip, just put a little sharpie mark on the old one. - Oh, yeah. Or just, you know, put them somewhere completely different from the space where you're working. (laughing) - Just mark them. - Yeah. - I pressed the button! (gentle pensive music) - Nothing's happening. - Really? - [Andrew Moore] Give it a second. - It's not power cycling or anything. You made it more dead. - No, that's not possible. What, it's gonna get more dead? - [Nicholas Plouffe] Did you put the old power supply in? - Yeah. - Okay. - Look, I gotta try stuff at this point. - Yeah, I mean maybe we had it switched. - (groaning) Okay. - Let's switch the cables out. Maybe you broke one of the ribbon cables with all the finagling. That's possible. - It's possible, I really don't think so. Don't worry, very confident right now. I'm havin' trouble gettin' that in there. Nope, nope, nope, nope. - Okay. - Highly, highly confident right now. - [Nicholas Plouffe] This is gonna be like the camera fixing video. - No! (Nicholas laughing amusingly) Nothing will ever be like that again. - [Nicholas Plouffe] Yeah luckily, we're not tryna bake anything in the oven. - You must bring up every one of my past failures. Who do you think you are, my wife? (Nicholas laughing amusingly) Here we go, big moment. - That's pretty cool. We've done a full replace. - You guys saw everything! Okay, you know what? Okay, here's what we're gonna do. - We're gonna replace literally- - We're gonna go back to the original board for a second here. - Oh my God. - Hold on, hold on, we're gonna see if it power cycles. - Sure. Because then we know whether it's the board or something else. - Or maybe it's the installation. Maybe I got some of those funky cables kind of mixed around or something. - I'll take this out. - Please tell me it at least power cycles, please. - It's not doin' anything. - Are you kidding me? Okay, is this plugged in? - I checked that earlier, that was one of the first things I looked at. The Squid should still be on. We can change it to a different port if you want, it's goin' right here. - No, I believe you. - But like, yeah, we haven't done anything. - It's just for fun. - I know, I know, I get it. - Okay. What? - I don't know. - I don't understand. - I don't either. - Man, what is even the purpose of this channel? \"Hey, you should DIY repair your stuff. Don't worry, it's really e... Oh my God.\" (Nicholas laughing amusingly) - It's lighting up. - Okay, it lights up. - [Andrew Moore] That's the new board? - Nope - It's old board. Yeah, it's power cycling. - Okay. - Yeah, it's power cycling for sure. - Okay, we're back where we started. - Hell yeah. - Should we just try it again? - Yeah. Oh, we got a light this time. - Full disclosure, we went through a whole thing with this thing where it seemed dead. We were not getting a light. - Oh, I got an OSD input selection! - Wait, really? - Yeah, yeah, yeah, yeah, yeah! You wanna a look? - (sighing) Why? So we've got the new power supply, the new board. - [Nicholas Plouffe] Yup. - And we're good! - Yeah. It's... Yeah. We should probably plug in HDMI. - Okay, yes, yes! - To make sure it fully works. - I am not letting myself believe that this is actually fixed yet. - (laughing) Yeah, moment of truth. - So, I know I don't seem very excited right now. Yes! - No way! - It's definitely 144 Hz, 100%, 100%! - Ay! - And now what, we just tape this in place? - Yeah, we do, yeah! - This is bizarre! This is where the base amount goes into, it's not screwed on! (Nicholas laughing amusingly) - I'm gonna put gaff tape over top of that just for some added rigidity. - I don't think the gaff tape's gonna do anything. - You know- - Gaff tape's a gooey tape. - Probably not. But, it makes me feel slightly more comfortable, slightly. (Linus laughing amusingly) - While he's putting that together, why don't we talk about one of the jargony terms that I was throwing around earlier. I said this is an \"LVDS board.\" LVDS stands for low voltage differential signaling, and it's a communication standard that's created to help deal with electromagnetic interference or EMI. EMI can degrade the signal to the point of malfunctioning. So this LVDS is typically used in computer buses and video data transfer, including on LCD displays. There are a few reasons that it's used over other signaling standards. It provides a more scalable approach to voltage, easily adapting to small supply voltages while maintaining signal integrity. The voltage compliance is doubled because it's not limited to a single-ended output, and the output current remains constant which simplifies design and reduces overall cost, which as we know is why pretty much everything is designed the way that it is. That's why we assembled it with tape! - Ay! (plastic clicking) - Those are the old speakers. Even if they weren't, I don't need the speakers all that much. - Oh, whew, you lifted it up before I hit it. No, no, you gotta put it down when you hit it. - Oh my God. - Yeah, yeah! (plastic clicking) - [Nicholas Plouffe] Okay. - He's not stressed. Look at him, you can tell he's not stressed. Now hold on a second, you already replaced this thing. Did I just refurbish it so that you can sell it? - No, I'm not gonna sell it, I'm gonna use it. I've currently got a little 24-inch, 1080P, 60 monitor, for keyboard streams, for monitoring chat and stuff. And- - You're gonna use a 144 Hz gaming monitor for monitoring chat? - Yeah. I'll put it vertical. - You know how much you're making everyone's brain hurt right now, right? - Why, by holding it like this? - No, by using this to monitor chat. - Oh. (laughing) You know, it's gonna look really good. - Starving children could have eaten this gaming monitor. - Well, that's true. You know what? Maybe at the very least I'll sell the old 1080P 60 that it's gonna replace for basically free. I'll give it away to somebody. Look at that, it works! - Does it? - Yeah. - Are you sure? - Okay, plug in... Ay, yes it does! Incredible. - [Linus Sebastian] There you go, Asus, we found it. Incredible at last. - (laughing) They don't have to search anymore. - (laughing) I am never gonna get tired of that joke. - Yeah, that's pretty good. (laughing) - And I'm never gonna get tired of telling you about our sponsor. - Gorgias! Gorgias Helpdesk is a customer support platform, bringing new life to how businesses interact with our customers. We recently made the switch, and that's part of why the support on LTT store has improved lately. Between their centralized dashboard making organization easier, as well as how easy it was to integrate Gorgias with platforms like Shopify, it just made sense. Gorgias is an easy choice when trying to decide on what helpdesk to utilize for your business or online store. With everything being unified into that one dashboard, you don't need a million Chrome tabs for every chat on each social media platform. It's simple to both start fresh or switch over to Gorgias so you don't lose any time, and you can keep putting your customers first. As a business grows, so do their needs for efficient and effective customer support. So to see how Gorgias could elevate your helpdesk needs, check out the link below. - If you guys enjoyed this video, why don't you check out last time? That time, the electronics were fine but we needed a new panel, and it was a very similar and equally successful operation that saved Alex in that case, a lot of money.",
    "transcript_keywords": [
        "Yeah",
        "power",
        "Power supply",
        "board",
        "supply",
        "power cycling",
        "part",
        "cable",
        "Asus",
        "cables",
        "monitor",
        "thing",
        "replacement",
        "Cable clip",
        "works",
        "time",
        "Gorgias",
        "cycling",
        "parts",
        "put"
    ],
    "transcript_entity_values": [
        "AMD Ryzen",
        "one",
        "AMD Radeon",
        "second",
        "1080P",
        "LVDS",
        "about 300 USD",
        "first",
        "eBay",
        "Nicholas Plouffe",
        "Asus",
        "Two",
        "1/2",
        "June 5th to July 1st",
        "a week",
        "more than 20 bucks",
        "one week",
        "A00",
        "Asus",
        "an hour",
        "Gorgias Helpdesk",
        "the months",
        "all my years",
        "VG27AQ",
        "1080P 60",
        "EMI",
        "Alex",
        "five",
        "Gorgias",
        "VG27AQ1A",
        "all day long",
        "24-inch",
        "Andrew Moore",
        "1440P 165 Hz",
        "PicClick",
        "RAM",
        "almost half",
        "DIY",
        "144 Hz",
        "three-year",
        "100%",
        "LTT",
        "about a week",
        "only three",
        "three",
        "Squid",
        "Shopify",
        "50 bucks",
        "Linus Sebastian",
        "20",
        "HDMI",
        "112",
        "Linus",
        "LCD",
        "60",
        "a million",
        "Nicholas",
        "two",
        "OSD",
        "144",
        "IO",
        "at least like two"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "MONEY",
        "DATE",
        "PERSON",
        "ORG",
        "TIME",
        "PERSON",
        "DATE",
        "DATE",
        "GPE",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERCENT",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "MONEY",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL"
    ]
}