{
    "id": "oB2vxbYBiD4",
    "title": "The best bluetooth speaker to buy 🔊",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-09-01T14:30:22Z",
    "video_url": "https://www.youtube.com/watch?v=oB2vxbYBiD4",
    "category": "Science & Technology",
    "tags": [
        "bluetooth speaker",
        "best bluetooth speaker",
        "bluetooth speakers",
        "best bluetooth speakers",
        "bluetooth speaker review",
        "bose soundlink flex",
        "bose soundlink flex bluetooth speaker",
        "bose",
        "bose soundlink",
        "bose soundlink flex bluetooth portable speaker",
        "tech",
        "the verge",
        "ue boom 3",
        "ue boom 3 review",
        "sonos",
        "sonos roam speaker",
        "sonos roam",
        "sonos roam review",
        "jbl charge 5",
        "jbl charge 5 review",
        "jbl charge 5 sound test",
        "JBL",
        "Sony Bluetooth Speaker",
        "Sony",
        "sonos move"
    ],
    "views": 249285,
    "likes": 3495,
    "comments_count": 270,
    "description": "Bluetooth speakers have come a long way over the last few years, with newer models offering better sound quality and longer battery life. Whether youre looking for something small to take everywhere or a speaker for your backyard party, these are the best options from Bose, Sony, JBL, Sonos, and others.  If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:   You can get the bluetooth speakers in this video here:  Bose Soundlink Flex:   UE Boom 3:   Sonos Roam:   JBL Charge 5:   Sony SRS-XB43:   JBL Clip 4:   0:00 Intro 0:46  Bose Soundlink Flex 2:04  UE Boom 3 3:15 Sonos Roam 4:17 JBL Charge 5 5:19 Sony SRS-XB43 6:19 JBL Clip 4 7:00  Speaker test 7:30 Top pick & other options  Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "http://bit.ly/2TQsqjB",
        "https://amzn.to/3CPCHCZ",
        "https://amzn.to/3B5xYf8",
        "https://amzn.to/3RsjpaX",
        "https://amzn.to/3ei3DkR",
        "https://amzn.to/3TyJXcs",
        "https://amzn.to/3RwfutA",
        "https://bit.ly/3q4ljTq",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "(electronic music) - [Chris] Bluetooth speakers. They've become ubiquitous, indispensable gadgets. Everybody's got one somewhere by now, right? Whether you use your speaker around the house, or in the shower, or bring it to the park or the beach, or maybe you're one of those folks who straps it to their backpack or their bike, and shares their music with everyone nearby. (cycle bell dings) Now, I know a ton of people who have old trustee speakers that they've been using for years, and if that's you, there's no immediate reason to upgrade, but these things have gotten very good over the last few years: sound quality gets better and better, battery life has stretched to new highs, and these speakers are more reliable and durable than ever before. Now, choosing the best speaker is not so easy, honestly, because we all use these things in different ways. In terms of the best sounding Bluetooth speaker, that's the Bose SoundLink Flex. I don't know what kind of engineering sorcery is going on over there, but to my ears, Bose's speakers have always sounded better and more clear than any competitors in the same size range. And for $149, the small portable SoundLink Flex sounds phenomenal. Despite only having a single mono driver, which isn't uncommon for Bluetooth speakers, the SoundLink Flex delivers expansive sound with a genuinely surprising amount of bass. (speaker plays music) And, crucially, that low end isn't muddy or boomy, instead, everything about this speaker is rich, clear, and detailed. You can expect around 12 hours of battery life. And the SoundLink Flex is rated IP67 for dust and water resistance. Whether you lay the speaker flat, or stand it upright, the EQ automatically adjusts for either orientation. And the SoundLink Flex works much better than most as a speakerphone, thanks to its really good built-in mics. Not everything is perfect, mind you. The speaker's buttons can be hard to use or differentiate by feel. And it's weird that Boes chose Bluetooth 4.2 instead of a newer, more modern version of the spec. But if those are my biggest gripes, it's fair to say that the SoundLink Flex is a winner. Having said that, let's not forget about the legendary UE BOOM 3. It's frankly a little mind boggling that this thing is even still around in the year 2022. It came out back in 2018, and Ultimate Ears has been coasting on it ever since. Maybe that's a sign of how stagnant this market's become, or maybe it's a testament to just how good this $150 speaker really is. It checks off all the important criteria. With 15 hour battery life, a fully waterproof design that floats in swimming pools, and those giant foolproof volume buttons, the UE BOOM 3 still holds up. Compared to older models, the standout trick of the BOOM 3 is the so-called Magic Button. You just press and hold the button on top and it'll play whatever playlist you assign it. But what's really given the BOOM 3 such staying power, I think, is its simplicity, rugged build, and good enough sound. Music fires in all directions, and that makes for a nice soundstage, even if the BOOM 3 can lack the detail and sharpness of some competitors. But, as an all-rounder, it still gets the job done, and then some. (speaker plays music) These days affordable speakers are getting smarter than ever before, and the Sonos Roam is a great example of that. It's a Bluetooth speaker, sure, but the real selling points of the Roam are its smarts and tight integration with Sonos's multi-room audio platform. When you're at home, the Roam plays music over Wi-Fi, so, better quality than Bluetooth. You can seamlessly hand off playback from the Roam to another Sonos speaker with a press of a button. And it's a cheap way to get a turntable onto your Sonos system, as long as your turntable supports Bluetooth that is. You could group the Roam with other Sonos speakers to play music throughout the house. Or to use it as a smart speaker, take your pick between Amazon Alexa or Google Assistant for hands-free voice commands. Just make sure to have reasonable expectations. Sonos's bigger speakers often stand more powerful than you would think, but that's not really the case with the tiny Roam. It's detailed and its crisp, but it's not gonna blanket a room in sound. But for a desk, or in the shower? it's perfect. (spears plays music) But, sometimes, you do want more power, and in that case, JBL's Charge 5 is a great pick. It's larger than the UE BOOM 3 in terms of both size and sound. I'm not a fan of JBL putting a supersized logo on its newest speakers, so much for subtlety, but it makes up for that with stamina, offering up to 20 hours of continuous playback. Even better, you can charge other devices with the Charge 5. There's a USB-A port around the back, so you can charge your own phone or a friend's while you play tunes. My main disappointment with the Charge 5 is that it's a mono speaker, which means you're down mixing a stereo content and some instruments or parts of a song might not be as prevalent as they would be on a stereo speaker. And since the Charge 5 isn't as detailed or pristine as Bose's SoundLink Flex, which also has a mono setup, it's more noticeable here. (speaker turns on) (speaker plays music) What about those of you who want a speaker for a party in the backyard? In that case, Sony's SRS-XB43 gives you powerful stereo sound with deep resounding base. Plus, you get a light show to go along with the music. This speaker is more than capable of handling soundtrack duty for any outdoor party, especially, once you turn on the EXTRA BASS mode. But my favorite thing about Sony's speaker is the AUX jack on the back, which is pretty rare among Bluetooth speakers. That means you and your friends can just switch off who's playing music without worrying about whose phone is paired or all the usual Bluetooth headaches and hassles that we so often deal with. It's old school, but I'm here for it. Now, this speaker weighs over six pounds, so it's not especially portable or the kind of thing you're gonna toss into your bag every day. But it's tailor-made for use around the house and for parties. And yes, you can download an app and take full control of those lights. - [Speaker] Bluetooth connected. (speaker plays music) - [Chris] And finally, let's go in a complete opposite direction with a teeny-tiny adorable speaker. JBL's Clip 4 has an integrated carabiner which makes it effortless to attach to your bag, bike, or who knows what else? And for a compact speaker, I was pretty impressed by its sound. The bass is a bit recessed, obviously, but mids and treble are clear and very nice. Just like our other picks here, it's rated IP67 for dust and water resistance. And combined with its diminutive size and 10 hour battery life, you're looking at a really great speaker for hikes or other adventures. (speaker plays music) So far in this video, hopefully, you've gotten a sense of how each of these speakers sound on their own. Now we're gonna run through all of them back-to-back, and I know it's not as good as hearing them in person, but this should make the differences a bit more clear. (speaker plays music) Those are just a few of our very favorite Bluetooth speakers. My personal pick is still the Bose SoundLink Flex. It's just such good sound for the size, but there are so many good choices right now. Marshall makes great speakers if you're a fan of that rock and roll vibe. And if saving money is priority number one, you really can't go wrong with anything from Anker. But the bottom line is: you don't have to spend a lot of money to get a very good speaker, and that's a pretty great thing. (electronic music)",
    "transcript_keywords": [
        "SoundLink Flex",
        "Bose SoundLink Flex",
        "speaker",
        "Bluetooth speakers",
        "Bluetooth",
        "speakers",
        "Flex",
        "SoundLink",
        "Bose SoundLink",
        "BOOM",
        "SoundLink Flex sounds",
        "Roam",
        "sound",
        "Sonos",
        "Charge",
        "good",
        "Bose",
        "music",
        "portable SoundLink Flex",
        "favorite Bluetooth speakers"
    ],
    "transcript_entity_values": [
        "Clip 4",
        "Magic Button",
        "These days",
        "149",
        "Chris",
        "Ultimate Ears",
        "the Charge 5",
        "one",
        "SoundLink Flex",
        "up to 20 hours",
        "IP67",
        "USB",
        "Boes",
        "Alexa",
        "Roam",
        "the last few years",
        "10 hour",
        "Marshall",
        "Google",
        "150",
        "Bose",
        "SoundLink Flex",
        "SRS",
        "5",
        "Bose SoundLink Flex",
        "JBL",
        "number one",
        "years",
        "Amazon",
        "Bose",
        "Sonos",
        "2018",
        "Bluetooth",
        "15 hour",
        "Sony",
        "EQ",
        "Anker",
        "Wi-Fi",
        "the Charge 5",
        "around 12 hours",
        "six pounds",
        "4.2",
        "the year 2022",
        "the SoundLink Flex"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "DATE",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "TIME",
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "LOC",
        "EVENT",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG"
    ]
}