{
    "id": "OB3yT2fO_IU",
    "title": "Flying with the AMAZING Helicopter Dog Bentley!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-06-29T16:44:37Z",
    "video_url": "https://www.youtube.com/watch?v=OB3yT2fO_IU",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "helicopter dog",
        "bentley"
    ],
    "views": 92175,
    "likes": 4537,
    "comments_count": 528,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, I am so excited because today we are about to go on a helicopter ride with Bradley and his dog Bentley. Now Bentley has been riding around in a helicopter with Bradley for quite a while. You may have seen him on Instagram, or YouTube, or somewhere on the internet. But today Jenna, and Susie and I are going to ride with Bentley. We got Bentley a present, I hope that he likes it, I think he will, it's a cheeseburger. - Hopefully he likes us. - That's important. - Very important, I don't care what anyone else thinks of me except Bentley. This is how Justine eats her cheeseburger. - [Justine] It's true, I do. - Then she's like I think I want the buns and then, (girls laughing) - True story. (chattering) - Hi, Bentley! - Look we got you a toy! - Is that a toy? - We got you a toy! - A toy, oh my goodness! - Pound it, good boy! So one of his favorites is Brussels sprouts. - [Justine] That's weird! - Bentley loves raw Brussels sprouts. The funny thing too is like fennel, it's his other favorite. - [Justine] That is, Bentley, that's weird. Why do you like that? (laughing) - [Jenna] Bentley I see you crunching on Instagram and now it's real life and I've never been happier. - [Bradley] Right! (laughing) What dog likes fennel? (chuckles) - [Jenna] Also, no dog rides in a helicopter. - That's true. - It's true. - [Bradley] He could like literally just eat vegetables all day long. - Bentley you wanna go on a ride?! Bentley wanna go on a helicopter? Okay bye, bye. He only listens to his owner. (laughing) He's like nope, Bradley's going this way, I'm going this way. So here's the helicopter, we're about to head up, I'm not actually sure where we're going. I didn't even ask, I just basically said, cool, wherever you wanna take us, we're ready for an adventure. (lively piano music) - So you have your entire helicopter basically tricked out for making videos. - It's tricked out, it's- - Like it's crazy, you even have a dongles that you can make Instagram stories- - Double dongles. - Double dongles!? - Double dongle. - [Justine] Another go pro, you got the headsets, another go pro, so how long have you been flying? - About a week, uh, three weeks now. - [Justine] Three weeks now? - Been doing a lot of Microsoft flight simulator and stuff so I'm getting really really good at it. I'm still a little wobbly, so I'm really excited to try this out in real life. - Oh gosh, my parents are gonna be terrified. - 27 years I've been flying. - 27, wow! - 27. I know it's weird, I'm like 29, and how have I been flying for 27? - [Justine] It's crazy, it's magic. - [Bradley] Alright. - Okay, we're about to take off, where are we going today? - We're going into the mountains. - Okay, cool, I didn't even ask. I was just like let's just go, you know. Getting into helicopters with strangers is the new getting into cars with strangers. - [Bradley] Strange men in helicopters. - I mean, you know, we met once it's like cool, cool yeah. - Old friends, clear! - Okay do we close these doors? And we're off. - [Bradley] So this is called Widgeon Creek and we're gonna go up to Widgeon lake and land on the rock at Widgeon, mother natures helipad, we call it. - Are there like places you're not supposed to land or is it just they don't look safe? - Around here, there's really nowhere that I'm not allowed to land. Private property obviously, private property rules apply. They'll prep areas, so if there's like a community and then there's a park north of here called Garibaldi that's prohibited for air craft movement. - [Justine] People land there? - I'm the only guy that I know that's ever landed here. So I had to go in first and drop two guys that had to move all the rocks and stuff so that I could actually get back in. And we're gonna leave. - Aw, yeah let's go away. (laughs nervously) Oh, my gosh, wow. How fast does this helicopter go? Don't, you don't have to show me. - [Bradley] Right now, we're doing 70 knots and almost the same on the ground, so we're doing about 80 miles an hour. - Oh wow, how long has Bentley been flying? - Bentley has been going with me since, I think 2015. I honestly think he has about 250 hours. Alright you guys wanna have your cameras up for this. - Oh yeah, oh my gosh it's so pretty! - [Bradley] And there's some campers down on the left down there. - [Justine] Oh, great. (string music) Oh my god! What, oh my gosh, whoo, oh my god. I do these things up in my drone and it's not, I shouldn't. Oh boy. - [Bradley] What do you think? - [Justine] This is awesome. - Oh my gosh, this is crazy. I'm having the best time. - So we just made our first stop, Bentley is out and stealing sticks. It's absolutely so beautiful and we only flew for 15 minutes to get here. - We're in Widgeon lake. - Widgeon Lake. - Pinecone Burke Provincial Park. - Bentley, good boy! - Got to get the stick. What is this, want this one or do you want snow, should we go get some snow? - [Justine] Oh, snow boy. - [Bradley] He will eat, we've landed before and he's got out of the helicopter and peed for a minute and a half straight. But he won't pee on snow because snow's food. (girls exclaim) - [Jenna] What a good boy, what a good boy. (inspirational music) - This reminds me of like a scene from Star Wars where things looked really wrong. Whoa. Oh my god! - Is that cool? - This is so cool. - Alright let's head down to the Pitt River Hudson. (inspirational music) - Wow, we're landing on the bridge. Oh my goodness, I'm proud when I land my drone on like a small little rock. - [Jenna] I know right. (chewing) - [Justine] Bentley let's talk about that cucumber. - [Bradley] Can't talk, mouth full. (loud crunching) (chuckling) - So we are at our next destination. Where are we now? - The Pitt River hot springs, so probably the nicest hot springs in all of BC right there. - It's so pretty, I'm gonna try to fly my drone through here. It's a little bit windy so hopefully all goes well. Flying a drone and flying a helicopter are two very different things. (dubstep music) Wow, look at that guys. - So see these lines in the ice, those are every year. So like the rings in the trees you see those really defined lines. Those are like, rings for the tree for the snow pack and then the melt, snow pack and melt. (dubstep music) - We are now going to some ice caves. Bentley loves snow so much and he's got on his little jacket and here we go, we're going in, it's absolutely just stunning, this view. I've also got my Insta360 One camera, so I'm gonna get some 360 shots and see what we can get. You guys ready? - Yep. (water rushing) - Oh god, oh god, oh god, it's okay because- - Oh, no! - Bentley! - The waters cold! - Oh my gosh, wow! This is incredible. - Let's go, oh boy. Hi Bentley, look at you buddy. Oh look, somebody's camping. - [Bradley] Uh, that's survival gear. - Oh that's pretty amazing that they have survival gear just in case of an emergency. Bentley are you having fun? - Hi, Bentley! - Bentley say hi to the 360 camera. No like, I'm touching it, but in the camera it doesn't look like it. - [Bradley] Okay come with me that way. - This is so freaking cool, I'm losing my mind! You guys this is so incredible, like, I'm freaking out. (water rushing) - [Bradley] Justine in her natural environment. (slow dubstep music) Trying to cross back over. Oh man, look at you! Nailed it! - Definitely have a wet foot water proof, lies. You wanna go to the helicopter? - [Bradley] You wanna go on the ice? (slow dubstep music) - We're out of the ice caves now, we're heading back into the helicopter and we're heading back out. This was so awesome. - Come here. - Oh buddy, this ice. - Yeah, it's really sharp. - Sharp ice? - Sharp ice. Can you hear me crunching? Aw man, you guys are missing out. - Ha ha. - Wow, we touched that water! - What's that? - We touched that water. - That water touched us, I think. - It definitely, it touched my foot, it's still touching it. - Oh my feet, oh yeah, they're full of it. - Woo-hoo. - Wow, wow wow. (dreamy music) - Worlds best amusement park ride. - Yeah it's, I mean, I don't really know if anything comes close to it. This is like the soar through California ride. - Yeah. - It is. (dreamy music) - You guys, we've officially landed. - Officially. - Bradley, thank you so much. - This is an official landing. - This is an official landing, we are here, we're back. I'm exhausted and we didn't, I didn't even do anything. - Sitting in your seat is hard sometimes. - It is, but wow, this was so great. It was such an incredible experience. Bentley, hi baby. - [Jenna] Oh he's been so sweet back here. Brussels sprout boy. - [Justine] Bentley, oh my goodness. He is so hyped about the Brussels sprouts. - [Jenna] It's so great. - Well that brings today to a close. We had so much fun with Bentley, so much fun with Bradley. I have never spent that much time in a helicopter before and it was probably one of the best experiences ever. Well, I'll see you guys in my next video, bye! - Speak! - Speak! (barking) Good boy! (electronic music)",
    "transcript_keywords": [
        "Bentley",
        "helicopter",
        "wow",
        "boy",
        "guys",
        "good boy",
        "snow",
        "Bradley",
        "Widgeon",
        "cool",
        "ice",
        "yeah",
        "god",
        "flying",
        "good",
        "gosh",
        "Widgeon lake",
        "back",
        "ride",
        "Brussels"
    ],
    "transcript_entity_values": [
        "a minute and a half",
        "Bentley",
        "one",
        "Three weeks",
        "27",
        "Bradley] Justine",
        "Widgeon lake",
        "Justine",
        "29",
        "Instagram",
        "Justine] People",
        "2015",
        "Bentley",
        "YouTube",
        "about 80 miles an hour",
        "Justine] Bentley",
        "15 minutes",
        "Widgeon",
        "BC",
        "Pitt River",
        "Widgeon Creek",
        "today",
        "70 knots",
        "Garibaldi",
        "two",
        "California",
        "Susie",
        "Brussels",
        "Microsoft",
        "Bradley",
        "three weeks",
        "Bradley",
        "Widgeon Lake",
        "first",
        "about 250 hours",
        "Jenna",
        "One"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "LOC",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PERSON",
        "TIME",
        "GPE",
        "ORG",
        "LOC",
        "LOC",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "GPE",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "LOC",
        "ORDINAL",
        "TIME",
        "PERSON",
        "CARDINAL"
    ]
}