{
    "id": "OBGxt8zhbRk",
    "title": "\"Shut Down\" Doesn't Actually Shut Down Your PC",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2021-05-11T18:36:43Z",
    "video_url": "https://www.youtube.com/watch?v=OBGxt8zhbRk",
    "category": "Science & Technology",
    "tags": [
        "Windows",
        "Microsoft",
        "PC",
        "Shut Down",
        "Restart",
        "RAM",
        "Flash Storage",
        "Hard Drive",
        "Storage",
        "SSD",
        "Boot",
        "Why",
        "Riley",
        "Techquickie"
    ],
    "views": 3397602,
    "likes": 150463,
    "comments_count": 6018,
    "description": "Sign up for iFixits monthly Pro Tech giveaway!  Checkout iFixit Tools:   Have you ever wondered how your PC boots up really fast from a shutdown and even remembers which websites and programs you had open? Well, when you might be surprised why and how your PC does it in today's video!  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  TechLinked:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://ifix.gd/lttsignup",
        "https://iFixit.com/Techquickie",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Even if you know, absolutely nothing about computers, turning off a PC, it's pretty simple, right? When you press the button on the front or the side or just click shut down on the windows start menu and that's supposed to do the trick. But wait, it turns out that shut down in windows 10 doesn't actually mean shut down. Is this just another example of computer companies not trusting us to operate our own stuff or something else going on? So here's the deal. Remember the hibernate feature that became popular back in the days of windows 2000? Where you could save all the contents of your RAM to your disc before powering the computer off which would significantly cut down on startup time, do you remember that? Hibernate was a big deal because older laptops tended to be power hogs. So hibernate offered a way to quickly resume working without putting the machine in standby or sleep modes that would still draw power. As laptops have become more power efficient over the years hibernate was de-emphasized. Although you can still show the hibernate command in the start menu by checking this box in favor of a feature called hybrid sleep. Which would put the computer in sleep mode but also dump the contents of RAM to the disk. So the computer would wake up more quickly than it would from pure hibernation. But in case of power loss the system could still recover its previous state from its hard drive or SSD. So without established, let's bring it back to the title of the video. What happens when you click shut down? Well, Microsoft has taken the idea behind hybrid sleep and added yet another feature called Fast Startup that actually changes the way your computer shuts down. Here's how it works. Fast Startup, which is enabled by default on windows 10 takes the state of the windows kernel which is essentially the core elements of the operating system and saves it to the disk. However, this only happens after windows logs you off so none of the data from programs or files you are working on gets saved. In this sense it's closer to a normal shutdown than hibernation but it doesn't get 100% of the way there. The benefit of Fast Startup is exactly what it sounds like. Your PC doesn't have to spend tons of time re initializing critical windows components when you power the system back on allowing for shorter boot times. However, there's a downside that can cause really puzzling issues if you're unaware that Fast Startup even exists problems that are present within the kernel itself, such as a misbehaving device driver that would normally disappear with a full shutdown can recur when you start your computer back up if you have Fast Startup enabled. So because Microsoft figures people are more likely to hit, restart than shut down if some bug necessitates the reboot restart actually cycles your PC through a full shutdown whereas shut down counter-intuitively does not wow is wild. But there are ways around Fast Startup if you want to ensure your computer is completely clearing out its current state every time you turn it off. You can simply disable Fast Startup by going to control panel, then power settings then choose what the power buttons do not the most obvious place to find it but at least it's a simple fix. You can also leave Fast Startup enabled and perform a full shutdown on demand by holding the shift key when clicking shutdown from the start menu. There's a chance you may not even miss the slightly Faster Startup if you're running a modern system with a speedy SSD. So it might be worth it to bust out the stopwatch and see how much time you're saving with the feature on versus off, a totally normal thing that people do with their free time. Speaking of things to do with your free time, fix your stuff with our sponsor, iFixit. iFixit once to help you repair or upgrade everything from the cameras to vintage game consoles that you have. There Pro Tech kit has 64 steel bits and iFixit most popular opening tools, all rolled up in a one package. The kit also includes suction cups, opening tools anti-static wrist straps and more. Plus everything is covered by iFixit lifetime warranty. Sign up for the iFixit newsletter to learn more about repairing your devices and if you use our link to sign up, you'll be entered into a draw each month to receive a free Pro Tech toolkit. Sounds awesome, check it out. Well, that's it for this video guys thanks for watching, like the video, dislike the video wherever you are, whatever your heart desires. And if it desires this, check out our other videos comment below with video suggestions and don't forget to subscribe and follow because my heart desires you. (chuckles)",
    "transcript_keywords": [
        "Fast Startup",
        "Fast Startup enabled",
        "startup",
        "Fast",
        "called Fast Startup",
        "computer",
        "windows",
        "power",
        "disable Fast Startup",
        "leave Fast Startup",
        "shut",
        "Startup enabled",
        "time",
        "hibernate",
        "shutdown",
        "video",
        "iFixit",
        "startup time",
        "start menu",
        "Pro Tech"
    ],
    "transcript_entity_values": [
        "Microsoft",
        "iFixit",
        "the days",
        "Fast Startup",
        "64",
        "each month",
        "windows 10",
        "100%",
        "Pro Tech",
        "RAM",
        "windows 10",
        "one",
        "SSD",
        "the years"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "EVENT",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE"
    ]
}