{
    "id": "OCHDsn6K8qw",
    "title": "NO! BOB SWAN'S GONE!",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-01-14T03:52:10Z",
    "video_url": "https://www.youtube.com/watch?v=OCHDsn6K8qw",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "Intel",
        "CES 2021",
        "Intel CEO",
        "Bob Swan",
        "Pat Gelsinger",
        "replace",
        "stepping down",
        "investors",
        "Intel roadmap",
        "processors",
        "11th gen",
        "H series",
        "desktop",
        "mobile",
        "laptops",
        "notebooks"
    ],
    "views": 391043,
    "likes": 25278,
    "comments_count": 1008,
    "description": "Remotely monitor and manage your server or PC with Pulseway at   GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   Timestamps: 0:00 Baybeeeee 0:06 Intel changes CEOs 0:55 More Internet censorship stuff 1:51 Qualcomm buys Nuvia 2:52 Pulseway 3:24 QUICK BITS + Weird CES Stuff 4:00 Galaxy S21 Ultra leaks 4:15 Ring adds end-to-end encryption 4:36 Europol takes down DarkMarket 4:56 GAEM NEWZ  NEWS SOURCES  BOBS SWANSONG Intel replaces CEO Bob Swan     WHO BANS THE BANNERS YouTube suspends Trump   Facebook, Twitter being sued over censorship  Airbnb cancelling Washington DC inauguration bookings   ARMING ITSELF Qualcomm acquires Nuvia for 1.4 billion   Samsungs next processor will have an AMD GPU    QUICK BITS  EMBRACE THE WEIRD Cadillac single-seater VTOL  ASUS ZenBeam Latte portable projector looks like a coffee cup  Avita Admiror II   SPOILER CULTURE Samsung Galaxy S21 Ultra basically leaks in full    IGNORE THE ALARM BELLS Ring adds end-to-end encryption, please trust us  its not like its their business    EDGELORDS NEVER PROSPER Europol takes down largest dark web marketplace, DarkMarket     GAEM NEWZ Ubisoft will make Star Wars games  Hogwarts Legacy delayed to 2022  CD Projekt Red commits to quality  ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/ces2021",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://linustechtips.com/topic/1293414-intel-replaces-bob-swan-with-vmware%E2%80%99s-pat-gelsinger/",
        "https://www.cnbc.com/2021/01/13/intel-ceo-bob-swan-to-step-down-in-february.html",
        "https://newsroom.intel.com/news/note-from-pat-gelsinger-to-intel/",
        "https://www.nytimes.com/2021/01/12/technology/youtube-suspends-trump.html",
        "https://twitter.com/YouTubeInsider/status/1349205688694812672",
        "https://arstechnica.com/tech-policy/2021/01/facebook-and-twitter-could-be-sued-for-censorship-under-proposed-state-law/",
        "https://www.npr.org/sections/congress-electoral-college-tally-live-updates/2021/01/13/956394330/airbnb-is-canceling-all-reservations-in-metro-d-c-during-inauguration-week",
        "https://linustechtips.com/topic/1293485-qualcomm-acquires-semiconductor-startup-nuvia-for-14-billion-dollars/",
        "https://techcrunch.com/2021/01/13/two-year-old-nuvia-sells-to-qualcomm-for-1-4-billion/",
        "https://www.anandtech.com/show/16408/samsung-confirms-amd-rdna-gpu-in-next-exynos-flagship",
        "https://www.androidauthority.com/samsung-exynos-amd-gpu-2022-1192046/",
        "https://news.yahoo.com/gm-reveals-futuristic-flying-cadillac-225447649.html",
        "https://www.tomsguide.com/news/asus-just-launched-a-coffee-mug-size-projector-at-ces-2021-meet-the-zenbeam-latte",
        "https://www.engadget.com/avita-admiror-ii-ring-light-nexstgo-ces-2021-154524749.html",
        "https://www.theverge.com/circuitbreaker/2021/1/13/22229034/samsung-galaxy-s21-leaks-news-rumors-stylus-ultra-plus-carrying-case-video-trailer-specs",
        "https://twitter.com/evleaks/status/1347512537424797696",
        "https://www.cnet.com/news/ring-announces-end-to-end-video-encryption-for-its-doorbells-and-security-camerasat-ces-2021/",
        "https://youtu.be/DG1uUrNkyzk",
        "https://www.europol.europa.eu/newsroom/news/darkmarket-worlds-largest-illegal-dark-web-marketplace-taken-down",
        "https://www.theguardian.com/technology/2021/jan/13/australian-man-arrested-in-germany-over-worlds-largest-darknet-marketplace",
        "https://www.neowin.net/news/darkmarket-reportedly-one-of-the-biggest-dark-web-marketplaces-shut-down-by-authorities/",
        "https://www.techradar.com/news/ubisoft-is-making-a-star-wars-open-world-game-ending-eas-exclusivity",
        "https://www.polygon.com/2021/1/13/22229084/hogwarts-legacy-harry-potter-rpg-delay-release-date",
        "https://youtu.be/O3V4UBZmC9o",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Oh, man, the Tech News don't stop. Keep that Tech News flowin' baby! Intel has announced that their CEO for the last two years, Bob Swan, is stepping down. Swan, who was formerly the company's Chief Financial Officer will be replaced by Pat Gelsinger, a former Intel veteran of 30 years. - [Guy] Gelsinger? - Meh. - [[Guy] I don't Know. - He's super gel. The announcement comes right in the middle of CES, which would normally seem like a sign of instability. But for one, this is a virtual CES, so it doesn't count. And for two, Intel is pretty unstable right now. So it's fine. Investors seem to be happy with the change, hoping that Gelsinger, gel singers, G singer, his former roles as an engineer and as a Chief Technology Officer will help him straighten out the company after years of manufacturing problems and competitive missteps. Although, his name is way less fun to say. Bob Swan! YouTube is a little late to the band fest, but yesterday they announced that they were suspending US President Donald Trump's channel, because of the risk of ongoing potential for violence. The site said a recent video from his channel violated its policy for inciting violence. So the channel has received a strike, and is temporarily disallowed for uploading new content, for a minimum of seven days. Of course it is a fairly lax punishment compared to platforms like Facebook and Twitter, who have slapped indefinite bans on the present and many of his supporters, leading to controversy over censorship. This week, lawmakers in North Dakota submitted a bill that would allow citizens to sue social media platforms with over 1 million users, for restricting censoring or suppressing speech. America is pretty tense right now, heading into president elect Biden's inauguration next week. So much so, that Airbnb has canceled all bookings in Washington, DC. That's just not fair to the owners. How about let's just get through that and then we can talk about nationalizing Twitter. - [Guy] Yeah. - Okay? And thanks to Apple, ARM processors are a bigger deal now than ever before, which has gotten Qualcomm so excited, that they bought fellow ARM chip designer, Nuvia, for $1.4 billion. Nuvia was founded in 2019 by former engineers from Apple, Google, ARM and AMD, and has been working on Phoenix, an ARM server SOC, designed to achieve the highest single thread performance in the industry, which is not something ARM chips are especially known for. Maybe the chip burns itself out and then reboots, or something. - [Guy] (mumbles) feels like a Phoenix. James, did you get that (laughs) - Oh, it's a feature, not a bug. And hey, in other ARM news, Samsung announced a new Exynos processor at CES. Cool, whatever. But they also said, their next chip will finally debut with that built-in AMD GPU that they've been hearing so much rapid speculation about in 2022, the year the best gaming laptops will be a Samsung phone. And that's a fact, Jack. You can take that to the bank. - [Guy] Take that to the bank! - Hank. Now it's time for Quick Bits, brought to you by Pulseway, the software that lets you manage your system from wherever you are. With Pulseway I become, the pulse master. I have complete real-time monitoring and control of servers, workstations and network devices, like printers and routers. I can automate security patching, on all my devices. I have full access to real-time statuses, log logged in users and network performance. Right now, I'm creating and deploying automated custom scripts, to complete IT tasks. Is glorious! Now be gone. You too can have this power. Try Pulseway for free at pulseway.com, or through our link in the video description. Ah, the Quick Bits! There's always more weird stuff to talk about during CES, like this single seat vertical takeoff and landing concept vehicle from Cadillac (laughs) It's not real, but it is cool. Asus made a tiny projector shaped like a coffee mug and called it the ZenBeam Latte. (laughter) Should have been the ZenBean. And the Avita Admiror II is a laptop with three webcams and a built-in ring light around the display so streamers can look fresh as hell on the go. It just needs a forward facing fan, and I may consider it. - [Guy] Blow your hair. - Yeah, Mariah Carey hair, very rare. Samsung's S21 Ultra has basically been leaked in full by Evleaks, revealing specs, color ways, and even a case with a built-in slot to put the S pen. I guess this is more or less our confirmation that the Note line is over. I'm not sad, well. Ring, the home security company owned by Amazon has announced they're adding end-to-end encryption for their video doorbells and security cameras. For some of them anyway. And Amazon for sure promises they won't look at your encrypted data. It's not like, selling it as a huge part of their business model or anything. - [Guy] They're successful capital people making money. Economy. - Europol has taken down what is suspected to be the largest illegal marketplace on the dark web, with the arrest of its operator in Germany. Bit of advice for those building its successor. Maybe don't call it something like, DarkMarket. Kind of draws attention. Evil shop, secret drug market. - [Guy] The bad place. - Yeah, Body Parts R Us. And to round off today's show, we've got some game news. Disney's newly formed Lucasfilm games division has enlisted Ubisoft's massive studio to make an open world \"Star Wars\" game. Ah, it's so easy to get excited when you hear \"Star Wars\" even though I've been burned so many times. Plus we already have that. It's called \"The Mandalorian.\" But whatever. \"Hogwarts Legacy\" has been delayed to 2022. I'm assuming in hopes that people will have forgotten who J K Rowling is by then. And CD Projekt Red has published a video admitting to its mistakes developing \"Cyberpunk 2077\" and making a commitment to quality going forward. Hey, that's awesome. Whoa, time to end this one, guys. Come back tomorrow for more Tech News because it's like a special week, just like you. - [Guy] Aww!",
    "transcript_keywords": [
        "Chief Financial Officer",
        "Bob Swan",
        "Tech",
        "ARM",
        "Tech News flowin",
        "Chief Technology Officer",
        "company Chief Financial",
        "CES",
        "Swan",
        "Pat Gelsinger",
        "Intel",
        "Gelsinger",
        "Financial Officer",
        "Quick Bits",
        "Chief Financial",
        "Star Wars",
        "announced",
        "ARM server SOC",
        "Pulseway",
        "video"
    ],
    "transcript_entity_values": [
        "CES",
        "Nuvia",
        "yesterday",
        "Exynos",
        "Germany",
        "America",
        "$1.4 billion",
        "Intel",
        "Qualcomm",
        "three",
        "seven days",
        "next week",
        "US",
        "Google",
        "J K Rowling",
        "S21 Ultra",
        "2019",
        "the year",
        "North Dakota",
        "Jack",
        "the S pen",
        "Amazon",
        "Projekt Red",
        "This week",
        "Donald Trump",
        "Pat Gelsinger",
        "SOC",
        "YouTube",
        "Phoenix",
        "Swan",
        "Twitter",
        "Biden",
        "Samsung",
        "Quick Bits",
        "Disney",
        "Bob Swan",
        "2022",
        "Washington, DC",
        "Hogwarts Legacy",
        "The Mandalorian",
        "the Avita Admiror II",
        "Pulseway",
        "AMD",
        "Nuvia",
        "over 1 million",
        "Mariah Carey",
        "30 years",
        "Asus",
        "Facebook",
        "two",
        "Tech News",
        "2022",
        "the Tech News",
        "Cadillac",
        "DarkMarket",
        "the last two years",
        "Lucasfilm",
        "Ubisoft",
        "GPU",
        "Cyberpunk 2077",
        "Gelsinger",
        "Airbnb",
        "the Quick Bits",
        "Evleaks",
        "James",
        "years",
        "Apple",
        "today",
        "ZenBean"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "DATE",
        "NORP",
        "GPE",
        "GPE",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "GPE",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT"
    ]
}