{
    "id": "ODZISOUnJVE",
    "title": "The History of the BSOD (Blue Screen of Death) - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-04-02T22:59:15Z",
    "video_url": "https://www.youtube.com/watch?v=ODZISOUnJVE",
    "category": "Science & Technology",
    "tags": [
        "The History of the BSOD (Blue Screen of Death) - Krazy Ken's Tech Talk",
        "The History of the BSOD",
        "The History of the Blue Screen of Death",
        "Blue Screen of Death Explained",
        "Computer Crash",
        "Windows Crash",
        "Windows Blue Screen",
        "Stop Error",
        "Microsoft",
        "PC",
        "Windows NT",
        "Windows XP",
        "Windows Vista",
        "Windows 7",
        "Windows 8",
        "Windows 10",
        "Windows 3.1",
        "Windows 9x",
        "Windows 95",
        "Blue Screen of Death",
        "BSOD",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer",
        "Comedy",
        "Humor",
        "Tech",
        "Funny",
        "Computer Clan"
    ],
    "views": 225260,
    "likes": 7822,
    "comments_count": 1339,
    "description": "The Microsoft Windows Blue Screen of Death is probably the world's most loved (and hated) crash screen. Let's take a look at how it works, how it has changed, and where it shows up in pop culture! More juicy info and stuff below  Find out why computers crash   BSOD T-shirt? Sign me up!   The original video (it's old, but a'ight)    Follow the us on Twitter   Like the us on Facebook    Krazy Ken's Tech Talk - The History of the BSOD (Blue Screen of Death)  Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!*   Special thanks to Luna and Sage for helping me with this video! Sage's Channel    Watch druaga1's channel here!   Archive.org: Microsoft \"Fatal Errors\" Support    Contact Us    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?    Amazon links are powered by the Amazon Associates Program.  *not all Patreon tiers qualify for all rewards  #KrazyKen #ComputerClan",
    "description_links": [
        "https://youtu.be/8Wf_zEjcRvA?t=111",
        "https://teespring.com/BSOD-shirt?pid=2",
        "http://bit.ly/clan2X3GKqz",
        "http://twitter.com/thecomputerclan",
        "http://facebook.com/computerclan",
        "http://Patreon.com/KrazyKen",
        "https://www.youtube.com/channel/UC1YdCbwdttqgFo4mo9kj3Ug",
        "http://bit.ly/clan2N1TAhi",
        "http://bit.ly/clan2w5mn10",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "(bell chimes) - Hey guys, how you all doin'? (Windows chime sounds) (electric music) Okay, let's try that again, hey guys, how are you all doin'? Really, that's just great. You know, I'm doing pretty great, too, because today we're gonna talk about computer crashes, which fascinate a lot of us. I don't know why they're so fascinating, maybe we just like to see stuff break. I don't know. But pretty much everyone has experienced the Windows blue screen at least once in their life, and it's just kinda become pretty famous. Heck, it's even referenced in video games and in TV shows, but we'll look at more of that stuff later. To start, let's take a look at what exactly is a Windows blue screen. Blue screens occur when your device experiences a problem where it's not able to operate further. Usually the purpose of this type of crash is to prevent further damage to the system. It's like if you spring a leak in your utility room, right, what are you gonna do? You're gonna turn off the water to prevent further damage. Now there's many reasons why a computer may crash, and for more info on that, I highly recommend checking out our other video we made about the topic. Moving on, a common blue screen error is IRQL_NOT_LESS_OR_EQUAL. IRQL means interrupt request level. This usual means a program wants to access a part of memory, but the operating system is like, \"No, I need this protected for something else.\". And then everything freaks out. This is usually the result of a driver issue, so just make sure to keep those drivers up to date. Anyway, the name blue screen of death or BSOD, is commonly used among the tech community. The name as you can probably tell is derived from the screen's notable blue color. (quack) Microsoft's formal name for this error is blue screen or stop error. In an earlier documentation this is referred to as a Fatal Exception Error. I have an archive.org link in the description. So go ahead and check that if you want to explore more of the documentation. So now that we have the basics under our belt, let's take a look at how the Windows blue screen changed through the years. Back in the humble beginnings of Windows one point oh. There was a blue screen error. But it wasn't very useful. A lot of times it would look kind of scrabbley. It depends on the situation. But really that's okay because that's the first version, Microsoft will fix that up real soon. In Windows 3.1, the BSOD was formatted and a lot more useful. It gave the user the possibility to recover and it displayed error information, This style evolved slightly throughout the Windows 9x releases, Windows 95, Windows 98 et cetera. These updated blue screens reported fatal exception errors with hexadecimal codes like, 0D. Which was the code for a general protection fault. In this context, a GPF, is condition that isn't covered by any other process or exception. It's basically the miscellaneous of error codes in this context. If you want a future video about GPF's, smash that Lick button below. Make sure all of your friends lick this video now. Along side the Windows 9x systems, which were more consumer oriented, Microsoft was also working on Windows NT, which was targeted more towards pros and business. The Windows NT style blue screen of death provided much more error detail and this was the screen that introduced the stop codes that we talked about earlier. Each code represented a different type of error. In Windows XP the blue screen's design was cleaned up a bit but it also provided basic troubleshooting instructions. This particular design remained the same for 11 years, through Windows 7. Hashtag #LongLiveWindows7 Tweet it out, share the good word. Windows CE had its own blue screen which had a countdown timer with an automatic restart. It's also worth mentioning that there were other Windows systems that had this automatic restart feature, like Windows 2000 and Windows XP. And you could adjust these settings in the Control Panel. The early Windows Eight builds didn't actually have a blue screen. It was a black screen and it showed at least one error code usually. And it had that automatic restart feature. But now we come to the later stage Windows 8 blue screen. The one that was released to the public. And it had the frowny face. Needless to say, this was the most graphical implementation of a Windows blue screen so far. It displayed basic error information and it would restart the PC for you. In Windows 10, the blue screen remained mostly the same but it features a QR code and if you scanned the QR code it brought you to a troubleshooting page for the Windows blue screen errors. Now, if you're bored with the color blue, don't worry you're in luck. Microsoft also has a green screen of death, which has been used for things like the insider previews. And other code name releases like Longhorn. Actually, my buddy Druaga1 experienced this in one of his videos too. - [Druaga1] Hey Longhorn, not bad huh. Hey, I've never seen a green screen of death before. Well that sure was worth it. - A red screen of death has also been found in other Windows systems that were in the beta stages, like Longhorn. I think most techies can agree that it's fun to see a computer crash in a public setting. In fact, there's dedicated social media to this topic. Like Window In Places on Twitter. Basically, the blue screen of death at this point has become a pop culture reference. Let's take a look. Let's face it you know you're error screen is a successful error screen when it gets it's own frickin' entry on Know Your Meme. The blue screen of death shows up in Half Life Two, Portal 2, The Amazing World of Gumball, Miraculous Ladybug, Jimmy Neutron. Heck, even Apple's PC icon in macOS shows a blue screen. And also, let's not forget the Windows 98' demo at COMDEX. - You'll notice that this scanner, Bill ... Whoa (laughs). Moving right along. - That must be why we're not shipping Windows 98 yet. - Absolutely, absolutely. - As for me, I haven't seen a ton of blue screens in public but I did see a giant one at an airport once. And when I was at the Museum of Pop Culture in Seattle, I did see a Windows 9x blue screen in one of their exhibits. So if you have any funny stories about stuff you've witnessed in the public, like a computer crash and stuff like that, let me know in the comments down below. Because I like hearing those stories. And if you have any other suggestions for topics you want to see on Krazy Ken's Tech Talk, let me know about that too. Because I am all ears. I hope you learned something today. Thanks for sticking with me, catch the crazy and pass it on. (upbeat music)",
    "transcript_keywords": [
        "Windows blue screen",
        "blue screen",
        "Windows",
        "screen",
        "Windows blue",
        "blue",
        "blue screen error",
        "error",
        "Windows systems",
        "screen error",
        "error screen",
        "screen of death",
        "death",
        "code",
        "screens",
        "Microsoft",
        "Hey guys",
        "stuff",
        "Longhorn",
        "style blue screen"
    ],
    "transcript_entity_values": [
        "GPF",
        "Windows Eight",
        "IRQL",
        "the years",
        "the Control Panel",
        "Windows",
        "Windows 3.1",
        "Jimmy Neutron",
        "Windows 95",
        "Bill",
        "Windows XP",
        "The Amazing World of Gumball, Miraculous Ladybug",
        "Apple",
        "Lick",
        "Windows CE",
        "Seattle",
        "Windows 7",
        "Half Life Two, Portal 2",
        "today",
        "Krazy Ken's",
        "11 years",
        "Windows 98",
        "at least one",
        "Windows NT",
        "archive.org",
        "first",
        "one",
        "Windows",
        "Microsoft",
        "BSOD",
        "Windows 10",
        "IRQL_NOT_LESS_OR_EQUAL",
        "Windows 8",
        "Tech Talk",
        "the Museum of Pop Culture",
        "COMDEX",
        "macOS",
        "Twitter",
        "Longhorn"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "NORP",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT"
    ]
}