{
    "id": "oe6Fd7maNZg",
    "title": "The $100 Pocket Cinema",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-05-28T21:27:58Z",
    "video_url": "https://www.youtube.com/watch?v=oe6Fd7maNZg",
    "category": "Science & Technology",
    "tags": [
        "projector",
        "pico",
        "pico projector",
        "tiny",
        "small",
        "aaxa",
        "led",
        "unboxtherapy",
        "unbox therapy",
        "tech",
        "technology",
        "review",
        "unboxing",
        "apple",
        "iphone",
        "best",
        "iphone 6s",
        "android",
        "samsung",
        "smartphone",
        "6s",
        "galaxy",
        "new",
        "iphone 6",
        "phone",
        "test",
        "vs",
        "apple iphone",
        "iphone 7",
        "iphone 6s plus",
        "apple iphone 6s",
        "apple inc. (publisher)",
        "s7",
        "gadgets",
        "android (operating system)",
        "s7 edge",
        "smartphone (video game platform)",
        "edge",
        "galaxy s7",
        "google",
        "top",
        "galaxy s7 edge",
        "tablet",
        "crazy",
        "video",
        "wireless",
        "mobile",
        "plus",
        "samsung galaxy s7",
        "gaming"
    ],
    "views": 3289166,
    "likes": 41313,
    "comments_count": 1733,
    "description": "TODAY'S MYSTERY VIDEO -   AAXA LED Pico Projector -   In this video I had the chance to check out my first pico projector. This tiny little pocket projector from Axxa is capable of displaying a 60-inch image.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/YcKBV-ZWbAY?t=2m1s",
        "http://amzn.to/24dNWti",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys, Lew here back with another video, and today I'm bringing you something... \"Petit\". \"Petit de je ne.\" God... Can I- Today I'm bringing you something small. Something small that's not usually small. It's a projector. It's one of the smallest I could find, fits in the palm of your hand, is about the size of a phone. It's around a hundred bucks. It's not super highly specced out when you're talking about lumens and resolution and all that jazz, but it's more of a kind of a little pocketable theater if you will. You're gonna want to use this in a dark environment, I think it's like 25 lumens, 960 by 540, maybe even in your backyard on the fence, you wanna have a little drive-in movie type vibe? Anyway, Pocket Projector from a company called \"AAXA Technologies\". You can see on the side here, you can use it with a number of different devices. You can even hook a game console up to it! For a real party! Even has a speaker in it, which is cool or a headphone jack if you want to take it to the next level. There's a couple ways to interface with this guy, I believe. It features Mini- HDMI. Look how small that is. Or, you can stick an SD card in here with all your media files on it. So here is the little guy. Wow, that's- I've seen some small projectors, but that is... That's about a small as they go. There's the lens on the front there. Jack can probably pick that up. Also a wheel, probably to focus that lens, I'm guessing. This looks like the speaker. Some controls here on the top. Over here we have DC 5 volt in. I suppose to charge this up. It'll do like, a movie's worth of battery life. There's also a USB Out on it I suppose that's for hooking up maybe an external drive or something? On the bottom, a tripod mount. Over here we have our SD card slot, that's microSD, but those are huge now, you can get like 200 gigabytes. You have an AV out, headphone jack, and of course your Mini-HDMI, so USB to charge it up... Makes sense. Uhh... And then they gave you the standard AV. Of course! And look, they did include a mini little tripod, that's sweet. So you can catch the right angle. See, there's even a little clip on it. And look at that, you can- can you catch an angle- Yeah, you can! It's time to test this thing out. Hopefully we have a charge. Little fan in there! Oh, that baby came on, okay, cool. Yeah, the interface, it's pretty basic, but then again... You gotta curb your expectation. This thing is around a hundred bucks, and you're getting a built-in media player, they didn't have to give you that, it could have just been an HDMI In. So if you don't want to use the media functionality, just get yourself an HDMI cable, hook up your console, Apple TV, Roku, Chromecast or whatever; and feed media to it that way. So if what you need is a little movie theater every once in a while, or maybe a more dramatic way to watch Unbox Therapy, this guy will figure it out. It'll hook you up.",
    "transcript_keywords": [
        "Lew here back",
        "Lew",
        "small",
        "Petit",
        "HDMI",
        "today",
        "media",
        "guy",
        "video",
        "jack",
        "bringing",
        "movie",
        "back",
        "charge",
        "hook",
        "AAXA Technologies",
        "Pocket Projector",
        "small projectors",
        "projector",
        "USB"
    ],
    "transcript_entity_values": [
        "Lew",
        "DC 5 volt",
        "AV",
        "Unbox Therapy",
        "Chromecast",
        "SD",
        "USB",
        "200 gigabytes",
        "around a hundred bucks",
        "jack",
        "Jack",
        "Petit de je ne",
        "25 lumens",
        "540",
        "AAXA Technologies",
        "Roku",
        "microSD",
        "960",
        "Mini-HDMI",
        "Apple TV"
    ],
    "transcript_entity_types": [
        "PERSON",
        "LAW",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}