{
    "id": "OE7PPWygl2I",
    "title": "Sony ZV-1 Review: The PERFECT Vlogging Camera is FINALLY here!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-05-26T14:01:00Z",
    "video_url": "https://www.youtube.com/watch?v=OE7PPWygl2I",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "sony zv-1",
        "vlogging camera"
    ],
    "views": 770645,
    "likes": 26965,
    "comments_count": 1715,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Has Sony finally made the perfect vlogging camera? Let's find out. This is the Sony ZV-1. It comes with a microphone wind screen, micro USB cable, battery and the camera (bouncy music) and a flip-out screen. (applause) I have been keeping a checklist for the things that I have been looking for in a vlogging camera and this camera right here checks almost every single one of those boxes. I could not be more excited to show this to you guys today. Normally, these little point and shoot cameras are geared towards photographers. But this is one of the first Sony cameras that I feel they were really thinking about video first, photo second. This screen will also flip the opposite way so you'll be able to protect your screen when it's not in use. It has a 3.5mm jack input for audio, a micro USB port and HDMI out. It uses the NP-BX1 battery. This is used in a lot of the RX-100 series, so if you have some of these batteries you're in luck. (bouncy music) You guys are gonna witness my first vlog that I'm gonna record and what I love already about this is the record button is right here where it should be where you normally would take a photo. There's so many settings we're gonna go through on this camera, but right now I have it on the steady mode which gives me a nice field of view. Another thing that I'm loving so far is it has this little hot shoe mount that has a little-- I call them dead kittens. It's kind-of a terrible thing. That's to help reduce wind noise and this also now has a directional microphone facing forward so that'll help if you are vlogging and filming yourself that the microphone will be able to pick you up and not everything around you. I can't wait to test out all of these features so I guess let's get started. Vlogging backwards, here I go. Vlogging. Steady Shot is off and now let's turn it on. We're now on Steady Shot: Standard. Is is smooth? Is it steady? Stable? Just like me coming out of quarantine. Here's our Active Steady Mode. You can tell it's much more cropped in than the previous two, but is it steadier? I don't know. You be the judge. Well, I'm gonna be the judge because I'm gonna be watching the video and assessing. Feels steady. Wow, Oh my gosh. Product showcase for unboxing and showing products. Watch how quickly it focuses. Oh! Oh, do you wanna see my phone? Look at this. Oh, focused. Holy what! (bouncy music) This is an optional vlogger kit that you can get to go with your camera. It comes with this Bluetooth tripod remote control and an SD card. This will allow you to wirelessly connect to your camera and control it. You can take photos, zoom and start and stop recording. This connects to Bluetooth so there's no cables needed and it connects very easily inside of the settings. I also like this because it is a little, tiny tripod. It will allow you to easily adjust your camera to get the right shot. One of these new settings that I'm really excited to show you guys is called Background Defocus. Now on most cameras, you would just adjust the aperture so that you can get that nice blurred background. But with this, it's a single button that will adjust the aperture automatically to give you this: a nice, blurred out Bokeh background and when I press it again it turns it off. And when I press it again, it turns it back on. And once again, here's what it looks like off and there's Background Defocus on. I can't focus right now because it's so bright. My eyes aren't opening. I think it looks really good. So far, I am incredibly impressed with this camera. (bouncy music) One of the things that a classic iJustine video cannot live without is slo-mo montages. So this does also include slo-mo, but it also has super slo-mo and the high frame rate option. So you can shoot up to 960 frames a second. So slo-mo montage, let's do it. (bouncy music) A storm is coming, but I'm prepared I've been gone for a while, but don't be scared Right now, I don't know if I'll ever arrive Where the grass is green and we're still alive I hope I'll see you on the other side - This camera also has a bunch of different color profiles so you can go into the picture profile settings. There's 10 that are currently programmed into here so I'm gonna go through all of them and show you guys what those look like and show you some color grading options which you can do with that. The first one to test is with no picture profiles on. Of course, the ND filter is on 'cause it is a little bit bright so let's do it. Oh, okay! (bouncy music) As time goes by I'll wake up on a blue cloud As time goes by As time goes by And here they are all lined up next to each other. This is every single option that is built in into the camera. This is no color grading and here is with color grading. I went in individually and adjusted each one to the way that I liked it. This will allow you to have so many more options when you're in post. If you do love color grading, then definitely do experiment with the picture profiles. As time goes by As time goes by (footsteps echoing) (door sliding) Okay, the sun is still out. I'm emerging from my quarantine cave of editing. I was so blown away by PP10 because it's actually shooting at HLG-2020 so it was a different color profile than all the previous ones which were REC 709. So this is giving such a massive, dynamic range that I thought originally, \"Oh no, the footage is all over-exposed.\" But, no no no. We have so much more range in these highlights than any of the other previous clips. I'm really excited to test out some of these color profiles. As you guys saw, I did kind-of line up each and every single one of those. And each one I went and individually graded until I thought it looked good. I'm not the best at color grading. What I do love about color grading is it is an art, so not everyone has the same taste when it comes to what looks good as far as coloring. So to each their own, but this is cool. I don't necessarily mess around with a lot of the picture profile settings because when I'm shooting on a little point-and-shoot camera like this I normally just set everything to auto so that I don't have to think about it and my shot will just look good. But with this, this gives us so many more options. Uh, I'm so excited. (bouncy music) These are Saramonic wireless microphones and what's great about these is you can have the option of getting two transmitters with one receiver. So if my sister and I are outside filming and shooting, we can only have this one little receiver and both of us-- oh my gosh, that's so fast, will have these transmitters on so it'll be able to pick up both of our audio. Let's go back outside and test this out. Ready, Jen? - [Jen] Yeah! - Wow. The focus, it's so amazing. (objects clatter) Start it up (bouncy music) Hey, I'm posting a TicToc. Do you know? - I haven't posted in a couple months. I've been really bad. - Me too, because Animal Crossing has basically taken over my life. - Same. - Right now, we're testing out the Saramonic Blink Microphone System. These are pretty cool. - Kind-of is pretty cool. Very convenient. - So look, we're separating. - Separating. - So you can still hear us both equally. - I'm not separating too far because the dog is an anchor. - [Justine] What is he doing? - [Jenna] Sittin'. - Oh, I gotta put my mask on. I'm not around any other people except Jenna, but mask up. Let's go. Making this video has really made me miss vlogging a lot. - This camera is incredible. - Honestly, it's just everything works. What's your favorite feature? - Well, obviously the screen but also the multi-interface shoe. - There's so many things. I love the product showcase. I love the defocus background. - The batteries are the same as the RX-100 series which is nice. - Yeah. - Same battery. - We're also shooting this right now on the Active Steady Shot so this one crops in a little more but since I'm not actually holding the camera, it doesn't make that much of a difference. But if you are holding the camera, I would say just use the Regular Steady Shot. That way it won't be as cropped in on your face, but it's so super steady. How smooth is this? Smooth. Smooth! Steady! Stable! - Is this a new feature? - Yeah! - Oh, pretty cool. - Oh, smooth and steady. - [Girls] Bored in the house and I'm in the house bored. - No, we're not in the house. Did you this also takes photos too? - Really? - Yeah. - Oh, I guess you do need to take a ton now. (bouncy music) - Oh, it's windy. This is gonna be a nice test of this windshield. Windshield, huh. What do you know? So we are working on our vlog for this camera. Jenna's also filming hers. So while we were riding bikes, Jenna was testing out the stabilization modes on here so I'm gonna steal a very small clip of that demo. Thank you, Jenna. - It was of you anyways, so I'm gonna be using it. (laughing) - It's really crazy, because you have to wear a mask at the beach. You can't actually be laying on the beach, but people are still disobeying and laying on the beach anyway. (bouncy music) This is a test of the skin smoothing feature. It's also windy, so I'm gonna be very interested to see how this works out. So right now, the skin filter is off. Completely off. This is my natural self. Now, let's fix it. This is skin filter setting of low and I took my mask off for this because it's kind-of hard to test a skin smoothing feature with a mask on. This is the medium. How does it look? Do I look like I'm 12 years old now? This is skin smoothing setting high. I look like I just have been brought into the world. I am so fresh faced and new. It's like, \"Hey, mom. \"I'm here.\" Oh my God, wow. Beauty gurus, take notice. Mask up. Let's continue the video. There were a few things that I wish this camera had, but I don't wanna be too greedy because this checks off almost all of the boxes for what I was looking for in a compact vlogging camera. One of the things that I wish it did have was an audio output so I'd be able to monitor the audio. I also wish it would charge via USBC and I also wish I could use a larger Sony hot shoe adapter so that I could use XLR microphones on this. I do understand why that doesn't work because those XLR adapters are using the hot shoe and it's powered by the camera. If this did work with the XLR adapter, I feel like that would kill the battery so quickly so it definitely makes sense as why that doesn't work with this. This camera is so perfect so if those are a few of the minor complaints that I have, I shouldn't even be complaining because this camera is so incredible. (bouncy music) Also while editing, I realized I didn't film an end to this video so here it is: the end to the video. I am in love with this camera. It is really, really amazing and I can not wait to take it out, test it out more on maybe an adventure, maybe not an adventure, maybe I'll just start using this camera to shoot around the house for some of the tech videos that I do. My sister also made a video about this camera and so did Farooq. I will put their video links in the description because I know for a fact that Farooq's video is going to be incredible. All of his camera reviews and phone review videos are always just so far above and beyond what almost anybody else ever tests out. It's super impressive so I'll put both of their links in the description box and with that I'm going to go back into my editing cave and finish editing this video. Even though for you guys, it's over. So I'll see you guys in the next video. Bye! (door squeaking) Yeah, this isn't gonna work at all. (bouncy music)",
    "transcript_keywords": [
        "camera",
        "steady",
        "Steady Shot",
        "video",
        "vlogging camera",
        "color",
        "color grading",
        "Sony",
        "test",
        "Shot",
        "vlogging",
        "Sony cameras",
        "Sony finally made",
        "Sony finally",
        "guys",
        "Active Steady Shot",
        "Active Steady",
        "Background",
        "steady mode",
        "grading"
    ],
    "transcript_entity_values": [
        "NP",
        "second",
        "One",
        "one",
        "Animal Crossing",
        "Sittin",
        "iJustine",
        "960",
        "a couple months",
        "Justine",
        "Farooq",
        "Background Defocus",
        "HLG-2020",
        "Sony",
        "the Saramonic",
        "USBC",
        "a ton",
        "jack",
        "3.5mm",
        "TicToc",
        "Jen",
        "slo-mo",
        "ND",
        "SD",
        "today",
        "two",
        "micro USB",
        "Steady Shot",
        "Saramonic",
        "10",
        "first",
        "USB",
        "12 years old",
        "Jenna",
        "slo-mo montage",
        "XLR",
        "Steady Shot:"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON"
    ]
}