{
    "id": "Ogmqw1y71H4",
    "title": "Bendable OLED TVs - BUT WHY?",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-01-05T02:51:12Z",
    "video_url": "https://www.youtube.com/watch?v=Ogmqw1y71H4",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "LG",
        "bendable OLED TV",
        "CES 2021",
        "bendy",
        "OLED",
        "TV",
        "display",
        "curved",
        "transform",
        "transforming TV"
    ],
    "views": 413371,
    "likes": 26540,
    "comments_count": 1150,
    "description": "Buy the Drop Koss GMR-54X-ISO Gaming headset at   GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   Timestamps: 0:00 Colton is angry 0:09 Qualcomm Snapdragon 480 5G 1:12 Windows 10 will change 2:04 LG Bendable OLED display 2:55 Koss GMR-54X-ISO Gaming Headset 3:32 QUICK BITS 3:39 Cyberpunk 2077 free DLC 4:06 Slack was down 4:29 Alphabet workers union 4:55 Venmo check-cashing feature 5:20 Epic Games buys mall for HQ  NEWS SOURCES  5G THAT WONT COST A G     WINDOW TREATMENTS     SURPRISE, ANOTHER LG FLEXIBLE DISPLAY     PLEASE DONT RUSH THIS OUT    SLACKING OFF    ALPHABET WORKERS UNIONIZE    PAY US TO PAY YOU VENMO    AN EPIC DEAL   ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://dro.ps/tl-gmr-jan21",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://www.engadget.com/qualcomm-snapdragon-480-5g-143023744.html",
        "https://www.anandtech.com/show/16345/qualcomm-announces-snapdragon-480-first-5g-lowend-soc",
        "https://www.xda-developers.com/qualcomm-snapdragon-480-cheap-5g-phones-2021/",
        "https://www.kitguru.net/gaming/operating-systems/matthew-wilson/microsoft-preparing-big-ui-changes-for-windows-10-in-2021/",
        "https://arstechnica.com/gadgets/2021/01/microsoft-hints-at-coming-sweeping-visual-rejuvenation-of-windows-10/",
        "https://www.extremetech.com/computing/318789-report-microsoft-plans-sweeping-visual-rejuvenation-of-windows-10",
        "https://www.flatpanelshd.com/news.php?subaction=showfull",
        "https://www.pcgamer.com/lg-to-showcase-worlds-first-convertible-bendable-gaming-monitors-at-ces-2021/",
        "https://www.techrepublic.com/article/lg-display-your-next-gaming-monitor-could-have-a-48-inch-bendable-oled-screen-that-produces-sound-without-speakers/",
        "https://www.gamesradar.com/uk/expect-free-cyberpunk-2077-dlc-in-early-2021/",
        "https://www.tomsguide.com/news/cyberpunk-2077-getting-free-dlc-in-early-2021-what-you-need-to-know",
        "https://www.theguardian.com/technology/2021/jan/04/slack-messaging-service-suffers-global-outage",
        "https://mashable.com/article/slack-down-january-4-2021/",
        "https://www.cnet.com/news/google-alphabet-employees-to-form-union/",
        "https://www.bloomberg.com/news/articles/2021-01-04/google-workers-launch-union-escalating-tension-with-management",
        "https://finance.yahoo.com/news/venmo-adds-check-cashing-feature-151018819.html",
        "https://seekingalpha.com/news/3648349-paypal-venmo-adds-check-cashing-government-sends-out-stimulus-checks",
        "https://www.bizjournals.com/triangle/news/2021/01/03/epic-games-buys-cary-towne-center-for-headquarters.html",
        "https://www.wral.com/epic-games-announces-new-headquarters-at-cary-towne-center-site/19455534/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Riley, I swear, if you don't get me my tech news right now I'm gonna explode! (explosion) - [Riley] Oh, where can I get that pillow? - (laughs) lttstore.com. Qualcomm is rolling out a new system on a chip in order to get 5G into more devices. The budget oriented Snapdragon 480 is due out this year and will support both the millimeter wave and sub-6 GHz flavors of 5G, which is unquestionably awesome. But I love asking questions, so here's one. How will the chip perform outside of its fancy cellular capabilities? 400-series Qualcomm chips have been notoriously slow in the past, making phone space on them feel a lot less responsive than the higher end 800-series lineup. However, Qualcomm has switched to an eight nanometer process for the new chips, which Qualcomm claims makes the 480 twice as snappy of a dragon as the existing Snapdragon 460. - [Riley] Is that possible? - Snap your dragons! - [Riley] Dragons are already-- - We don't have an exact date as to when you can get one of these phones in your hot little hands, but look for an announcement in the first quarter of this year if you're looking to blow that $600 stimulus real fast. - [Riley] Woo! - That's what it's for, right? - [Riley] Yeah, going to the gambling club. (laughs) What's that called? - The casino? - [Riley] Yeah! - (laughs) What? Although Windows 10 has gotten a lot of big updates since its release in 2015, it looks like some very major changes may be coming later this year. Rumors have already been flying about a Windows design for a few months now. Microsoft has seemed to confirm this through posting a job listing for software engineers who will \"deliver a sweeping visual rejuvenation \"of Windows experiences and will signal \"that Windows is back.\" - [Riley] Yeah, woo! - Woo! Yeah, in all capital letters. Wait, where did Windows go? Did we all start using Linux Mint and no one told me about it? - [Riley] We did, sorry, sorry Colton. - Missed the memo. - [Riley] The whole office. - Anyway, we're probably gonna get updates for everything from UI elements, like buttons and sliders, to more fluid animations and a revamped tablet mode. There'll be an explosion animation when you close Windows. That's what we've been missing! (explosion noise) Hopefully we'll see this before year's end because I'm already about as excited as a human can be I think-- - [Riley] I believe you. - Thank you. LG has given us a sneak peak at its bendable OLED gaming display. It plans to show off at CES next week. Oh, I see, so you can fit it in your pocket. - [Riley] Yeah. - No, the display can convert between a flat mode for watching video or doing normal, boring computer stuff and a curved mode for high-immersion gaming. - [Riley] Woah, are we in it right now? - We're in it, dude. It also has a film exciter, which means the entire display can double as a speaker. Awesome, I'm just gonna go throw out my sound system as soon as we're finished filming. It's an interesting choice to make the panel OLED despite the risks of panel burn-in that become more popular for rich people, in large part thanks to wide support for variable refresh rate tech and 4K 120Hz on new models. We're not sure if and when we'll see this bendy display on the market, but with folding phones becoming more of a thing, hopefully it won't be too long, as I for one would love to have a screen that flaps like a bird. Now it's time for the Quick bits. - [Riley] Yes! - Today's Quick bits are brought to you by the Koss GMR-54X-ISO Gaming Headset, a collaboration with Drop. It's based on the popular Koss headset and audio file approved. It has custom-engineered acoustics for immersive 3D sound and positional cues so you can hear where the bad guys are coming from while you're gaming. - [Riley] Watch out! - If you're wearing them for a long time, there's reduced tension in the lightweight headband for extended comfort as well. You get a cord splitter, an inline mic with a remote, and a detachable boom mic that works with PlayStation, Xbox, Switch and more with no hassle. Buy it today at the link down below. Yes, Quick bits give me life! (laughs) The Quick bits give me life, ya know, they're so fun. Although the dev team at CD Projekt Red has had to sink a lot of time into patching the notoriously buggy Cyberpunk 2077, their free DLC is still on track, as they've announced gamers should be getting the new content sometime early this year. I hope that new content includes pants zippers that actually work. - [Riley] Is that a reference to something? - That is definitely a thing in the game. You could sometimes just see your stuff floating about or you'd be bald, like in mirrors. - [Riley] That's a feature. - Ah, I don't know about that. Many of us have had to deal with unpleasant surprises when we go back to work after the holidays. And this was definitely the case for Slack users, as there's been a major outage today that's still ongoing at the time this video was written. They haven't said how long it'll take to fix the issue, so maybe this is a good excuse for you to take a cue from the app's name and, you know, slack. - [Riley] Slack off. - That's a good joke. - [Riley] Go home. - Google's parent company Alphabet woke up this morning to the news that its workers are forming their very own union. The development comes after years of employee discontent with Alphabet's handling of sexual harassment cases and politically controversial moves. It's the most high profile unionization among tech workers ever. So watch out Jeff Bezos, the revolution may have begun. I want to install a passenger compartment in your rockets there, bud. - [Riley] He'll be all right. - Does your bank still not let you deposit checks by taking a photo with your phone? Now, call this number. Venmo is trying to fill that gap as it's rolling out a camera-based check cashing feature. Unfortunately, there will be fees attached, either 1 or 5% depending on what kind of check it is, with Venmo getting a minimum cut of the five bucks. Hm, maybe I'll just have Linus pay me in cash and hide it inside my mattress. - [Riley] That's where I have all my money. - My grandpa literally used to do that. And in case you forgot how much money Fortnite has made for Epic Games, Epic has announced it will be taking over an entire shopping mall, holy crap! - [Riley] For Battle Royale? - (laughs) IRL! The developer is buying a struggling mall near its current headquarters outside of Raleigh and intends to convert it into a new home-base by 2024. The mall was actually gonna be turned into an IKEA a couple of years ago before that plan was scrapped, meaning we're getting more DLC instead of more indecipherable furniture assembly diagrams. - [Riley] I want both. - In the same thing? - [Riley] Yep. - IKEA-Fortnite collab. Let's do it! - [Riley] IKEA drop. - That's our show for today, come back on Wednesday for even more tech news in Swedish. - [Riley] Nope. - We're just kidding, we're just kidding. - [Riley] That's not... I don't know why he said that. - Swedish. - [Riley] In Swedish, do you love the Swedish tech news? - I do, that's great, wow.",
    "transcript_keywords": [
        "Windows",
        "Quick bits",
        "Qualcomm",
        "Yeah",
        "year",
        "Quick",
        "Quick bits give",
        "tech",
        "Swedish",
        "Qualcomm chips",
        "gaming",
        "bits",
        "display",
        "Today Quick bits",
        "time",
        "Today",
        "Snapdragon",
        "Woo",
        "OLED gaming display",
        "Slack"
    ],
    "transcript_entity_values": [
        "CES",
        "five bucks",
        "Battle Royale",
        "Raleigh",
        "Jeff Bezos",
        "Windows",
        "Venmo",
        "Qualcomm",
        "millimeter",
        "2024",
        "next week",
        "a few months",
        "4",
        "one",
        "Koss GMR-54X-",
        "sub-6 GHz",
        "Drop",
        "Switch",
        "Slack",
        "Google",
        "later this year",
        "this year",
        "eight nanometer",
        "Projekt Red",
        "Windows",
        "Snapdragon 460",
        "the first quarter of this year",
        "early this year",
        "Colton",
        "Riley] Watch",
        "today",
        "2077",
        "ISO Gaming Headset",
        "2015",
        "Windows",
        "Microsoft",
        "Quick",
        "IRL",
        "LG",
        "Riley] Slack",
        "Alphabet",
        "1",
        "IKEA",
        "Windows 10",
        "Wednesday",
        "5%",
        "400",
        "Swedish",
        "600",
        "Fortnite",
        "Epic Games",
        "this morning",
        "Linus",
        "a couple of years ago",
        "Xbox",
        "Linux Mint",
        "Koss",
        "Epic",
        "years",
        "PlayStation",
        "480",
        "5",
        "UI"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "ORG",
        "GPE",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "FAC",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "NORP",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "NORP",
        "MONEY",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ]
}