{
    "id": "Oh0vyDBxnVg",
    "title": "Red Magic 3 Durability Test! - a FAN *inside* a Phone?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-06-01T12:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=Oh0vyDBxnVg",
    "category": "Howto & Style",
    "tags": [
        "Nubia Red Magic 3",
        "Red magic 3",
        "Durability test",
        "Fan phone",
        "Nubia",
        "Red magic 3 unboxing",
        "Review",
        "Smartphone",
        "Gaming phone",
        "Gamaing smartphone",
        "Red magic 3 bend test",
        "red magic",
        "video games",
        "pub g",
        "fortnight",
        "best gaming smartphone",
        "tech",
        "razer phone",
        "ROG",
        "Internal fan"
    ],
    "views": 1674832,
    "likes": 54236,
    "comments_count": 4783,
    "description": "Lets Durability test the Red Magic 3!! Install Raid for Free IOS:  ANDROID:  Start with 50K silver and join the Special Launch Tournament for a chance to win prizes. Thanks to Raid Shadow Legends for sponsoring this video! The Nubia Red Magic 3 is probably has the highest specs for the least amount of money this year. 90hz display, Huge 5,000mah battery, internal cooling fan, side gaming triggers. All for less than 500 dollars. Its amazing everything that comes included in the Red Magic 3. But is it durable? In todays video we are going to durability test the Red Magic 3 and see if it can stand up to the rigors of extreme gaming. Is the Red magic 3 scratch resistant? What is the red magic 3 made from? Does the built in fan and active cooling make the Red Magic 3 weak?   Check out the current pricing of the Red Magic 3 Here:   Red Magic 3 Teardown:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://clik.cc/NnfcD",
        "https://clik.cc/GVeik",
        "https://redmagic.gg/products/red-magic-3",
        "https://youtu.be/JiS24PRIq-A",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "A very interesting new gaming smartphone just came out called the Nubia Red Magic 3. It has some pretty fantastic specs and an internal cooling fan, like something you'd see on a gaming laptop or desktop computer. Plus it can film in 8K, all for less than $500. But then there's always that question: are cheap phones durable? Today we'll find out. This gaming smartphone durability test video is sponsored by RAID: Shadow Legends. If you remember, they sponsored one of my other gaming phone durability tests, and right now RAID has a special global tournament going on. You can compete with millions of other players in a massive arena tournament for in-game prizes, as well as prizes that get delivered to your house. RAID is a brand new, free-to-play mobile RPG game with detailed 3D graphics and giant boss fights. This dragon is crazy intense and there are hundreds of champions to collect and customize. I'll put a link for RAID: Shadow Legends in the description of this video, and only through that link can you get an additional 50,000 silver and a free epic champion, and you can join in on that launch tournament right away. I'm personally not a big gamer, but they've put a lot of work into this one. Huge thanks to RAID: Shadow Legends for sponsoring this video. Now it's time to check out the Nubia Red Magic 3 and see if that internal cooling fan has any affect on durability. Let's get started. [Intro] It seems like gaming phones are getting more and more popular these days. Probably because the high end specs and unique designs make them stand out in this world of normal boring smartphones that appeal to the masses. This Nubia Red Magic 3 is anything but normal. Inside the box we get our standard charging cable, wall plug and information booklet. But check out this body, with it's long customizeable LED light bar in the center. The lights don't show up very well here on my brightly lit desktop, but you get the idea. The reason this Red Magic 3 caught my eye though...or should I say ear...is the cooling fan inside the phone. This is the first smartphone with an active cooling system built directly into the phone. Normal phones would just toss in a copper heat pipe and call it a day, but Nubia says this turbo fan can decrease the processor temperature by 16 degrees. I'm pretty blown away. There's a side vent that allows the ejected air to flow out of the phone, but this thing is crazy. Obviously water protection goes down the drain, but it'll be super interesting to see this fan from the inside during the teardown. Let's start with the scratch test. Gotta love it when companies include free screen protectors. The Red Magic 3 has a 90 Hertz screen refresh rate, which is great for gaming phones. We saw the same thing on the OnePlus 7 Pro, but this phone is almost $200 cheaper. With our Mohs scale of hardness scratch test, we see the industry standard scratches at a level 6, with deeper grooves at a level 7. Glass is pretty scratch resistant when compared to plastic screens, but a screen protector is always still a good idea, especially if scratches bother you. This might come as a surprise, but scratches don't really bother me. The Red Magic 3 does have dual front firing stereo speakers, which is also nice for gaming. Front firing speakers are just about great for everything actually since your face and ears are usually pointed at the screen. The speaker grills are made from plastic and are permanently attached to the phone. The selfie camera is 16 megapixels and also protected under that same front glass layer. The sides of the phone are made from metal, along with the gray power button and gray metal volume rocker. There are 2 plastic top triggers built into the frame also used for gaming. Hopefully these plastic indentions in the metal frame won't cause any structural issues later on. We'll find out. Check this out...a gaming phone with a headphone jack. I'm liking this thing more and more. It's almost like if you want a headphone jack these days on your cellphone, you just gotta go spend less money, which isn't a bad thing at all. Over here on the left side of the phone, we get more metal sides, and some circular metal pins that probably work as a gaming port for accessories. The red switch up here at the top is a dedicated gaming switch. This allows the fan to turn on and can block texts and calls if you want as well. It's made from metal. Down here at the bottom of the phone we get our standard USB-C port and 2 screws that hold the whole thing together. The bottom forward firing stereo speaker grill is down here as well, covered in plastic. I know I've mentioned quite a few cool things about this phone, but for me, one of the coolest is the ability for this 48 megapixel glass covered camera to film in 8K resolution. Seeing that technology come to mobile smartphones for the first time is fantastic. Granted, it is a beta and still in it's infancy, but this short little video I filmed is indeed 7680 x 4320 pixels in resolution. It's also kind of only filming in 15 frames per second, but it's cool to see it happening, especially now that 8K TVs are starting to come out. The elongated hexagon above the LED light bar is a rear facing fingerprint scanner. It is scratchable, but does still maintain it's function with the inflicted damage and unlocks the phone every time. Getting a close up look at the cooling fan intake grill. It appears to be a metal mesh screen, but I'll have to check it out from the inside of the phone if it survives the rest of this durability test. Each of the red corner accents are made from metal. There's also a single hexaonally shaped plastic LED flash. The unique part of this phone is that the 4 sides, top, bottom, left, and right, slope down away from the center ridge. Each quadrant is made from the aluminum metal that we've been seeing everywhere else on this phone. That center LED peak is covered with plastic. Now, as you very well know, I'm one of the world leaders in razor blade cellphone art. It is a tough industry, you know, with like lots of competition. And people everywhere are always asking me, 'Hey Jerry, how are you going to stay on top? How are you going to take your art to the next level?' And I always say the same thing, it's the 3 P's of success: practice, persistence, and practice. I thought it was only fitting that since this phone is called the Red Magic 3, that we draw a magic genie on the back. And I think maybe my genie spent a bit too much time in the lamp. I also hear it's like super hot in Agrabah, which brings us to the burn test. Not every phone would be able to survive in the Cave of Wonders. After about 20 seconds, the 1080p AMOLED display starts to turn white and pulse, which I haven't seen before. It does leave a permanent white mark in the middle of the screen, but everything is still working just fine. The real question though is will everything still be working just fine after the bend test? Gaming phones live a much rougher life, I imagine, than your average smartphone. And with the first flex of the Red Magic 3, I hear a loud pop, which is actually the screen popping out from the metal phone frame. But everything is still working. When I bend from the front, there is no flex at all to the phone, but rotating it around again to the back side, we hear another pop. The screen and the housing separate again. Probably because there is no water resistance or adhesive holding the display to the body, just those two screws down at the bottom. But it is still alive. The Nubia Red Magic 3 survives my durability test. And honestly, for the money, it's a steal. It's hard to justify spending $1000 on brand name flagships when some $500 phones are getting everything right. Let me know down in the comments what phone you want to see tested next. Genie and the internal fan say to hit that subscribe button if you haven't already. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Nubia Red Magic",
        "Red Magic",
        "phone",
        "Nubia Red",
        "Red",
        "Magic",
        "gaming",
        "gaming phones",
        "Shadow Legends",
        "metal",
        "phones",
        "RAID",
        "fan",
        "Nubia",
        "screen",
        "gaming phone durability",
        "cooling fan",
        "test",
        "plastic",
        "thing"
    ],
    "transcript_entity_values": [
        "4320",
        "Genie",
        "genie",
        "an additional 50,000",
        "the Nubia Red Magic 3",
        "8",
        "15",
        "Instagram",
        "two",
        "This Nubia Red Magic 3",
        "The Nubia Red Magic 3",
        "Glass",
        "jack",
        "Jerry",
        "almost $200",
        "6",
        "about 20 seconds",
        "Agrabah",
        "RPG",
        "16 degrees",
        "4",
        "hundreds",
        "7680",
        "the OnePlus 7 Pro",
        "less than $500",
        "Hertz",
        "90",
        "some $500",
        "the Cave of Wonders",
        "millions",
        "1000",
        "first",
        "second",
        "these days",
        "Today",
        "16 megapixels",
        "3",
        "48 megapixel",
        "Red Magic 3",
        "one",
        "Twitter",
        "Nubia",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "MONEY",
        "DATE",
        "TIME",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "LAW",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL"
    ]
}