{
    "id": "oHFPSuXEbAI",
    "title": "Mystery Unboxing From Intel",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-07-18T15:58:59Z",
    "video_url": "https://www.youtube.com/watch?v=oHFPSuXEbAI",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "intel",
        "conflict free",
        "intel conflict free",
        "computer",
        "pc",
        "processor",
        "help",
        "charity",
        "conflict",
        "free",
        "hp",
        "hp laptop",
        "laptop",
        "gaming laptop",
        "gaming pc",
        "ram",
        "hard drive",
        "graphics card",
        "gpu",
        "cpu",
        "intel cpu",
        "intel core",
        "xeon",
        "hdd",
        "storage",
        "i5",
        "i7",
        "intel i7",
        "intel i5",
        "intel core i5",
        "hp spectre",
        "980",
        "intel core i3",
        "gaming",
        "intel corporation (business operation)",
        "laptop (product category)"
    ],
    "views": 3901033,
    "likes": 98338,
    "comments_count": 4552,
    "description": "This video was sponsored by Intel. Learn more about conflict free at -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://intel.com/conflictfree",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Mysterious What's up guys! Lew here, back with another video Today's video is alot different than usual though I have no idea what's inside this box This thing has been hand-delivered, by the folks at Intel What have they told me? Almost nothing! They said it's a box The anticipation it's elevated My heart rate, I've got Dave on the camera today, shoutout to Dave What do I? Do we... Is this some sort of joke right now? Oh my! What? Hey Lewis, do you know where the materials used to make your devices come from? Sand!? *Laughs* What is... Wow! There are minerals in almost every piece of technology you own Oh, I think we're going deep today Tantalum Am I looking at the real... Stuff right now? The real mineral? How do you think these four minerals ended up in your device? I eh... Someone had... Gold! Legit gold! Pick that up Dave, right there Tungsten Tin I didn't even know Tin looked like that You got that? Woah! Some of these minerals came from mines in the Congo- where innocent people are being threatened by warlords That's true You get this nice, shiny, fancy device- you feel all special, but it's true you don't really think about, all the stuff that goes into it- and where it comes from Now this, this feels more familiar Hmm... How can I help? *tribal music* Wow We just figured out the CF it's conflict free It's a movement here, to know more about where the materials that go into the gadgets you love- are coming from And to make sure that you're not sort of upholding these warlords- and enabling them to oppress individuals in the process of you enjoying your- phone, laptop, tablet or otherwise Our demand for this is having an affecting impact outside the realm of the space that you're living in And if anybody would know it would be me, and now I'm starting to understand why Intel brought this year Okay I've been told there's one more thing in the box You could be certain that my mining experience here personally- has been completely conflict free, right? Oh,oh... Okay I did miss something Look for \"CF\" when you buy a device Ooh... We're proud to say that Intel processors are now Conflict Free Tin, Often uses replacement for Lead in printed circuit-boards and processors- and used to solder pieces together within devices Gold, pins and processors are often made out of Gold because it's conductive but non-corrosive Tantalum, the key ingredient in Tantalum capacitors which can be used in devices that require- high performance in a small amount of space Like laptops And Tungsten, my favorite of them all Because of it's chemical properties it's used to conduct electricity in integrated circuits and metallic films Check it out Your favorite little chip And now you don't have to feel guilty about it Look for the badge, \"Conflict Free\" and be proud of your gadgets where they came from",
    "transcript_keywords": [
        "conflict free",
        "video Today video",
        "conflict",
        "free",
        "Gold",
        "Today",
        "Conflict Free Tin",
        "Dave",
        "Tantalum",
        "Intel",
        "Tin",
        "video Today",
        "Today video",
        "box",
        "today Tantalum",
        "deep today Tantalum",
        "video",
        "devices",
        "device",
        "minerals"
    ],
    "transcript_entity_values": [
        "Gold",
        "Dave",
        "Intel",
        "Lew",
        "today",
        "this year",
        "Lewis",
        "four",
        "Pick",
        "Tantalum Am",
        "Today",
        "Tungsten Tin",
        "Tantalum",
        "one",
        "Conflict Free"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "EVENT",
        "WORK_OF_ART",
        "DATE",
        "WORK_OF_ART",
        "GPE",
        "CARDINAL",
        "WORK_OF_ART"
    ]
}