{
    "id": "oi8vHwEsqf0",
    "title": "TV Antenna Scams Are Flooding the Market! (Why?) - Krazy Ken’s Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2024-04-23T17:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=oi8vHwEsqf0",
    "category": "Science & Technology",
    "tags": [
        "TV Antenna Scams Are Flooding the Market! (Why?) - Krazy Ken’s Tech Talk",
        "TV Antenna",
        "Radio Waves",
        "TV Antenna Scams",
        "Amazon",
        "Internet",
        "Web",
        "Television",
        "Broadcast",
        "Chicago",
        "Transmitter",
        "Tropospheric Ducting",
        "Electromagnetic Spectrum",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Comedy",
        "Humor",
        "Tech",
        "Funny",
        "Computer Clan"
    ],
    "views": 576853,
    "likes": 16805,
    "comments_count": 2099,
    "description": "Check Out Laifen Wave  Official Website:  Amazon:   You can support this channel on Patreon! Link below  The internet is FLOODED with TV antenna scams. Today, let's analyze the fake claims, test the products for real, and discuss why this scam is happening in the first place  Watch my TVFix episode!   Watch my $100 laptop episode   Watch more SCAM-BUSTERS   Get My Free Wallpapers!    Follow me on Twitter   Facebook   Shop for cool stuff on my store    Support the Computer Clan on Patreon   Patrons got early ad-free access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.  Special thanks to Brainiac Brent for taking the lead on this investigation and helping make the episode possible! And big thanks to my amazing Feedback Team!  Extra thanks to radio folks who helped with the script: Damian Garcia (@kalimamed41) Addie Chernow Matt (Ryoohk) Tyler Letlebo  Learn more about ducting   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear I use   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program and the Computer Clan may receive a commission. Artlist and Artgrid links are also affiliate links.  00:00 Introduction 00:55 Scam Antennas (Overview) 04:02 Scam Antennas (Breakdown) 10:25 Building a Test Course 12:38 Antenna Test (Round 1) 15:03 How Radio Waves Work 17:09 Antenna Test (Round 2) 18:37 Why is This Scam Happening?  #KrazyKen #ComputerClan #Laifen",
    "description_links": [
        "https://bit.ly/4aLmP2B",
        "https://amzn.to/3UqRaxL",
        "https://youtu.be/Qxa9EJSlVSc",
        "https://youtu.be/zZ7qkZkp57c",
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1riKzQK3dHt6c9_6D2lVwr78",
        "https://thecomputerclan.com/wallpapers",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/duct",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- This TV antenna claims it can pick up stations 1,900 miles away, and there's tons of similar scamtenna products flooding Amazon. Clearly, these scammers never took a physics class because if they did, they would know this is impossible. So let's dissect the scam and break it down. (techno music) Hey, everyone, how are you all doing? If you're new here, welcome. My name is Krazy Ken. And one of my most successful scam buster episodes was about the TVfix. But that product dealt with lots of magical fairy dust to help you get free TV. These antennas, on the other hand, are more legitimate and they are made for over the air, digital television. - Television, television. - But they are festering with false advertising and misleading claims. So to debunk this garbage, I went ahead and bought not one but two scam antenna products. And we'll start with the AN3026-994R. Catchy name. This antenna's listing is 880 plus miles range for TV antenna. Newest digital TV antenna for indoor outdoor. TV antenna for smart TV/older TV. Support 8K, 4K. Okay, you know what? We'll just call you Scamtenna 1 from Bzoxauy. What the (duck quacks) kind of name is that? There. Looks great. Ship it. Anyway, Scamtenna 1 claims you can get free local channels. Say goodbye to the bill. It also claims it can reach up to 880 miles and support 8K resolution. And it has built-in powerful sheet. And this long range lets you communicate with lighthouses? Not sure what they're trying to say here. And you can access a selection of 500,000-plus movies in various channels including CNN and Tru TV. And this antenna is so advanced that outdoor conditions will not affect the signal, but don't use your hair dryer near it. That might affect the reception. It also claims it can receive channels in any direction. So it's saying that it's a 360-degree omnidirectional antenna. Yeah, I'm starting to see some of the problems with this and maybe some of you are too, but I wonder if they have a video. Oh, they do. The video reiterates on the claims, but it shows people enjoying their fabulous new TV experience with a floating antenna apparently. Then the video shows even more channels you can receive with this antenna, and they claim it has 520 miles of reception, which is inconsistent with the Amazon description. Nice job. Then it shows the parts included in the box, gives examples of where you can install it< and ends with a Bzoxauy logo. I don't know how the it's pronounced. Hmm, someone had fun with an After Effects template. Before I break down this shady product, let's take a look at the much more insane Scamtenna number two. Model SW218-HD005. This antenna claims to have an over 1,900-mile range, or is it 1,800? 1,600? Well, whichever it is, you can still communicate with your lighthouse. What is it with scam antennas and lighthouses? You can enjoy resolutions up to 4K or is it 1080p? I don't know anymore. The claims are really inconsistent. Oh, but don't worry, you can get free channels like CNN and Nickelodeon. Uh-huh. Sure... Anyway, what I find interesting is that scam ten two is way chunkier and three times more expensive compared to Scamtenna 1. Yet this thing can't get 8K, but this can? Pathetic. I bet they spent the whole budget on the 1,900-mile range. And this claim I didn't see on the listing, but it's actually on the box. It says it can receive a signal in any direction, 360 degrees just like Scamtenna 1. Now why don't I believe you? So these are the two scamtennas I purchased and Detective Brainiac Brent and I are going to test them to see how well they live up to the claims. But before that, let's break down the claims and actually talk about the problems. We'll start with the positives. Scamtenna 1 claims you can get free local channels and say goodbye to the bill. And this is completely fine. Many stations broadcast over the air, so as long as you have an antenna and a tuner, the tuner is likely already built into your TV. You can receive those channels for free, but that's where the good news ends. Pretty much every subsequent claim is bogus. The glaring problem with Scamtenna is the range. 880 plus miles is impossible for a digital over-the-air TV antenna. If you ever see a TV antenna advertising a high number range, avoid it. It is not real. Real TV antennas have a range of about 40 to 80 miles. Different products will yield different results, and the science behind this limitation is quite intriguing and we'll get to that in a moment. The second problem is the 8K claim. I can't find a way to test this claim properly because eight K is far from mainstream in terms of TV broadcasting. Many stations don't even broadcast in 4K, let alone 8K. The cost is just too crazy expensive for the bandwidth and the equipment and the juice is just not worth the squeeze, yet. Another fake feature is the 500,000 plus movies claims. This isn't an over the top streaming service where you have instant access to a huge library of content like Netflix or Hulu. It's over-the-air digital TV. So your selection is dictated by the channels you can receive in your area and the programming schedule. I suppose you could theoretically get 500,000 movies if you have a DVR with a giant hard drive and you have a lot of patience to record everything. But aside from that incredibly unlikely scenario, this claim is impossible. Another huge problem is the channels they claim you can get. The scammers say you can get HBO, ESPN, Disney FX, CNN, etc. but this is simply not true. In the real world, not every channel is available over the air. Many require a cable subscription. Some examples they advertise aren't even channels, they're production studios. And only a fraction of these channels are accessible with this antenna like ABC and NBC. And my last beef with this antenna are the weather claims. Antennas aren't magically immune to weather. Some antennas may fare better than others, but weather will always play a factor in reception. For example, clouds and rain will refract, reflect, and scatter radio waves because much like how moisture affects light in the visible spectrum like what we see when we look at the weather outside, moisture affects radio waves in a similar manner. Another example, if a warm air mass intersects cold air, a temperature inversion occurs, the colder air is now trapped below this layer of warmer air creating a type of barrier, if you will. This creates a duct in the form of either a surface duct or an elevated duct. This is usually referred to as a tropospheric duct because it occurs in the layer of the atmosphere closest to the earth's surface named the troposphere. In this duct, radio waves will refract and reflect which carries them greater distances and they may travel hundreds of miles further than originally intended. These waves may intersect other waves of the same frequency in other regions and cause interference. And regarding the 360-degree claim, this intent is design is not indicative of such a feature. I'll describe that in greater detail when we talk about this chunky square thing and just some general scam avoiding advice, if you're looking at a product and the specs they're advertising are inconsistent, run away. In this listing, the specs claim 880 plus miles of range, but it also says 850 and 820. More inconsistencies equals more red flags. Now let's break down Scamtenna 2. Scamtenna 2 has a big monolith type shape because the larger surface area increases perception. In fact, it is much larger than Scamtenna 1. And again, the big issue is the range. This thing claims 1,900 miles, 880 was already absurd, but 1900? It just can't happen. And that brings us to the 360 degree claim. There are antennas which are built to receive a signal from every direction. These are omnidirectional antennas, but their designs are generally more circular or disc-shaped. This giant monolith looking thing doesn't fit that criteria. So I have a problem with that claim, but we'll give it a fair shot and test it and see if it works. And I just gotta say, I absolutely hate this 4K versus 1080p comparison on the listing. The quality difference is not this drastic in real life. For what it's worth here, is a real comparison between 4K and 1080p. There's a noticeable quality difference, but it's not that intense. So here we are, two scamtennas. I made some pretty solid arguments against the BS claims, but nothing is better than actually trying them out for real. But first, I should address something that affects your health. In fact, it affects everyone's health around the world. And to tell you all about our generous sponsor, Laifen, here is a fake British guy. - [Jony] At Laifen, we always thought industrial design should apply to the things you use every day. And while our design is radically new, face it, it's the most attractive toothbrush you've ever seen. Our goal was to keep it instantly familiar and we achieved this goal with the Laifen Wave. - Thank you fake British person who is definitely not me. I'll talk more about the Laifen features in a moment, but I just wanna talk about the design for a while. Just look at that. I love how pretty it is. I love how it's inspired by Apple all the way down to the fricking packaging. Heck, it even has motion activated lights with pulsating rhythms. It's just a really attractive toothbrush. I never thought that'd be a sentence that came outta my mouth. Wave's proprietary servo system helps clean deeply without hurting your gums. And it's driven by a 6.1-watt motor compared to two watts and many other toothbrush motors. And the bristles oscillate 60 degrees. Much more than 13 to 18 degrees like you get on other brushes. And the brush vibrates 66,000 times per minute, which is about double what you get on other brushes. And the icing on the cake, magnetic charging. So go ahead and check the links in the description to get your own Laifen Wave. And another cool feature, replacement heads are only $9.99 for a 3-pack. So go ahead and click the link in the description to get your own Laifen Wave. And when you do that, you're also supporting the Computer Clan. So thank you very much. All right, let's get up to the surface and test these antennas. (rock music) Miami. Chicago. It's the showdown everyone's been waiting for. Well, not really because they're just finding out about it now. Krazy Ken and Brainiac Brent are going to build a test course and pit two scam antenna products against each other. To do this, I set us up in a room in downtown Chicago surrounded by plenty of transmitters and TV channels to choose from. And of course, deep dish pizza and Chicago hotdogs. Oh, how did this picture get in there? (laughs) Okay, let's just pretend we never saw that. Oh God. So here's the plan. We'll select a TV station as a test target, then we'll test an 80-mile control antenna and the two scamtennas. We selected WTVK and they have two DTS sites. One in Ottawa, Illinois, about 79.2 miles away from our test site and one in Chicago on the John Hancock Center about 1.9 miles away. Our antennas will pick up the Hancock location because it's much closer. To test the 360 degree claim, we pointed the two scam antennas and the control in the opposite direction of Hancock. Each antenna was tested separately, and this is where we ran into some issues because Brent and I were trying to use our iPhone compasses to position the antennas in a particular direction, but for some reason, they kept spazzing out. - [Brent] My compass is backwards now. - Yeah, mine's now like all backwards too, but I think it was 186 in the notes. I didn't know this at the time, but apparently the Congress Plaza Hotel, which is where we were conducting these tests, is haunted. I don't believe in that stuff, but I thought it was weird that our compasses were acting erratically. And some parts of this hotel just have really eerie vibes. Yeah, so we didn't do anything different. Just with a little bit of patience, the compass has started working again. No idea. So now that the antennas can be aimed properly, it's time to pit them against each other. Round one, fight. We tuned into the station with the control and boom, the signal quality came in between 72 and 76%, and the picture looks good. This control antenna is an RCA unit, and it's rated for up to 80 miles and it's multi-directional. So the fact that we were able to point it away from Hancock and still get a good signal is a great sign. It shows that an antenna can receive the signal from the station we were testing, and it also shows that the station is broadcasting properly. Now, let's test Scamtenna 1. I taped that sucker to the window and we tuned into WTVK again, and nothing. Absolutely nothing. Well, our tuner activity light was flickering so it's trying to receive something, but other than that, nothing. Keep in mind, we're only 1.9 miles away, so that's not very far for an 880-mile antenna. Yes, we were pointed in the opposite direction, but this thing claims to be omnidirectional, so that shouldn't be an issue, right? Now let's bust out the monolith. Scamtenna 2. We recreated the setup, same direction, same distance, same station, and hey, we actually got something. The quality is coming in at 54 to 56%, not as good as the control, but way better than Scamtenna 1. Despite the percentage difference, the picture quality looks similar to the control. So the winner of round one is the control and the sore loser is Scamtenna 1 So we're eliminating it from further testing because clearly, it can't do Jack. I'm fresh out of participation trophies. Sorry about that, but maybe there's a sticker or something around here that I can give you. Oh, hey, look. Bucky sticker. You like that, right? For what it's worth, Scamtenna 1 worked fine under normal circumstances. We tuned into several stations and watched programming for several hours, and it worked fine until we moved around the room. Human bodies can reflect and absorb radio waves, so that's why if you walk near an antenna, the signal might go out for a little bit. That's why in a normal situation, it's ideal to have the antenna mounted further away from foot traffic. So now we need to shake things up for round two. And some of you may be thinking, \"Ken, why don't you just tune into a station 1,000 miles away to really test the claims?\" Well, that's where things get complicated because the answer is, we can't. Radio waves just don't work that way. And here's why. Radio waves, like all waves in the electromagnetic spectrum, travel at the speed of light and they travel straight. Because the earth is curved, these waves can only travel a limited distance before they travel too high for reception. Like we discussed before, ducks can help waves travel further, but this is dependent on the weather. Now, let's pretend the earth is flat. It's not, but let's pretend it is. The waves could potentially travel further, but you still have obstructions like clouds, mountains, hills, and buildings. And let's pretend even further. Let's say the earth is flat and all obstructions magically disappeared. You still have the problem of limited frequencies. Many electronic devices rely on radio waves for communication, like with wifi hotspots or cell towers, and those frequencies need to be allocated for those devices aside from everything else so there's no interference. Agencies like the Federal Communications Commission and the National Telecommunications and Information Administration designate these allocations in the United States. So if you're trying to tune into a station 1,900 miles away at a certain frequency, odds are you're going to cross paths with another transmitter broadcasting at the same frequency, and your tuner will only be able to tune into whichever signal comes in stronger. It's like if someone is 50 feet away shining a bright light towards your eyes, you'll see it. But if someone shines the same bright light, only one foot in front of your eyes, that's the light you'll focus on. So due to the physics of how waves travel and how tuners decode the signal, we can't just magically pick any station at any distance to tune into. We have to stick to more realistic distances. On the consumer side of things, the big lesson to learn from all this is when you're trying to tune into a specific station, specifically if you're trying to tune into a station that's really far away, the results are mostly out of your control. You can try mounting your TV antenna higher, you can try different amplifier settings, or you can possibly try an omnidirectional antenna. But at the end of the day, the transmitter and sometimes, the weather, dictates how far the signal travels. The distance depends on the height of the transmitter and the power it broadcast at, and there's only so much you can do at home to try and receive that signal. Now it's time for round two, the control versus Scamtenna 2. for this test, distance is the name of the game. We move to an undisclosed location over 100 miles away from our new target station, WYIN, who has only one transmitter in Crown Point, Indiana. When we were in Chicago, Scamtenna 2 picked up on the station, which was about 38 miles away at the time, and the signal was weak. The control could not pick up WYIN at all. So if the control couldn't receive the signal 38 miles away, I think it's highly unlikely it will receive the signal 100 miles away. That's my hypothesis. As for Scamtenna 2, well, if the advertising claims are true, it won't have a problem picking up that signal, right? We pointed the control antenna toward the transmitter. We're not doing any omnidirectional test this time and it couldn't receive it. That checks out because we're over 100 miles away and it's only an 80-mile antenna. So now let's test out Scamtenna 2 with its magical 1,900-mile range. Can this 1,900-mile scamtenna pick up the station? Whoa, it worked? This thing actually worked? (duck quacks) Nope, just kidding. It didn't work at all. Laws of physics have a pretty good track record of being right. You're telling me our 1,900 mile antenna can't pick up a station only 100 miles away? I'm gonna cry. But in the famous words, of the late Steve Jobs, there is one more thing. Why is the scam happening in the first place? My theory is this scam is simply low-hanging fruit, and it's for people who wanna make a quick buck. And there's two reasons behind this thinking. One, this scam is easy to fabricate. These antennas aren't complex pieces of engineering. They're usually just plastic housings, which hold thin metal structures. Our Scamtenna 2 has a large PCB, which uses traces as an antenna. Some antennas may have an amplifier built in, and others use an external amplifier attached to the cable. But that's it. Simply put, they're cheap to acquire and they're easy to lie about. A scammer can just simply have an inventory of these on standby and then put up a fake listing on Amazon or some other website and just lie about the claims and then sell them at a ridiculous markup. 'Cause 150 bucks for this thing just doesn't seem fair when you can get a 5,000 mile antenna on AliExpress for a fraction of the cost. Yeah, those are fake too. And reason two, OTT streaming and cable prices are really high and consumers want an alternative. The scammers can dangle the word free in front of the consumer's face and sucker them into buying an overpriced antenna. Less tech savvy consumers and/or younger consumers who didn't grow up with analog television may not know any better, and they're more susceptible to scams. But don't worry, that's why I step in and I'm here to help you, and so is Tyler. Look, if you need a TV antenna, there's plenty of legitimate options out there. The only big thing I say to be cautious of are the range claims. If it's claiming above 80 miles, maybe 90, just double check and do your homework. Antenna or no antenna, you can continue to watch me through the interwebs. So feel free to subscribe and stay tuned for my next episode coming soon. Until then, catch the crazy and pass it on. (techno music) Where are the rabbit ears on this thing? I'm just trying to watch my stories. MAARRRTTHAAAAAAAAAAA!",
    "transcript_keywords": [
        "antenna",
        "scamtenna",
        "claims",
        "miles",
        "antennas",
        "claim",
        "waves",
        "station",
        "signal",
        "antenna claims",
        "test",
        "radio waves",
        "channels",
        "control antenna",
        "mile antenna",
        "receive",
        "control",
        "scam antenna products",
        "scam",
        "range"
    ],
    "transcript_entity_values": [
        "Laifen",
        "Scamtenna 2",
        "CNN",
        "the National Telecommunications and Information Administration",
        "the Congress Plaza Hotel",
        "Ottawa",
        "K",
        "TVfix",
        "1,900 miles",
        "two",
        "60 degrees",
        "3",
        "only one foot",
        "1,900-mile",
        "2",
        "Indiana",
        "Scamtenna",
        "1,600",
        "1,000 miles",
        "Disney FX",
        "ABC",
        "earth",
        "the John Hancock Center",
        "several hours",
        "one",
        "HBO",
        "more than 13",
        "up to",
        "1900",
        "OTT",
        "Jony",
        "6.1-watt",
        "over 100 miles",
        "the Laifen Wave",
        "80 miles",
        "British",
        "ten two",
        "Scamtenna 1",
        "Apple",
        "8",
        "Brent",
        "about 1.9 miles",
        "the Federal Communications Commission",
        "between 72 and 76%",
        "Hancock",
        "RCA",
        "Miami",
        "186",
        "MAARRRTTHAAAAAAAAAAA",
        "18 degrees",
        "first",
        "4",
        "about 79.2 miles",
        "1080p",
        "850",
        "66,000",
        "1,800",
        "880 miles",
        "Nickelodeon",
        "up to 80 miles",
        "520 miles",
        "Hulu",
        "three",
        "880-mile",
        "Ken",
        "Hancock",
        "eight",
        "1",
        "WYIN",
        "about 40 to 80 miles",
        "only one",
        "Chicago",
        "880 plus miles",
        "only a fraction",
        "Bzoxauy",
        "only $9.99",
        "the end of the day",
        "only 100 miles",
        "two watts",
        "80-mile",
        "PCB",
        "Krazy Ken",
        "500,000",
        "ESPN",
        "DVR",
        "AliExpress",
        "360 degrees",
        "90",
        "NBC",
        "150 bucks",
        "Steve Jobs",
        "Tyler",
        "WTVK",
        "100 miles",
        "the United States",
        "iPhone",
        "Jack",
        "the Computer Clan",
        "820",
        "1,900 mile",
        "hundreds of miles",
        "Tru TV",
        "50 feet",
        "5,000 mile",
        "WTVK",
        "Netflix",
        "only 1.9 miles",
        "Laifen Wave",
        "54 to 56%",
        "880",
        "38 miles",
        "about 38 miles",
        "Bzoxauy",
        "Illinois",
        "Amazon",
        "One",
        "Model SW218-HD005",
        "Crown Point",
        "second",
        "Brainiac Brent"
    ],
    "transcript_entity_types": [
        "PERSON",
        "LAW",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "NORP",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "LOC",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "NORP",
        "CARDINAL",
        "LAW",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "MONEY",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "EVENT",
        "QUANTITY",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "FAC",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "GPE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "PERSON"
    ]
}