{
    "id": "OiQcxZ_1SZg",
    "title": "Better than Apple AirPods? - Air by Crazybaby NANO",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-12-14T20:43:58Z",
    "video_url": "https://www.youtube.com/watch?v=OiQcxZ_1SZg",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "Airpods",
        "Airpod Killers",
        "Crazybaby",
        "Air by Crazybaby",
        "Air by Crazybaby Nano",
        "Air Nano",
        "Air Nano Crazybaby",
        "AirPod Review",
        "Crazybaby Air Nano Review",
        "Unboxing",
        "Tech",
        "2017",
        "Apple Airpod Killer",
        "Apple Airpods 2",
        "AirPods 2",
        "crazybaby air",
        "earbuds",
        "wireless earbuds",
        "truly wireless earbuds",
        "best wireless earbuds",
        "tld",
        "jonathan morrison"
    ],
    "views": 449828,
    "likes": 15331,
    "comments_count": 1080,
    "description": "Are these $99 Wireless Earbuds Apple AirPod killers? Let me know whatcha think!  Air by Crazybaby NANO -  I edited this video on the new iMac Pro!   Background music via Epidemic Sound:   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://crazybaby.com/air-nano",
        "https://youtu.be/Wl7V4LwkfQE",
        "https://goo.gl/rMbhQL",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- You guys, Jonathan here. And, if you've been looking for a pair of AirPods alternatives, you're gonna wanna check these out. (upbeat music) These are the brand new Air NANO wireless headphones from crazybaby, which are so new in fact, they aren't even out yet. They're currently available for pre-order on Indiegogo. So, giant shout out to crazybaby for letting me check these out early, and sponsoring this first look. Now on top of that, I also got a chance to give away a brand new pair to you guys. For details on how to win, make sure you guys check out the link below. And it's not required, but if you guys appreciate that, let me know by smashing that like button. So, the Air NANO's come in this capsule-like case, that both houses and charges them with a fully charged case. You usually get about 15 hours of battery life. They also come with a ton of ear tips, which right there, may be an advantage over AirPods. For me, AirPods fit, they don't fall out, but for a lot of people, they just don't agree with their ears. And with this, that'll help ensure a perfect fit. One thing that immediately jumped out to me, that I really appreciate, is that the case charges via USBC, so thank you crazybaby. That is one less cable I gotta carry. Now another really unique aspect with these, they're gonna be available in 10 different colors. Black, White, Red, Purple, Pink, Matte Gold, Austin Yellow, Morandi Blue, Atlantis Green, and Volt Green. Now, these are gonna start out at $99, but if you catch that Indiegogo link early, you can actually pre-order these for $89. Which is a substantial amount cheaper than a pair of AirPods, Which are around $160. Now regardless of the price, or however many colors they come, if they don't sound good, and more importantly, if they don't stay in your ears, none of that matters. Naturally, the first thing I wanted to do was see how well they stayed in my ears. Surprisingly, these stock ear tips that came with the Air NANO's seem to work perfectly. I started out the test with a simple head shake, and then leveled up to a mediocre 360 jump off a very small ledge. That passed the first test with flying colors. So the next test was also a mediocre attempt at a handstand on a rail. The bad news is, I did not execute that move. The good news is, the headphones did not fall out of my ears. So based off that, I think they're gonna be great. Not only for day to day use, but also if you want to take them to the gym, or workout with them. Yes, there is the argument that because they are two tiny earbuds, what if I lose them? The fact of the matter is, you're gonna get in the habit of charging them in the case. If you do that, that is not something you're not gonna have to worry about. So, clearly they stay in my ears, but how do these things sound? With AirPods, yeah, they work really well for most situations. But if you're at the gym, or on an airplane, RIP whatever you're trying to listen to. With these, they definitely do a much better job with that. And, kind of fill in that gap where AirPods are kinda lacking. Now, these are also rocking Bluetooth 5.0, and a Qualcomm CSR chip that's gonna help ensure solid connectivity. Yeah, you don't get that super satisfactory WN pairing experience like you would with AirPods, but set up was super simple. And the beautiful part is, once you are paired, it will automatically pair every time you take these out of the case. So the takeaway here is, they sound great, thumbs up. They fit in your ears, thumbs up. And, they are much cheaper than AirPods, for the final, and third thumbs up. On top of that, I think the thing that has me most hyped is all those pretty, pretty colors. I definitely want to check out the blue ones. Let me know what's your favorite colors with a comment down below. Again, if you jump on that early bird special, you can scoop these up for $89. I will drop the link down below. This is Jonathan and I will catch you guys later.",
    "transcript_keywords": [
        "Air NANO",
        "AirPods",
        "ears",
        "Air NANO wireless",
        "guys",
        "check",
        "Air",
        "NANO",
        "case",
        "colors",
        "pair",
        "crazybaby",
        "ear tips",
        "guys check",
        "thing",
        "Indiegogo",
        "fit",
        "link",
        "Green",
        "test"
    ],
    "transcript_entity_values": [
        "two",
        "360",
        "Indiegogo",
        "89",
        "One",
        "10",
        "WN",
        "Air NANO",
        "USBC",
        "the Air NANO's",
        "Qualcomm",
        "a ton",
        "99",
        "AirPods",
        "Austin Yellow",
        "Morandi Blue",
        "first",
        "one",
        "around $160",
        "Volt Green",
        "third",
        "Atlantis Green",
        "about 15 hours",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "TIME",
        "PERSON"
    ]
}