{
    "id": "OiSVlCfpXFQ",
    "title": "6 must-have Mac utilities",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-06-20T15:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=OiSVlCfpXFQ",
    "category": "Science & Technology",
    "tags": [
        "mac",
        "osx",
        "macbook",
        "mac os",
        "macbook pro",
        "macintosh",
        "apps",
        "mac os x",
        "apple",
        "utility",
        "best apps",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "how to",
        "how to make",
        "diy",
        "mkbhd",
        "marques brownlee",
        "google",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge",
        "dieter bohn"
    ],
    "views": 770622,
    "likes": 14804,
    "comments_count": 732,
    "description": "One of the perks of using a laptop or desktop, instead of a tablet, is that you can customize your workflow. Utilities make your computer less annoying and customized to you. In this episode of Processor, Dieter demos some of his favorite MacOS utilities.   All the links to download the utilities are here:   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://www.theverge.com/2018/6/20/17481054/mac-menubar-utilities-taylorism-is-bad",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(slow music) - So in this processor video series we've talked a lot about the future of computers but honestly most of the time I just end up going back to my Mac or a Windows PC and I do that because you can really customize the way that the operating system works but here's a question why would anybody bother doing that in the first place? So the reason I like customizing my computers and I know that this makes me sound really really corny is that it makes me feel like I have super powers. If there's something that annoys me about the way that my computer works I can just go out in the internet and somebody else is inevitably annoyed by the same thing and there's usually a utility that I can download and install that fixes that annoyance. And I'm talking specifically here about utilities and not apps so I'm not talking about stuff like One Password which I love and you should go and install or Dropbox which I also love it's my favorite Cloud utility app. No I'm talking about utilities things that change the way your computer actually works at kind of a deep level. And so in this video I wanna talk about my favorite Mac utilities we'll do Windows in another video later on so let's get into it. So one utility that basically everybody who has a Mac tends to install when they get into this thing is a Window Manager and there's a million of these but my favorite is called Flexiglass and it does all the standard stuff that a Window Manager does so you can hit a key combo to move your window to the left or the right or full screen or whatever. But the reason I like it if we look at the preferences for it you can see that it has this thing called a Window Mover and what that lets you do is you can hold down buttons on your keyboard to adjust the placement of your windows. So let me explain normally if you wanna resize or move your window you've gotta move your mouse to a specific point like down here in that corner and it's really hard to hit, but with the Window Mover you can have your mouse anywhere in your window hold down a key combo and you can start moving your window around, or another key combo and resize your window. And so for 9.99 which is the cost of Flexiglass it gives you a way faster way to move around or adjust your windows on your Mac. Another utility I really like especially if you're on the latest update of the Mac Operating System High Sierra which you really should be is (laughs), it's got a weird name actually hang on I'll look it up here it's High Sierra Media Key Enabler. This is a free utility and it puts a little dot in your menu bar and what it does is it makes your play, pause, next, previous buttons on your function bar actually work. So normally if you hit that it might start iTunes or it might pause video on Safari you never really know but with High Sierra Media Key Enabler you can set it to prioritize Spotify so when you hit that play pause button it's just gonna send that command to Spotify and it'll always work. Another utility that a bunch of people install is a screenshot utility. Now I know that you can hit Shift+Command+4 in a Mac and it'll record a screenshot but I use this app called Annotate it was recently acquired by Cloud App but it's still free and when I hit Shift+Command+4 to take a screenshot I can then draw and I can put little arrows on it, I can put some text on it, I can even like blur out certain section of it and then when it's done I can just hit the Twitter button to tweet it, I can save it or I can even hold down the option key and drag it directly to another app if I just wanna put it directly into another app. It's way more convenient than the built in screenshot utility and I really recommend if you don't use Annotate at least some kind of screenshot utility. So the next utility I wanna talk about is one I've talked a ton about it's called Alfred and I've made a whole other video about it. It's basically a better version of Spotlight you can hit a key combo and when you do a search box pops up and it's better at internet stuff than Spotlight is. And you can even do stuff like clipboard history and snippet some text and all kinds of customizations. But the tool that I use with Alfred is just as important it's called Karabiner Elements which is a funny little tool and let's you assign a button on your keyboard to something else. So for me I've assigned Caps Lock to the F16 key 'cause if I wanna shout in the internet I'm hold down the Shift key like I really mean it. So instead when I hit the Caps Lock key it pops up my Alfred search box and then I can search for something on The Verge really fast and that's great. Now for Alfred to get the most out of it you need to pay 19.00 for the app but Karabiner Elements which remap your buttons is free. Now this utility is the saddest nerdiest thing 'cause it literally saves you like one click but I still love it it's called Tooth Fairy and here's how it works in your menu bar it puts a little icon and shows you whether or not you're connected to Bluetooth headphones so this are Beats X headphones and they're currently paired to my iPhone I wanna listen on my Mac so with Tooth Fairy I just click this button and then it will connect up to my Bluetooth headphones and it'll even turn dark to show me that I'm connected to my Bluetooth headphones and you can set it up for multiple pairs of headphones. I know it just saves you one click but that click makes a big difference to me. Okay so last utility you may have noticed that I've got a million menu bar icons and it looks hellacious but there's a couple of utilities that lets you hide most of them the one I like is called Vanilla and it's really simple it just puts a little carat in your menu bar and you can just tap it and it hides all of your icons and then you can just hold down the Command key to drag icons in or out of the hidden section it just makes your computer feel more comfortable. It's nice. So those are my favorite utilities for the Mac and I talk about this a lot but I really do think that being able to customize your computer makes a huge difference it makes it feel like it's yours and not this thing that got handed down to you. If you're using an iPad or a Chromebook if there's something that you don't like you basically just have to deal with it but with a Mac or with a Windows PC if there's something you don't like you can change it and most of the time I prefer the platform that you can change. Hey everybody thank you so much for watching and I wanna know what your favorite utilities are 'cause I'm always on the lookout for new ones basically all the time 'cause I'm an obsessive nerd. And while you're there leaving a comment you could also hit that subscribe button it really helps us out.",
    "transcript_keywords": [
        "Window",
        "Mac",
        "Sierra Media Key",
        "High Sierra Media",
        "key",
        "utility",
        "Media Key Enabler",
        "Window Manager",
        "Window Mover",
        "hit",
        "Windows",
        "High Sierra",
        "key combo",
        "Mac Operating System",
        "processor video series",
        "favorite Mac utilities",
        "System High Sierra",
        "Media Key",
        "called",
        "Key Enabler"
    ],
    "transcript_entity_values": [
        "one",
        "Mac",
        "Flexiglass",
        "Tooth Fairy",
        "Karabiner Elements",
        "Chromebook",
        "Twitter",
        "Windows",
        "Flexiglass",
        "Command",
        "Caps Lock",
        "Spotify",
        "a little carat",
        "9.99",
        "Vanilla",
        "Cloud",
        "Karabiner Elements",
        "iPad",
        "Safari",
        "F16",
        "the Mac Operating System High Sierra",
        "19.00",
        "a million",
        "first",
        "Mac",
        "High Sierra Media Key Enabler",
        "Dropbox",
        "Cloud App",
        "Alfred"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "GPE",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON"
    ]
}