{
    "id": "ojB4ylowhJg",
    "title": "iPhone 7 - Sneak Peek",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-07-24T16:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=ojB4ylowhJg",
    "category": "Science & Technology",
    "tags": [
        "iphone 7",
        "iphone 7 unboxing",
        "iphone 7 official video by apple",
        "iphone 7 release date",
        "iphone 7 review",
        "iphone 7 plus",
        "iphone",
        "iphone 7 renders",
        "iphone 7 plus unboxing",
        "iphone 7 concept",
        "new iphone",
        "iphone 7 leaks",
        "iphone 7 trailer",
        "iphone7",
        "iphone 7 pro",
        "apple iphone 7",
        "iphone 7 hands on",
        "apple",
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "iphone 7 rumors",
        "iphone 7 leaked",
        "smartphone",
        "iphone 7 features",
        "iphone 7 vs 6s"
    ],
    "views": 2836661,
    "likes": 53047,
    "comments_count": 9802,
    "description": "iPhone 7 unboxing coming soon! Subscribe for more -   (   ) --- Today's Mystery Video -   Geert Van Uffelen -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://youtube.com/unboxtherapy",
        "https://youtu.be/jaND40FDcKw?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://www.geertvanuffelen.nl/",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys, Lew here back with another video and today I am bringing you something exclusive You're about to look at some iPhone 7 renders that have never been seen anywhere else. I've received an email recently from an individual named Geert Van Uffelen From the Netherlands, I'll put a link to his site down in the description What he did is he took all of the leaks, all of the rumors regarding the iPhone 7 and boiled them down into these beautiful visual representations of the upcoming iPhone There was talk at one point about a 7 Pro but it looks like the Plus will kind of represent the Pro lineup, in the sense that it will have some added functionality. Now when looking at the cameras, that's where you're really gonna be able to tell the difference between the iPhone 7 standard and the iPhone 7 Plus. They've both got raised cameras but on the Plus there's likely to be a dual lens system. So this kinda setup exists for couple of different reasons, you could be looking at two different focal lengths maybe two different sensors. There could also be some optical zoom in one of the lenses This is something that the people are excited for, this ofcourse would allow you to get in closer on an image without getting that kind of broken up look that exists via digital zoom. As you could tell in these renders, these standard iPhone 7 appears to show a more.. traditional camera layout just one lense rather than two But chances are it won't be the same camera that you've got in the 6s instead.. it looks like it's gonna be a bigger sensor in this upcoming model, bigger sensor generally means bigger pixels which would result in better low light performance, so it looks like the 7 will have a slightly better camera whereas the 7 Plus on the other hand is gonna have this really cool dual camera layout Now something that appears to be all but guaranteed at this point.. is the lack of a head phone jack on both the 7 and the 7 Plus, every single leak, rumor.. including these renders, does not represent a headphone jack at the bottom of the device instead.. you will likely get an adapter inside the box which will convert from lightning out... to mini jack, I don't think the lightning headphones are gonna be in the box And I don't think they gonna include wireless ones, and there is little bit of silver lining here in the sense that.. you now have stereo speakers in the location where the headphone jack used to exist better speaker, no headphone jack Now the thing is even though nothing's being called the 7 Pro instead it's probably gonna be 7 and 7 Plus, chances are the Plus is gonna operate more.. as a Pro model. It's gonna have.. probably more RAM, who knows what other specs that might be superior, but also.. a connector that has shown up in all the leaks and rumors as well.. as in these renders, this smart connector on the back of the 7 Plus That this rumored connector is something that's been seen before on Apple products, it exists in the iPad Pro.. and in that case it allows you to interface with keyboard, cases. In the upcoming iPhone, my hope is that this smart connector will enable wireless charging something I've been looking for in an iPhone for a very long time but on top of that, maybe 3rd parties can tap into it and create their own accessories Okay lastly, let's talk about color. What you will see in these renders.. is a Jet Black iPhone 7 and will we see that or won't we, this is one of the rumors I'm a little bit more skeptical about all those other colors look really familiar, Jet Black not something that Apple has done The closest would've been on the iPhone 5, which was darker than the current Space Gray, I don't know if this.. happens that's definitely the one I'm gonna pick up. I just think it looks really slick And Hey, more options is always a better thing. So there you have it, some exclusive renders of the upcoming iPhone 7 and 7 Plus Let me know down in the comments, which version would you be more likely to go for or are you just gonna stick with your old version or maybe... you're all about android.. let me know let's have a little vote.",
    "transcript_keywords": [
        "Geert Van Uffelen",
        "named Geert Van",
        "iPhone",
        "upcoming iPhone",
        "Geert Van",
        "Van Uffelen",
        "video and today",
        "Jet Black iPhone",
        "individual named Geert",
        "Lew",
        "Pro",
        "headphone jack",
        "Lew here back",
        "renders",
        "jack",
        "camera",
        "Jet Black",
        "named Geert",
        "camera layout",
        "Black iPhone"
    ],
    "transcript_entity_values": [
        "6s",
        "iPhone 7 and 7 Plus",
        "Geert Van Uffelen",
        "Lew",
        "Space Gray",
        "the 7 Plus",
        "iPad Pro",
        "iPhone",
        "RAM",
        "the 7 Plus",
        "jack",
        "Apple",
        "Netherlands",
        "two",
        "Jet Black",
        "7",
        "mini jack",
        "the iPhone 7 Plus",
        "3rd",
        "one"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "EVENT",
        "PERSON",
        "PERSON",
        "PERSON",
        "EVENT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL"
    ]
}