{
    "id": "oJXcPyK7iVs",
    "title": "Does It Suck? - $15 Bluetooth Beanie",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-02-26T22:27:11Z",
    "video_url": "https://www.youtube.com/watch?v=oJXcPyK7iVs",
    "category": "Science & Technology",
    "tags": [
        "bluetooth beanie",
        "bluetooth",
        "bluetooth hat",
        "hat",
        "toque",
        "beanie",
        "bluetooth headphones",
        "headphones",
        "audio",
        "unboxtherapy",
        "unbox therapy",
        "amazon",
        "tech",
        "technology",
        "best headphones",
        "best",
        "review",
        "unboxing",
        "apple",
        "iphone",
        "wireless",
        "android",
        "samsung",
        "galaxy",
        "smartphone",
        "iphone 6s",
        "phone",
        "6s",
        "iphone 6",
        "gadgets",
        "iphone 6s plus",
        "mobile",
        "s6",
        "android (operating system)",
        "apple iphone",
        "apple inc. (publisher)",
        "iphone (video game platform)",
        "beats",
        "s7",
        "galaxy s7",
        "samsung galaxy s7 edge",
        "smartphone (video game platform)"
    ],
    "views": 1912501,
    "likes": 47420,
    "comments_count": 3859,
    "description": "August EPA20 Beanie -   Turns out there are many of these bluetooth hats on Amazon. I decided to try out this one as it had almost exclusively positive reviews.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/1TTtYmc",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "- What's up, guys? Lew here back with another video. Today is another installment in the hit series, Does It Suck? This my friends, is a bluetooth beanie. Beanie or toque, whatever you want to call it. This is a hat, a warm hat, for those colder days and evenings that has bluetooth built into it. Speakers sewn inside. Connect it to your phone, listen to your music. What? No headphones necessary. There's a microphone. Answer phone calls on your hat. This is the future, my friends, you're living in it. I don't know, like under 20 bucks or around 20 bucks. Let's jump inside and maybe it sounds okay? You're getting earphones in your beanie. It's a bonus. Beanie bonus. Micro USB cable for charging this up. Yeah, of course, makes sense. How heavy is it? Not too heavy. Not too heavy, actually. So, you know, it actually looks pretty normal, right? And here, this is where your micro USB plugs in. Just gotta kinda find the spot. Let me try it on first. Let me see just how comfy it is. I guess you could orient it whichever way. Orient or orientate? Whatever. I feel like Rocky. Ready for anything right now. See that right there? Unbelievable. Sound is gonna be key. I mean, it can't sound amazing, but this, I could be the guy on the airplane, put the beanie on, could be me. Probably not. Could put the hood up over top. Can't do that with, now I'm definitley Rocky. Ya see, you see what ya, you see, don't forget the uppercut. Just when you were relaxing. You had the hands up. You were looking for the overhand, but I hit you from underneath. Don't forget it. Way comfier than I expected. I mean, maybe you wanna hit the slopes. I had something called the GT Snow Racer. Jack, did you have one? GT Snow Racer, and that's how you got it done on the hill. Two Snow Racers coming down. Some people didn't survive. You know, we had to leave some guys there. A couple men down. Just the way it goes, rough and tumble life in the Great White North. Yes! There's a light. Whoa, I am excited. I told you I was using the Blackberry. I'm doin' it. I hear it already. Yeah. Plus minus is to switch tracks. Volume is essentially gonna be controlled by your device. You know, they're not fully covering your ears, right. It's as if they're sitting on top. So, like, there's no kind of isolation happening. Very little isolation. It's kinda more like as if you've gotten music on in an ambient type of fashion. You're on public transit. You're taking a subway or the streetcar or the bus, whatever and you got your podcast on and maybe you want a little bit of spacial awareness still when you're out and about. I like this. It's not that loud, okay, to be clear, to be clear. I'm gonna try switching tracks here on this thing. Here. (funky music) I'm mean, it's not gonna blow your brains out, but some little motivation, you're out on that jog. You could even do one ear. See that? So, I could be having a conversation. Hey, Jack, I'd like to have a coffee, please. I don't want any sugar in it. I mean, you gotta kinda curb your expectations based on what you're working with here. It's like a beanie with earphones. I think it delivers on what I wanted it to deliver on. I'm wireless right now. My head is warm. You only feel like a regular hat. You seriously don't even realize that there's headphones in here. (funky music) Get out and jog, workout, or if you're like me, throw some uppercuts. Rocky five. How many Rockys are there, 12, 17? Alright, that's it. Doesn't suck. Check out the link in the description if you wanna see it for yourself. Maybe you wanna pick one up. Thank you very much for watching. Leave a thumbs up if you enjoyed this content. And I will catch you on the next episode. Later guys. (funky music)",
    "transcript_keywords": [
        "beanie",
        "Snow Racer",
        "hat",
        "Snow",
        "kind",
        "Rocky",
        "Micro USB",
        "heavy",
        "guys",
        "Racer",
        "hit",
        "Snow Racers coming",
        "USB",
        "Lew here back",
        "bluetooth beanie",
        "bluetooth",
        "Jack",
        "Suck",
        "friends",
        "Great White North"
    ],
    "transcript_entity_values": [
        "17",
        "Rockys",
        "Lew",
        "Blackberry",
        "Two",
        "around 20 bucks",
        "12",
        "the Great White North",
        "USB",
        "Micro USB",
        "first",
        "Today",
        "Orient",
        "Jack",
        "20 bucks",
        "Beanie",
        "Rocky",
        "Rocky five",
        "one"
    ],
    "transcript_entity_types": [
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "LOC",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "FAC",
        "CARDINAL"
    ]
}