{
    "id": "okbJcBv_y4M",
    "title": "The Play Station 5 just got a HUGE UPGRADE!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-06-15T20:04:02Z",
    "video_url": "https://www.youtube.com/watch?v=okbJcBv_y4M",
    "category": "Howto & Style",
    "tags": [
        "play station 5",
        "ps5",
        "darkplates",
        "retro darkplates",
        "PS5 console covers",
        "cover plates",
        "gaming",
        "gamer",
        "video game",
        "sony",
        "PS6",
        "play station 6"
    ],
    "views": 366085,
    "likes": 21046,
    "comments_count": 15318,
    "description": "Boost your Play Station 5 gamer cred with the new Retro Darkplates!  Winner of the PS5 Giveaway will be contacted though this YouTube comment section in on June 18th 2023.   YouTube is not affiliated with this giveaway - Sony and PlayStation are also not affiliated with this giveaway.  Get my Shirts and Razor Knife here!    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://dbrand.com/shop/retro-darkplates",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/ACnP4TvUoTN-kdVzL6dT8g?pm=link",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "This is a brand new, very boring, wi-fi router looking PlayStation 5 that I'm going to give away to one of you guys after, of course, I make a few very simple, rather nostalgic upgrades. Let's get started. [Intro] About 20 years ago, civilization peaked. We had transparent 64's, transparent GameBoys, transparent PlayStations, and even Apple was in on the awesomeness with legitimate genuine transparent Apple Computers. As you clearly know, lately society in general has been headed in the wrong direction with bland, soulless, uninspiring hardware. Luckily, channel sponsor dbrand is here with an 11th hour course correction for humanity with Retro Darkplates. Fun little easter egg is that dbrand has taken PlayStation's cease and desist letter and inscribed it in binary throughout the inside of the back panel. That's pretty gangster. And it's the little details like that that matter. Installing the plates is actually pretty easy. Lift up on one corner and slide the whole panel down. And quicker than the cancellation of Half Life 3, we have a brand new PS5 for a fraction of the cost no screws or tools needed. We can repeat the same trick with the other side, and for sure if you got zero ladies with your previous Station, you'll be getting at least 5x as many with the Retro Darkplates installed. You might have noticed that the previous PlayStation 5 had no vents on the side. Like any other computer, air circulation is critical to keeping parts cool. And busting out 4K visuals on Apex Uncharted or Sackboy generates a lot of heat, especially if your PS5 is in a cabinet, shelf, or somewhere with poor circulation. Exposing the fans helps a lot. These fan vents with mesh grills will preserve the life of your machine. Leave it to dbrand to make a cool design even cooler. Now you might be thinking to yourself, 'Hey Jerry, why would dbrand go through all the effort of making the sides beautifully transparent and leave the middle grotesquely unfinished? Well luckily this isn't the new Golem game and dbrand is one step ahead. Using an industrial 450 kilovolt x-ray machine in a metrology lab, we scanned the PS5 from every angle, digitized the x-rays, and hue matched the scans to each Retro Darkplate. So no matter what perspective this new machine is admired from, it'll be showing off an accurate representation of the internals, even from the bottom, which you'll never see since Retro Darkplate owners are always on top. At first I thought Atomic Purple might be my favorite since that was the color of my original GameBoy Color that I, you know, had way back in the day. But I think now I'm kind of leaning towards Fire Orange. Either way though, not my decision to make anymore since I'm giving this entire package away to one of you guys. All you have to do is leave a comment down below saying something good that's happened recently, and I'll pick one winner who gets the PS5 and all of the colors. And, of course, if your own PlayStation 5 is ready for a visual and thermal upgrade, I'll leave a link down in the description so you can grab one of your own. Civilization is definitely back on track. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "wifi router",
        "Retro Darkplates",
        "transparent Apple Computers",
        "Retro",
        "Retro Darkplates installed",
        "transparent",
        "dbrand",
        "PlayStation",
        "genuine transparent Apple",
        "Retro Darkplate owners",
        "Apple Computers",
        "nostalgic upgrades",
        "transparent Apple",
        "Leave",
        "Apple",
        "Darkplates",
        "Darkplate",
        "boring",
        "wifi",
        "simple"
    ],
    "transcript_entity_values": [
        "PS5",
        "PlayStation 5",
        "Apple Computers",
        "About 20 years ago",
        "Apex Uncharted",
        "at least 5x",
        "Sackboy",
        "GameBoy Color",
        "Retro Darkplates",
        "Retro Darkplate",
        "Jerry",
        "PlayStation",
        "GameBoys",
        "4",
        "zero",
        "Fire Orange",
        "PlayStations",
        "Apple",
        "450",
        "Half Life 3",
        "the Retro Darkplates",
        "11th hour",
        "64",
        "one",
        "the day"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "LOC",
        "CARDINAL",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "DATE"
    ]
}