{
    "id": "OLEJ9la0Hhs",
    "title": "I WAS WRONG ABOUT THE iPHONE XS CHARGER CASE!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-02-28T19:27:44Z",
    "video_url": "https://www.youtube.com/watch?v=OLEJ9la0Hhs",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iphone xs",
        "iphone xs max",
        "case",
        "charger case",
        "review",
        "lastpass",
        "lastpass login",
        "password",
        "password generator",
        "lastpass chrome",
        "lastpass download",
        "lastpass premium",
        "random password generator",
        "generate password",
        "password manager",
        "recover",
        "lastpas",
        "laspass",
        "lastpass premium features",
        "delete account mobogram",
        "lastpass.com",
        "how secure is my password",
        "last password"
    ],
    "views": 379774,
    "likes": 11644,
    "comments_count": 1054,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- I was wrong about the iPhone XS battery case. I was wrong in saying that it was only 1369mA. But the thing that I was most wrong about was the fact that I said that I didn't need this. I do need it. Before we get into why I love this thing so much. A huge thank you to LastPass for sponsoring this video. You guys have been so incredible and I've been using LastPass for quite a while now. What I love about LastPass is not only do they keep all of my passwords safe and secure, but they can also create very unique passwords for every one of my accounts. LastPass will save all of your user names and passwords so anytime you need to log in if it's on your phone, if it's on your computer it makes it super super simple. It works on iOS, Android, MacOS, Windows, basically anything that you need to log into. It'll remember all those things and log you in instantly. So you don't have to remember all of your passwords, or write them down, or lose them. Everything will be safe and secure. They also have this other cool thing. It'll give you password breach alerts. It'll let you know if that password that your using is not secure any longer. So huge thank you to LastPass for sponsoring this video. Again, I'll put a link in the description to LastPass if you guys want to check it out. And now, let's talk about this case. According to this Verge article, instead of using a single large cell like the iPhone 7 battery case, Apple is actually using two battery cells wired in a series which keeps the net amperage the same but lets it boost the voltage to 8.7V. Which is higher than the previous 3.8V. So like I was saying this case has been unbelievably just shockingly way better than I thought it was going to be. I was kind of skeptical when I first did the unboxing. I was like okay, it's just another case for my phone that charges the battery. So the best example that kind of really solidified how much I love this is the other day when I was traveling back to Los Angeles from Pennsylvania. I got up super early on the East Coast. I think it was like 5 AM there, packed, got to the airport, traveled, was on my phone all day long during the flight, get back home, do whatever it is that I have to do and by the time I went to bed like I still actually had battery left. And it was kind of shocking because before I would always feel like I was tethered to a battery device. Like I would always constantly have something with me. I was always charging my phone I felt like, and with this my phone was always charged. I didn't have to worry about anything. I was so impressed with this thing that I'm making a follow up video. I've said so many great things about this case that my sister was like \"Well I need to get one too.\" So after this video I'm going to go surprise her with this. I also love that it kind of has this little ridge. I did say that it was heavy, but now I'm so used to it. I never drop my phone anymore because I'm able to just kind of hold on to it too. So it's been great when I'm filming or taking pictures. Sometimes when I'm using the Osmo Pocket, actually here's a video from when I was playing Topgolf not too long ago and it was raining. So not only did the case get wet, but my phone got wet and the Osmo Pocket. Oh man. I may have done a bad thing. But because this was a little bit thicker it sort of acted as a little bit more of a tripod. So the Osmo here, the phone here. I don't really think that this is that water resistant, but it resisted. It's still working perfectly. So I guess that's proof and test enough that it still is working even after getting wet. I do want to go give this to Jenna. So we'll have to surprise her after this video. I would love to hear from you guys though. Have you used battery packs before? Have you used this one? Are you as pleasantly surprised as I am how great this is? Or is this just kind of a new thing for me because I'm not used to using battery packs? So let's take a look here, so my Smart Battery Case currently is at 0%. It is now 8:04 PM and my phone is at 90%. That's unheard of. I haven't charged my phone all day. Technically it's been charging sort of all day, but you know what I mean. It's just crazy to see that it is this late and my phone still has charge. It's shocking to me. I mean the iPhone XS Max already has really great battery life, I thought. So I thought this was something that I wouldn't need, and now it's something that I just can't even live without. So long story, long video short. Now that I've been using this for a few weeks I just kind of retract anything that I said previously about not needing this. Because this has made such a huge difference, because this is all I need. I don't need to worry about having an extra charger. I still always have an extra charger with me. I'm just paranoid and I also have other things that I need to charge like the Osmo Pocket, and like my GoPro. - [Justine] And I've been using this massive Nimble charger. This thing is incredible. So when I'm also traveling sometimes flights don't have plugs or outlets. I've been using this to charge my MacBook. The MacBook can charge with USBC. The only downside is that it doesn't actually charge the computer, but it does keep it alive. So what I do is when my MacBook is 50% I plug it into the Nimble charger, and that will give me like a couple extra hours. And then once the Nimble Charger dies, then I just continue using the rest of my battery life. And then that's my day basically. I've also been using it on my iPad Pro. I've been using my iPad Pro so much more. I've been getting into Procreate so it's been really fun kind of going in and just doing like some illustrations and some paintings. It's been really fun kind of using that. Sort of an alternative to my computer when I don't have to edit videos. I have so much I feel like I want to talk to you guys about. Like I've been loving my new server. Like, everything is just sort of coming together. I'm so looking forward to doing kind of my office renovation. I know you guys are like \"Didn't you just redo your office? I feel like your office is always sort of under construction.\" Yes, it is always under construction. And that's because for me when something I feel like gets to the peak perfection, that I think that it is perfect, it's time to destroy that and start over. Because if that's as high as you can get and that's the level of achievement there's no point in continuing. You need to tear it down and start over. It's probably not the most logical thing. But for me, that's how I operate. So, welcome to the inner workings of my mind. I also want to say a huge shout out to the iJ Army members. If you guys don't know I did start a membership thing on my channel. You guys actually were making some decisions on what emojis you'd like to see. Making decisions on which thumbnails you guys like. And, I'm not sure the future of that is kind of up in the air. It's like what do you guys like? What do you want to see? That is the beauty of YouTube and this community and just the internet in general. You guys actually help create and make decisions about the content that I create. So, it's really just so fun and I think you guys are all incredible. And I think that was all I wanted to talk about. I really just wanted to focus on this. I have so many updates that I want to just talk about. I just don't even know where to start. I'm flustered. - [Justine] I have got a surprise for you. - I'm scared. You were like \"go stand right there.\" I'm like, why? - So the thing is I told Jenna I was like remind me that I have a surprise for you. The surprise is - Should I close my eyes? Are you going to do something to me? - No, here put this in your hands see if you can guess what it is. - It's rubbery. Oh it's a phone case! - Yeah but what kind? - I opened my eyes. Oh this is nice! - It's a battery charger one. - It is a battery charger one. - So I've nonstop been talking about how much I love this thing. And Jenna was like \"Oh maybe I should buy one for myself.\" - Yeah - And I said well girl guess what? - Stick your phone in there. - Well, so. Oh I found it. Okay. - Was it in your pants? - Yeah. - Maybe I take this back. - I forgot what phone I have. Space gray! - Oh that's good. It'll look nice in there. - Oh my goodness. - This thing has been so great. I also charged it for you. Wait wait wait wait wait. So you're supposed to do it. You insert here like at the top, slide it in. - That makes way more sense then what I was trying to do. - Another thing that I absolutely love about this. - It's charging. - It is charging. It's so if you - Well so it's not. - Your face. So I guess maybe by charging maybe like. - So you didn't charge it? - Maybe I didn't charge it. I thought that I did. Get your face in there. - So - So You can see the battery life. - I know how to do that. - Yeah okay so. - So my Smart Battery Case is 0%. - I thought I charged it for you, but I actually charged my own. - Does this work with wireless? - It does, that's what I was getting at. This also charges wireless so it basically just acts like a. - I like it. It's cool - Case that charges. - Its like a nice extra grip too. - It does. - Cause I'm reckless with these things. - That's what I said too. So enjoy. - So this is dead. I appreciate it thank you. We're gonna match. - Do you want me to pay you for it? - Wait a minute. No, it's a gift. Your nails are white mine are black. - Oh fashion. - I'm shook. - And this is rose gold. - Thanks Jus. - So it matches my phone. - Mine's not. Mine's silver. So it matches nothing. - I have nothing else to add to this video. - Thank you. - That's it. Enjoy your gift. - Thank you bye now. Bye. - [Camera Man] Do you guys want to hug or something? - No - It's okay. (laughter) (gentle music)",
    "transcript_keywords": [
        "battery",
        "phone",
        "battery case",
        "thing",
        "case",
        "Smart Battery Case",
        "kind",
        "guys",
        "Osmo Pocket",
        "video",
        "charge",
        "charger",
        "love",
        "LastPass",
        "Nimble charger",
        "battery charger",
        "things",
        "battery life",
        "Smart Battery",
        "Osmo"
    ],
    "transcript_entity_values": [
        "MacBook",
        "all day",
        "a minute",
        "MacBook",
        "Apple",
        "Justine",
        "the Osmo Pocket",
        "a couple extra hours",
        "iPad Pro",
        "USBC",
        "Procreate",
        "5 AM",
        "YouTube",
        "90%",
        "Los Angeles",
        "Osmo",
        "Pennsylvania",
        "the East Coast",
        "1369mA.",
        "a few weeks",
        "8:04 PM",
        "two",
        "50%",
        "Windows",
        "Topgolf",
        "first",
        "Army",
        "GoPro",
        "LastPass",
        "0%",
        "Max",
        "Jenna",
        "Verge"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "TIME",
        "FAC",
        "ORG",
        "PERSON",
        "PERSON",
        "TIME",
        "PRODUCT",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "PERCENT",
        "GPE",
        "PERSON",
        "GPE",
        "LOC",
        "PERSON",
        "DATE",
        "TIME",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERCENT",
        "PERSON",
        "PERSON",
        "ORG"
    ]
}