{
    "id": "OOT2membFB4",
    "title": "The End - Final Office Tour",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2021-03-21T21:17:50Z",
    "video_url": "https://www.youtube.com/watch?v=OOT2membFB4",
    "category": "Science & Technology",
    "tags": [
        "goodbye",
        "final office tour",
        "office tour",
        "desk setup",
        "Jonathan Morrison",
        "tld",
        "tldtoday",
        "Jonathan office tour",
        "2021 office tour",
        "2021 desk setup",
        "m1",
        "m1 setup",
        "apple m1 MacBook",
        "m1 MacBook Pro",
        "review",
        "music production",
        "Jonathan & friends",
        "magsafe"
    ],
    "views": 221870,
    "likes": 12848,
    "comments_count": 847,
    "description": "Sometimes you just got to start over. Going over a final office tour of what I'll call 2.0, a look back and heading towards 2021 and v3.0 Music Channel:  Spotify:  Apple Music:   Come hang with me:  iPhone 12 Pro giveaway:  Shirt I'm wearing:   Awesome companies featured in this video.  Vintage King:   OWC:  Aputure:  Artifox:  BDI:  Output:",
    "description_links": [
        "https://youtu.be/3ibKoMJUpsM",
        "https://open.spotify.com/track/1uq2UM...​",
        "https://music.apple.com/us/album/mags...​",
        "https://t.co/zykJIoQhlZ?amp=1",
        "https://twitter.com/tldtoday/status/1369433421005590529",
        "https://dabinmusic.com/collections/all-merch/products/into-the-wild-embroidered-premium-stonewash-tee",
        "https://vintageking.com",
        "https://eshop.macsales.com",
        "https://www.aputure.com",
        "https://theartifox.com",
        "https://bit.ly/3codqBg",
        "https://output.com"
    ],
    "transcript": "(upbeat music) - So there is a lot of history in this room. This was the first space, studio, office, workplace. Really What was the jump from doing YouTube from your bedroom into, okay, this is a real thing. (upbeat music) Before this was even a reality. I remember the catalyst to even look at an office or a space was what we called the iPhone 6 house. I think that kind of opened up everyone's eyes to the notion of what could be doing things together with a team on a bigger scale. So after that, it was like, got to find a place. And when we did, could not afford this place. So naturally we borrowed money, which was really more so of a bet on ourselves to be like, okay, this is for real. For real. I think sitting here and reflecting with everything empty and bare my mind immediately goes back to first getting into here where there was nothing. It was a blank canvas, but within a month or so things kind of aligned to where it was really the first official brand partnership where I did a video with Vizio but the TV they sent was way too small for that wall, like hilariously small. So here's this baby TV on the wall. You got the super sad droopy wire going down to what looks like a Pirate's chest, not the best looking couch in the world, but it's what we had. I was proud of it. And more than anything, holy crap this was working. For me my goal was never to be a YouTuber or an influencer. That word is kind of disgusting but then things accelerate at a rapid pace. You start to get labeled this, guy's a tech reviewer, this guy's a journalist and it's like, Whoa I'm definitely not a journalist. I just want to make cool things take care of the people I care about most of my life and then put some good back into the world. I think when things start to grow and accelerate though when you're in that state the natural reaction is to be like, okay, how do we grow and accelerate this even further, faster and bigger. So you hire people you build a team and that big becomes the norm. I know for me it's always been a challenge to work with a team. And I know from the opposing end that's probably a very frustrating thing because A most of everything is up here and I don't do the best job of elaborating or getting it out. And secondly, I do have a hard time being hands-off not necessarily out of control but just for the love of doing it. On the video side, shooting, editing, lighting, A roll, B roll all the roles. I don't think I could pick one that I enjoyed over the other. I think it's just the notion and concept of making something out of nothing. It's amazing. Now with life much like tech the notion of have you restarted lately sometimes that applies to life. And I think for me, 2020 was that in many ways I think the biggest mental hurdle for me with 2020 was knowing how much of the world was suffering. And then it's like, hey we're people who make videos online. So seeing people out there acting like everything was fine and knowing that, hey we have this make-believe fantasy job. Things are okay. But the world's suffering trying to balance that and not acting like nothing was going on. Then it's the question of like, what is all of this for? You know, like, I don't want a team of 50 or 100 or I don't want to be this giant empire. I just want to again, make cool things take care of the people that I care about most and put some good back into the world. From there. I love video. Like I truly love video. I think I can make a video with a decent amount of crisp but nothing truly makes my brain move and feel the way that music does. Weirdly enough a lot of the times music is what fuels me creatively to make a video. It can dictate the, edit, the flow, the pacing. So I think for me, knowing that music and guitar specifically was my first true creative love. I made that a goal to get back to that. If you've watched the channel for a while, you more than likely have noticed that music has always been sprinkled in, in some form or fashion and more heavily recently if you go way back like the OGs, you probably remember this . (acoustic music) I rightfully got roasted for that look but that's what it was for that era. And I think moving forward now, like I don't think most people knew I played. The reality of that is because I hadn't played really for almost 10 years. So again, I took 2020 as a challenge as a goal to get back into it. Let's practice, let's get better. So you can be in the same room as all these great people that you've worked with over the years. In a wild turn of events because really what was more of an experimental I'm just going to launch this channel to play some music to have some fun maybe do a cover here and there that rapidly evolved into releasing a song that's like out on Spotify and Apple music. The support from you guys has been amazing. And if you haven't checked that out or the channel I'll drop a link down below there's also a giveaway to a brand new iPhone 12 pro. But really I think that's ultimately what kind of propelled all of this. The hard reset. With that hard reset gone is what was the shoe wall. And I think for me that was a huge symbolic cleanse and wipe because when I got into shoes. I'm not someone who likes to party or drink or spend money and go out or I've never wanted a Lamborghini or Ferrari or any stupid stuff like that. But I enjoyed collecting shoes. It quickly became almost toxic, especially in the tech space where it was more about clout and flexing. And I think for me, it was a little bit of self reflection because that wasn't the image I wanted to portray of hey here's this dude just sharing ridiculous amounts of shoes. I don't want that to come off because it was really never about that. Since then I've just tried to simplify everything down to what I use. I'm still on the iPhone 12 mini. My main and only machine right now is an M1 13 inch MacBook pro. I really wanted to get back to the basics and kind show anybody who's out there who wants to do this, that, nah, you don't need the craziest fanciest Mac pro or red or Alexa. Like I'm not shooting on red or Alexa right now. We switched over to the FX9 which has been incredible but I've enjoyed the simplicity. So once the wall came down, I think that was fuel to like Harold and Kumar Pooky. (man shouting) Not to that extent but I think it was just kind of invigorating to just start over. Again those that have followed the channel Kevin Kenson, we worked closely together we're essentially swapping units. A huge bonus for me and I doubt the neighbors watching but the next door neighbor did not like any time I played anything remotely loud like it could be like 6:30 PM. She wasn't having it. So with that swap, I get to start over. I get to build out a music spot and not worrying about pissing off the neighbors. Sorry, if you're watching. - No offense. - That unit is especially cool because of the exposed brick shout out to Brandon Havara dream desk, Ed Sheeran but more so it just allows me to kind of build out a music spot upstairs and that's going to be something that I'm doing over the next, probably one to two months. It's really close now, really I think the foundation and the skeleton of that setup upstairs is there the output desk works really well. I think the goal is to upgrade these Dyn audio to Barefoot which is going to be insane. Honestly, these units are acoustic nightmares with the high ceilings, with all kinds of metal. So over the next one to two months, like I said the goal there is to properly acoustically treat that shout out to vintage King for all the help so far. I can't wait to see what it looks like once it's finished. Again as far as my setup I am only using an M1 13 inch MacBook pro. No Mac pro, no iMac, no 16 inch MacBook pro. That is my machine. Currently with this music setup, I have kind of a floating pro display XDR and I know this is over killing. Tim cook if you are watching, please, please, please, please, please. For the love of tech bring us a monitor that doesn't cost that much because with all the M1 goodness and all the M1 X goodness on the way we need something else. But I have that pair was an OWC four terabyte drive and huge shout out to them. They have been kind of the storage saviors for the past two years for me from their high-end thunder blade to this guy right here and definitely got some cool stuff with them on the way. So stay tuned for that. On the flip side over here, I do have a 5K iMac more as a archival machine, as silly as that sounds to go back to older operating systems and pull back older projects. I think the goal downstairs is to leave it fairly open and to just kind of maybe have a workspace there if needed with an LG Ozer fire. Or again, Tim cook bring us a monitor. I think again, with that exposed brick I want to leave that open towards the corner. I think that makes sense for some sort of top-down station life flat those crisp shots that you've seen here and there at the heart of that top-down setup is the artifacts table which is incredible. I'm going to really put this thing to use both for product shots but I think it could be a wild desk set up as well. And I think for this spot, you know kind of the sky is the limits. I do have a little bit of the TLD Jonathan flare with that cable less floating TV rest and peace home pods. Back here I think would be sick to throw some arcade cabinets and really kind of get the Kevin Kenson gaming vibe going. Over here We got Stevie's Mac pro station with the plant. And since I'm all M1 and not using any of that he gets to reap the benefits. Next to that we've got Travis on the M1 16 gig Mac mini and that has been a game changer for us. And I think finally in this corner that's a similar kind of permanent or semi-permanent top-down life flat station where it's just ready to go to grab product shots. But also kind of goes hand in hand with that floating TV is a darker color of the table from artifacts. So that's going to kind of be the central hub as things kind of get back to a little more of the normal we're used to, but definitely stay appealed for updates to not only this space but for obviously my vision over there which is going to be a ton of fun. From there I think my core message is for those that have continued to ride with me. I appreciate you if you want to continue doing so amazing. If not, that's all good. Like if you're not into me voicing my opinion on politics or life or you're not happy with the content that I make, that's fine. If you want to go. I think for me along the lines over the past couple of years, it was that mental decision of, okay do I want to make things that make me happy and I enjoy or don't want to chase the clicks. Part of the whole Apple angle that I think drove me personally crazy is at a certain point I think people who weren't truly into it or used it they were pressured into doing coverage on it for the clicks and the views. If that's your thing and that's what you want to do, I respect it. But again, for me, my goal here is to make cool stuff to take care of the people that I care about most and then put some good back into the world. I appreciate you guys watching, stay tuned for a lot of fun stuff coming soon. And I will catch you guys later. (soft upbeat music)",
    "transcript_keywords": [
        "kind",
        "back",
        "things",
        "make",
        "make cool things",
        "people",
        "music",
        "things kind",
        "pro",
        "Mac pro",
        "goal",
        "video",
        "good back",
        "make cool",
        "world",
        "care",
        "thing",
        "life",
        "Mac",
        "cool things"
    ],
    "transcript_entity_values": [
        "one to two months",
        "5",
        "secondly",
        "100",
        "M1 X",
        "iPhone",
        "2020",
        "K iMac",
        "Stevie",
        "M1 13",
        "the past two years",
        "Vizio",
        "Pirate",
        "6:30 PM",
        "the years",
        "Alexa",
        "Kumar Pooky",
        "Apple",
        "the next one to two months",
        "Travis",
        "a month",
        "LG Ozer",
        "Tim",
        "a ton",
        "XDR",
        "YouTuber",
        "50",
        "Spotify",
        "iMac",
        "M1",
        "Ferrari",
        "first",
        "Ed Sheeran",
        "12",
        "almost 10 years",
        "MacBook pro",
        "Alexa",
        "Harold",
        "Lamborghini",
        "OWC",
        "YouTube",
        "Brandon Havara dream",
        "the past couple of years",
        "Kevin Kenson",
        "Jonathan",
        "Mac"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG"
    ]
}