{
    "id": "oOwpzx4hZuc",
    "title": "Why Are Phones All The Same Shape?",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-10-12T19:42:32Z",
    "video_url": "https://www.youtube.com/watch?v=oOwpzx4hZuc",
    "category": "Science & Technology",
    "tags": [],
    "views": 326413,
    "likes": 18904,
    "comments_count": 899,
    "description": "Learn through problem-solving, and the first 200 people can save 20% today on Brilliant at   Why are phones virtually all rectangular instead of some other shape?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://brilliant.org/Techquickie/",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Phones that flip. Phones that slide. Phones that have a full keyboard on the inside. It feels like it wasn't long ago that we had phones in all shapes and sizes. But with the exception of recent foldable phones, and other things that mostly feel like gimmicks, these days, they're all flat candy bar shape. But why? Well, back in the day when they were all shapes and sizes, our phones didn't really do as much. It was mostly calls, texts, and impressing your friends with your cool new ringtone. So for these use cases, it was a no brainer what to put on a phone: a small screen to handle the user interface, and a physical keypad, since you'd be constantly punching in numbers. Of course, phones like the BlackBerry had full-on QWERTY keyboards to make texting and emailing easier, but the screen itself was still rather limited in functionality. The point here is that a small screen and lots of actual buttons made sense on every phone, and as long as you had these two things, there wasn't necessarily a standard way to arrange them, hence the very large variety of phone layouts that we saw. I had a Kibo. Then, of course, the iPhone came along in 2007, and it helped set a trend. It wasn't the first smartphone, but it put the idea in the mind of the public that the phone should actually be a hyper-flexible device, that it shouldn't be limited by things like hinges and sliders or buttons. Instead, it opted for a design that was mostly a touchscreen, so it could adapt to whichever app the user was running, and a large screen makes it harder to incorporate tons of physical bells and whistles, as you need one big slab that can hold the entire display. And if you have a do-it-all device, you also need a lot more battery life than you did in the days where the most power-draining activity you could do was to have a long phone conversation. This necessitates a larger physical battery, which limits how the phone can be shaped. If you take a look inside just about any modern smartphone, you'll see a standardized rectangular lithium ion or lithium polymer battery that takes up a significant amount of space inside. On top of that, making phones physically complicated makes them more likely to fail. This could be seen in everything from slide-out keyboards to more modern foldable phones. And, as important as smartphones have become for daily life, this is a big deal, with most phone makers advertising toughness and durability, with ever-stronger screen glasses and impressive water resistance ratings. Phones get sold based on hardiness, speed, and camera quality, none of which require a phone maker to push some crazy new form factor. I mean, it's a lot easier to just point the back of your phone at something to take a picture than to have an extra part, like a pop-up lens. (phone whirring) At most, manufacturers might try and make a new device thin and elegant, so there's a high demand for the premium-feeling phones, or they make minor tweaks, such as a screen that wraps slightly around the edge of the chassis. And with all the high-end processors and camera lenses inside modern phones, it's very important to make sure the phone is tough enough to protect the sensitive innards, a goal that's most easily achieved by simple designs instead of weak hinges and physical buttons that could serve as ingress points for water and debris. And, of course, even the most innovative manufacturers copy each other. In the constant struggle to appear trendy and bleeding edge, it's difficult for a company to put out a new form factor that customers simply don't associate with high-end. Basically, if it doesn't really look like an iPhone, then it's kind of this wacky other thing. Though, of course, someone has to be the trendsetter, so maybe one day, instead of just settling for rectangular devices, we'll have a perfectly round phone that can double as a coaster. Big thanks to Brilliant for sponsoring this video. If you're a student, a professional, or just someone who wants to understand the world better, check out Brilliant, the website that helps you reach your learning goals by working just a little bit every day. Brilliant offers interactive explorations and a mobile app to help you master concepts in math, science, and computer science. The course takes complex concepts and breaks them up into bite-sized chunks, and over time you will be amazed at what you can accomplish. We suggest checking out their Mathematical Fundamentals course, which has been redesigned with interactive features to help you with the foundational concepts behind algebra, number theory, and logic, which makes it a great resource for STEM students. The first 200 people who head to brilliant.org/techquickie will get 20% off an annual premium subscription, so go. But before you go, thank you for watching, and be sure to hit Like, subscribe, and go to the comments section and give us an idea for a topic that we should cover in the future.",
    "transcript_keywords": [
        "Phones",
        "phone",
        "screen",
        "make",
        "foldable phones",
        "physical",
        "inside",
        "Brilliant",
        "makes",
        "day",
        "small screen",
        "things",
        "device",
        "long",
        "inside modern phones",
        "put",
        "buttons",
        "battery",
        "modern",
        "big"
    ],
    "transcript_entity_values": [
        "iPhone",
        "Mathematical Fundamentals",
        "Kibo",
        "the days",
        "one day",
        "annual",
        "the day",
        "2007",
        "first",
        "QWERTY",
        "these days",
        "200",
        "two",
        "one",
        "20%",
        "BlackBerry"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "FAC",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG"
    ]
}