{
    "id": "OpS43PUgVt0",
    "title": "The biggest sensor ever?! - Nexigo Iris 4K",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-09-14T20:00:31Z",
    "video_url": "https://www.youtube.com/watch?v=OpS43PUgVt0",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "Webcam",
        "conference cam"
    ],
    "views": 293098,
    "likes": 12260,
    "comments_count": 381,
    "description": "Thanks to NexiGo for sponsoring this video! You can purchase the NexiGo Iris 4K Webcam at the link here:   NexiGo's sent us their new Iris 4K webcam for Riley to check out. It has a large 1/1.8-inch Sony STARVIS Sensor - the biggest sensor ever in a webcam.  Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 0:37 Unwrapping the Iris 1:00 Iris walk-around 4:00 A remote?! 4:30 First impressions on image quality 5:16 Microphone test 5:28 PiP mode ft. future Riley 7:07 Past Riley testing Dynamic Range 8:57 Testing different scenes 9:47 HDMI connection and low-light mode 11:32 Auto-track and Auto-framing 12:05 Overall thoughts 12:43 Conclusion",
    "description_links": [
        "https://viraln.link/LTTxIris",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Welcome to the most abstract ShortCircuit yet, we are unboxing... Nothing. Last time I unboxed a webcam on this freaking channel, it was a big old chunky boy. I'll tell you that much, but guess what? The same company NexiGo is back with an even bigger chunky boy, actually I don't know if the actual webcam itself is as chunky, but the sensor is the biggest sensor ever on a webcam. I'm talking about... (Riley taps the table and clap) hit me. Thank you. The Nexigain no (laughing) (beep) Whoa. The NexiGo IRIS 4K Webcam. And guess why it's in this bubble wrap because it's so early, it's not even out yet at the time of shooting this video. Is it gonna be out when the video comes out? - [Bell] Yes. - Yes, but they didn't... they don't even have packaging when they sent it to us because it was so early. I feel special. So I'm gonna take a look. Wow. Ah... It was, that's kind of creepy on the front, but they're alright. This is big. Now one thing I'll say right away is that on the last NexiGo webcam video I did, people pointed out multiple times in the comments. Thank you. That it was a conference call webcam. It's for like a work situation and not so much for personal although you could use it for personal. And I was treating it a bit more as it, like, it was like a personal item. So this time around, I know what this is for. And it has particular features that will make it even more interesting for that type of work scenario. But as they say in their materials, you can use it for personal stuff as well. What did I just take off? The privacy screen. That gives me like Illuminati vibes. - [Brandon] Sauron. - (chuckle) I have Sauron. It's not as refined a solution as I saw on the other one. That was like a bit more satisfying, where it had a little flippy thing that you could flip up. But that one was also more of like a, like, we didn't have these curved edges on the sides here. Are you seeing this? That's an interesting side profile. As I said, this has the biggest sensor ever in a webcam, according to NexiGo. I don't know. Maybe there's another model out there somewhere that we're not aware of. But at the time of filming, NexiGo claims that this is the only webcam out there with this large one to one 8 inch Sony STARVIS Sensor. So that's exciting. It can do uncompressed 4K video apparently, if you use the HDMI port on the back. But we'll get there. Okay. So on the front you got the lens. Cool. I'm guessing these are mics and there's another little hole there. What's the extra little hole, Jake? But NexiGo says these are dual omnidirectional mics. So you'll be able to tell if there's a monster behind you? On this side, we got it looks like vents, but I don't think they are. I think that's just design. Oh no, there are some little holes in there. So they are vents. On the front, we got just real smooth for your pleasure. (chuckle) On the bottom, we have a mounting point for the attachment that I'm going to put on there. Some screws. And on the back we have this HDMI port that I said could do uncompressed 4K video. So that's gonna be interesting. As well as a USB 3.0 port, if you're plugging that into just a, just an older machine in your, in your company's conference room that doesn't have HDMI? That doesn't make any sense. If I had the box with me, here's what else would be in the box. Another thick boy. Remember that the last, the last cord was thick as well. A USBC USB type A to type... whatever this is. I forget it. What it is, it's a B or something. And how long is it? - [Bell] Uh... 3 meters. (chuckle) - Oh, you know, it's 3 meters. I mean we gonna have to - [Bell] Banana. - Oh you want me to banana it? And so there you go. There's the scale. That's how big it is compared to a short circuit banana. So this is a 3 meter USBC USB cord. I keep saying USBC USB 3.0. Yep, seems right. Also in the box would, would be a remote. This one, if I'm not mistaken, looks different than the one that we unboxed with the last model, but it looks like there are some of the similar some similar features and some new ones. We'll take a look at that. Okay. Well, I love hanging out with webcams that aren't plugged into anything as much as the next guy, but I think we should plug it in and see how she goes. Okay. Am I right? But vote. It's unanimous. (chuckle) Okay. So here we are. We, we plugged in the webcam into our recording laptop using USB 3.0, we're gonna start out with that to see how the quality is compared to the uncompressed 4K video that we can get off of the HDMI port. And right off the bat, this looks pretty good. I'm complaining a little bit about the highlights of my forehead. That could just be my forehead. That's just how it looks sometimes. Don't judge me. But if you weren't happy with it, we're gonna use the remote here to change the setting. So the cool thing about these conference webcams is that all the settings are built in and retained in the webcam. You can set it up in one room and then move it to a different room and plug it into a different computer and not worry about drivers and software and all that stuff. It should just work. That seems a bit better to me. I'm liking that black level. Flicker, We're compensating for 60 Hertz, 50 Hertz. Okay. You can do 60 or 50 or off. Wahoo weee. It's now later in time. And guess what? NexiGo sent us an Iris model from the production line instead of the pre-production line. So now picture and picture is working. So we get to check it out. I feel so privileged. Before this button was doing something else on the pre-production model but now this button does auto tra auto framing. And this one does picture and picture and I've activated it. Look, there I am. It's like a little mini me. Good job, buddy. (chuckles) So the cool thing about this feature is that if you're presenting in your corporate boardroom settings, we all know the place. If this is my board, like, say I have a really important presentation, like, it's a TechLonger video. Remember those? Pretend I have a presentation here. I can zoom in with the Zoom zoom. And now they're everyone in the Zoom call is, is looking at my wondrous handwriting while I can be over here and be like, see you guys, I'm gonna go over this way. Do do, do, do do. It's cutting the... Okay, one minor complaint. It's it wants to cut off the top of my head. Or maybe that's just because there's a threshold for it to move. And then I can... No, see? I'm trying to I'm trying to frame it properly and it's like, no, no, no, come get, get away from that. Yeah. And when you're done with that then you just press the, the button again. Boom auto framing, turn it off and we're back to normal. That's pretty cool. I would definitely use that to achieve synergy in uh... between the Q2 and Q3 uh... numbers. Now back to a previous Riley that we've seen before. Dynamic range, now, this is interesting. This should be like the amount of colors, the the color range that you can have. And when you go to zero, you can definitely see that things are a bit more muted. And as we go up, we're getting more detail. But I definitely don't like how it looks. Oh, I remember now. So last time I did this, when I moved my hands around I can see, you can see the black shadow behind my hand. 'Cause I think it doesn't quite, it's trying to show too many colors at the high dynamic range level. So let's go down to, let's go, let's keep the like five. Still got a little bit of that shadow situation down on my hand here, but I like that. So there's your dynamic range option. And this camera is capable of HDR and it's also capable of What's 3D noise reduction? Okay. So noise reduction, 2D noise reduction, 3D. This is gonna be another situation where people in the comments maybe know exactly what the difference is between 3D and 2D noise reduction. Here's a tech tip for you. 2D noise reduction apparently looks at basically just the single frame and tries to, it's like a photo situation where it's like reducing noise in the single frame. In 3D noise reduction, it's, it's using subsequent frames as well to... It's it's using more data basically to reduce the noise. So let's go back and play around with that. So the downside to 3D noise reduction is that at high levels, you're apparently gonna get some blurriness. So that's, actually, I'm seeing that. Yeah. As I put that up, I'm looking a little bit smoother a little bit too smooth for my tastes. I like thing... I like to be a little more jaggy. Thank you. The other big feature that I wanted to talk about was, Well, first of all, the different scenes. So this button right in the middle of the remote, that switches between different modes, such as low-light mode, which in their demo pictures, they were using for, like, more of a dramatic situation. If we, like, had one key light and then shadow of like, if you're, if, if Brandon was like lighting for a movie, that's what this is for. It's dramatic. It's cool. You're like, I know about film. Conference mode. It's all business. Okay? You're wearing your business socks. No jokes allowed. (chuckle) Streaming mode. Okay. I guess, I guess it cuts in, I'm not sure exactly what this is doing to the different presets. I'm assuming that it's doing something other than just kind of reframing things. Okay. We wanna check out the low-light performance, but I think that might work the best with uncompressed 4K video. What do you think? So we're gonna switch to the HDMI connection and see how that goes. Ready? Go. Okay. So here we are. We plugged in the HDMI cord. You tell me if this looks any different because it looks about the same to me and, moreover, I don't really have a way we, we checked in the menu. We don't really have a way of determining whether we're actually recording it, like an uncompressed thing anymore. But we're using the HDMI and maybe it's a fail safe looks pretty good to me. Oh, and the one thing we wanted to check out here is the low-light performance because there is a low-light compensation mode. So Brandon, hit the lights. I mean, it looks pretty good. Exposure. Okay. Backlight. Oh, I could've turned the backlight compensation on. Oh, dynamic range. Turn it up. Ah, and this is where the dynamic range comes in handy because now we're getting quite a bit of brightness even in the dark situation. I mean, like, you can tell that this is not like my natural skin situation. But when I turn it all the way down, you know, you can see that if you have it at a sort of a high level. That's not too bad for a backlight compensation gain limit. Oh. And here's where the gain limit comes in. When the, when it was bright in here, I was turning the gain limit up and nothing was really was happening and it's frozen. But in a low light situation, if you up the gain limit, then it's it's giving the system more resources that it can use to up the brightness, which is great. Okay. So like, this is now we're at a low light situation. The lights are very dim and you know, this is this doesn't look amazing as it would if all the lights were on, obviously. But I think this is more than passable, if I wanted to do like a conference call for business. AutoTrack on. Oh yeah. Here's what we're talking about. Okay. So like the nine N970P could also do this, but I think this one this one apparently has an AI chip embedded. I think I'm seeing a little bit more responsiveness as I move around. At our company, we care a lot about corporate synergy and quarterly earnings, which is why I've brought you over to our company shelf and our prize banana tree. (chuckles) Okay. Honestly, I'm, I'm pretty impressed with even just the changes that this makes over the last webcam from NexiGo that we covered on ShortCircuit, The colors, I'm a little bit more happy with. The auto framing, The AI is able to track me. Very well. We've got some low light situation. We got some onboard AI processing. The menu makes a little bit more sense to me this time around but maybe that's just because I'm familiar with it. But for $250, there's a lot of features packed in here that, you know, you have to determine for yourself whether that's worth it for you but not a bad price for something very advanced. NexiGo. Thanks for sponsoring this video. And uh... That's it. And thank you for watching this video. Subscribe to ShortCircuit, if you wanna see more on boxings and just people playing around having some fun together. If you wanna watch another webcam video? Watch the other one I did. What?!",
    "transcript_keywords": [
        "webcam",
        "bit",
        "video",
        "HDMI",
        "noise reduction",
        "situation",
        "NexiGo",
        "noise",
        "USBC USB",
        "time",
        "thing",
        "USB",
        "HDMI port",
        "reduction",
        "webcam video",
        "NexiGo webcam video",
        "back",
        "Dynamic range",
        "range",
        "light situation"
    ],
    "transcript_entity_values": [
        "USBC",
        "Nexigain",
        "webcam",
        "Jake",
        "Hertz",
        "250",
        "IRIS 4K Webcam",
        "4",
        "one 8 inch",
        "USB",
        "60",
        "Riley",
        "one",
        "3D",
        "quarterly",
        "nine",
        "AI",
        "Q3",
        "3 meter",
        "Sony STARVIS Sensor",
        "50",
        "Iris",
        "Q2",
        "Brandon",
        "Sauron",
        "first",
        "HDMI",
        "Streaming",
        "TechLonger",
        "Illuminati",
        "ShortCircuit",
        "3 meters",
        "five",
        "Brandon] Sauron",
        "zero"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "MONEY",
        "LAW",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "NORP",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL"
    ]
}