{
    "id": "oQgaEL8gn3Q",
    "title": "Is the Surface Laptop Too Expensive?!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-06-02T19:35:30Z",
    "video_url": "https://www.youtube.com/watch?v=oQgaEL8gn3Q",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Microsoft",
        "Surface",
        "Laptop",
        "4 GB Ram",
        "Surface Pro",
        "Surface Pro 5",
        "Surface 4",
        "XPS 13",
        "Razer Blade Stealth",
        "Lenovo Yoga",
        "The best surface",
        "Surface book vs",
        "Versus"
    ],
    "views": 738876,
    "likes": 15361,
    "comments_count": 1320,
    "description": "Surface Laptop review is coming soon but first .. is the Surface Laptop Worth it? Purchase Here -   Be sure to check out my other ultrabook reviews: XPS 13 -  Razer Blade Stealth -   Music Credits: Background: Fili - Up Coast  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2pP8NJB",
        "https://youtu.be/ZRmRamdNFHg",
        "https://youtu.be/GXRLOEeSC9Q",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey! how's it going Dave [2d] here? And this is a video [on] the surface laptop and whether or not it's overpriced So when the thing launched I think a lot of people were very excited about it because it looks really cool but then when the price was revealed people were Disappointed because it seemed a little bit more expensive than it should have been now It's a surface device so the whole surface product line has always been a little bit more expensive It's a more premium product line So it's to be expected [now] if you take a look at the build quality the exterior build quality is fantastic I would say that the fit and finish of this thing is comparable to the macbooks It's a better finish than the XPs 13. It's a better finish than the razer blade stealth better than HP lenovo it literally has the best build quality in any windows laptop that I've seen to date for this 13-inch screen size the Hinge feels well tuned and it's durable you can open the lid with one hand really easily and it has this really Satisfying snap when it closes shut the exhaust is well machined it feels really precise and the whole device is made from aluminum Not magnesium like some other surface products the interior build quality is different. It's good It's just not as impressive to me the material here the Alcantara it feels awesome It's really nice to hold and the material is adhered to the laptop [really] well I tried to pick at it to see if I could peel it off It is stuck down really well, but like I mentioned in my previous video We'll have to see how well it holds up over time it does feel slightly different from the Alcantara Surface Pro keyboard So maybe it's more resistant to wear and tear The keyboard itself feels good. It's not perfect to me. There's some flex on a keyboard deck that it didn't expect to be there It's supposed to have a unibody construction, so I thought would just feel a little more rigid to be clear I do enjoy typing on it It's just the build quality is not as good as the exterior the trackpad is also really nice glass surface precision drivers I mean surface track pads are always done well and this one's on point as expected now the Trackpad and typing experience feel oddly similar to the surface pro experience And that's weird right because a surface pro is a type pad cover and the surface laptop is a regular fold-out laptop keyboard It's good it's just not as good as I was hoping to be and in terms of the operating system windows 10s like the [gimped] version of Windows 10 If you're watching this video obviously you're somewhat enthusiastic about technology, and if you are windows 10s is not for you now Don't hate on it. I think [10s] is going to have some great benefits for certain users It's just that it's not for you. You should probably do that free upgrade to Windows 10 pro. The screen is good I brought a spider there to get some readings on the panel It's not a controlled environment, but color accuracy seemed pretty good often double check these numbers in my full review the webcam supports windows Hello So you can log in with your face and the image quality isn't bad The drive speeds are not as I expected [so] during the presentation they mentioned that they were using onboard ssd So ssds that were baked right into the motherboard to provide better power efficiency and better speeds They're using Toshiba drives And they are pretty powerful especially for the smaller drive read speeds aren't bad the small capacity drives are slower But the right speeds these numbers are disappointing to say the least that 128 gig drive in particular I wasn't able to try all the different configurations. So some of those numbers are pulled from Toshiba Spec sheet It's not that the right speeds are super terrible It's just that for a device that's launching in miD-2017 you want something a little bit faster I was just hoping for something a little bit faster now This laptop is obviously not designed for everyone there are plenty of laptops out there that are geared for everyone This thing is not It's geared for someone who's looking for really good build quality and a unique aesthetic, and I think in that front they've nailed it But the question is whether or not it's worth it and this is where I could look confusing Microsoft launched this thing at the base model for $1000 which on paper Thousand dollars for a brand new Microsoft surface laptop doesn't [seem] [that] bad and then you look at the specs and then you're like Wtf this seems really expensive when you compare this thousand dollar base model to the competitors is just not a compelling purchase It's made well, and it looks super cool But the specs aren't there and the other thing Unless you have a really undemanding workflow four gigs of ram and 128 gigs of storage is going to feel Anemic to say the least the Mid Tier model priced at [$1,300] That's a good one And I think Microsoft knows this that's the one that's going to sell the best because that's the one they have all the different colors For and it's priced the most competitively when you compare pricing for [that] one. There's still a premium to be paid for them I soft surface branding, but it's more comparable value to its competitors and at that configuration I think it is worth it because you're getting Ridiculously good build quality and if you happen to have an educational discount it gets even better Now in terms of the I7 models I mean, they're better performers, but I just don't think they have as good of a value at that mid to your model Hope you guys enjoyed this video I'll [be] doing a full review But hope because of this video you guys have a better understanding of why surface laptops are priced the way They are thumbs we like this video subs if you loved it. See you guys next time",
    "transcript_keywords": [
        "build quality",
        "good build quality",
        "Microsoft surface laptop",
        "quality",
        "surface",
        "surface laptop",
        "good",
        "build",
        "Ridiculously good build",
        "good build",
        "windows",
        "laptop",
        "surface product line",
        "video",
        "exterior build quality",
        "thing",
        "speeds",
        "windows laptop",
        "product line",
        "bit"
    ],
    "transcript_entity_values": [
        "Mid Tier",
        "1000",
        "Microsoft",
        "10s",
        "Dave",
        "HP",
        "Windows 10",
        "thousand dollar",
        "Hinge",
        "I7",
        "128",
        "Toshiba Spec",
        "webcam",
        "1,300",
        "Toshiba",
        "13-inch",
        "four",
        "the Alcantara Surface Pro",
        "Alcantara",
        "13",
        "Trackpad",
        "Thousand dollars"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "MONEY"
    ]
}