{
    "id": "oqjWnA7J0f0",
    "title": "AFTER 13 YEARS... I finally tried an Apple iPhone 15 Pro.",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2024-01-17T18:52:06Z",
    "video_url": "https://www.youtube.com/watch?v=oqjWnA7J0f0",
    "category": "Howto & Style",
    "tags": [
        "Apple iPhone",
        "Apple",
        "iPhone",
        "iPhone 15 Pro",
        "iPhone 15 Pro Max",
        "Apple Vs android",
        "android",
        "Samsung",
        "Titanium iPhone",
        "Apple Vision Pro",
        "Vision Pro"
    ],
    "views": 3829791,
    "likes": 174891,
    "comments_count": 33446,
    "description": "I finally tried an iPhone. Does Apple beat android for me personally? Get a Teardown skin for your own phone HERE:  I've been an Android user for 13 years. But the new Titanium Apple iPhone tempted me enough to try it out. For over 100 days I gave the iPhone a solid shot at becoming my new daily driver. But... well... I don't thing the iPhone is built for me. There are a few features on Android that I just cannot live without.   Its ok though Apple... we can still be friends.",
    "description_links": [
        "https://www.dbrand.com/teardown"
    ],
    "transcript": "For the last 13 years I've been an Android user, but for the past 100 days I've separated myself from the Android universe and started using an iPhone 15 Pro Titanium. And the experience overall has been okay. I've consolidated my experience into 3 things that I like, 7 things that are iffy, and 3 things that are absolute deal breakers for me while using an iPhone. Deal breaker so large I cannot continue this experiment and I am happily switching back to Android. My mom says that if I can't say anything nice then I shouldn't say anything at all. So I'm going to start with the 3 things that I've really enjoyed about using an iPhone. Remember, I'm not much of an opinion person. Normally I just deal with facts here on my channel, like the Mohs scale of hardness, material, science, construction, you know, building things. But today is going to be more of my opinions and thoughts on the iPhone experience. And if my opinion differs from yours, that's totally fine. With that out of the way, 3 things that I really enjoy about the iPhone. The first of which is FaceTime. Absolutely seamless experience, exceptional call quality, and I can do it anywhere at any time with anyone else who has an iPhone. With just the press of a button it works. Number 2 is the flashlight, surprisingly. The flashlight has different strength levels. I can make it bright and dim it down, which is great. My Note 10 Plus that I've been using for the past 4 years cannot do that trick. And finally, the 3rd thing that I've really enjoyed about the iPhone is the Face Unlock. I honestly don't even remember it's there half the time. It is so effortlessly fast, 99% of the time I just forget about it entirely. 10 out of 10. Now that the niceties are out of the way, let's get into the things that were a little bit more annoying, some of the minor grievances that I've had along the way. There's 7 of these and they get slightly progressively more annoying as we go along. When it comes to the green and blue bubbles thing, I really don't understand what's going on. To be honest, even after having used this iPhone for 3 months, I couldn't tell you who's green and who's blue. Personally, I would rather just text people without having my color palette disturbed and not knowing what color is going to present itself every time I open up my messaging app. And you would think that with Apple being so inclusive lately, they would stop being so divisive when it comes to the colors of the text messages. As a temporary iPhone user, I didn't see any benefit and I see it as just more of a distraction overall. Minor grievance. Also, sometimes the phone just does random stuff that I don't ask it to do. For example, if you type in happy birthday into a text message, the whole screen just kind of erupts into an animation. Call me old fashioned, I can probably turn this off, but it's not something I want to have happen. There's some slightly interesting features like invisible link and stuff that's just fun of course, but not things that I would personally be using on a regular basis. For me, my phone is a tool and not a toy. And this feature is kind of a distraction from, I guess, the way I use my phone. It's just a little jarring when the phone does something you're not expecting it to do. Something slightly more annoying is when I want to know what the date is with the iPhone. I have to slide the notification bar, the top bar next to the dynamic island, all the way down to the bottom 5 whole inches before the date appears on screen. With Android, I can just slide down a centimeter and there it is. It just takes slightly more effort to accomplish something on the iPhone than the Android. Once again, both phones do have the date on the lock screen, so if the phone is off they're the same. But it just takes slightly more effort to get something done with iPhone. Something I haven't gotten quite used to is that there is no back button on the iPhone. The back button is not consistent across all the apps and this is a bit harder to show. With my Android phone, the back button is just consistently here in the bottom corner. It never moves for any app or any menu. But with my iPhone, let's say we have Twitter, the back button is up here in the left corner, about 5 inches away from where I want it to be. And if we jump in here to Instagram stories, the back button is over on the right. And some people might say, oh just swipe down or left or right, but that's not consistent either. If we go over here into the YouTube app, after I've clicked on a video I can't swipe left or right. I have to swipe down to back out of a full video. But swiping down in other apps can be a refresh or it can do nothing at all. Like if we're here in YouTube shorts, swiping down doesn't get out of the app at all. And then we have to swipe left or right, hit the home button. It's just, it changes across every single app that's on the iPhone. I have to fruit ninja my way around the operating system where with Android there's one button in the same place all the time and it just works. Speaking of just taking longer to get things done on an iPhone, if I want to get into the headphones, there's no easy way to get into the settings. Like with Android if I just swipe down instantly the settings are available, the little gear icon and I can just jump into there to change Wi-Fi or Bluetooth. But with the iPhone I have to actually swipe over, find the settings app and then jump into it. Several more clicks to accomplish the same thing that happens almost instantly on Android. Again, these are not deal breakers, just minor grievances that add up over time. Maybe I'm just not familiar enough with the iPhone yet. I am a new user to this interface, but I feel like I'm decently good at technology and it's taken me longer to get things done over here. Let's go in here to the phone dialer. So if I'm here on the keypad with the iPhone, if I start spelling someone's name, like what's the point of having letters on the keypad if I can't start spelling someone's name? With iPhone I would have to go into the contacts, which is an additional click, and then click, search and then search for the person's name, unless they're in like my favorites. But I have a lot of favorites so that doesn't make sense. If I open up my Android phone I have the same numbers with the same letters and I can start spelling someone's name, T-A-Y, and a phone number appears, a name appears, and everything is just instantly ready to go with just a few clicks. And my final minor inconvenience before we get into the deal breakers is again, once again, taking longer to get things done. Let's say I want to write a message, hello, it's me. If I want to change any of these letters inside of this thing, if I try to like, let's say I want to change the E and I try to get my cursor in the middle of that word, not happening. I have to hold down long press and then drag the cursor where I want it. That's like three additional steps. Where if I was on Android I can just take my cursor and tap anywhere and the cursor automatically goes into the word. So there's no long presses, there's no additional steps. It's just one click and done. I think you're kind of noticing a theme throughout all of this. I can get more done faster with Android than I can with iPhone so far. I know it sounds petty, but my phone is a tool. I use it a lot and each of these little tiny clicks, these little gestures, these swipes, they all add up to additional time throughout the day, time I don't want to spend looking at my phone. Let me get into the deal breakers. There are three of these and they're the reason why I'm returning to Android and never looking back. We'll count backwards this time starting with number three. The iPhone does not have any fail safes to compensate for my own incompetence. And let me explain. Last night when I got into bed at 1am I set my alarm for 8am the next morning. But in my tired state and my mind that wasn't quite functioning correctly, I accidentally set my alarm for 8pm, which was actually 19 hours away and I totally slept in. On Android though, if I set my alarm at night it throws up a little on screen message saying hey you have 13 hours of sleep. And I would know instantly if I set my alarm for the wrong time without even having to think about it. I know I'm not going to sleep for 19 hours and something's wrong. It's a fail safe. A safety factor. Something that keeps me from messing up. The iPhone doesn't have it. The Android does with less clicks. Also, if I'm ever plugging in my Android phone it kind of does the same thing with the charger. I can plug it into the bottom, turn off my phone, and then it tells me down at the bottom I have 27 minutes left until it's full. Just a little more tidbit little piece of information that I enjoy having that the iPhone doesn't give me. Major deal breaker number 2 is Gmail. I feel like Apple is kind of throttling Google services. It might be my imagination. There might be some rivalry going on. But the notifications and the way I can answer emails on iPhone isn't sufficient. With my Android phone I can almost read the entire email from the text message. This is from one of my engineers over at my off-road wheelchair company. I can see the entire email. Decide if I want to click in and respond or just leave it unread so I know I have to go back and respond later. If it's unread in my inbox I know I have to read it and respond. However, with iPhone if we drop down and look at the notification I can only see maybe the who it's from in the first sentence. Which isn't very helpful. And if I click into it it marks it as read with no option to mark it as unread in the inbox. So I have to put a star next to it or something which isn't as efficient as just leaving it unread. It's my quick and dirty way of making sure that I stay on top of important emails and maybe there's a better way of doing it. It's just the way that I do it and it works much better with Android since I can read my emails while still leaving them unread for when I actually sit down on my computer again. And finally, number one. The final and largest reason that I cannot continue using an iPhone is this. I cannot schedule a text message with an iPhone. And for you iPhone users, let me explain what you're missing. Let's say it's late at night and I think it's something I want to tell someone but it's late at night and it's not socially acceptable to be calling or texting. I can schedule a text message to arrive the next morning when they're actually awake and then I don't have to think about that message or that thought that I was going to tell them until the morning it's already gone out of my head and I can use my brain cells because there's few of them for something else. And that scheduled text message will just sit in the thread until the phone sends it by itself when the time comes. It's like when I was building my bunker and I needed to text the excavator something about the job. It would be unprofessional of me to text them after hours when they're not getting paid. So I can schedule a text message to arrive when they're on the clock. Also, like I said earlier, I manufacture my own wheelchairs and as a boss I should not be texting people when they're not getting paid so I can schedule my good ideas that I have in the afternoon or evening to arrive at my guys' phones in the morning so one, they're thinking about it, two, they don't forget about it, and three, so they're actually getting paid when they're thinking about work. Don't let your boss text you after hours. Scheduling text messages is such an efficient life hack, it is unreal and I cannot live my life without that feature. Plus, when people respond and text back, it's almost as if they text me first, Which is always nice. When I was using this phone I would schedule text messages every single day and with the iPhone I just can't even. My Android phone is a round the clock personal assistant. While my iPhone does work, it just takes more work to do the things that I want to do. So it's not worth it for me. Now I have heard from people around me that if you delve deeper into Apple's ecosystem, you know, buy an iPad, buy a MacBook, and buy everything that, you know, Apple does a really good job of working together. But I'm not about to drop $5,000 on a laptop just to test that theory out. So I am switching back to Android and I've been looking forward to it for a very long time. I gave iPhone a valid shot. I really did. After 13 years, seeing what they had, I decided, you know, it's just not for me. It probably works great for a lot of people and that's okay. I'm switching for the first time to a folding Android phone, the Galaxy Flip 5 from Samsung. Honestly, I don't think it's going to survive my lifestyle. We have a little farm here at the house. I do construction. I'm around metal shavings a lot. I don't think a fragile center screen is going to live. I say I give it 5 months. Let me know what you think about this whole Android iPhone thing. What phone do you use? And do the things that bother me about the iPhone bother you? I'm curious. And maybe I was doing something wrong. I don't know. Let me know down in the comments. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Pro Titanium",
        "iPhone",
        "Android",
        "Android phone",
        "Android iPhone thing",
        "phone",
        "things",
        "text",
        "time",
        "text message",
        "back",
        "message",
        "back button",
        "thing",
        "Android universe",
        "button",
        "folding Android phone",
        "Titanium",
        "Pro",
        "deal"
    ],
    "transcript_entity_values": [
        "13 hours",
        "evening",
        "3 months",
        "hours",
        "3rd",
        "Google",
        "iPhone",
        "Last night",
        "Pro Titanium",
        "every single day",
        "MacBook",
        "19 hours",
        "Instagram",
        "two",
        "Wi-Fi",
        "YouTube",
        "three",
        "FaceTime",
        "99%",
        "the last 13 years",
        "the past 100 days",
        "the day",
        "afternoon",
        "half",
        "the past 4 years",
        "5,000",
        "10",
        "iPad",
        "the next morning",
        "27 minutes",
        "Apple",
        "the morning",
        "a centimeter",
        "first",
        "Gmail",
        "Samsung",
        "today",
        "5 whole inches",
        "8pm",
        "Android",
        "8am the next morning",
        "3",
        "Android iPhone",
        "YouTube",
        "the Face Unlock",
        "about 5 inches",
        "13 years",
        "one",
        "7",
        "Twitter",
        "5 months",
        "2"
    ],
    "transcript_entity_types": [
        "TIME",
        "TIME",
        "DATE",
        "TIME",
        "ORDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "DATE",
        "DATE",
        "DATE",
        "TIME",
        "CARDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "TIME",
        "TIME",
        "ORG",
        "TIME",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "TIME",
        "ORG",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL"
    ]
}