{
    "id": "ospypcmIMHI",
    "title": "Apple Studio Mac event in 11 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-03-08T19:23:42Z",
    "video_url": "https://www.youtube.com/watch?v=ospypcmIMHI",
    "category": "Science & Technology",
    "tags": [
        "verge",
        "apple",
        "apple event",
        "mac studio",
        "apple event recap",
        "iPhone SE",
        "studio display",
        "apple studio display",
        "apple march 2022 event",
        "m1",
        "iPhone SE 3",
        "iphone se 3 2022",
        "ipad air m1",
        "the verge",
        "iphone se 3rd generation",
        "apple iphone se 3",
        "apple event 2022",
        "ipad air 4",
        "ipad air vs ipad pro",
        "m1 ultra",
        "apple tv",
        "apple supercut",
        "green iPhone 13",
        "A15 chip",
        "technology",
        "tech",
        "latest",
        "iphone se 3"
    ],
    "views": 324121,
    "likes": 7039,
    "comments_count": 648,
    "description": "Apple just wrapped its Peek Performance event and announced the Mac Studio and Studio Display, new iPhone SE with 5G, and iPad Air, plus a new M1 chip  the M1 Ultra. Heres everything from the event in 11 minutes.  The 7 biggest announcements from Apples Peek Performance event:   0:00 - iPhone SE (3rd generation) 1:06 - iPad Air (5th generation) 2:13 - M1 Ultra 4:42 - Mac Studio  8:18 - Mac Studio Display 10:47 - Studio and Display Price and Availability  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:   #apple #theverge #macstudio",
    "description_links": [
        "https://bit.ly/3sUXCzu",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Good morning and welcome back to Apple Park. And today, we're bringing our extraordinary A15 Bionic chip to another iPhone, the new iPhone SE. - At the heart of iPhone SE is A15 Bionic. It features our iconic glass and aluminum design in three fantastic colors: midnight, starlight and product red. It has a 4.7 inch retina HD display with incredible color accuracy which now includes the toughest glass in a smartphone on both the front and back. And with IP67 water and dust resistance, iPhone SE is designed to last. iPhone SE has the home button with touch ID. iPhone SE has even better battery life and we're bringing 5G to our most affordable iPhone, the 12 megapixel camera and A15 Bionic create a new camera system and it starts at just 429. Pre-orders start this Friday. and iPhone SE will be available on March 18. - We have a fantastic iPad lineup and today I'm excited to talk about iPad Air. - We're bringing the breakthrough M1 chip to iPad Air and these experiences really come to life on the Air's gorgeous liquid retina display with its P3 white color, true tone, 500 nits of brightness and anti-reflective coating. Another big update for iPad Air is the front camera because it will now feature a 12 megapixel Ultra Wide camera, which means it supports Center Stage. We're bringing ultra fast 5G to iPad Air. We're increasing the performance of the USB-C port. It is now twice as fast and it comes in a gorgeous array of colors. It will be available starting at the same great price of 599. It comes in both 64 and 256 gigabyte configurations and it will be available in both Wi-Fi and cellular models. You can begin ordering Friday and it will be available March 18. - We're adding one last chip to the M1 family. Introducing M1 Ultra. - So far we've scaled up the silicon for the Mac from M1 to M1 Pro to M1 Max. So we're with M1 Ultra, We did something truly groundbreaking and it actually starts with M1 Max, the most powerful SOC we've built today. You see, M1 Max has a secret. It has a groundbreaking die to die interconnect technology that allows us to scale even further by building M1 Ultra from two M1 Max die which doubles performance. And we connect the two die with our innovative, custom-built packaging architecture. This multi-die architecture is way ahead of anything else in the industry and we call it UltraFusion. It connects over 10,000 signals and provides an enormous an 2.5 terabyte per second of low latency, interprocessor bandwidth between the two die using very little power. M1 Ultra has 114 billion transistors. That's seven times more than M1. With two die, the memory bandwidth is increased to a massive 800 gigabyte per second and doubling the memory channels also means M1 Ultra supports up to a staggering 128 gigabytes of unified memory. It has a powerful 20-core CPU with 16 high-performance cores and four high-efficiency cores to crash CPU intensive tasks. It also features a huge 64-core GPU so it can speed through the most intensive graphic tasks. It's nearly eight times faster than M1. M1 Ultra has 32 powerful neural engine cores that can run up to 22 trillion operations per second to accelerate the most formidable machine learning tasks. And it has twice the capabilities of the amazing media engine in M1 Max. M1 Max delivers similar multi-feed CPU performance to the latest 10-core piece of desktop chip while using 65% less power. And when we compare M1 Ultra to the fastest 16-core piece of desktop chip available, it delivers 90% higher performance in the same power envelope. And M1 Ultra can deliver the PC chips peak performance while using an astounding 100 watts less power. When we look at GPU performance on power, M1 Max delivers similar performance to one of the most popular GPUs while using 1/3 the power. And M1 Ultra delivers faster performance than the highest NGPU available while using 200 watts less power. So that's the groundbreaking M1 Ultra. - This is Mac Studio and Studio Display. - The exterior is machine from a single aluminum extrusion with the footprint of just 7.7 inches square and height of only 3.7 inches. The innovative thermal system begins with a unique double-sided blower pulling air into the system across the entire circumference of the perforated aluminum base. The air moves over the custom circular power supply and through channels precisely placed to guide it to the chip's thermal module. Finally, the air is propelled through a low impedance rear exhaust containing over 2,000 precisely machine perforations. The sound is so minimal. For most workloads, you'll barely even hear it. On the back, there are four Thunderbolt four ports to connect displays and high performance devices, a 10 gigabit ethernet port, two USB-A ports, an HDMI port and a pro audio for high impedance headphones or external amplified speakers. Wi-Fi Six and Bluetooth Five are built in as well. We also put connectivity on the front for even easier access. Systems with M1 Max have two USB-C ports providing 10 gigabits per second USB-3 data transfer. And with M1 Ultra, these ports are Thunderbolt Four, with up to 40 gigabits per second data transfer speeds. There's also an SD card slot to easily import photos or video and Mac Studio offers extensive display support for up to four pro-display XDRs plus a 4K TV for CPU performance. Mac Studio with M1 Max is up to 2.5 times faster than the fastest 27-inch iMac. And it's up to 50% faster than Mac Pro with a 16-core Zion processor. Graphics performance on Mac Studio with M1 Max is also tremendous. It's up to 3.4 times faster than the fastest graphics on the 27-inch iMac. And it even outperforms Mac Pro with its most popular graphics card. Mac Studio is over are three times faster. The CPU performance on Mac Studio with M1 Ultra is up to 3.8 times faster than the fastest 27-inch iMac. And it's up to 90% faster than Mac Pro with 16 cores. We can even compare Mac Studio with M1 Ultra to Mac Pro with 28 cores. It's up to 60% faster and graphics performance on Mac Studio with M1 Ultra just crushes 27-inch iMac. It's up to a remarkable 4.5 times faster. It even exceeds Mac Pro with its fastest graphics card. Mac Studio is up to 80% faster. With M1 Max, you can access up to 64 gigabytes of unified memory. And with M1 Ultra, you get up to 128 gigabytes of unified memory for enormous graphics tasks. The SSD in Max Studio delivers up to a super fast 7.4 gigabytes per second of performance and up to eight terabytes capacity. Max Studio can play an unprecedented 18 streams of 8K ProRes 422 video. So that's Max Studio featuring M1 Max and the new M1 Ultra, the most powerful chip ever built for a personal computer. - The Studio Display is in a class of its own. Studio Display has an all screen design with narrow borders. It's all aluminum enclosure houses an advanced set of features in a slim profile. And the stand allows you to tilt the display up to 30 degrees. You can also choose a tilt and height adjustable stand option. There's also a VESA adapter option that lets you Mount the display in landscape or portrait orientation. Studio Display features an expansive screen that has a 27-inch active area with a total of 14.7 million pixels at 218 pixels per inch making it a 5K retina display. And with 600 nits of brightness, P3-wide color and support for over a billion colors, it brings images to life with spectacular detail. It also has True Tone for more natural viewing experience plus an industry leading anti-reflective coating. There's an innovative nano texture glass option that scatters light to further minimize glare actually has an A13 bionic chip inside. There's a 12 megapixel Ultra Wide camera. It supports Center Stage, which comes to the Mac for the very first time. It also includes an array of studio quality mics. Studio Display also features a high fidelity six speaker sound system. It has four force canceling woofers that minimize distortion and produce bold articulate bass and two high performance tweeters that create accurate mids and crisp highs. The speakers also support Spatial Audio. It has three USB-C ports that deliver speeds up to 10 gigabits per second. And there's a Thunderbolt port, which allows you to connect Studio Display and any plugged in peripherals to your Mac with a single cable. That same cable delivers 96 watts of power which allows you to charge any Mac notebook. And it can even fast charge a 14-inch MacBook Pro and you can connect up to three Studio Displays to your MacBook Pro. We've added a new silver and black color option to the Magic Keyboard with touch ID, the Magic track pad and the Magic mouse. That's the all new Studio Display. - Mac Studio with M1 Max starts at 1999 and Mac Studio with M1 Ultra starts at 3999. And the Studio Display with its awesome set of features is 1599. And it can be configured with nano textured glass and a choice of stand options. You can order both products today and they'll be available on March 18th. And they joined the rest of our incredible Mac lineup with Apple Silicon, making our transition nearly complete with just one more product to go, Mac Pro. But that is for another day. (light music)",
    "transcript_keywords": [
        "Mac Studio",
        "Studio Display",
        "Studio",
        "Mac",
        "Mac Pro",
        "Ultra",
        "Max",
        "Max Studio",
        "display",
        "Max Studio delivers",
        "Pro",
        "performance",
        "Air",
        "Ultra Wide camera",
        "Apple Park",
        "Studio Display features",
        "compare Mac Studio",
        "faster",
        "iPad Air",
        "connect Studio Display"
    ],
    "transcript_entity_values": [
        "28",
        "M1 Ultra",
        "March 18th",
        "three",
        "up to 40 gigabits",
        "2.5 terabyte",
        "up to four",
        "nearly eight",
        "Air",
        "K TV",
        "5",
        "Max Studio",
        "CPU",
        "20",
        "30 degrees",
        "Thunderbolt",
        "4.7 inch",
        "A13",
        "A15 Bionic",
        "Thunderbolt",
        "Bluetooth Five",
        "Spatial Audio",
        "up to 22 trillion",
        "12 megapixel",
        "64",
        "10 gigabits",
        "Mount",
        "this Friday",
        "1599",
        "M1 Ultra",
        "218",
        "Thunderbolt Four",
        "M1",
        "18",
        "over 10,000",
        "14.7 million",
        "Max Studio",
        "GPU",
        "iMac",
        "IP67",
        "M1 Max",
        "USB",
        "VESA",
        "90%",
        "200 watts",
        "4.5",
        "MacBook Pro",
        "Magic",
        "Ultra Wide",
        "iPad",
        "just 429",
        "27-inch",
        "Zion",
        "up to 50%",
        "March 18",
        "256 gigabyte",
        "12",
        "NGPU",
        "32",
        "first",
        "Friday",
        "65%",
        "10",
        "M1 Ultra to Mac Pro",
        "midnight",
        "14-inch",
        "1/3",
        "the Magic Keyboard",
        "iPad Air",
        "up to three",
        "128 gigabytes",
        "8",
        "64 gigabytes",
        "1999",
        "Studio Display",
        "Apple Silicon",
        "Wi-Fi",
        "another day",
        "Wi-Fi Six",
        "3.8",
        "4",
        "up to eight terabytes",
        "96",
        "just 7.7 inches square",
        "SD",
        "A15 Bionic",
        "M1 Max",
        "second",
        "up to 90%",
        "up to 80%",
        "up to 10 gigabits",
        "2,000",
        "P3",
        "7.4 gigabytes",
        "Mac Studio",
        "iPad Air",
        "one",
        "Mac",
        "500",
        "four",
        "2.5",
        "today",
        "Mac Pro",
        "only 3.7 inches",
        "six",
        "599",
        "K ProRes 422",
        "an astounding 100 watts",
        "Magic",
        "two",
        "Apple Park",
        "up to 60%",
        "Center Stage",
        "SSD",
        "iPhone",
        "114 billion",
        "600",
        "Mac",
        "3999",
        "UltraFusion",
        "seven",
        "SOC",
        "iPhone SE",
        "800 gigabyte",
        "16",
        "up to 3.4"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "FAC",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "LOC",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "PERCENT",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "PERCENT",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "FAC",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL"
    ]
}