{
    "id": "OtBmHFkvHxM",
    "title": "How do 'Magnet Triggers' work? - Blackshark 4 Teardown!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-04-28T13:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=OtBmHFkvHxM",
    "category": "Howto & Style",
    "tags": [
        "Blackshark 4",
        "black shark 4",
        "xiaomi",
        "gaming phone",
        "best gaming phone",
        "cheapest gaming phone",
        "magnet triggers",
        "blackshark 4 pro",
        "repair",
        "battery replacement",
        "black shark 4 pro review",
        "black shark 4 pro unboxing",
        "blackshark"
    ],
    "views": 1043051,
    "likes": 44039,
    "comments_count": 1163,
    "description": "The Black Shark 4 Gaming phone has mechanical pop up 'triggers' used during games. But how do they work using only Magnets?! Today its time to take apart the new Black Shark 4 Gaming phone to see how things work from the inside!   Get my razor knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "It's time to take apart the $500 Black Shark 4 gaming smartphone. It'll be interesting to see if they kept their iconic metal X design underneath the plastic back since they ditched it on the outside. It'll also be cool to see how these mechanical buttons are able to magically pop up and down...since, you know, it wouldn't be a gaming phone without more triggers. Word on the street is they are using magnets. Let's get started. [Intro] It's kind of nice working on a plastic phone. There's a whole lot less to worry about as I'm removing the back panel. I still need heat to soften up the adhesive of course, but I can be a little more aggressive with my razor without glass getting shattered. So far no big metal X frame inside. So it looks like Black Shark is stepping away from that design after 3 years. It probably saves quite a bit on manufacturing costs since the Black Shark 3 was one of the most complicated phones internally of all time. I'll unscrew the plastics over the top magnetic trigger buttons, and surprisingly they still work, even with the phone being off. Magnets are crazy. We'll dive deeper into the triggers in just a second. First I'll remove the 6 screws holding down the bottom plastics. Then I can remove the bottom loudspeaker, which does not have any balls, but does have the water resistant mesh over the opening. Even though the Black Shark 4 doesn't have an official IP water resistance rating, I'm not sure how you can be named after a fish without an official IP rating, but here we are. The top of the phone has 10 screws of it's own holding down three separate sections. The bottom section is covering up the motherboard, and a pretty cool looking heat pipe laying on the top side of the board. And it's probably what helps dissipate the heat up to that refrigerated Fun Cooler that we took apart in the durability video. It looks like aluminum this time around instead of copper. Then we have the metal and glass camera lens which comes off in one unit. And then the small portion of top plastics with its top loudspeaker. The two stereo speakers are separate from the earpiece, so there are a total of 3 speakers inside of the phone. I'll take out the dual battery next. It's got two connections and two cells divided right down the middle. And it's pretty easy to remove with a little help from the pull tabs. Do not remove the battery. Maybe I should read these things before I do the thing they tell me I'm not supposed to do. This is a 4,500 milliamp hour capacity battery. The motherboard is held down with one screw and a few wire ribbons, the dual SIM card tray, and the camera ribbons which unsnap like little Legos. Then we get our first close up look at the Black Shark 4 motherboard and the integrated heat pipe that covers most of its surface. The bottom sides of the chip have thermal paste on them and they rest on the copper surface that lets heat out through the screen as well. I'll pull out the cameras which are mounted into the frame to keep them steady. We have the 48 megapixel normal camera which does not have OIS. Then the 8 megapixel wide angle camera which also does not have OIS. Then over here, the tiny megapixel depth camera which is still attached to the board and also does not have the optical image stabilization. The thermal cooling system is pretty interesting in this phone. It's using solid copper blocks to bridge the gap between the vapor chamber and the processors. Kind of like the little copper pillars we saw inside the Legion Duel 2's fan ductwork system. The vapor chamber looks pretty normal from this side so I'm going to leave the screen intact this time around. We've had too many gaming phones die recently and we should let this guy live. While we're here though, let's take a look at this magnetic trigger system, the one that's still magically functioning even though the phone is off. The triggers require three different pieces to move up and down and it's rather ingenious. The first part is what makes the click happen and we gotta take this part out to see the two parts. What causes the exterior button to rise up and down though are the magnets. There are two magnets: one on the button and one on the slider. When the slider is pushed towards the top of the phone, the button collapses and the two magnets are attracted to each other which means the magnets are holding the exterior button flush with the phone. When the slider is shifted down away from the button, the magnet's pulls are positioned in a way that they repel each other and the button pushes up. Then the slider sits under a lip from the button which helps keep it up in the raised position. Then both the button and the slider piece get pressed into the third piece, which comes into contact with the electronic part of the button setup that relays the press to the motherboard. Pretty smart design and it's probably quite a bit more efficient than last year's model, with dual stepper motors inside. And it's definitely easier to build with a lot less parts to worry about. And doesn't use any power. I'm impressed. Overall it's a much easier phone to take apart than last year. I'll get the motherboard situated back into the phone with the dual cell battery. I think Black Shark has done a good job of implementing new tech, like the dual fast charging batteries and pop up triggers, while being one of the lowest price mainstream gaming phones. And of course it survived the durability test, which apparently for gaming phones is pretty hard to do this year. With the camera lens and back plastic screwed into place, everything still turns on and works like normal. The exterior design of the Black Shark 4 might have gotten toned down quite a bit this year, but on the inside, where it counts, Black Shark is still getting it done. Hit that subscribe button if you haven't already. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around. itch",
    "transcript_keywords": [
        "Black Shark",
        "Black",
        "Shark",
        "phone",
        "button",
        "gaming phones",
        "camera",
        "top",
        "magnets",
        "phones",
        "pretty",
        "heat",
        "motherboard",
        "gaming",
        "inside",
        "slider",
        "dual",
        "triggers",
        "time",
        "bottom"
    ],
    "transcript_entity_values": [
        "Black Shark",
        "8 megapixel",
        "dual stepper motors",
        "6",
        "Instagram",
        "two",
        "apart than last year",
        "three",
        "Fun Cooler",
        "Black Shark",
        "10",
        "4,500 milliamp hour",
        "last year's",
        "this year",
        "the Black Shark 3",
        "3 years",
        "first",
        "second",
        "500",
        "the Black Shark 4",
        "Black Shark 4",
        "First",
        "Black Shark",
        "third",
        "3",
        "48 megapixel",
        "one",
        "Twitter",
        "IP",
        "2"
    ],
    "transcript_entity_types": [
        "LOC",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "LOC",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "MONEY",
        "LOC",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}