{
    "id": "OTKv_5iv9iw",
    "title": "iPhone 8 Review: The Forgotten iPhone",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-09-27T18:19:22Z",
    "video_url": "https://www.youtube.com/watch?v=OTKv_5iv9iw",
    "category": "Science & Technology",
    "tags": [
        "iphone 8 review",
        "iphone 8 plus review",
        "iphone 8 vs note 8",
        "iphone 8 plus vs iphone 8",
        "iphone vs note",
        "iphone vs galaxy",
        "iphone 8 vs plus",
        "mrmobile",
        "michael fisher",
        "imore"
    ],
    "views": 324531,
    "likes": 11302,
    "comments_count": 911,
    "description": "Sometimes you just have to put the conclusion up front: the iPhone 8 is a successful execution of a familiar idea. Its as iterative an upgrade as you can get, and with a bleeding-edge iPhone X on the horizon and scads of Android phones that have had similar features for years, the iPhone 8 doesnt seem likely to shine in the annals of iPhone history. But if youve got a lot invested in Apples ecosystem (and you dont want to spend a thousand dollars on the iPhone X) well, the iPhone 8 was made for you. Im Michael Fisher and this is part 2 of MrMobiles iPhone 8 review, brought to you by dbrand.   [SPONSOR]  dbrand iPhone 8 skins:     [SUBSCRIBE]     [ABOUT THE iPHONE 8 REVIEW / iPHONE 8 PLUS REVIEW]  MrMobile's iPhone 8 Review / iPhone 8 Plus Review was made possible by a collaboration with iMore. The review units featured in this video are a combination of pre-production samples on loan from Apple, and retail units purchased by Mobile Nations. They were tested over the course of seven days in New York City and Boston on T-Mobile and AT&T. The iPhone 8 was paired with an Apple Watch Series 3 Cellular, while the iPhone 8 Plus was not.  Part 1 can be found here:    [FURTHER READING]  iPhone 8 Review at iMore:    [MUSIC]  A New Departure by Vincent Tone, available at Premium Beat:   Green Fever by Flash Fluharty, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://dbrand.com/mrmobile-iphone8",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.youtube.com/watch?v=85o_x7OoET0",
        "https://www.imore.com/iphone-8",
        "https://www.premiumbeat.com/royalty_free_music/songs/a-new-departure",
        "https://www.premiumbeat.com/royalty_free_music/songs/green-fever",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- Sometimes you've just got to put the conclusion right up front. The iPhone 8 is a successful execution of a familiar idea. It's as iterative an upgrade as you can get, and with the bleeding edge iPhone 10 on the horizon, and scads of Android phones that have had similar features for years, well the iPhone 8 doesn't seem likely to shine in the annals of iPhone history. But, if you've got a lot invested in Apple's ecosystem, and you don't want to spend a thousand dollars on your next iPhone for some reason, well this phone was made for you. I'm Michael Fisher, and this is Part two of Mr. Mobile's iPhone 8 review, brought to you by dbrand. (lively music playing) In the first half of this review, I covered wireless charging, the A11 processor, and some of the camera features. If you haven't seen that part you can find it on my YouTube channel, and please subscribe while you're there. For part two, I spent a lot more time with the plus version of the phone than I did the first time around. So, we'll touch on the fancy camera some more at the end, and for variety's sake I'm going to alternate the good points with the bad. Let's start with the bad point. These displays, yes, they're the best LCDs Apple has ever put into an iPhone, but they're still LCDs. And, while there are compelling reasons for preferring that technology, in my opinion, there are many more reasons to prefer OLED. Again, these screens are fine. They've got Apple's true tone technology to optimize white balance depending on your surroundings. But, put them next to a really good AMOLED panel like Samsung's and you really notice the added vibrance, contrast, and brightness. Another thing not exclusive to OLED panels is screen real estate. I mean this is a good example of how using the same design from three years ago can impair a product. It's not just about the stale aesthetics, it's about having less viewable area compared to much of the competition. Now, you might be thinking that because of that power hungry LCD and the slightly shrunken batteries compared to last year, the iPhone 8 is more sprinter than marathoner. But, nope, whether it's the A11 or something else going on under the hood, Apple has worked some serious wizardry with the battery life with the real performer being the plus. With its bigger battery, I've been able to hit the end of a 16-hour day with over 20 percent left, and that's with a lot of camera usage and near constant Bluetooth streaming of podcasts and songs to my headphones. And, yeah, it would've been nice for Apple to toss in a fast charger with its $700 dollar phone, but that's countered somewhat by the presence of wireless charging, which I covered in part one. My other big negative is more a matter of taste, and it's that home screen, man. Everything around it is amazing. IOS 11's new control center is so fun to use and that built-in video screen capture is what makes shots like this possible. I love being able to swipe down on the home screen to type in a search query or quickly locate an app, and even the notification center isn't as messy as it once was. But, the home screen, itself, this stale grid of icons that you can only customize in the barest sense, I mean it's a little extreme to say that it makes me feel like I'm using a starter phone for a preteen, but only a little. On Android, I can put anything anywhere without worrying about adjacent apps. I can have widgets for glanceable information or I can clear everything away so you can actually see my wallpaper. I can even change out the whole launcher to make for faster performance or just a better flow. None of that is possible on the iPhone. I know a lot of people don't care, and if you're the type who doesn't want to have to think about that stuff, than, hey, this will be as enjoyable to you as the last decade of IOS has been. As I mentioned, I spent more time with the 8 plus this time around, and this is absolutely the one I would buy if I had to choose between iPhones. Yes, for the battery and the bigger display, but most crucially for the dual camera. Now, Apple makes very clear that the new portrait mode lighting effect is in beta, and yeah, it sure is. It takes a lot of tries to get it to work properly. Framing one of these can be very frustrating with the finicky lighting and distance requirements, but once you nail it and apply one of those new lighting effects, the result is a shot you can't get from any other phone. Get ready for a lot of profile pictures that look like this. The telephoto lens is also useful for long distance photos and video, obviously. Speaking of, I've continued testing the iPhone 8 plus against its direct competitor the Galaxy Note 8. Apple and Samsung have fundamental differences in how they approach imaging. The iPhone will generally hue more closely to accurate colors and it tends to bring out more detail in shadows, which serves it well in low light compared to the Note. In daylight, the differences are more polarizing. The Note 8 punches up the saturation and contrast for a photo that seems custom made for Instagram, while the iPhone, again, sticks closer to reality. Despite what you might read in the comments, which one is quote unquote better is not a simple matter. It's actually quite subjective. It depends on how much you value authenticity. For me, the richer, less accurate Samsung photos are the more convenient ones since I tend to upload to social media with very little editing, and I like that added punchiness even if it is a little artificial. If you like to take your pictures into Photoshop to really perfect them, or you just want something that more accurately reflects the real world, you'll probably prefer the iPhone. The only clear winner here comes in video where the iPhone's new 4K 60 frames a second shooting and 240 FPS full HD SloMo give it the crown, hands down. More video samples in part one. Winding it down with the details, the external speakers seem a touch louder this year. Phone calls are nice and crisp, and for all my complaints about IOS's home screen, I have to admit, I love some of its conveniences like 3D touch on the keyboard to move a cursor around. Also, hanging out with the iMore crew for a few days showed me how seductive the Apple ecosystem can be if your whole family or team is using it. In particular using Airdrop to move files between iPhone, MacBook, iPad is a dream, and common tasks like restoring an old phone to a new one is still more seamless than it is on Android. The features Apple introduced with the iPhone 8 will be remembered for a long time, things like the upgraded camera, A11 processor, and IOS 11 will serve as the foundation for iPhones going forward. But, the phone itself eh, I said it in the intro, if you've got a seven, you're not missing much, yet. If you've got a six or older, it's definitely a nice upgrade, and if you're an Android user contemplating switching from a green to a blue bubble well until the 10 comes out, you should probably hold off. Speaking of holding, a glass on glass phone is a tough thing to hold on to, and an easy thing to break. So, if you want to change up your look while adding some protection, hit the link in the description and pick up a premium vinyl skin from today's sponsor dbrand, and while you're at it, be sure to check out the dbrand Grip, a brand new case designed to make sure your phone stays where it belongs, in your hand. The Grip goes up for sale October 1st. Thanks for putting up with the two-part review format this time folks, it's not something I'm going to make a habit of, but this time it just had to be done. Until next time, thanks for watching and stay mobile my friends.",
    "transcript_keywords": [
        "iPhone",
        "Apple",
        "phone",
        "time",
        "home screen",
        "Part",
        "screen",
        "lot",
        "Apple ecosystem",
        "Android",
        "IOS",
        "camera",
        "IOS home screen",
        "Apple makes",
        "LCDs Apple",
        "features Apple",
        "put",
        "home",
        "Note",
        "Android phones"
    ],
    "transcript_entity_values": [
        "iPhones",
        "Instagram",
        "IOS 11",
        "Michael Fisher",
        "Grip",
        "Samsung",
        "a thousand dollars",
        "the first half",
        "iMore",
        "Apple",
        "last year",
        "Airdrop",
        "a few days",
        "YouTube",
        "over 20 percent",
        "10",
        "Mobile",
        "this year",
        "A11",
        "today",
        "iPhone",
        "first",
        "two",
        "A11",
        "4",
        "three years ago",
        "IOS",
        "Galaxy Note 8",
        "MacBook",
        "six or older",
        "October 1st",
        "years",
        "second",
        "the last decade",
        "iPhones",
        "iPad",
        "16-hour",
        "11",
        "seven",
        "LCD",
        "$700 dollar",
        "Android",
        "8",
        "FPS"
    ],
    "transcript_entity_types": [
        "NORP",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}