{
    "id": "otWiqF4l-RU",
    "title": "iPhone XR Christmas Tree!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-12-23T16:20:26Z",
    "video_url": "https://www.youtube.com/watch?v=otWiqF4l-RU",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iphone xr",
        "apple",
        "phone",
        "christmas tree"
    ],
    "views": 245673,
    "likes": 9195,
    "comments_count": 1826,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- So, today, you guys may have seen the video where I decorated a tech Christmas tree. - [Jenna] Can we tuck them all in? - That looks good. Gosh, I'm loving -- - These came with ornament hooks! - This is everything, period. Like, the kids say. Well, today, I wanted to decorate one specifically with the iPhone XRs because the XRs are so beautiful and I thought that they would make an incredible Christmas tree decoration. This poor little Christmas tree has definitely seen better days. So, we've gotta kinda spread these little branches out (laughs) and make this thing not look like a hot mess. It definitely got smashed in storage. I love the holidays so much, and everyone's in a cheerful, festive mood. And I'm decorating an iPhone Christmas tree. Would you have it any other way? I mean, no, you actually probably wouldn't. So, let's plug this in. (\"Jingle Bells\") Oh my goodness, it's so festive! No! Oh, shoot, well, we have one dead bulb, that really ruins the Christmas spirit! We still have some of these that were in the packaging from when I unboxed these phones, so I'm hoping that they will actually stay on here, because this thing's gonna fall over, there's absolutely no way that this even gonna hold this up. Oh, yeah, that's really a look. Some people will say, \"Justine, have you run \"out of video ideas?\" And I will say to them, \"This was a video idea.\" And now it's a reality (chuckles). Can you even believe? So, you may also be wondering who the winners were of the iPhone XR and iPad Pro or MacBook contest. Those were announced on Jonathan's Twitter, and I also retweeted it, so be sure to check out that, so you guys can see if you were the winners. And if you were, you probably already know, that you were contacted because you won, so it's a whole thing. But congratulations to the winners. So, this is lookin' pretty good. God, I'm so in the holiday spirit; can't even handle it. Here's our tree topper. Can I get those to even stay up here? Like, this is so silly. (laughs) I mean, I've got a tech Christmas tree, I have an iPhone XR Christmas tree, what more could one ask for? I'm not even sure. I thought also because I have some of these EarPods that I would add these on as well. I'm just trying to get them all to stay in the front here. (laughs) This is absurd. Just when you thought you've seen it all, you haven't seen anything (chuckles). What a good look. This is really coming together. Oh no, I only have two left. I'm gonna have to add some things to this! I like the EarPod look, though. That looks really good (laughs)! Guess I'll put you in here... Like, this is something that they should probably put in the Apple store, like if they want to use this, guys, it's here for you. This looks absolutely terrible, actually. This looks really bad! I had some high hopes! But that's probably the problem, usually when I have low expectations for things things turn out really well. In here... we'll just tie this around... See, here's the problem: this only looks good from one angle. Well, it barely even looks good from that angle. Alright, well, I guess I'll add on another cable because I've got it here. What other phones do I have? I feel like this needs more phones. Maybe we can add some cases. It's not XR, but it still is festive. Oh, this is really nice. This isn't an Apple case, but it's... Oh, there's a case inside of it. The things that you do for fun and for YouTube. Apple Watch Bands... Just to really spice it up. 'Cause you've gotta get in the holiday spirit, guys. We've gotta get super festive. Haters will say it's photoshopped or rotoscoped. I am so blown away by my creativity and shocked with just how beautiful this is. I mean, okay, it's pretty bad, but... (laughs) Well, I wanna know what are your holiday plans? Do you have holiday plans? Do you not have holiday plans? And if you don't, that's totally fine, too. Happy holidays! I am hyped about this tree. I've gotta go find a good place to put this. It's... like, this has gotta be pretty heavy. Oh, yeah, this is incredibly heavy. I can't even, like... I can barely even pick it up. It's gonna fall over. (chuckles) Well, happy holidays, again, guys. Merry Christmas if you celebrate. I love you, guys, and I will see in my next video. Hopefully, I'll have some other fun themed holiday things for you. If there's anything else that you'd like to see me make, leave those in the comments below! And I will see you very, very soon. Goodbye! (festive music)",
    "transcript_keywords": [
        "Christmas tree",
        "Christmas",
        "tech Christmas tree",
        "tree",
        "iPhone Christmas tree",
        "good",
        "holiday",
        "tech Christmas",
        "guys",
        "Christmas tree decoration",
        "things",
        "incredible Christmas tree",
        "iPhone Christmas",
        "holiday plans",
        "iPhone",
        "Christmas spirit",
        "video",
        "festive",
        "add",
        "holidays"
    ],
    "transcript_entity_values": [
        "MacBook",
        "Jingle Bells",
        "Apple Watch Bands",
        "EarPod",
        "iPhone",
        "YouTube",
        "iPad Pro",
        "one",
        "Christmas",
        "Jonathan",
        "XR",
        "Twitter",
        "XR",
        "today",
        "Apple",
        "Justine",
        "two"
    ],
    "transcript_entity_types": [
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL"
    ]
}