{
    "id": "OWVqn2qc2ls",
    "title": "MacBook Air 2020 review: the best Mac for most people",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-03-26T14:00:07Z",
    "video_url": "https://www.youtube.com/watch?v=OWVqn2qc2ls",
    "category": "Science & Technology",
    "tags": [
        "macbook air",
        "macbook",
        "new macbook air",
        "macbook air review",
        "macbook air 2020",
        "2020 macbook air",
        "macbook pro",
        "macbook air 2019",
        "2019 macbook air",
        "2020",
        "2019",
        "review",
        "review macbook air",
        "hands on",
        "apple event",
        "butterfly keyboard",
        "magic keyboard",
        "nilay patel",
        "processor",
        "price",
        "specs",
        "feature",
        "16 inch macbook pro",
        "Tim Cook",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "iphone",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 639677,
    "likes": 10213,
    "comments_count": 657,
    "description": "Apples 2020 MacBook Air comes with the new scissor-switch keyboard the company introduced in the 16-inch MacBook Pro, and the processors have been upgraded to Intels new 10th-generation parts. Apples also lowered the price by $100, with the new MacBook Air now starting at $999. Nilay Patel has the full review.   Read more:   Vox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. For more information, see our ethics policy here:   Order the MacBook Air from Apple:   Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/39k2G3f",
        "http://bit.ly/2TQsqjB",
        "https://fave.co/2Jdxl7N",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "All right, a MacBook Air review video shot by me, by myself, at home. But Becca is still directing this thing over Zoom, so I can't screw it up too bad, right? From what I can see, it looks like there's still a little headroom. We could tilt up like a literal centimeter, like, yeah. Let's tilt up a little. Just a little bit more. Let's... okay. Come back to the camera, and then zoom in like a click. Oh, wait. Wait, one click less. Okay. That looks really good. So there's a new MacBook Air, which is Apple's most popular Mac. The big update happened two years ago with a full redesign around a Retina Display. This new 2020 model has faster 10th Gen Intel chips and a totally new keyboard. Apple's also lowered the price. The base model starts at $999 with a 1.1GHz dual-core Core i3 processor, 8GB of RAM, and 256GB of storage. I've been reviewing the step-up $1,299 model that has a quad-core Core i5 and 512GB of storage, which is the version I think most people should get. It's got two Thunderbolt 3 ports, which now support running 6K displays, and headphone jack, which, well... you know how I feel. Let's start with the most important thing: the new keyboard. It has been a very bad few years for Apple's laptop keyboards. So the switch back to a traditional scissor key design is very welcome. Apple is calling this the Magic Keyboard, and it first arrived on the 16-inch MacBook Pro last year. As it happens, I've been using a 16-inch MacBook Pro for a few months now, and I'm happy to say that the Air's keyboard feels almost exactly the same, which is to say: very good. The keys have a millimeter of travel, they're just clicky enough without being too loud, and overall, the whole thing is very solid and very satisfying. There's also zero chassis flex, so you can pound away on this keyboard on your lap or at a weird angle on the couch. I don't really want to give Apple too much credit for updating this keyboard. It took the company way too long to get away from that butterfly design after people started calling out the problems. It's going to take some time to earn back that trust. But history aside, the keyboard is the single most important part of a laptop, and the new MacBook Air's keyboard is extremely good. I also have to say, I greatly prefer this keyboard with a standard top row and function buttons to the Touch Bar version on the 16-inch MacBook Pro that I've been using. I just don't understand the Touch Bar. It seems to make basic things like adjusting volume and brightness more complicated without making anything else so much easier that it's worth the trade-off. I know other people feel differently, and I legitimately know people who love the Touch Bar, like Becca. Come on! But I don't, and I think it's really telling that the Air is Apple's most popular laptop, and it doesn't have the Touch Bar. That's the right choice. The other thing it doesn't have is a touchscreen, and one, touchscreens on laptops are pretty common now, and people seem to like them, and two, if Apple can figure out how to add trackpad support to iPadOS, it can probably figure out how to add touch support to macOS. But for right now, and honestly, for the near future, the Mac is mouse and keyboard only. The other new thing from last year are the processors, which are Intel's new 10th Gen chips with Intel Iris Plus Graphics. Our review unit has a 1.1GHz quad-core Core i5 chip and 8GB of RAM in it, and it's been fairly capable. I've been working in Chrome, Slack, and Zoom, and a little Lightroom on the side like I normally do, and it's felt totally solid. That feeling is backed up by the single-threaded Geekbench score, which is basically in line with a 16-inch Core i9 MacBook Pro that I've been using. But this thing still isn't a rocket, and I can definitely push the limits pretty easily. Just opening Lightroom is enough to make the fan speed up, and after a couple of edits, it's going full blast. And heavy sustained workloads cause the processor to do some thermal throttling. You can definitely see it with heavy benchmark tests like Cinebench. I asked Apple about thermal throttling, and they told me it's by design. They don't think most people need hardcore sustained performance, so the Air is designed to boost the processor up to 3.2GHz as needed and then bring it right back down. But once things heat up, the processor's clock speed is capped at a lower number with the fan going so the system can manage heat. Again, in pretty average day-to-day use, I never felt any of this thermal management slow things down, which is the entire point. But it's also clear there isn't a ton of headroom if you need a lot of performance all the time. You'll definitely at least hear the fan, and you might experience some slowdowns. I asked for questions on Twitter, and almost all of you wanted to know about the performance gap between the new Air and the 13-inch Pro, and that thermal design is basically the big difference. Apple told me that the MacBook Pro is the better laptop for people who need to push their machine to the limit all the time. It has a more forgiving thermal design and faster turbo boost clock speeds. It can basically run hotter and faster for a longer period of time. The bad news is that the 13-inch MacBook Pro still has that butterfly keyboard. There are a lot of rumors of an update coming, and yeah... we're just going to have to keep an eye on that. All of that is to say that the Air's performance is totally fine for most day-to-day tasks. But if you regularly use a bunch of demanding applications, you're going to be hearing that fan a lot. Apple says you can get 11 hours of battery life on the new Air if you're just running Safari to browse the web. But in real life, running Chrome, Slack, and Zoom, I got more like five hours of battery life with the screen turned all the way up. I probably could've extended that a little if I turned down the brightness, but this is not the world's brightest screen to begin with. It averages about 400 nits of brightness compared to, say, 625 for the iPhone 11. Those three apps are battery hogs. But at this point, I live in Zoom and Slack all day, every day, and I wouldn't say I'm blown away by the battery life I'm experiencing. And while Safari is way more efficient than Chrome, Chrome is still just a fact of life for a lot of people. As with every Apple product, there is a gap between the results you get if you live entirely within Apple's ecosystem and reality. Speaking of Zoom, the webcam in the Air is the same old 720p webcam Apple's been using forever. It's fine, but it's disappointing that Apple puts some of the best cameras in the industry in the iPhone and sticks with one of the most medium cameras in the Mac. I just got a lot of questions about the MacBook Air versus the iPad Pro with the new Magic Keyboard since the 11-inch Pro and that keyboard cost about the same as the base-model Air. And well... only you can know the answer in your heart. For me, I'd pick the Air for now. You get a bigger screen, and macOS has fewer limitations on what it can do. Dieter has a whole review of that new iPad Pro up on the channel if you want more, but we're going to have to revisit this debate when that Magic Keyboard case ships in May. So those are the major new changes in the MacBook Air. I haven't tested the $1,000 base model that a lot of people asked me about. But I feel pretty confident that you should spend the extra $100 to get the quad-core i5 upgrade and that most people should spring for the $1,299 model with the i5 and extra storage if you can afford it since these laptops tend to stick around for a while. And that's really the thing: for the first time in several years, I feel confident in saying that most people in the market for a Mac laptop can just buy a MacBook Air and expect it to competently and reliably do most things for a long time to come. That's a big win. Just make sure you use Safari if you want the battery to last. Making this video, for me, was a nice distraction from the virus news cycle, and I hope it helped you out a little bit, too. That said, I want to call out the entire Verge team, particularly the Verge Science team. They're doing an absolutely great job covering the coronavirus. Check it out. It's Verge Science on YouTube. That's their channel. I hope you're staying safe, and I hope you're staying home.",
    "transcript_keywords": [
        "MacBook Air",
        "Air",
        "MacBook Pro",
        "Apple",
        "MacBook Air keyboard",
        "keyboard",
        "Pro",
        "Air keyboard",
        "MacBook",
        "Touch Bar",
        "Air keyboard feels",
        "people",
        "Apple laptop keyboards",
        "Magic Keyboard",
        "MacBook Air review",
        "Zoom",
        "thing",
        "Touch",
        "MacBook Air versus",
        "Core"
    ],
    "transcript_entity_values": [
        "zero",
        "about 400",
        "last year",
        "1.1GHz",
        "8GB",
        "May",
        "one",
        "Mac",
        "625",
        "Apple",
        "MacBook Air's",
        "999",
        "Cinebench",
        "three",
        "Twitter",
        "Safari",
        "Thunderbolt 3",
        "Slack",
        "10th",
        "11-inch",
        "Lightroom",
        "Air",
        "Magic Keyboard",
        "Geekbench",
        "3.2GHz",
        "1,299",
        "MacBook Pro",
        "2020",
        "512",
        "centimeter",
        "Dieter",
        "the MacBook Pro",
        "several years",
        "Becca",
        "Safari",
        "Verge Science",
        "Air",
        "a few months",
        "MacBook Air",
        "webcam Apple's",
        "the iPad Pro",
        "two",
        "jack",
        "16-inch",
        "8GB",
        "all day",
        "iPad Pro",
        "100",
        "256",
        "Chrome",
        "6",
        "like five hours",
        "Gen Intel",
        "1,000",
        "MacBook Air",
        "Core",
        "13-inch",
        "the Touch Bar",
        "first",
        "iPhone",
        "11 hours",
        "Mac",
        "Intel",
        "Intel Iris Plus Graphics",
        "Zoom",
        "two years ago",
        "the MacBook Air",
        "RAM",
        "millimeter"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}