{
    "id": "Ox83TZolF1E",
    "title": "Epic Drone Flying Day!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-04-12T21:03:09Z",
    "video_url": "https://www.youtube.com/watch?v=Ox83TZolF1E",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 82815,
    "likes": 3760,
    "comments_count": 258,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(cheerful upbeat music) - Guys! What's going on? Today, we're having a drone day. we're actually out here at Willow Race Springs, Willow something. I dunno, it's a racetrack. (drone whirring) It's far away, drove about an hour and a half to get here. That's basically how far out of Los Angeles you have to go to be able to freely kind of fly some drones. But, we're here with some professional drone pilots and they're going to show me how much better they are Than flying than me. This is like my drone dreams come true. This is, this is what we need. I've been doing everything all wrong. Gear truck with a platform. Filming on the A1 right now, this is the A7S3 and Sony let us borrow this 200 to 600 millimeter lens. And we're going to see if we can try to follow and track the drones as they're flying. Oh this is going to be great. - $10,000 a drone. It's always super relaxing to fly. - [Woman] I'm stressed for you guys (woman laughs) - What could go wrong honestly? - Oh gosh, please don't say that. - It's only my camera, so. My name's Jake, I'm from Drone Dudes. We're an aerial cinematography company out of Los Angeles. We specialize in any kind of remote cinematography. So mostly drones. Today, we're going to be flying a couple of different drones. We've got the Money Shot Mini, which Paul Nerc is going to be flying. He's a DRL world champion so he's going to give that thing a proper workout. That's the latest and greatest kind of heavy lift cinema FPV drone. It's carrying the Red Komodo, which is like the tiny pocket sized red camera. And he's going to be chasing around behind the motorcycles. And then we're going to flip over to the inspire two, which is like a more traditional cinema drone and even Justine, I think, is going to get in on the sticks on that. - So do you think that you're going to trust me operating that camera? - Oh, definitely. You've worked with a lot of cameras in a lot of tech and this is no different. - Yeah, I fly a lot of drones, just not FPV full manual. Not ready for that yet. Or maybe I am! - We'll get there, Yeah. Paul's the one to train you up, so. - It's true. We're out here at Willow Springs Raceway, Drone Dudes invited me out to come and fly their Money Shot Mini which is a drone that carries the Recon Moto. And we were chasing a couple of awesome motorcycles across the track. And I figured if you wanted to come and hang out, you might as well come fly some drones check out some cool bikes. - For anyone that doesn't know, do you wanna give a brief history of like your FPV drone flying background because, incredibly talented pilot. - Yeah, so I started flying drones in 2014. My in-laws bought me like a toy drone for Christmas one year and I broke it immediately and I'm like, I'm kind of an engineer. I was a programmer at the time. I was just like, I should be able to figure out how to fix this. So searched around, got a YouTube university education in fixing drones. And along the way, discovered drone racing. Just like as soon as I saw it, I was like I have to try that. It is the coolest thing in the world. And that took me around the world. I got to go like all across United States, China, Germany, United Kingdom and eventually became the 2018 world champion of drone racing. So it's, it was, it was awesome year and was so proud to have that title because it gives me opportunities to come out and tell more stories about drones and drone racing and what it can do. - It's so cool. Well, thanks for the invite. This is like the coolest thing ever. I was like, Tyler, We're gonna go fly drones with cool people, let's go! (upbeat music) (upbeat music increases) That was pretty freaking cool! It's hat time. - We're just gonna swap the batteries and we'll give you the tutorial and if you wanna film that or whatever, however you want to get it. - Nice, I have my hat on, I'm ready. - [Man] Are we ready? Let's do it! This is called the Cendence remote from DJI, it's kind of their like big, fancy inspire remote. (upbeat music) - I feel pretty good, I mean I'm not piloting, I'm just basically camera ops, so (indistinct). (upbeat music) - [Man] That's perfect, you got him, you got him, hold it! (man cheers) (upbeat music) Legit though, anytime that you want to work with us like-- - Oh I'd love to! (upbeat music) So much fun, I just, I love, I mean I wasn't actually flying, but like the whole, everything that goes into flying drones, I just, I just love it, It's just like such an exhilarating feeling and it's so fun and just freeing. It was actually great because not having to worry about flying and just focusing on kind of using the camera and piloting that part. And I think I just got a job offer, so I'm pretty excited. I wonder when I start. So should I, do I start Monday? I'm gonna come in Monday? - Yeah, so I think, you know, Monday is good for us. If it's good for you. - Let me check my schedule. I'm free! - I mean, we have four shoots next week so, the sooner you could start the better. - Great! (laughs) Dude that's it. This was so much fun. I love drones. I love flying them. I love watching people fly them and obviously being geared with like the best of the best is so inspiring. I'll put links in the description if you guys want to check out all things Drone Dudes. And be sure to check out Nerc's YouTube channel because he does so much incredible content with drones. Go check it out. I'll see you guys later. Thanks for watching. See you in the next one, cheers. (upbeat music)",
    "transcript_keywords": [
        "drone",
        "drones",
        "flying",
        "Drone Dudes",
        "fly",
        "Willow Race Springs",
        "Money Shot Mini",
        "FPV drone",
        "kind",
        "Los Angeles",
        "love",
        "flying drones",
        "drone racing",
        "FPV drone flying",
        "camera",
        "Yeah",
        "check",
        "Willow",
        "Money Shot",
        "Shot Mini"
    ],
    "transcript_entity_values": [
        "2014",
        "Monday",
        "United States",
        "Paul",
        "A7S3",
        "Jake",
        "DJI",
        "Paul Nerc",
        "Nerc",
        "next week",
        "Justine",
        "Willow",
        "Cendence",
        "Sony",
        "Today",
        "Drone Dudes",
        "the Money Shot Mini",
        "United Kingdom",
        "YouTube",
        "Los Angeles",
        "A1",
        "four",
        "10,000",
        "FPV",
        "this 200 to 600 millimeter",
        "the Recon Moto",
        "China",
        "Willow Race Springs",
        "two",
        "Money Shot Mini",
        "Christmas one year",
        "2018",
        "DRL",
        "Tyler",
        "Willow Springs Raceway",
        "about an hour and a half",
        "Germany"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "LOC",
        "ORG",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "GPE",
        "ORG",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "FAC",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "FAC",
        "TIME",
        "GPE"
    ]
}