{
    "id": "OXKO47xfINk",
    "title": "Note 5 - S Pen Rant!",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2015-08-23T23:57:15Z",
    "video_url": "https://www.youtube.com/watch?v=OXKO47xfINk",
    "category": "Science & Technology",
    "tags": [
        "s pen",
        "s-pen",
        "stylus",
        "note 5",
        "galaxy",
        "note",
        "galaxy note 5",
        "review",
        "s pen features",
        "unboxtherapy",
        "unbox therapy",
        "android",
        "samsung",
        "samsung galaxy s5",
        "rant",
        "tech",
        "technology",
        "Android (Operating System)",
        "Pen (Product Category)",
        "tips",
        "tricks",
        "note 5 pen",
        "best android",
        "2015",
        "samsung galaxy note",
        "unboxing",
        "samsung galaxy",
        "galaxy note review",
        "galaxy note unboxing",
        "note unboxing",
        "drop test",
        "smartphone",
        "note5",
        "iphone 6s",
        "test",
        "features",
        "tips tricks",
        "note review",
        "galaxy note5",
        "note galaxy",
        "spen"
    ],
    "views": 755579,
    "likes": 17393,
    "comments_count": 1393,
    "description": "Samsung Galaxy Note 5 -  Watch my other Note 5 video -  Subscribe for more -   Sharing some of my thoughts on the S Pen and pens in general.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/1TP9kW3",
        "https://youtu.be/hqCR4G2_2y0",
        "http://bit.ly/SubUnbox",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Man you know something? Typing with this pen there's something satisfying about it! When you're using your finger, you have... obviously a limitation of precision Now the thing with your finger is..its useful, right. You have many of 'em You can do lots with these.. It's really the thumb to be honest with you right That's what separates us from the other creatures The thumb! It allows you to grip things, carry things... Anyway, bottom line is...think of it this way and I've been thinking hard on this because I've been trying to give this phone a shot as my daily device and I feel like I haven't invested enough time in the S pen life in the S pen lifestyle to accurately gauge whether it makes sense or not daily for me like when compared with standard phone But here's a little analogy that I have thought of Fingers have been around a long time *Laugh* No seriously though Fingers have been for around a long time And so have instruments like this...pens in order to circumvent having to use the finger Now when you're a kid, you are a child you do things like finger paint right The level of precision that you're expected to get with your finger is limited by the instrument itself I'm sure like there is some finger painting master out there that you guys are gonna link me to No! Lew..you're crazy! Look at this guy! He's doing what is it? Van Gogh with his finger! OK fine. That's a fringe case For most people, when it comes to precision for a physical input This tip offers significantly more..precision than a finger ever could! And most artists would probably tell you the same! You know another thing too is fingerprints! This is a weird one I'm not sure I've heard anybody talk about this but these displays get gunked up with garbage from these Like you touch everything with these I know you do Meanwhile there's a guy who wears gloves everywhere because he's a germ-o-phobe and he's like \"No! I don't Lou\" \"Fingerprints aren't a problem for me Lou\" \"I wrap my fingers in cellophane\" You are not included in this.. scenario But essentially these are prone.. to all kinds of garbage Coming back to the precision component with the pen! Why on desktop computing platforms haven't we completely switched to touchscreens..? to interact with your hands rather than a mouse and keyboard Precision pointing device. Why do people keep reverting back? to the precision version even though the convenience of the hand should outweigh it Like it has in mobile devices I don't know! I feel like there is a place for the pen in this world I don't know if anybody is completely cracked to that nut But I do think we are getting closer This might seem weird ...but this little click on the end... this little satisfying... kind of.. I don't know... is this obsessive compulsive for me to be so satisfied by this? I have done it for ten hours straight! And that's the longest I've done it! There's a certain satisfaction you get.. ..from the click... which.. leads me to believe that the click in it of itself might convince you to pull the pen out more often just because you are missing the click! That sounds CRAZY! But that little activity... you might be sitting there looking at that I'm going to extract that right now..not because I have anything to write... not because I'm going to interact with my device.. but because..it's like a habit Not like a habit...a habit Does that mean the S pen will make its appearance more often? for people who have bought the note... previous versions for example.. and under utilized the pen forgot about it's exitance maybe we need an addictive habit to force us into really trying to utilize it Anyhow, back to business..",
    "transcript_keywords": [
        "finger",
        "pen",
        "precision",
        "Fingers",
        "click",
        "habit",
        "things",
        "time",
        "Lou",
        "back",
        "people",
        "long time",
        "Man",
        "thing",
        "crazy",
        "fingerprints",
        "guy",
        "thumb",
        "long",
        "device"
    ],
    "transcript_entity_values": [
        "ten hours",
        "Lew",
        "Van Gogh",
        "the S pen",
        "Fingers",
        "Lou"
    ],
    "transcript_entity_types": [
        "TIME",
        "PERSON",
        "PERSON",
        "EVENT",
        "PERSON",
        "PERSON"
    ]
}