{
    "id": "OyC12A24Sag",
    "title": "It's BEAUTIFUL but it's not for me - WorkLouder Creator Board",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-01-31T21:34:48Z",
    "video_url": "https://www.youtube.com/watch?v=OyC12A24Sag",
    "category": "Science & Technology",
    "tags": [
        "Worklouder",
        "Custom keyboard",
        "Mechanical",
        "Modular",
        "Creator",
        "Made for creative",
        "Shortcuts",
        "Macro",
        "Keys",
        "Taran",
        "Linus Media Group",
        "I wanted to like this",
        "It's beautiful but I can't use it",
        "dials",
        "It has DIALS!",
        "Keyboard dials"
    ],
    "views": 613791,
    "likes": 23063,
    "comments_count": 974,
    "description": "Thanks to Secret Lab for sponsoring today's video! Check them out at   All hail the macro king! He takes a look at a new company that was born from crowdfunding and actually released the product in a reasonable amount of time!  Worklouder is made for creators, so let's see what a creator actually thinks of it.  Check out the WorkLouder Macro Keyboard:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS ---------------------------------------------------   0:00 - SURPRISE UNBOXING! 0:16 - Initial impressions 2:38 - Trying out modularity  3:00 - RGB discovered! 3:16 - Resident LMG keebs impressions 3:55 - Pricing impressions 4:11 - Sponsors - Secret Labs  4:39 - Two weeks of use thoughts 6:06 - Community impressions 6:27 - Chatted to the Co-Founder 7:25 - Configurator impressions 8:04 - Additional thoughts and future development 8:33 - How the dials work 9:26 - Final thoughts",
    "description_links": [
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/o32h9",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- We're doing. (polythene bag squeaking) There's a reason I'm here and I'm not a sports guy, all right. Whoa! Look at these. Dude. Oh my God! That's cool. Look at that. This is the Work Louder keyboard. This can't be typical. Can it? - [Someone In Background] Yes. They shipped it to us fully assembled. I thought I was gonna have to assemble it. It's a modular keyboard. So it's ortho-linear. I am not used to type big. Oops. In ortho-lin-near space. I prefer full keyboards. I like having my num pad and so on. You can turn any of these keys into anything you want. It's QMK, which is great and everything you would expect. Like here's the thing. It's cool that it's modular, but all I can really do is like, move this slightly over or move this whole thing slightly over and then move this over there. I'm not sure how you could make a keyboard any more modular than this. Oh, that's cool. This is also a separate thing. See that? I could move that here, not that I would want to. The thing that most interested me about this product are the dials and these ones they're discreet. They're not continuous. And the website says that it's compatible with apps like Premier, Photoshop and so on and I will put that to the test. So I'm gonna try that out. And then they have a QMK mapping GUI. Which is nice, 'cause I'm used to just having to do it in text, you know, like a notepad sort of a thing. So I'm looking forward to that. It's gonna make it a lot easier to like, lay stuff out. So something like this definitely appealing to the sort of person who wants to optimize their workflow. As far as the dials go, I have no idea. We're just gonna have to find out. Dials, why are dials important? Well, basically if you grew up in the nineties and remember what it was like using a computer without a scroll wheel on the mouse, it was more annoying. It's really nice to be able to like scroll down a webpage. And similarly, certain things like volume control are just much better to do with dials as opposed to keyboard shortcuts, where you're just having to push the key over and over again. And it's not just volume or scrolling on a webpage. There's lots of different things that are good to put on a dial as opposed to a key. I am going to take off the bottom thingy. Let's take off this, scan me. We don't need him. So now we can move this up. We can move it up halfway or we can move it up the whole way, which is what I'm gonna do. Yeah. So you see there's the other circuit board right there. I don't like where these, where these arrow keys are. Oh yeah, there we go. Oh wait. They are RGB. Ah, yeah. Oh, I was wrong. It is perky RGB. Ta-da! Much better. Although now, I don't like such small keyboards. Give me more room to work. What do you think about this sucker? - [Man Wearing Cap] I think it looks pretty neat. I like how many knobs it's got. Oh, I don't like it (laughs). - What? What's wrong then? What's wrong with it. You didn't even start typing. - It's the home row feels like, oh, I don't like the layout. I've got to think before I type. - Well. - The note pad. - You gotta get used to. - The keys are okay. They're they're not like, I'm not crazy about them. What I actually liked the most is the lively. I love the acrylic base. Like I like how it's like a cool, like it's so bare bones. Like it's an acrylic base. - Yeah. It's just like a PCB or something here. - Yeah, yeah. - Like that's super awesome. - How much is this, $250? 400?. (someone in background laughs) That's too much. (someone in background laughs) And like, I'm sure it's really good, but is it $400 good? Oh, we'll see. Thanks to Secret Lab for sponsoring today's video. Secret Lab chairs are engineered to keep you incredibly comfortable for long hours at work and play. Their new Titan Evo 2022 chair. I'm gonna get that one. Keeps you feel uncomfortable for longer. It has four way lumbar support and ultra comfortable line of different seat material and more. All chairs come with up to a five-year extended warranty and a 49 day return policy. So head to the link in the description and check out Secret Lab today. Two weeks later of using this board kind of, sort of, and wow, this is not my thing, but that doesn't mean it's bad. Basically my assessment is, if this is the kind of board that you like, you'll know. I've never used a 40% board before. I've also never used an ortho-linear board before. It is hard to get used to this exclamation mark. Nope, that's a capital Q. Is it that one? There we go. You have a bunch of different layers and things that you can do. It's a little hard to remember everything. I prefer to have everything just labeled with just one key. So, you know, keys are staggered because it hearkens back from the days of the typewriter. When the little thingy that leads to the thing that strikes the key actually needs to physically be aligned. So it's just a thing that we've gotten used to. There's really no reason for it. So I totally understand why somebody would wanna go ortho-linear. So that's not really a strike against it. It's actually in its favor. So it came with this little foot thing on the bottom and I don't like it because it makes your hands go up like this. I forget what that's called in ergonomic terms. But guess what? I put these cute little feet that I just happened to have lying around on the bottom. And those worked perfectly. There's a surprisingly vibrant and active community around this board. The whole thing was crowdfunded and people are like really into this. So, I've had to kind of rethink, how I do these product overviews? I've so often just been thinking about what's best for me. I've been talking to Mike on discord and he told me about all the effort that he went through talking to lots and lots of people to figure out, what do people actually want in their keyboard in this particular niche? He's targeting a niche. I'm not in that niche, but there's all sorts of interesting decisions here that were made because of the type of person who would want this. He says it's for creators/designers. I think those terms are too broad. I think you gotta throw in, like keyboard enthusiast and person with not much space on their desk and person who can stomach having to relearn ortho-linear and use like extra modifier keys for everything. Because, the one advantage is like, everything is really close together. Whereas with my setup, I have to move my hands all over the place, even though it's always in the same spot, you know, if you're good, you can just do some sort of fancy combination of keys. One thing I do like about it is that the interface for changing things is via, which is this graphical user interface. It's fairly simple to use, which is good. Compare that to what I had to do for my QMK based has tool converter right here. And you can see, you know, it's kind of visually laid out, but it's certainly nothing compared to a straight GUI. And of course, you've gotta just write all the texts down yourself. You know, it's either gonna be this or, Ooh, this is much nicer. I can't really properly evaluate it. So all I can say is like what features it does and doesn't have, so perusing the website, for example, it kind of looks like this is gonna have API access. Like you look here and it kind of strongly implies that it has fancy access to Adobe creative cloud, DaVinci resolve, Final Cut, Ableton live blender. It has no API access. And I really think they should put that on the website. What you're doing is just putting regular keystrokes on the dials, which is what I suspected because they are discrete dials. Like they, they have obvious steps to them. You can always feel when a keystroke is being sent, which is the right choice for this kind of a use case. I particularly enjoyed using one of the dials to do undo and redo and Photoshop. There's standard stuff, like you can use a dial to increase or decrease the size of your brush in Photoshop, for example. And I've also got this one with shift where if I hold it down, it'll do the, what is that called softness, which is nice. But again, I do have a mac row that works way better than this and as much more visual, just using Photoshop's built in keyboard shortcuts. It's nice, but I already have a thing that's better. But this keyboard really made me appreciate the monogram a lot more actually and understand a lot more of the problems that go into creating something that is modular, like this one and has, in this case, these are not discrete tiles, but they do have API access and it's gotten a lot better. I, oh, I have a video about the monogram, if you wanna watch that too. But this keyboard is seeking to solve different problems, right? It's intended as a primary keyboard. I was thinking I'd maybe use it as a secondary keyboard. I've got all these secondary things already. It is, there's no reason to do that. Even though you can buy it with different key caps, some of which are blank. So you can just, I don't know, use your imagination. So here Mike says I wasn't comfortable spending 300 bucks on a keyboard I needed to build myself. It's all fun and games until you fry your board 'cause you're not familiar with DIY, you know, soldering. We're talking here about like, why didn't he make it a hot swappable key switches. Most professionals don't have time to be fiddling around with switches. Hence why we picked a good all around switch for the pre-built and then, and then offer the DIY people who really want it. I was just really impressed by how much research he did to determine what people would want in a 40% modular keyboard that also has little dials on it. And I don't get it, but I think it's, it's good. Like it's good for what it is. He actually sent me some renders of a potential num pad module, which you could put on either side of the keyboard. So that's cool. And then that makes the whole thing more modular 'cause you could move this one over to here, or you could put that one sideways. You could have a bunch of these, if you wanted to. It's kind of cool that you can just choose whatever legend you want on here. All right So, you can have blank key caps, you can have this, you can have that. So that's pretty cute. I don't like it, but that doesn't mean it's bad. Yeah, that's it that's, I can't, there's nothing more I can say. Other than to give you the information. Do 40% people like it? I don't, apparently they do. 40% people, I don't understand you. I don't understand. And maybe I never will.",
    "transcript_keywords": [
        "thing",
        "keyboard",
        "dials",
        "move",
        "key",
        "kind",
        "good",
        "keys",
        "things",
        "board",
        "people",
        "cool",
        "Secret Lab",
        "Yeah",
        "modular",
        "put",
        "Photoshop",
        "modular keyboard",
        "API access",
        "lot"
    ],
    "transcript_entity_values": [
        "400",
        "40%",
        "Photoshop",
        "49 day",
        "DIY",
        "250",
        "Ableton",
        "One",
        "long hours",
        "Final Cut",
        "one",
        "the days",
        "the nineties",
        "Mike",
        "Adobe",
        "Secret Lab",
        "Two weeks later",
        "Evo 2022",
        "GUI",
        "API",
        "five-year",
        "DaVinci",
        "four",
        "400",
        "Photoshop",
        "num",
        "RGB",
        "PCB",
        "Ta-da",
        "300 bucks",
        "today"
    ],
    "transcript_entity_types": [
        "MONEY",
        "PERCENT",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "DATE"
    ]
}