{
    "id": "OzVKzH_v3Rk",
    "title": "2019 Microsoft Surfaces",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-10-03T03:33:34Z",
    "video_url": "https://www.youtube.com/watch?v=OzVKzH_v3Rk",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Microsoft Surface Pro X",
        "Surface Pro 7",
        "Surface Laptop 3",
        "Surface Earbuds",
        "surface neo",
        "surface duo",
        "surface pen",
        "slim pen",
        "review",
        "unboxing"
    ],
    "views": 379026,
    "likes": 10373,
    "comments_count": 637,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(upbeat music) - Hey guys it's Justine and right now I'm in New York and I just got out of the Microsoft event where they announced a bunch of new products in their service line. I am such a huge fan of service, so it's really exciting to be here and to get to experience this in person. And I am sitting on a throne of surfaces right now. (electronic music) So let's walk around and check out some of the things they announced today. They announced the new Surface Pro 7, a new Surface Pro X a new Surface Laptop 3. They also announced some Surface Earbuds. And they even gave us a sneak peek of two things that won't be out until 2020. It's the Surface Duo and the Surface Neo. It's basically taking that foldable concept and having two screens so you'll be able to run one app on the left, one app on the right. We can also use one app in both windows. So the reason that they did announce this ahead of time for it to be released next year is the developers will have time to actually make things so that when it is out we'll be able to use it. So let's go walk around and see what we can see. (upbeat music) Come on, let's go Jenna. We got some secret fun happening. We are now in the room we have everything they announced today. So over here, starting with the Surface Pro X with this incredible secret hidden Surface Pen. We've got the Surface Pro 7 and the new Surface Laptop 3s And this is the new sandstone color. Most laptops that are designed this way they kinda have a little finger groove so that when you go like this to pick it up there's a place to put your finger, just a small tiny little ledge here and you lift it up. Wow that was pretty fast. - [Jenna] That's seamless. - It was pretty seamless. This is the 13 inch, this is the 15 inch. Let me give this a feel, it actually feels pretty good, It's pretty light. - [Jenna] Like could I hold it like this if I were to Oh my god! - Oh yeah, easily. It also have USBC, thank you, head phone jack and a regular USBA port. The Surface Laptop 3 is actually twice as fast as the previous generation and you can choose from two different keyboard finishes. And it has a 20% larger track pad, fast charging, but it also has a removable hard drive so this is really great for upgrading but also for security purposes. Hey do you even hear me typing? - [Jenna] Yeah, but I'm really close. - I have a very aggressive type. When we share hotel rooms, she's like \"You gotta stop it.\" - [Jenna] I mean it's aggressive. - But this is pretty quiet. - [Jenna] Yeah this isn't bad at all I can handle that. - It's actually really quiet. - [Jenna] I'll allow it. - Here's our Surface Pro 7, oh god, I just love the Surface line, they're just so cool. This is the little icy blue color. - [Jenna] Ice blue. - Ice blue, it's ice blue. I think icy blue is something that they should think about for next year. Look how good that looks. This is a poppy red, its' a nice red color. It's not too bright, but it's a nice muted tone here. (Surface Pro clicking) The Surface Pro 7 comes in a platinum in a matte black with a 12.3 inch display, you can choose from an I3, I5, or an I7 processor, four, eight, or 16 giggas of memory, storage options or should I say drives 128, 256, 512 or a terabyte. You can get up to 10 and a half hours of battery life. You can charge your Surface Pro 7 to 80% in just over a hour The front facing camera will shoot 1080p HD video with a 5 mega pixel sensor, the rear facing is a 8 mega pixel sensor and you can also shoot 1080. It has USBA, USBC, and a 3.5 millimeter headphone jack. It also has a mini display port, there a micro SD card reader, which is pretty awesome and it's also compatible with a surface dial. This one has the poppy red keyboard with the matching poppy red pen. Poppy red arc mouse anyone? I just love it. I love the design of this, it's so cool. It's like a slap bracelet. So the Pro X was one of the things that I was most looking forward to checking out because it has one of the more newer designs. So the surface pen is just hidden so neatly right here, I kept calling it like a garage or a pencil box, so this is magnetic, it also charges any time it is connected to its little garage. And as soon as you take it out it switches into the mode when you can use the pen. This is so funny, it's a full screen snip. And there it is, I just took a full screen snip. Hello Jenna. This is one of their fittest designs ever. It's only 7.3 millimeters. It also feature a 13 inch edge to edge display. It will give you all day battery life, which they said is about 13 hours, it has fast charging which should give you about an 80% charge within an hour. It can be always connected if you choose to connect it to LTE, but again one of my favorite things about the Pro X is that you can safely store and charge your Surface Pen right here. It has two USBC ports, it uses Windows Hello authentication in the front facing camera. Yeah it's really my best work. One of the things they were talking about is fast charging which is great, because I feel like a lot of times it does take a bit longer to charge up a laptop but they said you can get about an 80% charge within an hour maybe even under an hour depending upon which Surface you're using. (upbeat house music) These are the new Surface Earbuds. So it's really cool because it's basically made to work seamless with Office products. It will also do live transcriptions. So if you're speaking in English like I am now, I don't know any other languages so this can automatically translate on the fly. One of my favorite things that someone said on Twitter was they kinda look like PopSockets, little minis. Well guys this is just a first look at some of the new stuff that Microsoft announced, I'm looking forward to getting some review units. I'm so excited to get to test some of these things out so stay tuned and look for some more videos coming up. Let me know what you guys think, which one was your favorite and what are you guys most looking forward to. I know you're probably looking forward to what's coming out in 2020, the Neo and the Duo. The Pro X is something that I'm looking forward to trying out the most, so that's it. I'll see you guys later and that's the end of the video now. So, bye. (upbeat music)",
    "transcript_keywords": [
        "Surface Pro",
        "Surface",
        "Pro",
        "Surface Pen",
        "Surface Laptop",
        "Surface Earbuds",
        "things",
        "announced",
        "Justine",
        "York",
        "pretty",
        "Pen",
        "Surface Neo",
        "Surface Duo",
        "hidden Surface Pen",
        "charge",
        "forward",
        "blue",
        "red",
        "guys"
    ],
    "transcript_entity_values": [
        "Windows",
        "English",
        "PopSockets",
        "One",
        "one",
        "New York",
        "The Surface Laptop 3",
        "about 13 hours",
        "an hour",
        "Justine",
        "USBA",
        "Surface Laptop 3",
        "256",
        "LTE",
        "Office",
        "the 15 inch",
        "only 7.3 millimeters",
        "USBC",
        "2020",
        "16",
        "The Surface Pro 7",
        "80%",
        "jack",
        "Surface Pro X",
        "12.3 inch",
        "Twitter",
        "Surface Pro 7",
        "5",
        "13 inch",
        "four",
        "20%",
        "the Surface Pro X",
        "the Surface Neo",
        "8",
        "1080p",
        "I3, I5",
        "up to 10 and a half hours",
        "I7",
        "SD",
        "Surface Pen",
        "eight",
        "today",
        "Surface",
        "1080",
        "next year",
        "the Surface Pro 7",
        "Surface Laptop",
        "two",
        "128",
        "Microsoft",
        "the Surface Duo",
        "just over a hour",
        "3.5 millimeter",
        "Neo",
        "first",
        "Jenna",
        "512",
        "the 13 inch"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "LANGUAGE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "TIME",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "EVENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "QUANTITY",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY"
    ]
}