{
    "id": "P32OKr74NPQ",
    "title": "Upgrading our FREE internet to 25 gigabit! - Running Fiber to our Merch Office",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-07-08T17:00:29Z",
    "video_url": "https://www.youtube.com/watch?v=P32OKr74NPQ",
    "category": "Science & Technology",
    "tags": [],
    "views": 4018065,
    "likes": 95955,
    "comments_count": 3340,
    "description": "Its no secret their chairs are great! Check out Secretlab at   Get 69% off any of XSplits video tools. Use code LINUS at   The free wireless internet we installed for the lttstore.com merch team has been awesome, but because we didnt install it properly, its limited to speed of 1 gigabit. Today, we fix that by running 25gig fiber optic Ethernet!  Discuss on the forum:   Buy InfiniteCables Single Mode LC Fiber Patch Cables:  Buy InfiniteCables Single Mode LC Fiber Couplers:  Buy InfiniteCables Fiber Pull Eye Kit:  Buy InfiniteCables Single Mode LC Fiber Attenuators:  Buy 25G BiDi Single Mode LC Transceivers (1270/1330):  Buy 25G BiDi Single Mode LC Transceivers (1330/1270):  Buy Ideal 31-398 Yellow 77 Plus Wire Pulling Lubricant:  Buy an Ubiquiti Switch Enterprise 48 PoE:  Buy an Ubiquiti Switch Enterprise XG 24:  Buy an Ubiquiti airFiber 60 XG Wireless Bridge:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 I'm not paying for their internet 1:31 The Gameplan 4:45 The not-jank solution 9:01 Side Mission: LTTStore Leaks 10:23 Communication is key 16:14 It's working 18:36 How to pull cables through a conduit - a tech tip 26:09 Testing if it's working full speed",
    "description_links": [
        "https://lmg.gg/secretlab",
        "https://lmg.gg/XSplit",
        "https://linustechtips.com/topic/1518089-upgrading-our-free-internet-to-25-gigabit/",
        "https://lmg.gg/9WNVW",
        "https://lmg.gg/V7tLM",
        "https://lmg.gg/PxOe4",
        "https://lmg.gg/tkL4X",
        "https://lmg.gg/iJfe6",
        "https://lmg.gg/9Ulpm",
        "https://geni.us/BfcwP",
        "https://geni.us/cL0TzXX",
        "https://geni.us/wLsBYI0",
        "https://geni.us/Gb1QL",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "When we expanded our space to give the Creator Warehouse Merch team their own building, I outright refused to get them their own internet connection which sounds unreasonable until you consider my perspective. I already pay for commercial internet right over there. A line that actually has to run through the D mark in this building. So why should I pay for a second internet connection? That's why we set up a Ubiquiti AirFiber XG. A dish setup that allows you to wirelessly beam internet between two locations. At speeds of up to six gigabit per second which sounds great, right? And to be fair, they are pretty great when they're set up properly. We just aren't wireless install techs and we made the mistake of mounting them on poles that are so short that the wireless signals flying between the dishes hit the side of the building on the way. Which actually limits us to about one sixth of the theoretical max. Now, we could fix this with some taller dishes but the proper solution is always going to be hardwired. The question is just how? And the other question is who will sponsor this video? XSplit, level up your live streams with simple yet effective broadcasting and video production tools for use on platforms like Twitch and YouTube. Check out XSplit at the link below and use code Linus for 69% off your first purchase or subscription, funny number, but it's real. So our first thoughts were not gonna lie, pretty jank. See the electrical mechanical room for this building which is actually the one for this entire three building complex is right here. Literally 25 paces, a stone's throw or a wrench's throw as it were from our building across the parking lot. So it did occur to us to just string a wire between the two buildings or hack a micro trench into the parking lot and hope that nobody complained. But believe it or not, we've been trying to get away from jank lately. Thankfully, there's a solution because this is a three building development. There's already conduit between the main mechanical electrical room here and the one in our building. We just have to find it. Oh, well, it's this one. Obviously it's not gonna be quite that simple though. You see that conduit goes to the very opposite end of our building, which is not where our unit is. Also, I couldn't help noticing it's really full. How the devil are we gonna do this? Oh, we don't need that for that. That's to go to create a warehouse from here. There's already fiber that goes over to our building. Yeah, but aren't we using it? Sort of. This giant cable, which looks suspiciously like the one we ran through the woods is where the fiber comes into the complex. It runs up into this distribution box where the fiber is actually terminated. These two cables here, because we have our own dedicated wavelength are our internet. These other ones are for everyone else in this building. In fact, our old connection actually breaks off of it here. You can see Linus Media. This is plugged in and doing nothing. Sick. Yeah. Our dedicated wavelength runs over this really thin cable, loops around there, over to this guy. That giant box just has a switch and a battery backup in it. Can confirm. Is battery backup? Is fiber optic network switch? Here's the upstream to the provider that we showed you before. And then here's our downstream fiber pair, which comes out here and goes into this box, which actually raises some questions even for me. This is a switch with just one thing in and one thing out. Isn't that just a cable with extra steps? Yeah, I think they do like their speed limiting and stuff in there, like routing and whatnot. So this is not to our benefit. This is so that they can control our shiz. Yeah. Got it. Okay, fine then. Why don't we get to the part where Jake said sort of. In this box, the fiber cable from the switch is coupled into the big cable that runs over to the studio. You can even see on this helpful label, 12 single mode fibers. Hey, that's a lot of fibers. Yeah. It's 10 more than we're using right now. You can actually see it says fibers, zero three to 12 are dark. That means they're not in use, which is great. We can just terminate a couple of those fibers and we don't even have to run a cable, right? It's not what you told me before we started this. Yeah, it's not. We don't own this cable. And while we probably could get permission to use it, there is an easier way. This right here is a perfectly ordinary single mode duplex fiber optic cable. It's got two strands in it, one for send and one for receive. But the thing is single mode fiber can carry many wavelengths of light at the same time without hurting the signal. That means instead of using two fibers to run from our ISP switch to our rack, we could install a special bi-directional transceiver that uses a separate wavelength of light on the same fiber for transmit and receive. That's gonna free up the second fiber on our existing cable. So the part that we are actually allowed to be using for us to send internet back from the other building over to create a warehouse. Well, sort of, just to here. Well, to here, but that's why we have this to go from here to there. Yeah, that's gonna be fun. Don't worry about it. Question for you. This seems like the kind of thing that's gonna knock out everyone's internet access. When has that ever bothered you before? What is going on here? What the hell? There's like 40 people in this building. I can put them on the backup, yeah. Oh, right. Okay, yes, we actually do have backup internet now. It's so cheap. Is there a reason we don't just use the backup? It's not commercial grade, blah, blah. For like 120 bucks a month, we can get internet that's faster than what we paid like five grand a month for here when we first moved in. There we go, done. We're on the backup. In theory, the connection automatically fails over anyways. It's just that it takes like 15 seconds. Nope. So I just forced it. I set the backup as the priority one. Hopefully nobody notices. Hopefully nobody was in the middle of an upload. We could have checked that. Anyone, middle of an upload? Anyone uploading? To where? To where? These people. To the internet. Nope, no. I mean, is your computer working? Yes. Then no. Okay. See you later. Nobody was uploading anything. We're all good. Sort of. There's still activity on the WAN and I was thinking about what could this be? It's parsec because it's port forwarded to that specific WAN interface. And then on top of that in parsec, you have to like define your external IP. So any editors that are working offsite right now. Are gonna get kicked off. I see. How quickly can we have this up and running? Can we just ask them to take lunch? Yeah. In theory, it should only take the amount of time that it takes to put that transceiver in. In theory. Hey. I lied. Parsec doesn't work right now. They may have scheduled maintenance. Oh, so parsec was already broken. Yes. Cool. I'm here. Let's move on. Okay. Do you wanna go over there and... Are we doing this like a, you know, nuclear, you know. Do you trust yourself to unclip the like LC duplex clip? Like take the two fibers apart? I've never done it before. So I'm just gonna YOLO it. But okay, cool. That's the answer I needed. You need the transceivers which are in creator warehouse. So you should grab those. Cool. I haven't disconnected it yet. It will stop working. It's not hard for him to act exasperated and walk away from me. He's just like that all the time. Wait, well, I can't just take one of these. They're not like duplex connectors in that you can just use whichever one on either end. Oh, are they paired? Think about it, right? If you're transmitting and receiving on different wavelengths, if you did transmit on the same wavelength on both sides, you would be shining light into light. And then the receiving on both sides would be getting nothing. And they would actually potentially burn each other out. Yeah. That is really a thing. So lasers swapped. So they're kind of paired, but not really. These are all one side. Oh, I see. So you see it says 1270, 1330. The other side is 1330, 1270. Makes sense. Yes. So if you're going to use bi-directional fiber transceivers, pay attention to that. Make sure you don't order all the same ones because they will not work. All right, cool. Lots of cool stuff coming over here in Creator Warehouse. We've got the RGB shirt in charcoal. And hey, let's leak that. Matthew, can I have that? Yeah. Oh, the laptop bag is going to be so awesome. Luggage strap, magnets. It's going to fit 14 inch laptops, even with a big caboose. Look at all that wire holding and wire management. Oh, okay. I don't want to talk about the 16 inch one yet. I guess that's leaked now too. Anyway, the point is, here they are. Fiber optic transceivers. Were the guys over here complaining about the internet speeds? Complaining? Ah, no, I don't think so. Matthew, have you guys actually had internet reliability issues over here or? It turns off and on here and there. Oh. I havent had any problems with speed, I also don't do anything too crazy, that's the problem with transceivers. I see. I didn't realize that it cut out from time to, okay, well that explains why we're doing this. Cool, I thought Jake was just like, oh, this is cool, I want to make a video. Which is fine too. Are we going to need these attenuators? Jake didn't mention anything, but when you have overpowered transceivers, these can help to knock down the signal strength a little bit to keep them from burning each other out. But I don't know, if he didn't say anything, then I guess I'm not going to bother. What could go wrong? What could go wrong? My company could have no internet, the whole thing. Woo. I'm trusting Jake. Hello? Hello? Okay, there's one more thing to mention. Oh, do I need the attenuators? We shouldn't need it right away because it's in theory in spec. There's a bunch of couplings in the chain already, so there's already going to be a decent amount of signal loss, but yeah. Okay. So are you going to unplug yours now? I mean, that is plan, yes. Quick Q for you. Oh wait, no, I'm in the wrong box. Wait, what do you mean? How are you in, what box are you in? You should just be- Don't worry about it, the switch. Yeah, the switch. And you're taking, not the upstream one, the downstream one. Oh yeah, no, I'm in the switch box. Yeah. You weren't before, eh? Oh yeah, I was. Oh yeah? Yep. Okay, well- I'm just keeping my ladder exactly where it was. Yeah, you didn't move a ladder, right? No. Just get all my pieces aligned here. I need to have these ready because the last thing that we want is to accidentally get these fibers dirty or damage them. So I'm just gonna, without touching the very ends, pop those little caps on. All right, our internet is now down. It's out. Oh, he unplugged it. Okay, we're going. Oh no, oh God. Now I'm going to pop out the transceiver that was in there. What are you talking about, Jake? Are you talking right now? I'm having problems. I'm gonna mute now. Bye. And I'm the one who needs adult supervision. You see this one fiber's coming out? Yeah, I couldn't push the lock down and it was really hard to get out. Now I'm gonna pop it out of the duplex clip just like that. Which fiber are you gonna use? The left-hand one or the right-hand one? I was gonna ask you, they're color-coded. So why don't we just go with blue or white? They're not color-coded on my side because there's like four different cables in between here and there. Oh my God. So just use the left-hand one, assuming that you didn't take them out without realizing which is which position. Left from what orientation, Jake? Well, like if you're looking at it plugged in. Okay, let's orient based on the clip. Your finger is on the release, yeah? And I'm staring at my thumbnail. My thumb is on the release and I'm looking at my thumbnail. The left-hand one. The left-hand one. I mean, we'll find out pretty quick. It's in my right hand though. Oh my God. Okay, great. That's cool. I believe you can figure it out. Do I have to break it to get it out? I've never done this before. What? What? You're lying. Shut up. What do you mean break it? You're breaking it. How would you break it? You have to take the fiber out. I'm gonna plug my side in, so. Okay. Take this guy. Now I get in. Oh, it touched the end of the metal. That was bad. There we go. What's the problem? I am just trying to figure out how to get this apart without breaking anything. Okay, well, I'm plugged in. I'm gonna come over there now. Sure. Before we go over there and help him, I'm gonna plug in this other transceiver. This is a 25 gig transceiver that's gonna be providing the internet back to Creator Warehouse, so we don't have to come back here and do it again later. And then we're gonna plug this into our 25 gig Dell switch here. There we go. See, I've got my one fiber, and I just put that bad boy in there. You figure it out yet? Oh, yeah, I was just calling you. You don't answer your phone. Oh, that's fine. I don't see a link. Oh, that's not good. I can try the other side. Oh yeah, wait, hold on a second. Hey, there we go. Oh, really? Yeah, no, we're done, because if you have two ends of the cable, it would be the opposite that would be the corresponding one. Yeah, that makes sense. Hey, math. So it's working. So it's working. Yeah, we have a link. So you can leave that one. That's already plugged in on the other side. Wait, this is already plugged in on the other side? Yeah, I figured it might as well, rather than coming back. I was gonna tell you, I only have one CI. These are both GE. Yeah, the CI is for Sienna, which is the brand of switch. FS.com sells transceivers and all the different switch brands. And in theory, a lot of them don't care. And you can just use the generic, which is what GE stands for. I just picked Sienna, so we hopefully wouldn't have problems. I thought that was the coding for the wavelengths. No. Okay, let me wrap my brain around this. We're doing send and receive. That's our internet. That's our internet. This is Creator Warehouse's internet connection from over there. Back. Right, so I have to plug this into... Nothing. A cable. Do we have a coupler? Yes. Oh. It's working though, right? Yeah. I guess I could just go check. We should probably put an attenuator in there now that it's working though. Do you have attenuators there? No, I left them over there. Okay. How much do you want? I was just gonna do two because we already should be within range. Cause like every coupler, which if you think about it, there's at least three, maybe four is gonna have a little bit of loss. So I was thinking two DB would be fine. I mean, we could do five. See if it works. If it works, then we're good. As I mentioned before, an overpowered transceiver can burn out the unit on the other side. So since these are 10 kilometer transceivers, if we put a five decibel attenuator, so that is intentionally causing five decibels of signal loss, that should help to prevent any kinds of burning out mishaps over the longer term. And we're linked. Just like that. And I'm apparently supposed to figure out which of these conduits goes to the creator warehouse unit. Something we could do is we could go to the other side and see what color and characteristics the pull cord has. We got blinky lights. Look at that, it's online. That's the backup. That's the main one. Can't believe this worked. Okay, now we change it back and hope that nothing borks. Hey, look at that. The speed test servers here aren't really fast enough to do the full 10 gig, but it's working. Wow, I can't believe we just unplugged our internet and didn't take everyone's internet down. That's so cool. Oh, oh Jesus. Wow, he's really, he's into it. He's not even in there anymore. That conduit doesn't actually go to the electrical room here. I didn't even tell him where the conduit comes out. I hope he's figured that out himself, but. Maybe in here. Is it bad to waste Linus time like this? Like I feel a bit bad just from the time wasting aspect, but he would totally do something like this to me. So then I feel much less bad. You know, you figure it out yet? Where the conduit is? Is this a bad time to tell you I already know which conduit it is? It's under the sink. You were on track though. Were you following the fiber cable? Yes. Yeah, okay. Look at how professional that install is. Oh wow. Look, it comes down here. You can see the fiber box in there. Oh my God, this leaks. Just hanging on. Are we not gonna fix this plumbing? Who did this? Which part? These completely unprotected fibers are just hanging here. Good old Telus techs. I don't believe Telus did this. Really? No, they screwed it into something. In theory, we could have just used Telus's existing fiber, but then, you know, we don't really own that, so. Oh yeah, why don't we just do that, Jake? Well, because I want to pull, I want to do it properly. Because I want to pull fiber. That was the real answer, and then he corrected himself. So though, you see the orange and white string in there? You see how there's like three conduits? Is the box open right now or no? No. LTT screwdriver, lttstore.com, let's go. Kind of wish I had this stubby right now though. It's weird for you to wish to be shorter, hey? Yeah. And I just start pulling on this, right? Oh yeah, definitely. Should we pull both fiber cables? Like just? No. I don't think there's any reason to, because we're only gonna use one of them anyways. Great, okay, see you in a few. Okay, so there's a few things to keep in mind when you're pulling a cable through a conduit. Unfortunately, this cable was supposed to come with pull loops, which would just be like a little plastic or steel thing that's integrated into the cable to make it easy to pull. It doesn't look like they got made with those, so instead, we're just going to electrical tape the pull cable to the cable and hope that it doesn't come off. The other thing to keep in mind, when you're pulling the cable through, you are using your pull cord. This pull cord is gonna come all the way out and there's no longer going to be a pull cord in there. So we need to pull one with the new cable at the same time. So we take the pull cord out and we're replacing it with a new one. Hello? Hi. Okay, I'm gonna pull on this a little bit. Hold on, hold on. No, it's not still tied. I untied it, so do not just start reefing on it. Okay, I've got a good grip. Okay, I'm just gonna pull a little bit just to, you feel that? Nope. You feel that? Nope. You're lying. Not lying. How about you pull it from your side then? Okay. See anything? Brother, I did this yesterday. You're just with me. I'm not. Pull more. There we go, now it's moving, pull more. Okay. There we go, okay, this is the right one. Beautiful, okay, stop pulling. I gotta do some taping here, so just give me a minute. I'm gonna start by taping these fiber ends because this is the most important part. We don't want to damage. I don't want these caps to come off while we're pulling it. And I don't want to rip the connector off. Do we have any lube, like yellow 77 or whatever? There was very little resistance when I tried this, so I think it's probably okay. Okay. I would strongly recommend using lubricant if you're pulling cable through conduit though. It makes it a lot easier and you can get these very low residue ones that won't break down the sheathing of the cable or anything like that. Yeah, and if you don't have it, basic hand soap is a really good option. So I tied it between the two pairs, which are protected with electrical tape, and then I'm gonna wrap it like crazy. You really, really do not want this to come off mid-pull because then you are out of luck. You ready? Almost. I just got to tie up the twine, the replacement pull cord. Take your time. Got all day. What? What? What'd you say? What? Huh? Huh? Okay. Do you want to pull a little bit now? You know, Jake, there is a fair bit of tension on this. That's okay. It's moving smooth on my side. Okay. We should have lubed this. We can lube it if you want. We should lube it. Oh God, like dish soap. Yeah. This should be fine. We're lubing her up. All right. Can I start pulling? It's nice and lubed. All right. Just keep lubing it. I put lots of lube in the hole. Don't worry. Oh, wow. This is definitely. Slow down. Stop, stop, stop, stop, stop, stop. And just tangled up here. Hold on. Okay. Wow. It really does slide nice now, eh? Oh yeah, bud. Oh boy. This is not good. I don't really want to have to unspool 200 feet to untangle this, but. Oh, Jake. Yeah, I was kind of thinking we just go out the door. Jake, Jake, Jake. I'm not angry, son. I'm disappointed. Look, it could have just been wrongly wrapped from the factory, but then I would have to be mad at infinite cables. And we all know that that's not possible. No, it's definitely not possible. Probably because we were shaking it around before we shot a bunch. Oh, I see. What I'm trying to say is. Oh, I see. Yeah, it's your fault. I see, I see. So this is on me now. Yep, 100%. Okay, we're done. Okay, we're good. Hey, all right. Really? Did you just do that? He took the whole neatly spooled thing that we just did and he just dropped. He just threw it on the floor. Should be fine. I'm in position. Okay, you can start pulling now. Okay, can you imagine there was like two more feet? Yeah, come on, buddy. Anytime you're ready. Hold on, I think something might be coming through. It's a boy. It's really wet. Yeah, well, I poured it in the hole, so. Oh, how the hell am I supposed to get this undone with it all slippery like this? Gee whiz-a-curs. Might have overdone it a little bit. Question now remains, how do we get it from here to the closet? No, you know the answer to that. What, this? Yeah. Oh, yeah, but see about that. No, stop, you know. No, I don't. Shut up. This is UPC. You see how it's green? Oh. That's the angled connector. They use that on passive optical networks. Like when you have fiber to the home, it's a passive optical network. They use that so it doesn't shine back, like reflect back off the connector. This does not, so if you put them together, it won't work. And I did order an adapter, but it doesn't look like it showed up. For now, we can try it by moving the switch over here, or we pull this all the way over there. I was thinking we just move the switch here. Oh, God, Jake. Just plug the switch in here. It's fine. We can't put the switch here. Just for like a day or two until the adapter arrives. Do you know how many times we've deployed something for a day or two? Well, then we won't deploy it. We'll unplug it after. Do you have a patch cable that we could at least just like run in a not awful way over there? Oh, yeah. Why don't we just do that then? It's not gonna be any worse than what they did. Yeah. Yeah, run it along the baseboard. Up here and over here and over here and down here and through here or something. Oh, it's not coupled. We gotta grab a coupler. I'm gonna come back and do this properly later. But for now, we're just gonna couple our cable into our extra little fiber up there. Put our fiber into the coupler. That one side still has a cap on it for now. And then take this guy and plug it into there. So I'm on the right side, the white side on this side. There we go. Okay, I couldn't find another coupler. So I'm gonna do something naughty and steal it from this box. Thanks ISP, appreciate you. Don't tell anyone I did that. Wait, where's the coupler? No, jeez, boop, okay, awesome. We need a transceiver. I will go get one. The existing switches we have over here, these UniFi Enterprise 48s don't have 25 gig. So we're gonna put in an XG24 Enterprise, which is a 24 port 10 gig switch with two 25 gig ports. And then from here, we can kind of patch over. We can use two 10 gig links to give 20 gigs of connectivity between here and these or whatever we wanna do. We also might just not put this switch here and just have a 10 gig link between the buildings. It's, you know, they've been operating on gigabit for over a year and it's been fine. So 25 gig is probably overkill, but fuck it, right? Okay, I should be a pro at this now. Pretty smooth. The last time took a lot longer. Ready? Whee. Oh, jeez. Sorry. Scratch this. Sorry, sorry. Let's catch you guys up. Jake moved the switch out of the network closet because this direct attach copper cable is not very long and we needed to plug it into this computer. And this is a 25 gig NIC. Yes, sir. All right. Let's see it running at full speed. Yeah, the connection's actually working now. That's another update. Oh, cool. Oh yeah, what happened? When you're using like 25, 50, 100 gig, you run into forward error correction when you're running at those crazy speeds and they expect forward error correction mode 74 and the Dell by default defaults to nothing. Cool. You can see with a direct attach cable, it doesn't matter when you start to move to actual optics. Got it. Then it matters. So we set it CL 74. You can see right there. Nice. And it worked. I didn't put an attenuator in there yet, but we can see the receive power is minus two DB. And if you look at the product page, the overload happens at two. So we should be okay. We could put a, I'll probably put one on there anyways. Put a two DB in there. You can also see it's only transmitting at like minus 0.5 and it can transmit at up to four DB. So it's going to automatically adjust. We're in the range. I might just leave it, but we'll see. Any who. Yeah, internet. Well, let's just just do a speed test. Obviously the best way to screen cap. I'm sorry. Hey, that's about as fast as I can ever get out of a speed test. Yeah. Our internet is 10 gig, but the speed test servers on the other end, not so much. That makes sense. The upload should be faster. It might be. More importantly, let's have a look at what kind of speeds we get off of our NAS, which is over in the other building. What are you doing? Trying to find, there was 150 gig files. Fine, just go with that. Doesn't have to be, just go to the 10. Yeah, just eight gigs. That's a lot. That's a lot. That's a lot. Okay. That's 800 megabytes. That's it. It's SMB, man. You're not going to get. I've seen faster than that. Yeah. It could be the system. Let's try going back. Oh, look. Not even one gigabyte a second. I love SMB. It's great. It's quality. This isn't a limitation of like the connection. This is a limitation of single client SMB. And if we had more than one client, we would be able to overcome this limitation and saturate more. Here you can see that one core is just pegged. Yeah. What if I try and copy two files at one time? Oh, I got to start separate. No, I got to do separate transfers. Hey, it's exactly this. Hey, that is a little higher. No, it was 800. Wasn't it? No, it was like seven. Okay, now it's down to the same. It's basically the same thing. You know what we need? He knows. Cho Easy Copy. Oh, you weren't even thinking that? Jake's favorite piece of software. The point is just, this is like seven times, eight times faster than what we had before. And it won't go down in inclement weather. Which to be fair, the dish hasn't really gone down in inclement weather. Wasn't there the one time with the snow? There was the one time with the snow, but they also, it was still like early access firmware up until like a month ago. So overall, I'm actually really happy with it. It has been shockingly stable. It goes down for like one minute every couple of days, but it's usually in the middle of the night. And it hasn't been doing that since it's been updated to like mainline firmware. That's cool. Well, we should just leave it in place as a backup. Kind of like what we have over at the lab. Yeah. Okay, it's back. And it's exactly the same as it was doing before. All right. High five. SMB, woo! We're not really done yet though. This raises a pretty important question. Why doesn't everyone just use bi-directional transceivers for everything? Really Jake? Well, the transceivers are a lot more expensive than standard duplex transceivers. For example, the 25 gig transceivers we got for this project are more than double the cost of the duplex transceivers that we'd use otherwise. And okay, $50 versus $120 isn't huge. But if you were to multiply that by a hundred or a thousand servers, suddenly the extra fiber cabling sounds like a pretty good deal. Unless your cable is really expensive. Imagine this, you got like a 20 kilometer run that's already there. Right. And you need more throughput. You've maxed out that throughput. There's no room in the conduit. The city's not gonna give you a permit. Or, you know, running that cable costs you a million dollars. You take your duplex, you split it. And now you have double the throughput. Now you have double the throughput. Except, okay, you know how we talked about two different wavelengths through a single fiber for send and receive. Many ISPs would actually be using a far wilder setup called multiplexing where they use duplex fiber and they're running a ton of different wavelengths through each one and then splitting it out on the other side. We actually saw this. This is wild. Look at this. From the Z16 facility tour. Holy. See, I told you. No, no, use this footage. It's wild. But look at that. That's so cool. So cool. Like this segue to our sponsor. Secret lab. Sitting long hours in an uncomfortable chair can take a real toll on your back and your spot on the leaderboard. Whether it's business or play, Secret lab chairs are designed to keep you comfortable throughout your gaming session or work grind. Their Titan Evo 2022 series chair offers four-way lumbar support, comes with a magnetic memory foam head pillow, and is offered in several upholsteries like hybrid leatherette, soft weave fabric, and Napa leather. With their cutting edge designs and top-notch materials, Secret lab chairs are engineered to provide unrivaled comfort and support so you can game, work, or relax in style even if no one can see you. Best of all, a five-year extended warranty is included along with a 49-day return policy, so you're covered if anything goes wrong. Head to the link in the description and check out Secret lab today. If you guys enjoyed this video, you might enjoy the one where we- Air fiber. You should watch that one. Yeah, watch the one with the dish. And then if you didn't understand the wrench joke from earlier, it'll make more sense. That was Antoine, hey? It was like his first week. Hit his car.",
    "transcript_keywords": [
        "Yeah",
        "fiber",
        "cable",
        "Warehouse Merch team",
        "Creator Warehouse Merch",
        "internet",
        "Jake",
        "pull",
        "switch",
        "side",
        "building",
        "Merch team",
        "Warehouse Merch",
        "put",
        "gig",
        "Cool",
        "Creator Warehouse",
        "transceivers",
        "time",
        "fibers"
    ],
    "transcript_entity_values": [
        "40",
        "one gigabyte",
        "one",
        "a hundred or a thousand",
        "20",
        "100",
        "50",
        "eight",
        "UPC",
        "RGB",
        "zero",
        "Cho Easy Copy",
        "seven",
        "800 megabytes",
        "Dell",
        "minus two",
        "49-day",
        "the Creator Warehouse Merch",
        "50",
        "long hours",
        "like 120 bucks",
        "like 15 seconds",
        "a day",
        "LTT",
        "16 inch",
        "three",
        "1330",
        "Jake, Jake, Jake",
        "Matthew",
        "Linus",
        "three to 12",
        "Creator Warehouse's",
        "minus 0.5",
        "the middle of the",
        "about two",
        "24",
        "five decibel",
        "ISP",
        "first",
        "14 inch",
        "120",
        "CI",
        "jank",
        "this yesterday",
        "YOLO",
        "25",
        "Antoine",
        "Gee whiz",
        "YouTube",
        "up to four",
        "Twitch",
        "five-year",
        "a month ago",
        "Creator Warehouse",
        "up to six",
        "NAS",
        "between two",
        "Jesus",
        "at least three",
        "more than one",
        "a million dollars",
        "IP",
        "Ubiquiti AirFiber XG",
        "1270",
        "1330",
        "four",
        "UniFi Enterprise",
        "about one sixth",
        "Telus",
        "20 kilometer",
        "Parsec",
        "200 feet",
        "five",
        "10",
        "74",
        "a ton",
        "Napa",
        "100%",
        "150",
        "Linus Media",
        "GE",
        "10 kilometer",
        "12",
        "Sienna",
        "two",
        "five decibels",
        "parsec",
        "every couple of days",
        "second",
        "NIC",
        "Jake",
        "69%",
        "today",
        "day",
        "one minute",
        "WAN"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "TIME",
        "MONEY",
        "TIME",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "NORP",
        "ORDINAL",
        "QUANTITY",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PERCENT",
        "DATE",
        "DATE",
        "TIME",
        "ORG"
    ]
}