{
    "id": "p34FwjEZfOc",
    "title": "Will Nvidia Chips Be Inside Everything? (Nvidia Purchases Arm)",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-10-16T16:59:20Z",
    "video_url": "https://www.youtube.com/watch?v=p34FwjEZfOc",
    "category": "Science & Technology",
    "tags": [
        "nvidia",
        "arm",
        "soc",
        "chip",
        "phone",
        "ai",
        "machine learning",
        "acquisition",
        "gpu",
        "graphics",
        "qualcomm",
        "apple",
        "samsung",
        "snapdragon",
        "bionic",
        "cpu"
    ],
    "views": 281829,
    "likes": 16628,
    "comments_count": 613,
    "description": "Buy the CORSAIR 4000D at   Why did Nvidia buy Arm?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/txnWf",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Nvidia is trying to strong-arm its way into more devices than ever before. And yes, if you can forgive the terrible, terrible pun, today's video is going to be about Nvidia's acquisition of Arm. Now at first, the two companies don't seem to be likely partners, given that they mostly operate in different spaces, Nvidia in dedicated graphics and Arm in more general-purpose systems on a chip for smartphones and mobile devices. But like many tech acquisitions, this one is about Nvidia getting a foothold in what it thinks will be a lucrative market in the future. Not only are Arm designs at the heart of nearly all smartphones, both iOS- and Android-based, but they're in IoT devices, embedded systems, and even in AI applications, which is something right in Nvidia's wheelhouse. You see, even though Nvidia is better known for consumer graphics, GPUs are actually powerful chips for machine learning too because they're very good at processing parallel workloads, that is, workloads that can be chopped up into pieces with the processor working on multiple pieces simultaneously. And Nvidia has already leveraged this fact to make products for deep learning in self-driving cars, retail, and surveillance. But Arm gives them a huge leg up in, (chuckles) arm and leg, a huge leg up in the AI market. Although the phrase \"machine learning\" might conjure up images of large-scale server farms working on incredibly complicated problems, AI on a much smaller scale is starting to become more common and more important. In recent years, Arm has released machine learning-capable processors for smartphones and IoT devices, with the goal of allowing these gadgets to learn on their own without having to rely on the cloud. Think about photo enhancing algorithms for phones or object detection on an autonomous car that will work even if you're in an area with little to no network coverage. But because Nvidia has been in the GPU business for such a long time, the company is in a good position to use Arm as a vehicle to get more advanced AI solutions into many more devices. Although Nvidia has actually tried to get its Arm-based Tegra chips into phones in the past, they didn't have much success partly because of price. But this time, Nvidia is just buying the whole enchilada. On top of that, remember that Arm's business model is not to make the chips themselves but to license out their designs to a huge array of other companies. And because Arm has so many licensing agreements in place already, Nvidia might be able to quickly start competing in lots of different markets. And it isn't just about the small gadgets, either. In fact, Nvidia is planning to build an Arm-based supercomputer for AI research and machine learning. And yes, it's similar to that thing in sci-fi where a machine figures out how to make more of itself. But such a momentous merger isn't just gonna happen without the world raising some eyebrows. Although this is the case with a lot of large mergers due to concerns about one company dominating a certain market, there's also another wrinkle in that even though Arm is a private firm, they've been called the \"Switzerland of the semiconductor industry\" because the company is rather neutral about who they license their chip designs to. For example, both Samsung and Qualcomm use Arm-based chips, even though they're directly competing in the smartphone space. So the concern is that although Nvidia has promised to keep Arm neutral for the time being, Nvidia may not want to license Arm technology to companies it's in more direct competition with down the line, a possibility that may hurt Nvidia, as the deal still has to clear regulatory hurdles in order to be approved. But if it does get approved, who knows? Maybe one day you'll be able to carry around a full-on gaming rig in your pocket, assuming it doesn't literally burn a hole through your trousers. This episode was brought to you by Corsair. Check out the Corsair 4000D airflow computer case for outstanding cooling in a stylish package. You can route your major cables through a single channel with 25 millimeters of space behind the motherboard. It comes with two Corsair 120-millimeter air guide fans with anti-vortex veins to concentrate air flow and enhance cooling. And if that's not enough, you can fit up to six, yes, six 120-millimeter fans, or four 140-millimeter fans, plus multiple radiators, including 360 millimeters in the front and a 280 millimeter on top. So check it out today at the link below. So thanks for watching, guys. If you like this video, give us a thumbs up, hit subscribe, and be sure to check us out in the comment section, where you can give us tips and suggestions for topics that we should cover in the future.",
    "transcript_keywords": [
        "Nvidia",
        "Arm",
        "devices",
        "machine learning",
        "Nvidia acquisition",
        "machine",
        "Armbased Tegra chips",
        "learning",
        "chips",
        "Armbased",
        "Nvidia wheelhouse",
        "Corsair",
        "IoT devices",
        "Arm designs",
        "license Arm",
        "smartphones",
        "hurt Nvidia",
        "Arm business",
        "leg",
        "Arm neutral"
    ],
    "transcript_entity_values": [
        "Qualcomm",
        "280 millimeter",
        "IoT",
        "Tegra",
        "Corsair",
        "about one",
        "360 millimeters",
        "AI",
        "120-millimeter",
        "the \"Switzerland of the semiconductor industry",
        "Samsung",
        "recent years",
        "140-millimeter",
        "4000D",
        "first",
        "Nvidia",
        "25 millimeters",
        "two",
        "Android",
        "four",
        "GPU",
        "one day",
        "six",
        "six 120-millimeter",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "DATE"
    ]
}