{
    "id": "P4Wtm3h4LdE",
    "title": "Note 5 Pro Durability Test! - Scratch Burn and BEND tested!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-09-08T10:01:18Z",
    "video_url": "https://www.youtube.com/watch?v=P4Wtm3h4LdE",
    "category": "Howto & Style",
    "tags": [
        "Note 5 pro",
        "Xiaomi note 5 pro",
        "note 5",
        "Xiaomi",
        "Note 5 pro durability test",
        "How durable is the Note 5 pro",
        "lastpass",
        "lastpass login",
        "password",
        "password generator",
        "lastpass chrome",
        "lastpass download",
        "lastpass premium",
        "random password generator",
        "generate password",
        "password manager",
        "recover",
        "lastpas",
        "laspass",
        "lastpass premium features",
        "delete account mobogram",
        "lastpass.com",
        "how secure is my password",
        "last password",
        "scratch test",
        "durability test",
        "mobile phone",
        "cell phone"
    ],
    "views": 1695432,
    "likes": 42744,
    "comments_count": 5527,
    "description": "The Xiaomi Note 5 Pro was released early this year. Is this Note 5 pro a durable budget phone? Thanks to LastPass for sponsoring this video!  Click here to start using LastPass now!   Xiaomi hasnt always passed my durability tests in the past! Its time to see if This Note 5 Pro is durable or not. Xiaomi is one of the largest smartphone manufactures in the world. But still needs to be tested.  Awesome Smart Phone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://bit.ly/2C0YppU",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "This particular video is sponsored by LastPass. Huge thanks to them for making it possible to visit a phone I might not have gotten to test otherwise. Switching phones can be a pain. That's one of the reasons I've stuck with my own Galaxy S8 Plus as a daily driver for so long now. One app that can make switching phones easier is LastPass. Already used by millions of people, LastPass has the ability to generate long, secure, and encrypted passwords that you don't have to remember yourself. It stores all of your passwords for you so you don't need to write them down or use that same unsecure password for everything. It's worth a shot if you spend any amount of time on the internet. Whether you're on your computer or your cell phone, the app itself is free. But if you want some extra perks like a gig of encrypted storage, it's only $2 a month. I'll leave a link for you down in the video description. Huge thanks to LastPass for sponsoring this video. Now, let's jump into the durability test. Let's get started. [Intro] It's time to test the Xiaomi Note 5 Pro. Xiaomi has not always done well on my channel in the past. The Mi5 had a pretty rough day during my durability test. Let's hope this Note 5 Pro, released this year, fares better because this blue is beautiful. Seriously, though, this blue is one of the coolest colors that I've seen on a smartphone in a while. It would be a shame if someone accidentally scratched it. Let's start with the screen. My systematic durability test always includes my Mohs picks to see what the screen is made from. Plastic would scratch at a level 3, which we've seen on some other budget phones. This Xiaomi Note 5 with it's oddly measured 5.99 inch screen had advertised Gorilla Glass. So we should start seeing scratches at a level 6, with deeper grooves at a level 7. Pretty standard so far, especially for 2018. Normal keys, coins, and razor blades won't scratch the front glass. Xiaomi is advertising a 20 megapixel selfie camera on this thing, with something unique, a front facing flash. The far circle on the right is actually an LED, which is nifty. The earpiece is made from a hard metal mesh, and is very securely adhered to the phone. Not bad so far for a budget phone. The volume rocker is made from metal, along with the super small power button. The bottom section of the phone however, is made from plastic. And even through it does include our favorite headphone jack, it's located next to a very much outdated micro-USB slot. This phone was released in 2018 where it's beyond time to move on to USB-C ports. While the bottom might be plastic, the sides are definitely made from metal, along with the SD card tray which can conveniently hold two SIM cards or a SIM and SD card combo. The only thing that would make me more impressed is if this phone could change the channels on my TV...but wait...it can. Built into this phone from Xiaomi is an IR blaster that allows you to control speakers, TVs, projectors, and DVD players, all with that little black remote control LED on the top. Androids can do some pretty cool things. This budget Note 5 Pro does have dual cameras on the back, but no telephoto or wide angle lens, which basically means that the second camera is more of a glorified decoration than anything else. The plastic flash is separate from the protective glass over the cameras, probably to keep the reflections of the flash to a minimum. The slightly recessed fingerprint scanner is scratchable. My razor blade does it's normal damage. It's interesting to note that a lot of fingerprint scanners can survive this exact same abuse and still function like normal. But this time around with the Xiaomi Note 5 Pro, it won't acknowledge my finger and keeps saying that the sensor is dirty. So the fingerprint scanner does fail this time around. Of course this is a bit more abuse than a well cared for phone would normally sustain during a 2 or 3 year lifespan...but that's the point of this video. My phone gets tested so that you don't have to find out the hard way with your own phone. Plus, I draw one fantastic looking bluebird. The end caps of this phone might be plastic, but the center section is definitely metal. This 5.99 inch screen is an IPS LCD display, so we should see the pixels go black and turn off, but hopefully recover and switch back on again. The Note 5 Pro lasted about 9 seconds before recovering completely. Let's see if this Note 5 Pro is structurally durable, or if Tweety gets his head popped off. The first bend had me nervous for our buddy Tweety. There's a very visible and very permanent kink in between the power and volume buttons. Bending from the opposite direction yields a lock out, but no catastrophic damage. There are permanent gaps between the frame and the glass, and the screen is unclasped along the middle, but everything is still alive and functioning. This beautifully colored Lake Blue Note 5 Pro, with it's pretty darn durable bird on the back has survived my durability test. Pretty impressive. And it gets a thumbs up from me. If you enjoy bluebirds, come hang out with me on Twitter. Hit that subscribe button. Thanks a ton for watching and I'll see you around.",
    "transcript_keywords": [
        "Xiaomi Note",
        "Note",
        "phone",
        "Pro",
        "Xiaomi",
        "durability test",
        "test",
        "Lake Blue Note",
        "screen",
        "made",
        "Switching phones",
        "time",
        "LastPass",
        "Plastic",
        "pretty",
        "phones",
        "video",
        "Glass",
        "Blue Note",
        "durability"
    ],
    "transcript_entity_values": [
        "3",
        "about 9 seconds",
        "only $2",
        "Gorilla Glass",
        "SD",
        "IR",
        "two",
        "20",
        "2 or 3 year",
        "jack",
        "Mohs",
        "6",
        "Tweety",
        "Lake Blue Note 5",
        "Galaxy S8",
        "SIM",
        "this year",
        "5",
        "daily",
        "millions",
        "2018",
        "5.99 inch",
        "first",
        "second",
        "Xiaomi",
        "LastPass",
        "One",
        "USB",
        "Tweety",
        "one",
        "Twitter"
    ],
    "transcript_entity_types": [
        "DATE",
        "TIME",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}