{
    "id": "p6RYpTbPDMg",
    "title": "Apple's Security FAILED",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-09-23T01:43:30Z",
    "video_url": "https://www.youtube.com/watch?v=p6RYpTbPDMg",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Apple",
        "macOS",
        "patch",
        "macOS flaw",
        "macOS security",
        "hack",
        "hacking",
        "Mac",
        "privacy",
        "Surface",
        "Surface Pro 8",
        "Surface Laptop Studio",
        "Surface Duo 2",
        "Windows 11",
        "2021",
        "Surface Event"
    ],
    "views": 532279,
    "likes": 30200,
    "comments_count": 689,
    "description": "Get your Occhio True Privacy webcam today at:    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:  ---------------------------------------------------  Timestamps: 0:00 James do u need help 0:05 Microsoft Surface Event 0:51 Unpatched macOS vulnerability 1:36 PS4 CBOMB fix 2:14 Arozzi Occhio True Privacy Webcam 2:52 QUICK BITS 2:57 Twitch music publisher agreement 3:21 Android Auto Maps update 3:41 Pokemon Unite on iOS + Android 3:58 Gitamini luggage 4:27 Amazon smart dressing rooms  AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/ArozziTL",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/hpIB7",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- [James] Whoa, we're outside! Maybe I didn't pay my rent. Spent too much money on tech news. And I'd do it again. Microsoft had a major event today to announce a new batch of products and its Surface lineup. With the headliner being as expected, the new Surface Pro 8. With a 120 Hertz Dolby Vision display and Thunderbolt 4 support. A feature that's been a long time coming. There's also a totally new entrant called the Surface Laptop Studio. Which features an RTX 3050 Ti and a slide forward screen. As well as the Surface Duo 2. That's kind of like two twos. An update to Microsoft's original dual screen phone with three cameras sensors, as opposed to the previous one, as well as a 90 Hertz refresh rate and a thickest of less than a quarter inch when open. Expect to see the new devices on sale next month, and expect to see coverage on our sister channel Linus Tech Tips. Meanwhile over in Mac land, also known as Jonathan Horst land, take extra care for the time being when opening email attachments. A bug and MacOS allows bad guys to run code on your system if you click on a compromised internet shortcut. Malicious code can be embedded inside the shortcuts and while Apple has come out with a patch, it turns out that it's laughably easy at the moment to get around it simply by changing characters in the shortcut's prefix to uppercase. So typing the file you prefix with a capital instead of a lowercase F what allow malicious code to interact with local files. F indeed. I imagine Apple will come out with another fix in the near future but come on all of that money to build a donut out in Cupertino and something like this still gets past your engineers. If you're a PS4 owner you might be pleased to know that a long running issue with the console CMOS battery has finally been fixed. The latest version of the PS4's firmware, 9.0 patches a notorious bug called CBOMB. That would simply cause games to not work if the system's internal battery died. The bug is the result of how the PS4's anti-cheating system works. It's always the anti-cheating system. It relies on the systems clock which in turn relies on the CMOS battery. Before the fixed, games would crash when a player tried to start them up, but now it looks like your games will run indefinitely even after the PS4 servers inevitably shut down as the console ages. You can tell I've lived this. Onto the quick bits after this message from someones far less sexier than I am. - [Riley] Now it's time for quick bits brought to you by Aroozzi's new Occhio True Privacy webcam. It lets you take privacy into your own hands with an included magnetic lens cover and a switch to turn off the actual electrical circuit, sending power to the webcam's microphone. You can't hack what you can't send electrical power to. I think that's the phrase. Meaning that with the Occhio you can be sure that you're only seen and heard when you want to be. It's also got autofocus, light correction, 1080P 30 video recording and is available in both ring light and vanilla versions. Sounds tasty. So get your Occhio True Privacy webcam today using the link below. - On to the quick bits. Twitch streamers who inadvertently violate copyright by having unlicensed music in their videos might be let off the hook a little bit more easily after Twitch announced a new policy that will warn creators and remove the offending clip instead of issuing outright penalty immediately. Critics say the new system will also make it easier for creators to get flagged but it is at least better than just getting a black mark on your record right away. Automobile drivers in the UK, Australia and Japan should find Android Auto a little easier to use after Google released an update that puts navigation information closer to the driver. And in case you're wondering, it was previously farther away because those countries drive on the wrong side of the road. The left side, the double side. I'm left-handed, 666. Although you might have just gotten used to thinking of Pokemon Unite as a Switch title, it's now available on both Android and iOS. The game is free to start playing as it is on Switch. And the mobile versions will feature cross platform support with each other and the Switch as well. So I guess it's really living up to the name, now good news for a change. And there's a new backpack out that'll follow you around, the gita and gitamini from Piaggio Fast Forward. Although it's not the first piece of smart robotic luggage, this one is notable for its small size. As it's less than 20 inches tall. It costs 1,850 U.S dollars and it doesn't have Louis Vuitton logos on it. That's crazy. And it can follow you around for about 21 miles on a single charge. So about enough to get you around JFK Airport once. And it looks like Amazon's foray into brick-and-mortar department stores might also include smart dressing rooms. The idea is to scan QR codes of items you want to try on and a worker or robot will place those items in a fitting room for you. If you want to try on more clothes, you can tap on recommendations on a screen inside the fitting room and have them brought to you through a privacy door like Hannibal Lecter's lunch. I'd have to think Amazon isn't dumb enough to like put cameras inside the change room but you know anything for convenience. We'll just, just take my data, take my nudes, take them. And take this tip to come back on Friday for more tech news, probably indoors once my check clears. Bye-bye. Love you so much.",
    "transcript_keywords": [
        "Occhio True Privacy",
        "Surface Laptop Studio",
        "Surface",
        "Hertz Dolby Vision",
        "True Privacy webcam",
        "system",
        "Occhio True",
        "Surface Pro",
        "True Privacy",
        "switch",
        "Surface Laptop",
        "Privacy",
        "Surface Duo",
        "quick bits",
        "Privacy webcam",
        "CMOS battery",
        "Occhio",
        "Linus Tech Tips",
        "Hertz Dolby",
        "tech"
    ],
    "transcript_entity_values": [
        "Linus Tech Tips",
        "1080P 30",
        "CMOS",
        "Thunderbolt 4",
        "PS4",
        "Hertz",
        "three",
        "Cupertino",
        "Piaggio Fast Forward",
        "less than 20 inches",
        "Hannibal Lecter's",
        "Mac",
        "Aroozzi",
        "90",
        "Switch",
        "JFK Airport",
        "Surface",
        "Japan",
        "Twitch",
        "Google",
        "the Surface Duo 2",
        "Amazon",
        "Louis Vuitton",
        "Microsoft",
        "Surface Pro 8",
        "less than a quarter",
        "1,850 U.S dollars",
        "Friday",
        "the Surface Laptop Studio",
        "666",
        "first",
        "Occhio True Privacy",
        "Australia",
        "two",
        "120",
        "Jonathan Horst",
        "9.0",
        "Android",
        "about 21 miles",
        "next month",
        "UK",
        "Hertz Dolby Vision",
        "Pokemon Unite",
        "3050 Ti",
        "James",
        "Android Auto",
        "Apple",
        "today",
        "Occhio"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "LAW",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PERSON"
    ]
}