{
    "id": "p6XBRvfupm0",
    "title": "Apple iPhone 11 and 11 Pro event in 11 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-09-10T19:21:13Z",
    "video_url": "https://www.youtube.com/watch?v=p6XBRvfupm0",
    "category": "Science & Technology",
    "tags": [
        "apple event",
        "apple event 2019",
        "apple",
        "apple iphone",
        "event",
        "iphone",
        "new iphone",
        "iphone 11",
        "iphone 11r",
        "iphone 11 pro max",
        "11 pro max",
        "11r",
        "apple september event",
        "tim cook",
        "apply tv+",
        "tv plus",
        "apple tv",
        "apple news",
        "iphone 11 max",
        "apple fall event",
        "new ipad",
        "ipad",
        "macbook pro",
        "new macbook pro",
        "new phone",
        "apple phone",
        "apple update",
        "apple rumors",
        "apple leaks",
        "hands on",
        "first look",
        "supercut",
        "the verge",
        "verge",
        "technology",
        "tech",
        "latest updates",
        "tech news"
    ],
    "views": 2386217,
    "likes": 23326,
    "comments_count": 5770,
    "description": "At Apples fall 2019 hardware event, the iPhone 11 Pro stole the show, but Apple TV Plus, Apple Arcade, the new 10.2-inch iPad, the colorful iPhone 11, and the Apple Watch Series 5 also caught our attention. Lets run through the top five announcements.  Read more about the top announcements:  New iPad hands-on:  iPhone 11 hands-on:  iPhone 11 Pro and 11 Pro Max hands-on:  Watch Series 5 hands-on:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2lKAeEv",
        "http://bit.ly/2k8B7WY",
        "http://bit.ly/2kDQzL2",
        "http://bit.ly/2lP1TE8",
        "http://bit.ly/2lIt7wm",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(applause) - Wow, thank you. Good morning and welcome to the Steve Jobs Theater. Let's talk about Apple TV+. The first shows will be available on November 1st and we'll be adding more Apple Originals every month and Apple TV+ will be available in over 100 countries at launch. And it is just... $4.99 per month... (applause) for your whole family! And so starting today, when you buy an iPhone, an iPad, a Mac, or an Apple TV, you'll get one year of Apple TV+ included for free! Now let's turn our attention to iPad. - So this is the new seventh-generation iPad. 10.2 inch retina display, support for Apple Pencil, and a full size smart keyboard, and as you would expect, great cameras, sensors, and ultrafast wireless, all packed into a thin and light design that's durable and weighs about a pound. And, for the very first time, our enclosure is made from 100% recycled aluminum. (applause) Under the hood of this iPad, is the A10 Fusion chip. This new iPad will start at just $329. And for education customers it's even more affordable at $299. You can order it today and it will start shipping at the end of the month. - Now, next stop, let's talk about Apple Watch. Introducing Apple Watch Series 5, featuring an innovative new display that is always on. You'll always be able to see your time and complications. A wrist raise or a tap brings everything back to full brightness. It all starts with the industry's only low-temperature polysilicon oxide display, or LTPO. LTPO allows the display to refresh dynamically from as high as 60 Hertz to as low as 1 Hertz while still maintaining the same all-day 18 hour battery life. Now all of the watch faces have been carefully tuned for the new display, so you'll always be able to see your time and your complications. We've also optimized the screens for all of the workouts in the workout apps, so you'll be able to see your workout metrics without raising your wrist. Next, let's talk about another new feature in Series 5: a built in compass. Now with the updated Maps app, you'll be able to see which way you're facing just like on your iPhone. You can add the compass to your watch face so you can see your direction at a glance, and there's even a new compass app which allows you to see not only your heading, but also your latitude, longitude, current elevation, and incline. Apple Watch has some important safety features built right in, like fall detection, emergency SOS, medical ID. Now, with Series 5, every cellular model has international emergency calling. Aluminum models come in silver, gold, and space gray. And now the cases are made from 100% recycled aluminum. Stainless steel models come in gold, space black, and polished. And we're introducing new models for the first time... in titanium. This natural brush titanium maintains its color through a special surface treatment that Apple custom-engineered. And there's also a second model in titanium in this brushed space black with a diamond-like coating. Series 5 will be available in ceramic as well in this brilliant white color. Series 5 GPS models will start at just $399. And $499 for cellular models. You'll be able to order Series 5 starting today, and they'll be available in our stores starting September 20. - Let's talk about iPhone. This is iPhone 11, the next generation of iPhone. - iPhone 11 comes in six new colors with an all purple, white, yellow, green, black, and Product RED. It has a 6.1 inch Liquid Retina display with True Tone, wide color, tap to wake, and Haptic Touch in even more places with iOS 13, like contextual menus. And now we have spatial audio which provides an immersive theater-like experience by creating a sound field around you using an Apple-designed virtualizer. And we support Dolby Atmos for an incredible sound experience. We have an amazing dual-camera system with an all-new wide camera with a new sensor with a 100% Focus Pixels for faster autofocus, three times faster in low light. And we have a new ultra-wide camera with a 120 degree field of view. So now when you're taking a wide camera shot you'll see our new immersive camera interface it let's you see outside the frame hinting at a bigger shot. Then you can simply tap to switch to the ultra-wide, revealing more of your scene. But now with two cameras, we have stereoscopic depth, so now you can also take portraits of your favorite pets. Let's talk about night mode. And mode comes on automatically when it's dark enough to brighten photos and reduce noise. Here's an image with night mode turned off. Here it is with night mode turned on. We determined the image fusion time and used adaptive bracketing based on what we see in preview. So shorter frames if you have subject motion or longer frames if you have deep shadows, to recover them. Then we intelligently fuse images together, reducing motion and blur. So when taking video you can easily tap to switch to the ultra-wide camera to capture even more in your scene. We support 4K resolution up to 60 frames per second. Slo-mo, timelapse, cinematic video stabilization, and now extended dynamic range at 4K up to 60 frames per second. And this is across both cameras which is pretty cool. We also wanted to make it easier for you to take a quick video with QuickTake. So now when you're taking photos and you decide you want to take a quick video, simply tap and hold the shutter button to record a video. We've also updated our front TrueDepth camera to a wider 12 megapixel sensor. So now you can still take your seven megapixel selfies as your normally would, but simply rotate to landscape to capture even more people using that wider sensor. Also on the front camera, we've added 4K video with extended dynamic range up to 30 frames per second. And you can also capture on front at 4k 60 as well. Now we've also added slow motion video to the front camera for the first time. Well now we're introducing the A13 Bionic, the next generation of our industry leading chip. So with the advancements in iPhone 11, it will still have an hour more in battery than in your iPhone XR for incredible battery life. Powerful dual-camera system, night mode, and things we didn't even have time to talk about, like faster Face ID, water and dust resistance, wireless charging, WiFi 6, and more. So we're really excited to offer iPhone 11 at just $699. - This is the iPhone 11 Pro, and these are the most powerful and most advanced iPhones that we have ever built. - It's made of a surgical-grade stainless steel, the back is a single piece of machine glass with an optical PVD coating. It has a beautiful new matte-textured finish that looks great and feels awesome in your hand. iPhone 11 Pro comes in some gorgeous new finishes. This is an all-new midnight green. There's a very pro space gray, a beautiful silver, and a new gold. It comes in two sizes: 5.8 inches and 6.5 inches. They have the highest pixel density of any display Apple makes. It's a new OLED panel that has two million to one contrast ratio. P3 wide color, True Tone, Haptic Touch, and now a much-brighter, up to 1200 nits, that's incredibly bright while also being 15 percent more energy efficient. In addition to that, it has the spatial audio sound that Cayenne told you about. It has HDR 10, Dolby Vision, Dolby Atmos, so we decided it's worthy of a new name. We call it the Super Retina XDR Display. iPhone 11 Pro, you now get up to four hours longer in your day. And with iPhone 11 Pro Max up to five hours longer in your day. We're also including our fast charge 18-watt adapter in the box. It has a new wide camera, it has a fast f1.8 aperture and focus pixels that cover 100% of the sensor. It has a new telephoto camera with a larger f2.0 aperture. It lets in 40% more light. And has a new ultra wide camera with a super wide, a 120 degree field of view and a tremendous range of focus across the entire image. Now all these work together with the A13 Bionic chip and its new generation image signal processor. It's using the neural engine of the A13 Bionic to create a whole brand-new kind of image processing system. We call it Deep Fusion. Alright, now let's talk about video. All three cameras shoot 4K 60 frame per second extended dynamic range video with beautiful highlights and shadow details. In realtime, take data from the camera you're shooting with and prime the other cameras automatically for auto-focus, auto-exposure, color temperature, even tone-mapping. So you can get a smooth transition across all three cameras while we minimize any shifts in color or exposure. There's also faster cellular, better water resistance, stronger glass, and so much more. So iPhone 11 Pro will start at $999 and iPhone 11 Pro Max at just a hundred dollars more at $1099. You can pre-order all of them starting this Friday at a new time, 5:00 am Pacific Daylight Time so you can get a few more hours of sleep. They'll all start shipping on September 20th. In addition to that, we're going to keep iPhone XR in the line, starting at just $599, and iPhone 8 at just $449, so there's a lot of great options for people at all different price points. - Thank you and have a great day! All of these incredible shows for the price of a single movie rental. This is crazy!",
    "transcript_keywords": [
        "Steve Jobs Theater",
        "Apple",
        "iPhone",
        "Apple Watch",
        "camera",
        "Apple Watch Series",
        "Pro",
        "time",
        "Jobs Theater",
        "Steve Jobs",
        "display",
        "wide camera",
        "video",
        "cameras",
        "Series",
        "talk",
        "wide",
        "Introducing Apple Watch",
        "Apple Originals",
        "Watch"
    ],
    "transcript_entity_values": [
        "just a hundred dollars",
        "499",
        "Apple Originals",
        "three",
        "the A13 Bionic",
        "the Super Retina XDR Display",
        "seventh",
        "iPhones",
        "one year",
        "up to five hours",
        "SOS",
        "5",
        "Series",
        "5.8 inches",
        "15 percent",
        "iPhone 11",
        "iPad",
        "449",
        "September 20th",
        "an hour",
        "12 megapixel",
        "TrueDepth",
        "Apple Pencil",
        "Slo-mo",
        "this Friday",
        "18-watt",
        "just $329",
        "just $699",
        "GPS",
        "iPhone XR",
        "iPhone 11",
        "iPad",
        "1200",
        "seven megapixel",
        "40%",
        "4k 60",
        "A10 Fusion",
        "OLED",
        "first",
        "Pacific Daylight Time",
        "Dolby Vision",
        "LTPO",
        "11",
        "up to",
        "18 hour",
        "30",
        "midnight",
        "about night",
        "Deep Fusion",
        "November 1st",
        "Focus Pixels",
        "Pro Max",
        "120 degree",
        "100%",
        "4K",
        "13",
        "just $",
        "a few more hours",
        "6.5 inches",
        "4",
        "299",
        "just $599",
        "second",
        "P3",
        "6.1 inch",
        "Dolby Atmos",
        "September 20",
        "two million",
        "1099",
        "one",
        "QuickTake",
        "Mac",
        "Apple",
        "Series 5",
        "999",
        "A13 Bionic",
        "today",
        "the Steve Jobs Theater",
        "10.2 inch",
        "six",
        "60",
        "iPhone 8",
        "the end of the month",
        "just $399",
        "every month",
        "Hertz",
        "as high as 60",
        "Apple TV",
        "XR",
        "two",
        "Apple Watch",
        "Dolby Atmos",
        "iPhone 11",
        "iPhone",
        "100",
        "Cayenne",
        "4.99",
        "5:00 am"
    ],
    "transcript_entity_types": [
        "MONEY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "EVENT",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "MONEY",
        "DATE",
        "TIME",
        "QUANTITY",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "PRODUCT",
        "PRODUCT",
        "EVENT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "CARDINAL",
        "TIME",
        "TIME",
        "CARDINAL",
        "TIME",
        "TIME",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORDINAL",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "LAW",
        "MONEY",
        "PRODUCT",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "NORP",
        "MONEY",
        "TIME"
    ]
}