{
    "id": "P8cCjYkpjhs",
    "title": "Desk Tour!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-08-10T14:44:01Z",
    "video_url": "https://www.youtube.com/watch?v=P8cCjYkpjhs",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "HP Instant Ink",
        "HP",
        "Instant Ink",
        "Ink at home",
        "Ink Subscription"
    ],
    "views": 353521,
    "likes": 15398,
    "comments_count": 759,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and you might notice I'm not in my current, normal, everyday Los Angeles office. I'm somewhere different, I'm on the east coast and that's because I have been trying to spend as much time as I can possible with my family this year. Since last year, I hardly got to see them at all. So thankfully travel is open, but the work hasn't stopped. So I've decided to set up a mini east coast office here in my sister's basement and this is really fun because this video is actually sponsored by HP Instant Ink and I'm so excited about this because we partnered together to surprise my sister and my parents with a printer and an HP Ink subscription. Every time I've asked my sister or my family and be like, hey, I need to print something. Do you guys, what do you? Oh, you're out of ink. Oh, your printer's old. I don't even think it prints anymore. And then my sister didn't even have a printer. So I actually have an HP Instant Ink subscription back home in Los Angeles and I love it so much because I never have to worry that my printer is gonna be out of ink because if it starts running low, it tells HP hey, Justine has an HP Instant Ink subscription, let's send her a box of some new ink cartridges. And what's cool is you can choose the plan that works best for you. They have plans starting as low as 99 cents and you choose how many pages you think you're gonna be printing that month. And you can change these plans any time if you need more pages or if you need less pages. It's super easy, super simple. And I am so glad that now I don't have to worry about printing on the east coast. So whether you print a couple of times a month or several times a day, it really doesn't matter. You can pick the plan that works for you. They have plans ranging from 15 pages to 1500 pages a month, and every page counts the same, no matter how much ink you use. When it runs low, replacement ink cartridges will be shipped to your home along with a prepaid postage recycling envelope for your used cartridges. So if you guys are interested in HP Instant Ink, I will put a link in the description where you can check it out and you may actually have a printer that's already eligible for this. Most HP wifi enabled printers five years older or less should be eligible for HP Instant Ink, so check it out. And now, my friends, let's start this office tour. I keep saying that I'm in a basement and the perception of a basement to me like if someone's like, oh, I've been working out of a basement is like a grimy, dusty, dirty dungeon. This is the complete opposite. This is a finished basement. I mean, she has like a couch set up, a whole gaming station where her husband plays his video games. She's got a bar, a freaking pool table, and I have kind of taken over this whole corner and Jenna has taken over the corner over there. There's a lot of space. So I have even been doing my lightsaber training in here. You know, it's a basement, but like, it's not a basement. So the first thing I'm gonna show you guys is what I'm kind of filming on right now. I'm filming with my Sony A7S3 and I have the 50 millimeter G master prime 1.2, oh boy. Like this kind of looks like one of those fake like zoom backgrounds, but look, no it's real. Anytime I use one of these lenses with the amazing bokeh, people on my Zoom calls always think that it's a blurred background. I'm like, nope, this is just high production. A few months ago when we made our first trek out here, I also decided, you know what, I'm gonna just bring as much stuff as possible. So I even checked one of my aperture lights, which I'm using and it's been so great. It's like a perfect key light. I basically only need this and there's also some natural light over here. So it kind of fills everything in nicely. That was all well and good until I realized how many Zoom calls and conference calls and live shows and streams and interviews and things that I was also gonna be having to do from over here. And at the same time, Jenna was gonna have to be filming. So I went to Best Buy and bought some of these Elgato key lights. I love these things so much because they connect to WiFi. I can turn the brightness down and I can control all of that right here just from my phone. I'm sitting in my sister's husband's gaming chair. I don't know why I haven't bought a gaming chair for me ever. I've never had one, and I don't know why, because this is the most comfortable thing that I've ever sat in. This has been actual game changing for editing, like I'm just like super cozy, edit, edit. I kind of like, I need this. And since I have the lights and I have the camera, I have a second A7S3 up there that I use and connect for Zoom calls. But most of the time I've just been using the iMac's iSight camera...no, it's not iSight. FaceTime, I'm sorry, hello, I'm sorry. I have time traveled. I've just been using the built-in webcam on the iMac, and this is one of the new M1 iMac's you guys saw that I did an unboxing of all of the colors and it's actually been working out quite well because I have been utilizing several of those iMacs. I've left one here at my sister's house and I've been using one at my parents' house and Jenna has also been using one. And then I have one more setup running a beta version of Mac OS Monterey. So I'm definitely utilizing a lot of technology. And then continuing on to the desk, we have one of the Elgato wave microphones got the mag safe duo charger, my old air AirPods, and of course the new AirPods max. This mouse pad is made by nomad. It looks cool and it's very functional. This right here is the Thunderbolt dock by OWC and this is also a lifesaver. I need way more than two Thunderbolt and two USB-C ports so this has been the perfect solution for that. So here's my iPad pro and then behind that, you'll see, I have two different Rubik's cubes. I feel like the Rubik's cube for me is what a fidget spinner is to a lot of people who use fidget spinners for, you know, lessening their anxiety. I'll be sitting there on conference calls, just like stressed about something and I'm like, okay, all right, solved, I feel better. I also have this little stand here that I've got my neon X-Box controller and then I can just put stuff in here and right now I have a mobile tripod there. Works for me. And last but not least, we have the Rode caster. I've actually been checking this in my suitcase and just using a lot of clothing to pad it. The amount of things that I've checked in my luggage, that's not clothing. I mean, I brought lightsabers home, things that need to be in box, like full freaking boxes and I just use like my clothes as padding. It's like I don't even care about the clothes. I literally wear the same thing every single day. It's like, oh, wow, are you gonna wear a different pair of black leggings that look exactly like the ones you wore yesterday? Oh, are you gonna wear probably the same sweater that you've been wearing for the same past 500 videos? Yeah, actually, I am. If Steve Jobs, can have a uniform, I can have a uniform. So that kind of does it for the desk tour. It honestly, it's been a challenge kind of filming in a new location because obviously I don't have Tyler. Hi, Tyler! Who helps me shoot all the time. But definitely being out of your comfort zone when you're trying to work and shoot and film is definitely a struggle, but I am really, really happy that I have kind of a really great set up here that I'm still able to make videos and make content for you guys. Anyway, I'm going to print out some photos now and I'm gonna see if my little niece can tell us who's in the pictures. (upbeat music) One more second, okay. All right, so this is a printer and we have HP Instant Ink. So when you are older, you're never gonna have to worry about running out of ink. Have you seen one of these before? Okay, sit down. Look at these pictures that we just printed. Who is that? - Jussy. - Jussy! That's right, that's me. Three people. Are you ready to do this one? Okay, who's that? - Mommy. - That's mommy! Who's that? (paper swishes) Okay, so she's definitely more interested in the printer than the game that I have provided for us. Who's this? - Matty. - That's Matty! Who's that? - Daddy. - Who's that? - Mommy. (printer whirs) Oh, you printed an information. We printed some information. Here you go. That's for you. (paper rustles) Here, let's play this fun game again. Nope. Okay, well. I'm actually very impressed with the quality of these photos. - [Brynn] An iPhone. - That is an iPhone. - [Brynn] Jussy. - She's never seen anything like this. You wanna say hi to the camera. Can you say HP? - P. - Forgot the H (laughs). How much do you think I'm gonna have to pay her for her participation? Okay, here we go. - [Woman] Brynn, get the picture out. - Get the picture. - [Woman] Who is that? (paper rustles) - [Justine] Oh.",
    "transcript_keywords": [
        "Instant Ink",
        "Instant Ink subscription",
        "Ink",
        "everyday Los Angeles",
        "Ink subscription",
        "Instant",
        "kind",
        "printer",
        "Los Angeles",
        "time",
        "Los Angeles office",
        "basement",
        "ink cartridges",
        "sister",
        "guys",
        "Zoom calls",
        "everyday Los",
        "east coast",
        "pages",
        "zoom"
    ],
    "transcript_entity_values": [
        "AirPods",
        "Matty",
        "second",
        "One",
        "east coast",
        "one",
        "iPad",
        "50 millimeter",
        "Justine",
        "Brynn] Jussy",
        "the east coast",
        "Monterey",
        "Sony",
        "OWC",
        "iPhone",
        "more than two",
        "99 cents",
        "M1 iMac's",
        "Elgato",
        "AirPods max",
        "that month",
        "FaceTime",
        "last year",
        "Los Angeles",
        "A few months ago",
        "webcam",
        "1.2",
        "as low as",
        "HP Ink",
        "Thunderbolt",
        "iMacs",
        "this year",
        "iMac",
        "HP Instant Ink",
        "two",
        "Steve Jobs",
        "Three",
        "month",
        "Tyler",
        "G",
        "five years older",
        "first",
        "iSight",
        "1500",
        "Rubik",
        "Mac",
        "Jenna",
        "yesterday",
        "15"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "LOC",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "DATE",
        "GPE",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL"
    ]
}