{
    "id": "p8lIWriHi3k",
    "title": "Lew is sick...",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-10-03T23:35:09Z",
    "video_url": "https://www.youtube.com/watch?v=p8lIWriHi3k",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "ryan",
        "ryan unbox therapy",
        "jack",
        "who is jack",
        "japan",
        "snacks",
        "food",
        "best",
        "2016",
        "apple",
        "iphone",
        "video",
        "iphone 7",
        "futuristic",
        "cool gadgets",
        "smartphone",
        "inventions",
        "invention",
        "android",
        "innovation",
        "marina joyce",
        "lew is kidnapped",
        "cool",
        "amazing inventions",
        "samsung",
        "things",
        "new inventions",
        "awesome inventions",
        "awesome",
        "galaxy",
        "top",
        "new gadgets",
        "amazing",
        "phone",
        "vs",
        "s7",
        "iphone 6s",
        "plus",
        "apple iphone"
    ],
    "views": 2526858,
    "likes": 179442,
    "comments_count": 10648,
    "description": "Lew was too sick to upload today, his voice is gone. Jack and I decided it was important to give you guys something to watch. Don't worry, Lew is resting up and will be back tomorrow. Don't be too harsh this is my first ever upload - Ryan  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Quiet on set, please. *Tries to pronounce* Easian? Esian mall? What's up guys? How's everybody doing today We have Ryan here, uhh. Lew? He's off sick. *Uhh* I am related to Lewis. I'm his cousin ... Me and Jack are hanging out I'm going to open a couple of boxes, I have no idea what's inside of these things. Got my trusty knife here We have got the yellow, got the black. I have no idea what these products are. Jack just threw 'em on the table and said we gotta get something up there ... For the audience, say the fans, you guys. So here I am. And.. er. Well, we'll start with the small one here I don't need a knife Lets put that to the side. I always wanted to use that knife *Woah* Nice feeling actually, to be opening boxes. Ok, so I got some cards *quietly* Lets see what these things are about here Photos of some people, there that have er, I guess tried these products. *long* ooh oh oh ooh Is this lip chap? *sniffs lip chap* No smell. huh *lips pop* I'll save that keeping that one, don't tell lewis. eh I think i'll probably keep these products for myself ooh The squirrel aqua mask.... mask? What we got right there? ooh, that is slimy ooh, gross ooh, whoa Wait, you put this on your face??! oooh It smells pretty nice it's kinda cold though How's that? For a new look? Jays fans out there we're in the playoffs Baltimore fans... Good luck to you *rips* *mumbled* There we go Very berry complex *mumbles* care package? .... *laughs* cookie hand cream keep forgetting to look at you guys thats nice actually aaah.. cookies and cream Thats the real deal I got...ooh?. Its like a bracelet its like uhhh... a skull...? No thats hair Thats..thats like ponytails *Uhh* Oh ya I can get er' on there Now I'm getting in the groove See this job ain't so hard By the way this video... *in disagreement* not sponsored not being paid for. May have to pay lew for it actually... if its this terrible *sniff* I don't even want to open this one just gonna leave that over there these are shhh.. shrip chips... shrimp chips? shrimp chips! Baked! ooh oh yea *crunch* There ya go jack.. Have some shrimp chips As appose to that silica gel This looks delicious Lychee? If you guys ever had lychee they're delicious. They're like a net but its a fruit inside... cherry Oh pocky green tea covered so they must be good for you as soon as we get them open here oh yeah Okay Moving on to the Morinaga Jack tells me to go to speed this process of campy shooting film all day and got a lot of things to do around here door open that's not bad Whoa hey, Ichiban's Teenage favorite Guess I can't really Well I used to eat it dry, let's see woah thats strong......just like the old days this is interesting by the way this is the first time ever been on camera take it easy on me just trying to keep the doors open here and keep the dream alive. Unboxtherapy. [Sniff] Is this an egg? Do I gotta eat this? I don't even know if you're supposed to eat this I shouldn't have eaten that probably look at the camera more i'm kind of avoiding you guys cause I uhh I'm scared Now this looks delicious yeah yeah can you buy these things? or? why are we even doing this thing? They always say if you like me, push the like button if you want to subscribe go ahead, subscribe Thanks for watching thanks for tuning in maybe next time we do something different about a computer or something alright later im gone",
    "transcript_keywords": [
        "Quiet on set",
        "ooh",
        "guys",
        "uhh",
        "open",
        "Jack",
        "things",
        "chips",
        "shrimp chips",
        "Nice",
        "products",
        "knife",
        "Easian",
        "Quiet",
        "set",
        "fans",
        "delicious",
        "shrimp",
        "eat",
        "yeah"
    ],
    "transcript_entity_values": [
        "Lychee",
        "lew",
        "Baltimore",
        "Morinaga Jack",
        "Ryan",
        "Lew",
        "first",
        "Lewis",
        "Unboxtherapy",
        "Jays",
        "all day",
        "jack",
        "Jack",
        "Thats"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "NORP"
    ]
}