{
    "id": "P8lkMtuhu5Y",
    "title": "Xbox Series S vs Xbox Series X",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-09-10T15:03:31Z",
    "video_url": "https://www.youtube.com/watch?v=P8lkMtuhu5Y",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "xbox",
        "xbox series s",
        "xbox series x",
        "series s",
        "series x",
        "consoles",
        "next gen consoles",
        "microsoft",
        "sony",
        "playstation",
        "playstation 5",
        "ps5",
        "hdr",
        "ray tracing",
        "high frame rate",
        "tech",
        "technology",
        "xbox news",
        "halo",
        "halo infinite",
        "series x gameplay",
        "new xbox",
        "xbox one",
        "xbox one s",
        "xbox one x",
        "xbox all digital",
        "gears of war",
        "cod",
        "call of duty",
        "cod warzone",
        "xbox game pass",
        "game pass",
        "game pass ultimate",
        "video games"
    ],
    "views": 264017,
    "likes": 9396,
    "comments_count": 1846,
    "description": "Which next gen Xbox console will you be getting? Xbox Series X Gameplay:  Does Austin Evans Actually Know Tech!?  The IMPOSSIBLE Gaming Challenge ft.  @Kevin Kenson   Can you TRUST Gameranx?! ft. Jake Baldino:  I Showed You My Tech Tip ft.  @Linus Tech Tips   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/Oeyu0xYQtrw",
        "https://youtu.be/wm9Ezth7Iyo",
        "https://youtu.be/1PNBEqw_Fmk",
        "https://youtu.be/e15q1y6cxtw",
        "https://youtu.be/N_VoajKuBhs",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to This Is. Matt, we have a couple of Xboxes on the table. - We do have a couple of Xboxes on the table. We have the Xbox Series X and the Xbox Series S. I hate having a lisp While trying to say those. - S and X, two very different consoles. So of course, huge shout out to Microsoft for giving us an early look at the hardware behind the brand new Xboxes. So to be clear, if you have seen the main channel video where we did a full unboxing of each, you'll know that these are nonfunctional units. However, there's actually a lot that we can learn from not only all of the leaks and all of the announcements with the price and the releas date and everything, but also just the general size of these consoles, I think is really surprising. - Literally shocking at how small these, like the S actually is. Like we knew the size of the X, but when Microsoft said that the S was going to be the smallest console they've ever made, it's borderline pocket size, man. - Before we get into crazy town, let me explain why I think the S makes a lot of sense. So if you're not familiar with either of these consoles, they both will play the same games, right? So just like the current Xbox One S and One X will play the same games at different frame rates and resolution, et cetera, et cetera, it's the same thing for these consoles. The big difference is in price. So the Xbox Series S is available for $300 on November 10th, whereas the Series X is available for what I still think is a reasonable $500. When you look at this, this is almost like impulse buy territory, for a next gen console. - So I agree wit you that the price, 499 is totally reasonable for what you get with the X. - From what we know about this, it is roughly equivalent to an RTX 2080, or maybe a little bit more powerful. Which currently is a $500 graphics card. - Yeah, ignoring the nerdspeak that you're going to spew in a second. - Oh, I've got nerdspeak for days. - Like yeah, like looking at specs, spec for spec, whatever, you get almost all of the important functionality out of the S. You're still getting higher frame rates and you are getting, you know, ray tracing. - Before we go too far into that spec, there are a couple of things to keep in mind. So first of all, to run through the speeds and feeds really quickly, they both have the same Zen 2 based CPU cores, so this is what you would basically get in like a Ryzen 7 processor right now. So that means you got eight cores that are clocked 3.4 to 3.6 gigahertz here, 3.6 to 3.8 here, essentially the same thing. Both of these consoles have the Xbox Velocity Architecture. So the Xbox Series X is targeting 4k 60 frames per second for games with the ability to go up to 120 FPS for certain titles, for multiplayer modes, again, up to developers whatever they want to do. But 60 4k is really kind of what this thing is built for. The Series S on the other hand is built for 1440p at 60 FPS. Now that doesn't sound like a major difference, and it's not, right, so both of these consoles can put out a 4k signal. But something that I am very curious about and something that quite simply looking at the specs doesn't make sense to me is how there's going to be such a small difference between them. Because you think going from 1440p to 4k is I believe roughly about twice as many pixels. And yet the Series X has over three times the graphics performance, which to me makes me think that the Series S might be a little closer to an ADP than 4k in some games. - Going back to what you say with the, this having no optical disk and having half the hard drive. That's the one thing that I find kind of weird about the S, because Xbox is going all in with their Game Pass, you know, the Game Pass Ultimate. Now I could not personally care less that there's no optical drive in this because we're at a point with games, like, I'm glad that you have a collection of games, I'm glad you're proud of your collection. But the fact of the matter is we still have to download major patches to the SSD. So having that physical disc does not really help you when we talk about the hard drive, well the SSD in there. - Yeah, yeah, and you always have to install the discs anyway. - Right. - I will say one thing, I actually do a generally agree, You do lose something with the S. In fact, you actually lose it with PS5 too, and they both have their full digital editions, right, so there is a version of the PlayStation 5 that has no optical disc drive. So just like the Series S, you're going to be forced to download those games. And that does mean you lose some things, right. You're not going to be able to buy and then turn around and trade in or sell games, you're going to be completely limited to downloading. Personally, I've been pretty much on that train for a while. - Yeah, personally, I haven't done that in probably a decade. I know there's a lot of people who disagree with that, but I mean, it is becoming less and less popular, especially with Gamestops closing left and right. - Yeah. I guarantee you, the Series S will outsell the Series X significantly. People are gonna buy this thing and they're going to only download games. - No doubt, especially because, again, that emphasis on Game Pass. Microsoft is poising themselves to literally become the Netflix of gaming. But like right now, for an incredibly reasonable price, you can get first party, day one games for I think at most $15 a month right now. And now they've included EA Access with that. Or not EA Access, it's EA Play, but it's the same thing. It's really simple math here. If you are planning on buying at least three games, then you should totally just be doing Game Pass because it ends up being cheaper in the long run, and you have access to this massive catalog of games. - So if you look on the back of the Series S, obviously this is a nonfunctional unit, you will see the exact same memory card slot, or I think they have a more fancy name, but essentially the memory card slot for the SSD. So essentially what you get is both of these consoles have either one terabyte or 500 gigs of storage, out of the box you can use that. However, if you want to install games outside of that you will need to buy one of these little memory cards. Now, the PS5 actually has the ability to install another SSD internally, which is a nice thing, but that's a whole other can of worms because not a lot of SSTs will meet the speed requirements, topic for a separate video. But when it comes to the Xbox Series S and the X, it is very straightforward. All of these new S and X games that are coming out expect to have an SSD, right, you need that to run the game. But the downside is is that it's certainly not going to be cheap. So while you might spend 300 bucks and buy your Xbox Series S with half a gig of space, or half a terabyte of space, you could fill that up pretty quick, and then you need to start buying those external drives. So that's a little bit of a downside if you're a really heavy gamer. - We've joked a couple times that, you know, we're waiting for the Call of Duty version of this memory card that's just going to have the game pre-installed on it and it's gonna be a terabyte game, but like the way that Warzone has been ballooning, it's not that crazy. - It's not crazy. And speaking with the Xbox guys, they seem to very much kept the door open that there could be additional sizes, maybe a two terabyte or something in the future. Generally speaking, the slot will support, I think pretty much anything. So going forward larger drives will likely be available. - I'd be very surprised if there's not a third party one available at some point. - Oh, good point. But the PS5's SSD actually is faster. So both of these consoles are taking advantage of compressed memory, which will essentially speed up those SSDs. But the Xbox I believe uncompressed is like 2.4 gigabytes per second, whereas the PlayStation 5 is actually a decent chunk faster than that. - For those of you just care about the games and not the nerdspeak that Austin is saying, it means your open worlds are gonna load faster. - Everything's gonna load faster. - You're not going to have a minute load time, you're going to have a second load time. - Well, so that's a great point. We've been playing, if you're playing on a PlayStation or an Xbox right now you are, unless you've modded your PS4, are playing on a very slow hard drive, right? And so many games this generation have minute, minute plus load times. I'm looking at you, Red Dead 2. Even though this is the smaller, the cheaper, the less powerful system, the SSD is the same. Sure, it's a little bit smaller, but the speed, the performance and everything will be the same. The actual processing power, the CPU is the same. Really what you're losing when you go to the Series S is graphics horsepower, which is important, but you'll still be able to play those same games. And you have the still the capability of going like 120 FPS and everything, if the game supports it. - For $200 less are you really benefiting from that 4k versus the, you know, 1080 or 1440? I don't think you are. - Yes, if you're a purely wanting to play at 4k 120, but that's not really what this is about. It's targeting 4k 60. Some games will run at 120, but that's not the main focus. What I'm very much curious about, and hopefully over the next few weeks and months, as we get more information and we get to actually spend time with these consoles and really play with them, I wanna know what the actual performance difference really is because on paper, again, 1440 versus 4k, not the end of the world. But this has less than a third of the graphics performance. I mean, on paper, this actual on the pure graphics side, not counting the SSD and the CPU and everything, is actually a little bit less powerful than the current Xbox One X. I'm sure once you actually average it out it's probably roughly in that same ballpark, it has support for like ray tracing and stuff. But there's pure pixel pushing teraflop performance this is significantly behind, which makes me question If it's really gonna hit 1440p. Are you just losing a little bit resolution or are you actually doing it at like lower settings and whatnot? That's why I think the Series S is the correct console for most people, I 100% agree. I do not agree that the Series X is for no one because if you want that real next gen experience, this is going to be a much bigger step forward. It's ultimately up to developers. You can make, if you're a developer, you can make your game run at any resolution, frame rate, like the toggles are there. I mean, the hardware exists, it is capable of things, and generally speaking, they're sort of targeting specific kind of like configurations, but that can do whatever you want. - That's my next point on why I just don't, like, I don't think this is gonna be for most people is because there's a lot of developers who won't take advantage of the hardware in here. Because it's cheaper for the developer to develop it for the baseline of the lowest common denominator, they're not going to make a game that can't run on the Series S right, but can run on the X. - Wait, hang on, are you trying to argue that the Series S is gonna hold the next generation of consoles back? Because this is now the lowest common denominator. - Yes. - Interesting. As a developer, and I'm certainly not a developer, but I think from a developer point of view, a game that will run on S should run on X and should have the ability to sort of push those higher settings and frame rates and resolution. But that same game will still run. This still has 10 gigs of Ram, which yes, is less, but generally speaking when you think about the lower resolution like that, it actually does kind of scale. I agree that this will hold things back to a degree, and this is certainly the least powerful of the next generation consoles that we'll have for the next six, seven, eight years. But because it has all of those same core specs, I don't think it's going to hold things back too much. You're still getting that same overall package and I don't think it's going to completely ruin developers lives to have a system which is a little bit less powerful to target. I just personally think that the S makes so much sense for so many people, that it still is the better console for the vast majority of you. But if you want that next gen triple A 4k 120 FPS et cetera, et cetera, experience, the Aeries X is still here and this is all horse completely ignoring the little Sony PlayStation 5, which I think is going to potentially throw a little bit of a wrench in all of this. Because I mean, who's gonna get the Series X and the S and PS5 and juggle, like that's gonna be a really confusing thing for a lot of people of what do they actually want. - I do you want to talk about the payment plans for these for a second though, because while they're low, they look amazing on paper, there is some fine print that-- - [Austin] There always is. - For a lot of people who would most benefit from these payment plans, chances are you're not gonna qualify for it. - It is a good deal though, when you consider that if you're already going to pay for Game Pass and or Xbox Live, that 25, 35 bucks a month is not wildly off and you can get yourself the hardware. - The fact that it's even like offered at all is actually really great and I kind of wish that more products would offer something similar. - But going to be very interesting to see how many people go, you know what? Yeah, Game Pass looks good. You know what, yeah, I want to go play Halo. The 25 bucks a month, sure, gimme that Series S. I think that's gonna be a huge, huge seller. Anyway, thank you very much for watching this episode of This Is. Make sure to not only subscribe here to the channel for more console and game show content, but also go over to the main channel where we've done an unboxing of both the Series X as well as the Series S. Do you have anything witty to say, Matt? Is that just the end of the video? - Tell us in the comments how much you hate the Xbox and how you're just gonna get a PlayStation because that's what you do on every other one of our videos. - Please don't.",
    "transcript_keywords": [
        "Xbox Series",
        "Series",
        "Game Pass",
        "games",
        "Xbox",
        "Game",
        "consoles",
        "SSD",
        "thing",
        "run",
        "Game Pass Ultimate",
        "Pass",
        "Yeah",
        "Xboxes",
        "people",
        "console",
        "play",
        "Xbox Velocity Architecture",
        "lot",
        "things"
    ],
    "transcript_entity_values": [
        "Halo",
        "2080",
        "Warzone",
        "300 bucks",
        "the Series S",
        "three",
        "November 10th",
        "2",
        "the Call of Duty",
        "CPU",
        "300",
        "half a terabyte",
        "One",
        "the Series S",
        "35 bucks",
        "60 FPS",
        "Microsoft",
        "500",
        "Xboxes",
        "2.4 gigabytes",
        "at least three",
        "S",
        "4k",
        "third",
        "3.4",
        "the Xbox Series X",
        "Xbox Series S",
        "the next six",
        "15",
        "Gamestops",
        "1440",
        "Matt",
        "EA Access",
        "Austin",
        "The Series S",
        "the X. - Wait",
        "the Xbox Series S",
        "4k 60",
        "Ram",
        "eight years",
        "Xbox",
        "Xboxes",
        "less than a third",
        "Netflix",
        "seven",
        "first",
        "PlayStation 5",
        "10",
        "PS5",
        "one terabyte",
        "the next few weeks",
        "the Series S",
        "4k 120",
        "the Xbox Series X",
        "60 4k",
        "S and X",
        "a decade",
        "the Series S. Do",
        "499",
        "the Xbox Velocity Architecture",
        "100%",
        "25",
        "the Series X",
        "EA Play",
        "Red Dead 2",
        "3.8",
        "Xbox Live",
        "200",
        "second",
        "the Game Pass Ultimate",
        "the Series S",
        "PlayStation",
        "3.6",
        "ADP",
        "one",
        "500",
        "PS4",
        "days",
        "the PlayStation 5",
        "25 bucks",
        "Ryzen 7",
        "1440",
        "1080",
        "eight",
        "120",
        "months",
        "half",
        "two",
        "3.6 gigahertz",
        "Xbox One S",
        "Game Pass",
        "Sony",
        "SSD",
        "Xbox One X."
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "DATE",
        "GPE",
        "MONEY",
        "LOC",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "EVENT",
        "MONEY",
        "QUANTITY",
        "ORG",
        "MONEY",
        "FAC",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "EVENT",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "LOC",
        "EVENT",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "FAC",
        "CARDINAL",
        "LAW",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "LOC",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "EVENT",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORDINAL",
        "LAW",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "MONEY",
        "NORP",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PRODUCT"
    ]
}