{
    "id": "p9VX0yN4O0Q",
    "title": "The Best Tech Under $25 - December 2016",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2016-12-07T01:01:29Z",
    "video_url": "https://www.youtube.com/watch?v=p9VX0yN4O0Q",
    "category": "Science & Technology",
    "tags": [
        "Tech Under 25",
        "Tech Under 50",
        "Holiday tech",
        "holiday gifts",
        "holiday gift guide",
        "best tech for gifts",
        "best tech under 50",
        "cool tech under 50",
        "cool tech deals",
        "best tech gifts",
        "best tech 2016",
        "2016",
        "cool tech under 25",
        "tech under 50 dollars",
        "best christmas tech gifts 2016",
        "holiday tech",
        "best tech gift ideas 2016",
        "cool tech gadgets",
        "best tech under $50",
        "best tech under 50 dollars",
        "(つ▀¯▀)つ",
        "tld",
        "jonathan morrison",
        "jonathan morrison setup"
    ],
    "views": 774748,
    "likes": 27355,
    "comments_count": 1230,
    "description": "2016 Holiday Gift Guide of the Best Tech Under $50!  Use TLD20 at check out to save 20% on Mighty Mug -  5 Strange Amazon Tech Gadgets!   Baby Groot!  USB-C Charging Dock   Aukey Table Lamp   Jackery Jewel iPhone Charger   Steklo X-Stand Laptop Stand    Add me on Snapchat!  Dream Desk 3 -  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://goo.gl/mFhafN",
        "https://youtu.be/545sYAB564M?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "http://amzn.to/2giNYRD",
        "http://amzn.to/2gJquG1",
        "http://amzn.to/2gJAMFY",
        "http://amzn.to/2h8uQn5",
        "http://amzn.to/2gZz0i4",
        "https://www.snapchat.com/add/tldtoday",
        "https://youtu.be/KKlO3Bof7uw",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo guys, Jonathan here, and with holidays rapidly approaching I thought it would be a perfect time for a holiday tech gift guide. This time though for maybe the first time ever, I wanted to get these out early so you had plenty of time to pick these up. And for this video we're looking at some great options under 25 bucks. So first up is the infamous Mighty Mug, the mug that will not fall over, which you more than likely saw from my good buddy Lew over at unbox therapy where that video went crazy this year. Now a huge shout out to Mighty Mug for sending these out and not only sponsoring this gift guide, but also a give away because if you couldn't tell I do not need this many mugs. For a chance to win go to make sure you subscribe, and maybe throw in notifications if you haven't yet because there are plenty of holiday giveaways coming up. So if you guys are down with that, and you are ready to win some holiday tech, let me know by dropping a like down below. Now the game changer with Mighty Mug, is it's smart-grip technology which creates a 360 degree air lock at its base, which in turn prevents it from being knocked over. What's crazy though is when you go to lift the Mighty Mug, that air lock releases automatically and allows you to pick it up like you would any normal cup. I'm not sure what kind of wizardry or magic this is that makes it work, but it does. So if you're someone, or you know someone who likes to bring drinks near electronics, whether it's your desktop or your laptop, and are prone to accidents, especially with sticky stuff, then this might be the perfect option. They're BPA free, there are a ton of styles and colors, and for TLD fans who scoop one of these up within the next 24 hours, use TLD20 at checkout, which is gonna get you 20% off and ensure you get these in time for the holidays. So next up is a really sleek USB-C charge dock from Simpeak, which I've been looking for for a while now. I've seen a ton of great options for iPhones, but never really anything similar for Android until I found this guy. It's aluminum so the build quality is top notch, but what I really like about it is how simplistic and minimal it is, which makes it a great option for your desk that looks really clean. What's cool with this though is that is supports USB 3.1, and on top of those speedy transfer speeds it also supports fast charging. So that combined with the fact that looks good, it supports pretty much every single USB-C device out there including the Google Pixel, and the fact that it's under twenty bucks right now makes this a no-brainer. Now next, you guys know I love pretty much anything that has to do with lighting, especially if it's colored so when I found this Aukey table lamp, I was instantly hooked. It's touched activated which is really cool and not only makes you feel like you're in the future, but it's also really handy so you don't have to find a switch in the dark. And then my favorite with this is it's color mode, which will cycle to 256 color combinations. By default it's going to continuously cycle through those colors, but if you see one you like and you want to stop it there you can do that as well. Whether you're using this for your desk, or as a night light next to your bed, this works great in a ton of different applications. It's clean, it's simple, it's easy to use. And more importantly they're inexpensive enough to where you can grab a couple and set up a really cool looking environment. Now next is the Jackery Jewel iPhone lightning cable, which is under 20 bucks and has a trick up it's sleeve. It's MFI certified and works just like any normal lightning cable, so you can charge, you can transfer data, unless trying to do Macbook Pro. But the secret with this is there's an emergency power bank inside. Now I will emphasize this is meant to be used in emergencies, and not as a normal power bank. The charge is relatively small at 450mAh, but the idea with this is to use it when everything else has failed. It makes sense because whether you're charging your phone up or you're transferring data, this is gonna be charging in the background. And then for those times where you're stuck without a charge, maybe your back up battery died, this will come in to get you just enough juice to power back up your phone. It's not the sleekest or the prettiest design, and the actual capsule can feel a little bit bulky, but it essentially ensures you have a back up emergency option, so in that case it definitely works as advertised. The other compelling feature with this is its price, which is actually cheaper than a standard apple lighting cable. There are of course cheaper third party options, but for a couple bucks more the fact that you can squeeze in a back up battery is kinda cool. Now next is the Steklo X-Stand, which is a really nice lightweight laptop stand that's gonna work for both Mac and Windows based laptops. With this, it is relatively low profile so you're not gonna get a ton of lift with your laptop, but rather, the idea behind this stand is to get it up just enough to help with air flow. What's also nice with this is the fact that it's made out of aluminum and not plastic, so it doesn't feel cheap. And it's also really light weight and breaks down really small, which makes this ideal for a traveling laptop stand. Now this will work with pretty much every brand of laptop between 12 and 17 inches including the 12 inch Macbook. It will not work with anything smaller than that, so any 11 inch notebooks, especially the 11 inch Macbook Air, do not buy this. But aside from that, the build quality, the portability, and the fact that it works with a really wide array of laptops makes this a really great option for the holidays. Aside from that thank you guys very much for watching this, stay tuned for more holiday tech gift guides coming up really soon. On the flip side if you want to see some of Amazon's weirdest tech go ahead and click here or check out the link below. This is Jonathan and I will catch you guys later. (upbeat music)",
    "transcript_keywords": [
        "Mighty Mug",
        "holidays rapidly approaching",
        "infamous Mighty Mug",
        "Mug",
        "rapidly approaching",
        "approaching I thought",
        "holiday tech gift",
        "makes",
        "Mighty",
        "holiday tech",
        "time",
        "holidays rapidly",
        "guys",
        "holiday",
        "great",
        "laptop",
        "fact",
        "great options",
        "option",
        "work"
    ],
    "transcript_entity_values": [
        "between 12 and 17 inches",
        "11 inch",
        "Macbook Air",
        "TLD",
        "the next 24 hours",
        "USB",
        "iPhones",
        "256",
        "Windows",
        "a ton",
        "Mac",
        "20%",
        "Macbook Pro",
        "Lew",
        "twenty bucks",
        "Simpeak",
        "450mAh",
        "first",
        "12 inch",
        "25 bucks",
        "Mighty Mug",
        "Amazon",
        "20 bucks",
        "third",
        "Macbook",
        "a couple bucks",
        "this year",
        "Android",
        "Aukey",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "PERCENT",
        "ORG",
        "PERSON",
        "MONEY",
        "GPE",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "ORG",
        "MONEY",
        "ORDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "GPE",
        "PERSON"
    ]
}