{
    "id": "pABvTWSxOes",
    "title": "How to Make High Performance Sound Absorption Panels for $5",
    "channel": "DIY Perks",
    "channel_id": "UCUQo7nzH1sXVpzL92VesANw",
    "subscriber_count": 4640000,
    "upload_date": "2016-08-08T12:30:00Z",
    "video_url": "https://www.youtube.com/watch?v=pABvTWSxOes",
    "category": "Howto & Style",
    "tags": [
        "diy",
        "project",
        "sound",
        "absorption",
        "panel",
        "acoustic",
        "foam",
        "sound proof",
        "echo",
        "reverb",
        "reduction",
        "treatment",
        "music",
        "home",
        "studio",
        "make"
    ],
    "views": 4498543,
    "likes": 179256,
    "comments_count": 7828,
    "description": "In this video I explore the possibility of making DIY sound absorption panels on a budget, later comparing them to much more expensive acoustic foam. The results are pretty amazing!  There have been many comments pointing out that my test only measures transmission and not reflection, so is essentially unsuitable for my initial testing goal. While this is partly true, testing reflection is pretty difficult to do in a home environment, and the only way to do it that I can think of would be to spend a long time in the middle of a field with a powerful speaker and mic rig, which is really beyond the scope of what I was prepared to do for the video.  My tests are not rendered pointless however - it would do no good to have only measured reflection, as the thinnest lightest material would have won (like foam), as nothing would have bounced back. Reflection and transmission need to be tested together to measure how much sound passes through, and how much sound is reflected back - this should give an indication of how much sound is absorbed by a given material.  Regardless, only testing the transmission doesn't affect the outcome of the project at all, as any sound waves reflected by the panels themselves would have theoretically bounced off the wall anyway - again this is why reflection wasn't tested, as it doesn't matter so much for a panel setup (though would matter very much for a vocal booth).  Open to hear any thoughts about it though! Keep up the great discussion. :)",
    "description_links": [],
    "transcript": "- There are more people than ever making media content at home thanks to low-cost gear and increased access to huge audience numbers via the internet, this video perhaps being a case in point. Now, there are a few problems with doing it at home, and in regards to audio, one of these problems that I've found is poor room acoustics. So, these are caused by sound waves bouncing back off walls and making the audio sound rubbish, basically. Some recommendations in combating this include putting up foam on the walls, but proper acoustic foam can be very expensive. So in this video, I'm going to be seeing if there are any alternatives to this, and maybe even trying out normal packaging foam as well, which is very cheap. So, let's begin by getting a few materials that might absorb sound quite well. I'm gonna try out a cushion, some towels, and of course, some normal packaging sponge. So my setup here consists of a speaker on the bottom, a platform for my materials to go on, and a microphone. And the theory is that the sound, which I'll be using a tone generator for, will have to pass through the materials to reach the microphone. So I'll start off with one layer of foam. This is like spongy foam. (descending tones) Okay, so now we'll move on to a towel. This one should do. I think, personally, that the towels will work a bit better than the sponge, but we'll see what the results tell us. (descending tones playing repeatedly) Okay, so now we've got all of those recordings. Let's go to the computer and see which material absorbed the the most energy at the different frequency ranges. That should hopefully tell us what cheap home materials are decent for sound absorption panels, so let's go. Here's a visual representation of the various frequencies I played back, starting with 17 kilohertz on the left and finishing with 5 kilohertz on the right. This one had no material in between the microphone and speaker, so it will be the baseline to compare the others to. So, we'll have a look at the first recording, which was the single piece of sponge. As you can see, the volume levels are a bit lower, but not by much, which is somewhat disappointing. What about the egg-holder-style sponge? Again, it's not much better despite the extra thickness, however, when we get to the double-layer egg sponge, we start to see some improvement, and it lags only a little behind the performance of the cushion, which is quite surprising. Moving on to the towels, though, we can see that they are significantly better at absorbing sound. This folded towel, for example, has roughly the same thickness as the thin sponge, but as you can see, it absorbs much, much more sound. This performance improves even more when two towels are used, so I think it's pretty safe to say what the winning material is. Now, just to make sure, I've done one final test, but this time with the frequencies going down to 500 hertz. For the sponge, I stacked them together into a four-inch pile, and again, its performance was somewhat disappointing. Move on to a three-inch stack of towels, however, and just wow. It absorbs so much, even in the 500 hertz range. So with that, I can conclusively say that out of these materials, towel is the winner. Well done, towel! So now we need to get plenty of towels to make some sound absorption panels with, and a perfect place to get them is from your local charity shop. They might look a bit worn, but they'll perform just as well. And getting them from charity shops means you can get a load of them for very little money. Alternatively, you could always ask around your friends to see if they any towels that are just worn out and gonna be thrown away. So now we need to construct a frame for the panels. To do this, we're going to use a long piece of wood, cutting it down into shorter pieces. These will obviously dictate how big your panels will be, so make sure you measure it up to your liking. As they don't need to be particularly strong, we can just screw the corners together without any special joints. We can first use a bit of wood glue on one side and then drill two holes for the screws, countersinking them afterwards. Two wood screws can then be used to clamp them tightly together. Once this has been done for all four corners, you should have a relatively strong frame, which is now ready for the towels. As I want my panels to be white so that they blend into the wall, I'm going to use this white towel for the outside. First though, it needs an iron to get out any creases. This is only necessary for this one as it's the only towel that'll be visible. The towel can then be stretched around the frame's perimeter and stapled in place. So once it's all been stapled on, you should have a frame that looks something like this. But now what we need to do is to add the rest of the towel layers so that it absorbs more sound. So to do that, what we'll do is place the other towels inside the frame and cut them down to size. Six of these in a layer should provide more than enough sound absorption. These can then be placed in the middle of an uncut towel, stacked one on top of the other. Now we can do the manly activity of sewing them all together. This needs to be done all around the outside, and then we also need to add some loops at various points in the middle so that they don't later sag. Manliness achieved. The towels should now be fixed together nicely, and they can be put back inside the frame. Now, again, we can stretch the towel and staple it in place. The last thing to do is cut off the excess loose towel and that's the panel completed. They can now be hung up like picture frames. And if you make enough of them, they can make a significant difference to the acoustics of a room. Here's an example. This is with the sound absorption panels up on the wall and there should be less reverb in this configuration. This is without the sound absorption panels on the wall, and it should sound considerably less clean than before. Testing, testing, one, two, three. Testing, testing, one, two, three. So, as you could hopefully hear, the difference these panels make is really quite striking. They're also quite unobtrusive in a home environment as well, thanks to their light color. How many of you noticed that there was one behind me, for example? Now, it's worth keeping in mind that you can customize them further by ordering a print on some fabric and using that as the front layer instead, which would give you a picture frame as well as a sound absorption panel. Now, I'm sure you're wondering just how do these perform compared to proper acoustic foam. Well, I've ordered some especially, so let's find out. (descending tones) (descending tones) So, as we discovered earlier, the towel does a great job and absorbs much of the energy. But the foam still doesn't get anywhere near despite being proper acoustic foam and not the budget stuff that is just relabeled packaging foam. Interesting. So, unless I'm doing something wrong with my testing, these DIY panels not only cost much less than midrange acoustic foam, but they perform better too. Not bad. So, I hope you have fun making your own acoustic panels. And if you enjoyed this video, don't forget to press that like button and maybe consider subscribing as well. I'm Matt, and you've been watching DIY Perks. I hope I see you next time. Now, if you can't wait until next time, then why not check out one of my previous projects? Like this great looking DIY headphone stand, made out of wood and acrylic, with color-changing RGB LEDs. Alternatively, you could check out how to make this 50-watt Bluetooth music blaster, the very same wireless amp I used to power the speaker in the video when doing the tone tests. They're both worth a watch, so I hope you enjoy them.",
    "transcript_keywords": [
        "huge audience numbers",
        "sound",
        "sound absorption panels",
        "towel",
        "towels",
        "sound absorption",
        "foam",
        "making media content",
        "panels",
        "acoustic foam",
        "sponge",
        "absorption panels",
        "frame",
        "make",
        "proper acoustic foam",
        "media content",
        "lowcost gear",
        "gear and increased",
        "increased access",
        "access to huge"
    ],
    "transcript_entity_values": [
        "first",
        "500",
        "Six",
        "three",
        "two",
        "four",
        "17 kilohertz",
        "50-watt",
        "RGB",
        "one",
        "500 hertz",
        "three-inch",
        "DIY",
        "four-inch",
        "Matt",
        "Two",
        "First",
        "5 kilohertz",
        "DIY Perks"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORG"
    ]
}