{
    "id": "PaCRDE77qQ0",
    "title": "Gear 360 vs LG 360 Cam - Differences explained",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-06-17T18:07:40Z",
    "video_url": "https://www.youtube.com/watch?v=PaCRDE77qQ0",
    "category": "Howto & Style",
    "tags": [
        "Best 360 camera",
        "VR camera",
        "LG 360 Cam",
        "Samsung Gear 360",
        "360 camera quality",
        "difference between gear 360 and lg 360",
        "vr camera compairison",
        "best vr camera",
        "gear 360",
        "lg 360",
        "how to use 360 camera",
        "how to",
        "360 camera rig"
    ],
    "views": 150874,
    "likes": 1542,
    "comments_count": 83,
    "description": "The two most popular 360 cameras are the LG 360 and the Gear 360. HERE is the price of the LG 360 Cam:  HERE is the price of the Gear 360:   To see the side by side 360 video click here:   Want to know how to make your own spherical videos?:   Watch my 360 degree hike of Yosemite Half Dome:   Deciding what camera to buy can be a big decision.  Hopefully I can help by showing the two most popular 360 degree cameras on the market right now.  The Samsung Gear 360 and the LG 360 Cam.  Each camera has its own perks and pitfalls, but both get the job done. After watching this video and my 'side by side' comparison video, let me know what camera you think is best!    The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/1XYQE7X",
        "http://amzn.to/23fqOf1",
        "https://youtu.be/FUPB887Diqo",
        "https://youtu.be/95UPBXsXtV0",
        "https://youtu.be/RFYvn55M0Cc",
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/1R7Ltic",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "Lets take a look at 2 of the most popular 360 degree cameras on the market, the Gear 360 and the LG 360. Yesterday I made a video comparing the footage between the two cameras. Today I'm going to show and explain the physical differences between the cameras themselves. Both cameras shoot pictures or video out of both lenses simultaneously. And then use an app to stitch the circles together so they can be viewed as a flat image once the footage is transferred to your phone. Both of the apps are pretty straight forwards and simple to use... but the one thing I really like about the LG app is that you can turn on the camera with your phone, remotely. I was finishing up my Yosemite Half Dome hike. I had the camera in my back pack turned off, and the app could turn it on, and start transferring files without me ever needing to dig through my gear and find the camera. The Gear 360 has to be turned on physically before it will connect and transfer files with the app. One thing I really liked about transporting the LG 360 was the hard case that it comes with. I have no problem just tossing this into a backpack... The Gear 360 only comes with a cloth pouch, so you gotta be a little more careful with it during transpiration. I will link both cameras down in the video description of this video so you can compare the current prices. Since that will change over time. Right now the LG 360 is about half the price of the Gear 360. The LG 360 is the simpler of the two cameras. There aren't as many options or features or options. It has an internal battery, slim design, a standard camera mount on the bottom next to the SD card slot, so you can stick it on any tripod. It charges with USB type C. The camera can be operated without the app. Just hold down the main button for video, or press the main button once for a still image; in 360 degrees. As far as software options go, it shoots in 2k resolution, and has the basic camera settings most current smart phones do. This 2k camera shoots with a bit rate of about 18 in camera, and keeps that same bit-rate during the stitch as it transfers to your phone. The Gear 360 is a bit more complex. It has a round water resistant design. It charges with a standard Micro USB inside the water-tight door that also houses the removable battery and SD card slot. It also has a little screen up top to tell you how much recording time you have left and what setting the camera is currently on. As far as software features go. This will shoot in 4k resolution, takes still images, but it also can do time lapse shots, and can loop video, Which is a good feature for something like Facebook. It can even shoot slow motion in 60 frames a second, if you drop it down to 2k resolution the same as the LG Cam. It also has options to add Sharpness and stabilization to the footage as well. This camera has a bitrate of 30 megabits a second, but it doubles that bitrate as its transferring the files to your phone 60 mbs. It might be a cheating a bit to add information after the picture has already been taken... but at least its not loosing quality. The glass lenses on the Gear 360 are huge, and since they are farther away from the sensor, it is easier to notice when dust that falls on the glass. So make sure you keep it clean between shots, Hopefully you enjoyed this video, and I could help explain a bit more about the differences between the cameras. Give me a thumbs up, and consider subscribing if you haven't already! I always post behind the scenes stuff on Instagram and twitter. Thanks for watchin' Hope to see you around.",
    "transcript_keywords": [
        "camera",
        "Gear",
        "cameras",
        "video",
        "app",
        "Yosemite Half Dome",
        "phone",
        "bit",
        "options",
        "footage",
        "shoot",
        "cameras shoot",
        "camera shoots",
        "files",
        "cameras shoot pictures",
        "resolution",
        "time",
        "bitrate",
        "USB",
        "Yosemite Half"
    ],
    "transcript_entity_values": [
        "Micro USB",
        "60 mbs",
        "SD",
        "Instagram",
        "two",
        "about half",
        "Facebook",
        "Yesterday",
        "about 18",
        "the Gear 360",
        "Yosemite Half Dome",
        "4k",
        "60",
        "360 degrees",
        "second",
        "30 megabits",
        "2",
        "Today",
        "One",
        "USB",
        "one",
        "The Gear 360",
        "2k",
        "the LG Cam",
        "LG"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG"
    ]
}