{
    "id": "PBIbsvZSp24",
    "title": "Sony’s best headphones just got [a little] better 🎧",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-05-12T16:01:20Z",
    "video_url": "https://www.youtube.com/watch?v=PBIbsvZSp24",
    "category": "Science & Technology",
    "tags": [
        "WH1000XM5",
        "XM5",
        "Sony Headphones 5",
        "headphones",
        "noise cancelling",
        "noise cancelling headphones",
        "AirPods Max",
        "WH1000XM4",
        "XM4",
        "best headphones",
        "best headphones 2022",
        "the verge",
        "tech",
        "sony wh-1000xm4",
        "sony headphones",
        "sony wh-1000xm4 review"
    ],
    "views": 473482,
    "likes": 9019,
    "comments_count": 670,
    "description": "Sonys new WH-1000XM5 noise-canceling headphones are the companys most advanced to date  but also the most expensive at $400. For that money, you get a fresh design, upgraded sound, better active noise cancellation than ever, and improved voice call quality. But they're very similar to the 1000XM4s, giving Sony fans little reason to upgrade.  Read more:   0:00 Sony WH-1000XM5 Intro 0:35 New Updates (Design, Sound, Active Noise Canceling, Price) 0:55 New Design 2:05 Carrying Case 2:52 Sound Quality 3:56 Noise Canceling  4:40 Mic Quality 5:00 Mic Test (WH-1000XM5 vs WH-1000XM4 vs AirPods Max vs Bose 700 vs Sennheiser Momentum 3) 6:26 Extra Features (Codecs, Multipoint 7:01 Battery  7:15 Missing Features 7:48 Conclusion 8:00 Sony WH-1000XM5 vs. WH-1000XM4   Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://www.theverge.com/e/22831686",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Sony has a new set of flagship noise canceling headphones. These are the WH-1000XM5s. And I know, we've made fun of Sony's awful product names for years now, but I think when it comes to the 1000 X series, people get it. These are among the very best noise canceling headphones you can buy today. Sony's been competing for years against Bose and more recently Apple to win over frequent flyers and commuters, and everyone else who can't live without active noise cancellation and as more jobs move to this hybrid work model, I think noise canceling headphones are essential for peace and quiet, whether it's your real office or your home office. Sony's 1000 XM5s have a fresh design, cleaner sound and even better ANC, but they're also 50 bucks more expensive than the M4s, which are staying in the lineup. Are they worth that upgrade? Potentially, but it's not a slam dunk. So let's get into it. For the first time in many years, Sony's overhauled the entire design. These 1000 XM5s look totally distinct from their predecessors. The headband is thinner for one, and instead of arms that cradle the ear cups at both sides there's now a stem that runs down the middle. If you look at some of Sony's competition like Apple's AirPods max or Bose's noise counseling headphones 700, I think you can see where they got some inspiration. This new style definitely looks cleaner with fewer obvious seams and such, but I'm not convinced, it looks very premium. The 1000 XM4s had some metal on their ratcheting ear cup sliders but everything you can see or touch on the 1000 XM5s is all plastic. That's not to say they're not durable. I twisted the hell outta these headphones and they held up perfectly fine, but for $400, I would've appreciated some nicer materials. My Sennheiser Momentum 3 are just on a different level of fit and finish, but you can also overdo it. Some people would say the AirPods Max are way too heavy. So clearly Sony favors comfort over a lavish design. Both air cups still pivot and turn just like always, so you're not losing anything there. But one thing Sony's new headphones can't do anymore is fold. This is one of my biggest disappointments with the 1000 XM5s instead of folding down for a convenient portability, these headphones just lay flat in their case. And as a result, that case is large. Whereas I had no issue putting the old case for the 1000 XM4s in my bag, the 1000 XM5s would not fit in that same slot. So they had to go in the main compartment in my bag. That's not ideal. Look, this case is just too bulky. And I think Sony could have done better, even Bose's case for the noise counseling headphones 700, which can't fold up either is smaller and makes better use of space. People travel with noise canceling headphones all the time. And so I think Sony's ginormous case is gonna cost some frustration, but it is at least a functional case with storage for the USBC and headphone cables. One thing you won't find in the box anymore is the dual prong airline adapter, which feels a bit stingy for 400 bucks but it is what it is. Now let's talk about sound and there are bigger changes here than you might expect. Sony switched from 40 millimeter drivers in the 1000 XM4s to 30 millimeter drivers in these new headphones. Now driver size isn't everything. But I can't think of the last time a pair of Sony headphones sounded this different from their direct predecessors. Based on my time with them so far, I'd say that 1000 XM5s are tighter, more detailed and cleanup that sometimes muddy base of the 1000 XM4s but they also have less oomph to them. They're less in your face and less potent out of the box. Now those are not audio file terms, obviously but I hope it makes sense. I've been doing a lot of comparisons with the same songs on both headphones. And in most cases, I do prefer the new ones. When I put on Spoon's new record, for example, the M5s just sound more crisp and detailed. But if I put on hip hop or dance or soul music there are times when I do lean towards the older M4s. And so I think it's inevitable that some people are gonna prefer the sound of the previous headphones, and maybe that's part of why Sony is keeping them around. Take your pick if you want cleaner and tighter sound go for the M5s. If you need that boom factor and the powerful excitement maybe the M4s are more your style. As for noise cancellation, these actually have the same QN1 chip that was in the M4s, only now there are two of them. And so Sony says the ANC performs similarly on a plane but should be better at handling street noise and cutting down on nearby voices. And that's all been true in my experience so far. It's still not enough to give you a private bubble of absolute silence if you're in a coffee shop but it's an improvement over what was already fantastic noise cancellation. One tiny thing to note on the hardware, past Sony headphones had an optimized button that would adjust the ANC based on factors like air pressure and fit your hairstyle if you wear glasses and so on, now, the button is gone and that all happens in the background automatically says Sony. And while part of me does miss the button, it was a fun trick and who doesn't love buttons? This does make a lot more sense for simplicity sake. Now we come to voice calls and my friends, Sony is going for broke. The 1000 XM5s have eight microphones in total and four of them are used for voice. So when you combine that with supposed AI noise reduction algorithm improvements, the results should be good. But the only way to know is to put the M5 through a voice test. So shall we? Okay, so we're starting out with a 1000 XM5s, they have more microphones and various AI enhancements, like I said so. This is pretty ideal scenario. We're in a quiet office, but should give you a good sense of how they sound, voice quality. Are you impressed? Are you meh? Either way, this is the best Sony's managed to do so far. Okay, now we're going back in time to the 1000 XM4s, Sony's older headphones, their last gen model. Some people liked these for voice. I was never really that impressed, but again, we're an ideal circumstances a quiet office. So if you're working somewhere, trying to get on a meeting and talk to folks, this is how the M4s perform. And so now we've got the AirPods max, even more expensive than the M5s, these are Apple's flagship headphones. They've gotten good marks for voice quality. So tell me what you think. Do you prefer these or Sony's? But these are a lot more money. So gotta factor that in too. And these are Bose's noise canceling headphones 700, like the Sony, they've got a lot of mics. They've gotten good reviews for their voice quality. They look similar too. So it's up to you to decide whether Sony sounds better or if Bose has a leg up, again, we're in a very quiet office. So I think all these are gonna sound pretty good but it does come down to the details. So let me know what you think in the comments. Last stuff are Sennheiser Momentum 3 wireless. I love how these headphones feel and sound and look but they don't have the best mic. So I'm sure they're not quite as good as the AirPods max or the Sony, but just another comparison for you to hear and see how they come out. 1000 XM5s still support LDAC, Sony's Kodak for higher quality wireless audio. So if you can't plug in, LDAC is the next best thing for hearing high music from Apple music, Amazon music and other services, but only on Android, mind you if you've got an iPhone, you're stuck with the good old lower quality AAC and SPC for Bluetooth. These headphones also support multipoint. So you can pair them up with two devices at once say your phone and your laptop. Unfortunately, Sony still makes you choose one or the other. You can enable either LDAC or multipoint but you can't do both at the same time. The 1000 XM4s had the same restriction and it's back again here. Battery life is still the same 30 hours, which is more than enough to cover pretty much any long haul flight. If you turn off all the bells and whistles you can stretch it out even long. Last, I wanna talk about missed opportunities. All of those things I was hoping Sony might add this time around but still hasn't. First, it's getting silly that these headphones can't work wirelessly with the PlayStation five. They're both Sony products. What are we doing here? Second, the USBC port is still just for charging and a number of other headphones let me use it for audio as well. There's also still a complete lack of water or sweat resistance. So keep that in mind. I know these aren't workout headphones but some progress would be nice. Maybe by the time the 1000 XM6s roll along in two years, some of these points will be addressed but I'm not gonna hold my breath. And so all of that in a nutshell is Sony's 1000 XM5s, they've got a new sleeker design that still doesn't rise up to their $400 price. The active noise cancellation is better than it's ever been. They sound way different which might prove somewhat divisive. For anyone that already has the 1000 XM4s, there is zero reason to run out and upgrade to these. Your headphones can do everything these can but if you're on older Sony's, like the M3s S or M2s, then it starts to make more sense. You're getting multipoint and the best ANC Sony's pulled off yet. I don't love that the price has gone up and I have no idea what Sony was thinking with this case. For those reasons, take a look at the M4s and maybe save yourself some money. I feel like Sony might have gotten confused about what it wanted the M5s to be, they're like the strange half step between the M4s and even more expensive headphones like the AirPods Max, but at the end of the day there's still a damn good set of noise canceling headphones. Hey there everybody, thank you a ton for watching this always. Right now I'm outside of a coffee shop in New York city. So we hear how the empire sound in a much louder environment, but for the whole review go to the verge.com and for more videos like this, youtube.com/the British.",
    "transcript_keywords": [
        "Sony",
        "headphones",
        "noise canceling headphones",
        "noise",
        "Sony headphones",
        "canceling headphones",
        "noise canceling",
        "sound",
        "Sony older headphones",
        "case",
        "time",
        "Bose",
        "good",
        "ANC Sony",
        "Bose noise",
        "Sony headphones sounded",
        "past Sony headphones",
        "voice",
        "AirPods max",
        "noise counseling headphones"
    ],
    "transcript_entity_values": [
        "zero",
        "New York",
        "USBC",
        "ANC",
        "Android",
        "one",
        "M4s",
        "Apple",
        "Second",
        "four",
        "WH-1000XM5s",
        "AAC",
        "British",
        "today",
        "the AirPods Max",
        "1000 XM4s to 30 millimeter",
        "50 bucks",
        "many years",
        "eight",
        "Bose",
        "M5s",
        "the end of the day",
        "two years",
        "Spoon",
        "years",
        "the same 30 hours",
        "M5s",
        "half",
        "Bose",
        "XM5s",
        "two",
        "SPC",
        "Amazon",
        "One",
        "M2s",
        "Sennheiser Momentum 3",
        "400",
        "LDAC",
        "Sony",
        "40 millimeter",
        "1000",
        "PlayStation five",
        "first",
        "iPhone",
        "400 bucks",
        "AirPods max",
        "M5",
        "700",
        "Kodak",
        "First"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "NORP",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "MONEY",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORDINAL"
    ]
}