{
    "id": "pCaRTvc-6d4",
    "title": "A gimmick worth buying - AM 65 'Less'",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-02-23T20:41:14Z",
    "video_url": "https://www.youtube.com/watch?v=pCaRTvc-6d4",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "touch bar",
        "keyboard",
        "type",
        "office",
        "cool",
        "cybertruck",
        "tesla",
        "8bit",
        "super famicom"
    ],
    "views": 379524,
    "likes": 11046,
    "comments_count": 907,
    "description": "Check out the Vessi StormBurst and their other styles at   Use code SHORTCIRCUIT for 15% off your entire order and free shipping.  Cybertruck, Super Famicom, Netflix. What do these all have in common? Angry Miao made a keyboard based on them! With fewer buttons than the average 65% keyboard, AM came up with an interesting way to keep your arrow keys without taking up space, a sweet touch bar! We had Plouffe take a look to see if this is a worthy replacement or if you should stick to regular physical keys.  Check out the Angry Miao Am 65 Less Wireless Keyboard:  Check out the Angry Miao Cyberboard Wireless Keyboard:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   COME TO LTX 2023:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   OUR WAN PODCAST GEAR:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Even LESS keyboard  0:39 Unboxing the keyboards 2:46 Design impressions and unique features 6:00 Sponsor - Vessi 6:30 Switches, flex, and RGB lighting 9:31 Typing sound/feel 10:35 Testing the touch bar 13:28 Pricing and overall thoughts 14:46 Outro",
    "description_links": [
        "http://vessi.com/ShortCircuit",
        "https://lmg.gg/ImiGj",
        "https://lmg.gg/6KAG0",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/masponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- This is a 65% keyboard and this is a 65 less. I have no idea exactly what that means. We're gonna open the box and find out. As you can see, it is top secret. We've got an Early Bird model. It's from Angry Miao. So while I'm not sure what the pricing is, I bet you it's a lot. We've got two versions. We've got the Laser and the 8-Bit. I've heard that these come in I think seven different colorways. These ones are the two more unique versions. So it's cool that they sent them. I know that the laser is definitely inspired by the cyber truck, and I think it's got some lights on the front of it, which should look pretty cool. And the 8-Bit is probably the famicon design, you know, kinda like a classic console. Let's open this guy up first and take a quick look. Ah Ooh, they got a nice cloth with the Angry Miao logo. (keys clicking softly) Sounds pretty good through the cloth. Take that out. And we got a little guide right here. Aome pretty hefty foam. There's a box here. What's in the box? Packaging contents. Ooh, this is like a foam too. Is this just extra foam? Oh right, okay, so this is another leaf spring adjustable keyboard. This is a two-way adjustable, not three-way adjustable, like we saw on the AM AFA. As you can see, we've got some extra leaf springs for if we want to do any adjustments. We've already looked at that in previous keyboards. I kind of get the gist of it. We're not gonna adjust it here today, but they give you all the tools to both open it up and change out whatever you want. What else do we got? More of those ribbon cables. This is some foam. I don't know why they've included an extra little piece here. I'm sure that this is already inside the keyboard as well. It's weird that they've included this, but not any replacements for any of the other foams or anything that would go in here. So I'm not sure why it's outside of any other packaging. Another complaint that is very valid with these keyboards is that I don't seem to have a cable. If you're spending, what I'm guessing is hundreds of dollars on one of these, it should come with a cable. Oh my god, this thing is super cool. It's got this little cool less is more stamped in there. It's also got wireless charging. If you've got a cyber mat from Angry Miao, we don't have a cyber mat with us today. But you know what, I wanna check out the cyber truck. I wanna check out the laser. (imitating laser noises) You ever listen to crocodile? I think it's crocodiles or baby alligators. They sound like lasers. (laser sounds coming from baby crocodiles) - [Cameraman] Sweetheart, aw. No, climb all over me if you could. - It just kind of smells like perfumed electronics. I don't know, it's like a new car smell. Smell this box. - [Bell] Nah, I'm good. - You don't wanna smell the, it's got like a new car smell to it. I don't know how else to describe it. Otherwise, yeah, it's the same contents on the inside. What I really want to see is the colorway and if this one has the extra features I'm thinking of, Ooh. Okay, I don't like these clear keycaps. They had them in the AM AFA as well and I just, I'm not a fan. That's fine, that's entirely a personal preference. They don't feel bad. It's just, I don't know. I don't like the see-through look at least on keycaps. See this is is a 65 keyboard but it's not a 65%, and that's because if you look at this one, it's clearly missing a few keys, right? So we don't have our arrow keys first of all. It doesn't look like there's a page up, delete, page down, or end. Those are all missing. We just got function right here, and then I'm not sure what this b, probably control. And then we're also missing a extra button over here. So there's either this is either control or windows but we're missing a third key. And then, I mean the knob is you don't need a knob to make it 65%, that's fine. But yeah, so it's missing a few things. And the cool thing is though, this little guy right here that's on both of them, any of these, no matter what the color way you choose, you're gonna get this cool feature. This is a touch bar and you can use it for arrow keys. So you can use it to go like, you know, just left left, left, right, right, right, up, down, whatever. And you can actually use a couple other commands too as long as you have their software installed. You can go, I think a long press is, it'll start scrubbing through a video or it'll turn the volume down, or you can like double tap or you can swipe up and stuff. It's really cool and I'm actually very curious to see how user friendly it is. This one also has the wireless charging on the bottom that you can use with a cyber mat. And then we've got another not for sale stamp. Version 0.1. so yeah, this is super early. If anything doesn't work, it's probably just because of a lack of support for at the moment. Just in terms of quality and feel and all of that good stuff. It's a CNC aluminum chassis, so it's heavy. Actually let's weigh it. Seven pounds, that's my guess. Seven, seven pounds. Wow, I was way off, holy (beep) It's only 3.5. This one's the same. Yeah, 3.4, 3.5 pounds. So yeah you get a pretty hefty board. But yeah, as you can see, it's a relatively seamless case design. It looks like everything actually houses over top here and I'm not sure how to take it apart. I guess that's my one complaint is I don't see any obvious screw holes right away, although that's kind of a nice thing to be honest. It's probably easy. Probably just take all the key caps off and open it up no problem. It takes them six hours to CNC all of this aluminum. So I don't know the price I'm keeping myself in the dark so I can kind of judge this on its own and then figure out the price after. But it's gonna be probably a lot. And then you've got some really cool features with the touch bar. This one also, these should be LEDs that will light up kind of like the cyber truck headlights. As you can see we don't have the same feature on the eight bit version. The other one that we don't have unfortunately, I thought the eight bit was the one that comes with the cool extra couple of little lights here but that's actually the Mech Love version which is a take on \"Love, Death and Robots.\" So if you like that series, I think it's got a couple of their symbols on either side and those light up and you can adjust the lighting and stuff for those, which is pretty cool. But we wanna use the cool cyber truck one with the sweet front LEDs. So while I absolutely adore this key cap set, I gotta put it away. It's so nice, it's got like Kanji or something on it. I don't know. I'm gonna take one of these keycaps off. I'm gonna pull a switch out cause it should be hot swappable. I'm gonna plug it in, turn it on. But not before a word from our sponsor Vessi. Vessi claims their shoes are 100% waterproof and keep your feet cool in the summer and warm in the winter. Their new StormBurst shoes combine the comfort of a sneaker with the grip and coverage of an outdoor boot. Vessi has added extra layering for added warmth as well as extra grip to prevent you from slipping and sliding in unfavorable weather conditions. The StormBursts are feature packed and will make great gifts with the unpredictable spring weather coming up. Check out the Vessi StormBursts and other styles at Vessi.com and use code Short Circuit for 15% off your entire order. They've got their ice silver switches in these guys. Let's take one out. Oh that came right with the key cap. Sure, why not? It's a three pin switch. White housing with a clear top. South facing RGB. Take that as you will. My one complaint actually is that this doesn't look like it can even use five pin switches. Yeah, it looks like you might be kinda limited when it comes to which switches you're gonna put in here. Whether that's a smaller one like Otemu. I don't think so. I bet this is like a cherry switch, but it could also just be the five pin holding you back. Cause I personally have a lot of five pin switches, and I don't think they'd fit in here unfortunately. I can't tell if they're factory lubed. Even if they're not, they actually sound okay. They could definitely use a bit more, but that's fine. You can really see how flexy it is, and that's thanks to that leaf spring mounting system. God, that's kind of wild actually. I'm not sold entirely on a super gaskety or super leaf springy mounting system. I'm like I don't need all this flex when I go to type down. I actually kinda like a hard surface but that's just me. That's personal preference. And the reality is you can, these leaf springs have two stages so if it this is too loose, well if it's on stage one you're pooped, it's too loose. But if it's on stage two, you could tighten it up a little bit. So maybe it's better then. As much as I don't like the look of the clear key caps both just kind of in front of me with RGB on and off, I do love how colorful this becomes with the RGB turned on. I'm not gonna be able to say the same for the brown one. Let me just plug it in real quick just to verify. Yeah, you can hardly see the lights at all. Oh, the wireless is working. It's not bad. You still get some shine through in between each of the keys if you don't have shine through caps. Get that outta here. We're gonna get the cyber truck version, which as you can see has cool lights on the side. I wish they were brighter. The images that they showed in the little media guide they gave us actually had the light like splashed out on the table and stuff and it probably does that in pitch black but it's definitely not gonna do it here with studio lighting. I don't even think you can see that on camera to be perfectly honest. - [Bell] I can't see it in person. - [Nicholas] I can see it in person. - [Bell] No way, on the right side you can, barely. - It's very, very minor. - [Bell] The left you can't see it at all. - It's very, it's very minor. I think it's at max brightness right now to be honest. FN + swipe left or right on the touch panel is what adjusts the in switch brightness. Function key, there we go. What? Okay, so that's max brightness for the switches. That's so cool. I already like the touch, I already like the swipe bar. It's so dumb but I like it. Oh yeah, it is making a difference. Okay, no we were pretty much at max brightness before. It's maxed out right now. That's why there was no change. I was already at max brightness so you can use FN, and Z, and slowly cycle through the different colors. As you can see we're down to, we're at a blue now and if you cycle through them now it's purple. It goes basically a shade at a time. But yeah, it's definitely not as bright and lasery as I was hoping for. Some of the marketing stuff that we got definitely leads us to believe differently. Yeah, as for sound and feel, it sounds and feels pretty good. Oh that does sound and feel good I'm not gonna lie. As much as I don't like Angry Miao's pricing, they do a lot of unique stuff. And so it's really hard to argue against it when not only is the keyboard definitely high quality, but it has a cool niche feature that no one else is doing or not many other people are doing. So at that point you can charge whatever you want, as long as it sells, it's the right price, at least for some people. Away we go. Oh, this is already bad. I gotta Mulligan, Mulligan, Mulligan, Mulligan, Mulligan. Okay. (keyboard clacking softly) 116, 97% that's not bad. Messed up a couple times early on. It just sounds and feels good. I've been getting more used to using a 65% recently. Especially at work when I'm mostly just typing. I don't do a lot of like Alt+F4 or F5 even to refresh stuff like I would at home. I almost never need a Numpad for anything. Because I'm a writer, I'm just writing scripts usually. So for me the layout is actually pretty good. The touch bar, I gotta try this on like a video player. It works! What. This is so cool. Okay, I hit, I hit some extra key, and that like stopped the window from being full screened. Right, right, right, right. Okay so that's the whole thing is you're supposed to be able to keep your fingers on the home row, so that you can just like the swipe should become a part of your typing basically. It should feel as natural to you, after using this thing for a while of course, it should feel as natural to you as hitting the space bar with your thumb. And honestly that didn't take too long to get used to. Wow, like I know this is not the most riveting thing to watch, 'cause it's just snake, but it works. Like this is such a proof of concept right now. Oh my god, nope. (Nicholas laughing) This is so dumb. It's so good though. I don't know what the hell it is with these guys. They seem to be able to find these little quirks that just like really tickle me somehow. Okay, okay, okay. So we should be able to like hold this down and it should fast forward the video. I don't know if that's only in video players. Swipe, swipe worked. Okay. That's so cool. What about up, up is volume, up and down is volume, so you can like swipe up and down for volume. If I hold, no, what if I like swipe up and then hold? No. Okay. You can download some software for it and then you can tweak all of this stuff however much you want. I think you can do different function layers and stuff like that. It already feels pretty natural to just scrub through videos like this. And then I mean I've never used the arrow keys to do that though in the first place, but something about this feels right. I don't know what to tell you. One thing that a lot of you might be wondering is, ah but I can't use a wrist rest now, cuz it's gonna block the bar. True, however, a lot of keyboards that are around this height like this doesn't feel like it needs a wrist rest for me personally. And I get it, they're fixing their own problem. But Angry Miao does sell these like hover wrist pads that you can put on either side. So this would still be open to you if you're using those guys. Maybe they made this to sell more of those wrist pads. I don't know. But it honestly does feel pretty natural. Like I actually want you to come try this really quick. - All right, let's see. Wow. - [Nicholas] Oh, the hold did work. - [Bell] You just swipe and hold. - [Nicholas] Oh, swipe and hold, okay. Are the volumes going up and down? - [Bell] Well it works one way. I don't know. - [Nicholas] The down was a harder than going up. - [Bell] It is very easy to go right. Can I go left? Ooh, the up and down is hard to hold. - [Nicholas] Up and down yeah is not easy. - [Bell] You don't have a ton of space. But it does work. Look at it, yeah, it went to a hundred. - Yeah. - That's cool. And yeah, it does, if I we're to like, do, do do, do do. oh I just need to fix something. - It doesn't feel unnatural right? Like your thumb is actually kind of right there. Like I'm actually totally okay with this. - That feels pretty good. - Yeah. - I'll give 'em that. I'll give 'em that. - Cool, okay, so it's gonna type great. It's gonna feel pretty good and if 65% is good enough for you, then this is probably enough of a keyboard that you can deal with missing a few keys. How much is it Bell? - [Bell] So the standard MSRP starts at 398 US dollars but it goes up to 550 US dollars. - Okay, so you're paying similar prices to the cyber board maybe a hundred bucks less. You don't get the cool screen on the front with the LEDs that you get, but you do get the really sick touch bar. I can't justify spending that much on a niche feature, especially when you can get really good 65 percents in the same quality range as this for half the price. A little less than half the price in some cases. But honestly, if you want something that is like really cool and kind of just stands out on your desk, maybe it's for you. I'm not gonna buy it. Do I want one? Yes. Will I buy one? No. Like I said before, the embargo for this is the day we're filming, but it's going up on Indiegogo on February 2nd. So if you do want one, if you are interested, if you're okay with paying that like, at least a hundred dollars extra luxury tax for a little cool feature, hopefully you can snag one for yourself 'cause the stuff from Angry Miao, you know as much as it's priced high, it tends to sell out pretty quickly. Thanks for watching Short Circuit. If you want to check another one out, maybe check out the cyber board. That was one of the first keyboards I looked at on this channel and I was a little love struck.",
    "transcript_keywords": [
        "cool",
        "Angry Miao",
        "yeah",
        "pretty",
        "kind",
        "good",
        "feel",
        "cyber",
        "extra",
        "pretty good",
        "swipe",
        "stuff",
        "Angry",
        "Miao",
        "feels pretty good",
        "key",
        "feels pretty",
        "keys",
        "cyber truck",
        "keyboard"
    ],
    "transcript_entity_values": [
        "65",
        "half",
        "seven",
        "0.1",
        "the day",
        "Mulligan",
        "100%",
        "February 2nd",
        "three",
        "116",
        "One",
        "a ton",
        "550 US dollars",
        "Seven pounds",
        "Vessi",
        "one",
        "at least a hundred dollars",
        "a hundred",
        "F5",
        "seven pounds",
        "six hours",
        "the summer",
        "Bell",
        "Vessi.com",
        "A little less than half",
        "3.5 pounds",
        "65%",
        "Numpad",
        "max",
        "South",
        "Laser",
        "the Vessi StormBursts",
        "3.4",
        "StormBursts",
        "third",
        "the cyber board",
        "first",
        "97%",
        "Nicholas",
        "398 US dollars",
        "StormBurst",
        "two",
        "Angry Miao's",
        "Otemu",
        "Early Bird",
        "Seven",
        "Angry Miao",
        "Love",
        "Short Circuit",
        "a hundred bucks",
        "CNC",
        "RGB",
        "the winter",
        "15%",
        "five",
        "hundreds of dollars",
        "eight",
        "Indiegogo",
        "only 3.5",
        "today",
        "Kanji"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERCENT",
        "FAC",
        "PERSON",
        "LOC",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "PERCENT",
        "PERSON",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "LOC",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "DATE",
        "PERSON"
    ]
}