{
    "id": "pD4RNuALvS8",
    "title": "New Wi-Fi Enabled 360 Reality Audio Speakers! Unboxing Sony SRS-RA5000 and Sony SRS-RA3000!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-04-02T20:41:27Z",
    "video_url": "https://www.youtube.com/watch?v=pD4RNuALvS8",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Sony SRS-RA5000",
        "Sony SRS-RA3000",
        "SONY",
        "unboxing",
        "Tech Unboxing",
        "SONY UNBOXING",
        "SONY SPEAKERS"
    ],
    "views": 407234,
    "likes": 10707,
    "comments_count": 812,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. And today we are checking out two new speakers from Sony. A huge thank you to Sony for sponsoring this video and giving me these to these check out. This is the new Sony SRS-RA 5000 and this is the Sony SRS-RA 3000. Now, obviously I'm such a huge Sony fan because they basically power my entire life from cameras to headphones, to lenses, to TVs to now these new speakers. Now I've been loving the introduction of 360 reality audio in their headphones. So I'm so excited to hear what this sounds like in my home. 360 reality audio is available on title nugs.net and Deezer. And now, starting in April 360 reality audio content can also be streamed on Amazon music HD by using Alexa cast. You can also do multi-room speakers. So I can have both of these speakers playing at the same time, playing the same content all throughout my house. So let's get these unboxed and check them out. (techno sound playing) - [Justine] The SRS RA 5000 features multi-room music. The ability to connect wirelessly to your TV, voice control, sound calibration and automatic sound adjustment to make sure all of the tracks are playing consistently. Oh my goodness, - like this is my color scheme. - [Justine] This is it! This is me! This is me if I were a speaker. 360 reality audio is one of the major features of these speakers and it allows you to experience music all around you with ambient room filling sound. Now, even if your tracks aren't 360 reality enabled you'll still get that immersive audio enhancement using Sony's unique algorithm to upscale your tracks. This speaker has seven driver units so you'll definitely be able to hear a difference. There's three speakers facing up, three side speakers and a woofer which will help flood the entire room with sound. - Okay, We've got our first one unboxed. Let's open up the SRS-RA 3000 Look at you. Oh, this is cool because we have a different color. - [Justine] The Sony SRS-RA 3000 shares lot of similar features with the RA-5000. While it is a bit smaller, it has a beam tweeter that produces sound waves that overlap each other to form an upwards facing wavefront. The RA-3000 is also humidity resistance. So you can use it safely in a bathroom, kitchen or any potentially humid environment. - Oh, Whoa. Okay. - [Justine] I actually loved this color as well. So this is definitely gonna match my kitchen aesthetic. So let's look at these side by side. - Obviously this is a much larger speaker so you've already going to be getting a much louder sound but I feel like this has a lot more benefits. It also has a much smaller power cord. I love the fact that you can also wirelessly connect these to your TV. And I do have one of the Sony TVs that I did a previous video on. So it's kind of cool to have this whole ecosystem that kind of works together. I cannot wait to hear what these sound like Let's go set them up. (slow upbeat music) (slow upbeat music continues) - [SRS-RA 5000] Sound calibration start. - [Justine] Oh. (robotic sound) - I think we're calibrated. I have the Sony music center app already installed and this is what we're going to use to calibrate and sync this to my phone, Much like syncing your headphones, It's basically the same thing that you're doing here. I just opened the app and it just, it just popped up. Like it's already there. Let's play our first song. (deep bass music) I love that it has the button on the side. I know you like Whoa. Just what you see when I walk by you. Take your time and you drown my world with the look in your eyes. Your smile is like (music continues playing) - This sounds incredible. (music continues playing) - Okay, the hard thing about doing these types of videos when we're talking about audio is you guys can't actually experience what I'm experiencing because you're hearing the audio basically just off of my microphone, but what's incredible about 360 reality audio is the fact that they are able to really create this incredible immersive experience because they're designing these sounds in a 3D space. It's an all new way to create music and it's really an all new way to experience it. Let me play another track. (deep base song playing) - Let's turn it all the way up. (deep base music playing continues) It's so loud. Whoa. Wow. I feel like I made a concert. I haven't been to a concert in over a year and a half. (Rap song playing) Foo Fighters Foo Fighters 360 reality audio? (rock music playing) This is everything that I ever wanted. (rock music playing continues) - I'm slightly speechless because I have a ton of smaller speakers around my house, but honestly, nothing has sounded like this crisp and clear. And it's amazing. I also previously had tested out playing some none 360 reality audio, but I don't have clearance to play those songs. And it's incredible because even though those songs aren't specifically created with the 360 reality audio technology, you can easily turn this feature on - [Justine} by hitting the music note for instant immersive audio enhancement. This is what allows the speaker to make none 360 reality audio tracks sound very similar to a 360 reality audio experience. - I love it, both of these speakers have a 3.5 millimeter jacks. So you could do audio input. It has wifi capabilities and Bluetooth. So you're able to just Bluetooth in and I'm also able to use my voice if I have a Google or an Alexa enabled device, I can say things like Play tool in the living room. (techno music plays) I don't have clearance to play you but I love. I'll continue that track later. I listened to so many different genres of music and what's really great about this - [Justine] is it has an auto volumes. We'll be able to consistently keep those tracks at a consistent level throughout my listening experience. - It's also really cool because I'm able to wirelessly connect my television to the speaker - so I can have - [Justine] an even more incredible immersive experience by watching TV and using the speaker connected to it. (slow beat sound playing) My kitchen speaker is all set up and like I was talking about before - I can control this with my voice using any Google or Amazon Alexa devices. - [Justine] So play Taylor Swift on kitchen speaker - Shuffling songs by Taylor Swift on Amazon music, playing on kitchen speaker - And to avoid a copyright strike we're going to stop it right there, but it's really great because being able to use my voice to control things especially when I am in the kitchen is amazing because I'm normally in here cooking or causing some kind of trouble fires. This is, this one is resistant to humidity. This is something that you could put either in your kitchen or in the bathroom. So obviously this is now my new kitchen companion. I like that this is a smaller profile but still has some incredible sound quality. So let's test this out. (upbeat song playing) - Whoa. Whoa, whoa, whoa. for being such a small speaker. I'm shock. (piano playing) Whoa, whoa, whoa, whoa. Oh God, I didn't mean to do that. I didn't mean to do that. I push, I push something. I love doing these types of videos, but it's so hard for you guys to actually experienced what we experienced in real life. Thank you guys so much for watching. If you guys want to get more information about the speakers that we talked about today. I will put all of the links in the description below. I am so excited about this new addition to my Sony family. I'll see you guys in the next video. - Bye. (slow beat music )",
    "transcript_keywords": [
        "Sony",
        "reality audio",
        "Sony SRSRA",
        "Whoa",
        "audio",
        "speakers",
        "speaker",
        "reality",
        "sound",
        "kitchen",
        "Justine",
        "SRSRA",
        "kitchen speaker",
        "music",
        "guys",
        "experience",
        "incredible",
        "playing",
        "Amazon",
        "tracks"
    ],
    "transcript_entity_values": [
        "Amazon",
        "one",
        "Taylor Swift",
        "Justine",
        "Sony",
        "three",
        "about 360",
        "a ton",
        "Bluetooth",
        "Alexa",
        "Deezer",
        "SRS",
        "Google",
        "Foo Fighters Foo Fighters 360",
        "April 360",
        "RA-3000",
        "360",
        "today",
        "two",
        "seven",
        "3.5 millimeter",
        "Alexa",
        "first"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORDINAL"
    ]
}