{
    "id": "pD8jze5fCHA",
    "title": "Is your phone at risk? Flipper Zero vs Phone!",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2023-10-13T14:00:40Z",
    "video_url": "https://www.youtube.com/watch?v=pD8jze5fCHA",
    "category": "People & Blogs",
    "tags": [
        "flipper zero",
        "iphone",
        "iphone 15",
        "iphone 14",
        "ios 17",
        "ios",
        "flipperzero",
        "flipper",
        "bluetooth",
        "flipper bluetooth",
        "xtreme firmeware",
        "nfc",
        "rfid",
        "hack",
        "hacking",
        "infrared",
        "radio",
        "gpio",
        "tesla",
        "gate opening",
        "key",
        "key fob",
        "key card",
        "credit card",
        "credit card nfc",
        "card clone",
        "card cloning",
        "prank",
        "pranking",
        "infared",
        "blue tooth",
        "bluetooth hack",
        "ble",
        "bluetooth low energy",
        "bluetooth hacks"
    ],
    "views": 95073,
    "likes": 2567,
    "comments_count": 188,
    "description": "I demonstrate how to attack iPhones using a Flipper Zero and the Xtreme flipper firmware. There is an issue in iOS 17 that allows a Flipper to crash an iPhone. You probably want to disable bluetooth on your phone unless you are using it. Bluetooth can be nice, but can also cause issues.  Disclaimer: Only attack networks and devices that you own or have permission to attack. I have purchased own all the equipment in this video and I gave myself permission to attack my own devices.  // Flipper Zero Discount // Get a 5% discount using my affiliate link :  and/or use code DAVIDBOMBAL WiFi Dev Board:   Xtreme Firmware:   // David's SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:   // MENU // 00:00 What this can do! 00:23 Flipper Zero 00:44 Demonstration 00:50 Lockup Crash 02:02 Random Action 02:35 Phone crash 02:49 Random Pair 03:10 Solution 03:40 Flipper Zero Xtreme 04:25 Download and install Flipper Zero Xtreme 05:16 Demo after a new install 05:43 Apple iOS vs. Xtreme 06:24 Outro  Detailed timestamps: 00:00:00 - Introduction to using FlipperZero with iPhone iOS 17.03. 00:00:23 - Demonstrating FlipperZero with dev version of Xtreme software. 00:00:35 - How to upgrade firmware of FlipperZero for the Xtreme version. 00:00:45 - Demonstration of Bluetooth options on FlipperZero. 00:01:03 - Effects of the attack on iPhones. 00:01:36 - Reasoning why certain iPhones are unaffected. 00:01:55 - Recommendation to disable Bluetooth for security. 00:02:26 - Differences between random spamming vs. crashing. 00:04:29 - How to set up FlipperZero with the Xtreme firmware. 00:06:03 - Closing remarks: Apple's potential fixes, disabling Bluetooth, and video outro.  flipper zero flipper flipperzero iphone bluetooth iphone 15 wifi hack hacking android apple apple iphone samsung  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   Disclaimer: This video is for educational purposes only.   #iphone #flipperzero #bluetooth",
    "description_links": [
        "https://lab401.com/r?id=42cm8b",
        "https://lab401.com/products/flipper-zero-wifi-devboard",
        "https://github.com/Flipper-XFW/Xtreme-Firmware",
        "https://discord.gg/davidbombal",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal"
    ],
    "transcript": "In this video I'm going to show you how to use a Flipper Zero to crash an iPhone running iOS 17.0.3 In this example I've got two iPhones running 17.0.3 you'll notice that this one doesn't crash so I'll show you how to solve this problem like I've done on this iPhone. This iPhone is using iOS 16.7 it will be spammed but it won't crash like iOS 17.0.3 will. So on the Flipper Zero in this example I'm using a Dev version of the Xtreme software you can download that software from their Discord by going to their development Channel and downloading the software I'll show you in a moment how to upgrade the firmware of your Flipper Zero to use this Xtreme version but for the moment let's demonstrate this. I'll go to Apps, go to Bluetooth, I'm going to select Apple BLE Spam notice there various options here lock up crash that's what I'm going to demonstrate now we've also got random action random pair and so forth but I'm going to select lockup crash and what we should see when I start the attack is that devices are shown on the phones so notice stuff is appearing on the two iPhones nothing is appearing on that phone but I can close these on the two iPhones but what will happen is this phone will lock up notice I can't do anything on this phone. On this phone I could press down as an example I can press up I can go to my settings so as an example I could go and look at Bluetooth and notice that's on. Notice what's happening on this phone however the Flipper Zero has managed to crash this phone running iOS 17.0.3 the reason why this one didn't have any problems is because I've disabled Bluetooth through the settings so if you want to solve this problem until Apple update their software then disable Bluetooth you might want to do the same thing no matter which phone you're using even on this phone running 16.7 you might want to stop it being spammed because on the Flipper Zero I could do a random action where I'm basically spamming the iPhone so rather than trying to crash it I just simply spam it with all kinds of devices so Apple TV here, once again Apple TV notice this phone is rebooting I've managed to crash the iOS 17.0.3 phone. But as soon as the phone comes back again notice I'm getting random devices shown here so I'm doing random rather than crashing so it won't crash it at the moment but if I select crash and start sending messages to this phone it'll encounter problems and will crash so notice set up your Apple TV and when I try and close that now again this is locked up I can do random pairing where it tries to pair with a device so for instance here notice the air tag notice it says not your beats here so I'm randomly spamming that phone this phone not much is happening at the moment but let's go back to lockup crash and try and crash the phone notice set up a new iPhone I'll close that okay so the way once again to solve this at the moment is to disable Bluetooth in the settings you probably want to do that anyway when going out so that BLE or Bluetooth low energy devices cannot try and pair to your phone. Hopefully that demonstrates the problem notice the this phone has now locked up. So locked up once again and the only way to solve this is to do a hard reset on the phone. Okay so there you go I have reset the phone and hopefully when it comes back it'll be working but this is the problem with a fFlipper Zero running the Xtreme firmware in this example a development version I can either spam a phone. So once again going to apps Bluetooth Apple BLE so here has an example with random so you can see it says says join this Apple TV so I could kill both of those as an example I'll stop that attack but notice here we're getting a whole bunch of options. Let's do random pair so notice here it says not your AirPods max stop that let's try another one like Apple TV order full notice right at the top here Apple TV set up new iPhone notice here set up new iPhone on both of these phones so I'll stop that I think you get the idea to set this up what you need is a Flipper Zero obviously you need to download the Xtreme firmware but in this case you're going to go to their Discord and you're going to download the development build of the firmware so make sure you go to the right channel and then download the development build and then on the qFlipper software as an example I'm going to select install from file and I'm going to select the file that I downloaded. Notice this is the development build of the extreme software and we are asked do we want to install this the answer is yes now you may not be able to see that very clearly but notice the development build of the firmware is being installed on the Flipper Zero I'm basically just reinstalling the software that I've been running you can see that it says updating now and there you go it's now being updated and what we'll do once again is go to Apps, Bluetooth Apple, BLE Spam once again we could run the crash option and notice that's now appearing on these two phones not appearing on this phone because that phone has got Bluetooth disabled and I could once again spam the devices but the big idea here is that the phone will crash if it's using iOS 17.0.3 Okay so hopefully you've learned something you probably want to disable Bluetooth when you go out. A lot of people think iOS devices are secure don't have problems but notice here I've just shown you once again how to lock up this phone basically crash it by using a Flipper Zero and some software that I can download hopefully Apple will fix this problem this phone is totally broken now this one is still okay that one even though it's running the latest version of Apple iOS hasn't got a problem because Bluetooth is disabled on that phone this one however is totally locked up and I'll have to physically reset it. Okay I'm David Bombal hopefully you've enjoyed this video hopefully you've learned something don't forget to disable Bluetooth when you go out there.",
    "transcript_keywords": [
        "Bluetooth Apple BLE",
        "phone",
        "Bluetooth",
        "notice",
        "Apple",
        "apps Bluetooth Apple",
        "Bluetooth Apple",
        "crash",
        "Flipper",
        "Apple BLE Spam",
        "disable Bluetooth",
        "Apple BLE",
        "select Apple BLE",
        "BLE Spam notice",
        "iPhone",
        "iOS",
        "random",
        "BLE Spam",
        "software",
        "running"
    ],
    "transcript_entity_values": [
        "Bluetooth",
        "iPhones",
        "iOS 16.7",
        "Apple",
        "Apple BLE Spam",
        "two",
        "Apple iOS",
        "16.7",
        "17.0.3",
        "a Flipper Zero",
        "Discord",
        "qFlipper",
        "Xtreme",
        "iOS 17.0.3",
        "iPhone",
        "the Flipper Zero I",
        "Apple TV",
        "one",
        "Bluetooth Apple",
        "Flipper Zero",
        "AirPods max",
        "Flipper Zero",
        "David Bombal",
        "the Flipper Zero"
    ],
    "transcript_entity_types": [
        "PERSON",
        "NORP",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "PRODUCT"
    ]
}