{
    "id": "pe4u7anS28g",
    "title": "The World's Thinnest Laptop!",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-04-05T21:40:42Z",
    "video_url": "https://www.youtube.com/watch?v=pe4u7anS28g",
    "category": "Science & Technology",
    "tags": [
        "hp spectre",
        "hp",
        "spectre",
        "hp spectre review",
        "hp spectre unboxing",
        "laptop",
        "notebook",
        "ultrabook",
        "thin",
        "thinnest laptop",
        "thinnest notebook",
        "microsoft",
        "best laptop",
        "vs",
        "unboxing",
        "review",
        "unboxtherapy",
        "unbox therapy",
        "tech",
        "technology",
        "apple",
        "iphone",
        "best",
        "iphone 6s",
        "gaming",
        "android",
        "smartphone",
        "macbook",
        "comparison",
        "case",
        "laptop (product category)",
        "windows 10",
        "intel",
        "macbook air",
        "s7",
        "computer",
        "pc",
        "apple inc. (publisher)",
        "windows",
        "gadgets",
        "test",
        "hands on",
        "laptop 2016",
        "2016",
        "best laptop 2016",
        "new",
        "samsung",
        "tablet"
    ],
    "views": 8724856,
    "likes": 92054,
    "comments_count": 7326,
    "description": "HP Spectre -   Had the chance to be one of the first to get my hands on the new HP Spectre. This thing is crazy thin, coming in at just over 10mm. This is the thinnest laptop in the world.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://www.hp.com/go/hpspectrelaptop",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys Lew here back with another video And as you can tell, today something special is happening, I am not in my normal studio environment That's because I'm in Paris. Today I'm checking out The 'Worlds thinnest Laptop' What!? This is from HP, it's called the Spectre And it is... Thinner than a pen, thinner than this pen 10.4 mm (millimeters) thin. Let's jump inside the box and see what it's all about Ok, as you guys can tell that is... That is crazy thin. Your probably wondering like 'Ok it's thin, am I giving something up, what am I giving up in exchange for ultra portability Actually in this case not a ton If you look around the device you'll notice You've got 3 usb C's on the back This one is going to be used to power up the device as well unlike some other ultra thin laptops on the market Your not giving up connectivity there with multiple ports and then you've also got a headphone jack in this location on the back now, if you've got a bunch of older usb equipment and you need to have the traditional connector you have an adaptor included as well, that's simple stuff Let's go ahead and test that out and then Boom. Here's the power brick, it's fairly portable again What about the specs? You're going to be able to configure this guy with either a core i5 or a core i7 processor it's not underpowered. One of my favourite things is this hinge design here as you can tell, it's super smooth but very unusual. Because it's using some piston technology in underneath the hood there. Completely new HP logo Ultra modern to go with the kind of ultra modern vibe. You've got this copper along the bottom The top of this laptop is aluminum but then But then the bottom side is actually carbon fiber You guys know i'm a huge fan of carbon fiber whenever it can be used you'll notice the way these feet sit it actually keeps the the bottom of the laptop up off the surface it's on a little bit thats going to help with cooling. you can also see this unique layout for the grills where the fan is this guy comes in at 2.55 pounds You are hardly going to notice that. Now the audio on this device is by bang and olufsen with HP audio boost You can see the speaker grills there I like what they've done, just to add a little bit of interest a little bit of uniqueness The keyboard is very low profile, a chiclet style keyboard It also has a backlight on it so if you're working in bed late at night and so on, you want to keep the lights dim maybe your trying to set the mood there's also a dedicated button for aeroplane mode and then of course the display it is ips technology what you'll notice is as i sort of twist the display a little bit you're getting no colour shift in the image Video. can it it play video? Yes, of course. Look at this \"Another video\" here you go Jack \"Do I still have to do the 'What's up guys' thing?\" 1080p, full HD display and 13.3\" (inches) diagonally Now the display is actually covered in Gorilla Glass rather than the standard stuff Thats going to give you some extra durability characteristics that i'm sure you're aware of. You can also spec it out with an SSD up to 512Gb This model i'm looking at here has 8Gb of RAM as well You've essentially got your traditional laptop specs just jammed into a much thinner profile. How thin? This pen is actually thicker than the entire device It's the same thickness the entire way Now, when it comes to battery life your going to be looking at roughly all day or HP is claiming 8+ hours so there you have it guys, The new HP Spectre The 'Worlds Thinnest Laptop' You are now aware of it, this thing is launching very soon It's really a unique design, i'm a fan of it. Big thanks to HP for inviting me out here to Paris to check out their latest and greatest Thank you very much for watching guys and i'll catch you on the next episode Later",
    "transcript_keywords": [
        "normal studio environment",
        "guys Lew",
        "Worlds thinnest Laptop",
        "special is happening",
        "normal studio",
        "studio environment",
        "ultra thin laptops",
        "Laptop",
        "Lew",
        "Lew here back",
        "thin",
        "guys",
        "thinnest Laptop",
        "Worlds thinnest",
        "ultra",
        "today something special",
        "video",
        "bit",
        "notice",
        "today"
    ],
    "transcript_entity_values": [
        "10.4 mm",
        "Lew",
        "RAM",
        "HP",
        "13.3",
        "512Gb",
        "today",
        "2.55 pounds",
        "The 'Worlds thinnest Laptop' What",
        "Spectre",
        "Today",
        "Jack",
        "One",
        "Paris",
        "(inches",
        "3",
        "olufsen",
        "8+ hours",
        "Worlds Thinnest Laptop'"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "QUANTITY",
        "WORK_OF_ART",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "TIME",
        "WORK_OF_ART"
    ]
}