{
    "id": "PEEYXC-n_9k",
    "title": "Samsung Galaxy S8 Review",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2017-04-08T20:02:29Z",
    "video_url": "https://www.youtube.com/watch?v=PEEYXC-n_9k",
    "category": "Science & Technology",
    "tags": [
        "samsung galaxy s8 review",
        "galaxy s8 review",
        "s8 review",
        "s8 plus review",
        "galaxy s8 plus review",
        "galaxy s8",
        "samsung galaxy s8",
        "review",
        "galaxy s8 unboxing",
        "plus",
        "s8 plus",
        "samsung s8",
        "s8 vs",
        "s8 plus vs",
        "vs",
        "galaxy s8 vs",
        "android",
        "iphone",
        "iphone 7",
        "iphone 8",
        "iphone 7 plus",
        "apple",
        "7 plus",
        "best smartphone",
        "smartphone",
        "2017",
        "google",
        "pixel xl",
        "pixel",
        "google pixel",
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "best phone"
    ],
    "views": 3008809,
    "likes": 64431,
    "comments_count": 7674,
    "description": "Welcome to the massive Samsung Galaxy S8 Review. This might be the longest video I've ever uploaded. Will you be buying the Galaxy S8?  The Samsung Galaxy S8 Plus is likely the current Android champ but no smartphone is perfect... In this review I aim to show you the good, the bad and the ugly when it comes to the Samsung Galaxy S8. The goal with this review is to give you as much information as possible.  This review should apply to both the Samsung Galaxy S8 and Galaxy S8 Plus as I'm referencing both throughout. The Only difference between the S8 and S8 Plus is screen size and battery size.  Thanks for watching my Samsung Galaxy S8 review!  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "We're back, cause I'm not done talking about, the Galaxy S8! Now I know, I put that video together, alright, Galaxy S8, does it suck? A lot of people got all fired up. How dare he even, put that combination of words together, in the title, in the headline, Galaxy S8 and the word suck, well they kind of, you see they miss the \"does it\" part. And then they also miss the end part. In which I say that it doesn't, suck, at all. In fact it does the opposite Funny how that works, human hearing, and comprehension Remember that, when you're in school, the report card Jack got a very good. No he didn't. Failing grade I kinda open that video, talking about, a few of the things that were bugging me about the phone towards the end, I got to some of the things that I liked You know, people were getting fired up, rightfully so, I don't mind, to be honest One thing that came across to me, from the audience is that the audience wanted more you wanted something, comprehensive You know, sometimes I forget that I'm in this position here, where, you're kind of relying on me! Maybe you want to sit down with a bowl of cereal for half an hour and listen to me dive deeply, into this device So, what did I do, I put on, is this blue? I put on a blue sweatshirt. I love this device, that was what I trying to get across to you guys just maybe, I didn't cover all those little nuances. So today's the day, maybe this the start of something new, in which, you and, and me we spend, even more time together in a video It becomes an experience, we get intimate All because, of the Galaxy S8. So take another bite of cereal, sit back, relax. Here is the good, the bad and the ugly, when it comes to the Samsung Galaxy S8 *Music* Number 1, in the good category, in the good column, we're talking about this display You don't need me to tell you how beautiful this display is, you've heard it everywhere and if you've ever used a Samsung display before certainly in the last few generations, then you know these guys are setting the standard You have an AMOLED panel here, from a contrast perspective whether its in a phone or in that TV over there the ratio between, dark sections of the screen and light sections of the screen. Let me, I just want to bring up, so you can truly appreciate whats going on. But generally, to the average person, a pleasing image has a ton of range between the dark portions on the display and the bright ones When it comes to colour, you're looking for this kind of vibrance, this, this saturation and so on. Now I've mentioned before, this is an unusual aspect ratio and its an unusual curvature to the glass, Of course they are calling it the Infinity display. This is going to give you a sense of immersion into the content that goes beyond the bezel. And its not just the fact that its AMOLED, but its super high resolution. By default, coming out of the box, its not going to be in maximum resolution. But, that's going to provide you with some extended battery life. Nonetheless, if you want it twenty nine sixty by fourteen forty, in a six point two inch display here. Or on the regular S8, five point eight inch. But it doesn't really stop there because, there are a lot of options here for configuration . Now in the first video I think a lot of you guys looked at the way I was talking about it in a really negative light, assuming that what I was saying, was that this was somehow disingenuous Maybe there is an element there where I think Samsung probably could have delivered the max capacity out the box. But it wasn't all negative, for certain users, myself included, having the option to go in there and makes those tweaks and configurations. For a power user like myself possibly a lot of you in the audience you like this ability to dive into the settings and create your own viewing experience But it doesn't stop with brightness and resolution, it also dives into this blue light filter. Which I think is one of the best implementations I've seen So you've probably heard about this in the past where you can kind of shift the colour temperature to something that is pleasing to you, or you can even have it shift throughout the day to help you go to bed at night what you can do here is you could turn it on manually and get this warmer colour tone or you can schedule it, so it comes on at a certain time at night when you're trying to relax and you're trying to see these warm tones, so that your brain doesn't think that you're looking at sunlight and it refuses to shut off. Now there's, this goes a lot deeper into the investigation, into human circadian rhythms and all this other stuff but essentially a warmer tone should help you relax, should help you fall asleep at night. This is especially important on a Samsung display because its got this kind of cool tone to it and I gonna max up the brightness as well. but I've also got this video enhancer enabled as well which is supposed to enhance the image quality of various apps that play back video --I mean, I did a little bit of research here and it-it's hard to know EXACTLY what it's doing essentially you're seeing a bump in the appearance of contrast and a slight bump in saturation as well. It exists in youtube, it'll also function in netflix, google play movies, things like that Now what you'll notice, i am putting side by side window on my pixel XL which I will also have at full brightness. it is very well lit environment so it might be hard to tell But you can see here, this is A more warm tone, it's got a kind of",
    "transcript_keywords": [
        "Galaxy",
        "Samsung Galaxy",
        "kind",
        "display",
        "Samsung display",
        "video",
        "Samsung",
        "lot",
        "put",
        "talking",
        "good",
        "tone",
        "suck",
        "things",
        "blue",
        "back",
        "guys",
        "resolution",
        "audience",
        "night"
    ],
    "transcript_entity_values": [
        "five point eight inch",
        "night",
        "the day",
        "six point two inch",
        "twenty nine sixty",
        "today",
        "first",
        "the Galaxy S8!",
        "google",
        "Jack",
        "youtube",
        "1",
        "One",
        "Galaxy S8",
        "AMOLED",
        "Infinity",
        "the Galaxy S8",
        "XL",
        "Galaxy S8",
        "fourteen forty",
        "S8",
        "a ton",
        "Samsung",
        "half an hour",
        "netflix"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "TIME",
        "DATE",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "TIME",
        "ORG"
    ]
}