{
    "id": "pfEaH0a8T54",
    "title": "Xyloband Hack - Reactivate your Coldplay wristband - Teardown",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-11-19T17:30:16Z",
    "video_url": "https://www.youtube.com/watch?v=pfEaH0a8T54",
    "category": "Howto & Style",
    "tags": [
        "Reactivate Xyloband",
        "Coldplay wristband",
        "Xyloband hack",
        "Make Xyloband work again",
        "How to light up xyloband bracelet",
        "LED bracelet",
        "Soldering tutorial",
        "How to solder",
        "Xyloband",
        "Coldplay bracelet",
        "LED Xyloband bracelet",
        "Hack Xyloband"
    ],
    "views": 304424,
    "likes": 5969,
    "comments_count": 460,
    "description": "After a Coldplay Concert your beautiful wristband becomes a memory filled paperweight instead of the psychedelic accessory it once was. This video will show two different methods of reactivating your Xyloband by bypassing all of the circuits and powering the LED band by itself.  The FULL 'Whats Inside' destruction video is HERE:   AAAA Batteries:  Soldering Iron:  Switches (Bag of 50):   Its a fun little project to help keep these wrist bands out of the trash, and prolong their life.  Its an easy way to learn about electronics or soldering, and can be used as a safety band for Halloween, running at night, or parties.   Where will you use your band?  The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/O0PcX4lZF4I",
        "http://amzn.to/2fa3rzU",
        "http://amzn.to/2fdM97Y",
        "http://amzn.to/2fdMVC9",
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/1R7Ltic",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "In front of me I have something called a Xyloband from a Coldplay concert. These are handed out to millions of people who attend Coldplay concerts or other events. This particular bracelet has been smashed to bits by the WhatsInside YouTube channel, and they gave it to me with the challenge to bring it back to life again. And that's what we are going to do. [Intro] Ill show you what a non cosmetically destroyed bracelet looks like in just a second. But to explain: These bracelets receive a radio frequency during the concert that allow the LED's in the wrist band to flash along with the music. A really cool visual effect when the whole audience is wearing one. But after the concert, without that proprietary radio signal. The bands go dead and never blink again; completely useless, and I imagine most of them get thrown away. Unfortunately. So what I am going to do today, is basically bypass the radio receiver, and the entire circuit board, then hard wire the LED band directly to the power. Its actually a lot easier than it sounds. I'm touching the tip of my hot soldering iron to the base of the red wire. The heat liquefies the solder holding it in place and I can pull the red battery terminal wire out of the circuit bard. LED stands for Light Emitting Diode. And a Diode is a semiconductor that only allows electricity to flow in one direction. So its important that the red wire goes here, and that the batteries are oriented in the right way when you put them back in. Otherwise this simple circuit just wont work. Now for the black wire. This is the fun part where you get to decide what color you want your band to be. For now, you just get to pick one color. But Ill show you how to add multiple colors later in the video, its a bit more complex. I'm going to stick the batteries back in, these are AAAA batteries. Ill link some down in the video description since they aren't a standard size sold in most stores. Now that I have power, you can see that each time I close the circuit on each one of these solder points, a new color appears. The bottom color is Green, Then above that we have red. And finally Blue is third from the bottom. Since we are bypassing the circuit bard entirely, we don't need this little receiver, So I'll remove that along with the two wires that connected it in place. I chose green for this band, Since there is so much solder on the joints already, I don't need to add any of my own solder, I just need to melt the solder that's in place, and stick my wire in it while its liquid. Kinda magical the way that works. It's probably a bad idea to solder live wires... But here we are. After you reassemble the band, it'll just stay lit till the batteries die. Then you have to swap batteries next time you want to use it. Now I'm going to show how I add a switch into our circuit. This time I'll use a bracelet that WhatsInside didn't smash to bits... They aren't always super nice to the things they open up. The process of adding a switch is basically the same. Once Its open, I can cut off the radio receiver to give me more room, then I pull the red and black wires from the board. Ill reattach the red wire to the same point I did on the last bracelet. And then here comes that part that is different. I still get to pick a color. So for this band I am doing blue. But instead of wiring directly to the battery, I am going to add this little tiny switch. These switches were about 5 dollars for pack of 50. Ill link those in the video description. Along with this soldering iron that was only about 8 dollars. Then Ill solder in the tiny switch between the battery terminal and the LED. This interrupts the circuit and ill be able to turn the band on and off whenever I want. Without opening it up to pull out the batteries. I only need two of the pins on this switch. The center one, and then the pin on either side. It doesn't matter which side you pick. Soldering moving wires is always a little bit difficult. If you have a stand with little alligator clips on it to hold things in place this would be a lot easier. If you want access to the rest of the colors, you can either add a switch for each individual one, OR you can get a three or 4- way switch and then solder each color to a different pin on the switch to go between all the colors. Kinda fun. Ill just cut out a small hole in the top of the band and slid the switch through it, and then tacked it in place with some of the gel style superglue. That way the switch can be accessed while the band is screwed shut again. The full destruction of the first bracelet can be found on the WhatsInside YouTube channel, that I will link at the end of this video and in the video description. [Zack] Are you ready to see it? [Lincoln] Yes... You fixed it. [Zack] Yup! I fixed it! [Lincoln] How did you fix this?! Look at it. It completely has all of these dents in it. And my dad cut it with a razor blade and hit it with a hatchet a bunch of times. And you still fixed it. [Zack] I was pretty shocked that it still works... But basically I just bypassed the board and wired the power directly into the band and that was it! [Lincoln] Ah. Ok... No clue what that just ment. But... OK!",
    "transcript_keywords": [
        "called a Xyloband",
        "attend Coldplay concerts",
        "band",
        "switch",
        "Coldplay concert",
        "Ill",
        "wire",
        "solder",
        "Coldplay",
        "circuit",
        "red wire",
        "color",
        "attend Coldplay",
        "Xyloband",
        "LED",
        "red",
        "batteries",
        "wires",
        "bracelet",
        "place"
    ],
    "transcript_entity_values": [
        "Xyloband",
        "Green",
        "Lincoln",
        "Zack]",
        "Coldplay",
        "two",
        "AAAA",
        "about 5 dollars",
        "three",
        "Coldplay",
        "Light Emitting Diode",
        "only about 8 dollars",
        "WhatsInside",
        "millions",
        "first",
        "second",
        "today",
        "third",
        "Zack",
        "50",
        "one"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "WORK_OF_ART",
        "PRODUCT",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL"
    ]
}