{
    "id": "pFlFn3IWQ7w",
    "title": "WORST Tech Fails",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-12-27T17:06:31Z",
    "video_url": "https://www.youtube.com/watch?v=pFlFn3IWQ7w",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 418663,
    "likes": 8255,
    "comments_count": 444,
    "description": "Apple and Samsung have some winners, but they also have some MASSIVE failures.   Steam needs to CHILL:  I Have to Come Clean:  I Got SCAMMED At Five Below...AGAIN:  iOS is Android Now:  Is Gaming Too EXPENSIVE?   Subscribe!  Twitter:  Matt:  Instagram:   Produced by Kinsey Lynaugh  Edited by Aron Goodall:   Chapter Titles ------------------------------- 0:00 Hello and Welcome 0:17 Amazon Fire Phone 1:00 Google Glass 2:00 Samsung Galaxy Note 7 () 3:08 Apple Hockey Puck 4:15 Wii U (wee woo) 5:18 Apple Newton 6:21 Galaxy Home 7:21 Google Nexus Q 8:12 Amazon Dash Buttons 9:35 The Zune (A Tragestify) 10:52 Google Barge 12:37 Steam Machines 13:47 BetaMax (& p*rn) 15:17 All I Want for Xmas is a PSP 16:17 What do you think?",
    "description_links": [
        "https://youtu.be/WgrKtO_L9Os",
        "https://youtu.be/iw-6-SfTZ-Y",
        "https://youtu.be/nCONf7g52dM",
        "https://youtu.be/1jsxuHOoddM",
        "https://youtu.be/mMvFGpQFtkE",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel",
        "https://twitter.com/arongoodall"
    ],
    "transcript": "- Hello, and welcome to \"This is.\" Big tech companies sometimes bring out good products, but sometimes- - The Magic Mouse? - They fail miserably. What we're gonna do is we're gonna look at a big list of big products from big companies that were big fails. Moving on to the first one. - [Austin] The Amazon Fire Phone. (Matt laughs) So, I did a video on the Fire Phone back in 2014 when this came out. They brought this out as an AT&T exclusive for $650, or $200 on contract- - [Matt] Yup. - Which was the same price as like an iPhone. They were trying to make this like a proper, real thing. It had 3D. And not like that BS stuff that you had on the 3DS. It had four cameras on each corner, which were staring at you all the time, live-streaming each angle of your face to Bezos' personal island in the middle of the Bahamas. - These things, it was terrible. And it only sold 35,000 units total. - They probably put like an order in for a hundred thousand, and then they like shredded the rest of them, and it turned into confetti on Jeff Bezos' private grotto, and- - I'll say they went out to the desert and buried them next to all the \"E.T. Atari\" cartridges. Google Glass. Do you ever wish you could just get punched in the face for being a nerd? (Austin laughs) - [Austin] Hey, Glasshole! - Have you ever wanted to cosplay as Vegeta without any of the cool stuff? - It's over- - Nine thousand. - $1,500! Google Glass was good. - Oh, my God! - Think about it. While admittedly a little goofy, but the idea was sound. We are what, eight years on, and we're just getting closer to a \"proper\" version of this shipping with some kind of Apple headset or whatever the case is, but like this was ahead of its time. Now, to be fair, using Google Glass was a fairly basic experience. It did have a camera which ultimately was a bad idea on something that lived on your face as you walk into, oh, I don't know, a bathroom. - Yeah, like, there's a whole lot of legal issues that went around with having a recording device, you know, on your face. It was just like, oh, people see you with this, and they're like, \"Oh, you're recording me!\" Because that happens anyway with a smartphone if you're holding your phone up like this, like, \"Why are you recording me?\" - Yeah. - It looked dumb. It had a small battery. - I thought it looked cool. - Oh my God, you're- - It looked cool. - You're a Glasshole. (Austin laughs) All right. The Samsung Galaxy Note 7. This had the distinction of also doubling as a bomb. (bomb explodes) There was a recall of these, and the recall was turbulent on its own, because these things were blowing up in people's pockets. They started doing a voluntary recall, and then they started to forced patch updates. So, like, oh, it'll only charge to 80%. - They were trying to kill these phones remotely, basically. There were years where every time you got on a plane, they're like, \"Hey, you have a Samsung Galaxy Note 7, you're not allowed-\" - Yep. - And, of course, flight attendants aren't exactly the people who are gonna know, \"Oh, is that a Note 6? Note 7?\" Like, it was such a mess for so long. - This was a pretty big \"note\" in Samsung's history. - If you just think about the scandal and the drama of this happening, how it was all anyone could talk about was Samsung, and yet two, three years later, completely forgotten. It does really say that the internet has a \"short memory.\" - Yeah, they really do. You know what else has a short memory? What are we doing? - Wait, what was that? Oh! The Apple Hockey Puck Mouse. Okay. So, Apple has a- How should I put it? A controversial opinion on input devices. - [Matt] Yeah. - Now, they make the best touch pads in the business for well over a decade. But no one let Jony Ive near a (beep) mouse, please. (Matt laughs) The Magic Mouse is probably what I think most people think of to-date. Because that's the Magic Mouse that they've been selling for like, what? 10 plus years? Like, it's been around forever. - [Matt] It still has the same design flaw that everyone loves to meme. - [Austin] Awful. But the Hockey Puck Mouse was even worse in some ways, because this is back when Apple's like, \"Right click? Who needs a right click? You just need click.\" Also, how about your hand being shaped like this? Is this just the way you're just- Hmm. Hmm, yes, yes. Activate Mr. Steve Jobs. I will say, though, the aesthetic of this is really on point, and honestly, I'm gonna say this on camera, so it's immortalized forever. I want to take an old iMac and load up modern specs in it and use it. Quinn, if you're watching this, let's put an M1 or M2 MacBook motherboard and battery and stuff in one of the old iBooks. Or let's take the specs of a Mac Mini and put it in an iMac G3. Let's do it. The Wii U! (Austin imitates siren sound) That's the sound of the ambulance coming because this thing was dead very quickly. In a lot of ways, I think the Wii U was the prototype for the Switch, because they knew that they wanted a tablety thing. If you think about how far we went from the Wii U to five years later with the Switch, the fact that you needed the console and the huge gamepad. Five years later, the console was gone, the gamepad was a fraction of the size, and more powerful. Goes to say a lot about how the Wii U was a little too early for its time. - Um. Actually- - Okay. - You like to defend Nintendo a lot. I don't. So many things that Nintendo does, it would say, \"Here's our gimmick. Two, three things would take advantage of it. And then nothing would ever take advantage of it ever again.\" - Well, you could play games on the gamepad, so it would wirelessly stream- - As long as you were 10 feet away from it. - That's true. That is true. - It's not like you could take it to the other room. They love to put out these gimmicks. - [Austin] Yeah. - And then, again, no one knew that this was a new system. Fun fact about the Wii U: did you know what the \"U\" stood for \"useless\"? - [Austin] Okay. The Apple Newton. - [Matt] Wait, was this a failure? - Yeah. Yeah. - Really? - Yeah. Look, the Apple Newton had good things to it. This was essentially the world's first PDA. So it had a lot of stuff. It had handwriting recognition, which, well, admittedly, not good, but, you know, 30 years ago tech actually was decent. And on top of that, it was a very, very reasonable price. - Oh. - Want to know how much it was, Matt? $900, which is almost $1,900 in 2022 money. It was kind of like the first iPad in a lot of ways, right? Like, it had a black and white screen, it had a resistive touch screen with the stylus that came with it and everything. - This was no Steve Jobs, right? - Yeah. So this was- - This was the dark ages? - I think, and correct me if I'm wrong in the comments, but if I recall correctly, when Steve Jobs came back to Apple, yeah, he was like, \"What are you doing? Kill this immediately.\" Which, fair. - I liked it. I was a PDA boy. - Public Display of Affection. (Austin laughs) Oh, it's so public. What a great reason to subscribe for PDAs with your pals, Austin and Matt. (Austin laughs) - [Matt] The Galaxy Home. - [Austin] No, no, no, no, no, no, no. Do not call it the Galaxy Home. The Bixby speaker. - Do you wish you had a Namekian spaceship from \"Dragon Ball Z\" telling you what the weather is? Well, we got the product for you. - Is it as good as Siri? - [Matt] No. - How about Google? Is it as good as Google? - Not even close. - How about Cortana? Is it as good as Cortana? - Nope. - Is it Bixby? - It is Bixby. - Okay, cool. This is one of those famous things that was announced to a lot of fanfare, and quite literally never showed up. I remember Marquez would tweet every time there's a Samsung event. Did the Bixby speaker get announced? Nope. - It just kept getting delayed, delayed, delayed. - No one likes Bixby. No one likes Bixby. - But also, this is just ugly. - [Austin] We did the video trying to buy all the Samsung products, and we tried to use Bixby for everything together. It was not good. - I think it's because all the Bixby speakers just kind of skittered away. - They're just a bunch of little guys that just walked away. - Every time you turn on the lights really fast, they skitter away. - [Austin] Yeah, it checks out. - Ah, this was dumb. Moving on. - [Austin] The Nexus Q. - [Matt] Okay. - [Austin] I'm excited about this one. - I'm with you on this one. I actually love this thing. - This was great. Okay, so for context, this was released in 2012. This was where every time you went to Google I/O, you were coming home with something. Right? And they gave everyone who attended a free Nexus Q. Now, what, you might ask, is a Nexus Q? Well, it was a WIFI speaker. I think it actually had some video out, as well. Before it actually shipped, Google were like, \"What the hell are we doing?\" They canceled the project. However, everyone who had pre-ordered the Nexus Q got theirs for free. I know that this was a thumbnail for one of my big tech fail videos from like eight, nine years ago. But I don't think I actually had ever gotten my hands on one, 'cause I wasn't cool enough to go to Google I/O. - For the record, it did not sound good. - It was back when Google were doing all kinds of weird Nexus stuff. Thankfully, they got their act together, and have since never canceled a project, or fumbled a product ever again. - Never ever. Amazon Dash Buttons. - [Austin] We have these. - Technically, they would cost you $5 to get 'em. However, when you got 'em, you got a $5 credit on your Amazon account. So it's free. You do it through like the Amazon app, but it was WIFI. And so essentially what it was, \"Oh, I'm out of laundry detergent.\" (Austin imitates button press sound) Press a button. But the problem is, one, if you just kept pressing the button, it would actually start a queue. - Oh, like for their monthly delivery or whatever? - Yeah. Yeah. I know my sister, when she first came over and was like, \"Oh, what is this?\" (machine beeping) And then I look at my Amazon cart, it's like, you know, upcoming purchases like nine- - $700 of Tide detergent coming your way. - [Matt] And then these were ruled illegal in Germany, because- (Austin laughs) - [Austin] What? - I don't know if you've ever seen when there's like a new version of a product on Amazon or whatever, but like you kind of had to like relink it to a new version, whatever, because you might be thinking like, \"Oh, I'm buying like a $20 thing of Tide.\" - Nope. - But this seller is now doing it for $40- - And you just bought $40 worth of Tide. - Where it's like, when you go on the actual website, it's like, \"Oh, from these sellers, here's the cheapest price.\" Like, that was a big problem with these things. I really liked these. But like, yeah, there was a lot of flaws to them, and now they are completely not useful at all. - Tide, if you're watching, hit us up. Procter & Gamble. We're a big fan of all your many wonderful products, and would love- - You make delicious products. (Kinsey laughing) - [Austin] The Zune! - [Matt] No! - [Austin] The Zune! - [Matt] No. Okay. - [Austin] Are you too cool for an iPod? - This is one of those products, they're like, there's no reason that this failed, other than people's perception of the product. - [Austin] Wait, hold on, hold on, hold on. Please elaborate. You think this should have been a success? - Yeah. - What? It came out five years after the iPod. - Cool. - One year before the iPhone, which, obviously, was the biggest- - There was a lot of people who wanted to keep their phone and music player separate, because, one, again, remember the iPhone didn't have like, when the iPhone came out, it didn't have great apps- - Four and eight gigs of storage. - Right? Sure. But, like, this didn't even compete with other MP3 players. It was like too premium. - It was expensive. - Yeah. So it couldn't compete with the smaller, like, SanDisk ones or like- - Yeah. - [Matt] This was a really good product. You're right, it was too late to compete with the iPod. But then too premium to compete with the lower-end market. - It's classic Microsoft, right? Like, I feel like it took way long to come to market. - It was a really good device. - Like this was a good idea. Right? Microsoft had a lot of good ideas. And while we're just talking about Zune, generally, the Zune HD, I will maintain, still had some of the nicest hardware of any of these things. OLED screen, it was so good. - This is a tragedy- A tragedy that this was- - A tragesty? It's a good word. - Tra- Tragidifee. (Matt laughs) - [Austin] Kinsey, say \"cap\" right now. Say \"cap\" right now. Google Barge. For reference, our wonderful producer, Kinsey, who puts together all of these wonderful things- - You could just say producer- (man screaming) - Can you please take this one away? Because I have no idea what the hell you're talking about. - [Kinsey] In 2013, Google launched some barges in various ports in the United States. Everyone at that time was like, \"Ooh, what could these barges be? Is it gonna be like a Google Glass store? Is it gonna be a data center?\" - Was this just Larry and Sergey just like partying on barges and just writing it off as a Google expense? - So there was some conspiracy theories. These were like unhackable data centers, because they were like, you know, they weren't connected to the mainland. There was some that these were prisons. Well, 'cause like, Google's really secretive about these, and so they basically said they were exploring using the San Francisco barge as an interactive space for people to learn about new technology. The conspiracy theory was if they wanted to do their \"Black Mirror\" shit, they could put people on the barge, and go out to international waters, and basically just like, yeah- - Can you \"Squid Games\" if you're in international waters? - Yes. Technically. We don't really know what these were. And then they just disappeared. - Well, just like our thoughts, dreams and data have gone out to sea, I think we have to say goodbye to the Google Barge, because they are sadly no longer with us, or more likely, too well camouflaged for us to notice. And all the bad Googlers- - They're trying to make their own sealand. If Google put this out in international waters, and they had their own little island, they had \"Google Nation.\" They didn't have to comply with any type of data laws from- Oh. - It's a good idea. You should pitch that. They should do that. - Google, hit me up. - [Austin] Steam Machines! - [Matt] Oh my- Okay. I kind of forgot that these were a thing. - [Austin] I didn't. Here's the thing. This was really founded because of Windows 8. Windows 8 was when Microsoft really started putting emphasis on the app store. And Gabon & Crew got a little nervous, 'cause their whole business model was taken 30% of those sweet Steam games that you were buying, and when you couldn't take advantage of that, you were then forced to, \"Oh, oh no, Steam. We can't buy our games on Steam. We have to actually buy them from, you know, Microsoft.\" They were terrified of this. So instead, they're like, \"Middle finger Microsoft. Goodbye. We are now going to enable SteamOS to take over the world.\" If you wanted to build a game PC, you could license Windows and pay a hundred dollars a license, or whatever. Or you could get it for free. And in fact, Valve would help you with marketing. They were relatively underpowered. They were also trying to be relatively cheap to compete with like the PS4 and the Xbox One. - I don't really remember too many of the actual onboard consoles. - Because no one bought them. - Yeah. I mean, I guess that's why that's on this list of big tech fails. - But, if the Steam Machines didn't exist, SteamOS wouldn't exist, and the Steam Deck probably would've never, ever crawled out of the primordial ooze to surprise and delight gamers who have Big Chungus hands. - [Matt] Ah, Sony Betamax. - [Austin] What? - Despite Sony marketing that this was the superior format, VHS and VCRs were largely more affordable, more popular. And I, you know what, I gotta bring this out. Do you know why VHS ultimately won? - Yeah, I watched \"The Naked Director.\" - Yeah. Pornography. Whatever format is cheaper to put out, pornography's gonna back it, and that's gonna be the one that people buy, because everyone's gotta have their pornography. - Can you just stop saying that word so many times? - It's a fun word to say. - It is, but you said it enough times- - It's like the puh, puh, puh. - Photography. Doesn't quite have the same ring to it. - No, cause it's a soft P there, now this one's a hard P. Pornography. - Okay, we can just stop with the soft and hard Ps. That's a little over the top. - Don't let your kids watch it! - It's actually funny, though, 'cause Betamax was successful in the actual, like, pro-video area. So we- - The nerds? - Yeah. - Who cares about what nerds think? - Well, you recorded on Betamax. This, you know, this is early digital video. - So, film your Betamax. - Yeah, and then- - Then you water down the VHS. - Distribute it. - Ugh, disgusting. (tape screeches) Aaron, definitely just cut down as if we didn't have a 15 minute conversation about the relative benefits of Betamax, and why, ultimately, that's the reason why you need to subscribe and ring-a-ling the ding-a-ling button. And importantly, tell your weird Uncle Joe that Betamax was, in fact, the right call. Link him to this video. He'll be really pleased, and you can ask him to subscribe, too. Okay. Honorable mention time. Don't go anywhere. - Oh, we have an honorable mention! All I want for Xmas is a PSP? - [Austin] What? - In 2007, Sony hired an ad firm called \"Zipatoni.\" - [Austin] No, say \"cap\" right now. Say \"cap\" right now. - [Matt] Zipatoni. And they made a fake blog that was alliwantforxmasisapsp.com. - No one would ever pick that domain! - And then they recorded this video of this 30-year-old man pretending to be 12, and rapping for a PSP. - Do you have that video, can we play it? - I do. I have it linked here. - Oh, my God. - This is why we don't have PSPs anymore. - This is the reason. (hip-hop music) - Sony paid for this. - Not only did they pay for it, some Sony executive goes, \"Yup.\" (Austin laughs) Of all the fails that we've seen so far, this honorable mention is the biggest. - Oh God, stop! What are you doing to that ladder? Why is Pete Davidson trying to break dance for me right now? - This is- - We've gone completely off the rails today. If you too would like a great deal on a free annual subscription to \"This Is,\" all you have to do is hit that subscribe button. It's free, and it is actually not annual. It's permanent. It will be there forever, until YouTube decides to unsubscribe you. But you should ring-a-ling the ding-a-ling button, so you're always kept up the date with the latest and greatest of alliwantforxmasisapsp.com news. And until next time, Matt, let's make some more bad decisions from the year 2005. You should really call your kids back, though. - Ah. (mellow music)",
    "transcript_keywords": [
        "Google",
        "Yeah",
        "Google Glass",
        "good",
        "Samsung Galaxy Note",
        "Bixby",
        "Big",
        "things",
        "Apple",
        "time",
        "lot",
        "years",
        "Samsung",
        "Magic Mouse",
        "thing",
        "Google Barge",
        "people",
        "Mouse",
        "Hockey Puck Mouse",
        "put"
    ],
    "transcript_entity_values": [
        "2013",
        "Vegeta",
        "the Fire Phone",
        "Aaron",
        "The Samsung Galaxy Note 7",
        "Austin] Kinsey",
        "three",
        "650",
        "the Zune HD",
        "30%",
        "a hundred dollars",
        "Gabon & Crew",
        "Zipatoni",
        "Bezos",
        "the Magic Mouse",
        "Bixby",
        "Steve Jobs",
        "Nintendo",
        "Two",
        "Black Mirror",
        "Big Chungus",
        "YouTube",
        "Glasshole",
        "Microsoft",
        "80%",
        "the Steam Deck",
        "10 feet",
        "the Galaxy Home",
        "Google Glass",
        "35,000",
        "M1",
        "Five years later",
        "Windows 8",
        "iMac",
        "Marquez",
        "Germany",
        "Bixby",
        "The Magic Mouse",
        "two,",
        "Google",
        "Jony",
        "Amazon Dash Buttons",
        "Austin] Steam Machines!",
        "15 minute",
        "Matt",
        "nine years ago",
        "iPad",
        "the Google Barge",
        "Puck Mouse",
        "30-year-old",
        "Austin",
        "Samsung",
        "the Wii U",
        "Procter & Gamble",
        "Sony Betamax",
        "Sergey",
        "2014",
        "Betamax",
        "12",
        "The Naked Director",
        "eight years",
        "700",
        "Dragon Ball Z",
        "Google Glass",
        "first",
        "three years later",
        "Hockey Puck Mouse",
        "Google Barge",
        "The Magic Mouse",
        "2012",
        "SanDisk",
        "AT&T",
        "5",
        "Kinsey",
        "Quinn",
        "Glasshole",
        "Windows",
        "20",
        "Bahamas",
        "Betamax",
        "40-",
        "the Apple Newton",
        "Uncle Joe",
        "annual",
        "Nexus",
        "a hundred thousand",
        "the year 2005",
        "200",
        "Namekian",
        "Zune",
        "Matt] Zipatoni",
        "M2 MacBook",
        "San Francisco",
        "iBooks",
        "Pete Davidson",
        "1,500",
        "The Apple Hockey",
        "almost $1,900",
        "10 plus years",
        "one",
        "five years",
        "Apple",
        "PS4",
        "four",
        "Bixby",
        "Xmas",
        "today",
        "Tide",
        "eight",
        "five years later",
        "30 years ago",
        "VHS",
        "the Steam Machines",
        "monthly",
        "Cortana",
        "the United States",
        "Siri",
        "Larry",
        "Amazon",
        "iMac G3",
        "40",
        "iPod",
        "The Apple Newton",
        "Google Nation",
        "Jeff Bezos'",
        "Sony",
        "Atari",
        "iPhone",
        "2007",
        "Valve",
        "900",
        "Switch",
        "2022"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "FAC",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERCENT",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "FAC",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "MONEY",
        "WORK_OF_ART",
        "PERSON",
        "ORDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "GPE",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "NORP",
        "ORG",
        "PERSON",
        "PRODUCT",
        "GPE",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "DATE"
    ]
}