{
    "id": "pfM-JUoaOHI",
    "title": "Stop calling things pro - Samsung Galaxy Watch5 & Watch5 Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-09-17T20:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=pfM-JUoaOHI",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "Watch",
        "Galaxy watch",
        "wearable",
        "Android"
    ],
    "views": 596892,
    "likes": 18318,
    "comments_count": 1088,
    "description": "Thanks to Mine for sponsoring this video! Discover where your data is, and take it back at   Jake used to use a Galaxy Watch but switched over to the Apple Watch. Will the new Galaxy Watch 5 win him back, or will he stick with Apple?  Buy Galaxy Watch 5:  Buy Galaxy Watch 5 Pro:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 0:44 Unboxing 2:05 Putting the watch on 3:23 Pairing the watch 4:28 Figured out the clasp 5:50 Sponsor- Mine 6:26 Unboxing #2 Ft David 7:31 Using the watch 11:45 Outro",
    "description_links": [
        "https://bit.ly/saymine-ShortCircuit",
        "https://lmg.gg/tbTJ1",
        "https://lmg.gg/UwtTf",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Oh, wow! New Galaxy Watches. No way! Wait, wait, these look like the same ones as before. What the heck man? That's right guys. The Galaxy Watch5 and 5 Pro are here but they look pretty similar to the previous ones. It's kind of hampering my excitement here. I kind of feel like a lot of this is gonna be the same but we're gonna unbox them nonetheless, and hopefully there is at least some cool things. Now I will say since the last time I looked at any sort of Watch, I have switched. Previously I was using a Galaxy Watch Active2 with an Android phone. Then I switched to the Watch4 after we did the short circuit, I liked it a lot. And since then I've actually switched to an Apple Watch. So I do have a little bit more perspective on the Apple side, which is good this time around. Let's start with the Pro then. This is the most exciting definitely very original naming scheme, never heard Pro in a product before. Well, this is kind of nice presentation. I like that the band is already installed. Well, that's different! (laughing) What kind of clasp is that? This is the Pro model. So it's gonna be a little bit beefier. The exterior looks very, very, very similar to a Galaxy Watch4. I do notice that there's like a bit of a like a lip up. The lip up is actually kind of nice man. After daily driving the Apple Watch for a few months now I've definitely noticed I've gotten a lot of scratches around the edges, just from being a little bit clumsy. You knock your arm on a door or a frame or something like that, but this should prevent that. Wow. Okay. So this is titanium. It's still like coated though. I imagine if you, if you dinged it against something it would probably still scratch but it does feel very premium. I don't know about feeling Pro. Yep the bands come off in the same manner as the previous ones, there's a little pin on either side and a release. Right there, you see that? And this does work with standard size 20 millimeter bands. Maybe it will work with Galaxy Watch4 things but this is the actual band and I'm having problems getting it on, so. (laughs) What the hell? The most comfortable Watch band I found for the Apple Watch Series7 is this like pre sized. It's almost like our multi knit sweaters which you can get at lttstore.com. I might just give up on this at some point. Yay. There we go. Okay. Let's back on. Let's put the damn thing on. What is this clasp? It's weird. Have you seen a clasp like this before? It doesn't look like it's gonna be terribly comfortable. I'm gonna be honest. Somebody at Samsung right now is watching this like, what the hell is this guy doing? Okay, there we go. It's like on very loosely. There's a, a lock for the clasp underneath. So you kind of have to get it in and then close. But the clasp is on the inside. Oh God, this would not be my go to, (laughing) I can't even get it off now. (laughing) While it's turning on let's look at the buttons on the outside. These look the same as the Galaxy Watch4. So you got a button here that would be your power button. And then I believe this is like the action button. Man, I can't quite remember because it's been a few months since I used mine last, before I sold it. So I guess we'll find out when it turns on. On the back of course is just the usual myriad of sensors. I believe they're all the same as before. I don't know if there's any additional sensors but they do have a list of all of the things that we'll be able to do. Mind you, they're not all available depending on region you're in. Which is just the typical wearable crap, They've gotta get, you know, Health Canada and whatever the American health America, to approve it. The FDA. Okay. All the sensors are the same. Yeah. Oh, and that looks the same. So this is gonna be running the same OS as before. It's Android WearOS 3.5 and I believe it's called 1 UI Watch 4.5. I guess maybe they put their own skin on it. Get started in the Galaxy wearable app on your phone. Oh wow. I didn't even realize, it doesn't have a rotating bezel. Ugh. This is awful. This clasp is so thick. Like look at that. I just went to type on my keyboard and it's like, it literally takes your arm like almost a centimeter off of whatever you're resting it on. And it's hard. It just digs into your arm. This is a really bad design. That's why I like this Apple Watch one, there's no clasp it just is fitted to your wrist and stretchies wow. This thing has got a huge battery. On the Pro model, you're almost looking at a 600 milliamp power battery. Compared to 284 on the smaller non-Pro and 410 on the bigger non-Pro. Man they didn't upgrade a lot. So the Ram and the storage is the same as the Galaxy Watch4. It does have Sapphire glass, so that's gonna be a bit of an upgrade. The only other real change I can see is these are Bluetooth 5.2 rather than 5.0 on the Galaxy Watch4. They have the same kind of military durability rating. The same IP rating of 68. (papers fluttering) Okay. We got some propaganda, quick start guide. Wow. This is like a pocket Bible, a Bible for this. Oh, look, it tells you how to use the clasp. Holy shit, I used it wrong. Maybe that's why I can't get it off my wrist. (laughing) Oh wow. Look at that. Like magic watch people that are watching this, ha ha ha. Were definitely like this guy's an idiot. Okay. This makes way more sense. So it's a magnetic clasp and that's how it comes apart and comes off your wrist. So this would just be a one time adjustment. That makes a lot more sense. It's still uncomfortable but it's a little more adjustable than I expected. Let's try that. I will say it's a very strong magnet. Considering that I didn't accidentally pull it off earlier. That's definitely fitting a little bit better, still uncomfortable though. Cool. Charger looks similar, but it's a little bit nicer. You see it's like anodized on the bottom. It doesn't really look like exactly the same material. I will say that my Galaxy Watch4 definitely handled sleep and like being taken off way better than my Apple Watch. This one usually if I lay it down on a table it just thinks it's still on my wrist and will just stay on. The Galaxy Watch if I took it off, it'd be good to go. Now, apparently this one will do 80 hours on a charge. I tend to kind of believe that it's definitely up there. The charging is gonna be 10 watt rather than 5 watt in fast charging mode. I imagine you might need a specific brick to do that. It is Probably USBPD. And then the standard charger which is only gonna be 5 watts, is just a type a USB that you can plug into any, you know, power brick you've got laying around. Hey, look, it's ready. Not as ready as I am to tell you about Today's sponsor Mine. Mine is a smart data assistant that helps you discover where your data is and assists you in asking services you no longer use to delete your information. Even when you delete an app from your phone or deactivate, one of your social accounts they still hold onto your personal data. And with how many breaches are occurring these days you may not want these companies holding that data. We tested one of our emails and over 300 companies were holding data related to that email including many that held financial information. Mine helps you send an official data deletion request through your inbox. So the company can delete the personal data that they have stored. You can sign up at saymine.com at the link down below and take control of your data. Kamoot bike trails. Okay. I'm just gonna go... Yeah Google Assistant definitely want that. I would not wanna use Bixby. Wait, Google camera, oh, you can probably use it as a trigger. Okay it's not done. Let's open this one too. Cool. Same deal. We got a watch in here. This is the much better band. I prefer this one. This clasp is a lot smaller and it's gonna feel a lot better under your arm. This is the 40 millimeter variant, so it's gonna be a little bit smaller. Man, this could very easily be a Galaxy Watch4. (laughing) Yeah. Okay. I'll try to put no, no. (laughing) It's not happening. It's the small one. I don't know doesn't fit on my wrist. - Well, I like the feel of it. Yeah, it fits. - Okay. I want you to try this one. (laughing) I know it's great, right? This is basically the experience we had earlier. Just more barbaric. - How do you do this? - I, you, I think you just guesstimate and then put it on the wrist. - Yeah. I hate that. 'Cuz then it stretches again. - Might be too big. Now put your arm down on something. Isn't that awful? - That hurts. - Yeah. - I think the CIA should utilize this as a torture technique. - This style of band is the way to go for sure. Swipe up to go back to the watch face. This feels just like a Watch4. It wraps up from the bottom edge. Yep. Swipe right for notifications, tap to open. Why is there not like a skip button? Hi, I've owned this watch before, please you don't have to tell me everything about it. How do I have a missed call? Is this phone have a SIM card in it? It has a SIM card in it. Who's phone is this? Okay. Well anyways. Yeah, I mean the UI is the same as before. So that's interesting. Let's try to measure my heart rate and do it at the same time. Nice. Can I tell this to measure again or it is measuring, it's actively measuring. 76, Oh it's going up 79. Why am I getting stressed out all of a sudden? Hm? 79 77. Okay. They're a little bit different. That seems good within margin of error. (laughing) Wow. This app is a 2.5. (laughing) And that's not even on the Playstore, this like Samsung's own store. You have to connect to a mobile network to activate Samsung's health monitor features. What? I guess it's like a region locking thing, but oh, that's so stupid. I will say the magnet in these still not that impressive. I wouldn't say it was like a huge problem with my Galaxy Watch4, but I've definitely put it on the charger and it's not lined up and it didn't charge. God, this is a lot of steps. I just want to do an electrocardiogram, is that too much to ask? Don't use an ECG on your watch to tell if you had a heart attack, go to the hospital. All set recording ECG. Okay, cool, let's do it. Never was much for the digital dial. It just seems slower than just swiping a bunch. Rest finger lightly on home button, app never looks for heart attack. I have a sinus rhythm. This ECG does not show signs of atrial fibrillation. That's good. Here's my heart beat pattern, I guess. I don't know what to do with this information but apparently I don't have at-rial fi-bri-llation, atrial fibrillation, I hope that's a good thing. Is it charging. Oh see, like it's gotta be right in the middle, if I bump it a little bit, it like stops charging. You can customize the watch faces, you just hold and then you can set them. You can also go on your phone to adjust them and you can download different ones, whatever you want. But the OS is basically the same on either watch, rather it is the same. There are a few cool new features on this one. If you're into hiking, I believe you can actually map two specific points if you set up a hike on a map. I'm assuming you probably have to do that on your phone ahead of time. And if you go off the trail, it'll be like, yo dog here's directions how to get back on the trail or whatever your pre-planned route was. The Pro also has a little bit expanded features for workouts. If you're doing an intense cardio workout supposedly after it will track your heart rate and how fast it comes down. And then we will guide you how much water you should drink to, to stay hydrated. I imagine you probably have to fill in your body weight and all that different information in this app. That they definitely will not sell to anyone or use to advertise to you. I guarantee. It's a short circuit guarantee. And both of the Watches haven't expanded sleep tracking UI that has been, I guess, reworked. I don't know who is crazy enough to wear a watch while they sleep. Apparently Jake Bell, I for one definitely do not like doing that. And my Apple Watch would die if I did that. (laughing) Man, it's hard to say, if you should buy one if you already have a Watch4, I really don't think this is gonna be a big upgrade. Especially considering how hard it is to resell devices like this and how limited the value is. It's almost kind of like manufactured e-waste. Based on how much money you can actually get for used wearables. I will say if you are looking for a new watch and you don't already have one or maybe have one of the previous generations like an Active2, the new UI is really nice. The titanium is nice. The big battery is nice if you're out on the go. And I guess if you hike a lot that could be a pretty cool feature. I don't know how well it works though. So you'll have to check out reviews to see that. The Watch5 non-Pro starts at 279.99. If you option for LTE or a bigger face, obviously that's gonna be more. The Watch5 Pro starts at 449.99. And for reference the Apple Watch Series7 starts at 399. If you were to go with the titanium Apple Watch I think it's gonna be far more expensive than this. So you are getting titanium for a reasonable price. Which is cool, I guess. Can't scratch it with my fingernails or anything like that. So thanks for watching guys, if you like this video maybe check out the Galaxy Watch4 unboxing if you're looking to buy a new one. A used Galaxy Watch4 probably a better value proposition than one of these. If you want the latest and greatest, you can check these out in the link down below. Get subscribed, like. I will see you in probably a few months when I do one of these again, goodbye.",
    "transcript_keywords": [
        "Apple Watch",
        "Watch",
        "Galaxy",
        "Galaxy Watch",
        "Apple",
        "Pro",
        "bit",
        "clasp",
        "kind",
        "titanium Apple Watch",
        "lot",
        "data",
        "wow",
        "Yeah",
        "guess",
        "phone",
        "cool",
        "wrist",
        "man",
        "band"
    ],
    "transcript_entity_values": [
        "68",
        "Sapphire",
        "5 watt",
        "LTE",
        "Apple Watch",
        "the Apple Watch",
        "FDA",
        "the 40 millimeter",
        "449.99",
        "America",
        "284",
        "10 watt",
        "79",
        "a few months",
        "5.0",
        "one",
        "USB",
        "399",
        "CIA",
        "Google",
        "IP",
        "Today",
        "Bixby",
        "79 77",
        "American",
        "Jake Bell",
        "UI Watch",
        "Health Canada",
        "Samsung",
        "600 milliamp",
        "non-Pro",
        "410",
        "4.5",
        "ECG",
        "300",
        "daily",
        "Galaxy",
        "1",
        "these days",
        "UI",
        "Galaxy",
        "2.5",
        "Watches",
        "two",
        "20 millimeter",
        "Ram",
        "Android",
        "5 watts",
        "76",
        "The Galaxy",
        "New Galaxy Watches",
        "ECG",
        "ECG",
        "279.99",
        "Galaxy Watch",
        "The Galaxy Watch",
        "Playstore",
        "Bible",
        "80 hours",
        "Apple",
        "5",
        "the Apple Watch Series7"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "NORP",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}