{
    "id": "pFYGZmdXF6s",
    "title": "Apple removed the notch!?",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-04-30T03:39:09Z",
    "video_url": "https://www.youtube.com/watch?v=pFYGZmdXF6s",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Apple",
        "iPhone",
        "iphone notch",
        "iphone 14",
        "iphone 14 pro",
        "iphone 14 max",
        "iphone 14 pro max",
        "iphone 2022",
        "apple iphone notch",
        "camera notch",
        "camera cutout",
        "all-screen",
        "all-screen iphone"
    ],
    "views": 606432,
    "likes": 31482,
    "comments_count": 859,
    "description": "Join us in War Thunder for FREE at  and get an exclusive bonus using our link - thanks for supporting the channel!   LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 accurate description, robot 0:10 iPhone 14 not-a-notch 1:21 Good GPU news 2:32 Epic vs Google again 3:42 War Thunder 4:23 QUICK BITS 4:30 Snap Pixy drone 4:52 Warzone Ricochet  5:14 Central African Republic adopts Bitcoin 5:45 Synthetic control arms 6:26 Japanese rail system gundam  FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://playwt.link/ltttl",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/f2XpR",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- You might look at me and simply see a man just reading tech news. If so, well done. That is accurate. - [Man] Yes, got it! (laughs) - Apple is finally getting rid of that horrendous design decision that forced the rest of the industry to copy against our will, the iPhone's camera notch. - [Man] Why'd you make this? Why? - That's right. A long last. We're finally gonna see an all-screen iPhone 14 without any, sorry, what's that? Oh, they're replacing the notch with two punch hole cutouts that take up even more room on the display? (man laughing) Perfect, that's, wow, courageous. (man laughing) To make things worse, a leak shows that the iPhone 14 and 14 Max will actually still have the notch with the new cutouts available on the pro models. (everybody laughing) On the plus side, they'll probably have M1 chips or something, 'cause that's just so easy for them. I can only assume Apple isn't scared of any backlash because according to the company's Q2 earning reports they're making more money than ever, with huge boosts in services revenue and sales of M1 Macs. Meanwhile, those hoping for an ARM-based laptop not made by Apple will reportedly be waiting until June, 2023. - Wow! - Which is Qualcomm's estimated release date for its PC chips. So, strap in for more weird Apple design decisions because you're all gonna buy their stuff anyway, you people. (man sighs) Stock shortages over the past years have made it hard for PC enthusiasts, but we may be on the precipice of a grand graphics card Renaissance. - Oh! - Some real fancy fan designs coming up, stone calms, archways everywhere, Vitruvian Man! (James laughing) - [Man] That's culture. - Because a leak has seemly confirmed that AMD's next-gen GPUs and the heavily anticipated Phoenix APU will indeed be built with the new RDNA 3 architecture, which is expected to enable a quantum leap forward in performance. A quantum is small. - Oh. - Quantum leaps - [Man] No, \"Quantum Of Solace\". - So small, they big? (man chuckles) \"Ant-Man\" In response. It looks like NVIDIA have changed from developing their next-gen Lovelace GPUs as simple refreshers of their existing and pure lineup to a full-on, (chuckles) a new, a full-on new architecture, which would again mean higher performance graphics cards for all of us. And let's not forget about Intel. CEO Pat Gelsinger confirmed in the company's earnings call that they definitely, certainly, for sure are going to release their desktop graphics cards in Q2, probably the last day though. So, there's no doubt (man chuckles) in his mind. This is unquestionably not a hilarious prank they've been playing for four years, no way Jos. (man faintly speaking) - Would be a really good prank. - No way Jos! - Ah! (James chuckles) Sorry. - And Epic Games has picked another epic fight with Google before their Fortnite trial has even begun. But this time, it's about Epic's latest acquisition, Bandcamp. which I've been a member of many times, predictably on Twitter. (man faintly speaks) You see, Bandcamp has always used their own billing system instead of Google Play Store billing. But Google recently decided it was actually going to enforce its policy requiring Android apps to use Google's billing system, which Epic thinks isn't fair, obviously, 'cause they're epic. This is Open App Market, die-hard Tim Sweeney we're talking here. The man loves picking fights. Epic filed an injunction to get Bandcamp out of paying a 10% cut to Google. That's a lower rate than the standard of 30%, but it would apparently force Epic to change Bandcamp's business model, which currently sees artists receiving a whopping 82% of the profits from this sale of their music, - Whoa! - [James] which is way (chuckles) too much. What do they do? They just sit around all day? (speaks in gibberish) (man laughing) I'm having fun. - [Man] I live in my parents' basement, (James scoffs) creating things. - We all live in our parents' basements. - [Man] That's true. - What about all the hard work Google is doing to get their music out there? Programming is hard. Playing piano, it's fun. Google employers are walking around, handing out mixtapes. they want you to sit there, trying so hard. (James chuckles) - Oi, Riley! (man laughing) - Now, it's time for Quick Bits brought to you by \"War Thunder\", the free to play online military vehicle combat game available on a variety of platforms with crossplay, pilot and incredible arsenal of more than 2,000 historically accurate playable tanks, aircraft and ships from the 1910s to vehicles still in service today, each one positively sparkling with authenticity and detail. (smooches) Ah. In \"War Thunder\", you can compete in massive combined arms battles on over 100 major battlefields from World War II to modern environments. So, head to the link below and start playing \"War Thunder\" for free and you get a free bonus premium vehicle for signing up. Ah! - Quick Bits are one of those lenses we can look through to see the world. I wouldn't recommend it. It gets real trippy. - Ah, (indistinct) - Snap Inc. has revealed its first selfie drone, a $230 palm-size square yellow pancake thingy called Pixy. The drone can float, orbit, or follow you, basically my dating strategy, without having to use a controller. In fact, you're unable to control it at all. Pixy is its own sentient being and will take selfies how it wants to, whether or not you like... Is it still a selfie? Active Vision has revealed the latest perk of Call of Duty Warzone's RICOCHET Anti-Cheat system, the ability to make regular players invisible to cheaters. The best part is the effect only activates once a cheater starts shooting at someone which I hope will lead them to stop the shooting and just observe, watch what your actions are doing. It's not good. Don't cheat. Bobby Kotick is watching. - [Man] probably be cheering them on actually. - You don't even know I'm tea bagging you. The Central African Republic, And if you're rusted on your geography, that's the actual name of the country, has become the second nation in the world to officially accept Bitcoin as legal tender, following El Salvador, earlier last year. Was that last year? I don't know. The move hasn't proved to be especially popular one in El Salvador after multiple scandals over its implementation. So, hopefully, the CAR has a better time with it, instead of promising magical volcano-powered crypto cities. This will be tree-powered. (man laughing) Is that where rubber comes from? I'm ignorant. - [Man] We all want the volcano cities. We all know it. - In science news, a company called AppliedVR, which is testing a virtual reality system for treating back pain, I'm listening as an old man, is partnering with healthcare data company, Komodo Health, to conduct trials using artificial control groups. That means instead of recruiting volunteers from college to a trial who then don't receive experimental treatment, - Gotcha. - AppliedVR's trial data will be compared with existing databases of anonymized patient health records, which could save time and resources. Faster science would be a good thing. Although the new method is still being evaluated. Wait, how does VR treat back pain? It's like look up in the sky, (man laughing) stay there. - Ahk! - Now, look to the right. (chuckles) - [Man] There it is. - [James] And Japan has done a Japan, by using a heavy-duty humanoid robot, operated by a regular flushy worker to repair rail systems. That's everything Japanese in one sentence. The West Japan Rail Company says the mech allows workers to manipulate heavy equipment and objects without exposing them, the people, to the risk of electric shocks or falling, just whoops, (laughs) while also riding some measure of protection in the event of an attack by aliens or heavily mutated iguanas. - [Man] Happens every week. - Or moths. Good job, Japan. Never stop dreaming. It's time to stop this MechWarrior. I wanna get off. So, come back on Monday for more tech news. Once again, read by a human being. I'm sure we'll be in (indistinct) at some point. - [Man] Yeah, we'll get that going.",
    "transcript_keywords": [
        "Google",
        "War Thunder",
        "Epic",
        "Apple",
        "Bandcamp",
        "War",
        "company",
        "time",
        "Japan",
        "quantum",
        "man",
        "Google Play Store",
        "Thunder",
        "Google billing system",
        "system",
        "hard",
        "reading tech",
        "good",
        "Japan Rail Company",
        "Apple design decisions"
    ],
    "transcript_entity_values": [
        "3",
        "Google Play Store",
        "over 100",
        "more than 2,000",
        "Qualcomm",
        "Intel",
        "last year",
        "Vitruvian Man",
        "Active Vision",
        "four years",
        "Riley",
        "the 1910s",
        "14",
        "one",
        "MechWarrior",
        "NVIDIA",
        "iPhone",
        "2023",
        "War Thunder\"",
        "Google",
        "Japan",
        "Max",
        "the past years",
        "every week",
        "Apple",
        "RICOCHET Anti-Cheat",
        "Bobby Kotick",
        "Phoenix APU",
        "Pat Gelsinger",
        "World War II",
        "second",
        "healthcare data company",
        "Japanese",
        "30%",
        "Renaissance",
        "Twitter",
        "selfie",
        "Komodo Health",
        "Open App Market",
        "Quick Bits",
        "230",
        "Q2",
        "AMD",
        "82%",
        "M1",
        "first",
        "Tim Sweeney",
        "two",
        "Epic",
        "10%",
        "War Thunder",
        "Quantum Of Solace",
        "Android",
        "Monday",
        "El Salvador",
        "Call of Duty Warzone's",
        "Bandcamp",
        "Fortnite",
        "The West Japan Rail Company",
        "the last day",
        "The Central African Republic",
        "Bitcoin",
        "Quantum",
        "earlier last year",
        "Jos",
        "M1 Macs",
        "James",
        "Epic",
        "Lovelace",
        "June",
        "today"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "GPE",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "EVENT",
        "ORDINAL",
        "ORG",
        "NORP",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "PERCENT",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "LOC",
        "NORP",
        "ORG",
        "DATE",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE"
    ]
}