{
    "id": "pGDfjFawbj4",
    "title": "My 120\" Mega Gaming Setup!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2017-11-25T16:42:38Z",
    "video_url": "https://www.youtube.com/watch?v=pGDfjFawbj4",
    "category": "Science & Technology",
    "tags": [
        "setup",
        "gaming setup",
        "home theater",
        "room tour",
        "setup tour",
        "best gaming setup",
        "projector",
        "xbox one x",
        "gaming",
        "LGProBeam",
        "LG",
        "ProBeam",
        "HF85JA",
        "HF85J",
        "Home Cinema Projector",
        "Portable Projector",
        "Laser Projector",
        "austin evans"
    ],
    "views": 1451062,
    "likes": 27168,
    "comments_count": 2036,
    "description": "Building my new 120\" laser projector gaming setup.  Official LG ProBeam HF85JA page: I'm giving away a ProBeam on Facebook:  Pulaski Power Recliner on Amazon:  120\" Projector Screen on Amazon:  Xbox One X on Amazon:  LG SJ9 Soundbar on Amazon:   Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "http://bit.ly/AustinEvans85JA",
        "https://www.facebook.com/austinnotduncan/photos/a.1466177190278090.1073741829.1460638924165250/2060858227476647/?type=3",
        "http://austin.tech/recliner",
        "http://austin.tech/projectscreen",
        "http://austin.tech/onex",
        "http://austin.tech/sj9",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- This video is sponsored by LG. Hey guys, this is Austin. Today we're building a home theater setup. Essentially we'll have two recliners against this wall and soundbar and projector. I think it should look pretty nice. If I can figure out how to plug my chair in. Oh, uh oh. (laughing) You guys look so ridiculous right now. - Ken is extremely comfortable. - You guys can built the rest, right? - Oh, so is this a projector that's not wall mounted? - So this is the projector. It's actually an ultra short throw. Instead of putting in on the wall or something behind us, what we're going to do is going to put it on a table down here and this is going to shoot up at our projector screen. - Yeah, so we just got the TV stand out of the box. So this is what the finish will look like. - No, I don't think it goes on top like that. - Wait, wait, hold on. - These are screw holes. - You know what, I think that's actually going to look pretty good. - Yeah, not bad. - Have you actually measured this? The projector's going to be little more wider than this, or the screen. So this is our LG ProBeam Projector. Dude, this is totally going to fit on this. You actually did a really good job picking it out. That's so tiny. What's so cool about this is that it's a laser projector. Not like a normal projector where you'll have to change the bulbs every thousand hours or so. This guy's going to last you 20 thousand hours. So what I think we should do is let's just set up here and display it on the wall. Just to figure out roughly what size. Especially I want to know how far we have to have it away from the wall. (laughing) Wow, it's not even that dark in here and we can totally see it that clearly. Look how bright that is! - Yeah, and it's gray wall so it's not even-- - Ah man, once we get the projector screen up. So Ken in his infinite wisdom decided to not just get us projector screen, get the most complicated and crazy over the top one that Amazon sells, because reasons. It's going to look nice, if we actually get it together correctly. Are you sure the projector can do 120 inches? Hi, my name's Ken Bolido and I'm gonna do the math. - Square equals...120. - Is it actually 120? - It's actually 120. (laughing) - No big deal, minor worry there, but we're totally fine. Ken did the math, #kendidthemath. After a lot of hard work, we have our projector screen put together. Now we have to move it back into the room because it was too big to fit in there when we were trying to put it together. Can this fit through the door? - Not like this, we're gonna-- - Wait, so pull the bottom out. So you roll it so that we can get that side down? It covers the chip and scratch, so we're good. This is our 120 inch projector set up. It took pretty much all day, but I'm pretty happy with it. So, the projector itself is a little hard to see right now because we have our giant video light, blasting light in the room but I think this actually looks really nice. It does start with the ProBeam itself. What's nice about this is an an ultra short throw projector, it really simplifies our cable management. So, this is all connected to an Xbox One X and a soundbar. Normally we'd have to run an HDMI cable from this all the way up to the ceiling or to the wall behind. Instead, because it is so close, everything can stay here and you get the added benefit of I'm not going to accidentally walk in front of the projector and block the screen. Like if I did something like this. So we are maxing this guy out right now. It can handle up to a 120 inch screen and well, that's exactly what we're using. So what this means is you have to be very specific on where you actually place the projector. If you move it closer, it's actually going to shrink the image. So that's why we have to keep it pretty much exactly right here. We made a slight mistake in actually mounting the projector screen. If we would have lowered it a little bit, we could probably have tucked this setup in by a few inches. Considering it took us like two hours to put that together, I think I can live with it. So even in a full 120 inches, we're still getting a 1080p image. If you look up close, you can actually see the individual pixels. Once you sit down and kind of lean back, it's really hard to see. Of course, we have nothing but the finest in lean-back technology. When it comes to projector set up, the real advantage is in size. With the 120 inches to work with, that's pretty much bigger than any TV you can get. When that really comes in handy, is for video. Whether watching a movie or YouTube, it's an immersive experience. Especially with the set up the way we have got here with the recliner and the good audio and everything. It is so nice to just sit back and enjoy whatever you want on this thing. Something like this is usable for more than just movies. You can game on a 120 inch screen. So yes, is it kind of overkill? Absolutely. Do I care? Nope. Since this set up is powered by the Xbox One X, we're getting that 4K image super sampled down to 1080 and it looks so, so good. Now I do think that it's maybe not the most practical thing to play on such a giant display, but it's going to be hard to go back to a small TV. Every TV is gonna seem small (laughing). No matter how good the screen is, you have to have good audio to tie it all together. That is where the LG SJ9 soundbar comes in. We actually did a video on this a few months ago. This is the set up that's working in the office right now. I liked it so much that I bought another one for the house. Of course, nothing can replace a full surround sound setup. But I've been really impressed with the sound that you can get out of the SJ9. Not only does it have the top firing Dolby Atmos speakers, but you also have a pretty big dedicated sub. So the rest of the setup is pretty much the Xbox One X as well as a bunch of bits and pieces of. I got some Playstations. We've got the original NES Toploader. Some games, most of this is really for decoration. But we do have a Hue strip that's running underneath. Mostly it just looks cool and Ken went crazy with all my video game stuff. So on this side of the room we have the recliners, which are actually really nice because the screen is so big, you kind of have to lay back to see it. There's also an other Hue light over here. Right now I'm controlling it from my Pixel, but I'm actually probably going to get a Google Home for this side. I also have Google Wifi tucked underneath. Up top here is the only actual decoration in the room, a signed Game of Thrones poster from George R.R. Martin. Yes, the room is a little bit bare, there's not a ton of stuff in here right now. For one day, I'm really impressed with what we were able to put together. I actually have an extra LG ProBeam Projector to give away to you guys. Be sure to check out the link in the description to head over to Facebook for all the details. I will do my best to find links to all the stuff in the description, including of course the ProBeam Projector because LG was awesome enough to sponsor this whole set up. I'm curious, what do you guys think about the actual set up itself? I think there's definitely a lot more work to do, but I'm pretty happy with how it's come out. Of course, let me know what you think in the comments below. Anyway guys, thank you so much for watching and I'm going to go watch this now.",
    "transcript_keywords": [
        "projector",
        "projector screen",
        "screen",
        "pretty",
        "set",
        "ProBeam Projector",
        "wall",
        "projector set",
        "good",
        "guys",
        "Ken",
        "nice",
        "projector screen put",
        "put",
        "room",
        "back",
        "video",
        "Xbox",
        "hard",
        "inch projector set"
    ],
    "transcript_entity_values": [
        "LG SJ9",
        "20 thousand hours",
        "SJ9",
        "NES Toploader",
        "ProBeam",
        "Dolby Atmos",
        "a Hue strip",
        "one day",
        "1080",
        "Google Wifi",
        "like two hours",
        "Amazon",
        "Ken",
        "Austin",
        "Game of Thrones",
        "George R.R. Martin",
        "two",
        "a Google Home",
        "HDMI",
        "120",
        "LG",
        "Today",
        "120 inches",
        "4",
        "YouTube",
        "Xbox One X",
        "Ken Bolido",
        "Playstations",
        "Facebook",
        "the ProBeam Projector",
        "LG ProBeam Projector",
        "Xbox One",
        "1080p",
        "120 inch",
        "this a few months ago",
        "a few inches",
        "every thousand hours"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "TIME"
    ]
}