{
    "id": "pgPKtxfTcgg",
    "title": "The City Under One Roof",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2019-03-25T16:26:12Z",
    "video_url": "https://www.youtube.com/watch?v=pgPKtxfTcgg",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "whittier alaska",
        "city under one roof",
        "anchorage",
        "prince william sound",
        "wwii",
        "begich towers",
        "buckner building",
        "whittier",
        "whittier tunnel",
        "anton anderson memorial tunnel",
        "tunnel",
        "buckner building whittier",
        "abandoned building",
        "whittier alaska 2018",
        "alaska 2018",
        "the buckner building",
        "alaska",
        "anchorage alaska",
        "train tunnel",
        "buckner whittier",
        "begich",
        "begich towers alaska",
        "begich towers whittier alaska",
        "history",
        "culture"
    ],
    "views": 68401,
    "likes": 3571,
    "comments_count": 154,
    "description": "Almost all of the residents of Whittier, Alaska live in a single building... The $9 Billion Scam: Theranos:  How Trains in Japan Are Never Late:  How Nintendo Invented the PlayStation:  What's That Scream In Every Movie?:  The World's Tiniest Country:   Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/ddkq2fK4jT8",
        "https://youtu.be/Fh7h5eJpps4",
        "https://youtu.be/TG0-xhZ1Jds",
        "https://youtu.be/g11vCwtZAYY",
        "https://youtu.be/FrVVy8uSvEc",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is the City Under One Roof. If we take a trip 60 miles from Anchorage, Alaska, we will end up in the small town of Whittier. Now most people think of small villages as a handful of shops, maybe some quaint cottages but what makes Whittier so unique is that almost all of the town's 218 residents live inside a single building. It started out as a mining town during the Alaskan gold rush at the end of the 1800s and into the early 1900s. Now at the time, the only way to access the town was by sea in the Prince William Sound in the Gulf of Alaska. That sounds fancy. The Prince William Sound in the Gulf of Alaska. I don't know what that accent was though. That was-- - Definitely not Alaskan. - Despite being so close to Anchorage Whittier is almost completely isolated by mountains and thus not exactly a super popular destination for settlers. During World War II however the U.S. military used Wittier as a base of operations so they built the Buckner Building which was touted as the City Under One Roof. At the time it was the largest building in Alaska. Not only did this city house around 1,000 military personnel and their families but it was also full of amenities. We're talking a hospital, theater, bowling alley, church, bakery, market, radio station and even a library. However, the military completely abandoned the base after just seven years and in 1964 a 9.2 magnitude earthquake caused a massive tsunami that hit Whittier and destroyed most of the complex. (screaming) However thankfully another building had been constructed. The Begich Tower, the beget, begich, how do you say that? - Begich. - Begich. - Which I guess sounds a little bit better than begick. It's like, those are ugly syllables, begick. - That's someone's name. - Begick. Whittier was officially incorporated in 1969 and the tower became condos which the entire town subsequently moved into. Aside from only a small handful of buildings like a tiny museum or a boat warehouse pretty much the entire town of Whittier is self-contained within the one building. Inside, you'll find the fire department, the police department and the mayor's office are all on the first floor. And they even have a grocery store inside, The Cozy Corner. Fun Fact about that police station by the way it's a single room. There's not even an interrogation room or I don't know, jail cells. I mean I guess crime is not that big in Whittier, I guess it really couldn't be with 200 people. I mean everyone literally knows everyone. Imagine Tinder. The town school is in a separate building but it's connected via an underground tunnel which is nice considering just how much snow you get in Whittier. Basically, all the town's residents work towards it in some way. Whether that's snow removal, working the popular Whittier tunnel, the grocery store or maybe just working for the town government. However, tourism is also a big business for Whittier. It's a popular port for cruise ships and because of this the bed and breakfast on the top floor of the tower is a very popular tourist destination. You know, relatively speaking. Now if you're not traveling by boat there's only one way in or out. In World War II the military constructed a tunnel through the mountains after they feared attacks from Japanese submarines in the Gulf. When it was constructed only military trains were allowed to use the tunnel but in 2000 the tunnel was opened up to the public and that made accessing the town so much easier, well, sort of. At four kilometers long it is one of the longest single lane tunnels in the world, and when I say single lane I mean only a single lane. The tunnel is barely wide enough for even a car to get through. As you can imagine that means that the tunnel gets pretty congested. To manage all that traffic there's a rigorous schedule. Every 30 minutes the direction of the traffic changes. But it completely closes at night. Oh yeah, and that single lane tunnel, it's still used by the the train. So you better double check that schedule. Thank you so much for watching this episode of This Is. You guys know the drill make sure to subscribe if you want to see weekly episodes. Ring that notification bell. And always tell Matt how much you love him. He really is a national treasure. (laughing) This is gonna be the new joke now, just so you guys know. Just every episode.",
    "transcript_keywords": [
        "Prince William Sound",
        "Whittier",
        "town",
        "William Sound",
        "Prince William",
        "tunnel",
        "Alaska",
        "building",
        "popular Whittier tunnel",
        "Anchorage Whittier",
        "single",
        "Gulf of Alaska",
        "single lane",
        "Gulf",
        "military",
        "Whittier tunnel",
        "World War",
        "Begich",
        "City",
        "small"
    ],
    "transcript_entity_values": [
        "1969",
        "9.2",
        "only one",
        "one",
        "60 miles",
        "Alaska",
        "the end of the 1800s",
        "Anchorage Whittier",
        "2000",
        "Gulf",
        "Whittier",
        "Matt",
        "four kilometers",
        "night",
        "the Prince William Sound in the Gulf of Alaska",
        "World War II",
        "Anchorage",
        "the early 1900s",
        "Wittier",
        "The Cozy Corner",
        "Alaskan",
        "1964",
        "the Buckner Building",
        "Japanese",
        "just seven years",
        "first",
        "The Begich Tower",
        "weekly",
        "Begich",
        "1,000",
        "the Gulf of Alaska",
        "Every 30 minutes",
        "U.S.",
        "218",
        "200"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "DATE",
        "GPE",
        "DATE",
        "LOC",
        "GPE",
        "PERSON",
        "QUANTITY",
        "TIME",
        "FAC",
        "EVENT",
        "GPE",
        "DATE",
        "WORK_OF_ART",
        "LOC",
        "NORP",
        "DATE",
        "FAC",
        "NORP",
        "DATE",
        "ORDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "LOC",
        "TIME",
        "GPE",
        "CARDINAL",
        "CARDINAL"
    ]
}