{
    "id": "PhA6P13DLAQ",
    "title": "Mercenary PREDATOR Spyware and other THREATS (plus FREE training)",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2023-11-19T14:30:13Z",
    "video_url": "https://www.youtube.com/watch?v=PhA6P13DLAQ",
    "category": "Science & Technology",
    "tags": [
        "pegasus",
        "predator",
        "mercenary",
        "spyware",
        "malware",
        "iphone",
        "android",
        "pegasus spyware",
        "hack",
        "hacker",
        "hacking",
        "infosec",
        "information security",
        "wifi",
        "linux",
        "tails",
        "privacy",
        "cyber security",
        "ethical hacking",
        "online privacy",
        "kali",
        "kali linux",
        "talos",
        "cisco",
        "cybersecurity",
        "firewall",
        "Jaguar Tooth",
        "ncsc",
        "cyber",
        "ai",
        "artificial intelligence",
        "chatgpt",
        "ransomware",
        "attacks",
        "cisco talos",
        "gpt3",
        "gpt4",
        "chat gpt",
        "security",
        "ransomware attack",
        "virus",
        "pedator",
        "ransom",
        "cisco cyber",
        "cisco cybersecurity",
        "talos security",
        "Pegasus",
        "apple",
        "samsung"
    ],
    "views": 102718,
    "likes": 3161,
    "comments_count": 96,
    "description": "Big thank you to Cisco for sponsoring this video! (And for the FREE Ethical Hacking Training!)  Commercial spyware use is on the rise, with actors leveraging these sophisticated tools to conduct surveillance operations against a growing number of targets.  Cisco is deeply concerned by an increase in the rate of high-sophistication attacks on network infrastructure  that we have observed and have seen corroborated by numerous reports issued by various intelligence organizations  indicating state-sponsored actors are targeting routers and firewalls globally.  // FULL Detailed Interviews // Martin:  Mark: Coming soon Kieron: Coming soon  // Martin's SOCIAL //  Twitter / X:   LinkedIn:    // Marks SOCIAL // Twitter / X:   LinkedIn:    // Kierons SOCIAL // LinkedIn:    // YouTube VIDEOS // Is AI biggest security threat in 2023?:    // Links MENTIONED // Free Ethical Hacking course:   Talos Intellexa Predator:   Talos Year in review:   State-sponsored campaigns target global network infrastructure:   NSSC:   // David's SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // MY STUFF //   // SPONSORS // Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  // MENU // 00:00 - Coming up 04:38 - Interview with Martin Lee // Mercenary software & Vulnerabilities in softwares 09:00 - How can non-tech savvy people stop hacks 12:57 - Ransomware + Mercenary software 15:52 - The sky is not falling // Know your Threat Profile 20:07 - Affordable and free courses 23:26 - Interview with Mark Jackson // Risks of end-of-life network devices 27:48 - SNMP vs NETCONF/RESTRCONF 29:44 - GRE Tunnels 31:09 - VPNs without Multi-Factor Authentication being targeted 32:43 - Tips to prevent getting hacked 38:06 - Security for home network devices 39:40 - Why is it happening now? 43:18 - Interview with Cisco Apprentice // Getting into Cicso at 18 45:04 - Advice for the youth 46:52 - The younger perspective 48:13 - Conclusion  cisco talos cisco talos pegasus spyware hacking hacker malware  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   Disclaimer: This video is for educational purposes only.   #pegasus #iphone #android",
    "description_links": [
        "https://youtu.be/rigOKIFwt48",
        "https://twitter.com/mlee_security",
        "https://www.linkedin.com/in/martinlee/",
        "https://twitter.com/m_jacks76",
        "https://www.linkedin.com/in/mark-jackson-148a012/",
        "https://www.linkedin.com/in/kieron-iveson-88625b1b1/",
        "https://youtu.be/SyaP9GDNIug",
        "https://skillsforall.com/course/ethical-hacker?courseLang=en-US",
        "https://blog.talosintelligence.com/mercenary-intellexa-predator/",
        "https://blog.talosintelligence.com/half-year-in-review-2023/",
        "https://blog.talosintelligence.com/state-sponsored-campaigns-target-global-network-infrastructure/",
        "https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/jaguar-tooth/NCSC-MAR-Jaguar-Tooth.pdf",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "I recently had the opportunity to visit the Cisco offices in London. Saw some fantastic equipment like their 400 gig Ethernet. Also saw some old equipment such as the Cisco AGS from many many years ago it's great to see the equipment that they have in their lab but I specifically went to Cisco to interview Martin Lee about Cisco Talos perspective on the threat landscape. I interviewed Martin previously at Cisco live in Amsterdam he has the ability to explain complex topics simply but also to tell us what the real threats are and how we can protect ourselves. It is so difficult writing software and modern devices are so complex you're going to have to expect that there's there's vulnerabilities in there um what we really want is we want the white hat hackers and the legitimate security community if I can use that word finding these vulnerabilities first um and fixing the vulnerabilities getting the patches out before the black hats and the bad guys are finding it and putting it to um to their own use and then even if they do put that to their own use again it's for the security community let's spot the exploitation of the vulnerabilities early and as soon as we can so again we can work on a fix and we can resolve the problem. I also spoke to Mark Jackson National cyber security adviser for the UK and Ireland at Cisco he does a lot of work with the UK government and what we discussed is of great interest to me we are talking about the issue of vulnerabilities in network equipment this is not something new but it's escalating it's important that you are aware of the issues of outdated Network equipment. I've seen so many posts in the past where people post things on the Internet saying my router has been up for 2 years or 5 years or whatever isn't my router great and the issue is that's great from an uptime point of view but is an absolute nightmare from a cyber security point of view in other words you haven't updated your device for all that time that is a disaster waiting to happen. It's amazing the comments I often get on YouTube where people say this will never happen, this is dumb, it's too simple but in the real world those are the kind of things that happen to companies famous example which we discuss in more detail is the issue with Simple Network Management Protocol or SNMP and how companies are being hacked because they haven't updated their management protocols to use something more modern such as NETCONF or some kind of API versus SNMPv1 which again is a disaster. Make sure that you're aware of this, make sure that your leadership is aware of the issues with regards to outdated network devices, IoT devices. Other infrastructure devices that are just out there have been plugged in and have been left and not updated. So Mark tell us a bit about yourself because we haven't met before. No we've not. and I believe you can't tell me everything because you'd have to kill me right? That's basically it yeah yeah I am James Bond. I like it. No no no I'm I'm really really not no I so where where do I start uh 26 years in Cisco I joined Cisco as a graduate back in the late 90s and I've kind of been here ever since um it doesn't feel like 26 years um I've done lots of different roles inside Cisco mostly in and around security and mostly in and around government. My motto is motivate, educate and I was very happy to talk to one of the Cisco apprentices at the Cisco offices explaining his journey someone much younger someone new to the industry get their perspective on what the younger generation can bring to the table to help us do things differently and not make the same mistakes as we made in the past. Don't believe that because you haven't had the opportunities that other people have had that you can't make a change in your life I've seen it so many times with someone from a poor background, someone who was perhaps hungry, someone who didn't have the opportunities that many of us have had goes on and does amazing things. Don't let the things of the past stop you from doing something amazing in the future. Learn from YouTube, learn from the courses available out there. There's so much lowcost training out there. Use the training from Cisco and others to help you change your life and I'll be talking more about free training from Cisco in an upcoming video. It's fantastic to see the amount of material available out there to help you learn and change your life in the future. One thing that we have in grange over is that we use technology from day zero so we've been there and experienced it I think some older generations is still kind of catching up to them so we can go what we can we can relate to people when people saying that we got this Cyber attack we're trying to put this technology can to go and test it and go and say no that's not going to work or that might have some legs to [Music] We spoke in was it February right about um attacks against organizations and I mean kind of in line with what your books about and tell us have released this half year in review and one of the things that was really interesting in this is Mercenary software or Mayhem it's called and they mentioned Predator spyware and there's some others that are sort of well known which which we won't necessarily mention by name but uh I can but like Pegasus is is one that people probably know the most about but I mean Predator seems to be a new one and it seems to be growing right so perhaps you can tell us about why it made it to the report and what's going on? So it's all really part it's part of the threat landscape and how the threat landscape is um is evolving if you think about this from a state actor's point of view um like so many things it's it's difficult and expensive for for for states to set up very very detailed technical departments that are doing stuff which is really quite difficult so um if you were a nation state and you were setting up your offensive cyber operations it's tough, it's difficult, it takes a lot of time so they look to Outsource these operations to the private sector. So this is what we're seeing with this uh with these information stealing attacks. Nation states contracting third party private sector organizations to act as mercenaries effectively um being paid by nation state to carry out offensive activity on behalf of a nation state and what these organizations specialize in is um is compromising like everyday people yeah um so journalists, um uh politicians, um people who may well be considered dissidents but people who have been placed under surveillance by a nation state. To infringe on their human rights, um steal their personal data, I imagine from the nation states point of view it's about understanding what it is that they're doing who they're talking to but you know let's recognize this what it is it's illegal surveillance, um it's hacking those personal devices and so much of our entire personal life now is on is on our phone um that really we think it's unacceptable that um nation states and private enterprises are facilitating this form of surveillance, stealing personal data um you know if you're a criminal and you get a court order for surveillance that's one thing, if you're a normal everyday person going about your legitimate business business and you get put under surveillance I think that's something else. Sowe're seeing a growth in this kind of activities. Just like a big growth in it? It's been it's been happening for a few years um but it continues to happen, um we do see more of it, um I think like many things there are more and more organizations that are specializing in this and developing that capability and people need to be aware of it um and also we need to get consensus in the um International Community to say you know what this this is unacceptable and it needs to be um properly regulated and uh and outlawed. The problem with this stuff right is it's you get an SMS, you open that up, so you get like a one click infection or installation or zero click with some of the software? It's like with every device anything that's got software it's running software there's going to be vulnerabilities there somewhere um what these spyware organizations specializing in is finding those vulnerabilities so that they can compromise these devices and get their spy wear um into it um so yeah make sure you're keeping your devices uh fully patched, um up to date be aware that if you are at risk you might want to have a separate device that you use for your professional life and keep that separate from your personal um phone um or even better let's just outlaw it and stop it happening. This is the issue a lot of people encounter right they not technical like we are they're not in the cyber security niche perhaps. So what do businesses do to you know protect their data? Again we can go about number one thing patch, patch, patch, patch ,patch again. It's a mantra right? Yeah secondly um if you can have your data in a secured environment so one of the best things you can do certainly for most organizations hold your data in the cloud actually have it um hosted by a third party that's doing the security operations themselves that has a sock that's monitoring this those um those systems and protect the login to those systems with Two-Factor Authentication um if you can do those two things you're going to be in a pretty good position. Thenext step is making sure that you've got some form of endpoint protection on every device that you use endpoint protection, Two-Factor Authentication to access your data which is held in the cloud plus making sure that you've got got a good patching uh process in place that already puts you in a very very good position. Uh beyond that we need to start thinking about what is it that you've got to lose um obviously if you're a big business or you're um in a regulated environment such as you're dealing with medical data or financial data then you know we need to think about the consequences of what could possibly go wrong because it's going to be something which is worse if your um your your own small business if you can do those three things and do it well and do it consistently you're going to be in a very very good place. Um the other one that you want to do of course is backup yeah and we've been talking about backups you know since I was a kid, you know even before that 50 60 years ago people have been talking about the importance of backing up systems it's the Achilles heel for ransomware still we not very good backing up but again this is why we've got a cloud system and then you're you're you're outsourcing that back up into into someone else but if you can do it yourself again you're going to be in a good place. So did I hear hear you right by saying that you're going to it's better to put stuff in the Cloud than it locally? For most organizations um well you got to think so everything in security is a tradeoff, the the use for them is if you can replace cloud computing with somebody else's computer it's a very good way of thinking about it but if you can think of for most businesses am I better off protecting and looking after my own data or actually is a third party that specializes in this likely to do it better than me in most cases the answer is probably yes not always and if you can look after your own your own data to a high level and you've got the proper backups in place and you're doing those security operations task brilliant go do it yourself it's not for everyone if it's everyday data something which isn't specialized which isn't protected you want to focus on your day job and what it is that you do you're probably better off having in the Cloud secured with Two-Factor authentication but it's a personal decision it's always a value judgment um and you've got to think of where is my time best suited? What's both beneficial most beneficial for me and for my clients? I'd say nine times out of 10 outsource it to someone else in the same way I doubt whether you do your own books or your own auditing or your own contracts it's like everything or your own plumbing you get someone else to do it you know what you need to ask them and the questions that you need to ask you know how to identify someone who's reputable um and you got the right protections in place but you're probably better off the same say say same situation like with plumbing you're probably best off not doing it yourself and I'd say the same thing with looking after data yeah. I mean it's interesting because when we spoke earlier this year the biggest thing on everyone's lips it seen was was um ransomware. Now it's like ransomware plus this Mercenary software are those the two big threats that you see at the moment? There are there there are many threats it's constantly shifting shifting and it also depends on your own threat profile certainly ransomware isn't going away there's nothing on the horizon that that I can see which is going to mean that that ransomware is going to stop I think it's always going to be going to be with us It's all driven by profit yeah let's not forget the vast vast majority of um of attacks criminal in nature we've got dedicated criminals looking to make elicit profit. Ransomware is a criminal business model that they developed which is very very profitable. We see that dual threat of stealing data coming out of this which is becoming bigger so this summer was the first time that in the um our data and looking at our instant response data we see more data theft than ransomware so it is something which is which is um getting bigger this is the first time we've seen it overtake ransomware. Mercenaries it's worrying it's there we also need to look at that in the context of state sponsored attacks with a backdrop of uh well of conflict in Ukraine and conflict globally we also see criminal groups with greater or lesser associations with the nation State conducting attacks against organizations whether that's just defacement um whether it's yeah just trying to destroy systems, disrupt systems, deploy wipers just generally causing havoc that's the other bit that that that really disturbs me and and gives me cause for concern and also um the use of what we might consider non-traditional systems to hack into. I mean we've talked about the risk for years of network devices, printers, routers switches, um firewalls these are devices that are connected to um to the network um they have an Operating System they have spare CPU cycles they can be used as a means of Ingress by by the bad guys there's going to be vulnerabilities there or there's going to be misconfigurations in one way or another and so bad guys can use these as a point of Ingress inside um a network in enumerate the systems that are there look for vulnerabilities get inside them and then cause some kind of additional attack whether that's data theft or ransomware or just destruction or um defacement. That happens an awful lot and again that's a shift that we've seen over the past three years or so um but I think we're going to see more of that. You can feel sometimes that the sky is falling that it's the end of the world with this stuff but you said something along the lines that you more attacks are stopped than actually take place? Absolutely, absolutely you know it's still um it's a bad day when you get compromised but it's a bad day not every day um so far far more attacks are are detected and and blocked than succeed. No organization I think is ever going to do security perfectly um it's a matter of doing it better than most not being an e easy target, not making life easy for the bad guys if you can do that the bad guys are more likely to go again against an easy target because there's enough out there if you can be a slightly harder target one the bad guys are more likely to go to go elsewhere two if you're making life difficult for the bad guys you're making their attacks noisy and you're going to be in a better situation to detect the attacks once you've detected it you can then remediate it. So um cyber attacks they're not instantaneous it's not something that just happens like that they've got to find you first they've got to conduct reconnaissance, they've got to find the vulnerability, they got to exploit the vulnerability, they've got inside the system then that process is going to repeat there's always the fingerprints are always there if you look for them. The more difficult you make it for the bad guys the more fingerprints you're going to find on your networks, on your systems, the more chance that you have to detect it if you're looking once you detected it you're then in a position to kick the bad guys out. It's interesting what you said because I mean I I think you mentioned it before as well you mustn't think that you're not going to be a target, everyone could be a target. Everyone's a target. But you mustn't get paranoid that you're going to get this um malicious software on your phone necessarily unless you're a specific type of target. Yeah know know what your threat profile is most organizations yeah your risk are criminals they're everywhere, they're going to be looking at everyone and they know if they can get inside you they can make money certain organizations and certain individuals have a higher threat profile that they're attracting other attackers if that's you be aware of it be aware what it is that you need to do I think probably what I'd say reach out to an expert organization to give you to to give you the protection that you need. For most organizations it's about not being an easy target, it's about considering what is the worst that could happen and then planning for that um. Also if you're work in in security industry um there is only so much you can do it's very easy to get paranoid it's very easy for this to become a 24/7 profession yeah you do need to be able to take a step back you do need to be able to recognize you can only do so much you can never ever be 100% secure we need to be able to live with that uncertainty and say okay I've done everything that can be reasonably expected of me and that's actually what it is that I need to do um and then also uh it's so important be able to step away and go and do something else um hand the task on to someone else um don't just do it on your own and think the entire organization's security depends on me okay yeah it probably does but it's not only your responsibility um you do need to be able to switch off go do something else and you do need need to recognize I can only do so much but everything that I do do during my day job I move the security posture forwards and if you can continuously move the security posture forwards every day you're making the world a better place and you're making your organization um safer so if you just if you just patch one system in a day you've made the world a better place you're not going to be able patch every single one but just move that security posture forwards day by day you're making progress you're making the world a better place at the end of the day switch off chill go do something else uh and then worry about it the next day. There's people in certain parts of the world I mean I'm from South Africa originally not everyone can afford to buy this commercial solution from Cisco but how do you learn and it's fantastic you know that that snorts available these other options available for learning or for organizations that can't afford it absolutely you know there are many organizations that that that are out there that where they don't have a security budget you know let's face it it happens and um I think all of us in the security industry you know would really love that you bought a proper um uh maintained product um however there are some organizations some environments where that's never going to happen and um you know great here's that third party open source stuff download it it's not going to get you as far as the the the fully working all singing and dancing solution will but it'll get you a lot of the way there and if you can devote the time to it and also invest in the skills both you're making these environments secure but you're also developing those people so that they can enter the um uh the workforce and they can develop their skills. I love it I mean the way I look at it is like Cisco Packet Tracer is another example you know how you going to learn to configure routers and switches if you don't have routers and switches and Cisco give Packet Tracer away for free so you can learn this stuff so that when you go into the workforce perhaps or when you're changing jobs um and you get into cyber security or networking you already know what you're doing. Absolutely we've got the open source software there are various uh tutorials there the communities that are out there we've also got the Cisco Networking Academy where we've got um various courses that you can take on networking and security all of this is for free the reason why we're trying to power an inclusive future um both for securing systems across the world making possible these technological changes that are that are happening and people have got dreams of how technology is going to be used yeah we want to enable that that that's very much what we want to do um but there's also a bit about there's so many untapped skills out there there's people watching this video who want to learn about security, who want to learn about networking, you know there's so much stuff out there that we're trying to develop so that people can develop their skills they can bring this to the workforce they can make their dreams come true um whether that's about finding the employment of their dreams or they've got some kind of technology some kind of system they want to build you know we're trying to make that happen we're trying to make it easy for everyone. I love that I mean the skills for all website is great because I mean I I looked at I was surprised Cisco have a just for people who haven't seen this have an ethical hacking course yeah for free on skills four as well as cyber security and uh networking CCST so free training I mean if you want to do the exam you have to pay but the training. The training is out there the systems to download and play with are all free uh yeah you got to pay for the exams, you got to pay for the book as well I'm afraid um but yeah all of this it's so much out there it's there's so much out there it's all a matter of getting engaged and playing with it it's like a massive playground go go play with it and and you'll learn uh you'll have fun and um yeah we're making a better future. So yeah that's that's that's what I was sort of hitting at right do you do a lot of advisory stuff for for the UK government and stuff right? Yeah so I guess over the last couple of years I um I moved into a ro a team that we know as security and Trust organization inside Cisco um we call them Stow because we like our acronyms as you well know and what Stow do it's a couple of different things but but primarily the focus I have is that security and Trust um look at the security of our products not the features and functions but how we build them which is really important to a lot of our customers and then the kind of regulatory landscape so that's where I then spend a lot of time with the UK government because it's about how the market is going to be regulated from a cyber security point of view and therefore what we then have to do as an organization to sort of go and meet that regulation for all of our different customers across the UK because I mean there's this um document on Cisco's website that was reading state sponsored campaigns Target Global Network infrastructure so I mean rather than us reading it I'll I'll link this below for anyone who wants to read it can you tell us what this is about yeah and because this is a big emerging thing it sounds like yeah well I well it's interesting to use the word emerging because uh my first experience with what you'd kind of call root and malware or attacks against roers um is probably 15 years ago um so this is not a new problem um but it's one of those that sort of bubbles to the surface when there's a bit of an incident and then drops back but in essence it's this idea or the recognition that wait a minute you know a modern day router is just the Linux box I mean iOS XE is Linux running binos you know which is which is Cisco IOS as a as a demon and so all of a sudden you've now got a different Paradigm than maybe you would have had with classic iOS which was a bit more complicated but still a computer ultimately yeah and therefore It suffers all the same things that your windows and your Mac and your Android and you know your iOS devices all do which is that vulnerabilities are discovered and need to be patched and maintained um I think we have a unique problem in the networking space though in that um not only do people not patch but also people hold on to their equipment much longer yeah you know and and I think that's that's that's a sort of unique to that domain problem where people will run their their networking equipment for 5 10 15 years well beyond if his end of life and if end of support date because it just worked so there is always that tension of well if it's kind of working and and I don't need to go touch it 100% yeah it's not broken don't fix it that's it so so it's not really an emerging problem but I think we're on one of those those not ABS those Flows at the moment where it's where it's coming up and I think that the fundamental challenges we're starting to see a shift in the same way that we see the threat landscape shifting all the time we're seeing a shift towards people or at least we we're seeing a shift towards discovering that there's been a pivot towards targeting of network devices in particular end of support end of life unpatched and so on and so on um the easy sort of low hanging fruit arguably that that exists out there on the internet and of course from there there's lots of things you can kind of do you can use it as a jumping off point uh you could use it as a uh point of capture and interception for data because that's what roers do right so yeah so it's we're we're definitely on one of those flow moments with this at the moment so I mean is is is it because it's nation state is that the the new the new change or is that always been an issue why is it suddenly like making the news kind of like no I think it's I think it's probably a combination of the things you know we're definitely seeing the the attribution so um the UK National cyber security Center the ncsc you know directly attributed Russia Russian um AP actors against uh something called Jaguar tooth yeah um uh which um was discovered earlier in this year and and that malware as you say was attributed to Russia so so we can you know nation state in a way it's a little bit of sensationalism I guess because to a certain extent that helps Drive the message you know if we say that our nation state actors China Russia the the two that are often called out in these type of actors then that tends to bring attention to it which is what we need you know and I think it's also the attack and motivation you got to think about what the motivation might be to to attack a networking device as well you know is it is your average cyber crime gang going to go and Target a rout or a switch is it going to is it going to generate revenue for them as you all know you know that's that's the big motivation in that space so I think it's it's probably a combination of a few things I think it's making sure there's the awareness there because it is an it's not an emergent problem it's something that's been around a while but the nation state thing I think just helps Drive the um the awareness so in this document they talk about um and the document from Cisco they talk about SNMP and then they also mention other management protocols so are there better ones to use today U yeah so we talk about net comp and um rest has being two Alternatives um they're just more modern paradigms again you look at encrypted right yeah they're all encrypted they're they're more efficient they're more modern Alternatives of using SNMP but again it's it's that Legacy of well what about you tool train does that support rest comp and netc as well yeah this is the problem because I mean with the recommendation like just take out snnp but that's not going to work for everyone no and that and that that again is is part of the challenge you can't just switch this stuff off in the same way you often can't just switch tnet off you you might have a script that's running around going around sucking up all your comp confs as part of your config management um so that means now somebody else has got to touch that and they've got to touch every device to turn off tnet okay and what's the actual Net game well it's more secure well yeah but if I think that I'm never going to get compromised then why would I really go burn two three 4 days of Dev time to build a new tool change my you know why would somebody do that if they don't think it's going to be a problem when I've just got to patch all my end points and I'm probably then better off or I've got to implement MFA and all these other things that are probably higher priority in my in my stat but yeah so I think that's it it's what a lot of this boils down to is is it's it's it's it's exploiting the Legacy you know it's that loow hanging fruit that's been put out there SNMP tnet you know all protocols you know if you've got HTTP left open on your on your uh on your router or your far whatever it might be and somebody's left it because somebody might have done some Management on it at one point and maybe not switched it off um you know RDP you know let's probably not even open that particular worms but again another classic problem yeah SMB yeah you know let's stick SB on the internet yeah really but somebody will have done it maybe accidentally but often time they have been a deliberate decision because they needed to do something else and they didn't think about security ramification so I mean in the document they mentioned stuff to look for one that was interesting gory tunnels what are they like what are the what are the like things to look for like I mean you see this is a problem yeah Cisco trying to raise awareness to this and I believe there's a there's a whole um what is it ition of multiple companies right so the center for cyber security policy and law uh who are a group in the US essentially has instantiated this Consortium really to address this problem so we're we're a founding member along with the likes of juniper and foret and BT and Verizon and there's a there's one or two others in there and the idea is is sort of recognizing that there's a problem here you know we've all got this problem it's not just a unique problem to Cisco but recognizing there's a problem and this Coalition is really forming around trying to I guess get a sense of the scale of the problem yeah and then actually come up with a set of meaningful tangible things that organizations can do to try and do something in this space because again it's another one of those we've been talking about patching your stuff for ages yeah it still doesn't happen so we've got to try and think of some new and novel ideas as to how we actually move the needle on improving the resilience here because fundamentally networks now underpin our economic well-being you know if if a if a Telco Network in the UK goes down bad things start to happen and they will happen very very quickly whether that's food distribution or energy management or or you know a whole bunch of other things um so you know actually this becomes a non-negotiable for resilience of a Nation let alone just an an individual organization so I mean there was talking about not having TFA on vpns and that's what they've been targeting right yeah so that one's that one's very much about um I suppose exploiting creds um because obviously if you don't have your multiactor then then it's easy you've got your creds and where you go the The Other Side of is actual vulnerabilities in the VPN implementation which then is being exploited to either get access to that device and then hop in um or otherwise you know effectively pivot yourself into the organization and that's that's the sort of two sides of the VPN as a as a as a an exploitable end point and we've seen a lot of that noise the the other side has been targeting sort of small office home office devices as well so we do see people like dlink and TP link and linkis and you know all the other brands that you tend to see on the end of broadband lines and the motivation there is because they're not Enterprise focused the motivation there is is often the attackers want to use them as um effectively part of their their their attack chain so they'll proxy through them no proxy through them okay to get into the corporate Network something so rather than me going direct to you what I'll do is I'll compromise a thousand home routers and I'll bounce between them all so therefore tracking me down and I might pull my C2 back my Comm control traffic back through that um you know again you might use them for dos but if you're a nation state your motivation is going to be slightly different and so therefore you might use that hide your seat to and again that's documented in some of the I think sis talk about it um and I think we talk about it in some of our articles as well as you know there's the sort of Enterprise endpoint Cisco rout but also then those other endpoints become interesting as part of that broader landscape of compromised network devices so I mean the Coalition is to try and is to bring visibility to this problem because I mean we always hear the noise of iot or do end point you know your PC you need to get patched whatever your phone but we don't always hear about this so this is to try and shine a light on this isely shining a light and I think it's shining a light with a view to the action you know something that's actionable at the end of it cuz I want to get to that so what what do we do so Cisco are part of this Coalition a governments are involved but like what does the guy on the street do like someone like me in Enterprise what should I be looking for what should I be doing cuz some of the stuff's mentioned yeah but it's complex it I i' challenge complex I mean it's it's and heack maybe yeah and I think that's part of the part of the problem again you've got a stack of a thousand things to do when you walk in the in the every morning and you know there's going to be arguably there's going to be a bunch of things that are going to be more impactful from a security point of view whether that's patching your end points or turning on MFA or looking at some logs and so on and so forth your network stuff is probably going to be a little bit down the track so part of that Coalition is absolutely about saying you know actually realize these things can be compromised people are actively targeting and so you do need to kind of raise the priority but in terms of what can be done about it I mean first and foremost patching you know it it's the most dull boring conversation in the world and it's the one that we always Trot out because it's an easy answer but that's it's it's an easy answer and it's the right answer you know the the the Jaguar tooth malware was exploiting vulnerability from 2017 um drop on a new version of iOS and that's gone you know and okay dropping on a new version of iOS is in a lab that's really easy right you know it's a line of config yeah and you're done and then you got to reboot ah real world yeah and the reboot think thing yeah and and some might say that Cisco code occasionally has one or two undocumented features in it and so therefore moving from version X to Version Y might introduce some challenges in your network stability I'm not going to comment on those things I'm sure you're a few as well um but that's the reality that's software right software is complex and so just simply patching or or in case of iOS or XE and these things you know rolling the entire image um these things are are easy to say and sometimes hard to do and it's also what happens if that routs I don't know on a on a low bandwidth Link in the middle of a field you know so what do I I roll an engineer to site or I try and drown load it what happens if it goes wrong there's a whole plethora of reasons as to why people don't do that patching but it still remains our biggest defense against a lot of these kinds of attacks is just main you know being up to date and maintained um you know second things uh look after your creds um you know one of the a lot of the compromises we've seen uh we talk I mean Jaguar tooth isn't is isn't uh isn't one of them but there are other examples that we we don't name but there are other examples um where we've seen compromises against devices and it's not been because they've exploited some you know old vulnerability it's because the creds have been compromised now how have they compromised them who knows it's very very hard to know but we all know that people will I don't know sync creds with Google accounts and then Google accounts get popped or maybe they've got them on a TX server and the TX server has been popped because somebody's managed to get in through another way and and and there's a whole whole bunch of reasons how creds can get popped so looking after those creds again easy to say sometimes really hard to do but again putting MFA in front of some of that can be can be very helpful if you're using jump boxes make sure jump boxes are all hardened where you're doing you know using jump boxes for management of these network devices so that's kind of the credentials and your patching sorted out and then it's then it's the rest um using secure protocols we talked a bit about S&P V1 versus v2c and V V3 NETCOM forom um you know using modern equivalents of or modern secure equivalents of these older older Telemetry protocols has got to be fundamental and again there are tools out there there's probably a stack of Open Source tools I'm sure that will just go off and just slurp configs up and tell you wait a minute you've got SNMP open here here and here just go change it again easy to say not always easy to do yeah but they are the this is the reality of being you know being secure it doesn't need some God boox being purchased and and God forbid we love people to buy God boxes from Cisco but the reality is this is not a technology problem this is this is a process and policy problem that people have got to get their heads around and then just in the same way you you wouldn't consider running I don't know Windows 98 still on your lap on on your laptop and stick on the internet people do um but it's we know it's not a good idea it's the it's the same argument and and it's getting people into parity with that mindset so I think those are the things you know patching creds management MFA um secure protocols don't put those protocols on the internet if you are using insecure protocols don't put don't point it at the internet and allow it to be access I'm glad you mentioned Showdown yeah yeah cu cu how easy is that right um it's really really trivial to just go on Showdown and find Cisco iOS boxes that are on the internet and there are many many out there um not so many in the UK I got to say I've I've done a few searches there you know but there are many overseas and those overseas ones are probably connected to organizations that might have a UK footprint you know because that's the other thing is that that might just be the Box somebody forgot that's connected to a defense contractor or a big pharmaceutical organization and that's it we're you know we're away at that point it's interesting that you mentioned the home as well because that's I kind of alluded to like that's sometimes how people get into the corporate Network same thing as like a remote office or another country right well that's it I mean if I've got your home rout then you know again especially with hybrid working and more home working these days um you know once again it's it's you're now extending that Enterprise boundary into the home and so the security needs to go with it and we know that that's going to be a less secure environment for a lot of people and we know that people are tend to be you know much more relaxed or or at least less diligent with their their home credentials and again nwork what yeah yeah absolutely and you know if you're using your home you know your your corporate laptop at home you connect it to your corporate Wi-Fi which means connected to your router which means blah blah blah you know again if your company's patching isn't up to date that's that's now a path into that organization so now you always have to temper these things though because the flip side of this is actually doing some of that is still non-trivial you know we've always got to remember that the biggest proportion of kind of criminality let's just call it criminality out there on the internet Still Remains to be cyber crime ransomware financially motivated you know the nation state stuff generally isn't financially motivated but of course by definition it then represents a much smaller portion so the likelihood of somebody going after you from a nation state point of view to Pivot through your home to get to you are they going to do that or or are they just going to go bribe the cleaner I I know what I do and I suspect you would probably do the same why would I go through all that technical heartache when all I can do is just bribe Somebody explain to me why is this suddenly being focused on is there like a catalyst that started this or is it something that you guys have been doing for a long time I mean you've kind of alluded to that but why now why are we raising a like a spotlight on this s i I think I think it's I think it's an aggregation of two or three different things things um you're right we have been doing this in my introduction I talked about the security and Trust organization so that organization the biggest part of that is our secure development life cycle so that team is responsible for in a way hardening our devices yeah so they're the ones that put in place um all of the coding guidelines to make sure we're using safe SE and and that we're putting in aslr and and nonex they do all of that now they do all of that because we know that these devices could be targeted and we've been doing that for probably 15 plus years yeah and a lot of that investment SEC boot is like the one boot the trust Anor module sign firmware images um there's also some really cool stuff to do with chip guard where we can check the identities of other as6 in the Box to make sure that they're not counterfeit and so on there's a whole raft of effort that's gone into that and part of the frustration is nine times out of 10 our customers don't even know there's a problem that we're trying to solve there yeah so this is not new from our point of view and we've known this stuff has been going around for a long time I think what is new is that we have seen two things so we saw the ncsc report on Jaguar 2 specifically Nation you know talking about nation state sponsored attacks you know that's that's a catalyst in of itself you know we look at the C current geopolitical lands slate you know we've got conflicts in in the Middle East we've got conflicts in Europe those in themselves drive a certain set of concerns and new threats so I think there's that that's an element and I think we also found in our own data on our own experiences with customers we started to discover more of this ourselves okay so we saw cases getting raised into Cisco teac investigate investigate ah this actually looks like compromised devices and you'll see that in the tals blog which I guess you'll link to uh see I'm doing your job for you thanks it's all right um but the Talos blog that that was launched around the same sort of time as Jaguar tooth um talks more broadly it talks Jaguar tooth but talks more broadly about the cases that we found ourselves and talks about the kind of you know the tradecraft and the behaviors that we've seen and so I think if you kind of put those two or three things together you get a point in time oh and I think the other thing is the criticality you know whilst You could argue that networks have been critical for a long time I think again since Co it's just escalated 100% so you kind of take all those things throw them into G it's like actually we really do need to start to do something meaningful because the market hasn't shifted we've still got customers out there that are running equipment that hasn't been patched it's got 10 year up time so nothing's going to change until we start to try and put some focus on it and actually come up with something that's sensible that people can do that isn't just go patch because go patch is there but well how do we help people get to that point how do we make it easier for people to get to that point so that requires effort on our behalf and industry's behalf as well in the same way that you saw with you know in goodness patching Windows 95 Windows 98 Windows 2000 again was a painful process um now I'm not a Windows guy but I know my Mac it patching is a relatively trivial task and certainly my I you you know my iPhone it just just happens I don't I don't need to think about it magic happens and it gets updated and I don't need to worry about it and so I think the industry part of that Coalition is how do we how do we take networks further to the toward that direction so it's you know so it's there so I think that's those are the three things that underpin why we've needed to do it now why now is a good time to be doing it how did you get to get into CSCO at 18 because that's quite a cool like thing to like we're going to come into like this at that age yeah so I was looking at appren ships in the co pandemic you can imagine how difficult that was every exactly apprenticeship I I applied for I got an email back saying we canceled our apprenticeship because of Co it was probably I probably had about two or three weeks left before all the apprentic ships closed and I just went okay and search degree apprenti ships again into Google and Cisco popped up didn't know who Cisco was clicked the link and we went from there and I remember the first kind of open interview they done and one of the things that stood out to me was just how personable they were every other company which just emails you never spoke to anyone Cisco it's people constantly speaking to you the rotational aspect really catched me because again I didn't know what I wanted to do and I needed to kind of go into a company where they allow me to make mistakes allow me to try things out and Cisco was offering that so to me it's just a no-brainer something that I wanted to get into and and just try out you didn't have to have a degree to start working here did you so do are you going to get a degree as part of this program y so I'm getting a degree in digital and Technology Solutions so kind of like an overall degree in in all it and kind of project management um which is a great thing for me no student there and get a degree and also three years experienc in massive companies so I couldn't really ask for anymore cyber you said something that you you find fascinating and you're really enjoying this and this is where you want to focus for the rest of your career perhaps yeah definitely I think SAS and cyber security especially what we do we kind of combine the both um SAS being such a new thing every company going towards wanting to be a SAS company not a hardware company anymore so that was a good thing for me because you you're in a company again where Innovation top number one and cyber security goes hand in hand with that because cyber security is a massive um priority for all companies at the moment so you combine a two of sass that's go in big places and then cybercity always go in big places you get in so much Innovation so much like har paced um environments it's it's amazing so I mean I some people would call me a boomer even though I'm not but you know there's I interview a lot of people who perhaps much further in their career but I want to get like your perspective of someone who's you know a bit younger and a lot of people watching are your age perhaps Younger what's your advice to someone of your age look out there don't just to look at the traditional Roots look what else is out there there companies like Cisco and other companies are well that do degree of friendship programs where you get to get industry experience yes theoretical experience is good and it teaches the foundations but industry experience takes it to a new level for me I now don't have that worry of trying to get into a company and and fight against people with loads of Industry experience I have that already and I also have a network I think people don't understand how big a network of people is that I can go to people call to people and say look I need help I need your advice they can give that to me and withing appren ship program you can build that network but you can also make mistakes I think when you join a company after uni you feel scared scared about making mistakes I don't feel scared about making mistakes I know I can make them and learn and innovate and I also got a network of people around me that can help me do that and kind of keep me on the right path which is the best part and it's very practical right because that's a problem a lot of people say with degrees it's very can be theoretical and you don't get the Practical experience exactly exactly so I can kind of go into any role now around cyber security and show that I've demonstrated skills of project management or technical skills in cyber security that that then employers and things like that can can kind of gross and go right he hasn't just done a degree he's also got three years since set of practical experience which is amazing for me yeah I mean would you recommend cyber then based on what you've seen to people of your age is it a good good place to be yeah 100% you look at cyber's not going away it's not an industry that's going to disappear it's going to continue it's know cyber security is one of them things where you're playing one step ahead of attackers and that will never disappear so if you want a career that's got longevity but also it's going to change and innovate and you have that space to be creative and cyber security is one in cyber or in in it we seem to be making the same mistake over and over and over are you finding that you seeing things from a different perspective perhaps to someone who's older and being in the industry longer yeah I think one of the things that I like to do is any team that I go into I like to kind of just I look at all they do and go right what can I change what can I think what do I think doesn't work anymore even for me now I've been in a position for for three years as I said I've been Cisco in three years there's probably processes that I look at that I'm just so used to yeah that I just then don't think they need changing but when you go into a new environment you got someone that's a bit more fresh and wants to be a bit creative look at those processes and go hang on that could be changed that that's probably not the way we should be doing it and just that that mindset of going into somewhere and going right what can we change what can we improve is essential for any team or any business what do you think that your generation can bring that say other Generations haven't done right one thing that we have leage yoga is that we use technology from Day Zero so we've been there and experienced it I think some older Generations is still kind of catching up to them so we can go right we can we can relate to people when people say we got this Cyber attack we're trying to put this technology it's easier for us to go and test it and go and say no that's not going to work or that might have some legs to it so I think it's just that familiarity with the technology and just the whole new um generation that's coming out that we got more experience and we just had a little bit more knowledge around that area I really hope you enjoyed this video and the interviews hope you learned about Network resilience and that this gives you the information that you need to either make changes yourself or go to leadership and get them to fund changes to your network devices and infrastructure and I hope you were inspired by the apprenticeships that Cisco have don't think that the doors are closed to you just remember that if you want a door to open you should knock on that door you should try because if you don't try you'll never know if that opportunity is there for [Music] you",
    "transcript_keywords": [
        "Cisco",
        "yeah",
        "people",
        "things",
        "cyber security",
        "problem yeah Cisco",
        "security",
        "kind",
        "nation state",
        "network",
        "thing",
        "network devices",
        "cyber",
        "cyber security point",
        "yeah yeah",
        "problem",
        "devices",
        "point",
        "nation",
        "yeah Cisco"
    ],
    "transcript_entity_values": [
        "YouTube",
        "Linux",
        "three",
        "London",
        "5 years",
        "Cisco",
        "China",
        "MFA",
        "two",
        "four",
        "iOS XE",
        "Europe",
        "SB",
        "15 years ago",
        "Telemetry",
        "Verizon",
        "second",
        "State",
        "YouTube",
        "TX",
        "Google",
        "NETCOM",
        "the next day",
        "Jaguar 2",
        "this half year",
        "Talos",
        "Ukraine",
        "Linux",
        "the past three years or so",
        "AP",
        "C2",
        "the Cisco Networking Academy",
        "Target",
        "CSCO",
        "Generations",
        "about number one",
        "Wi-Fi",
        "the end of the day",
        "Target Global Network",
        "Cisco Talos",
        "Jaguar",
        "this summer",
        "Amsterdam",
        "Mark",
        "Cisco Packet Tracer",
        "API",
        "Martin",
        "Technology Solutions",
        "SEC",
        "a thousand",
        "SAS",
        "Ireland",
        "earlier this year",
        "2017",
        "every day",
        "today",
        "Telco Network",
        "15 plus years",
        "SE",
        "XE",
        "one",
        "International Community",
        "10 year",
        "three years",
        "the Middle East",
        "SMS",
        "SNMP",
        "a day",
        "Windows",
        "day zero",
        "first",
        "UK",
        "26 years",
        "two or three",
        "IoT",
        "a few years",
        "Russia",
        "Innovation",
        "Mayhem",
        "VPN",
        "Windows 95",
        "Showdown",
        "the every morning",
        "years",
        "Simple Network Management Protocol or SNMP",
        "Achilles",
        "nine",
        "the last couple of years",
        "South Africa",
        "50 60 years ago",
        "this year",
        "TFA",
        "Enterprise",
        "a bad day",
        "two three 4 days",
        "Pegasus",
        "Mark Jackson",
        "thousand",
        "5 10 15 years",
        "NETCONF",
        "US",
        "Trot",
        "Cisco IOS",
        "10",
        "Cyber",
        "a minute",
        "many many years ago",
        "Martin Lee",
        "iOS",
        "third",
        "One",
        "James Bond",
        "Windows 98",
        "2 years or",
        "CPU",
        "zero",
        "Network",
        "an Operating System",
        "100%",
        "Packet Tracer",
        "18",
        "number one",
        "Mac",
        "the late 90s",
        "February",
        "400",
        "Cloud",
        "UK National cyber security Center",
        "Cisco",
        "Stow",
        "Two",
        "Ingress",
        "about two"
    ],
    "transcript_entity_types": [
        "GPE",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "LOC",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "GPE",
        "GPE",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "LOC",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "WORK_OF_ART",
        "TIME",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL"
    ]
}