{
    "id": "PhFwDJCEhBg",
    "title": "Google Pixel Fold Review: Maybe Next Year!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-06-26T17:01:16Z",
    "video_url": "https://www.youtube.com/watch?v=PhFwDJCEhBg",
    "category": "Science & Technology",
    "tags": [
        "Pixel Fold",
        "Google Pixel Fold",
        "MKBHD",
        "pixel fold review",
        "Pixel Fold review",
        "Google Pixel Fold review",
        "Pixel Fold price",
        "Pixel fold updates",
        "Pixel fold cameras",
        "folding pixel",
        "folding android",
        "Android 14",
        "rese침a del pixel fold",
        "rese침a del Pixel Fold",
        "rese침a del Google Pixel Fold",
        "precio del Pixel Fold",
        "actualizaciones del Pixel Fold",
        "c치maras del Pixel Fold",
        "pixel plegable",
        "android plegable"
    ],
    "views": 3305874,
    "likes": 87632,
    "comments_count": 4115,
    "description": "Pixel Fold is pretty sweet and I'm loving it. But it's also $1800 and has a real set of flaws.  Get a Robot City skin at  MKBHD Merch:   Tech I'm using right now:   Intro Track: Jordyn Edmonds  Playlist of MKBHD Intro music:   Phone provided by Google for review.  ~",
    "description_links": [
        "https://dbrand.com/shop/robot-city",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://lnk.to/jordynedmonds",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - Hey, what's up? MKBHD here. Yo, the Pixel Fold is a weird phone. There are so many things about this thing that are unusual. So I, and many other people, have been waiting for a folding Pixel. This is something we imagined was coming eventually, so it is kind of surreal to actually be holding and have been using and testing this phone. I've been using it for about a week now, and boy, do I have a lot of thoughts. So I guess, let's just start with the design. I really like a lot of the decisions they've made with this foldable, which really optimized far towards it being thin and passport-shaped. Originally, when I first got to play with it, I was saying, \"Man, this could be the best foldable to use while closed,\" and I do now stand by that take. It's the easiest, best foldable to use when it's closed. But unfortunately, it does have a much lower ranking for using it while open. So the front screen is 5.8 inches diagonally. It's got these curved edges you can see, and it's actually fairly thin bezels all the way around, the rails all the way around the phone itself, and the hinge are stainless steel, and the whole thing is relatively thin. It's just bordering on a little bit thicker than the thickest normal phone you can get. I think the number is 12 millimeters total. You can see there's no air gap in the middle. So honestly, yeah, I've spent a lot of time using the outside screen like a normal phone and it's just the most reachable, usable outside screen of any folding phone. You unlock it with the fingerprint reader on the side, which is also the power button, and it's pretty quick. This is a 120-hertz OLED display that gets up to 1,550 nits peak brightness, so it's plenty visible outside. It looks really good to me in most situations. I mean, I'm impressed. This is a premium outside display, which I mean, I guess, I should be for $1,800, but we'll get to the price a little bit later. The point is, though, I've always said the best foldables have to be usable as just a regular phone too, and this one does accomplish that. Great. So then, you open up the phone, and then that's when things start to get a little more weird. So you can't exactly open this phone with one hand. I've definitely tried. I kind of try this with every foldable. Some are easier than others. This one's pretty much a no-go. But once you get it open, when you're in there, you're greeted with an interior 7.6-inch, folding AMOLED display, also 120 hertz and also plenty bright, up to 1,450 nits. A really nice size. It's reminiscent of that OPPO Find N2 foldable. But there are a couple of things to note. Here's where some of the weird starts. So first of all, the crease is pretty average. It's definitely not dramatically worse than others I've seen, but you can, for sure, see it if you're looking for it and you can kind of feel it. But because it's through the middle of the screen, you aren't usually running your finger over it, unlike the vertically-folding phones. So it's not really a big deal. It's easy to disappear to your eyes as you just look at content and use it normally. But then, there was just some talk about how it didn't seem like the phone fully unfolds to 180 degrees. And well, I don't know. This hinge is really firm, so you can fold it up halfway or any angle you want really easily, which is awesome. But then, when you fold it flat, visually, it looks pretty flat, but when you put it on a table, since there's a camera bump, it becomes more clear as it's rocking back and forth. It's maybe one or two degrees short of flat. It's kind of weird. I mean, you can force it to get to flat, or even a little bit past that, but it really doesn't feel good to do that. Anyway, then, there is the bezel. As you've probably seen by now, this phone does have a slightly bigger top and bottom bezel than some other folding phones. It is noticeable at first when you just look at the bezels. But again, it's one of those things where you start using the phone and it is easy to forget about. I think a lot of videos are gonna hold it up side by side next to the Samsung Fold, and then it's like, \"Oh, yeah, clearly one of them has a dramatically thinner bezel and it is really noticeable.\" But just using the phone, it looks fine. And Google actually says that this was an intentional decision. So what they were saying is they were, again, biasing so much towards it being thin that, for some of the hinge components, they move them out and above and below the hinge instead of in that Z-axis space, so that it could be as thin as it is, but now you end up with a little bit of extra bezel above and below the screen. But it did allow them room to put in a real webcam, or selfie camera, instead of a under-display one. But also, I think this is a little bit along the lines of Google... The Pixel has never really been all about pristine, super highly-engineered, amazing hardware. They've sort of flexed their strengths on the software side, and I think there's a little bit of that here too. Either way, you can check the box of IPX8 water resistance, which is nice. I do really like this satin finish on the back, which does a good job of minimizing fingerprints and looks pretty good, and the camera bump doesn't go all the way to the very edges to meet the rails of the phone. That would've been tough with the foldable, but I do still think they did a good job of maintaining the whole Pixel aesthetic. Performance is weirdly good. It's really, really good. It's actually the best of any Pixel phone, even though it's using the same chip. It's the Tensor G2 from the Pixel 7 and 7 Pro, but it feels smoother and faster and more consistent than the Pixel 7 and 7 Pro. So maybe, it could be that 12 gigs of RAM that are in here. It also has 256 or 512 gigs of UFS 3.1 storage. But it's been butter the whole time. I am very happy to report. Now, it's still a Pixel, so I have to add the disclaimer that it might not stay this way. Pixels have a history of this accelerated aging, which is even more of a bummer when you pay this much for a phone, but I can't report on that until we actually get to a year from now. So the best I can do is tell you how it's acting now, and it is acting great. The other thing, though, that I am kind of actually hoping changes over time is the battery life. Because the battery life in this week that I've been testing the phone has not been great. Usually, actually, I can kind of just throw away the first day or two of me testing this phone, because I'm still setting it up, still connecting everything and getting it working properly. And then, I can start looking at the numbers. But basically, every day since I first got this phone, I've kind of had the same experience which is not that great. Four hours of screen on-time at the end of my day, which is not nearly as high as some of the flagships out there. It is a 4,800 mAh power battery, which is really good for a foldable but not gigantic for a giant screen on the inside. So Pixels have this feature called adaptive battery, and sometimes they can get a little bit better over time, depends on your use, depends on who you are. Your mileage may vary. But I would say this is C+ battery life. And the more I think about it, I've been using a lot of the phone wall closed which means it's the smaller outside screen. And so, if I had been using the larger inside screen even more, it would not have gone better. So yeah, C, C+ for battery. But I wanna talk about the software experience here, because it is a Pixel, after all. And there is one weird thing. So this was a very interesting phone to test, because Google had to do a lot of software work and I was excited to try all of it. Google's apps are all these beautiful, tablet-optimized apps now. They're so thoughtfully designed for the phone with this size screen. They all look normal on the outside screen. But on the inside, Google Drive has this nice slide-out sidebar and multi-column view. Gmail's new multi column view is great. The new weather app is absolutely fantastic. Google Calendar is completely redesigned. There's just so much good stuff. And then , the new dock sort of ties it all together. So this dock I talked about on the Pixel tablet, you swipe up slightly from the bottom and the home bar turns into your home screen dock. So this is the apps that you have on the bottom of your home screen, and you can quickly switch between these apps or launch into multitasking super easily. So just like the other folding phones, I feel like a multitasking god when I'm using this huge folding phone open and just typing away. But here is the weird part, as far as I can remember, every other foldable phone allows you to set up the home screens and stuff on the outside screen, and then the inside screen is separate. You can have a separate set of widgets. You can go crazy and make a different layout on the inside here. And on this phone, you cannot do that. So look, right now, my outside screen is these three pages: this one with the icons and the weather, and then this calendar widget one, and then this third one. So when I open up the phone, that's exactly mirrored here. The left one is the first home screen, then the right one is the second one, and I swipe over and here's the third one. But if I take this raindrop icon and move it over here, and then when I go back to closed, it's also moved the raindrop icon there because it's keeping them exactly mirrored at all times, which is fine. I think that actually makes a lot of sense, especially for beginners. I bet, if Apple made a folding iPhone right now, they would do the exact same thing, 'cause iPhone users are used to not having a ton of customization on their home screens. But I haven't found a way to unlock that at all. I haven't seen any home screen setting or display setting to actually be able to set up a different home screen on the inside versus the outside. It just feels kind of un-Android-like to me. I feel like I can't be the only one who's spending $1,800 on a 1st gen folding phone who would like to have some apps on the outside screen and a bunch of widgets on the inside screen. You actually can't even span the middle with one widget because it's treating them, basically, as two separate home screens, even though it's all with one big folding screen. I just found that so weird. So anyway, aside from that, I really enjoyed using the Pixel Fold, seriously. Between the great performance and the Google software, all the Pixel stuff, Google Assistant, call screening, et cetera. It's really easy to get past the weirdness. The other thing you typically expect out of a Pixel, though, is good cameras. So let's talk about this camera situation for a little bit, because as I've said, everywhere you look there's just a little bit of weird. So first of all, actually, there are five cameras on this phone. There is the nine-megapixel hole-punch camera on the front, on the outside screen. Then, there's an eight-megapixel camera on the inside, up in that bezel. Then, there's the three primary cameras on the back. The thing with these back cameras is, because of how thin the phone is, there's definitely not enough room to physically fit the same size sensors and optics that you have in the flagship Pixel phone. So there is all new stuff here and it's a little bit smaller. So there's a 48-megapixel main camera, a 10-megapixel ultra-wide, and a 10-megapixel 5x telephoto. Pixel Fold photos feel a lot like Pixel 7a photos, which isn't an insult. That's just to say that they're in the same style, the same contrast-y, Pixel style, but overall, are definitely a step down in quality from the flagships. They're a bit noisier, a bit more muted in the colors, especially with the ultra-wide. And it takes a bit longer to gather the same amount of light as the larger flagship sensors. Also, if you wanna see video from the Pixel Fold, I actually shot the entire last auto-focus video on the Pixel Fold. So you can clearly see it's a step down from some of the other flagships I've shot with. There's a lot of noise in the darker areas of the frame. But I will say, it was definitely easier to shoot with, because it's a folding phone so I can just just unfold it, and I see the viewfinder and I can frame things up with the primary camera. So that's an advantage. But it's not like you're gonna go out and shoot movies on this thing. I mean, Samsung has had to deal with the same type of thing. The camera quality of their super expensive foldable phones has always been a slight step down from their big flagship, slab-style phones. So I think that's a fair comparison. This is a step, it's a notch down from the Pixel flagship cameras. You know what's fun? This is technically a 1st gen device, right? This is the first time Google's ever made a foldable. And on one hand, you can kind of tell that they've, at least, learned some things from the other foldables already out there 'cause this feels a little bit better in some ways. They've gone with this passport-sized form factor, and they've made conscious decisions to make it thin, and there's some hinge innovation here and it's kept the Pixel aesthetic, just a lot of good choices that are impressive for a 1st gen device. But it still, clearly, has some 1st gen shortcomings also, that have me thinking, \"Well, maybe, the next one will be better. For the inside display, the crease and the bezels, and the 178-degree almost-flat fold, meh, maybe the next one will be better. For the weak battery life, yes, there is wireless charging, but hey, maybe the next one will have faster charging than the current max of 30 watts. And of course, the app situation is still, let's just say, it's clearly imperfect, so they've done a lot of good stuff with their software but some apps still look horrible. I mean, look at Instagram. It looks terrible. You can double-tap to the left or to the right to move it over closer to the side where it's more reachable, but still, I mean, that is rough. Twitter also looks horrible. My golf app, 18Birdies, also not optimized. Even YouTube Studio is just not optimized for this bigger screen. And the list goes on and on and on. Maybe, maybe that'll be better by the next one. So then, the last weird thing about this phone is it is $1,800. So of course, that prices out pretty much anyone who's just gonna walk into a store casually and just get a normal upgrade for their phone. It will be relegated to the early adopters, the enthusiasts, maybe people watching this video, and the Pixel fans. It's a smaller group. But also, I gotta say, weirdly enough, I really like using this phone. I love using this phone. It's got just the right set of quirks and features that I like it over the regular Pixel, which I had been using. And also, I think, it's specifically, because it's so well-optimized for using it closed, I keep talking about how it's the best foldable to use closed, it's got the right set of strengths and weaknesses that I spend most of my time just enjoying using it like a normal phone, closed, And then, every once in a while, my 20, 30, 40% of the time that I open it up and use it, it's just this whole new world and it's a nice benefit. It's getting closer to that ideal folding phone for me. I really like it. It's also Android 14 coming up soon, five years of promised security updates, great haptics, great speakers. I mean, it's got just enough upside that I really like it. I'm sure I'm looking forward to the next one, still, of course. But for anyone else who's gonna jump in on this 1st gen version, just know what you're getting into. It's a weird one, but I like it. Also, you might have spotted a few designs from the channel sponsor dbrand a few times in this video. This new one, it's called \"Robot City\", and I think it's pretty sick. It's one of my favorite designs they've released yet. It helps a lot also on a phone that's as monotonous as the Pixel Fold. So these sort of designs have kind of become a staple of dbrand over the years. I don't know if you remember the hairdryer that's been in the studio, which was wrapped in the original \"Robot\" skin. So this new one, \"Robot City\", if you can look closely, you'll see that, actually, there are three different versions that you can choose from that are all these unique, discrete pieces of art. First one is called \"Dead Quarters\", kind of like a dystopian headquarters of Robot City. The second one is \"Abusement Park\", complete with sharks and krakens and doomed carnival rides. And the third one really hits home for me. It's called \"Crime Square\", like Times Square but with crime. There are so many Easter eggs in them. It's silly. So if you wanna check them out, the \"Robot City\" skins are available on over 100 devices, including the Pixel Folds. If you wanna check them out, I'll have a link down below in the description. Either way, that's been it. (phone claps) Till the next one. Thanks for watching. Catch you later. Peace. (upbeat music)",
    "transcript_keywords": [
        "phone",
        "Pixel",
        "Pixel Fold",
        "screen",
        "Pixel phone",
        "folding phone",
        "flagship Pixel phone",
        "bit",
        "Fold",
        "home screen",
        "Google",
        "good",
        "lot",
        "foldable",
        "thing",
        "kind",
        "folding",
        "Robot City",
        "phones",
        "camera"
    ],
    "transcript_entity_values": [
        "about a week",
        "Apple",
        "the first day",
        "1,450",
        "the years",
        "5.8 inches",
        "first",
        "the Pixel Fold",
        "First",
        "iPhone",
        "five years",
        "Samsung",
        "120",
        "eight-megapixel",
        "Gmail",
        "the Pixel Fold",
        "one",
        "Robot City\"",
        "48-megapixel",
        "third",
        "the Pixel Fold",
        "UFS 3.1",
        "Robot City",
        "Yo",
        "the next one",
        "4,800",
        "30 watts",
        "30",
        "two degrees",
        "un-Android",
        "a year from now",
        "Twitter",
        "1st",
        "two",
        "Google Calendar",
        "5x",
        "three",
        "IPX8",
        "Times Square",
        "Easter",
        "7a",
        "the end of my day",
        "Four hours",
        "Android",
        "10-megapixel",
        "over 100",
        "OPPO",
        "the Pixel Folds",
        "Pixel",
        "14",
        "40%",
        "the Samsung Fold",
        "second",
        "180 degrees",
        "RAM",
        "7.6-inch",
        "Dead Quarters",
        "this 1st",
        "178-degree",
        "1,800",
        "512",
        "the Pixel 7 and",
        "256",
        "12",
        "Pixel",
        "20",
        "Robot",
        "five",
        "Crime Square",
        "this week",
        "1,550",
        "Google",
        "12 millimeters",
        "the Tensor G2",
        "Google Drive",
        "nine-megapixel",
        "Instagram",
        "YouTube Studio",
        "a ton"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "FAC",
        "CARDINAL",
        "WORK_OF_ART",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "GPE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "FAC",
        "GPE",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "LOC",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "FAC",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY"
    ]
}