{
    "id": "piS3GhE6jJw",
    "title": "Is Samsung too LATE?!? - Galaxy S21 FE",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-01-17T20:40:16Z",
    "video_url": "https://www.youtube.com/watch?v=piS3GhE6jJw",
    "category": "Science & Technology",
    "tags": [
        "Samsung",
        "S21",
        "Fe",
        "FE",
        "Fan Edition",
        "Smartphone",
        "Mobile",
        "Mobile Devices",
        "Devices",
        "Display",
        "Affordable",
        "Flagship",
        "120hz",
        "Battery",
        "Cheaper",
        "Performance",
        "Specs",
        "Why did Samsung release the S21 FE?",
        "Should Samsung scraped the S21 FE?",
        "Why release the S21 FE with S22 around the corner"
    ],
    "views": 526167,
    "likes": 21325,
    "comments_count": 956,
    "description": "Don't click on our link and buy stuff from dbrand at   Samsung made an interesting move and released the S21 FE now even though the S22 is rumored to be announced within a couple of months. Is Samsung too late with this smartphone?  Buy Samsung S21 FE 5G   Amazon:    Best Buy:    Newegg:   Buy Google Pixel 6   Amazon:    Best Buy:    Newegg:   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - Do it for the views! 0:17 - S21 FE overview and unboxing 1:50 - Physical impressions 2:37 - Specs 3:58 - Pixel 6 vs S21 FE impressions 5:15  - Camera impressions 5:58 - Object eraser impressions 7:30  - Sponsor - dbrand! 8:10 - Camera impressions continued 9:52 - Battery specs 10:03 - Budget/Value Flagship phone thoughts 10:44 - Speaker impressions 11:15 - Outro",
    "description_links": [
        "https://dbrand.com/shortlinus",
        "https://lmg.gg/grNej",
        "https://geni.us/lYHGZaf",
        "https://geni.us/w0Xc0M7",
        "https://geni.us/TFh8Kgu",
        "https://geni.us/B3vomZ",
        "https://geni.us/NWDdX",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Do you want me to (beep) on this phone? What is gonna get us the most clicks? I wanna do whatever gets us the most clicks. (Jono laughing) (sultry music) This isn't the real box. - [Jono] Yeah, that's all they had. - Is this a joke? - [Jono] That's all they had! - I'm a professional video host. - [Jono] Engineering sample! - We're about to get the Galaxy S22, if all the rumors are right, in a short amount of time. Here we have Samsung launching the Galaxy S21 FE, which stands for Fan Edition. - [Jono] Yeah, or founders edition. - Well, it's not founders edition because you're already almost a year late. And this is their shtick now, I guess what they do, right? They release the main phone and then they release an FE version of the phone, which is like a little bit stripped down, but cheaper. And is that, oh, new colors. Oh, the colors. I see them now. Oh, that one's really good. Yeah, so the Galaxy S21, in case you were wondering, Jono, I'll let you know it's 699 for the 128 gig version, which is $100 more expensive than the Pixel 6. This thing starts at 599 and this thing starts at 699, and so that's why we're gonna be kind of looking and comparing them a little bit. - [Man] It's recycling. - I do not feel respected in this moment right now. This is not the true unboxing experience I was anticipating when you asked me if I wanted to host this video. And I come on here, bubble wrap? On the plus side, I think this is actually what comes in the real box, basically. You might have some like documentation and stuff. So it comes with a USB-C to C cable and a whatever, SIM ejector thing. And no power plug, no wall plug. And here comes the S21 FE 5G, oh me oh my. Olive is the color. Is that what that is? - [Jono] Yeah. - I am not usually someone to actually care at all about the aesthetics of a phone, but I like this color. It's plastic, but it's got this sort of like, like there's a bit of like a shadow too. Like it looks like the logo on the back is sort of raised a little bit above through like using some clear acetate or something. I don't know. I don't know materials, but it looks cool. We have the power button and a volume rocker I'm assuming. On the bottom, we got a USB-C type C port and one speaker grill. Disappointing a little bit, but it's the FE edition. It looks kind of like an iPhone with the metal ring on the outside and the bands. Okay, so we got the hole punch situation going on. Okay, so 6.4\" display, 120-hertz refresh rate, which I believe is the same as the Pixel 6 in terms of the size anyway. This Pixel 6 has a 90-hertz display. OLED versus AMOLED. It's kind of interesting, the more budget friendly options that aren't the, these companies are now putting out are like this is the more budget friendly one, it's got 120-hertz display. That was on the flagships a few years back. Nice job. It's also got a Snapdragon 888, so it's got that flagship power, at least until the Snapdragon 8 Gen 1s start showing up. Six gigs of RAM by default, which is okay in these days. 128 gigs of storage at the 599, at the 699 price point and then it goes up to 769 if you go for the 256 gig option. On the back, we got three cameras. One's a 12 megapixel primary, then there's a 12 megapixel ultra wide and an eight megapixel telephoto. Apparently this thing can go 30 times combined digital and real zoom. 30 times is okay, you don't need more than that. On the front camera, you got a 32 megapixel. It's got an IP68 water dust resistance rating. It does have 5G, which I guess is just the default now. And that's about it for the regular specs. For me, the immediate comparison is going to be, as I said, with the Pixel 6. I'm generally a fan of the Pixel line. The Pixel 6 is a little bit bigger, but they're supposed to have the same size screen, 6.4\". Google's whole like selling point is that it's a Google phone, right? They have their Pixel exclusive features. It gets Android updates first. You know, they got their Tensor chip on here now, they're custom made with the good AI stuff. You know that good AI stuff. They got Magic Eraser on the Pixel 6. They got the Face Unblur. But the thing is that Samsung is not just another Android manufacturer. They have their own One UI custom variant of Android. I mean like when you go to their settings, it almost seems like a completely different operating system compared to the Pixel operating system. They both have advantages over the other, but this one's $100 cheaper. Thankfully, Samsung knew that launching the S21 FE a month before the S22 is going to be, is kind of sketchy, maybe they're not gonna sell as much, so Amazon was giving you a $100 gift card if you, I think they're done with that now. To be fair, Jono- - [Jono] You can go on Samsung's website and get a Samsung $100 credit. - Oh, what? - [Jono] Yeah. - Let's take a look at the camera, why don't we? Because that's probably one of the most important things. There you are. Oh, beautiful. Oh, that was pretty good. You're looking pretty nice, Jono. - Thanks, man. - You're looking crisp, bro. Okay, that was just like a regular rear photo, but which, oh, okay. So I got the ultra wide. Whoa. - [Jono] You can't call me fat. - 0.5 times, one times, three times. This is the eight millimeter telephoto. Wow, the stabilization. Stabilization is really good. Now I'm on the 30 times zoom. Stop moving. Stop. There he is. (laughs) I have located the Object Eraser feature, which was the star of the show of my Google Pixel 6 Pro ShortCircuit unboxing. And I wanna try it out. Object Eraser, it's got an N there 'cause it's new. Okay, so just like on Pixel, we can just tap or draw around anything you wanna erase. Get rid of that chair. Get rid of that chair, get out of here. Erase. That is pretty good. Dang, Google, watch out. What about this shelf? I wants the whole shelf. Get rid of it. Hmm, it's pretty ugly. We can bring up, oh, that was pretty good. We can bring up the comparison from the Pixel 6 Pro video and put it next to each other. But this is a battle of the content and ware fills on phones. I'm pretty impressed, but it's a Snapdragon 888. Because part of the reason Google said that their phone could do this fancy new AI stuff with the Magic Eraser is what they called it and the Face Unblur and stuff is because they were like harnessing the power of their new custom made Google Tensor chip, which is based on a Samsung processor. From what we hear. But here we have Samsung using a Qualcomm Snapdragon 888 to achieve very similar results. I mean, it's a little different. Put them up side by side, I don't remember what it looks like, but that's pretty good. Did this just get scratched? Oh, is that? Wait, is this a screen protector? - Yeah, that's a screen protector. - Oh. Oh man, you don't want that to happen to your phone. So I guess you should get protective things from dbrand. - [Jono] Our sponsor. - Our sponsor, but not if you're buying the S21 FE because dbrand's not supporting it because they think that this phone is dumb, which is fair enough. (laughs) But if you have other types of phones, dbrand has some good skins, I guess, do they even care about me saying that? - No, just don't buy- - They got cases, they got screen protectors, they got skins. Go to dbrand and get your stuff or don't. It seems like they don't really care. - [Jono] The leather is pretty sweet though. - The dbrand leather? dbrand has leather apparently, I'm being told. dbrand, get a thing on your phone made from a dead animal. So now our Pixel 6 is charged. Thank you so much, Jono. And I'm gonna check out the camera. Oh man, I feel like I'm really softened more on the Pixel instead of the, and less on the Samsung for some reason. I expected it to be the opposite. Okay, so this is an interesting benefit. If you're into selfies more, if you're doing TikToks and looking at your face a lot, 'cause you're a narcissistic piece of, you might want the S21 FE. It's got a 32-megapixel selfie camera. And I'm guessing this is something like 8 megapixels, maybe 12? It's a lot blurrier and that's super obvious. Let's take one of these. Oh, we got a little bit less visual noise on the S21 than the Pixel 6 in the dark areas of the photo. Although it does seem like things are a little bit more, the brightness is up on the S21, but we got a little bit more color saturation on the Pixel 6. I mean, they're both great cameras and great photos. And at the end of the day, we're really nitpicking here. But I don't know. The point being that there's not a clear winner. It's not like I can look at one of these and be like, \"Haha, this thing's a piece of crap. No one should get it.\" And same thing for this one. I think there are pros and cons. If you're into the Google ecosystem, if you're in into the Pixels, the Pixel 6 might have some, especially with the Tensor stuff. I don't know, are they gonna add more AI stuff? AI is a cool buzz word and that's not to be discounted. Whereas on the Samsung side, I mean, if you're kind of tired of Google slowly adding the features that other Android manufacturers have put in their phones already for years, then you might wanna go with a Samsung because, or with another manufacturer because they have their own features like the Object Eraser, which we took a look at. 4,500 milliamp-hour battery is a little bit bigger than the regular one in the S21. The Pixel 6 has like a 4,600 milliamp-hour battery. But you know, it's around the same. It depends on how the software is gonna do. I think the moral of this story really that I wanna tell though is that the landscape of budget slash value flagship phones is pretty good right now. I mean, we were in a dark spot there where literally every phone that people wanted to buy was like going for near $1,000. And now Google came back to the light with the Pixel 6, they priced it at 599. And then if you wanted something fancy, you'd go for the Pixel 6 Pro, which is like 999, 899? Whatever, it's more expensive. And Samsung has seen the light once again. They're doing another fan addition of the phone, so it's cool. You know, you don't have to buy a $1,200 phone if you don't want to. All right, one last thing we gotta look at is the speakers. (bright music) - [Jono] I like that better. - I don't know, one doesn't sound particularly worse than the other to me, they just sound like a little different. This one has a little, there's a little bit of mids missing from this maybe. And like, you kind of hear it. This is a bit more fleshed out. Either way, they're fine. (laughs) Buy yourself a phone and subscribe to ShortCircuit, the YouTube channel. But more importantly, don't forget about TechLinked.",
    "transcript_keywords": [
        "Pixel",
        "Samsung",
        "phone",
        "bit",
        "Google",
        "good",
        "thing",
        "pretty good",
        "Google Pixel",
        "pretty",
        "stuff",
        "Object Eraser",
        "Eraser",
        "Yeah",
        "dbrand",
        "times",
        "kind",
        "phones",
        "Jono",
        "Android"
    ],
    "transcript_entity_values": [
        "Fan Edition",
        "0.5",
        "6",
        "Six",
        "the Face Unblur",
        "888",
        "599",
        "699",
        "Qualcomm",
        "32-megapixel",
        "three",
        "999",
        "6.4",
        "RAM",
        "One",
        "almost a year late",
        "dbrand",
        "one",
        "Pixels",
        "USB",
        "4,500 milliamp-hour",
        "90",
        "iPhone",
        "12 megapixel",
        "Google",
        "the Galaxy S21",
        "Pixel",
        "Amazon",
        "the Magic Eraser",
        "1,200",
        "AI",
        "4,600 milliamp-hour",
        "S21 FE 5",
        "FE",
        "32 megapixel",
        "Samsung",
        "128",
        "Jono",
        "S21",
        "1,000",
        "Google Tensor",
        "S21",
        "100",
        "256",
        "the S21 FE",
        "first",
        "Google Pixel 6",
        "these days",
        "Magic Eraser",
        "120",
        "the eight millimeter",
        "Android",
        "the Object Eraser",
        "TechLinked",
        "AMOLED",
        "a few years back",
        "30",
        "769",
        "S21 FE",
        "the Galaxy S22",
        "The Pixel 6",
        "Pixel",
        "the end of the day",
        "8 megapixels",
        "12",
        "ShortCircuit",
        "the Galaxy S21 FE",
        "YouTube",
        "years",
        "eight megapixel",
        "Tensor",
        "5",
        "UI"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}