{
    "id": "pIT-yy17aCU",
    "title": "Why YOU hate the PS5 Controller (and other new things)",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-05-09T18:01:26Z",
    "video_url": "https://www.youtube.com/watch?v=pIT-yy17aCU",
    "category": "Science & Technology",
    "tags": [
        "ps5",
        "ps5 controller",
        "dualsense",
        "tech",
        "sony",
        "microsoft",
        "apple",
        "xbox",
        "playstation",
        "ipod",
        "mac",
        "macintosh",
        "1984 macintosh",
        "react",
        "console",
        "game console",
        "playstation 5",
        "the test drivers",
        "test drivers",
        "this is",
        "austin evans"
    ],
    "views": 717587,
    "likes": 28344,
    "comments_count": 4887,
    "description": "Were all wrong about tech sometimes. Watch me react to my OLD videos   My original PS5 controller video   People were wrong about the PS5 controller, the Macintosh Mouse, the iPod, the Xbox One, and a lot of other stuff.  My new podcast The Test Drivers!  Our second channel @thisis!  I stream on Twitch now!  We have a new Discord:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/1EpN91z1OeI",
        "https://youtu.be/MuEVSZYtDl4",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "https://discord.gg/sQ8Sw27",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "(upbeat music) - When anything new comes out, especially in the tech space I think the knee-jerk reaction is certainly to not like it. But I think ultimately the real test is the test of time. How well do you look back on a piece of technology after you've used it for a couple of months or a couple of years, or a couple of decades? (bright music) I have been wrong a lot. (bell chimes) So the nature of technology is it always is evolving, it's always changing, and generally speaking, that's a good thing, right? However, generally speaking, as humans, we don't like change. I like a better version of the thing I have right now but when I don't like even something as simple as the look of that new thing, often times people's reaction is, \"Argh, I don't want that, \"that's new, that's weird that's different.\" But at the end of the day, technology is always evolving and if you try to fight that you're gonna be on the wrong side of history. And believe me when I say I've been wrong many, many times. So as I'm excited to announce I will be moving all of my video content over to Myspace. The perfect example of this is the PS5 controller. So when I first saw the dual the DualSense and made my video, in the span of a couple of hours, my opinions started to evolve, right. I mean, yeah, for sure, at first I was like, \"Ah, this thing is super ugly.\" And, of course, the internet does what the internet does best, take a very in-depth, careful look at the deeply important and well thought out aesthetics of the Play Station 5 DualSense controller. Yeah. But, the thing is the first impressions are very rarely the final impressions that anyone lands on. Sure, if something is horrifically ugly, you're probably gonna think it's horrifically ugly for a while. But the problem is, is that we get so used to change and we get so used to years down the line of, \"Wait, people didn't like that at the beginning, really?\" It's weird right that I can't quite put my finger on why I feel like the DualSense looks odd and I still feel like this. My first impression was like, \"Argh.\" I mean, sure, it's nice, it has all these cool new features and blah, blah and I'm sure as I use it I'll be like, \"Oh, this is great, I love it way more than the Xbox.\" But Sony have pretty much thrown out the playbook and completely designed something different here. There've been many, many examples of technology that, sure, nowadays we look back and thing very fondly of, like, \"This was revolutionary, this was amazing. \"This is something that was a real game-changer.\" When it first came out, between the design, between the functionality, people straight up hated it. So I've actually never used one of the original Macs before, Macintoshes, Mac, Mac, just Macs, Macintoshes? What's the singular? It's the first one, so that. It truly is one of the most important computers of all time, it also was a computer that a lot of people absolutely hated when it first came out. And a big reason for that is this, this little invention called the mouse. Now, while the Macintosh was certainly not the very first computer to ship with a mouse, it was one of the first computers to heavily take advantage of it throughout the interface. And if I may read a quote here from John C Dvorak for \"The San Francisco Examiner\", \"Apple makes the arrogant assumption \"of thinking that it knows what you want and need. \"It, unfortunately, leaves the \"why\" out of the equation- \"as in, \"Why would I want this?\". \"The Macintosh uses an experimental pointing device \"called a \"mouse\". \"There is no evidence that people want to use these things, \"I don't want to use one of these new fangled devices.\" So, as you can see, a glowing reception for the revolutionary new interface known as the mouse back in 1984. So why don't we pull some Marty McFly action and put myself back in this time period and see, really, how far this computer has come and how well it's aged 35 years, 36 years later. So. (quirky music) I know how to turn this on, I'm sure it's very simple. It's... No. If I was a power button, where would I be? I mean, you wouldn't put a power button on the back, would you? (bell chimes) That would be a silly thing to do. So this is embarrassing, I didn't think it would be that difficult. How do you operate a Macintosh? Wow, there's a manual to how to use the manual. Ah, there's a switch on the back! So cut right here, so we're just gonna make it look like I knew all of that and then we just cut straight into it. Look, I figured out how to do it on my first try. You can do all your work on Macintosh, except type text and numbers with five mouse techniques. I like how they had to specifically point out that you can't type text and numbers with the mouse, these were very different times. Click, press, drag, double click and shift click. I'm actually impressed that shift click was a thing even in 1984, so if I wanna do something, I'll click and then I'll hover over something and then release. Oh, wait for it. The Macintosh finder, version 1.1 1984 Apple computer. This is a good example of something that, because it was so ahead of its time, became the standard and then 30 something years later, it feels natural to use, right. But, people back, when this first came out, were very, very much not on board because it was something so different, right. I mean, you have to consider this is back in the days when an operating system looked like this. - Global thermonuclear war. - Now like this. And I think it's interesting to think about just how far something can evolve based on how it changes the future technology that we all get used to, right. Yeah, this thing may have seemed crazy with it's expensive price tag and it's weird mouse interface that Steve Jobs forces you to use but, ultimately, it was the better way of using a computer and therefore everything since then has been influenced by this computer in one way or another. Thankfully, everyone has learned from their mistakes and no one has ever criticized a brand new, revolutionary end port device again. - And it doesn't appeal to business customers because it doesn't have a keyboard, which makes it not a very good email machine. - Something that I think is really easy to forget is that there are huge teams of people who design all aspects of the tech that we use on regular basis, right. That PS5 controller probably has dozens, if not 100s of people on the team, there're many reasons for each and every individual decision of why it had to be this shape, why they had to fit this component inside, ultimately, what they wanted it to look like, right. And while, yes, it's easy for me to make a video and say haha, looks dumb or someone to make a meme of, \"Oh, look, it looks like it's in a tank top.\" But there's ultimately a lot more work that goes into these things. And while there's certainly nothing wrong with criticism, it's certainly not even balance, right. It's easy to make a quick joke about something, throw it up on Twitter to get a ton of likes, but it's a lot harder to actually make something. Xbox certainly isn't immune to the criticism that Sony's been receiving on the DualSense controller. I mean, sure, when the Xbox Series X was first revealed everyone was like, \"Yoh, is that a refrigerator?\" And I personally think that Dave probably had it best but, like with all of these things, and especially with the Series X 'cause we've actually seen it for quite a while and we've actually done hands on stuff with it, you pretty quickly get used to it. Yes, it's a little bit of a different shape, but you know what? Maybe all consoles will be vertical in a couple of years. And there are certainly reasons why that makes sense for heat, all of that kind of stuff, it's one of the things that we've already started to get used to. And when you look back at some of the older consoles, like the Xbox One, well, people, really, really didn't like that one. And I guess, over time I feel like the Xbox One design has certainly grown on me. But, well, the internet remembers all and I have some wonderful comments about how much people really liked the Xbox One design. \"I don't understand how people are liking this design. \"It's HORRID. It looks like an old VCR player \"or one of those really old massive boxy Motorola PVRs. \"And the whole Checkers look, \"with black and white patterns? \"It's one of the worst designs I think I've ever seen \"for a new piece of tech. \"The thing is bigger than the original Xbox.\" Argh. Argh. Honestly, you could probably swap out the word Xbox for PS5 and a lot of this stuff would definitely apply. For example, \"No it's repulsive. \"I get it, it just looks like a badly made fan mock up \"that was accidentally selected in an email \"asking which design would be bet. \"It belongs in a bad anime '80s design inspired pipe dream.\" (laughs) Look man, people are salty about change. Now, there's nothing wrong with being salty about something being different. And there's certainly designs that have aged better than others, but at the end of the day, I guarantee you that no one looks back at the Xbox One and goes, \"Oh, I can't believe that was so horrible.\" Everyone's just like, \"Oh yeah, it was a little bit big. \"Oh yeah, the glossy plastic didn't look great, \"but who cares?\" And this too shall pass. The thing is people don't understand what's important, what's revolutionary, what changes the way that we use technology until you have the benefit of hindsight. And I think a great example of this is the original iPod. When this thing first came out, surprise, surprise, people weren't thrilled about an incredibly expensive mp3 player that only worked with Macs. But, well, it turned out to be a bit of a big deal. You can trace a pretty much direct path from the launch of the original iPod in 2001 to where Apple is today. iPhone, absolutely sprang straight out of the iPod project, you have the iPad, you have all of the modern computing, specific when you look at smartphones, that we expect and we use today, a lot of it really drew it's inspiration from the iPod. But, of course, people don't remember how important things are in the moment. And one of my favorite things is we were able to find some comments from literally the live blog where they announced the iPod. \"iPod? iPoop... iCry. \"I was so hoping for something more.\" That was deep, I felt that one on a really spiritual level. \"This isn't revoltionary! \"I still can't believe this. \"All this hype for something so ridiculous. \"Who cares about an mp3 player? \"I want something new. \"I want them to think differently. \"Why oh why would they do this? \"It's so wrong, it's so stupid.\" \"Sounds very revolutionary to me.\", angry face emoji. \"Hey, here's an idea Apple, \"rather than enter the world of gimmicks and toys, \"why don't you spend a little more time \"sorting your pathetically expensive \"and crap server line-up? \"Or are you really aiming to become a glorified \"consumer gimmicks firm?\" Well, Pants the macrumors regular, I would argue that Apple probably made the right decision not focusing on the servers and becoming a glorified consumer gimmicks firm that is currently the most expensive and rich company that the world has ever seen since like the East India Company, but that's a. This is episode, don't worry about that, that channel (murmurs). To be fair I have not used an iPod in many years and I've never used the original. So one of the things that jumps out to me is I like the click reel because this actually has a physically spinning wheel and it has the physical buttons all the way around, so later iPod models, the vast majority of iPod models that most people bought, this is all capacitive touch interface. So, of course, the original iPod had a black and white display which was of perfectly reasonable quality for if you're trying to listen to your music, but when it comes to displaying anything that's not black and white. Well, I just can't believe how smeary the ball is. So screens have come a long way since 2001. But you know what I'm doing is I'm doing really good right now and I'm pretty proud of that 'cause I haven't played Breakout in a long time. The first generation iPod is a great example of the seed of an idea. This was not the best purchase, perhaps, in 2001, there were certainly major issues with it, but the thing is there is a fundamental idea here which ultimately ended up being why it was successful. Was generation one the perfect execution of that? No. But if they would have listened to all the naysayers who were saying that this is iPoop, then the world would be a very different place. It takes a lot of, I wanna say forethought, but it takes a lot of commitment to your ideas. You have to know that this weird mp3 player would ultimately change the face, in turn what was, at the time, a fairly small computer company into the world's most powerful and rich tech firm in, pretty much existence. It's a very unique path that Apple took to go from the iPod to where they are today. So there is a fine line between something which is different and game-changing and different and weird, it doesn't catch on. Right, so for every 1984 Macintosh or iPod there is a Zune, there is a Microsoft Kin, there's an HP TouchPad which, for whatever reason, didn't work out. Now, there's certainly some element of, I don't wanna say out-of-controlness, but there's a certain element of this might be a great design but it failed because the company collapses or because they made some bad decisions on some other aspects. But, ultimately, there're a lot of brand new pieces of technology that are always coming out. And there's, between everything that's successful, always a through-line of something which legitimately changes the game, whether it is a new design for smartphones that everyone gets on board with, for example, like the original iPhone. Or maybe it's something as simple as the way that you interact with a touchscreen device, just swiping as opposed to using physical buttons or like a keyboard, right. Or, regardless of what it is, I feel like there is a really clear line between things that have failed for reasons that were outside of its control, and products and services that have worked because they legitimately were ahead of the curve. And while you might not have appreciated it when they first come out, you absolutely rely on them today. Of course, it's not just hardware that people hate change on. Do you remember the old Instagram logo? Seriously, just stop and think about it for a second. Don't you have fond memories of how that logo looked? Wasn't it great? Well, this is what it actually looks like. Yeah. Speaking of, if we take a look at some comments from the day that Instagram changed their logo, \"Why are they changing what is already good?\" \"New Instagram logo is terrible, looks cheap #instagram.\" \"Does Instagram realize \"they shouldn't fix something that's not broken?\" \"Instagram's new logo looks like the Phili's fanatic \"took LSD and wants to know why it's missing an i.\" - [Narrator] Now watch this, the pig who's the mascot (laughter drowns out speaker). - Look, let's all be real for a second, do you actually the prefer the old logo compared to the new one? I will admit that, yeah, at the beginning I didn't, but seriously, do you actually like it more? So I've thought a little bit about specifically the PS5 controller video. So that was a video that was our very first video to ever hit number one on trending, it was a very, very popular video. And I look at that that I made in a few hours. And while I don't think that that video was wildly wrong, I don't think I need to delete it or make a followup or anything that's that extreme, but what I do think is that hindsight is important. And it's, I think, very important to think about the way that things age. It's easy to have a knee-jerk reaction, and especially on YouTube and online, it's easy to have a negative reaction to something for karma, for likes, for whatever the case is, right. 'Cause people like hating, right? It's easy to hate, it's not easy to make. And I think that that's something that I try to be more aware of and I think that that's something that is healthy for everyone to be aware of, is that it takes you five seconds to make fun of a thing, it takes someone moths and years to make the thing. There's someone who spent a lot of time, there's a probably a huge team of someone, spent a lot of time designing that stupid app update, that terrible looking phone, the ugly controller, whatever the case is, and while you might make fun of it today, you never know, 20 years from now someone like me might be reading your comment off in a video saying, \"Look at this idiot \"who didn't appreciate the PS5 controller.\" well, that one might not go down in history the same way as the iPod but we'll see.",
    "transcript_keywords": [
        "thing",
        "people",
        "iPod",
        "Xbox",
        "things",
        "lot",
        "make",
        "time",
        "back",
        "design",
        "Macintosh",
        "years",
        "video",
        "Apple",
        "Instagram",
        "computer",
        "technology",
        "yeah",
        "mouse",
        "easy"
    ],
    "transcript_entity_values": [
        "2001",
        "LSD",
        "Marty McFly",
        "100s",
        "Breakout in a long time",
        "iPhone",
        "John C Dvorak",
        "the Xbox Series X",
        "Motorola",
        "Myspace",
        "iPad",
        "35 years",
        "first",
        "Steve Jobs",
        "1984",
        "macrumors",
        "30 something years later",
        "the day",
        "five seconds",
        "Twitter",
        "Xbox",
        "36 years later",
        "Instagram",
        "a few hours",
        "Apple",
        "the end of the day",
        "Dave",
        "Xbox One",
        "Xbox",
        "iPoop",
        "moths and years",
        "20 years from now",
        "Sony",
        "a couple of months",
        "Macintosh",
        "one",
        "YouTube",
        "second",
        "HP",
        "DualSense",
        "the Play Station 5",
        "five",
        "a ton",
        "Macs",
        "The San Francisco Examiner",
        "a couple of decades",
        "Xbox",
        "iPod",
        "New Instagram",
        "Phili",
        "the days",
        "Zune",
        "many years",
        "the East India Company",
        "dozens",
        "a couple of years",
        "today",
        "Macintoshes, Mac, Mac",
        "PS5",
        "Yoh",
        "a couple of hours"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "LAW",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "ORDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "TIME",
        "ORG",
        "FAC",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "TIME"
    ]
}