{
    "id": "PjaQ96i_BkE",
    "title": "iPhone 12 Mini vs iPhone 12 Pro Max",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-10-14T00:59:57Z",
    "video_url": "https://www.youtube.com/watch?v=PjaQ96i_BkE",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "iphone",
        "iPhone 12",
        "iPhone 12 pro",
        "iPhone 12 pro max",
        "iPhone 12 mini",
        "iPhone pro",
        "iPhone pro max",
        "iPhone mini",
        "iPhone 12 pro vs mini",
        "new iphone",
        "iPhone news",
        "ios",
        "apple",
        "mini vs pro max",
        "smartphone",
        "smartphones",
        "best smartphones",
        "2020",
        "flagship phones",
        "budget smartphones",
        "iPhone 11",
        "iPhone 11 Pro",
        "iPhone 11 Pro max",
        "magsaf"
    ],
    "views": 77202,
    "likes": 2976,
    "comments_count": 412,
    "description": "Does size matter for Apple's new iPhone 12 Mini and Pro Max?   Do(n't) Buy the Surface Laptop Go:  Why Did Sony Do This?! PS5  Too Many Phones.   The IMPOSSIBLE Tech Challenge ft.  @UrAvgConsumer   Does  @The Slow Mo Guys    ACTUALLY Know Slow Mo?!   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/hsGLMAquEaY",
        "https://youtu.be/RlBbKV1D-Co",
        "https://youtu.be/N1Qf3srmbog",
        "https://youtu.be/LIRehjzUr60",
        "https://youtu.be/wm9Ezth7Iyo",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to \"This Is\". We have our first look at the iPhone 12, and I'm gonna tell you why the 12 mini is the best one to get. And the only one you should get. - I think what Matt means to say is that that's the one that works best for him, because I think that all of y'all should buy the iPhone 12 Pro Max. - And I think almost no one should. For the first time in a really long time, I think we actually have a pro model that is for pros. - I do agree. - [Matt] All the features of the Pro Max are useful to maybe 10 people out of a huge handful whatever. That's a weird, it's a weird sample size. But all the extra camera features are nice, but you don't need 10 bit, you know, HDR, Dolby Vision to shoot home videos. - No, it's totally fair. I mean, in previous years, such as the iPhone 11, this is the 11 Pro Max, we've had features that kind of set it aside, but nothing that we could call pro, the main thing was the battery life on this guy. - Right. - But this time around, there's an actual reason for pros, at least in, you know, in some sense to get this phone over the other one. The iPhone 12 Pro Max has a larger sensor in it and upgraded lenses. So it's supposed to be better at low light, there's gonna be better image processing on top of the benefits of the A14, brings in four image processing already. And that gets me excited about using the cameras on these things. - Yeah and it's not just the camera stuff too. It's, I mean like the LiDAR is a big thing. So like, if you are actually part of like an architecture firm or, you know, engineering firm, like that's actually a useful feature to have on your phone. But again, for the average person who's checking Twitter, who's checking emails, who's checking messages, you know, browsing Reddit whatever, the non-pro versions is definitely the way to go. - Unless you wanna gloat. It's a kinda thing of, a lot of people will just buy it because they wanna go out to their friends, \"Oh, I got the new iPhone.\" \"Oh, it's the big one, it's the 512, iPhone 12 Pro Max.\" - [Austin] The Big Chungus, some might say. (both sighing) - Austin. - Who let you out of the cage? - Yeah, Austin refuses to not call the 12 Pro Max anything. - Other than the Big Chungus. - The Big Chungus. - He called the 12th mini. - [Both] The little Chungus. - The little Chungus. - The little Chungus. If you're gonna be just taking home video or like taking a picture of your food, when you go and get, you know, tapas or whatever, whatever food people take pictures of I don't know you ramen. I don't know. - We are in California. We only take pictures of topaz. - Yeah, so like, you don't need that larger sensor for something like that. - Yeah. - If you're a say a, video production person who occasionally takes out a $50,000 camera, and that's hard to set up and you're in the middle of a desert and you need to just grab a shot of a plane flying overhead and you just wanna grab out your iPhone. - You mean us? - Yeah, that's my point. You're the reason, like you're the person who should buy the Max. - Thanks for, you know, confirming my need for this phone. - I'm confirming your need for the phone. - Yeah. - I'm denying everyone else's need for the phone. - Yeah, go on. - There's need, it's a very need versus want scenario with it. So, so many people have been saying, we want smaller phones. You know, phones are getting too big, too big, too big. And that's where I think the 12 mini is the perfect size for like, I hate having to use two hands with, you know, I have the relatively, you know, average size as I go through each of the phones in my pockets. - [Austin] Wow, scroll off. - Well to be fair, one of them is just my Raid: Shadow Legends machine. So I have the iPhone 11 and this is almost too big for me. - Really? - So, yeah, like I don't have particularly small hands, but I don't have particularly big hands either. And I can't, like holding it comfortably and firmly can't reach like I can't pull down. - Even for that? - Yeah. - Like, so for me with the 11 Pro, sorry, with the Pro Max, I have to do this thing where I hold it with one hand with my pinky, but because the phone is actually like pretty heavy, it weighs down my pink, I actually get like pinky crams with this thing. - So I, again like I don't feel comfortable holding it like that. I think I'm gonna drop it. And then especially when I'm like laying in bed, trying to scroll or whatever, there's so many times when I go to scroll and I'm like, oh I gotta change something and like my grip just slipped, and then it's right on my face. And that's why I'm really excited to get the mini because with a 5.4 inch screen, it is still a smaller overall footprint than any of the smaller iPhones in the lineup. The six or seven, the eight, any of those. I don't really do anything crazy with my phones. I'm on Twitter, I'm checking, you know Reddit, I'm checking all the, like nothing that needs these pro features. So to have a super affordable, $700 is a really good price. - [Host] For a flagship phone. - That is a very reasonable price, especially coming from Apple. - [Austin] What bout the OnePlus Nord? - We're not talking about OnePlus right now. - Sorry, no poverty phones here. - We can talk about pricing all day long for other Android phones. Look, I'm on iPhone because of the ecosystem. So the argument for any other phone is kind of my new, because I'm in the ecosystem and so a $700 flagship phone, I'm happy for that. - So Matt talking about the iPhone 12 mini, it States the obvious thing of it being a smaller phone, but that is such a quality of life thing that I think a lot of people don't understand is that just being able to use this phone that is super light and that's super small with one hand, almost, not in a way makes the phone seem faster, but it makes it seem easier to use, which is more integrated in your life. Which, that sounds very ethereal, and might seem like fluff when we're saying it like that. - We are definitely drinking the Kool-Aid. - But it makes a different than when you're using a smaller phone for sure. - But can I throw a crazy thing at you? - Oh, crazy, I like crazy. - So when I heard, when I first heard iPhone 12 mini. - Yeah. - This is what I was hoping for. - Are you just throwing into another of this is video? - Well, yeah. (laughing) So, we tested out mini phones on another episode of \"This Is\" and I actually kind of fell in love with this form factor. If there was an iPhone experience with like maybe like two lines of the home screen, three lines max, whatever, I would rock this so hard. You have no idea. And again, 'cause it's just so convenient to just have in your pocket, like who needs a folding phone when your phone is of reasonable size? - Hey, hey, no, no, no, I was literally gonna bring this up, like right after your point. But something that I do appreciate is not even for, you know, using it in your hand, but just having a phone that can go smaller in your pocket, is a big selling point for me. - Yeah. - And, while obviously I'm not saying that Apple should have a folding phone anytime soon, or that they're working on one, cause I mean, you could talk about the rumor mills all day. We have no idea. - Right. - But I see what you're talking about here. Like I've been using the Gen one Z Flip Austin's hand me down for the better part of a month now. And having that in my pocket in the smaller form factor means that I'm carrying it around more and I'm loving to use it more because it's not taking up a huge spot in my pocket. Like, sometimes I'll even leave my Pro Max at home because it's just too big. It's like inconvenient enough, which I know, that's a luxury coming from, you know, people that review tech, but I see why people want smaller form factors. Like it's not the exact same principle as the mini, but in a sense understand it. - [Matt] So we've been talking about this a lot more where less and less, I'm caring about specs. So we talked about this with the Surface Laptop Go like the Surface Duo. I mean really the Surface products in general. But I care so much more about how something feels in my hand, how the hardware is, specs in like third or fourth on my list for what I'm actually deciding when I'm getting a device now. - Right. And the thing is that things are so good right now where even the mid range stuff. - [Matt] Yeah. - Is good enough for most people, even for us as maybe slightly more power users, we're not like totally up there, but like, we don't feel restrained by the specs. - We have every device. - Right. - We have a table with every phone that's come out in the past, I don't know how many years. - That's not a bragging point, but it's just, we have all of the capacity. - [Both] Yeah. - We've had the comparison points here and we really don't notice a difference at a certain point. - [Matt] Right. - And I think that's where I totally agree with you. I think in terms of form factor, I can't hate on the mini, in fact I've always wanted a smaller phone, but that's where my wants for this 12 Pro Max comes in because, I myself that, you know, takes a lot of social stills. Obviously I take a lot of stuff for Austin as well. The iPhone 12 Pro Max I'm honestly looking forward to because it has that pro level feature set, or at least it has the top level features spec compared to the regular pro. And in addition to, you know, the size, which I'm accustomed to, maybe there's a slight worry for people that are coming in from the normal size pro or even an iPhone 11 or anything of that size. But I think that this year more than the other ones, bottom line, there is a bigger reason to buy the Pro Max over the normal pro. And I think that's why I want it. - And just to, let's clarify real quickly, you know, we did a much better comprehensive of like what the differences are between each phone, which you can check out on the main channel. But the gist of it is, all of the phones have the same processor, all of them have the same RAM, they have the same GPU. The real difference comes down to the cameras. And that's really the only, and I say only 'cause it is a big difference, but the only real difference is the screen sizes and the camera. So the biggest flaw with the budget iPhones from last year is no longer a factor now. So the big flaw was that they were a pretty crappy screen in comparison to the pro line. So it was a LCD sub HD screen, but now you are getting a full high res screen, I don't have the exact resolution in front of me here, but it is. - [Austin] You literally do, it's on the Z Flip. - No, you didn't write it down. - Yeah, it's high pixel density, O-LED, you know, with all of the HR tech in it, it's. - [Matt] Across the board. - [Host] Yes. - So you are not sacrificing anything by getting the 12 or the 12 mini. You are, like there's no real trade off like there was in the past. But so that's where it comes down to again, are you doing professional level photography or above, I would say hobby photography? And if the answer is no to that, I think the Pro Max is, shouldn't even cross your mind. I think it's gonna be a, just a waste of money for you. - It's just a flux. It's just a big flux. - However, I don't think the pro, the 12 pro is really good for almost anyone. - It's like, if you're paying the 999 for the pro you might as well just get the Pro Max at a $100 more. - [Matt] I agree. - Obviously with the Pro Max on the other side of the spectrum, the one that I love the most, you get literally all of the benefits for paying the most amount of money. - Right. - On top of the fact that some people might actually just want the bigger, you know, feature spec phone. - Which I don't agree with that, like mentality. Like, you know, if you just want like a big phone for the big phone. - Look there are a lot of people that buy these iPhones and keep them around for a long period of time. They want to have that reassurance that the thing that they're holding onto is the top of the line so that it lasts them that three, four, five years. - I wanna ask, do you think that there's a large amount of people who are buying like a Max for extended period of time? I think the people who are buying a Max are the same ones who are buying it every year. - I don't wanna say that it's, you know, black and white as that. Like, I don't think we can have those specific numbers, I don't know for sure. - I just, looking at like comments whenever we do a video like these, I see, the people who I see saying, you know, I've been using X phone for, you know, three years. It's always like my iPhone 6, you know, it's my iPhone. - Right. - You know, like base model phones that they got on a somewhat, you know, budget, affordable line, it's never the ones who are like, yeah, my 512, you know, 10 Max or whatever, like. - But there are people that do think that they could hold onto these phones for a while like. - That's where my argument is to get the smaller phone is because you're getting the same CPU. - So you're getting all the updates anywhere. - You're still gonna get the same update. - Broad strokes updates, you are getting everything. - You're still getting 5G. Yeah, we touched on the main channel video where it's a bummer that none of them have 120 Hertz displays. - Yeah. - But, like, this is, it's a really good deal for 700 bucks. Let me know what you think in the comments below, which one you're getting, or you're not getting any of them. And you just can tell us you're gonna get the new poker phone or the OnePlus Nord or whatever. Let us know the comments, like, subscribe. Tell us how much you don't want Austin in these videos anymore. And we'll see you next time. - You should do more of these. - Yeah, we should. - Yeah, yeah.",
    "transcript_keywords": [
        "Pro Max",
        "Pro",
        "Max",
        "phone",
        "Yeah",
        "big",
        "iPhone",
        "phones",
        "people",
        "Big Chungus",
        "smaller phone",
        "thing",
        "Chungus",
        "big phone",
        "mini",
        "smaller",
        "size",
        "Austin",
        "pros",
        "features"
    ],
    "transcript_entity_values": [
        "Surface",
        "11",
        "last year",
        "5.4 inch",
        "LCD",
        "Android",
        "one",
        "third",
        "fourth",
        "Raid",
        "Apple",
        "five years",
        "four",
        "a month",
        "previous years",
        "iPhones",
        "the Surface Duo",
        "GPU",
        "three",
        "Twitter",
        "Reddit",
        "700 bucks",
        "Pro Max",
        "eight",
        "California",
        "six",
        "50,000",
        "three years",
        "999",
        "Matt",
        "120",
        "CPU",
        "512",
        "the OnePlus Nord",
        "iPhones",
        "OnePlus",
        "Hertz",
        "The Big Chungus",
        "Austin",
        "two",
        "Reddit",
        "all day",
        "100",
        "12",
        "the Kool-Aid",
        "Chungus",
        "the Z Flip",
        "700",
        "this year",
        "first",
        "iPhone",
        "Max",
        "Flip Austin",
        "Dolby Vision",
        "the Surface Laptop Go",
        "12th",
        "RAM",
        "seven",
        "the Big Chungus",
        "A14",
        "10"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "NORP",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "MONEY",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL"
    ]
}