{
    "id": "pjvXzl3ro0Q",
    "title": "$600 Smartphone Showdown: Honor View 20 vs OnePlus 6T",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-01-31T15:41:53Z",
    "video_url": "https://www.youtube.com/watch?v=pjvXzl3ro0Q",
    "category": "Science & Technology",
    "tags": [
        "honor view 20 review",
        "oneplus 6t review",
        "honor view 20 vs oneplus 6t",
        "oneplus 6t vs honor view 20",
        "honor view20 review",
        "honor view20 vs oneplus 6t",
        "mrmobile",
        "michael fisher",
        "android central"
    ],
    "views": 251378,
    "likes": 8655,
    "comments_count": 874,
    "description": "Sponsored by Dollar Shave Club. Use MrMobile's referral link and build your Starter Set for only $5!    [HONOR VIEW 20 VS ONEPLUS 6T]  Im finding it harder and harder to get excited about thousand-dollar smartphones, and the two biggest reasons why are right there in the headline. The Honor View 20 and OnePlus 6T are each incredible in their own way, and hovering around the $600 mark, theyre far cheaper than the latest Samsung Galaxy or iPhone flagship. Which one is better depends on how much you use your camera and also where you live ... but by the end of this video I will tell you which one Id take home.   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S HONOR VIEW 20 VS ONEPLUS 6T COMPARISON]  MrMobile's Honor View 20 vs OnePlus 6T comparison was produced following two weeks with an Honor View 20 review device provided by Honor and several months with two OnePlus 6T review devices provided by OnePlus. Substantial input was provided by Android Central's Alex Dobie, who spent more time testing the Honor View 20 in battery and camera metrics. Android Central's Honor View 20 Review can be found here:    [MUSIC]  \"Yellow Jackets\" by Flash Fluharty, available at Premium Beat:   Lone Ranger by Gyom, available at Premium Beat:   Escapade by Vincent Tone, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #honorview20 #oneplus6t #oneplus #honor #smartphone",
    "description_links": [
        "https://dollarshaveclub.com/mrmobile",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.androidcentral.com/honor-view-20-review",
        "https://www.premiumbeat.com/royalty-free-tracks/yellow-jackets",
        "https://www.premiumbeat.com/royalty-free-tracks/lone-ranger",
        "https://www.premiumbeat.com/royalty-free-tracks/escapade",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- This video is sponsored by Dollar Shave Club. Folks, I don't know about you, but I'm finding it harder and harder to get excited about thousand dollar smartphones, and here are the two biggest reasons why. The Honor View 20 and OnePlus 6T are each incredible in their own way, and hovering around the $600 mark, they're far cheaper than the latest Samsung Galaxy or iPhone flagship. Which one is better for you depends on how much you use your camera, and also where you live, but by the end of this video, I'll tell you which one I'd recommend to most folks, and which one I'd take home myself. (energetic music) Let's start with hardware, because good gravy, folks, it's been two weeks since I first laid hands on it, and I cannot take my eyes off the Honor View 20 still. Photos cannot do this back plate justice. Video barely can. Honor calls this an Aurora Nanotexture finish. I call it the most stunning glass phone I've seen in a long time. In short, tell 'em, counselor. - It's a great honor. - [Michael] Now, the OnePlus 6T gets points for minimalism, and it's denser than the hollow-feeling View 20, but even the McLaren and the Thunder Purple versions lack the eye grabbing power of Honor's bobby-dazzler here. Even if you don't care about aesthetics, Honor still has some hardware wins to claim. Unlike the OnePlus, the View 20 offers a headphone jack. It's also got an IR transmitter, and most importantly to me, an old-fashioned fingerprint sensor is here, too. OnePlus's under-display reader is much cooler looking, but for now, the old type is faster and more reliable. It also enables some convenient shortcut gestures. Let's tackle the selfie camera, next, not because I wanna wade into the whole notch-versus-hole punch debate. I'm more interested in how the cameras themselves compare. Honor follows parent company Huawei's habit of just packing pixels into its front-facing shooter, and just like on those Huawei phones, the result is not great. Now, both of these photos are overexposed, but the OnePlus managed to keep more color in the shot while also not imposing as much beautification, beautification that I didn't ask for. And when we turn the lights down, I'd still take the OnePlus selfies. (upbeat music) Flip the phones over, and Honor benefits from a much more capable and powerful primary camera, topping out at 48 megapixels. Like Android Central's Alex Dobie says, you can set the Honor to full resolution, take a photo, and just zoom in forever, hitting details that OnePlus's 16 megapixel camera just can't match. While each phone also sports a night mode, Honor's is substantially superior. It's better at bringing out the details on this Klingon Bird of Prey, and it sticks to truer colors in this lobby, as well. Of course, cameras are complicated, and there are situations where I prefer the OnePlus. Any shot with a blue sky in it, for example. The 6T also retains better color, or at least more color, in video, and it has more options for framerates, as well, but the View 20 has better audio quality and video, and honestly, based on capability alone, Honor's gotta take this one. The huge sensor, the crazy night mode, the 3-D stuff made possible by that time-of-flight sensor around back, at the end of the day, you can do a lot more with the View 20's shooter. So far, we've got Honor leading in hardware, design, and camera, and it also ekes out a win on battery life. Now, the OnePlus 6T is no slouch here. As I said in my review, it seems like black magic how long it can last on a 3,700 milliamp-hour battery. But the Honor brings 4,000 milliamp-hours, and it uses some software trickery to make it, in the words of Alex Dobie, again, one of the all-time best. Now, I'll admit I haven't had as much time with the View 20, but Alex's experience is important. This is a guy who used the View 20 at CES in Las Vegas, which is rough on any phone battery, thanks to network conditions, and just crazy amounts of photo and video. And yet, despite all these feathers in the honors cap, I'd still take the OnePlus home. And if you've been paying attention to the categories covered thus far, you'll know it's mostly because of the one major thing we haven't covered yet, the interface. I'm gonna try to say something a little different about this contentious category. Do me a favor, stick with me through the break and I'll try to live up to that promise. This video is sponsored by Dollar Shave Club, and I know what you're thinking, but they're more than just razors. They can send a box to your house with everything you need to help you look, feel, and smell your best. Check out the Shower starter set, with amber lavender cleanser for the body, and Hawaiian ginger cleanser for the face. Or give some loving to those teeth with the Oral Care starter set, weighty toothbrush included. And of course, the Shave starter set sticks to the Executive Razor and tube of Dr. Carver's Shave Butter, which feels nice. My favorite is no surprise, because it's a hair thing. I'm going back to the Shower set for that sage and black pepper shampoo. Join at the link in the description to get one of the starter sets for only $5. After that, you get regular-sized products at regular price, and the more you buy, the more you save. Go get that deal in the description, handsome, and thanks to Dollar Shave Club for sponsoring. (dance music) Folks, I've said for years that Huawei's EMUI is not my bag, and Honor's so-called Magic OS is just a rehash of the same thing, but in order to avoid a rehash of my own, I'm not gonna tell you for the ninth time why I don't like Huawei's software. It's actually kind of irrelevant. You see, whether it's EMUI, or the Samsung experience, or ColorOS, lots of companies paint over Android with their own customizations. OnePlus stands out not just for going the other way, for sticking as closely as possible to stock Android, but the changes it does make are all things that make Android better. And while that claim is inherently subjective, I haven't really ever found anyone who disagrees. I go into specifics in my 6T review, but they broadly boil down to this. OnePlus offers the fastest, cleanest, sharpest Android experience on the market. No matter what corner of the OS you tap your way into, that refinement, and restraint, and speed making using it an absolute pleasure. The Honor View 20 can do more, yes, but at the expense of clutter and cruft, not all of which is easy to paint over, even with a custom launcher. When you think about it, it's kind of amazing that these both come from Chinese manufacturers. From a software standpoint, they really couldn't be more different, and that's evident in the marketing, too. Honor has always tried a little too hard to come off as a cool guy brand for hip kids, while OnePlus, having had more time to get past those awkward early days, today seems much more comfortable with itself, and confident in its messaging. I was reminded on my last review video that you folks like your spec sheets, so I'll leave this up for you to compare the numbers that are important to you, while I hit the lingering details that are important to me. To wit, the OnePlus 6T has an AMOLED screen instead of an IPS panel, and its higher brightness and darker blacks are appreciated. Each of these comes with a fast charger in the box, and they're also tied in another way, the single speaker output is just about the same, as mediocre as the vibration motors. And finally, there's the critical issue of where you reside. One of these can be readily purchased in the United States, while the other takes effort to import, and then to support. But I don't think the OnePlus is better just because it's easier to get, or because it's cheaper. At the risk of repeating myself, the 6T feels more even. There's an intention and a thoughtfulness to it that's lacking on the everything-but-the-kitchen-sink View 20. I do wish the OnePlus camera was as capable as Honor's, and that the casing was as striking. And I'll say again that platinum dropped on either of these is money well spent, but for me, the OnePlus 6T's more cohesive, complete package make it my top pocket pick in this comparison. (dance music) I'm sure you noticed I borrowed liberally from Android Central's review footage for this one, folks. Head on over to their full review at the link in the description if you wanna know more about the Honor View 20. See my OnePlus 6T review at the theMrMobile on YouTube, and please subscribe if you haven't already. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "Honor View",
        "Honor",
        "OnePlus",
        "Dollar Shave Club",
        "View",
        "Dollar Shave",
        "Shave Club",
        "video",
        "Android",
        "Shave",
        "camera",
        "Android Central Alex",
        "Android Central",
        "Folks",
        "review",
        "Dollar",
        "Huawei",
        "Alex Dobie",
        "Android Central review",
        "set"
    ],
    "transcript_entity_values": [
        "Huawei",
        "only $5",
        "IPS",
        "IR",
        "Michael] Now",
        "3,700 milliamp-hour",
        "the Thunder Purple",
        "ColorOS",
        "Magic OS",
        "Android Central's",
        "Samsung",
        "early days",
        "6",
        "McLaren",
        "this Klingon Bird of Prey",
        "Oral Care",
        "Android",
        "YouTube",
        "Shave Butter",
        "OnePlus",
        "4,000 milliamp-hours",
        "the View 20",
        "Hawaiian",
        "Samsung Galaxy",
        "3",
        "today",
        "OnePlus",
        "iPhone",
        "first",
        "two weeks",
        "OnePlus 6",
        "Carver",
        "Shower",
        "One",
        "two",
        "Aurora Nanotexture",
        "Dollar Shave Club",
        "OnePlus",
        "about thousand dollar",
        "years",
        "bobby-dazzler",
        "600",
        "Alex Dobie",
        "Las Vegas",
        "the United States",
        "CES",
        "OnePlus 6",
        "16 megapixel",
        "Alex",
        "Shave",
        "48 megapixels",
        "EMUI",
        "Chinese",
        "one",
        "ninth",
        "the end of the day"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "EVENT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "FAC",
        "NORP",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "DATE",
        "PERSON",
        "MONEY",
        "PERSON",
        "GPE",
        "GPE",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "ORG",
        "NORP",
        "CARDINAL",
        "ORDINAL",
        "DATE"
    ]
}