{
    "id": "PKV70GbS_TI",
    "title": "Haters be quiet - Beats Studio Buds Plus",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-05-19T19:00:07Z",
    "video_url": "https://www.youtube.com/watch?v=PKV70GbS_TI",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "beats",
        "apple",
        "android",
        "ios",
        "quick pair",
        "swift pair",
        "tws",
        "wireless",
        "earbuds",
        "music",
        "listening",
        "wfh",
        "anc",
        "transparent",
        "design",
        "cool"
    ],
    "views": 360939,
    "likes": 11487,
    "comments_count": 541,
    "description": "Check out the Vessi StormBurst and their other styles at  . Use code SHORTCIRCUIT for 15% off your entire order and free shipping.  Adam has been a long-time defender of Beats' headphones, and with the new Beats Studio Buds Plus, he might finally convince people that Apple's influence has been good for their products. Does the sound quality match the flashy transparent design or are these wireless earbuds just a good-looking dud?  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Give Beats a chance 0:45 Taking a look at the box 1:46 Unboxing 2:29 Design impressions 4:14 Sponsor - Vessi 4:42 Adam makes a mess 4:50 Quick pairing and misc. features 7:50 Listening, Transparency mode, and Spatial Audio impressions 10:43 Labs' testing results 12:11 Microphone test and misc. specs 12:52 Pricing and overall thoughts 13:42 Outro",
    "description_links": [
        "http://vessi.com/ShortCircuit",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- It's been a little while since Beats was on top of the world. I remember back in high school when it was the coolest thing to have Beats, and then everyone found out that they were actually just nice-looking garbage. But since they've been acquired by Apple, I think that Beats have come quite a long way and are now producing several pretty high-quality products, if not a little overpriced. Which is why I'm kind of angry, 'cause in a previous unboxing I mentioned that I had a pair of Beats Solo3 Wireless, and people just kept dunking on me. I think that people still think that the Beats of the early 2010s are the same as they are now. But being acquired by Apple has changed them in a big way. You get things like Apple's noise canceling and all that sort of stuff. So I'm hoping to see all of those improvements on their new Beats Studio Buds Plus. Let's take a look inside. It's another box. Oh, sweet. These are the transparent ones. Look at that. You can see right through 'em. That's sick. I'm so glad that they're releasing this. And this isn't like a special edition. This isn't like a mass-produced version of them. I love the clear plastic. It was always the best Nintendo 64 controller, it's the best Game Boy Advanced, and these are probably gonna be the best Beats headphones. I'm just saying. Let's take a look around the box see what we can learn. They claim powerful, balanced sound with spatial audio. Again, taking advantage of that Apple Tech. Enhanced Apple and Android compatibility. Oh, I guess maybe Apple's kind of coming around to working with Google on some things. At Google IO they announced that they would share like AirPod location data so that people could know if they were being like tracked or anything like that. And it seems like they're gonna actually be putting a lot of extra Android features in here too, which is really cool to see. Active noise canceling with transparency mode. Up to 36 hours of battery life with ANC off, nine hours in the earbuds, and 27 hours in the case. I love how they break that down. Usually they just go like, 40 hours. And inside you get a tiny USB-C cable. A very tiny USB-C cable. You get three extra sizes of ear tips. Awesome. So from extra small to large. Then... Oh, they're in there, I can't look at them yet. We gotta look at the documentation. Is that a sticker? It is a sticker. I'm gonna put it on here. And you get some documentation, but that's just about it. That's all we get in there. And then here they are, the Beats themselves. Interesting thing to note is that this mentions not quick pairing with an iPhone or quick pairing with an Android phone, because it actually supports both. So you can do fast pairing on both your Android and your iPhone. I guess before we open them up, look at the case. Look at that. Oh, it's so cool. So you can see like the magnets for the hinge, right up there. You can see the bracing for this hinge mechanism going along the top. You can see the battery going along the bottom there, right there. Now you have a USB-C as your charging port, which does not allow for the fastest charging. It's about two hours to charge the case and the earbuds fully. But the case itself does allow for quick charging. A five-minute charge of the headphones will give you one hour of listening time. Not too shabby. Oh, so cool. And on the top here we have a button. Probably it's pairing. I'm gonna hold it down and let's find out. There it is. Let's look at these. Again, like just an insane amount of stuff is crammed into there. I find that small ear tips tend to fit my ears best, but this doesn't have the same kind of ear tip connector like you'd see on the AirPods Pros. It's just your average, normal ear tip. The ear tips that are included are silicone, so there's no foam or anything like that. It would've been nice to see some- A foam option or maybe a double flange. But these are kind of mainstream headphones. And you know what? Getting five pairs of ear tips is still pretty cool. Even the like filters for the grills are kind of see-through. - [Bell] Oh, so there's six microphones. - Total or on each one? - [Bell] Probably three on each. - Because I see two holes at the top right here. Two holes right there. Oh, and there's probably the microphone that goes in your ear. That's probably the third microphone. So there's a microphone that goes in your ear because these are gonna have hybrid noise-canceling systems. So they take the noise from outside as well as the noise inside your ear, and use that to factor into a calculation that will cancel out the noise that you're hearing. Speaking of noise canceling, try to cancel out this sick deal from my sponsor, Vessi. Thanks to Vessi for sponsoring today's video. Vessi claims their shoes are 100% waterproof. Their new StormBurst shoes combine the comfort of a sneaker with the grip and coverage of an outdoor boot. Vessi has added extra layering for added warmth, as well as extra grip prevent you from slipping and sliding in unfavorable weather conditions. You won't hydroplane ever again. The StormBursts are feature packed, it'll make a great gift in case May has any leftover April showers in it. Check out Vessi StormBurst and other styles at vessi.com/shortcircuit. And use code short circuit for 15% off your entire order. - [Bell] Clean up the table. No, I don't wanna pick it up. No, no! You're picking all that up. - All right, pair. iPhone needs a quick little update, but we can check out how fast pairing works on Android. So apparently we should be able to just do this. Look at that, it even knows. We need a software update, but here on Android it already identifies them. We can link it. It'll now be linked across all of your Google account devices. So if you have like a tablet or maybe a Chromebook, this will automatically pair in the future with them. We can connect it right now. Download the app. Yeah, sure, gimme that Beats app. There we go, and we're paired. It's so nice that that's how easy it is. Bluetooth can be so nebulous. While they quote themselves as having enhanced Android support, they don't actually support anything other than AAC as a audio codec, which is a real bummer. I get that Apex would be a little bit weird, because they would have to have a Qualcomm chip set, but you know, it would've been nice to maybe get LDAC. But also then again that's another company that they don't wanna work with, Sony. So these are Bluetooth 5.3, which means that in theory they could support the Bluetooth low energy code codec. We haven't seen a significant amount of adoption across devices for that yet, but I'm really hoping that we do because it's supposed to make a pretty huge difference in how much data is required to send a high quality audio signal. It's gonna be a big step up from AAC. One thing that's interesting about these, is that they don't take advantage of Apple's H series of chips. The Apple H2 can be found in the AirPods Pro Gen 2s, and the H1 in the AirPods and the AirPods Pros Gen 1, but also can be found in the Beats, Power Beats Pros, as well as one of their other Pro series of headphones. I guess because this isn't a Pro series of a headphone, they decided to go with their own proprietary chip. All right, let's take a listen. I'm putting them in. They're nice and light. They're actually pretty comfortable. They are very small, like they're not big headphones, which I appreciate, because sometimes big headphones can be really bulky. They stick out a lot. These don't seem to stick out too far. Thoughts? Sammy? - [Sammy] Anyways... - Sammy? - [Sammy] They look great. - Thank you. Despite the fact that I own a pair of Beats headphones, I've never bothered using their apps. I don't actually know what kind of capabilities they have, but currently it looks like a really good way of being advertised to if you wanna see other Beats products or if you want to receive pairing and battery notifications and you want to send Apple data. So if you're really into those things, it looks like the Beats app has got you covered. Among those extra features you can see like the Beats battery life for each headphone and the case in the notification shade. Really, really convenient. Now, these are pre-release, like obviously you can see that it doesn't ID the headphones. It's funny that Google's pairing algorithm saw it, though. Google showed the right thing. But in the app they haven't released it as an actual update yet. So maybe there's more features to come. These support Google's Find My Devices features. If you lose them, they'll remember the last kind of wifi network you were attached to, and like kind of give you a general idea of a location. As well as you can like ring them and stuff, which is great. But I don't know if you- You won't be able to do the like crazy find my things that the H2 chips allows you to do, where you can like hold your phone and it'll guide you through your house to the location of the headphones. Let's listen to some of my test tracks. (classical music) You know, they sound pretty good. They sound pretty, they sound pretty dang good. Yeah, there's a little bit of added bass, a little bit of extra oof, but it's not like tasteless, bloated bass. It's actually like relatively punchy. In Jessie Ware's new track Pearls, I just heard like another instrument that I had not really noticed. There's like this really cool funky low bass kind of synth that's playing underneath the main melodies. This kind of highlighted it for me in a way that really made it like pop and it was really, really cool. That's kind of the joy of listening to multiple different types of headphones. Is that you will hear things in songs that you didn't notice. Because one headphone just happens to represent that sound in that way. And now I love that song even more, 'cause I didn't know how sick that bass riff was. They're not trying to bring up the highs to the point where things become shrill or anything like that. They're pretty, they're pretty good. The ANC seems pretty solid for the room that we're in. Hey Sammy, you want to talk to me, or Jake you wanna talk to me? Just like say hello, hi, hi. - [Bell] And I'm saying words out loud. - Transparency mode is like, it's the same kind of Apple magic where it just sounds really, really natural. Like it really doesn't feel like I have anything in my ears. I do wish that instead of just doing random beeps and boops, that they gave me actual words that said like, \"ANC on.\" One press to play/pause. To presses to skip. Triple press to go back. It doesn't seem like you get any volume. That's a major bummer. I really don't like having to pull up my phone to adjust the volume of my headphones. Okay, now I wanna listen to the spatial audio. I am yet to really hear a convincing spatial audio effect on earbuds. I now have a Dolby Atmos soundbar at home, and it really is a whole different experience having access to actual surround sound speakers. Headphones have never really been able to pull it off, but I want to, you know, I want to give it a shot. Whoa, no one can hear what I'm hearing. My issue with spatial audio is that like Dolby Atmos tracks tend to just make things sound boomier and distant and not cohesive, like it would in an actual space. And I think that's because surround mixing is still not very commonplace in the music industry. So they're still learning the tricks of it, despite the fact that surround mixing has been around for like forever. But there was a big quadraphonic push, which was like a four speaker surround system, two sets of stereos back in the day. Like there's quadraphonic releases of like Pink Floyd. It's cool, it's different, but it doesn't sound that great. I mean, but that's, again, that's my thought. If you love spatial audio tracks, that's great. Don't let the people tell you what you can and can't listen to. That's why I listen to Beats. Okay? Because I see all of you in the comments telling me, \"Beats, they're bad.\" Shut up. Blabs has the truth. Here's our frequency response graph. The dotted line is our target, and the green line is the Beats Studio Buds Plus. And as you can see, there's a lift in the base, especially in the sub-base that adds that kind of punch that I was talking about. That fun factor that I like Beats for. The only thing that I'd be a little concerned about is the lift up at the one to three kilohertz region. Basically what that means is that things can come off as what is called shouty. Where instruments like things like horns or even human voices kind of seem like they're like yelling at you as opposed to like being smooth and like natural. I didn't really notice that in my listening tests, but if you're sensitive to that your mileage may vary in the top. We see pretty good response with a pretty sharp peak at the 13 kilohertz region. But that's kind of in the area where measurements really start to be inaccurate and loose and stuff. And I wouldn't be terribly concerned about it. I didn't notice any brilliance. I mean that's a pretty good response curve and I think that reflects the quality of the sound that I perceived. And let's take a look at our ANC graph. The red line is ANC off, so passive isolation. And the green line is ANC on, active noise canceling. And the amount of noise that it's canceling out is how far below the dotted line it is. And the ANC overall does a decent job cutting out sounds that are below 1,000 kilohertz. Though it would've been nice to see a little bit of higher performance in the 600 to 1,000 kilohertz range. That's where things like a lot of voices kind of exist. So this won't do the best job of silencing your coworkers, but it will still do a good job attenuating low rumbles from like vehicles or airplanes. You're currently listening to me through the mics on the Beat Studio Buds Plus, just gonna go through a few stats that we didn't quite cover. IPX4 water resistance. So splash, sweat, pretty cool. They have adaptive to fit ANC. They got beam-forming microphones. Okay. The earbuds themselves weigh five grams. The case weighs 50 grams. The drivers are made of a hundred percent recyclable rare Earth, and a hundred percent recycled tin. There's a 100% recycled tin on the main logic board. Six microphones are used for the ANC with both buds. Three microphones are used for dual bud ANC with transparency off. They use the multiple microphones to make sure that you have clear speaking voices. They'll adjust the amount of microphones depending on the earbuds. Also, they come in black and gold and ivory, and both of those also look pretty sick. But transparent look the best. So what are the price of these? $170, which is a lot. It ain't cheap, that's for sure. In fact, it falls right in line with the price of AirPods Third Gen. And if you spend 80 more dollars, you get the AirPods Pros. If you want to go with smaller companies, especially Chinese companies, like Sound Core or Sound Peats or 1MORE, you might be able to get a better value, but these are really, really solid. I think it's a good price. I think the case is really cool. And honestly, I'd pay a premium for this specific case, but that's just me. I think Beats actually knocked out of the park. I guess these buds have transparency mode all the time. (Sammy laughs) - [Sammy] Wait, why did no one laugh? - Sammy, that was perfect. That was incredible. - [Sammy] Don't put that in the video. - No that's- - That's the outro. Thanks for watching Short Circuit. If you like this video, why don't you check out the video about another transparent company in a different way? Fairphone, they're all about making repairable headphones and being a good company.",
    "transcript_keywords": [
        "Beats",
        "Apple",
        "Beats Studio Buds",
        "kind",
        "pretty",
        "ANC",
        "headphones",
        "sound",
        "Beats headphones",
        "Power Beats Pros",
        "things",
        "Android",
        "Beats Studio",
        "ear",
        "case",
        "cool",
        "good",
        "Beats Pros",
        "sound pretty",
        "pretty good"
    ],
    "transcript_entity_values": [
        "Game Boy",
        "Six",
        "Three",
        "Chromebook",
        "Vessi StormBurst",
        "Google",
        "600 to 1,000 kilohertz",
        "AirPod",
        "third",
        "Chinese",
        "StormBurst",
        "Blabs",
        "Sammy",
        "Short Circuit",
        "Beats Solo3 Wireless",
        "H2",
        "about two hours",
        "today",
        "Apex",
        "Sammy] Wait",
        "Up to 36 hours",
        "Apple Tech",
        "Google IO",
        "27 hours",
        "ANC",
        "nine hours",
        "AAC",
        "Fairphone",
        "Sony",
        "two",
        "13 kilohertz",
        "a hundred percent",
        "one hour",
        "Pink Floyd",
        "80 more dollars",
        "Jessie Ware's",
        "Jake you",
        "50 grams",
        "one",
        "iPhone",
        "April",
        "Nintendo",
        "Android",
        "the AirPods Pros",
        "five-minute",
        "LDAC",
        "six",
        "Dolby Atmos",
        "five",
        "Apple",
        "Enhanced Apple",
        "AirPods",
        "the Beats Studio Buds Plus",
        "the day",
        "five grams",
        "100%",
        "Qualcomm",
        "three",
        "One",
        "H1",
        "below 1,000 kilohertz",
        "170",
        "40 hours",
        "the AirPods Pro Gen 2s",
        "1MORE",
        "the Beat Studio Buds Plus",
        "AirPods Third Gen.",
        "StormBursts",
        "four",
        "Android",
        "Earth",
        "three kilohertz",
        "Two",
        "USB-C",
        "15%",
        "May",
        "Dolby Atmos",
        "Vessi"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORDINAL",
        "NORP",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "TIME",
        "DATE",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "TIME",
        "PERSON",
        "MONEY",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "MONEY",
        "TIME",
        "EVENT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "LOC",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "DATE",
        "PRODUCT",
        "PERSON"
    ]
}