{
    "id": "PlLWjdSacOY",
    "title": "Kapture: Wearable Microphone Or Time Machine?",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-08-10T17:14:33Z",
    "video_url": "https://www.youtube.com/watch?v=PlLWjdSacOY",
    "category": "People & Blogs",
    "tags": [
        "kapture",
        "kapture review",
        "spy gear",
        "wearable tech",
        "spy recorder",
        "wearable mic",
        "wearable microphone",
        "microphone review",
        "smart recorder",
        "wearable",
        "review",
        "tech",
        "video",
        "michael fisher",
        "mrmobile",
        "oneplus 3",
        "captain2phones",
        "pocketnow",
        "android central",
        "android authority",
        "mister mobile",
        "imore"
    ],
    "views": 42720,
    "likes": 2182,
    "comments_count": 202,
    "description": "If you could mix wearable tech, spy gear, and a dash of acoustic time travel you'd get Kapture: a wrist-worn microphone that's constantly recording everything around it. The idea is enticing: if your watch is always listening and passing that audio off to your smartphone, then you never run the risk of missing out on anything  all you need to do to preserve the moment is tap your wrist. Does Kapture deliver on its lofty promises? I wore one for over a month to find out. Join me for the MrMobile Kapture review!   [SUBSCRIBE]     [ABOUT THIS VIDEO]  Michael Fisher's Kapture review was performed after 30 days using a retail demo unit provided by Kapture. It was tested on Android with an HTC 10.   [SOCIALIZE]         [MUSIC]  \"The Ballad of MrMobile\" (Mobile Nations, 2016)  \"Jello Shot\" by Wolves, available at Premium Beat:    [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.premiumbeat.com/royalty_free_music/songs/jello-shot",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] What if you could mix wearable tech with spy gear and a dash of acoustic time travel? Well, you can't, yet. But, this little gadget still has some great ideas behind it. I'm Michael Fisher and this is Kapture, the wearable that's always listening. The idea behind Kapture is simple. It sits on your wrist and records. If the green light is blinking, it's on, recording every moment with an omni-directional microphone that picks up anything within about a five foot radius. Before you start fretting about our modern surveillance state dystopia, understand that this doesn't mean you finish each day with 12 hours of raw audio. In fact, Kapture's always recording over itself. The longest it keeps audio in storage is 60 seconds before it's overwritten. To save those 60 seconds, you double tap. Kapture connects with your iPhone or Andriod via Bluetooth, transfers the audio file to its companion app, and bingo, you've just saved the last minute of sound. If your phone isn't nearby, Kapture can store up to 25 clips locally to transfer later. For me, most everything good about Kapture is in the concept. The idea of preserving acoustic moments in time is alluring if you like taking audio notes at lectures, or you have a lot of funny friends, or I imagine if you have a toddler that's just learning to talk. As a kid who watched Home Alone two way too many times, I used to take a Yak Bak or a Talkboy to school to record portions of my day. Kapture is the modern and much smarter equivalent of those early toys. Its app also gives you the ability to edit, enhance and share your clips with others if you want. Or, you can use it to turn the Kapture into a more conventional Bluetooth microphone. If that still sounds creepy, keep in mind that it's pretty tough to stealthily spy on people with a Kapture. For one thing, it's a pretty obvious device especially in its more flamboyant colors. For another, you need to really whack it to save a clip. So hard that it's basically impossible to be discrete about it. There are legal considerations too. Some states, like Massachusetts, make it a crime to record conversations unless both parties have given consent, not just one. All you budding secret agents out there, keep that in mind. For all the simple genius of the concept, Kapture falls short on user experience. First off, this is a gadget that talks to you via LED flashes and wrist vibrations, and that interface takes a lot of getting used to. Second, the 15 hour battery life means you'll be charging it every night. The charger is miserable. Despite its magnets, it almost never makes a firm connection, so you have to situate it just right. On top of this, Kapture itself is pretty chintzy. I've been using it for about a month, and neither the rubber wrist band nor the soft plastic grill are aging well. The wrist band also has an annoying habit of partially popping off if I accidentally knock my wrist against a door frame, which I do all the time. While it is water resistant, which I like, the overall package otherwise just screams cheap. The thing is, Kapture isn't cheap even at its newly discounted price. That being said, I really want it to do well enough to justify a sequel. A Kapture two with better build quality, a charger that works right, and an accelerometer that doesn't make you beat the hell out of it, that would absolutely be worth a Benjamin. Because we all have those moments we only realize are precious in retrospect, and Kapture is the only thing I've ever seen that let's us go back and save them, even if only in an acoustic sense. Mr. Mobile drops new vidoes twice a week folks. Subscribe so you capture them all. 'Till next time. Thanks for watching and stay mobile my friends.",
    "transcript_keywords": [
        "Kapture",
        "mix wearable tech",
        "acoustic time travel",
        "mix wearable",
        "wearable tech",
        "wrist",
        "time travel",
        "Michael Fisher",
        "audio",
        "time",
        "spy gear",
        "acoustic",
        "pretty",
        "travel",
        "save",
        "Bluetooth",
        "dash of acoustic",
        "wearable",
        "thing",
        "mix"
    ],
    "transcript_entity_values": [
        "the 15 hour",
        "First",
        "Second",
        "the last minute",
        "a Yak Bak",
        "my day",
        "Andriod",
        "Talkboy",
        "those 60 seconds",
        "12 hours",
        "Massachusetts",
        "Kapture",
        "Mobile",
        "60 seconds",
        "iPhone",
        "Michael",
        "two",
        "Benjamin",
        "up to 25",
        "about a month",
        "Michael Fisher",
        "one",
        "about a five foot"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORDINAL",
        "ORDINAL",
        "TIME",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "TIME",
        "TIME",
        "GPE",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "QUANTITY"
    ]
}