{
    "id": "PmP8QZZ6QjE",
    "title": "Building the Ultimate $200 MacBook",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-01-19T15:01:38Z",
    "video_url": "https://www.youtube.com/watch?v=PmP8QZZ6QjE",
    "category": "Science & Technology",
    "tags": [
        "macbook",
        "mac",
        "apple",
        "laptop",
        "diy",
        "tech",
        "computer",
        "upgrade",
        "2018",
        "austin evans"
    ],
    "views": 3061077,
    "likes": 59196,
    "comments_count": 3601,
    "description": "What happens when I take a 2009 MacBook and go WAY overkill upgrading it? Gaming on a $200 MacBook:  Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "https://www.youtube.com/watch?v=p1gedwoyfbU",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey, guys, this is Austin. You may have caught a video where I tried to game on this $200 MacBook, and it actually kind of worked, but today, we're here with part two, where I'm going to give it a few choice upgrades. So this is a 2009 white MacBook, outfitted with a blisteringly fast Core 2 Duo processor, four gigabytes of RAM, and currently NVIDIA GeForce 9400M graphics. That might not sound impressive, but this guy's actually still fully supported on the latest version of MacOS High Sierra, which got me thinking, can we actually make this a usable MacBook for 2018? Thankfully, this is back when Apple made MacBooks that you could kind of work on. So the first thing we see is our 250 gig hard drive, which that guy's definitely gotta get out of here. There's also the optical drive, which we're going to be replacing. The battery, it still technically works in this machine, but it's pretty old, so we're going to replace that. We've got the memory. This is not that bad looking to work on. Now, depending on what you're doing, normally you don't actually have to remove the battery but because we just need to swap it out anyway, it's just going to make it a little bit easier to get at some of the other components here. With that out of the way, now I'm going to remove the hard drive. So, even though the 250 gig hard drive in here actually does work just fine, we've got something just a little faster in mind. Next step is to remove the optical drive. Now, while it is kind of nice to have it here, I actually want to go with RAID SSDs because you know we do practical things on the channel. There we go. Now, we just pull this cable out, and we have one optical drive that has been freed from our MacBook. Now we're ready to start rebuilding the $200 MacBook. So the main reason to remove the optical drive is to use an OWC data doubler. The idea here is that instead of being able to waste all that space on a DVD drive, which honestly, I'm never going to use, we can actually put an additional SSD inside. The idea here is that we should just be able to drop it right into place, if I can flip it the correct orientation, and it should just sit like that and give us our SSD. One of the main things that makes an older computer like this feel slow is the mechanical hard drive, but we can fix that with a pair of 500 gigabyte WD blue SSDs. Now one of these by itself would probably be pretty quick, however, two of these in a RAID, it's going to be a little goofy. So I think with that, we have our first SSD installed. All I need to do is put this bracket back in place, and we can move on to the next one. Perfect, so now we have one terabyte of SSD storage in our lowly $200 MacBook. The next step is to upgrade the memory. So this laptop originally shipped with two gigs of RAM, and at some point someone upgraded it to four, however it does technically support eight gigs of RAM. I've got to say, there's something cool about the idea of taking a MacBook that for most people is kind of considered old and obsolete and actually giving it some love. It's kind of weird to think that in the future new computers really are not this upgradable. It's pretty much you get what you get, and that's all that there is to it. Now we have the fun part. This is a replacement battery. So this original battery is totally fine, but the issue is because it's so old and it has so many cycles, while it does keep a charge, it's going to last 20-30 minutes, and a lot of MacBooks at this age, the battery's just completely flat, but the good thing is you can still order replacements off of Amazon. Now generally speaking, I don't recommend getting third party batteries for laptops. However, in this case, you're not going to have any luck getting one straight from Apple, so this should actually work just fine. Alright, it is moment of truth time. Let's plug this guy in, in case the battery is actually dead out of the box. Shows charging. (yells happily) So it should give us the disc error because there's no OS installed, but that looks like we might actually have a working MacBook. Now comes the fun of replacing the keyboard. Now there's nothing wrong with the keyboard that's on this right now. However, it's the older white style, whereas what we ordered here is a set of MacBook Pro keys, which should look a little cooler. There are a couple of ways of doing the keyboard swap, but what we did was we just removed a bunch of the keys and swapped them out with the black ones, and if you really want to go crazy with it, you actually can replace the entire keyboard all in one piece, however, that requires you to basically take apart the entire computer. If you guys caught our first video, one of the biggest problems with this guy is that not only is the back panel a little scratched up, but there's also a crack in the actual screen assembly. So while we could actually swap out the entire shell, that's also a lot of work, and instead, we can just cover it up. So this is a semi-transparent shell, so first of all, it's going to look a lot nicer than the scratched up bottom that we have here, but in addition to the keyboard cover, which we don't need, because we have a legit keyboard now, we also have a bottom shell for it. So while maybe this isn't the best-looking MacBook in the world, it's a lot better than it was before. But my real question is what exactly can you do on this MacBook in 2018? After using the MacBook for a week or so, I've got to say, it's actually surprisingly usable. For normal stuff like listening to Spotify, writing things up in Google Docs, and juggling a few tabs, it feels downright snappy. I'll totally admit using two SSDs is complete overkill. So I wanted to run them both in RAID, however, the way that High Sierra actually handles RAID right now is a little bit buggy, so I ended up just installing the OS to a single drive, but it still makes a huge difference. It's so much faster. Jumping up to eight gigs of RAM also makes a big difference. MacOS, especially the most recent versions, really do appreciate at least eight gigs. One of my big worries going into this was that the Core2 Duo just wouldn't be able to hold up, and while yes, a processor from 2009 in a laptop doesn't sound too impressive, when you actually run it through GeekBench, it's not bad. It's right up there with modern day lower-end parts, such as Celerons and Pentiums. Now don't get me wrong. Throw more than a few different tasks at it at once, and it will definitely start to slow down, but as long as you treat it with the respect that a 2009 MacBook deserves, you can definitely get work done on this guy, and a big part of that is because it is running a fully up-to-date version of MacOS High Sierra. Sure, who knows if it'll ever receive another major MacOS update, and some apps don't like the Core2 Duo, but for the most part, it's just like using a modern MacBook. You're pretty much getting all of the features, including iMessage and even Siri. What's especially impressive is that even some high-end apps like Final Cut work, and I'm being serious. You can load up some 1080p video, 4k is a little bit too much for the MacBook to handle, and even the most recent version of Final Cut 10.4 is actually able to handle it pretty well. Now you will need some patience when it comes to the render side of things, but again, this is a 2009 MacBook that I bought off of Ebay for $200, and I'm editing actual HD video inside Final Cut, so yeah. While our keyboard swap really isn't for anything besides show, it does still hold up today. So not only does it have a lot more travel, but it just feels a little bit more natural than the newer butterfly switches in current MacBooks. I've also been pleasantly surprised with the trackpad. Somehow, almost ten years later, this is still better than most Windows laptops. So you're getting everything you like, including that solid tracking, you're getting plenty of multi-touch gestures, like three fingers to swipe between spaces, and more importantly, it just feels natural, something that so many trackpads do not get, especially when you're paying $200 for them. Port-wise, while I do miss USB 3.0, Mini DisplayPort is nice if you want to go out to an external monitor, up to 2560x1600 in resolution, and MagSafe is still one of my favorite ways of charging a laptop ever. Even with that fresh battery though, you shouldn't expect 2018 levels of battery life. So I'm averaging about 3-4 hours with moderate usage. You can get a little bit more if you turn the screen brightness down, but it's just kind of okay. So should you go out and load a 2009 MacBook with a terabyte of SSD storage? Probably not. But unlike a lot of our builds, this actually makes sense. Picking up a used MacBook and investing in some upgrades like the battery, memory, as well as an SSD, really will get you an experience that's going to be better than a lot of budget laptops. Honestly, I would rather use this. So, what do you guys think about our super awesome ultimate 2009 MacBook? This has actually taken a turn I didn't expect, but it's actually kind of cool. Anyway, let me know what you guys think, and I will catch you in the next one.",
    "transcript_keywords": [
        "MacBook",
        "drive",
        "SSD",
        "battery",
        "hard drive",
        "optical drive",
        "work",
        "kind",
        "High Sierra",
        "Final Cut",
        "gig hard drive",
        "lot",
        "keyboard",
        "Austin",
        "MacOS High Sierra",
        "RAID",
        "RAM",
        "guy",
        "SSDs",
        "RAID SSDs"
    ],
    "transcript_entity_values": [
        "MacBooks",
        "Mini DisplayPort",
        "Final Cut",
        "2009 MacBook",
        "Spotify",
        "third",
        "Final Cut 10.4",
        "three",
        "MacBook",
        "2018",
        "WD blue SSDs",
        "3-4 hours",
        "MacBook",
        "first",
        "four gigabytes",
        "RAM",
        "iMessage",
        "Amazon",
        "eight",
        "250",
        "Austin",
        "two",
        "Ebay",
        "Apple",
        "Windows",
        "at least eight",
        "four",
        "2009",
        "Google Docs",
        "MacOS",
        "one",
        "2560x1600",
        "Core 2 Duo",
        "MacBook Pro",
        "almost ten years later",
        "200",
        "one terabyte",
        "NVIDIA GeForce 9400M",
        "500",
        "20-30 minutes",
        "a week or so",
        "SSD",
        "High Sierra",
        "GeekBench",
        "MacOS High Sierra",
        "4k",
        "USB 3.0",
        "One",
        "Siri",
        "OWC",
        "today",
        "Final Cut",
        "MagSafe"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "FAC",
        "DATE",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "FAC",
        "ORG"
    ]
}