{
    "id": "PndXdtKnHmE",
    "title": "iPhone 6s or Galaxy S7?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-08-23T16:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=PndXdtKnHmE",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "iphone",
        "iphone 6s",
        "6s",
        "iphone 6s plus",
        "iphone plus",
        "apple",
        "samsung",
        "galaxy s7",
        "samsung galaxy s7",
        "android",
        "iphone vs android",
        "s7",
        "s7 edge",
        "note 7",
        "vs",
        "best",
        "smartphone",
        "iphone 7",
        "galaxy",
        "2016",
        "iphone 6",
        "video",
        "android (operating system)",
        "apple iphone",
        "phone",
        "apple inc. (publisher)",
        "smartphone (video game platform)",
        "galaxy s7 edge",
        "comparison",
        "cool gadgets",
        "apple iphone 6s",
        "plus"
    ],
    "views": 5816998,
    "likes": 327898,
    "comments_count": 1647222,
    "description": "PLEASE READ THIS DESCRIPTION FOR COMPLETE DETAILS  The last giveaway was incredibly popular and I was able to give many new iPhones to viewers but I had to shut it down the after a few issues were brought to my attention. The most critical issue was commenters being targeted by phishing scams. Commenters being told that they won by a third party scammer and then asked for credit card numbers etc. (to cover shipping). This time around, I've devised a plan in conjunction with a fulfillment partner to eradicate that problem while shipping phones to winners in a timely manner. The steps are as follows -  1. All winning user names and youtube URLs will be listed on this official dbrand website -   2. After you've been selected you'll receive a YouTube DM that includes a validation code and further instructions. To view your YouTube DMs visit   3. You will never be asked for a credit card, please don't provide that to anyone in your inbox ever!  4. Winners will simultaneously be announced on dbrand's twitter page if that's easier for you to follow / track -   5. If your name doesn't show up on the official list, you have not won!!! Don't listen to potential scammers looking to exploit you, real winners will be listed AND receive a completely unique validation code.  6. YES, they are all real, brand new phones. Check my social media if you'd like more images etc.  7. If you win, please post an image to social media to let people know.  8. Good luck!  I had always intended on resuming this massive giveaway but after a few roadblocks (scammers, fulfillment and managing daily uploads etc.) it remained paused. I'm grateful to dbrand skins for offering to help with the difficult task of actually managing such a massive undertaking. This is a much more professional approach to the giveaway concept and a necessary development at this scale. Last time around I underestimated the background tasks involved, this time there's a team in place to counter the issues I faced originally. We're even going to have a dedicated person JUST to monitor the comments section for shady impostors.   So what's it gonna be, iPhone or Android? :)  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://dbrand.com/winners",
        "http://youtube.com/messages",
        "http://twitter.com/dbrandskins",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys, Lew here with another video and as you can tell, it's a little bit unusual there are a lot of phones on this table that's because I am... Rebooting... the massive phone giveaway with a little bit of a twist there was a video, a while ago, I did with a truck full of iPhones I had the intention of giving away an insane number of phones I didn't, get a chance, to complete that not to the extent that I would want a lot of people got new phones but I wanted to do more problem was I was having all kinds of trouble with fufillment I mean I had a back and forth DM with a guy from Latvia, who won It ended up taking us over a month to get him the right phone and a winner in India Where I just ended up buying a phone of Amazon, and sending it to them directly just because I didn't want to be bothered with sending, one of these Then on top of that The scammers, the fraudsters, people who were hitting up other individuals inboxes on YouTube claiming that they had won, in order to extract information from them and exploit them and get credit card info A lot of bizarre stuff was going on That video was so popular, that I had to shut it down I had to put it on pause But the intent was to always give back to it Infact I was preparing to get back to it As you can tell One of the criticisms last time was, ''Hey Lew, what about the Android fans in the audience?\" OHH, you may have noticed an abundance of Galaxy S7's We've added these to the mix Just to make it one step better Now How we gonna do it right this time? How we gonna make sure That there is an efficient, and effective manner for picking winners, and sending these out to winners. In a verifiable way So what I did was I hit up my friends over at D-Brand If you don't know D-Brand, they making all those fancy skins for phones That you probably seen floating around Social Media If not, the link is down below They ship phone skins all over the world, they are worldwide shipping people So I said, \"Can you help me out?\" They said, \"Sure\" \"We can help out, that's our expertise\" and so, we together created a dedicated website for tracking winners and all these shipments for winners, are gonna go out via FedEx, trackable All I'm asking, from you guys Is tweet a picture, or put a picture on Facebook, put something on Social Media, after you receive the device So anybody looking into it can say, \"Okay, that's a legit phone\" Just leave a comment down below Let me know if it's Android... Or if it's iPhone maybe say why? Just spur up a little conversation then check that special website on D-Brand, again the link down below, where winners will be published on a timeline on a clock, you are not gonna be sitting around forever they are gonna be so much better, at doing this the right way Than I was I'm a video maker Alright The original giveaway, was insanely ambitious This one is too But that's the beauty of it, that's what makes it special and that's what makes Unbox Therapy different Everything I just talked about will be down in the description, so head down there These phones... will find.. new homes... Who knows? It might be yours",
    "transcript_keywords": [
        "Hey Lew",
        "Social Media",
        "bit unusual",
        "phones",
        "phone",
        "winners",
        "video",
        "Lew",
        "lot",
        "makes Unbox Therapy",
        "back",
        "sending",
        "people",
        "video maker Alright",
        "Android",
        "put",
        "info A lot",
        "lot of bizarre",
        "bit",
        "massive phone giveaway"
    ],
    "transcript_entity_values": [
        "YouTube",
        "Android",
        "Amazon",
        "One",
        "Social Media",
        "Lew",
        "India",
        "iPhone",
        "Facebook",
        "Galaxy S7's",
        "Latvia",
        "D-Brand",
        "one",
        "FedEx",
        "iPhones"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "NORP"
    ]
}