{
    "id": "PNLEXAwpCsE",
    "title": "How to EXTRACT TITANIUM from the iPhone 15 Pro Max?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-09-30T14:06:00Z",
    "video_url": "https://www.youtube.com/watch?v=PNLEXAwpCsE",
    "category": "Howto & Style",
    "tags": [
        "iPhone 15 pro max",
        "iPhone 15 pro",
        "Titanium",
        "Melting Titanium",
        "Melting aluminum",
        "melting iphone",
        "extracting titanium",
        "titanium iphone",
        "apple iphone",
        "new iphone"
    ],
    "views": 2021099,
    "likes": 83347,
    "comments_count": 2776,
    "description": "Today we take a brand new Apple iPhone 15 Pro Max and extract all of the titanium from the frame. HUGE thanks to Nate for letting us borrow his furnace!  check out his channel! The new Apple iPhone 15 Pro lineup has titanium in the frame. But how much titanium is in the iPhone frame? Well there is only one way to find out, and thats with FIRE! And of course an XRF machine. X-ray florescence is a really easy way that metal recyclers can tell the difference between different types of metal.   Get my JerryRig Razor knife HERE:   Follow me for updates!  Instagram:   Facebook:   Twitter:    LARGE tool kit:   Travel Tool Kit:   Mega Tool Kit:   Plastic Pry tools:   Metal phone opening tool:   The camera I used to film this video:  (GH6   The Lens I used for this video:   Wide angle lens:   And this Metabones adapter:   This is the drone I use:    TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video. JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video. Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result. Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.youtube.com/@NFTI",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://amzn.to/3JEuTXs",
        "https://www.youtube.com/@JerryRigEverything/about"
    ],
    "transcript": "So Apple says they have combined titanium and aluminum with something called solid state diffusion, and we've tested that. We know there is titanium on the outside and aluminum on the inside. But today we're going to separate the two and see exactly how much titanium is left. I'm here with Nate from the internet and he has a furnace. Nate, what temperature does aluminum melt at? - It's about 1500 degrees Fahrenheit. - And titanium melts at 3000. So putting everything inside of this crucible, this furnace, we should only be left with titanium after it's all over. Let's get started. [Introduction] So it's a little bit loud, but the reason we're doing this is because aluminum and titanium have totally different properties. The aluminum is going to melt away like a chocolate bar leaving behind any peanuts or something that was left inside. - And that is furnace only gets up to about 2000 F. So no matter how long we leave it in here, it's never going to touch with titanium. - The titanium should still be left in one piece no matter...no matter what. And then we can see if the buttons are titanium or if Apple just stuck aluminum buttons in a titanium frame. You never know! And this is the only way to find out. - This furnace uses high volumes of propane that are shot out through jets that are designed to pull in air behind it, giving a perfect mix ratio of propane and air. In the furnace itself, because of the angle of the burners, the flames are swirling around, giving a nice distributed heat around the crucible, and it does a great job of bringing pretty much anything you put into it up to about 2000 Fahrenheit. - Too high. - Now you got stuff on fire. - Look at that. - something's burning - Saying fire is the only way to analyze a material is kind of a stretch since there are multiple scientific ways to analyze alloys without destructive testing, one of which is with a desktop XRF machine. And since we have a few minutes while this furnace gets up to 2000 degrees, we can go over the results of my scans. Video recording wasn't allowed in the XRF lab, but they did let me take some pictures. Keep in mind I'm no expert, but an X-ray fluorescence machine works by beaming down X-rays onto a material and seeing how each different element reacts. Elements produce their own unique fingerprint of sorts when hit with the XRF analyzer, and that fingerprint allows us to see exactly what and how much of an element is inside a metal. when we look at the fingerprint of Apple's grade 5 titanium iPhone 15 Pro Max. we can see that indeed our xrf scans line up exactly with where a grade five titanium alloy would land. A Grade 5 is a mix of titanium, aluminum, and vanadium. All of which are present in their correct amounts in the scan without even needing to factor in a margin for error. So thumbs up for that. Nice work Apple. Grade 5 is truly impressive. The internal frame material, which Apple says is 100% recycled aluminum, is in fact 100% recycled aluminum. Apple normally uses 7000 series on the outside of their phones, which has zinc in it. But since we aren't seeing any zinc, I imagine Apple's using something softer and easier to work with for their solid state diffusion, which is a process I would love to see. And while seeing non-destructive digital scans of materials is always informative, let's get back to the destructive analysis. After getting up to temperature for about 10 minutes. I can see the aluminum start to separate from the titanium. Pulling a little bit down at the bottom. We'll put the lid back on for a little bit longer and toast it the rest of the way. It's cool to see how they separate though. Oh that is so hot. Alright, interesting. So the buttons are also titanium. Those did not melt away. There's your puddle right there. Hey, that's the aluminum. Wow. Wow, that's crazy. Interesting that the coating of the titanium still stayed on as well. It looks like not only the aluminum melted away into a puddle, but also the antenna lines burned away, leaving us with just the titanium exoskeleton that Apple fused to the inner aluminum frame. We will give that a few minutes to cool down before we grab it. I'm nervous to grab anything silver. Alright, so this was the power button. Still got your scratches from your scratch test. There we go. Ah, cool. We have the volume buttons. Interesting that the upper volume button has lost its coating. And then this is probably the charging port. Is that the USB-C? The USB-C ring? That's interesting. Didn't think that was titanium. Put that down here. Oh, is this the 5G antenna slot? Weird. And then this must be the top. Is that the top? Yeah, it's got to be. So this is this side over here. Archeology. That officially satisfies my curiosity. This is all of the titanium inside the new iPhone 15 Pro Max. And here's the aluminum. Melting down an ice cream sandwich and leaving behind just the cookie. very very true. Apple said the inside was 100% recycled and we just recycled it again. Not sure. If it's usable or not. - For something. - Yeah. Anyway, thanks for joining us. This used to be a cell phone. Thanks a ton for watching. And I'll see you around.",
    "transcript_keywords": [
        "titanium",
        "aluminum",
        "Apple",
        "furnace",
        "inside",
        "XRF",
        "combined titanium",
        "grade",
        "left",
        "Pro Max",
        "buttons",
        "interesting",
        "recycled aluminum",
        "recycled",
        "melt",
        "Apple grade",
        "Fahrenheit",
        "Nate",
        "material",
        "matter"
    ],
    "transcript_entity_values": [
        "iPhone",
        "7000",
        "15",
        "3000",
        "about 10 minutes",
        "100%",
        "two",
        "Pro Max",
        "2000 degrees",
        "Nate",
        "5",
        "Apple",
        "five",
        "XRF",
        "a few minutes",
        "today",
        "about 1500 degrees Fahrenheit",
        "Fahrenheit",
        "about 2000",
        "xrf",
        "one"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}