{
    "id": "PO3TiJvI0DA",
    "title": "Las Vegas' Mormon Mafia",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2019-01-21T17:35:15Z",
    "video_url": "https://www.youtube.com/watch?v=PO3TiJvI0DA",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "las vegas",
        "vegas",
        "mafia",
        "thats how mafia works",
        "nevada",
        "mgm grand",
        "pink flamingo",
        "mob",
        "the mob",
        "las vegas strip",
        "mafia city",
        "mafia city meme",
        "casino",
        "that's how mafia works meme",
        "mgm",
        "level 35 boss",
        "las vegas nevada",
        "vegas strip",
        "gambling",
        "pewdiepie",
        "las vegas hotels",
        "mgm grand las vegas",
        "slot machine",
        "mafia city ads",
        "caesars palace",
        "vegas casino",
        "las vegas 2018",
        "rdr2",
        "howard hughes",
        "mormon",
        "mormon mob",
        "memes",
        "meme"
    ],
    "views": 98411,
    "likes": 3311,
    "comments_count": 207,
    "description": "Vegas was founded by a bunch of level 100 bosses.   How Apple Doesn't Pay Taxes:  This Song Has Been Played More Than Despacito:   How the Bat Bomb Almost Won World War 2:  How Scooters Are Taking Over the World:  The $2 Billion Solar Death Ray:   Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/tSkCEyWCCPM",
        "https://youtu.be/bbTKxC4eveI",
        "https://youtu.be/UG5Sd0mWmfk",
        "https://www.youtube.com/watch?v=sQkPqPsik9o",
        "https://www.youtube.com/watch?v=ZR_oGbx8O8E",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is how the mob made Vegas. Every time I visit Vegas, I'm struck by just how unique it is. The skyline is filled with glittering casinos, opulence is absolutely everywhere, and yet, the seedy underbelly of Sin City still remains. Las Vegas originated as a trade hub along the old Spanish Trail. The name Las Vegas literally translates to the meadows, which is a great place to be when you're in the middle of the desert. The area of Las Vegas was a convergent point of three major railways, the San Pedro Line, the Los Angeles Line and the Salt Lake Line. But in 1905, with a new century dawning, it was time for these railroads to give up some of their land and so they sold it and Las Vegas was formed. One of the stipulations set up by the railroads was that only the 16th and 17th blocks would be allowed to serve alcohol. And as you would expect, this very quickly became the hub of all of the wonderful drinking and Red Dead Redemption action of Las Vegas in 1905. However, the stipulation was short lived. After a few short years, alcohol was made legal citywide. This meant that the hotels on Fremont Street could sell alcohol, which of course, was very popular with the guests. But what that also meant was that our good old friends at block 16 and 17 needed a new competitive advantage. Can you see where I'm going with this? Prostitution! I don't think anyone knew that that was where I was going. The saloons became brothels, offering prostitution and gambling and this is where they earned the name Sin City. This newly created red light district attracted people from all over and especially organized crime. One mob boss in particular, Jim Ferguson, became especially notorious during prohibition. In addition to owning a popular brothel, Ferguson also had a network of bootleggers and distribution. Even though they were illegal in the country, vices such as gambling and drinking were actually still pretty much ignored by the Nevada government. The fun didn't last long. After a series of run-ins between rival gangs, the state decided to start electing officials who could quote, \"clean up the unsatisfactory moral condition of the city.\" However, this didn't quite work out as intended. Good old Jim Ferguson quickly struck up a deal with the newly elected officials, such as the mayor and the police chief. In exchange for regular donations, Ferguson, and only Ferguson, was allowed to basically operate without having to worry about the police. Being a good business man, he then, of course, charged a protection fee to his bootleggers for the protection. Because corruption's great, guys. Without that immunity, his competitors were very quickly pushed out of business. By the time prohibition ended and alcohol was legal again in the United States, pretty much all alcohol distributors in Nevada were owned by the mob. In 1931, when Nevada legalized gambling, the very first official casino was open in Las Vegas, known as the Pair O' Dice Club. That's a mirror construction of the nearby Hoover Dam project meant that there was a ton of new people coming into Las Vegas who just wanted to blow off some steam and hang out at the Pair O' Dice Club. I just love saying Pair O' Dice. It's like, it's clever. I'm easily impressed sometimes. Seeing the potenial for larger casinos, notorious mob boss Bugsy Siegel saw the opportunity to build his own. He originally tried to open on Fremont Street but city officials, aware of his reputation for murder, decided that maybe that wasn't such a good idea. Now he tried, in vain, to argue that, hey, we only kill each other and not, you know, normal people, for some reason, the city really just wasn't having it, and so he decided to come up with a little bit of a different plan. In 1941, Siegel setup shop right outside the Las Vegas city limits in unincorporated area known as Paradise. Because Paradise is an unincorporated area, what that means is that it doesn't have to pay taxes to the city of Las Vegas, and importantly, it is not underneath it's jurisdiction. So even though those guys might now be okay with, you know, mob people murdering each other, it's their problem in Paradise. Totally fine, don't worry about it. - Fu-get about it. - Paradise didn't have the normal amenities that a city offers, such as a police force, however, the mob had plenty of their own enforcers to serve that particular role. And by serve that role, I mean break your arms if you tried to cheat the casino. What's interesting is, if you visit Las Vegas today, it's actually not technically Las Vegas. Paradise still exists and it's where basically all the major casinos on the strip are, the airport. It is all in the unincorporated territory of Paradise. In 1966, billionaire, director, aviator and slightly crazy person Howard Hughes, rented a room at the Desert Inn. Hughes was notoriously reclusive and bizarre and he spent the next month in his room, not leaving once. He even bought a local T.V. station because they weren't playing his favorite programs late at night. When the hotel threatened to kick him out, Howard Hughes did what he does best and bought the entire hotel. Over the next several months, Hughes decided to buy up more and more hotels in Las Vegas and to oversee them, he hired an entire team of Mormons. Because, actually, he had some good reasons. I'll give him that. Kinda made sense. This team became known as the Mormon Mob. Now no, it wasn't something as exciting as a Mormon crime ring that decided to roll into town and brute force everyone out. Instead, it was a much more scary group of individuals, attorneys and bankers. Over the next several months, Hughes bought up more and more of the mob owned hotels and started to change Vegas into what we know it as today. All the mob owned casinos have either been torn down or bought out at this point and when you look at Las Veags in 2019, it is very much dominated by just a handful of corporations such as MGM and Ceasars. So the next time you visit Las Vegas, or Paradise, I guess, just know that all the unbelievable wealth that's in that city, had a little bit of a nefarious past.",
    "transcript_keywords": [
        "Las Vegas",
        "Vegas",
        "visit Las Vegas",
        "Las Vegas city",
        "Las",
        "Las Vegas originated",
        "Las Vegas literally",
        "Las Vegas today",
        "technically Las Vegas",
        "City",
        "mob",
        "Paradise",
        "San Pedro Line",
        "Los Angeles Line",
        "Salt Lake Line",
        "mob made Vegas",
        "Pair OF Dice",
        "Ferguson",
        "visit Las",
        "Vegas city"
    ],
    "transcript_entity_values": [
        "a new century dawning",
        "late at night",
        "16th",
        "Ceasars",
        "the Desert Inn",
        "Mormons",
        "the Salt Lake Line",
        "the San Pedro Line",
        "1966",
        "1941",
        "T.V.",
        "the Pair O'",
        "three",
        "Las Veags",
        "the Los Angeles Line",
        "today",
        "the next month",
        "1931",
        "Fremont Street",
        "the next several months",
        "Siegel",
        "Ferguson",
        "1905",
        "Howard Hughes",
        "17",
        "Vegas",
        "Jim Ferguson",
        "MGM",
        "the United States",
        "Paradise",
        "the Pair O'",
        "Las Vegas",
        "Hoover Dam",
        "Hughes",
        "One",
        "2019",
        "16 and",
        "Spanish Trail",
        "the Mormon Mob",
        "Mormon",
        "Nevada",
        "a few short years",
        "Dice Club",
        "first",
        "Bugsy Siegel",
        "Sin City",
        "Red Dead Redemption",
        "a ton"
    ],
    "transcript_entity_types": [
        "DATE",
        "TIME",
        "ORDINAL",
        "LOC",
        "FAC",
        "ORG",
        "LOC",
        "FAC",
        "DATE",
        "DATE",
        "ORG",
        "EVENT",
        "CARDINAL",
        "FAC",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "FAC",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "GPE",
        "PERSON",
        "ORG",
        "GPE",
        "LOC",
        "FAC",
        "GPE",
        "FAC",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "LOC",
        "ORG",
        "NORP",
        "GPE",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "GPE",
        "PRODUCT",
        "QUANTITY"
    ]
}