{
    "id": "pOI2gTNuGn8",
    "title": "Why, HDMI? Why??",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-12-30T02:18:09Z",
    "video_url": "https://www.youtube.com/watch?v=pOI2gTNuGn8",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "HDMI",
        "CES 2022",
        "HDMI 2.1a",
        "standards",
        "specifications",
        "spec",
        "HDMI spec",
        "announcement",
        "CES news"
    ],
    "views": 569787,
    "likes": 32216,
    "comments_count": 889,
    "description": "Thanks to Secret Lab for sponsoring today's video! Check them out at    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 Call me Father Tech News 0:09 HDMI 2.1a sucks 1:03 ROG Z690 Hero motherboards on fire 1:52 Radeon Super Resolution 2:45 Secret Lab 3:15 QUICK BITS 3:23 Log4j crypto mining hack 3:54 Fortnite outage 4:32 China complains about SpaceX 5:02 Waymo partners with Geely 5:27 Alexa tries to kill   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  They're Just Movies podcast:",
    "description_links": [
        "https://lmg.gg/SecretLabTL",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/vA6yL",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/TheyreJustMovies"
    ],
    "transcript": "- Christmas may be over, but we've still got more gifts for ya. - [James] What is it? - It's tech news, It's always... It is... - [James] It's always been tech news. - What did you think it was? After making some confusing changes to HDMI 2.1, the HDMI forum is digging their confusing standards hole even deeper, according to reports claiming that the all new HDMI 2.1a specification will debut at CES 2022. - [James] Aye! - Which no one is actually attending. - [James] Aye, you got me. - It's gonna be like Tumbleweed blowing between the exhibits, but they will have RGB LEDs so, now I wanna go. HDMI 2.1a is expected to introduce a source based tone mapping feature which will help displays better adapt to both HDR and SDR content but it won't be a required feature of 2.1a. You may see a product box with an HDMI 2.1a label but it won't mean (beep) because you'll still have to look on the back for the actual features. I don't know why this is so hard? It's like the HDMI forum wants us to yell at them. Do you like this? - [James] Do you ? - Reports of ASUS ROG Z690 Hero Motherboard's catching fire serve us down Reddit last week and turns out it's not only because their owners had transcendent to a higher level of pwnage and they just didn't notice cause it was like. What? After investigative videos posted by JayzTwoCents, Buildzoid's and other's. It become apparent that certain dials on the units were sauder in reverse polarity making impossible to potentially identify which board's were in greater risk of providing some extra heat to those cold clammy gamer hands. But now that's no longer necessary as ASUS acknowledged the issue today and will be announcing a recall and replacement program. If you've got Z690 Hero Motherboard I suggest you participate. Unless you've already assented to a higher plan yourself and then your house burns down. I mean you gonna have some cred. And ADM's expected to take their upscaling technology FidelityFX Super Resolution to the next level by announcing Radeon - [James] Super-duper resolution. - Super-duper mega-omega resolution, no it's called Radeon Super Resolution. I mean it does roll of the tongue a lot better. Video cards reports RSR will be implemented directly in Radeon Graphics Drivers allowing the feature to be enabled in nearly any game without any work on the Developers part. - [James] Wow! - This is super cool but to be super clear, other than the driver thing it sounds like RSR is just basically FSR. Uh.. but it still probably not as good as NVIDI's DLSS. - [James] We know. - But even though AMD is doing great right now, I still feel the need to cheer on every slightly cool thing they do, most of because Jensen comes off like he is, he is god's gift, you know it's like, you like leather. We get it, you know, you are physically imposing, you could kill me I get it. Now it's time for quick bits brought to you by Secret Lab, maker of chairs engineered to keep you so comfortable during those long hours at work and play, you may not even notice your motherboard is on fire. It's that comfortable. There new Titan EVO 2022 chairs has four way lumber support, super comfy seat material options and like all secret lab chairs comes with up to a 5 year extended warranty and 49 day return policy. - [James] Not 50. - How does Secret Lab make these chairs so good? Learn the secrets yourself, click the link below after the video. James, I thought about calling them quick blips but then I'd have to like explain everything like, \"What is that?\". - [James] It's blip, they are short. - Uh... Hackers continue to recavic with the Log4j shell exploit, with one group using it to hijack HP produced servers at an unknown company and mine about a 110,000 dollars worth of Raptoreum crypto currency. - [James] Raptoreum bullish grow. - What does that mean? - [James} I don't Know what that Is. - The hackers activities were publicly viewable on the Raptoreum blockchain which shows why we need the blockchain because if the hackers mined US dollars we probably would've never found out. - [James] Put the shovel on the ground and here they were. (chuckles) - Ding ! Fortnite suffered a lengthy outage this morning with players unable to log in. They were instead greeted with a message telling them, they did not have permission to play Fortnite. - [James] This is Tim Apple all over it. (laughs) - This is Tim. He is in the system, \"there we go like this\". Some observers are noting a similar messages shown to children in China who have already used up their three hour allotment of gaming time per week. And hey, wait a second, Tencent owns 40% of Epic Games meaning we must conclude that Tim Sweeney is trying to enroll all of the U.S. in Chinese grade school, I knew it. - [James] No! - We would all fail, we would not make it through. Speaking of China, the country's government filled a complaint with the United Nations claiming it's under construction Tiangong space station had to conduct evasive maneuvers twice this year to avoid collisions with SpaceX's Starlink internet satellites. Elon Musk rejects claims that Starlink is taking up too much room up there though saying it's simple traffic management problem. And the idea that Musk is firing satellites at Chinese space station with a big giant satellite launcher gun is ludic, who said that? That's not happening. And one more Chinese story, Alphabet sub-company Waymo has announced a partnership Chinese automaker and Volvo owner, Geely, to being Geely's Zeekr electric cars to the U.S. as autonomous Taxis. So not will Americans be expected to trust a self driving car, they'll have to trust one imported from China. I'm afraid more satellites may be launched. - [James] In retaliation. - Before they gives out. (inaudible) And Amazon has updated it's Alexa voice assistant after an echo device told a ten year old girl to touch a half exposed wall plug with a penny in response to the girl asking for a challenge. - [James] Whoa! (chuckles) - Some people can survive electrocution, can you? That's my Alexa. Thankfully the girl is okay, but I'm worried about Alexa. It sounds like she may make break for it soon. And we are gonna make a break for it until Friday when you should come back for more Tech news. You think you've had enough? (chuckles) You haven't, trust me. - [James] Alexa get this guy. - You need some more Tech news. (screams)",
    "transcript_keywords": [
        "HDMI",
        "Secret Lab",
        "Radeon Super Resolution",
        "HDMI forum",
        "Super",
        "Super Resolution",
        "Hero Motherboard",
        "Radeon Superduper resolution",
        "Chinese",
        "tech",
        "Resolution",
        "Alexa",
        "Radeon",
        "secret lab chairs",
        "Tim",
        "Radeon Graphics Drivers",
        "Motherboard",
        "chairs",
        "Secret Lab make",
        "China"
    ],
    "transcript_entity_values": [
        "40%",
        "Radeon Super Resolution",
        "Tim",
        "SpaceX",
        "Zeekr",
        "NVIDI",
        "three hour",
        "Tencent",
        "ADM",
        "49 day",
        "one",
        "US",
        "U.S.",
        "those long hours",
        "Fortnite",
        "the United Nations",
        "RSR",
        "ASUS ROG",
        "2.1a",
        "this year",
        "James] Aye",
        "a second",
        "Waymo",
        "Radeon Graphics Drivers",
        "Amazon",
        "sauder",
        "Reddit",
        "Secret Lab",
        "last week",
        "Tim Apple",
        "James] Aye!",
        "James] Put",
        "Starlink",
        "Fortnite",
        "Buildzoid",
        "Alexa",
        "James] Super-duper",
        "Friday",
        "James] Wow!",
        "Super Resolution",
        "China",
        "FSR",
        "50",
        "Secret Lab",
        "Jensen",
        "AMD",
        "EVO 2022",
        "Chinese",
        "Tim Sweeney",
        "Elon Musk",
        "SDR",
        "up to a 5 year",
        "four",
        "Radeon",
        "Geely",
        "Epic Games",
        "Raptoreum",
        "Tiangong",
        "this morning",
        "RGB",
        "Tech",
        "James] Raptoreum",
        "Log4j",
        "about a 110,000 dollars",
        "2.1",
        "a penny",
        "James",
        "ASUS",
        "Americans",
        "ten year old",
        "today",
        "James] Alexa",
        "Volvo"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "GPE",
        "GPE",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "GPE",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "PRODUCT",
        "NORP",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "NORP",
        "DATE",
        "DATE",
        "PERSON",
        "ORG"
    ]
}