{
    "id": "pPSSYHuhuII",
    "title": "Worlds Most Durable Charging Cable? - Tested!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-04-10T15:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=pPSSYHuhuII",
    "category": "Howto & Style",
    "tags": [
        "charging cable",
        "iphone cable",
        "iphone charger",
        "apple",
        "anker",
        "powerline 2",
        "powerline 2 dura",
        "powerline",
        "best charging cable",
        "smartphone",
        "iphone",
        "lightning port",
        "wont charge",
        "ios",
        "iphone accessory",
        "lightning",
        "cable",
        "charging",
        "android",
        "powerline ii",
        "Anker"
    ],
    "views": 5037072,
    "likes": 96952,
    "comments_count": 5576,
    "description": "Powerline 2 Dura 3 foot cable:  6 foot cable:  10 Foot cable:   Charging Cables are not all made equally.  Some are stronger than others. Ankers Brand New PowerLine II Dura is the latest and greatest in mobile charging. I'm sure most of us have had a charging cable break, stop working, or short out during out life time.  Its time to end all of that with a cable that has a Lifetime warranty, The Powerline 2 Dura, is literally a cable for life.   To activate your Powerline 2 Dura warranty just head HERE:   Awesome Smart Phone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/2oOGlqB",
        "http://amzn.to/2oOAvW0",
        "http://amzn.to/2pH7bC8",
        "https://www.anker.com/lifetime",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "[Ambient tool sounds] If youve ever owned a cell phone that needs to be charged, theres a good chance that youve owned a broken charging cable. Today were going to be durability testing the stock iPhone cable that comes with every new iPhone 7, and a brand new cable that could very well be the most durable cable in the world from Anchor. At the end of this video well be giving away 2,000 of these cables, so stick around and thumbs up to Anchor for giving away a bunch of free stuff. Lets get started. [Intro] So were going to start with the iPhone cable, and Ive built this contraption that sits inside of this Smith machine right here. And it has the cable plugged into the iPhone. The cable goes down tight around this pole right here, this bar, and then its plugged into a power bank so we can see when the cable actually stops charging. So how this Smith machine works is that the weights go on either side and these rails guide it up and down. And so as I add weights to the end of the bar, its going to be adding weight to the cable and eventually its going to stop working or tear out. So both these cables are brand new and we can already see a difference here on the head. We can see two different materials and this is usually where the cable breaks. Here on the Anchor cable its one solid piece of rubber all the way down, so that already gives it an advantage. If we look at the USB end of the cable we kind of have the same thing. Two different materials; this is kind of a rubber. Well find out how well theyre joined together in this weight test. And then here we have one solid piece of rubber all the way down. Now this is the weakest point of any cable, and by putting a ton of weight straight down on this cable, were deliberately testing the weakest link. Lets start adding weights. 10 pounds. 20 pounds. 30 pounds [Crashing] 30 pounds. Woo! Alright, thats interesting! So all it takes is 30 pounds of pressure and that cable rips right out of the bottom of your iPhone. Heres what that other end looks like. It ripped the wires right out from inside of it. Thats crazy. Now the black Anchor cable is plugged in and its tied to the bar and its got its power. Lets test this thing. 10. 20. 30. Now 30s where the iPhone broke, so well go 35. Still charging. 40. Alright. Right on 40 pounds. Looks like it ripped right out the bottom as well, but it still held 10 pounds more weight than the original cable did. And 10 pounds is a lot when youre talking about something as small as this. So now were going to check the tensile strength of the actually wire since the head is already ripped off. So we got the wire knotted at the top and the bottom, and now were just going to add weights to the end of the Smith machine. What in the world? So I added a 25 pound weight to the end of that machine and it ripped the cable completely in half. Lets hope the power line to Dura lasts a little bit longer than this did. Alright, the power line to Dura is knotted in. The heads been ripped off before with our last test. Were wrapped around the machine. Were good to go. Alright, 25 pounds. 60. 70. 80. So keep in mind these tests arent extremely scientific. We dont know exactly how much that bar weighs on the Smith machine. But what we do know is that the Anchor cable lasted four times longer with the weight than the original iPhone cable did, which is pretty impressive. So now we have both of the cables torn completely apart. Lets take it back to my desk and get a close look at what the inside of these cables look like. So if you watched the video closely youll see that each of the cables broke along the knots that I tied. So my knot was a factor in it breaking. But since each cable was treated the same way, its still a pretty fair test between the two. The power line to Dura outperformed the stock iPhone cable by quite a large margin. The Anchor lightning head handled 30 percent more weight, and the cable itself held almost four times as much weight as the iPhone cable. But lets be honest, the average person wont be lifting weights with their cell phone charger. Bending is much more common with charging cables, and thats where this rubber neck comes in handy. Anchor said they tested it to 12,000 hard bends which means it will last 12 times longer than a normal cable. Inside this cable is also super interesting. If you look at the stock iPhone cable youll see it has a super weak neck and thats why so many people complain about having to hold their cable in a certain spot to get their phone to charge. With one hard bend, the little fragile wires tear loose from their connections inside the head. Power line 2 doesnt have that problem. Now when I strip down the power line 2, its immediately evident why this thing has a lifetime warrantee. Look at all that metal. Its like an industrial Chinese finger trap toy. The metal helps hold the cable together and protect the internals if it accidentally gets kinked, stepped on or slammed in a car door. You know, life happens. Another interesting thing is the internal gauging of the wire. Anchors cables are MFi certified. If you remember from my previous video on third party Apple accessory standards, Anchor does have that MFi certification and can use Apples port. Anchor just uses thicker wires, more metal sheathing and has a better neckBasically just beating Apple at their own game. If a 3 foot length isnt your thing, it also comes in 1 foot, 6 feet, and 10 feet, and red, black, blue, and white coloring. Its too bad Apple hands out those weak sauce cables with every new iPhone 7, but lucky for us, Anchor is giving away 2,000 of these things. Ill toss a link right below this video where you can participate that. Hopefully you can get one of these cables that lasts forever instead of the stock ones that just last a year or two. Thumbs up to Anchor for sponsoring this giveaway. And if you dont have an iPhone, Im sure you know someone who does. Let them know what Anchors up to. Thanks a ton for watching. Ill see you around.",
    "transcript_keywords": [
        "cable",
        "Anchor",
        "iPhone cable",
        "Anchor cable",
        "cables",
        "iPhone",
        "weight",
        "pounds",
        "stock iPhone cable",
        "Smith machine",
        "owned a broken",
        "power",
        "Smith",
        "weights",
        "end",
        "power line",
        "Anchors cables",
        "machine",
        "broken charging cable",
        "owned"
    ],
    "transcript_entity_values": [
        "30s",
        "10. 20",
        "iPhone",
        "35",
        "6 feet",
        "four",
        "3 foot",
        "two",
        "almost four",
        "20 pounds",
        "Two",
        "Chinese",
        "half",
        "a ton",
        "25 pound",
        "Dura",
        "10 feet",
        "70",
        "40 pounds",
        "10 pounds",
        "Anchor",
        "Apple",
        "80",
        "60",
        "Anchor",
        "12,000",
        "30 pounds",
        "40",
        "iPhone 7",
        "Today",
        "12",
        "third",
        "25 pounds",
        "1 foot",
        "USB",
        "Smith",
        "30 percent",
        "Apples",
        "just last a year",
        "one",
        "2,000",
        "2"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL"
    ]
}