{
    "id": "PPxstmVoiSM",
    "title": "Floppy Chips Will Change Everything",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-07-24T03:03:26Z",
    "video_url": "https://www.youtube.com/watch?v=PPxstmVoiSM",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Arm",
        "PlasticARM",
        "bendy",
        "flexible",
        "CPU",
        "processor",
        "flexible chip",
        "chip",
        "plastic chip",
        "cortex",
        "silicon"
    ],
    "views": 403742,
    "likes": 27274,
    "comments_count": 1016,
    "description": "Learn more about Storyblocks Video at    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:  ---------------------------------------------------  Timestamps:  0:00 he's angry about being fired 0:08 PlasticARM bendy CPU 1:02 EVGA replacing bricked RTX 3090s 1:50 FTC backs Right to Repair 2:24 Storyblocks 3:02 QUICK BITS 3:06 Akamai internet outage 3:37 Epic new complaint against Google 3:59 Section 230 bill 4:25 Kaseya master decryptor key 4:49 Tokyo Olympics video game music   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.storyblocks.com/techlinked",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/UcD7R",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- I thought it might be nice if we talked about some tech news. Would you like that? - [Riley] God, Carlton! - Woo! This week Arm unveiled a prototype for a plastic based flexible microchip the company has creatively dubbed 'PlasticArm'. They've got to have some Germans on the naming committee over there. - [Riley] It makes perfect sense! - Oh yah! We've seen bendy chips before, but not like this. With a 32 bit cortex M zero CPU and with over 18,000 logic gates, PlasticArm is about 12 times more powerful than the other flexible chip designs out there, they might as well be stickers. Which is one application for these chips, thanks to costing drastically less than rigid silicon based chips. PlasticArm could be built in a product packaging or labels, which could, for instance, detect if food has gone bad. That's right, an Arm engineer said, \"We'll be putting processors on lettuce \"or anything else you can think of.\" Ew gross. That's what you thought of? - [Riley] It probably seems like you were thinking it.-- - Nasty. No, I'm not thinking of anything. - [Riley] Gross. - I'm obviously not thinking. Good news for anyone with an RTX 3090 made by EVGA that was bricked while playing the new MMO New World. The company says they'll replace the busted GPU's for free! That's nice of them. Some are saying this is the least EVGA could do since the prevailing theory is that the hardware was more to blame here than the game itself. Although Amazon has patched the frames cap in the games menu, just in case. I can't say I feel too bad for the victims here. Since they made the choice to A, buy the most expensive gaming card on the market and B, play New World. But why are we making fun of New World? It's not even out yet. Anyways, if you've been turned off of RCX 3090s forever, the radio on 6600 XT looks like it will be announced soon. So you'll have an opportunity to make a more balanced purchasing decision. - [Riley] Don't buy-- - Choices! - [Riley] Expensive things. - And more good news for the right to repair movement. The federal trade commission has voted unanimously to create new policy enforcing customers' rights to fix items ranging from smartphones to farm equipment. The vote comes after US President Biden issued an executive order calling for such policy. And with any luck, this will lead to new laws, preventing Apple and other companies from discouraging third-party repairs. Nice. Subscribe to Louis Rossman. He talks about this stuff and his sassy energy is iconic. - [Riley] Oh, he's gonna make funny-- - Riley, wait! No. Why would you put that in there? - [Riley] What do you mean? - Riley, wait, no! - Now it's time for Quick Bits, brought to you by Story Blocks and it's massive library of stock footage, images, audio, and after effects templates, which we use in almost every tech linked episode, because what? You think we're made of cameras? That would be gross or weird. Story Blocks recently launched the ReStock initiative to make content that more accurately reflects our world. So they've hired new BIPOC and LGBTQIA+ plus filmmakers to create authentic stock content depicting underrepresented communities. Story Blocks has affordable subscriptions with unlimited video and audio downloads. So check out Story Blocks today at storyblocks.com/techlinked. - Quick Bits come, Quick Bit go. That's the digestive system for you. Many major websites and platforms, including Amazon, Steam, the PlayStation network, and even Costco-- - [Riley] No, not Costco! - Experienced a brief outage yesterday thanks to a DNS issue experienced by major web infrastructure company, Akamai. Did I pronounced that right? - [Riley] Sure. - Beautiful. The issue was fixed after a few hours, but I don't feel comfortable using the web when everything can just disappear like this. So I'm going to go back to reading books. - [Riley] You don't read books. - I read books. - Do you? - Yeah. Atomic habits by James Clear, just read it. I'm trying to become a better person, Riley. Epic games has filed a new complaint in their lawsuit against Google, including new information about how the web giant tried to block Epic from hosting Fortnite on Samsung's Galaxy store. Because while they're waiting for the Apple case to be decided, might as well just remind Google that they care, you know? - You don't want to leave them on read. - [Riley] Read. - Read. Fudge! Did I just swear? Sorry for swearing. Two democratic senators introduced a bill yesterday that would remove section 230 protections from social platforms if their algorithms are found boosting health-related misinformation, fueling more debate about the control that Twitter, Facebook and the rest have over what people are and aren't allowed to say online. Like I'm confused about things that I can say. Can I say, fudge (beep). - [Riley] Stop it! - All right. Sorry about that. Kaseya, the IT services provider to around 1500 companies that were affected by a ransomware attack has obtained a master decryptor key from a third party that is now being used to free the imprisoned data. Kaseya got the key after wandering around the dungeon for what felt like days until they saw a weird shaped block that it turned out, had to be rotated in order to get to the chest. A guide would have been handy in this case. And the Tokyo Olympics kicked off this week with a suitably Japanese musical fanfare from a ton of classic video games, including Dragon Quest, Final Fantasy and Monster Hunter. You think there'd be some Nintendo titles represented, but nope, that company is probably too busy suing it's fans for not wanting to pay $90 for a 10 year old game. - [Riley] (indistinct) - It's unbelievable. I want to play it, but I'm not paying that much. That's it. I'm done. Come back on Monday for more tech news. I promise we won't yell at you this time. It was just, it's just been a lot today. It's been a lot. - [Riley] We're here for you. - Thank you. No! No! (singing)",
    "transcript_keywords": [
        "Story Blocks",
        "read",
        "World",
        "Blocks",
        "Quick Bits",
        "Story",
        "company",
        "Riley",
        "Quick",
        "chips",
        "PlasticArm",
        "Story Blocks today",
        "read books",
        "block",
        "Arm",
        "make",
        "games",
        "thinking",
        "Quick Bit",
        "gross"
    ],
    "transcript_entity_values": [
        "Story Blocks",
        "yesterday",
        "Akamai",
        "32",
        "Final Fantasy",
        "Amazon, Steam",
        "10 year old",
        "a ton",
        "New World",
        "Story Blocks",
        "over 18,000",
        "Riley",
        "one",
        "US",
        "Google",
        "Louis Rossman",
        "230",
        "3090",
        "Kaseya",
        "Amazon",
        "3090s",
        "This week",
        "Carlton",
        "Japanese",
        "DNS",
        "Nintendo",
        "EVGA",
        "The federal trade commission",
        "Biden",
        "Twitter",
        "Dragon Quest",
        "Samsung",
        "90",
        "funny-- - Riley",
        "RCX",
        "Quick Bits",
        "third",
        "about 12",
        "Germans",
        "Galaxy",
        "the Tokyo Olympics",
        "Facebook",
        "MMO New World",
        "Monday",
        "GPU",
        "Fortnite",
        "XT",
        "a few hours",
        "James Clear",
        "this week",
        "BIPOC",
        "6600",
        "Two",
        "CPU",
        "Costco",
        "democratic",
        "ReStock",
        "Epic",
        "1500",
        "PlayStation",
        "Apple",
        "today",
        "PlasticArm"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "WORK_OF_ART",
        "FAC",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERSON",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "NORP",
        "ORG",
        "EVENT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG"
    ]
}