{
    "id": "PQEP-2KGTWc",
    "title": "The iPhone Lighter Case?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2015-11-05T22:14:30Z",
    "video_url": "https://www.youtube.com/watch?v=PQEP-2KGTWc",
    "category": "Science & Technology",
    "tags": [
        "iphone 6",
        "iphone 6s",
        "iphone",
        "6s",
        "apple",
        "iphone 6s case",
        "iphone 6 case",
        "iphone lighter",
        "lighter",
        "case",
        "zve",
        "best iphone case",
        "tech",
        "technology",
        "unboxtherapy",
        "unbox therapy",
        "review",
        "unboxing",
        "6s iphone",
        "apple iphone",
        "cases",
        "case iphone",
        "iphone cases",
        "case review",
        "phone case",
        "iphone 6s cases",
        "phone",
        "apple iphone 6s",
        "cases iphone",
        "6s case",
        "case iphone 6s",
        "6s cases",
        "fire"
    ],
    "views": 8106015,
    "likes": 122070,
    "comments_count": 10884,
    "description": "ZVE iPhone Lighter Case -   I don't smoke and I recommend you don't either... Just had these cigars for the purpose of testing out this case. Stay healthy kids.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/1THMpXm",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys Lew here back with another video and today's gonna be a fresh episode of Does it suck? Not sure what the hand movements were about in front of me I have something that is a little bit non descript it says zone of variety and excellence I..you know to be honest with you. It's kind of what unbox therapy is It's a zone ...of variety ...and more importantly excellence of the highest form I...whatever The reason this is non-descript might have something to do with what's inside ZVE... multifunctional cigar.... Blue Iphone 6 4.7 inch new This....hehe ohh look at the fancy foam cutouts Not messing around Get rid of that A micro usb cable and what looks like a fairly chunky iPhone case Well...it's chunky for a reason That's because this bad boy has a built in lighter Now when I first heard about this I was thinking to myself, this is one of the most bizarre inclusions you can possibly imagine on a phone case but that's not all it does. Obviously protection and stuff as well and a bottle opener too because well I mean if you're smoking cigarettes you probably want a beer to go with it Before we get started on testing this out, I do wanna say that I do not recommend smoking It's not good for you Let's actually test this thing out so a micro USB port here on the bottom There's a lock here that will stop you from accidentally opening the lighter part You probably wouldn't want that to accidentally open in your pocket Could be a hot thigh The features do not end there because I just noticed something... I was trying to figure out what this is here but now...because of the icon I'm pretty sure that I know... It looks like a camera on a tripod Does it not? That screen out right now? Yes! Holy multifunction! Now....why would you have it there is a great point I suppose if you have a-uh a head that moves you could-you could still figure it out We have a case, bottle opener, tripod mount, and most interestingly the flamethrower Let's at least make sure that an iPhone fits in here properly Which it does Cut out for the camera on the back. Pretty satisfying. Little clicks there but actually *clinks on table* it seems kind of tough Nonetheless we do need to test this thing. And so Don...Tomas Finessed quality hand made Honduran cigars Now as I've said before. I do not condone smoking Look at these things. Individually wrapped holy fancy town *big sniff Ho! Believe it or not. I've never smoked a cigarette in my entire life You slide this guy down right here And you see that coil there? It starts to heat up Turns orange. Let's try this out. Ok...that's definitely lit You see that guy? So umm...it can light a cigar Maybe you're one of these...post apocalyptic preppers that's ready for anything...well I suppose having an extra fire source that's always on you might be interesting so... Let's say that I had some spare cardboard Listen. The apocalypse happened. We're starving. I just caught this rabbit Cook the rabbit dad. We got this case. We have a little bit of cardboard. Let's see if the strategy I'm thinking about is actually viable on this case We have smoke dude Yeah we have an ember there. Oh yeah-look it's going man Yea..totally viable ok...nightmare again Jack Does what it says it's gonna do! Does it suck? Um... No No it doesn't suck. I mean maybe I wish it wasn't quite so chunky Maybe it would be cool if it had some other tools built in to it lil mini screwdriver or...yeah a little blade little corkscrew? I don't know. It's a weird case. You probably didn't know it existed. I didn't know it existed until it showed up here The ZVE multifunction case $13.99 on Amazon It'll meet the expectations that you have for it. It actually feels pretty sturdy. Doesn't suck. It's not for everybody So there you have it. Another strange and wacky thing here in the world of Does it Suck on Unbox Therapy Hope you guys enjoyed this video. If you did Make sure to leave a thumbs up down below to let me know that you liked it Uh subscribe if you haven't yet and I will catch you on the next episode Later guys...Here's some...red hot amber for you...on the way out",
    "transcript_keywords": [
        "guys Lew",
        "case",
        "Lew",
        "Lew here back",
        "suck",
        "micro usb",
        "chunky iPhone case",
        "Iphone",
        "fresh episode",
        "unbox therapy",
        "thing",
        "guys",
        "iPhone case",
        "smoking",
        "ZVE multifunction case",
        "pretty",
        "variety",
        "zone",
        "excellence",
        "chunky"
    ],
    "transcript_entity_values": [
        "Amazon",
        "Don",
        "Lew",
        "today",
        "first",
        "USB",
        "Cook",
        "A micro usb cable",
        "Tomas",
        "13.99",
        "6 4.7 inch",
        "iPhone",
        "Blue Iphone",
        "Jack",
        "Honduran"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PERSON",
        "NORP"
    ]
}