{
    "id": "PqhTADCv56I",
    "title": "The New CCNA, CCNP, CCIE certifications explained - BIGGEST Cisco Certification updates EVER!",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2019-06-15T19:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=PqhTADCv56I",
    "category": "Education",
    "tags": [
        "CCNA",
        "CCNP",
        "Cisco Certifications",
        "CCNA Training",
        "CCNP Training",
        "CCENT",
        "CCENT Training",
        "ICND1",
        "INE",
        "CBT Nuggets",
        "INE Training",
        "CBT Training",
        "CCNA Study",
        "CCENT Study",
        "CCNP Study",
        "CCNA Collaboration",
        "CCNP Collaboration",
        "Cisco Training",
        "CCNA Study Guide",
        "how to study for CCNA",
        "MCSA",
        "MCSE",
        "VCP",
        "cisco ccna",
        "comptia A+",
        "comptia security+",
        "comptia network+",
        "clus",
        "devnet associate",
        "cisco devnet",
        "cisco devnet associate",
        "ccna 2019",
        "david bombal",
        "cisco live 2019",
        "ciscolive",
        "network chuck"
    ],
    "views": 61620,
    "likes": 985,
    "comments_count": 137,
    "description": "What's going on with the Cisco certifications? Lots of questions! Well, here are the answers! Network Chuck and I discuss the new Cisco ccna, ccnp and ccie certifications with Yusuf Bhaiji and Joe Clarke. What are the changes to the certification program? How do they work? Lots of questions answered in this video!  More information:   Menu: 00:00 - Introductions 02:11 - Background of Cisco certifications 03:49 - The purpose of Cisco Certifications 06:46 - Balancing old and new expectations 08:48 - Reasons for the changes 10:01 - Overview of new CCNA 14:48 - Overview of new CCNP 21:42 - Versatile certification journey 23:17 - Future of IE exams 26:34 - Are the knowledge gaps between technology cores big? 31:43 - What are the different components in the high level? 33:22 - What happened to CCDA? 36:50 - Where is the best place to get more information?  Joe Clarke: Distinguished Engineer, Customer Experience  Cisco   LinkedIn:    Yusuf Bhaiji: Sr. Manager, Global Certification Programs  Cisco LinkedIn:   Twitter:  @YusufBhaiji  David's details: YouTube:  Twitter:  Instagram:  LinkedIn: https:/  #CCNA #DevNetAssociate #CLUS",
    "description_links": [
        "http://bit.ly/cisconextlevel",
        "http://linkedin.com/in/JoeClarke2",
        "http://linkedin.com/in/YusufBhaijiCisco",
        "https://www.youtube.com/davidbombal",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal"
    ],
    "transcript": "(smooth music) - Hey everyone, David Bombal, here with Network Chuck. Chuck say hello. - Hey guys. Hello, oh, wow, you're doing it to me now. - [David] I'm doing it to you now. - Hello, \"Baie Dankie\" (Afrikaans - Thank you very much), I don't know, something South African. (laughs) - We here with Yusuf and Joe. - Hi. - [David] Welcome. And please introduce yourselves. - Hey. Thank you guys, thank you for having us. It's been a pleasure, it was, last time we went in Barcelona, right? - That's right. - It was interesting. - It was a fantastic time, we spoke a lot about the certifications and stuff. - Yeah, and we kind of set the tone that there is a lot of good things coming and here we are today. So, yeah, I guess you know me from the previous podcast. I'm Yusuf Bhaiji, I manage the certifications program team. So my team is primarily responsible for the design and development and delivery of the certification program, so everything from CCNA, CCNP, CCIE, CCDE and all the expert certifications. So yeah, it's been exciting, we have lot to share today, lot to cover, so it will be. - [David] Looking forward to this. - Very, very exciting. - I'm excited. - And Joe. - Yeah, well, thank you Yusuf, thank you Chuck, David, for having me. You don't know me, I have not been here before. I have, however, been at CISCO now for half my life, 21 years. - Wow. (crosstalk drowns out speaker) - [Chuck] You don't look very old, I wouldn't assume that. - A colleague of mine did a Dorian Gray painting of me that ages, so I do not. I work with Learning at CISCO and I come from a computer science background, so my desire, my passion with CISCO has been always been around network automation and programmability. - Ah, you can feel it. - So I worked with the DevNet team with our own SMEs in Learning at CISCO to kind of make sure that we were threading through software programmability and automation and everything we're doing with our new certification. So I'm really excited to see this launch here at CISCO Live. - So let's talk about that. - Okay. - Chuck announced these big changes. - I did. - In the certification. - [Chuck] (laughter drowns out speech) Chuck Robins, yeah, yeah. - So tell us about. - Yeah, so let's go into that. So we will just start the dialogue and, Joe and I, we'll just kind of elaborate on the different elements of the announcement. - There's a lot to unpack. - Yeah. So I think to set the stage first, there is two things that happens here. One is, we already have an existing portfolio for over two decades, so we have the certification program for two decades, right? And we have over 1.7 million certified individuals. - That's amazing. - With over 3 million certifications, so each individual can have multiple. So, you can imagine, we've been around and a lot of certified individuals. So, in the history, at least in my professional career, in the history of CISCO certification, this is by far one of the biggest change that we have done in all those years. Because we've done lots of different changes in these last two decades. But, the magnitude of this change is at a different level. So we want to highlight what is changing in our current portfolio, which is what you guys refer it to as CCNA, CCNP and CCIE program. And then there is another aspect to it, which is how we are evolve the program to the next level, introduce the new future technologies and automation and software developers and all that. So we want to really focus on those two areas and then finally bring it together, that how they complement each other. What are or why would some engineer need to do this versus that, or somewhere in the middle or both? And we can kind of set that stage. So with that, Joe. - So we had, we've had, three real guiding principles around certification and that is agility, in that we wanna track what's happening in the industry to make sure that what we're certifying people on and training people on is relevant, that leads to them getting value out of the certification. And the employer is getting value out of them as certified individuals. And finally that then leads to them being able to demonstrate leadership for their organization and in the industry. With what we've done with, what Yusuf was talking about, in our evolved, in our new certification portfolio that we launched, even more so. Now we've streamlined the certifications, we've created more modularity, that adds more agility, that allows people to create that tailored journey for themselves, that Yusuf was talking about. That, therefore, they get more value out of the certification because it means something more to them, because if they were able to say, \"This is what I'm an expert in.\" \"This is what I'm doing.\" Or, \"This is the job that I wanna get.\" And, finally, then that also gives them more leadership opportunities because now they're getting the certifications they want, that make them look like that technologist and give them that additional value to their employers. So that's kind of how we tailored the program to give it that more effectiveness towards the certified community. - Well, that makes more sense. It's been super hard to keep up with it, how fast technology changes. - And the modularity allows us to rev things, to add new concentration certifications or to modify things as we see fit, without having to change everything about the core technology that's relevant in our technology tracks. - And another way to put that is, previously, in our current portfolio, things were very monolithic, in terms of the swim lanes. So if you started a journey in a particular technology, you had to continue grow in that same kind of line. And if you decided to swap or change, there was really not much flexibility. So this new program really gives you that agility, flexibility, in terms of how you can practically build your own certification and your own customized profile which is applicable to whatever job role you're into. And you don't need to boil the ocean, you don't need to do everything. Because that was another thing, one size fits all, type thing. - Right. - We're kind of moving away from that mantra and saying no, one size does not fit all, in terms of customization and we really need to make sure that we provide those choices. And at the same time also maintain the level of rigor and standard, to make sure that every engineer also has some foundational knowledge that is at par at a certain threshold. So we had to kind of continue doing both of that. - You mean, the more I hear about this, the more I think it was a massive job to try and keep current people happy with the path of migrating to the new certification, but then also adding all these extra components. - Yes. In particular, we wanted to recognize that technologies, and you saw the slide Chuck put up with the existing logos and certification logos then the new DevNet logos, in particular, as a company, we wanted to make sure were emphasizing the software and programmability skills and we were giving people opportunities to learn about those and use that learning to apply for continuing education, to keep their certifications fresh. And at the same time, to your point, we needed to make sure that we could bring people that are currently certified along, give them equivalency, let them know that their credentials aren't going away or giving them credit, we're reflecting their great accomplishments And then by giving them more of these opportunities to learn, those will keep their certifications fresh, give them new opportunities to get even more credentials, new credentials, as they explore some of these new technology spaces. - And that's a key point, Joe. Because that was absent today, that while they were working towards their journey, and we spoke about the journey last time, that, well, certification is journey, it takes people six months, one year, two year, depending what they are. And currently, what happened is, if they passed one exam, which was a part of the journey, they didn't get value out of it. Although the knowledge, they had the knowledge and the skills, but from a job perspective or from market perspective, they couldn't demonstrate the value of it. - I've been there, that's rough. - Yeah. - So we're talking (mic static drowns out speaker) the CCNP? If you only get route. - Yeah, so imagine. (crosstalk drowns out David). - You haven't got any recognition. - So, today if you did a route exam, you just get a score report, no value. - You'll be like, \"Yes, I passed. Two more.\" - But then that's pretty much, two more to go. But, now, with this new, what we call incremental recognition or as-you-go recognition, we will provide specialist certification for each and every exam that they take. So that's how, we have baked in, in this modularity, that they can still get value out of it, like Joe was saying, and the leadership, but also the recognition for that. - I love that. - So this is like the why. Anymore reasons why the big change now? - We just saw that it was now, now was the time, with the influx of the software skills. And it's not just about, I mean, this program allows us, down the road, to look at things like data science, ML, AI, all of these things that are now buzz wordy. That, as they become more mainstream it's easier for us to fold this in. So we saw the velocity of technology really needs us to be more fluid in how we're testing. - Yeah, that's always a problem, when you're training courses. Like, we were saying this before, if I'm training a course, then students might say, \"Well, this stuff's like two generations behind.\" or \"It's quite old.\" So this is fantastic, that you can bring the new stuff in quickly. - Trying to keep up with the new stuff, yeah. - Because of that modular approach, right? But, like Joe said before, it was kind of two single sides and monolithic and now it's all modular, compartmentalized and we can keep, like a Lego block, we keep building on top of and when something is retired or end of life, you remove it, you replace it and keep changing it. - So can we talk a little bit more the technical pieces to this? So CCNA, what I've been told, there's only one CCNA now, can you kind of give us a high level overview of the certifications? - Sure, I'll start with CCNA, we'll tag team here. So, yes, the CCNA, we created a new CCNA. It's not a converged or a unified CCNA, it's new. And we went to the industry, we went to employers, we went to people out there hiring network engineers at the associate level and we said, \"What is it that you want in that engineer?\" - Interesting, okay. - And many of them said, well, they're going really deep in one area right now, but they haven't necessarily seen or had exposure or experience in the network yet. What we really want from that engineer is someone who's familiar with a broader set of concepts. Of modern networking concepts. A little bit of the route and the switch, a little bit of the virtualization and the data center, security, wireless, programmability, automation. Some of the foundational skills there. So they can come into the network, they're not scared of these concepts, they're not foreign, they've heard about them and there's still some practicality to that test, quite a bit actually so that they can do things. They can hit the ground running and they can pivot to whatever area the organization needs. So they can start to build experience, see what they like, see what they're good at, what they're passion is. And then as they move forward in their career, into the professional, into the expert, then they can start to go deep in those specific technologies that they really like and that there's really a need for, for them. - Forgive me for say this, but, 'cause we are talking about CISCO certifications. But, it kind of sounds like the Network+ a little bit. 'Cause it goes wider than it typically used to go, right? - It goes wider than it typically needs to go but it's still giving you practical, it's grounding you in practical around the CISCO network. - What I meant by that is it sounds better. Where the Network+ before, only thing it had going for it was it gave you a wide breadth of information, but now the CCNA gives you that and a practical step to go deeper with that as well. - And it gives you what we would consider to be what the majority of the associate engineers are gonna see when they step into that network. So they have those skills that make them practical, make them more valuable in a wider variety of modern network environments. - [Chuck] That's huge. - I think Joe summarized it well enough. All I can add is kind of echo that sentiment, in the sense that the way the future is evolving, there is so much demand from a skillset standpoint in a variety of different skillset. So it is not really at that early age when the engineers start their career in IT, maybe one year or two year or even fresh graduates out of college. They really don't know, it's like the college, right? When you start something, you know I want wanna do engineering, but, well, how far do you wanna go? Mechanical, electrical and there are so many sub-divisions in mechanical, electrical, so in the first few, one semester, two semester, you kind of you're getting yourself introduced to all the different ways of doing things and then you'll choose your specialty. So CCNA, like now, the new CCNA, is, that is what it is. And we are gonna set that foundation, kind of stone, and from there the community can decide, okay, where do I want to branch out now? - Exactly. - And that was missing today, I mean, it was not missing but it was kind of spread out in different CCNA. - (crosstalk drowns out speaker) and then you go to CCNA. - And CCNA route switch, or CCNA security or the. - Wireless. - The programmability course or something. It was kind of spread out. - I've heard, is it kind of like they just moved it up a notch, or you guys moved it up a notch? Instead of like the associate level, you're at the professional level when you decide where you wanna go? - Yes. - Yes, yes. - All right, so Yusuf and Joe, can you give us a high level overview of the whole new certification track, from CCNA to CCIE? What is going on here? - So we explained about the CCNA and we said how things are changing and evolving in terms of CCNA and we are going to create the single exam, single product, which is the new CCNA. And one thing I want to emphasize, that even today at CISCO Live some people were asking me questions and they were really comparing the old CCNA format with the new CCNA, and I was kind of politely telling them that, look, please don't compare the old and new because it's like apple and orange, right. Because it's a new product, it's a new CCNA. If you're gonna compare the blueprints, you will not understand the goal and the purpose of the new CCNA. The new CCNA is a new brand, is a new program, for a specific target audience. And from there, we are kind of branching into the CCNP program, which is where, now, we are even evolving the CCNP program, how we did that in the past. So, with that CCNA introduction. - Yeah, with the new CCNP, so before, and we mentioned it earlier, you mentioned about, what if I just pass route? Oh, got two more to go, I gotta get switch, I gotta get (cross talk drowns out speaker). - Yeah, demoralizing, yeah, uh-huh. - So some CCNPs today were three, some were four, I think Data Center had a choice in there, in its CCNP. What we've done is wanna simplify and streamline that across all our tracks. So now we have five technology tracks, we have Enterprise, Service Provider, Data Center, Collaboration and Security. Each one of those has a, a what we call, a technology core exam and that core exam brings you up to speed with the concepts in that technology space and goes further and deeper to say every engineer who considers themselves either a professional or expert in this space, this is what they need to know. Regardless of how deep they go into additional things, what we call concentrations, or what they pick in their CCI Lab, this is the core set of foundational skills in that technology space they need to know. - Ah, I love that. Because you're establishing that baseline. - Exactly. - Like, if you're gonna work at CISCO, Steph, you're gonna know some routing and switching. - Yep, you're gonna. - You're gonna know it. - You're gonna know routing and switch like in Enterprise. You're gonna know routing and switching. You're gonna have to know some wireless. I mean, how many people have an Enterprise network with no wireless today? I don't see a lot of people sitting along the walls anymore, plugged in, they plug in for power now, they don't plug in for ethernet. So you need to know wireless. - Actually, there's one core across, for all of them or is there separate cores? - It's a core per technology track. So we have five tracks, we have five technology cores. - Oh, it's a different core. - Yeah. - So there're different cores across what those engineers need to know in that space. Now, some network fundamentals will be the same in all of them, but then they go deeper in specific areas for those technology tracks. So the NP takes that. They also then need to choose one of a list of concentrations in that same technology track. They pass that, they're CCNP for that technology track. And they can do the core and the concentration in order they want. - Interesting. - And both of them will give them a CISCO certified specialist badge. Let's go back to Enterprise, I take the CCNP Enterprise core, I become a CISCO certified specialist, Enterprise core, then I take my concentration, say in automation and programmability, I get a specialist for that, the sum of the two gives me that CCNP as well. So I will walk away with at least three badges, three logos, three certifications out of that. - That's great. Sorry, just to hop on this, 'cause I wanna make sure I understand this, 'cause I wasn't clear from what I saw. - Yeah, I was kind of confused as well. - If I was gonna do like security, there's a security core? - Correct. - And a security concentration? - Set of security concentrations, you just need to pick one. Like, for example, Firepower, if you're the one working on Firepower Next-Generation Firewall, you might pick that concentration, that might be what you do, you do that with that technology core, you're CCNP security. - Yeah. Another way to explain that is, what we were saying earlier, one size fits all, we're moving away from that. Today, to become CCNP Security, you had to take four exams or three exams and do everything, whether Firepower or ISE or VPN. - [Chuck] Even if you didn't care about it, your company didn't use it? - Exactly. - So now it is more relevant to the person, to the individual, that if you are just in the business of Firewall or your job role is dictating that, we don't want you to take the VPN exam, right, you only take the Firepower. However, the technology core, so there're two exams, right? So one thing, let's get clear, the new CCNP program is two exams. - Yes. - [David] (crosstalk drowns out speaker) three. - Yeah. So some CCNP have three, some had four. - [David] Yeah, to the point, sorry, yeah. - So that is changing, and we are simplifying that into two exams. Of which one, as Joe explained, is the core exam. And core is that common body of knowledge that regardless of who you are as a security engineer, whether you are a Firepower guy or VPN or ISE, there is a common body of knowledge that every security engineer should know. Similarly in Collaboration, regardless of which specialization you wanna be, there is a common set of knowledge we want you to know. So that's what the core exam does. The technology core within each track is that common body of knowledge across all. So if you are a CCNP Security, I'm a CCNP Security, what do we have in common? That's the technology core, but then your second exam, which is the concentration, you could have taken the Firewall exam, I could have taken the VPN exam. And, as we said, the incremental recognition helps you, that you have your own specialist certification badge for Firepower, I have my specialist certification for VPN plus we both have the CCNP Security logo. So it's very customized, very flexible and very modular. - You were concerned, like, sorry, but there's just CCNP? What's the difference between this CCNP and this CCNP? But, you've made it clear now, because the specific core and then a concentration. Sorry, you were saying? - And that concentration comes with that specialist certification, so on your LinkedIn page, wherever you wanna reflect, you have that to say, oh, I'm all CCNP security, but my expertise, my specific security expertise, CISCO certified specialist VPN Implementation, as an example. - That's amazing. - So you have that additional credential there. - Now do, sorry, David, but, are the specialists, are any of those exams shared between the other tracks or are they all unique? - They're all unique between tracks, but every track has an automation and programmability concentration that's specific for that track. And what's unique about that one is that concentration double counts in both the network engineer realm, for the the CCNP, and in the DevNet realm for the software developer to get your CISCO certified DevNet professional as well. So that means that it, let's say, I am, I said, I like network programmability. Let's say I get my CCNP Enterprise with my concentration in automation and programmability for enterprise, then all I would need to do, if I find myself being more that software developer type person, I would go and take my DevNet core, 'cause DevNet will have a technology core as well, I am now also a CISCO certified DevNet professional. - I like it. - That I call the double dip. - Wholesome. - Double dipping. - Oh, I like that. - Because that's how we give you that elasticity, that flexibility, that more mileage in your kind of investment in learning and training and up-skilling. Because if you have learned something, we don't want you to take over and over again, it should count where applicable. So that was a good example, that, well, it counts towards your CCNP Enterprise, why it can't it count for your DevNet Professional certification? - I like it's like you don't have to bite this huge chunk off, it's like smaller bites. - Yeah, you don't make a U-turn and come all the way from the start point. - Exactly. - CCNA isn't a prerequisite, is it? - It is not a prerequisite. - That's the other thing, yeah. - Just jump straight to it, so if I need to learn about Firepower but I have nothing, I can just jump straight to Firepower? - Yeah. And get a specialist for Firepower. - Exactly. - That's so cool. - At CISCO, that is what we want to message here, that the specialist certification is a standalone certification of its own, regardless of your journey into CCNP or CCIE, you can just choose to collect a bunch of specialists. - I like the way you say that, collect, people are gonna be collecting these like trading cards. - Because they wanna showcase. - (laughing) Love cards. - 'Cause we are all geeks and we wanna showcase our expertise and we wanna show, I can bring value to the organization or to whatever job role I am. So I can take multiple exams, and it could be cross, right? You were talking about are the exams within the pool or not shared. So although even they are not shared, but there is an advantage, that you may have taken a VPN specialist. You got a specialist certification. You could also take the SD1 exam, or you could take an ACI exam, which is Data Center, Enterprise, Security, three different tracks. Today there were three different CCNP, you did nothing. You didn't get CCNP Data Center, you didn't get CCNP Route Switch, you didn't get CCNP Security, but now, what do you do? You picked one module from the pool of Security and one module from pool of Data Center, one one module from pool of Enterprise, you got three specialist certifications. And then it's your choice if you want to take the technology core and complete your journey. - But, what I also really like about this is you've made it like incremental, so there's an incentive to just do one more exam and then I get something else, rather than I've got this long journey. Your CCNP example I love is like you take long journey. - Yeah, it took me forever. That's probably part of the reason, I didn't my CCNP, 'cause I had to complete three massive exams. - Yeah. - There's always light at the end of the tunnel. You always see the next step. And that, the whole incremental carries from NA, getting that one exam, to NP, where you have the two exams per the specialists as well. And then we'll also see that also carries into IE as well. - So can you talk about the IE? - Sure. Yes, so that technology core we talked about, this is what I talk about the incremental nature of it. That technology core is now the written exam portion of the IE. - Oh, wow. So there's no written now? - There is no more dedicated IE written anymore. The technology core. - Joe, if I may interrupt you? - Go on, yeah. - The way I said it, slightly differently, because people may confuse \"there is no more written.\" - Right. - There is still a written, but it's a new product. - Yes. - It's a new product. Some people were confusing the written, that we have eliminated written, written exam as a product, we have killed that, we will retire that. But it is going to be replaced with this new technology core exam, which does different things, and Joe will explain that. What is that power that we have embedded? And how we are giving that choice and flexibility by doing what we just said. - But, essentially, you're saying that, if I pass the technology core exam, I'm halfway to CCIE? - You are, I mean halfway in terms of number of exams, but there's still. - (laughs). - Number of exams, but in the skillset, maybe it's debatable, but halfway to CCNP, for sure. - Yeah. - Oh, we're cool with that. - So you take the technology core and the technology core, we looked at what we needed at that, each one of those technology levels. For both the professional and the expert, what is that common foundational set? Now that we've, some people say, dumbed down the written, no we have not. This technology core is a rigorous exam that will give you that foundational skill set and knowlegde in your technology space. - Actually, it's the opposite, right? - Yeah, we increased it, right. - We increased the knowledge, not only NP but the CCIE written used to focus only on conceptual elements, but technology core now goes into the implementation and troubleshoot and simulations and all of that. - If you look at the blueprints online, the verbs we chose are things like configure, implement, construct, so there's a lot of action there. And then once you pass that, then you have a choice. Let's say you and I are both, same spot, we wanna do Enterprise, we both take the technology core, we pass. I'm thinking I'm probably more at the professional level. You're thinking, no, I've done a lot, I'm gonna go for the Lab. You can for the Lab, I can go for a concentration. We both will, ultimately, end up with, I'll be CCNP, you pass you'll be CCIE. Or I could say, you know what, I'm gonna start with my CCNP, so I'll go and get the concentration, get the CCNP and then take another step without having to go back and take another written exam. And I can move towards the Lab to get my CCIE. - That's interesting. So is the gap pretty big though, if I have the CCNP core and I try to do the Lab, how much more, obviously the Lab is always harder, but the knowledge gap, is it pretty big? - Well, first of all, we wanna call it the technology core. - Okay, technology core. - So it is not just CCNP, it's for both NP and IE. - You're right, right, right. - The gap will be around experience. So if you look at the new Lab component, we are holistically looking at the life cycle now. So yes, there's implement. Yes, there's operate, yes, there's optimize. Now there's also low level design. Always, someone's gonna go to the IE and go, \"How would you do this?\" Or \"How would you implement that?\" And that IE needs to know how to apply technology, how to think about the problem and what is the right technology solution? So the gap is gonna be, can I build that experience? Can I break things, can I do bad design? Can I learn what the good design is? That's gonna be time to learn what the right approach is, so that they can sit and think the through the three-hour design module in the new CCI Lab, and think through that critically to come up with those right answers before they go into the new five hour second module, which is he implement, operate and optimize. So the gap really isn't necessarily difficulty as much as it, I mean, they're certainly gonna be hard, but as it is gaining that experience and that wisdom and that kind of maturity then to go and sit for the Lab. - The other angle to that, well, I always explain it, is the individual technologies versus inter-networking. - Yes. - So I always remind people, the acronym CCNP versus CCIE. If you look at the third letter of the acronym, CCNP is CISCO Certified Network Professional, network. CCIE says CISCO Certified Inter-networking. So when you are taking technologies individually, so again, going back to Firepower or VPN, those example. Yeah, you may be very good, very expert, deep dive into an individual technology and you're a specialist, but CCIE Lab is more about how those technology integrate together. And they can break each other, they demand different integrations and that is where the challenge comes in. How you kind of piece them together in the Lab. - Sorry, can I talk about the Lab? - Sure. - You mentioned there's a design component? - Yes. - If I. - what, sorry. - Sorry, because I really want to emphasize another thing before we move to CCIE. - Yeah, worries, go for it. - On the CCNP side, Joe gave a good example, that let's say you both are at a point in your career and you want to take the CCIE and you want to do CCNP, this whole program, the evolution, we have thought in, very through, that how to give value. Those were the three principles Joe mentioned, agility, value and leadership, right. The way, you can still keep your end goal as CCIE, right? - Yes. - So let's say that's where your eyes are, you want to get your end goal. But, as you're progressing through it, you will study, you will learn. So let's say you're pursuing CCIE Security, you will learn Firewall, you will learn VPN. So, as Joe mentioned, that flexibility allows you, you could both have taken the technology core, and he took once concentration and becomes CCNP, but you decided to take the Lab. Unless you're comfortable that you are thoroughly experiencing all those technologies, you would not be successful in the Lab. But my point is, if you think you are halfway comfortable or three quarter way, my suggestion is why not also build your profile? And take those individual exams. - Concentrations. - Concentration, and build your profile because you still need to get a job, you need to be competitive, you need to differentiate your resume with others. Why wait another one year, calender year, or two years to pass your Lab? Please, take the concentration, get that recognition while your goal is still the Lab. - That's amazing. - yeah, you get certification along the path. - Exactly. - Yeah, you have a huge incentive. - Small steps. - I like that, yeah. - So it's expected that you have the knowledge of all the specializations before you go for CCIE. - And that would solidify your knowledge because then once you have all those individual technology components, whether it's Enterprise or Collab DC, you will feel more comfortable going in the Lab. Well prepared in the Lab, rather than give it trial and error and hit and run. Because some people come in and they get disappointed. I have seen in the CCIE when I was proctoring. They come in into Lab, two hours, three hours into the exam, they are like, oh, I didn't expect this. They literally walk out. And I joke with them, I say, \"Hey, just have a free lunch, \"you paid for it you know.\" - Have an expensive lunch. - Very expensive lunch. - So even now with this new modularity, new flexibility, at least they can gauge themselves through the journey, collect all those specialist certification and then when they know ultimately I'm ready, ready, why waste time when you're not ready? And do it right. - Yeah, save money. - That's killing. - It's a great idea. - In the CCIE Lab you mentioned there's design portion? - Yes. - Can you just tell us, in the high level, what are the different components? - Two modules. - Yeah. - Two modules in each of the tracks. One will be three hours of design, scenario based. The other module five hours, implement, operate, optimize. - Troubleshoot? - That will be part of the operate. - Oh, okay. - Operate, optimize. - 'Cause when you operate the network, you're troubleshooting and all of that. - And a little bit of implement, you'll have to troubleshoot. I've mistyped a command before and stood there for a while, sat there thinking, what is, why doesn't this work? So you do a little bit of troubleshooting there. There's also a commonality in all of this, we're folding automation and programmability into all of the IEs. - That's insane. - So you will have to know how do I configure something with NETCONF, as an example, on a device, not just how do I do it with CLI or RESTCONF or an API, if in that track there is a different type of API in order to programmatically configure. - And that's another point you asked earlier about what is the delta, how far is it, CCNP and CCIE? So, again, going to that point is now that if you think all of this together, design, implement, operate, optimize, programmability, automation, all the technologies, it becomes a monster. - Yep. - Yes, it does. - And then that is where you show your true experience. And experience is not something you can not learn in a classroom, it comes with practice, it comes with your field experience. And then you can demonstrate your skills in the Lab, that you can kind of understand all of that. - That's fascinating. - I've got one question, and then I think we should wrap it up. What happened to CCDA? What happened to the design track? - So the design track, so CCNA, the new CCNA, there'll be a migration. If you have the CCDA, you will get a credential, a badge that indicates that you've taken some design elements or (murmurs) was the test at that level. So you get some credit for that accomplishment. At the professional level we have concentrations in some of the tracks that are design focused. In particular the CCDP, I say that right? - Yes. - Yes, DP will migrate to a CCNP Enterprise, with a specialist in Enterprise design, a concentration specialist in Enterprise design. And throughout all of the tracks, as we progress, this is not just a one and done for us, we're gonna continue to add concentrations. We'll look at the life cycle of implement, operate, design, optimize and we'll start adding concentrations, that meet, say, design in Collaboration as well as where it's applicable in other tracks. - Yeah, and that's what that whole modularity is about at the CCNP level, that we did not want that one size fits all, we want modularity. So, like you said, design Collaboration, design Wireless, design Enterprise, design Security. So if you really wanted to be design CCDP or it's very generic, very one size, it was not going into individual technology verticals. So, for us, instead of branching CCDE five times and saying CCDP Security, CCDP Routing, CCDP Collab, we have changed the whole paradigm and now went with this concentration model. And if you're a design consultant, you will still get the CCNP Enterprise, or CCNP Security but you choose your second exam, the design exam. - To be honest, that does make more sense. - Makes a lot more sense. - And that's a specialist. - And that's a specialist, yeah. - It's a specialist, right, so you still get that recognition and your CCNP. - Oh, wow. - But, remember, that, again, modularity of the job role is at the CCNP level, at the CCA, it's mandate, it's not choice. - That's a good point. - You are required to understand and demonstrate design skills, implement skills, operate skills, optimize, that's the difference between CCNP as a program and CCIE as a program. - But is there still CCDE? - CCDE, yes. Right now we haven't made any changes, at this time, to the DEs. So the DE and Architect programs are still there. - Okay, so even February 23rd? - 24th. - 24th, it's still gonna be a thing, you can still test on that and everything else? - Yeah and CCD, and another way I can explain is, some people asked me today morning, that, well, you are adding design in the CCA, so then how does that make any difference from the CCD? Well, it is different because CCD, fundamentally, was high level, across the board to get the business needs and translate it into solution. So it was very broad and very high level. Like what we call, in technical terms, HLD, and design in the high level design and stuff and doing ROIs and all that. And now that thing is handed over to a CCIE guy and he goes into the LLD, the low level design. And he does all this, goes closer to the solution and does all the design components and the implementation side of this thing. So they still have what we call applied design and the high level design. - Yeah. - Perfect. - This is fantastic. But, there's always gonna be more questions, where can people go to get more information? - Yeah, and that's a good one, because there is so much to consume, so many questions are answered and there is a lot of material that we have collateral, that we have developed. So the one link that I would point people to is cisco.com/nextlevel, next level being one word. So I'll repeat that, cisco.com/nextlevel. You go to that to that landing page, there are lots of information, lots of collateral, FAQs, at a glance documents, so for each and individual tracks, CCNA, CCNP, CCIE, we have at a glance PDFs, we have the FAQs. So please some time on this website and learn all the changes. - That's fantastic. - For those of you who can't wait for the movie, you go there and you don't have to. (laughs) You'll get all the teasers and trailers you need. - Absolutely. - I like that, all right guys, that's it for the high level overview. Again, if you wanna see more, you know where to go. Link's below. And we'll continue these discussions, so thanks Joe, thanks Yusuf. - Our pleasure. - Thank you. - This stuff's amazing, I know you wanna hear more, so we will have more, keep watching, stay tuned. (smooth music)",
    "transcript_keywords": [
        "CCNP",
        "CCNP security",
        "technology core",
        "CCNP Enterprise",
        "CCNA",
        "technology",
        "Yeah",
        "core",
        "CCNP Enterprise core",
        "CCIE",
        "Lab",
        "security",
        "design",
        "CISCO",
        "Enterprise",
        "certification",
        "technology core exam",
        "exam",
        "Joe",
        "CISCO certified"
    ],
    "transcript_entity_values": [
        "Chuck Robins",
        "three",
        "Afrikaans",
        "CISCO Certified Network Professional",
        "Joe",
        "three quarter",
        "NA",
        "Network Chuck",
        "two",
        "CISCO",
        "four",
        "two hours",
        "DevNet",
        "Data Center, Enterprise",
        "six months",
        "second",
        "VPN Implementation",
        "3 million",
        "CCNP Enterprise",
        "NP",
        "CCNP Security",
        "CCIE Lab",
        "David Bombal",
        "21 years",
        "one year",
        "CCDP Routing",
        "South African",
        "today morning",
        "CCNP",
        "CCDP Security",
        "Baie Dankie",
        "David] Welcome",
        "five hours",
        "API",
        "Today",
        "ACI",
        "five hour",
        "today",
        "Learning",
        "Lego",
        "three-hour",
        "one",
        "CCDA",
        "Collaboration",
        "1.7 million",
        "ML",
        "two year",
        "CCDP Collab",
        "Security",
        "Yusuf Bhaiji",
        "Steph",
        "Barcelona",
        "two years",
        "first",
        "calender year",
        "Learning",
        "Chuck",
        "another one year",
        "CISCO Live",
        "Firepower Next-Generation Firewall",
        "CCIE Security",
        "VPN",
        "HLD",
        "Yusuf",
        "these last two decades",
        "CCNA",
        "CCDE",
        "CCNP Data Center",
        "LLD",
        "Enterprise",
        "David",
        "Dorian Gray",
        "Collab DC",
        "AI",
        "February 23rd",
        "LinkedIn",
        "NETCONF",
        "two semester",
        "CCNP Route Switch",
        "over two decades",
        "CCNA",
        "CCIE",
        "CCD",
        "at least three",
        "half",
        "Data Center, Collaboration and Security",
        "Firepower",
        "third",
        "five",
        "CISCO Certified Inter",
        "One",
        "CCA",
        "Enterprise, Service Provider",
        "Data Center",
        "CCDP",
        "two decades",
        "the CCNP Enterprise",
        "Love",
        "CCIE",
        "CCD",
        "CCI Lab",
        "CCNA",
        "Two",
        "three hours",
        "DE",
        "VPN",
        "CLI"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "NORP",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "NORP",
        "TIME",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "GPE",
        "DATE",
        "ORDINAL",
        "DATE",
        "GPE",
        "PERSON",
        "DATE",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "ORG"
    ]
}