{
    "id": "pSdKnNj7ozk",
    "title": "M2 MacBook Pro: Why Does This Exist?",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-06-29T21:48:30Z",
    "video_url": "https://www.youtube.com/watch?v=pSdKnNj7ozk",
    "category": "Science & Technology",
    "tags": [
        "M2 MacBook Pro",
        "M2",
        "M2 vs M1",
        "M2 vs",
        "MKBHD",
        "MacBook Pro",
        "MacBook Pro vs",
        "M2 review",
        "MacBook Pro review"
    ],
    "views": 3122514,
    "likes": 107863,
    "comments_count": 4823,
    "description": "M2 MacBook Pro is the MOST confusing existence...unless you're an enterprise custom who simply doesn't care  Bar chart with Apple silicon performance:   MKBHD Merch:   Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "https://www.macworld.com/article/556384/apple-silicon-iphone-ipad-mac-processors-benchmarks.html",
        "http://shop.MKBHD.com",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - All right, so this is the new 13 Inch M2 MacBook Pro and I don't think anyone should actually buy it. - Wait what? - Yeah, no, I think it's a great computer, first of all, don't get me wrong, but with the introduction of the M2 MacBook Air and the existence of the 14 Inch M1 MacBook Pro, they've managed to squeeze any reason for this machine to exist at this price to basically zero. Nobody should buy it. - Yeah, but nobody that seems pretty harsh. Matter of fact, I'm here. Let me challenge you on that. This is a great computer, change my mind. - Okay, well, let's just start with the design. So Apple's been going through their laptop lineup, upgrading everything with this new square shape, larger displays with thinner bezels, getting rid of the Touch Bar, and actually adding ports, but this particular refresh didn't get any of that, so this brand new laptop looks exactly the same as the M1 MacBook Pro from two years ago which looks exactly the same as the 13 inch Intel MacBook Pro with a Touch Bar that dropped in 2016 because it is exactly the same. I could give him sustainability credit, I guess, for recycling and old design and apparently using the same boxes from the M1 MacBook Pro just with new stickers on them, but yeah, this exact shell design is literally six years old and is starting to look kind of outta place now next to Apple's other notebooks. Like can you imagine any other company trying to reuse a six year old design? You trying to tell me a 2016 ASUS laptop re-release would fly today like a six year old XPS drop, like that's wild. - Yeah, but this isn't that. Let me tell you, if it ain't broke, don't fix it and I'm not just saying that. This is a really good laptop design. All metal jacket, a plus hinge, and let me just remind you, you reviewed it and you loved it. The screen was bright and high resolution, still is, the speakers were best in class, still are, great track pad and keyboard, and by the way, some people do really like the Touch Bar. You said so yourself. It might not do a whole lot, but it still has its few advantages. - Okay, but that is in a vacuum. That's the thing. By itself, I would agree with you. This computer is a perfectly good laptop, buy it, but as soon as you put it alongside the new MacBook Air, which is basically the same price, it's actually worse at basically everything. I got hands on time with the new M2 MacBook Air that's about to come out next month, right? The Air has a larger display with thinner bezels and in that notch, there's a new 1080p webcam instead of a six year old 720p webcam. It has MagSafe with a color matching cable which enables Fast Charging and essentially frees up an extra port since that's one more USBC port that you're not plugged into and it's all in a package that's thinner, weighs less, and is basically the same price, so why would you buy this MacBook Pro? How is it even Pro anymore? - You know what, that's a good question. Why would you buy this Pro? The answer I think first of all is it is the cheapest Pro in the lineup, technically it's true, but really the reason you'd get this over the Air is the thicker chassis supports active cooling, so it's got a fan and all the benefits that come with that. The benchmarks are in and to the surprise of absolutely no one, it's pretty clear that this M2 chip is awesome. It's living up to the 10 to 20% better multi core CPU performance and even more impressively, the two extra GPU cores over M1 is giving it 30 to 40% better GPU performance, which is basically the only area where you could say M1 was lacking. So this is awesome for any applications that lean on the GPU. Everything's faster. Final Cut is faster, Premier is faster, any games you might play are all faster, and the cherry on top is it has a dramatically improved media engine, same one from the higher end chips actually, so you can actually pull off some heavier Final Cut Pro edits. So for something like that while you're in a program for hours and things are getting hot, okay, that's when you'd need the fans to kick in, keep performance high, longer than the MacBook Air ever could, no throttling. So if you've got the sustained workloads and the long performance stuff, you should get the M2 MacBook Pro. No, no, those people should just go straight to the 14 inch M1 Pro MacBook Pro. Just go straight to the big brother. Look, if you know you're gonna be doing workloads and things that the MacBook Air can't handle, then you should just go to the actually pro laptop, the upgraded machine. If you're gonna get a nice laptop and you wanna do extra performance stuff on it, you weren't gonna get the baseline MacBook Pro, right? You were gonna bump it up, first of all because you want at least 16 gigs of memory, right, and second of all, because the 256 gigs of baseline Pro storage is kind of insulting and that version has particularly clipped SSD performance, worse than even the M1 MacBook Pro. So to get to one terabyte and 16 gigs, you're already looking at like $1,900 for this machine. At that point, just get the 14 inch Pro because that laptop is on another level of performance. I mean, don't get me wrong, it's absolutely awesome to see the jump from M1 to M2 and that's gonna enable a ton more great stuff for the most popular laptop for the everyday baseline users, but if you zoom out, there's still a big difference in performance when moving up to the higher end chips, M1 Pro and then M1 Max. The amount of additional performance you get for the extra two to $300 is massive. If that's what you really want, that's what you should get. Plus you get a much better, brighter mini LED high refresh rate screen too and the webcam in the notch is way better and much better speakers and you actually get some ports while you're at it. So I just, I don't know, you shouldn't get a literal worse version of all of those things. - Two to 300 bucks, isn't nothing. - It's not zero, but I don't know, really squeezes this new MacBook Pro quite a bit and plus you can't get around the fact that it's literally worse at all those things. - I think you're forgetting something. - Oh, really? - The MacBook Pro has studio quality microphones while the MacBook Air does not. - So technically they both are listed as having triple microphone arrays with beam forming. It's just Apple chose to call the one in the MacBook Pro studio quality. It might have a slight difference, but really are you gonna pay extra for that and then sacrifice all this other stuff. - Okay, I think there is one redeeming factor. - And what is that? - Battery? The MacBook Pro has surprisingly excellent battery life, better than I think pretty much all of us expected. We saw the 20 hours of video playback quoted on stage, but in real world use, this might be the best battery life in any modern laptop we've ever seen. There's people out here getting 16 to 20 hours of actual real world use the Verge's laptop reviewer, Monica, wrote a hilarious piece about how long it took here to run down a battery and across the board, it's a tremendously long performer, so if you want the best battery in any laptop, get this one. - Okay, so that is awesome to see, but at the same time, those other laptops already have great battery life too, so you're not trying to spend just to get a slightly better battery and then sacrifice all those other things we talked about. It's really quite a small difference. So the ideal customer for this new MacBook Pro M2 is somebody who just needs a slightly better sustained performance than the new MacBook Air. - And is willing to sacrifice screen size, webcam, speakers, ports, thickness, and weight to get it. For someone who is literally about to buy the 13 inch M1 MacBook Pro, Enterprise. - Yep, Enterprise, that's it.",
    "transcript_keywords": [
        "MacBook Pro",
        "Pro",
        "Pro MacBook Pro",
        "MacBook Air",
        "MacBook",
        "Intel MacBook Pro",
        "Air",
        "laptop",
        "baseline MacBook Pro",
        "Pro MacBook",
        "MacBook Pro studio",
        "Touch Bar",
        "performance",
        "inch Intel MacBook",
        "Final Cut Pro",
        "inch Pro",
        "Inch",
        "pro laptop",
        "Battery",
        "Cut Pro"
    ],
    "transcript_entity_values": [
        "M1",
        "M1 Max",
        "today",
        "six year old",
        "Apple",
        "M2",
        "2016",
        "ASUS",
        "one",
        "two to $300",
        "14 inch",
        "USBC",
        "hours",
        "Intel MacBook Pro",
        "256",
        "MacBook Air",
        "MacBook Pro",
        "six years old",
        "The MacBook Pro",
        "Verge",
        "this MacBook Pro",
        "next month",
        "the 14 inch M1 Pro MacBook Pro",
        "M1 Pro",
        "Monica",
        "M1 MacBook Pro",
        "13 inch",
        "MacBook Pro M2",
        "one terabyte",
        "two years ago",
        "first",
        "MacBook Air",
        "MacBook Pro",
        "1,900",
        "Final Cut Pro",
        "10 to 20%",
        "Air",
        "Final Cut",
        "XPS",
        "Fast Charging",
        "M1 MacBook Pro, Enterprise",
        "zero",
        "at least 16",
        "the 13 inch",
        "30 to 40%",
        "GPU",
        "16 to 20 hours",
        "Two to 300 bucks",
        "MagSafe",
        "the 20 hours",
        "second",
        "the MacBook Air",
        "CPU",
        "webcam",
        "the Touch Bar",
        "a six year old",
        "two",
        "16",
        "a ton",
        "13 Inch",
        "M2 MacBook Air",
        "a Touch Bar"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "TIME",
        "MONEY",
        "PRODUCT",
        "TIME",
        "ORDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG"
    ]
}