{
    "id": "pT7Wa_x6Xdo",
    "title": "Installing Linux Mint on a Mac - Part 2 - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2018-07-05T20:36:53Z",
    "video_url": "https://www.youtube.com/watch?v=pT7Wa_x6Xdo",
    "category": "Science & Technology",
    "tags": [
        "Installing Linux Mint on a Mac",
        "Linux",
        "Linux Mint",
        "Mac",
        "Mac mini",
        "Apple",
        "Compiz",
        "MATE Desktop Environment",
        "MATE",
        "Wine (Software)",
        "Steam (Software)",
        "Valve",
        "Portal",
        "Super Hexagon",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Tech",
        "Demo",
        "Humor",
        "Funny",
        "Comedy",
        "Computer"
    ],
    "views": 19747,
    "likes": 427,
    "comments_count": 115,
    "description": "Krazy Ken returns to finishing installing and configuring Linux Mint on a Mac mini.  Watch part 1   Watch the Hannah Montana Linux episode   Watch Software Showcase    Want more videos like this?   Subscribe for new content!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures #59 - Installing Linux Mint on a Mac - Part 2  Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?   Amazon links are powered by the Amazon Associates Program.   #KrazyKen #Linux #ComputerClan",
    "description_links": [
        "http://bit.ly/clan2JZILP2",
        "http://bit.ly/clan2kDr1tL",
        "http://ss.thecomputerclan.com",
        "http://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- [Krazy Ken] 'Cause right now we just have like the basic controls here. Like I want my Windows to wobble. I want jigglyness all over my desktop. Let's just make it really THICC with two C's. Oh, iexplore.exe, well that was somewhat fun and somewhat disappointing at the same time. Kind of like me. Oh, my spacebar is broken. Shish. Just gonna try fixing here quick. Alright, hope I don't break anything. (beeping) (typing on keyboard) (upbeat electronic music) Hey guys, how are you all doin'? Really? That's just great. Well, we are now in Part Two of the Linux Mint installation sensation if you haven't seen Part One yet, you have missed out on some intense excitement. I highly recommend giving that a peak before watching this. So, we have the system ready to go here but now it's time to install the other goodies and have some fun with the features and customize the system and all of the, all that good stuff, the fun stuff you know, the yeah. The good stuff. It might help if I turn the monitor on so you can see stuff you know. Maybe. Hello. (tapping) Buddy. You there? I hear the hard disk doing something so there we go, there's our Mint. You had me worried there for a second. So, I haven't installed anything else on here. And it's just all like the default settings right now but I saved it all for this occasion so we're gonna enjoy it but yes, 18.3 Sylvia MATE 64 Bit. Before we go installing other stuff let's personalize the system and make it our own. Let's have some fun. You know, I might put my own wallpaper on here, too. Actually that's what I'm gonna start with. And this will be a good time for us to test out Firefox in that awesome little (popping) spring load animation there. Pretty. But let's head over to thecomputerclan.com. Go to More, wallpapers, and I can take one of the photos I shot and put it on here. You know, I'm gonna go through the built-in ones first, and I was actually wondering you know, maybe I should submit my own photographs for wallpaper contests 'cause I'm petty sure Linux distros do like wallpaper contests to see like who gets their photos in the system. I should probably apply for that stuff because I think it's fair to say I have some decent wallpapers, considering they've been downloaded thousands of times if not, tens of thousands of times. Yeah, oh actually, this is the Antelope Canyon. I have been here. Alright, I think that's plenty of resolution so I'm gonna save that to my pictures. Pictures and right click, set as wallpaper. Yeah. Oh that feels bueno. That's feels really good. Alright, so we know Firefox kind of works out great, that's good. Let's get to the yeah, let's keep looking through the interface thing. Okay, themes, what do we got for themes? Ooh, minty dark. I am a dark mode kind of guy, sorry Brent. I am partial to dark mode. Alright, let's open our menu. What am I looking for? Compass. This is where a lot of fun can be had. CCSM is an advanced tool. Use with caution. So yeah, the cool thinking about Mint is it does have the compass stuff built-in and I'm sure there's more you could throw on here. But yeah, we got like the 3D Windows, so it has been a long time since I've done this stuff. So, bear with me. Enable 3D Windows. Okay. 3D Windows is enabled. Wobbly Windows is turned on but I'm not getting any wobble. Hmm. Maybe I'm an idiot. So I have the checkbox on here for MATE compatibility but I still can't seem to get any of the effects to work. According to Snap, I think it looks like we are running the latest version but I still can't seem to get it to work. So, I'm going to, I have two back up plans here. The first one, hopefully pretty straightforward, the second one is I'm just gonna freakin', tweet this out to my amazing fan base and hopefully they can get back to me before I'm done filming. (laughs) Because time travel doesn't exist when you're watching this you're not gonna be able to help me in realtime. Which is sad, you'd think we'd have time travel by now. Such a major buzz kill man. MATE integration is not checked though. This package (mumbles) files needed to integrate compass with the MATE desktop environment. Well, look at that. 120 kilobytes of disk space required. Ooh. I don't think I could swing that. But let's try this. Maybe this is what we need. 'Cause right now, we just have like the basic controls here in our virtual desktops and stuff. You know, nothing too fancy and cool lookin'. Like I want my Windows to wobble. I want jigglyness all over my desktop. I mean, I could install Drop Box, I do use it. I just don't know if I wanna sync all my stuff on to a testing system. I'll probably be better off just you know, going to Drop Box website. Blender is pretty cool. I used to use Skype more but everything changed when the disk coordination attacked which again can also just be running a web browser. Like a drawing application looks a little or is it a presentation application? Looks kind of dated but for funsies, we'll throw this on here 'cause why not? Oh, VLC is on here, too. Wine, ooh. Steam, yes, I was actually thinking of doing Steam. Ooh, we could experiment with some Windows applications to see if they run on here. Maybe. Ooh, Shutter. You have F Stop or was it called F Spot? And now you have Shutter. I've used F Spot but I've never used Shutter before actually. It's a screenshot program, okay. Only get a little rubber band effect there for scrolling off the page, cool. We have line. This could be, I'm totally getting sidetracked I know. We could do some Windows compatibility test. Let's just install all the stuff we think we'll need here. Alright, so that's installed. We might come back to that later if I choose to install Windows stuff. Man, Minecraft. Wow, it's been so long since I've played that. VLC is always good to have. Again, I know I'm getting total sidetracked here but since I'm here, I might as well install the software that I need. We're gonna need Steam. We gotta put games on here. There's actually a lot of Linux games now on Steam which is pretty cool. Well, there has been for about a year or so. But I haven't played with a lot of them yet. And I was even getting recommendations to do Steam OS on a future Krazy Ken episode which I still think is a good idea I just haven't got there yet. But yeah, Steam OS. I've never used it before. Alright, so we may do some more of that later. But let's get back to compass. And let's say Effects, like Fire Paint. It's enabled, initiate key, shift super. (clicking mouse) I'm not having anything happen so I don't know, maybe I gotta reboot after installing the MATE compatibility. Let's just try that. Like simple things like Expo. Okay, so the Expo, Expo key is enabled, Control Alt Up. Doesn't do it. That's weird. Huh, MATE compatability is on, I also installed it through the software manager and I still can't seem to get any of the compass stuff to work so, what I'm gonna do is, I'm going to tweet right now in realtime. To my lovely audience and see if anyone can help me fix this before the tech video log session is over for today, and if you respond to me in time, great. Your help will be featured in today's episode. But for everyone else, watching yeah, there's no time travel so you're just gonna kind of be watching. You can't interact with me right now, I'm sorry. We don't have that kind of power. Whoo. I almost knocked my screen over 'cause I'm a fat load. Let's fix that a little bit. You good? Alright, so yeah I mean, I've said it before and I'll say it again, I do like the community here because you have helped me a lot with other issues 'cause honestly, all of you are smarter than me. So here goes the tweet right now. And it is off so if someone replies to me, while we're doing other stuff in this tech video log, awesome. But in the meantime, let's explore with other software we can install, and just have some good installation sensation fun. Right? So first let's have some fun with Steam. We just installed that and yes, it's gonna have to do, it's a little updating thing and I'm pretty survived Steam guard thing too so I'm gonna have to get a fancy, pantsy codes sent to my bone. This will be so much more fun if the Window wobbled while Steam is doing it's thing. Let's have a look at panels. MATE panel. I like thick panels. Let's thick-afy this panel. Properties. Oh, yeah. Let's just make it nice and okay, that's maybe a little too big. We should get down a little bit, let's expand it. Oh hey, hey that was rude. Oh, actually I kind of like it like that. It feels a little more Mac-y. This button gives me money, right? Oh, it's just the terminal. It's not as exciting. I'm just kidding. Terminals are fun. Alright, Steam is doing something in the background. Did it finish? I'm just having like an ADHD like moment here. I'm just jumping from one thing to the other. I'm just having so much damn fun. Oh, there it is. Okay, log into an existing account. Yes, this actually might be a little too cluttery now. I think I ruined it. Hang on. Let me fix my panels. No, not clock you asshole. I wanna fix the panel. (clicking mouse) How do I just have panel properties, just uh, oh wait. Oh oh, I can just drag this, oh okay. Let's go to Properties. Let's go to expand. Let's keep that expanded. (clicking mouse) Oh so then it stacks the open Windows. I see what it's doing. Let's just make it really thick with two C's because I like it like that I guess. We'll give it a color. Let's give it a color. (clicking mouse) Yeah, you know, let's give it a computer clan brand of color. Three, nine, three, nine, A, zero, D, nine. That's one of our accent colors. Now you know the secret. (laughs) See that, and we'll just give it a little bit of transparency there. Yeah. I dig it. That's pretty. Alright, let's open up Steam. Let's have a look. Oh Five Nights at Freddy's. Yeah, Steam OS Plus Linux compatibility. Again, Steam OS I should totally do in a future episode. Half life, too. Dude, I've been dying to play Half Life Two again. I actually wanna play it like on a, a Live Stream again you know. It's been in awhile since I've done that. That was probably the last time I've play Half Life Two was on a stream like years ago. I just really wanna do it again. Ooh, gone home. I was just thinking about that. That's fun. Portal two runs on Steam, though? I mean, not Steam. (laughs) Duh. No shit, on Linux, what? I've been wanting to play Portal Two a lot recently, too. I've been wanting to play so many of these recently, ahhh. I played Rocket League. No. Rocket League works on Linux? Are you shitting me? I thought it was Windows only. Does it work on MAC now, too? What? I am so far behind guys. Can you tell? Super Hexagon's always fun to do. Create a start menu short cut. Ooh. (tisking) This is not a start menu man. This is, this is a level of existence beyond the start menu. Let's just, yeah, whatever. What the hell. Let's just do, let's install Portal One. It's been so long since I played any of this shit. Actually Portal was the first Steam game or valve game and Steam game that I've played. Zero friends are online right now. Oh. Oh, oh 'cause oh my gosh. Last online, 146 days ago? Holy crap. Yeah, I was in offline mode for some reason. I'll sign into, into there and go all the notifications. Okay, so while that's installing let's just, let's test out the graphics capabilities of this HD 4000. I just realized we probably don't have sound. I have a bad feeling about this. Oh, shit. We do. Oh, we got little volume controls with the MAC keyboard. That is really impressive. It actually knows those. Alright. I don't think it has, oh it does have my progress synced. Shit. I need a bit of a warmup though. Alright, you guys ready? Alright, I'm just gonna do the first level. Place your bets, I haven't played this in so long. How am I gonna do? Sometimes I think this is harder on a bigger screen. (electronic video game music) Yeah, I went the wrong way right when I pressed that. I was like, \"Oh shit.\" Let's do a harder level. (electronic video game music) Nah-nah-nah-nah-nah-nah, Nah-nah-nah-nah-nah-nah. Oh that was bullshit. (electronic video game music) Oh, come on. That was close. That was, that was close. Augh! Hang on, I got this. Ahh! No! Well we know the graphic performance for this game is at least okay, right? Augh, well F you, too Super Hexagon. Is it installed yet? Oh it's cued. Oh man, wait. It stopped downloading as I was playing a game. Oh man I'm an idiot. Well I didn't know what to do with that actually. Oh, this episode is just a combination of things to do while other things are loading in the background, right? So let's just keep having fun with the freakin' panel here. Let's throw some stuff in here, dictionary look up. That's always nice. Oh, it's got like a text field in there and everything, alright. Eyes to it. You gotta have eyes. Oh come on. Please tell me they get bigger than that. Preferences. It looks like there's like different types of eyes. Bizarre. Ooh, that's is bizarre. Default. Oh, now they have bigger now? What? Blood shot. Ooh. Oh, default tiny okay. Horrid. Oh. Dude, I'm getting all tingly from that (laughs). I think I gotta go vomit now. Oh gosh. Well, keep the default eyes on there. You know, I think I got a better idea. Let's just not put them in there. Display a swimming fish. Alright. Oh, that's, that's art right there. Oh you can change, okay. I see. You can (laughs) ask the art fish. Alright. Oh and you click and it gives you a fortune. Tuesday is the Wednesday of the rest of your life. Oh, that's very profound. (laughs) Alright. Let's take that out. Portal still installing so let's just keep having some fun with the panels here. System monitor. Those are always fun, right? Let's make it wider. Let's make it wider. Let's move it. 'Cause you can like, reposition it. Yeah, just put it over here. Oh, well you can't see it 'cause I'm an idiot but I'm just gonna move the system monitor. Alright, let's try the dictionary. Um, pragmatic. Alright, well that's cool. I love having a built in dictionary that is super, super handy. So yeah, the other probably smart reason why I installed Portal instead of Portal Two is because this is like in HD 4000. Like this is a, a seven year old integrated graphics chip set. As a screen I have not seen in a long time. But yeah, I was thinking of playing Portal Two on a live stream again because it's been years since I've done that but I was wondering if I should do Portal and Portal 2 in the same stream. That might be fun. 'Cause it's been so long since I've played all of 'em, the puzzles are like, anything but fresh in my memory. Dude, it has my games on here still. Oh my gosh. February, 2014. December 2011. Oh my gosh dude. It's been a long time. Test chamber 19, test out the graphics performance of this computer and of Linux Mint. (clicking mouse) Yeah, this looks like it's working. My gosh it's been so long. (woman in video game talking) Uh, control alright. Whoa, whoa. Didn't need that, that was probably a mouse bug or something. Oh, my space bar is broken, sheesh. That's gonna make this a lot more challenging. Oh man. I'm getting like a lot of nostalgia flashbacks right now. (laughs) Oh, there's me. Chell, Chell's got a body, she's pretty. Yeah, she's good looking. Hey, I won. Cake, whoo! Well the games over ladies and gentlemen. Thank you for testing this with me. Test is now over. And oh, that's not a cake. That's not a cake. Oh, that's good to know. There's no chance of a dangerous equipment malfunction. That's fine. So how many other like, like test subjects bodies are down here? (electronic video game music) Alright. There we go. Suck it GLaDOS. (clicking mouse) I'm in here. Okay, well, that's pretty awesome. We got games working on here. That's good. A lot more games coming to Linux. That's honestly makes me like really giddy. Let's hop on over to Drop Box because I have some media on there. We can just pull into here. Now, I have Photoshop files, too. Can Gimp open up Photoshop files? I don't know. But we're gonna find out. Now this looks like much better than that nightmare I experienced on the Hannah Montana Linux episode. That was messy. If you haven't seen that yet. (popping) Do look at that, but yeah. This is actually working so let's sign in. So I'm just downloading a bunch of stuff from my Dropbox here. I have a cinema shenanigans episode downloading. It's kind of big so we're just gonna let that keep going. It's like almost four gigs. But yeah, earlier I was wondering about Gimp compatibility with Photoshop because I haven't really used Gimp much but I'd like to try it. So, we got a Photoshop file we can mess with. I also have some photos here. So let's open that up. We'll need to extract and let's put them in the Pictures folder. Show the files. Alright yeah. Looks like we've got remote control scroll actually does work. That's good. So I can zoom in there. Nice. And yeah, we can probably we have an image viewer, and we have Gimp, pics. So if I go over with image viewer okay so that's X viewer. So we have X viewer and Pics. So let's see what the difference is between the two because I'm kind of foreign to these and again, I did shoot all these photos myself. They were actually a lot of fun to do. (clicking mouse) Okay, this one has a few more features in it it seems. Good old cloud gate big bean right there. Schwinn. which I think, isn't this also a Chicago company? That was like two Chicago things at once. Chicago's pretty cool. Let's shake it up with some Pittsburgh. (laughs) Yeah, cool so we have that. We may come back to some more fun pictures in a bit. Oh, of course, the awesome underscore Mac OS X folder. Which I'm not a hundred percent sure how to prevent that from happening when you know, transferring zip files to other systems because that was a, okay, so yeah. Drop Box generated a zip file when I downloaded and it threw a Mac OS X item in there. That's interesting 'cause I didn't download a whole folder as a zip. I just downloaded a few select images as a zip 'cause Drop Box isn't downloading them all as individual images. It automatically puts them into a zip but somehow a Mac OS X folder still got in there. I'm not really sure what these are for or how to stop them from showing up. They're invisible on the Mac by default but they show up on other systems so if anyone can help a stupid guy out, me, with that that'd be great. Compact view, oh that is compact. Look at that. Alright, let's go back to Icon view 'cause that's pretty, alright. So let's close that, close that. Let's take a look at a Photoshop file. So here, I just have a PSD file of a previous Krazy Ken episode YouTube thumbnail. So let's open with Gimp. And see what we can do with it. I wanna see if it actually like can parse the layers and all that good stuff. I mean, I even, wow, this is a different splash screen. I haven't used Gimp in probably eight years. (laughs) Okay, so let's see. Some of this worked, some of this didn't. Probably because of layer styles so like my face here is normally orange, or orange, orange I don't know whatever. But yeah, the layer style wasn't baked in and I wasn't able to parse that but I can probably change that. Okay, so let's close gimp and we have yeah, again we have a Mac OS X folder there. That's just and it says it's zero bytes down there but 189 bytes up there so somebody is lying. That extraction process created like a skyline down in our freakin' activity thing-a-ma-jigger. Thing-a-ma-jigger. I'm sorry, technical term. Didn't mean to throw that at you. Okay, so that, it oh Shenanigans. That's cool, the poster art even got preserved. That's really sweet. So we have VLC and I think X Player. So, one of these should work, right? Let's try it. Hey! (male in video is talking) Who's that idiot talking? (music playing in video) Well that's cool. Let's see how well it scrubs. That's pretty good. I mean, it's not as fast as QuickTime but I don't think I've seen anything scrub as fast as QuickTime but that's actually very impressive still. Especially since it's all free open source software. Oh, man, these guys. Oh my gosh, these guys. (laughs) Riffing this was a treat. That was fun. That's was a fun episode. Alright, let's try VLC. Let's just make sure it's working. We're just gonna keep experimenting and stress testing the system. Yup, it's working. The scrub's a little bit quicker as you can see. I don't know how I landed at the same part. That was just a really lucky guess. Okay, well stuff is working and that's really awesome. I'm not always used to that except compass. Compass I still can't get working. Everything else I've thrown on here, works, and I did send out that tweet. Let's see if anyone has replied to me. The tweet actually got quite a bit of engagement but the only feedback I received is, scream at the PC until it works. Thank you Nick Losre, L-O-S-R-E. Yes, scream at the PC until it works. Let's try. (screaming) Alright, did it work? Let's open up Compass and go to the effects. So let's just turn off let's say, Fire Paint, right? So we'll disable it. And we'll re-enable it. We have the MATE thing installed and I don't know if you mentioned this earlier. I did reboot the computer after installing the MATE, the MATE compatibility. Shift Super. No, screaming did not work. Well I guess we have to scream some more but I'm not gonna do that. 'Cause that isn't really productive. I don't know, it's kind of a bummer. Maybe I'll just have to fiddle this with some other Linux system in the future. 'Cause I've gotten Compass to work virtualized. With Zorin, maybe I should install Zorin next. We have a 500 gig hard drive guys. We'll need to fill it with something. (laughs) Yeah, this is a 500 hundred gig drive, oh yeah. They're, yeah there isn't a mount point on there, sorry. But yeah. We do have like 500 gigs free on here or like 500, and no 470 I think. Oh unknown, unknown, because there's no file system on there, that's probably why. Well, let's do process of elimination. This is the only mount point on here and this is, it's calculating. I still have my bets on 20, about 24 maybe. Cause I think this is a 32 gig partition. Anyway, okay. Whatever. I don't know if we need to sit here for the whole thing. (laughs) Emblems. Ooh, pretty. Ooh, danger, danger Will Robinson. I'm booting a big picture mode which (laugh) works great. (laughs) Yeah, I mean, I've never used this, well I maybe used this once before, but yeah, it didn't work so let's try that again. Big picture mode. Yeah, I have a feeling this negative space shouldn't be here. It kind of works though so let's just, I like the sound effects. Let's try launching something. Okay, so let's say Exit and it comes right back. Hey, now it's in full screen. It seems a little fuzzy though. Let me see, there's a gear here. Let's see. Display. Resolution. Ahh, there's our culprit. Oh, only that much dedicated video memory. Heh, well we're gonna take a chance. There we go. This actually looks kind of good with the blue going on in the outside of monitor and the blue going on inside the monitor. I dig it. The blue looks pretty cool. Yeah. It looks like it's performing fine, right? Let's try launching something. Okay, so I saw a little bit of lag there. But yeah, I'm sure I'll have more fun with this if I do a Steam Linux or Steam Linux, Steam OS installation which I have been thinking about. Well, okay this has been good, everything except Compass seems to be fine. I'll have to experiment with Compass some other time. I mean, this system is just packed with stuff. I mean, I only installed a few third party things but it's got tons of accessories, graphics programs, gimp, pics, oh, Scribus is actually already installed. Or did I install it? I think I installed it actually. Transmission, Firefox, Hex chat. All these office applications like you know, this wine compatibility, so I did say we would maybe experiment with some of that so yeah, we'll get to that in a bit. But yeah, there's just a lot of stuff loaded on here which I like. Alright, time to drink some wine. Okay, so we have what looks like a clone of Windows notepad that will run in Wine, I believe I used this on Mac OS, like many moons ago. Wine could not find a mono package needed for .net applications that work properly. We can automatically download it, install it for you, yes (laughs). But this does already feel like like an old Window, like a classic Windows environment inside of here, so that's kind of cool. In just trying to though think if there's like any third party programs I should install that are Windows related. Yes, just install those things. I don't use Windows a lot so I really don't know of any, like Windows apps I should try to run through Wine. Yes, just download it. Gecko. And here's Notepad. With the classic Windows look. About Notepad. Yeah, why Notepads. This is a clone, but yeah it works, hello. I, the space bar is kind of broken. I am ahh, spacebar is broken. Again, this is kind of like the butterfly mechanism for failure except this is not. It's just the keyboard is, I thought it was dirty at first but I think the key is just like bent out of shape, so I should properly fix that. Let's see if I go to save oh yeah, we even have a Windows ask interface there. That is beautiful. Let's try fixing this here. You know, I'm gonna unplug that here we go. Just gonna try fixing this here quick. Because this thing is kind of a pain in the ass. Alright, I hope I don't break anything. Now, fun fact, the Krazy Ken character even though it did start in a gaming series, the idea to use the name Krazy Ken and to have this like crazy persona of me, actually all started when I broke a key on a keyboard. I don't know if I ever mentioned that in the previous episode. I feel like I did, but it was all because I broke a key on a keyboard. That is where the whole Krazy Ken character and name started. And at first they viewed and Krazy Ken's classic video games or whatever we call that and yeah, there we go. I mean that's, that's a lot better. Mm-hmm, classic Windows controls. So delicious. I'm just kidding, I'm not gonna board this before I lose my mind. Which I already have actually, too late. Well, what has Wine got for us today? Alright, so here is the, this is like our virtual C drive, it seems. Okay, so it made it user for me. I see what it's doing. So program files, X 86, common, ooh Internet Explorer. Oh, iexplore.exe. Well let's open her up. I have a feeling this isn't actually doing anything. See, we'll probably just abort all that. Well, we had fun with our Notepad, right? That's all we need. Alright, well that was so much fun and somewhat disappointing at the same time, kind of like me. But I'm calling this a win guys. It was a two parter, very successful, everything worked except for the compass of so yeah, if you have suggestions on how to make that work or ideas for any other Linux distros I should try out, seriously, drop me a line because I'd love throw more onto this little MAC mini here and just fill it with, more than just Linux systems, we can do Linux systems but maybe other obscure software that's not Linux. Maybe, if that's even possible. Catch crazy and pass it on. (upbeat electronic music)",
    "transcript_keywords": [
        "yeah",
        "Steam",
        "Windows",
        "Alright",
        "Linux",
        "fun",
        "stuff",
        "Steam Linux",
        "good",
        "Kind",
        "MATE",
        "Krazy Ken",
        "time",
        "Portal",
        "Compass",
        "work",
        "Pretty",
        "Ooh",
        "MAC",
        "install"
    ],
    "transcript_entity_values": [
        "Wednesday",
        "Mint",
        "Half Life Two",
        "two",
        "Super Hexagon's",
        "20",
        "YouTube",
        "Shutter",
        "86",
        "Krazy Ken's",
        "the Antelope Canyon",
        "Will Robinson",
        "Mint",
        "one",
        "500 hundred",
        "nine",
        "Two",
        "Wine",
        "Mac-y.",
        "Fire Paint",
        "Skype",
        "Half",
        "Dropbox",
        "Firefox",
        "32",
        "a few third",
        "Three",
        "Compass",
        "years",
        "Linux Mint",
        "Scribus",
        "120 kilobytes",
        "Portal One",
        "Brent",
        "Drop Box",
        "Mac",
        "Zorin",
        "Five Nights",
        "Expo",
        "first",
        "Steam Linux",
        "Linux",
        "years ago",
        "three",
        "VLC",
        "zero",
        "seven year old",
        "Linux",
        "Portal Two",
        "18.3",
        "Chicago",
        "Yeah, Steam OS Plus Linux",
        "Pics",
        "500",
        "Zero",
        "today",
        "Krazy Ken",
        "MAC",
        "about 24",
        "Hannah",
        "nine",
        "Freddy",
        "thousands",
        "F Spot",
        "almost four",
        "Windows",
        "Schwinn",
        "bueno",
        "tens of thousands",
        "189",
        "Exit",
        "Notepads",
        "Pittsburgh",
        "Pictures",
        "February, 2014",
        "Nick Losre",
        "19",
        "146 days ago",
        "third",
        "Mac OS",
        "Control Alt Up",
        "Compass",
        "Tuesday",
        "a hundred percent",
        "eight years",
        "Gecko",
        "Portal",
        "Mac",
        "Super Hexagon",
        "Photoshop",
        "Chell",
        "Blender",
        "Minecraft",
        "Rocket League",
        "One",
        "second",
        "about a year or so",
        "December 2011"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "LOC",
        "PERSON",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "EVENT",
        "ORDINAL",
        "ORG",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "GPE",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERCENT",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "DATE"
    ]
}