{
    "id": "PtYDTdX8J_Q",
    "title": "What's in my tech bag? EDC Cables and more!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-01-17T16:07:47Z",
    "video_url": "https://www.youtube.com/watch?v=PtYDTdX8J_Q",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 62699,
    "likes": 2611,
    "comments_count": 155,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, it's Justine, and some of you may have seen that I launched my own line of pink USB cables, which I am so hyped about. But we also launched a little EDC pouch, which stands for EveryDay Carry. Now this pouch is actually inspired by a really low-quality mesh pouch that I've been using for the past couple of years. But the thing that I loved about it was the size and how slim it was. So I took everything that I hated about the pouch, which was basically everything except the size, and made an entire new one. The number one thing that I told Kondor Blue when we were working on this, is I want a super high-quality zipper. I want it to be massive. Like if you think that the zipper's too big, then that's perfect. Then you've definitely hit the mark. Here's the zippers. So these have the aluminum tags right here with my little logo on them. And these match the actual cable ends themselves. So it's definitely an entire comprehensive look. So we've got the super industrial zipper. The other pouch only had one zipper. This has two, which allows you to just kind of open a little side or open it all the way to be able to see what's inside. And it'll give you access to put the zipper wherever you want it. The mesh is also a little bit higher of a quality. It's more sturdy and it has more of a plasticy feel instead of like the mesh feel. You can also see what's inside way easier than those other types of mesh bags. We also added this little spine here to give it a little more structure. It's got our logos both on it right there. Now I'm gonna show you everything that I carry, and this is everything that I take with me when I travel, like this little bag here stays packed always. Even if I just go on a simple day trip, this comes with me. One of the best parts about this pouch is we also added an Apple pencil loop. So if you wanna bring a pencil with you, whether it's an Apple pencil or an analog pen, that'll also fit here, as well. It is on both sides, so you can carry two pencils. And I always carry with me this 35 watt double dual charger by Apple. I like this because it does have the two USB-C slots so I can charge two things at once. This is, of course, just a basic Apple one. This is a Sony USB-C card reader. This will- Oh my gosh, is there a card in there? Oh, that's a treat. This will hold CFexpress A cards and also regular SD cards. I mostly use this for CFexpress A cards since the MacBook does have an SD card slot on it now. Would've been so nice to have that many, many years ago, but it's okay. It's okay. Who's complaining? Not me. I always carry with me my Oura Ring charger, and since I got my gold ring, I now carry with me my extra ring because there have been times when I've been traveling, and I actually left my ring at home 'cause I left it on the charger. I like to charge it before I travel, but sometimes I forget it, so I now always make sure I have my alternate ring packed and ready to go. This is the MagSafe Duo Charger. So you can charge your Apple Watch or your new AirPods Pro 2, and this side will charge your iPhone or anything else that's she-wireless compatible. This cable, super random, this cable is actually what is used to charge my lightsabers. And I used to travel a lot when I would do lightsaber training, I would always bring the lightsaber with me, and it would be tragic when I wasn't able to charge it. This always stays in there. A USB-C to A dongle. Honestly, never really need this. There was one time last year when I needed this desperately when I was in Mexico, and I was in the middle of nowhere. No one had a dongle, no stores could even get a dongle, so this now always stays in the bag. Now let's move on to the cables, shall we? Okay. I'm pretty much a USB-C girl, I really just bring this USB-A brick just in case of emergencies. We never know. I have two Lightning to USB-C cables. I always like to have one of those that plug into the MagSafe Duo charger. And then I do sometimes travel with an extra phone, so I like to be able to plug that into the duo and charge my other iPhone while the other one is charging on the MagSafe Duo charger. Sometimes I also do need it to transfer data, so it's just nice to have two of those. Now, since this is more of my travel bag, I'd like to bring some smaller cables. So this is the USB-C to USB-C. We've got two of those actually. And then I have a Thunderbolt Cable here, which I always use with some of my various solid state drives. I know I did say I was a USB-C girl, but it looks like since I got these new cables, I did decide to throw in one of these USB-C to USB-A. So, honestly, it is good to have this because you honestly really just never know what you're gonna need. I will sometimes travel with a power strip that does have USB ports on it. And those normally are USB-A, which sucks, but it is what it is. My micro is missing. I also usually have a micro in here, but I think it might be charging something right now. Please hold. Where did you go, little micro? Here it is. I was charging my microphone with it. But this is the USB micro. Really this ends up being what I need this for. USB micro was such an interesting cable, because, obviously, it is something that is on its way out, but there are so many things that still charge with USB micro. Headphones. All of the microphones that I use, they charge with USB-micro, I'm sure one day it will be updated. But for the time being, that's what I'm using. So I do have a whole bunch of accessories, little tiny action cameras, all sorts of things that still use it. And of course, I wanted it to be a nice comprehensive collection. So I do feel like there may be people that are in the market for it. I mean, if I am, then I can't be alone. So this is everything that is in my carry bag. Now, the reason that I love this bag so much is because it is so slim, and also this zipper is super industrial, so you are able to cram a lot of stuff in here. Now you may be like, \"Well, Justine, why didn't you just make the bag bigger if you wanted to carry more stuff?\" That's where I had to draw the line. That's why I like the size of that old, crappy cheap bag so much, is because it can confined me to this size only and this fits perfectly into my backpack. So I didn't wanna stray from that, and I also didn't wanna give myself any more space to hoard. So, this is it. If it doesn't fit in here, then, well, I just need to put it somewhere else. (Justine laughs) But this is everything that I would need when I'm on the go. I love having every single cable now matching and beautiful. I just love the way that these look, and it's super exciting because Kondor Blue does have a lifetime warranty on all of their cables. So that is definitely something I feel like will put your mind to ease. If I was on the market for cables, you better believe that's something I would want. So let's load this back up, put in all my items. I mean, like really, a lightsaber charging cable? Dude, you just never know. And there it is. All packed up, ready to go. It's just so great. They really took my vision and made it perfect. Like this is exactly what I've always wanted, and now it's here, and it's something that we made together. So thank you Kondor Blue for making my dreams come true. This is so exciting. (upbeat music)",
    "transcript_keywords": [
        "USBC",
        "pink USB cables",
        "Carry",
        "charge",
        "cables",
        "cable",
        "pouch",
        "Apple",
        "bag",
        "USB",
        "zipper",
        "Duo Charger",
        "USB micro",
        "Kondor Blue",
        "MagSafe Duo Charger",
        "EDC pouch",
        "charger",
        "travel",
        "micro",
        "Ring"
    ],
    "transcript_entity_values": [
        "MacBook",
        "one",
        "USB-C",
        "Apple",
        "Justine",
        "Mexico",
        "Sony",
        "iPhone",
        "the past couple of years",
        "last year",
        "AirPods Pro 2",
        "35 watt",
        "many years ago",
        "one day",
        "Kondor Blue",
        "USB-micro",
        "Kondor Blue",
        "SD",
        "EDC",
        "two",
        "Oura Ring",
        "USB micro",
        "CFexpress",
        "Apple Watch",
        "USB",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}