{
    "id": "PUJ1qMHol4I",
    "title": "What does Corroded Glass *REALLY* look like? - Giveaway!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-06-09T15:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=PUJ1qMHol4I",
    "category": "Howto & Style",
    "tags": [
        "Clear oneplus 6",
        "corrosion",
        "corroded glass",
        "one plus 6",
        "smartphone",
        "flagship",
        "flagship killer",
        "oneplus 6 unboxing",
        "oneplus 6 durability",
        "oneplus 6 hands on",
        "Clear back",
        "transparent one plus"
    ],
    "views": 605405,
    "likes": 23391,
    "comments_count": 5189,
    "description": "You want to win this clear OnePlus 6? 3 steps to enter: 1) Follow ME on Instagram:  2) Follow OnePlus on Instagram:  3) Leave ONE comment on my instagram  picture talking about this video   Ill pick one winner on Thursday June 14th. YouTube, and instagram are in no way associated with this giveaway. It is international, must be 18 years old to enter. Remember this phone is unique! LITERALLY one of a kind. But it has lost its water resistance. So keep it dry like you would any piece of expensive tech.   Here is some $10 dollar etching cream I talked about:  And the tape I use:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.instagram.com/ZacksJerryRig/",
        "https://www.instagram.com/OnePlus/",
        "https://amzn.to/2sTQG58",
        "https://amzn.to/2xU8WRV",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So I was at the OnePlus 6 launch event in London a couple of weeks ago, and I saw that they had a matte black glass version of the OnePlus 6. And they used a corrosion method to matte-ify that back glass. So I asked them, I was like, hey OnePlus, how about you let me have one of those matte black glass versions so I can take it apart on my channel and show what that abrasion looks like...that corrosion layer. And after we analyze that back glass from the inside, and see what that abrasion or corrosion looks like, we give it away to one of you guys. Luckily they said yes, so let's get started. [Intro] I have all three colors here for comparison. The Mirror Black on the right with its super shiny reflective surface, and the Midnight Black or the matte black here in the center. The Midnight almost has a metallic look to it I feel like, looking like anodized aluminum, but feeling like smooth glass with a very unique tornado swirl in the center that changes with reflection. The Silk White version also has more of a matte look to it, but with gold accents along the fingerprint scanner and the sides. I think the Midnight looks pretty awesome, but all 3 are definitely unique. OnePlus said they use a special form of corrosion directly on the underside of the glass to carefully create countless tiny holes. I think it might just be a layer of opaque plastic laminate, but there's only one way to know for sure, and that's from the inside. I won't bore you with all the details since we've done this once with the Mirror Black OnePlus 6. So long story short: heat softens the adhesive, glass is glass so I'm being careful, and it only takes a few minutes to remove the panel. I've done this a lot though. One last slice through the top adhesive and the back glass panel is released, exposing the non-red battery and our super long fingerprint scanning ribbon. The underside of the glass is looking pretty familiar so far, compared with the Mirror Black, but we'll see what happens when I start peeling off the thin layer of film. The fingerprint scanner, camera lens, and LED flash diffuser are all removed, and now it's time for the good stuff: scraping and peeling off the under layer. Once I get a good enough grip on the film, it will peel off in larger chunks, and it doesn't take too long to realize that the frosted effect from the corrosion that OnePlus was talking about is indeed built straight into the glass. There is no other plastic layer on the surface. It looks pretty cool and impressive that the effect was applied directly to the glass. It should make for an interesting clear phone for one of you guys to keep. I'll lift up a larger chunk of film and start peeling that off. You can see as I flip back and forth with the glass and laminate how opaque the thing really is. It's interesting how many different things can be done with glass. I imagine OnePlus obtained this effect with some kind of acid etching solution. You can buy etching cream on Amazon for pretty cheap that will replicate this same effect on any piece of glass for about 10 dollars. People use this cream to etch designs or logos into windows or mirrors, or I guess you could even use it on your own phone if you really wanted to. Finally the glass is clear. The OnePlus logo remains unetched, which is kind of fun. It was probably a piece of vinyl that was removed after the cream was washed off. It's the only part of the glass that is still totally see-through. OnePlus would save me a step if they just made the battery red. But luckily when I asked dbrand for some red skins, they sent me way more than I needed. Either dbrand was feeling generous for a second, or they can't count real good. I'm not sure. Either way, I'm not complaining. The battery is now red and the phone is ready for the double sided tape. I've had a ton of people ask me where I buy this stuff, so I'll link it in the video description along with the tools I use. The glass is now clean with the camera lens back into place, along with the little flash and the fingerprint scanner. I have a feeling this is going to look pretty sweet. So far the phone's turning out pretty well. I have my totally clear OnePlus 6 for reference against this frosted glass version, once it's finished. The super long fingerprint scanner is clipped in and glass set down into place. And the giveaway phone is complete. Which one do you prefer? The frosted glass on the left cuts down on glare and visible fingerprints, and it also has a way more subtle OnePlus logo in the center...more of a phantom logo which can only be seen in certain lighting. I'm a fan. But then the totally clear OnePlus is, you know, totally clear. Let me know down in the comments which one you prefer. To enter into the giveaway is pretty easy. Just come follow me and OnePlus on Instagram. I'll leave links in the video description. And leave a comment on my frosted OnePlus picture. I'll pick the winner in a few days. Best of luck on the giveaway. I'm excited to hang out with you over on Instagram. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "glass",
        "matte black glass",
        "event in London",
        "London a couple",
        "Mirror Black",
        "OnePlus",
        "black glass",
        "black",
        "matte black",
        "black glass version",
        "Mirror Black OnePlus",
        "glass version",
        "pretty",
        "Midnight Black",
        "corrosion",
        "weeks ago",
        "London",
        "launch event",
        "couple of weeks",
        "fingerprint scanner"
    ],
    "transcript_entity_values": [
        "OnePlus",
        "The Mirror Black",
        "Midnight",
        "Instagram",
        "a few days",
        "three",
        "about 10 dollars",
        "only one",
        "a couple of weeks ago",
        "Amazon",
        "the Mirror Black",
        "OnePlus",
        "the OnePlus 6",
        "OnePlus 6",
        "second",
        "a few minutes",
        "London",
        "3",
        "One",
        "the Mirror Black OnePlus 6",
        "OnePlus 6",
        "one"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "EVENT",
        "EVENT",
        "ORDINAL",
        "TIME",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL"
    ]
}