{
    "id": "pWt8BTpuuA4",
    "title": "Inside Microsoft’s big bet on open design",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-04-29T14:00:10Z",
    "video_url": "https://www.youtube.com/watch?v=pWt8BTpuuA4",
    "category": "Science & Technology",
    "tags": [
        "microsoft",
        "microsoft design",
        "design",
        "tech",
        "process",
        "company",
        "tour",
        "laptops",
        "surface",
        "computers",
        "gadgets",
        "products",
        "top 10",
        "latest updates",
        "tech news",
        "how to",
        "mkbhd",
        "apple",
        "google",
        "iphone",
        "review",
        "verge",
        "the verge"
    ],
    "views": 736424,
    "likes": 12483,
    "comments_count": 762,
    "description": "Microsoft is completely changing the company's approach to design. This huge shift will impact how all their products look in the future. Tom Warren visits the Microsoft headquarters in Redmond, Washington to learn about what the company calls open design. This new way of working will enable Microsoft to build hardware and software that feels like its all created by one company.  Learn more here:   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Listen to our podcasts:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2GObOky",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "Microsoft is changing in a way that might not be super obvious from the outside. But this huge company shift will impact exactly how their products will look like in the future. I visited Microsoft's headquarters recently to learn about what the company calls open design. It's basically a way for Microsoft to build hardware and software together in a way that makes it feel like it was built by one company. Before we dive too deep into some of these changes, let's look why Microsoft had to try something new. Over the last decade, Microsoft has learned the hard way that having small teams working independently doesn't always produce the best results. Everyone was kind of working on their own, prototyping their own areas. And, at best, you were kind of showing pictures to each other. The company has suffered a series of product flops like Kin, ultra mobile PCs, or even Windows 8. Most of these products failed because they were either way too early or Microsoft just didn't give them the full backing of the entire company. Just look at the Courier tablet that, after years of hype, never launched. Or even the Surface Mini that was canceled just weeks before its announcement. Microsoft is changing the way they develop and design products because not changing is far riskier. Teams would incubate products. They would go to try to build sort of that product themselves. And to build a product, they would have to just try to build the entire product. The other big motivation here is speed. The old way of doing things meant an idea took years before it was even ready to launch. Back when we used to ship software, client software every two to three years, we had to imagine what was going to happen two years from now in the industry and be right about a solution. And that's really tricky because the industry keeps moving faster and faster. Microsoft has been moving to a more agile approach recently. And that means software updates every few weeks, rather than a big, splashy release every couple of years. Working in an agile way means creating something in its simplest form and then building on top of it. So think of a pizza. You create the base to start with. Then you add toppings over time. This means that the value is seen a lot sooner and before the whole project is finished. This new open design philosophy applies the same set of rules across the entire company. It prioritizes experimentation and collaboration, which helps employees share the workload. A design piece built for one product should be easily incorporated into another. Every product doesn't need its own search box or chat bubble. Instead, think of these designs like toppings. They're centralized and just reused. Sharing internally is only one part of the puzzle. Microsoft is also embracing open source far more across the company. Microsoft has even spent $7.5 billion to acquire GitHub and allow its own developers to share and collaborate even closer. I don't know what percentage of our code we write per product, but one app team can take all of the Azure Stack now and not have to write that entire service. Each team doesn't have to write 100 percent of the code, and they're not anymore. That's a shift toward the success of working in the open. For a company as big as Microsoft this all sounds like a multiyear challenge, and there's no guarantee this will even be successful. In fact, Microsoft has tried to align its products before. Windows Phone pulled in a bunch of different teams at Microsoft to try and win at mobile. And it was an early example of how the company could tightly combine hardware and software. Compared to now, this same collaborative process is being applied to all of Microsoft's products. Where we learn, at least on phone, is that, Hey, to have a great design system, it cannot just be for one product. It's like, how do you actually scale that to hundreds of products serving millions of customers, in some ways billions of customers? Microsoft's big drive here is being far more agile and speedy with the products it creates. We've seen Google push rapid change with Chrome and Android. But there's not many other companies as big as Microsoft that have transitioned to a fully agile approach. Spotify, Atlassian, and Facebook are some good examples of companies that are rapidly pushing software development. That said, there are some early examples showing that Microsoft is on the right path, like monthly updates to Office or icons in webpages across Microsoft's software products all looking very similar. The company calls this fluent design. It's a pretty subtle approach with motion and blur effects that are designed to scale across any device. There's even cartoon-like people that Microsoft's using across its online services that all look very similar. In the future, Office, Skype, Surface, and Xbox could all share the same software design. The challenge now is to take ideas from Microsoft's 100,000-plus employees and then create a design that will scale and feels coherent to the billion people that are using products like Office and Windows. If this open design doesn't really work out, we could be looking at hardware and software that's been well-designed but that just reminds us of what could have been. Okay, thanks for watching. We also did a Surface Hub 2 hands-on recently. You can check that out on our YouTube channel at youtube.com/theverge. And for everything else Microsoft, theverge.com",
    "transcript_keywords": [
        "Microsoft",
        "company",
        "products",
        "product",
        "design",
        "software",
        "super obvious",
        "Microsoft software products",
        "years",
        "open",
        "big",
        "open design",
        "Microsoft products",
        "build",
        "working",
        "Surface",
        "Office",
        "entire",
        "agile",
        "Windows"
    ],
    "transcript_entity_values": [
        "100 percent",
        "multiyear",
        "Android",
        "only one",
        "Windows Phone",
        "one",
        "hundreds",
        "just weeks",
        "Windows 8",
        "every few weeks",
        "millions",
        "the Azure Stack",
        "Courier",
        "100,000-plus",
        "Google",
        "Spotify",
        "GitHub",
        "every two to three years",
        "Office",
        "years",
        "monthly",
        "the Surface Mini",
        "two years from now",
        "Atlassian",
        "Skype, Surface",
        "Chrome",
        "Facebook",
        "the last decade",
        "Xbox",
        "billions",
        "Kin",
        "every couple of years",
        "YouTube",
        "$7.5 billion",
        "Microsoft"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "MONEY",
        "ORG"
    ]
}