{
    "id": "pz2BXUcYgKc",
    "title": "Roller Coaster Safety: How to Manage Too Many Trains at Once",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2018-01-08T20:38:56Z",
    "video_url": "https://www.youtube.com/watch?v=pz2BXUcYgKc",
    "category": "Science & Technology",
    "tags": [
        "Space Mountain",
        "roller coaster",
        "disney world",
        "disneyland",
        "walt disney world",
        "brakes",
        "roller coaster safety",
        "safety systems",
        "block brakes",
        "block section"
    ],
    "views": 812345,
    "likes": 24068,
    "comments_count": 1152,
    "description": "You can support this channel on Patreon!  Link below Roller coasters are pretty neat, I must say.  But they rely on passive vehicles holding fragile humans while zooming around at high speeds.  That can be a tough thing to manage safely, but it's not impossible.  This video shows you a few ways it's done.  Space Mountain with the lights on, reset sequence:   Expedition Everest on ride POV:   You can support this channel on Patreon!  Support from patrons like you are keeping this channel possible.  If you'd like to make a voluntary contribution, please visit the following link.  Thanks for your consideration!    And thank you to these current patrons!  Charlie Quigley, Tommi Hares, Dakota Williams, Chuck Floyd, Eitan Tal, Sophie Haskins, James Id, Brendan Sheehy, Jay Foreman, Howard Longden, Rich Theobald, Kyle Olson, Bryan Reid, Quinton Wilson, Jeremy DeGuzman, Sean Spark, Lucas Hartbarger, Taylor Cuzela, twiglet, David Lastres, Granger Meador, Jeremy Kitchen, Jason Wellband, Alex Smith. Shane Belaire, Paul Emmerich, Sam Hodge, Matthew Rossi, Paul Craigie,Paul Williams, Brian G. Shacklett, Colton, Aubrey Hooke, Paul Mills, Christopher Luna, Kotanu, Brendan Terrett, Tiago Pereira dos Santos silva  From Porto, Portugal, Techmoan, Mike Mason, Clara Latter, Elijah Reeds, Christopher Jett, Justin Talbot, Francisco Vogliotti, Steven Metcalf, Verysofisticated, Lolucoca, Matt Standish, John McLusky, Ashleigh R, Stephen Bell, Logan Beenken, rn Arnarson, Eric Wood, Stephen Pick, Stephen Vrazel, Paul Fisher, BlancoGrande, Matthew Giraitis, James Ryan, Robert Joscelyne, Ellis M. Eisen, Francis Fisher, Kedar Deshpande, Boris, Bill Basch, Lukas Komischke, Dave Anderson, Felix Freiberger, Dane Peterson, Brent LaRowe, Aerospyke, Kieran Cox, Hunter Schwisow, Logan Kriete, Rafa Wiosna, Adam D. Ruppe, Audin Malmin, Eric Hansen, Noah McCann, Jason R Scheuren, Rufo Sanchez, Bjrn Vegar Torseth, Yaniv, Matt Greer, Teague Chrystie  The following photos are used under the Creative Commons License: Space Mountain empty train at station: Photo by William M.   X-Flight at Six Flags Great America: Photo by Magnus Manske.  Whizzer at Six Flags Great America: Photo by Flickr user Eden, Janine and Jim.   Big Thunder Mountain Railroad:  Photo by AmaryllisGardener.   Expedition Everest Exterior Shot and Lift Hills: Photo by Flickr user magicalfanaticism:   Expedition Everest Reversing Sections: Photo by Quarax.    Entrance to Walt Disney World Photo by Jrobertiko.  Used under Creative Commons License  Note: Trademarks within photo are owned by the Walt Disney Company Spaceship Earth: Photo by chensiyuan.  Used under GNU Free Documentation License",
    "description_links": [
        "https://www.youtube.com/watch?v=0MEo8XJiPhg",
        "https://www.youtube.com/watch?v=hE0UioXuqFI",
        "https://www.patreon.com/technologyconnections",
        "https://commons.wikimedia.org/wiki/File:WDW_SpaceMountain_Train2009.jpg",
        "https://commons.wikimedia.org/wiki/File:X-Flight_train_exiting_inversion.jpg",
        "https://www.flickr.com/photos/edenpictures/9488304302",
        "https://commons.wikimedia.org/wiki/File:Big_Thunder_Mountain_Railroad_2.jpg",
        "https://commons.wikimedia.org/wiki/File:Expedition_Everest_(16616700773).jpg",
        "https://commons.wikimedia.org/wiki/File:Expedition_Everest_(17235190512).jpg",
        "https://commons.wikimedia.org/wiki/File:Expedition_Everest_Broken_Track_1.JPG",
        "https://commons.wikimedia.org/wiki/File:Expedition_Everest_Yeti_Roaring.JPG",
        "https://commons.wikimedia.org/wiki/File:Walt_Disney_World_Resort_entrance.jpg",
        "https://commons.wikimedia.org/wiki/File:1_epcot_spaceship_earth_2010a.JPG"
    ],
    "transcript": "I recently returned from a family trip to Walt Disney World. Everyone in my family is a bit of a Disney fanatic, and weve made many a trip. Yes its an expensive adventure, but its a place that has a special place in my heart, and one that I truly believe has shaped me into who I am today. Particularly my experiences at Epcot, perhaps the only theme park dedicated to exploring new technologies and world cultures. What excites and interests me most about Walt Disney World is their constant innovation and use of technology in novel ways. The technology throughout the resort has always fascinated me. From what today we would call simple things like using RFID tags to cue up narration segments on Living with the Land (Narration: Some of our best ideas have been inspired by nature) not to mention Magic Bands, to the use of Monorails as an actual transportation solution, oh and why not send it through the atrium of a hotel and build a station while were at it, to the use of linear induction motors to propel the ride vehicles of the Peoplemover (a system, by the way, which has been in near constant use since all the way back in nineteen-seventy-freaking-five. (60Hz hum from propulsion system) Love that sound! To the increasingly complex and impressive Animatronic figures, with this new NaVi figure being remarkably fluid and believable. But this video isnt about those things, its about ride safety and capacity. Yeah. Im a nerd. Deal with it. Because of Disneys extensive use of theming, they are able to hide certain ride control elements to make their attractions accommodate more people while still remaining safe. What Im talking about here are roller coasters. Roller coasters generally receive all the energy they need at the beginning of the ride. Whether its a launch or a more traditional lift hill, a roller coaster train starts the course with the maximum amount of energy at the beginning, and then navigates the track with an overall downward slope from its highest point. With rare exceptions, roller coaster trains are entirely passive vehicles, requiring elements in the track to both provide them with energy (such as a chain lift) and to stop or slow them through the use of brakes. Because the control elements are located in the track, the capacity of a roller coaster is limited. When in operation, two trains cannot navigate the course at the same time or a collision would be possible should one train encounter a problem, such as a dislodged wheel, and come to an unexpected stop. In many roller coasters, this is managed with large trains capable of handling many people. When one train is dispatched, another takes its place in the station to be unloaded and reloaded. But that train cannot be dispatched until the train in front of it returns to the station, at which point it is certain a collision cannot occur as the first train has returned and is now stopped. This means that trains can only be dispatched about as frequently as the ride is long. A roller coaster with a two minute ride time can therefore only dispatch one train every two minutes, so its capacity is limited to 30 train loads per hour. This necessitates long trains with many seats, or an acceptance of lower ride capacity. Now, if youve ever ridden Space Mountain, youll know that each train holds a whopping 6 people. This is needed because the ride is enclosed in a building and doesnt have a lot of space. Which is odd given the name. Anyway, the tiny trains are able to navigate really tight corners and sudden changes of direction, which allows for the ride to be very thrilling even though its so compact. But with only six people per train, the rides capacity would be pretty awful if only one train was allowed on the course at once. With a ride time of 2 and a half minutes, only 144 people could ride per hour. So, there must be some tricks up their sleeves. The first and most obvious trick is that there are two mirrored copies of the same roller coaster inside the mountain at Walt Disney World. So now weve got 288 people per hour. Whoop-a-de-freaking doo-da. But if you pay attention while in line, youll see that they send a train about every 20 seconds. With two sides running, thats like sending 6 people every 10 seconds. Thats a much more impressive 2,160 people per hour. But how can they do that and still be safe? Dispatching a train that frequently means there are about 7 trains running about at once. Well, the fact that the ride is in nearly complete darkness means that Disney can hide a lot of safety elements. What are they hiding? Lots and lots of brake runs. Incidentally, its not that hard to see what Space Mountain looks like with the lights on, just ride the peoplemover while its broken down and youll get a good view. Theres oodles of mechanical equipment everywhere, and among the wires, girders, and gobbledygook are frequent, regular intervals of straight ride track containing brakes just like you see in the station, but stronger. These are called brake runs, and they are capable of bringing the train to a complete stop with a moments notice. Lets build a mini-roller coaster using marbleworks. Yes, marbleworks. When a marble is placed on the course, it cant be stopped until it reaches the bottom. If these marbles were vehicles containing fragile and litigious human beings, the only way to prevent collisions would be to only allow only one marble on the track at once. But lets imagine that at each connection to the next piece there is a brake run that can stop the marble. Now we can send more than one marble at a time because there are multiple places that we can stop them if necessary. To prevent collisions in a rollercoaster, the rides computer system is constantly monitoring sensors in each of these brake runs which tell it if a train is there and how fast it is going. The computers goal is to ensure there is always a brake run between trains. It will not allow a train to pass through a brake run unless the following brake run has already had a train go through it and is now clear. If the train in front of you hasnt made it out of its own brake run, the computer will immediately apply the brakes ahead of you to stop your train and prevent a possible collision. These intervals on the track are called block sections, as any Roller Coaster Tycoon aficionado would know. Also of note is that the type of brakes used in roller coasters generally require power, often in the form of air pressure, in order to be released, with a spring providing the actual braking force. A sudden loss of pressure will cause them to immediately engage. Now, with trains being sent every 20 seconds in Space Mountain, there needs to be a brake run at least that frequently throughout the ride. But sticking to that interval for brake runs would require that each train go through the course at precisely the same speed. If the train in front of you were to slow down even just a little bit, your train would need to be stopped at the next brake run to eliminate the risk of a crash. This would happen because the computer didnt see the lead train go through the brake run and cant be sure a collusion wont happen. This would also require all trains behind you to be stopped. Additionally, if your train got ahead of where it should be, there would be no way to prevent a collision with the next train should it stop unexpectedly. There should therefore be a brake run about twice as often as the trains are dispatched. This allows wiggle room for inconsistent train speed, and ensures there is always at least one brake run between every train. And in fact, if you pay attention while riding Space Mountain, youll notice an odd regularity in the ride. Space Mountain as a ride is very twisty, turny, droppy, and fun. Kinda like marbleworks. But about every ten seconds, you spend a moment going perfectly straight. Then you resume the shenanigans, and after another 10 seconds, you go perfectly straight for a brief moment. After which point you again spend roughly 10 seconds careening through the galaxy, before going perfectly straight. Each of these straight sections is a brake run. Brake runs have to be straight as the brake fins below the train need to be lined up between the squeezy bits here. And though you cant see it, theres also a platform and walkway beside you along the brake run in case of a ride evacuation. With frequent brake runs, the computer controlling the ride can also adjust the speed of trains. Because train detection sensors can determine the speed of each train in addition to simple presence, the computer can compensate for a train going too fast by lightly applying the brakes to slow it down. In this case, the brakes would be referred to as trim brakes, and you might notice your train being slowed down in these straight sections from time to time. Likewise, it can slow trains if a train up ahead is going slower than usual. The brakes and computer system work together to allow perhaps as many as 7 trains on each track to traverse the course at once. But sometimes errors do occur. If the computer tries to slow down a train and slows it too much, it may not clear the following brake run before the train behind it catches up. Or perhaps the brakes failed to act well enough, allowing the train to get too close to the following train. Or even simpler, a sensor may be acting up and reports something weird to the computer, making it think a ride vehicle is present when it actually isnt. In these cases, the computer will need to take over. Though I cant confirm it as Ive never worked on a roller coaster or studied its operating minutia, its likely any of these scenarios will trigger a complete stop of the ride, with every brake run instantly engaging to stop all motion on the track as soon as possible. This safety measure is probably the cause of many a lengthy breakdown, as the ride will have to be manually reset after these emergency stops. In fact, theres a great video here on YouTube of the Disneyland space mountain, thats Disneyland in California, going through just that. Disneylands space mountain is slightly different in that theres a single track with each train holding 12 people. In the video, you can see that there are trains scattered throughout the mountain, with each of those brake runs holding a train. The cast members then go backwards through the mountain, starting at the bottom, releasing trains one at a time through the rest of the ride. Once all the trains have returned, they can begin the process of restarting the ride. The unfortunate thing about Space Mountain is thats its pretty much impossible to show you any of this. Disney went the easy route and relied on the cover of darkness to hide whats going on. But at Big Thunder Mountain Railroad, I can. Remember how I said Because of Disneys extensive use of theming, they are able to hide certain ride control elements to make their attractions accommodate more people while still remaining safe earlier in the video? Well, at this attraction, they use a different method. Big Thunder has an immense capacity, with each train consisting of 15 rows that can accommodate two adults with a child. AND, Big Thunders station uses two loading platforms with track switches, which allows for sending trains twice as fast as they can be loaded. Sending trains so frequently means that multiple trains occupy the track at once, which requires the use of block sections to prevent collisions. But rather than use frequent brake runs which are obvious without Space Mountains shotgun approach of complete darkness, Big Thunder Mountain Railroad contains three separate lift hills. A lift hill can be a type of block section as the train can be stopped simply by stopping the lift. Lift hills also offer more flexibility, because the train travels along it for a large number of seconds and therefore is in complete computer control for longer. The computer has all this time to decide if it needs to stop the train, allowing for a large amount of slop and inconsistency between trains. Also, because each lift hill moves the train as part of its normal operation, the ride can recover from minor trouble by restarting a trains movement after a stop was required, so long as its safe to do so. This is in contrast to Space Mountain, where the block brakes are simply providing a last-minute means of stopping the ride altogether in emergencies. This merging of theming and mechanics is one of those things that I consider genius on Disneys part. The extra lift hills on Big Thunder seem, from the riders perspective, to simply be theming elements or perhaps just a fun addition to the ride, but they are more than that. They are an integral part of the rides safety systems, allowing for a huge boost in ride capacity all the while protecting you from injury (and the company from lawsuits). Expedition Everest at Animal Kingdom takes this one step further. I dont have footage of the ride so Ill be brief, but this ride contains two lift hills, and two reversing sections. All of these elements allow the train to be stopped if need be, with the reversing sections stopping the train as part of a normal ride experience. By building a stop into the rides theme, there is yet another added point of flexibility. In this case, if a train in front of you is occupying the next block section, the ride system simply holds your train longer than usual. Once its clear to go, the train is released. If youd like to see this ride in action, check out the link below or through the card on your screen. And please, fix the Yeti. Ive often felt that Disney has shaped the kind of person I am in more ways than one. Id say a large part of my interest in technology comes from this technological mecca of entertainment. It was always fun to try and figure out how they did what they did, and let me tell you, Im still having fun doing that today. Thanks for watching, I hope you enjoyed the video! And if you did, please consider subscribing. Id also like to thank all of my supporters on Patreon. You can also support this channel through a totally voluntary contribution by visiting the link below or on your screen. Your support can help me make videos like this more frequently, and your consideration is much appreciated. Ill see you next time.",
    "transcript_keywords": [
        "train",
        "Walt Disney World",
        "ride",
        "brake run",
        "Space Mountain",
        "trains",
        "brake",
        "brake runs",
        "Mountain",
        "Disney World",
        "Walt Disney",
        "roller coaster",
        "run",
        "Space",
        "Big Thunder Mountain",
        "brakes",
        "roller",
        "Disney",
        "Thunder Mountain Railroad",
        "stop"
    ],
    "transcript_entity_values": [
        "Big Thunder",
        "60Hz",
        "Disneys",
        "Disney",
        "two minute",
        "Animal Kingdom",
        "nineteen-seventy",
        "about 7",
        "30",
        "only 144",
        "only one",
        "roughly 10 seconds",
        "Roller Coaster Tycoon",
        "Animatronic",
        "two",
        "Magic Bands",
        "every two minutes",
        "Walt Disney World",
        "more than one",
        "NaVi",
        "every 20 seconds",
        "another 10 seconds",
        "6",
        "only six",
        "Whoop",
        "Monorails",
        "about every 20 seconds",
        "Patreon",
        "today",
        "Space Mountains",
        "Epcot",
        "2,160",
        "at least one",
        "Disneyland",
        "12",
        "Peoplemover",
        "Expedition Everest",
        "2 and a half minutes",
        "California",
        "YouTube of the",
        "Space Mountain",
        "first",
        "one",
        "Big Thunder",
        "every 10 seconds",
        "Walt Disney World",
        "as many as 7",
        "15",
        "Yeti",
        "288",
        "Big Thunder Mountain Railroad",
        "Living with the Land (Narration",
        "last-minute",
        "RFID",
        "three"
    ],
    "transcript_entity_types": [
        "LOC",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "GPE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "FAC",
        "CARDINAL",
        "ORG",
        "TIME",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "FAC",
        "TIME",
        "ORG",
        "DATE",
        "LOC",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "FAC",
        "LOC",
        "QUANTITY",
        "GPE",
        "WORK_OF_ART",
        "LOC",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "FAC",
        "FAC",
        "WORK_OF_ART",
        "TIME",
        "ORG",
        "CARDINAL"
    ]
}