{
    "id": "Q0xljE76JXc",
    "title": "Are Esports REAL Sports?",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-06-12T16:28:33Z",
    "video_url": "https://www.youtube.com/watch?v=Q0xljE76JXc",
    "category": "Gaming",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "LGUltraGear",
        "27GN750",
        "esports",
        "f1",
        "valorant",
        "fortnite",
        "gaming",
        "nba",
        "2k",
        "formula f1",
        "racing",
        "racing sim",
        "nascar",
        "games",
        "video games",
        "league of legends",
        "league",
        "LoG",
        "riot",
        "epic",
        "riotgames",
        "espn",
        "e sports",
        "starcraft ii",
        "star craft ii",
        "starcraft 2",
        "blizzard",
        "overwatch",
        "tech",
        "technology",
        "tech news",
        "sony",
        "microsoft",
        "ps5",
        "ps4",
        "xbox",
        "console gaming",
        "pc",
        "pc gaming",
        "daniel abt",
        "audi",
        "forumula E",
        "ringer",
        "indycar",
        "lorenz hoerzing",
        "csgo",
        "dota 2",
        "sports"
    ],
    "views": 109457,
    "likes": 2172,
    "comments_count": 199,
    "description": "Is Esports about to have a break out year?   Check out the LG UltraGear 27GN750:  LG.com:    Amazon:     Thanks to LG for sponsoring this video!  Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://bit.ly/3cJLBSg",
        "https://geni.us/27GN750ThisIs",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome to This Is, Austin, is it eSport's time to shine? - I would absolutely argue that it is. So obviously the world events of the last few months have impacted pretty much all aspects of sport, eSport included, but it's also given a lot of opportunity. Because if you look on ESPN, you look on Sky Sports, you look pretty much anywhere around the world, only now after months of delay are some sports starting to get back going, whereas the entire time, eSports has absolutely flourished. - Well, that's not entirely true. Some pretty major events were canceled because of this. I remember the League of Legends was one of them, that was probably the biggest one. I think the CS:GO qualifiers or whatever tournament was big Dota 2 was a big one that was postponed. So it hasn't been exactly smooth sailing, but I think we're primed for it to be smooth sailing moving forward. - Well, I think the thing is, there certainly have been events canceled across the sports and eSports spectrum, but all of the events or primarily all the events that have been canceled, have been events that were really primarily focused around the idea of, \"Oh, we're going to do some huge in-person thing.\" Think about what Fortnite has been doing recently. Obviously there's a huge market for eSports becoming bigger. And traditionally before all of this stuff happened, that was very much the way to go about it, right? If you're epic, and you really wanna promote Fortnite as a competitive game, you wanna help spread its popularity, you're going to splash a giant pile of cash on some huge tournament, you gonna go rent out Wimbledon and just try to make something which is huge, which gets a bunch of headlines, which gets a bunch of more people playing the game, that makes sense. And I get why those events have been canceled, but the thing is, so much of eSports has become a more organic thing that has really replaced sports in a lot of ways. So take, for example, F1 racing, which is personally one of the sports that I follow most. So obviously, the F1 season didn't get started. It came very close back in, I guess it was March, but we have not seen any racing yet this year. Instead, they have put together Virtual Grand Prix. You know, what else is great for eSports? The proud sponsor of today's This Is video, LG in their brand new UltraGear 27GN750 monitor. Obviously we're all spending a lot more time at home right now, which means that something like the UltraGear is a very nice upgrade, especially if you're coming from a standard boring 60 Hertz monitor. Is not only is this 1080P 240 Hertz, but it's also an IPS panel, which means that not only are you getting all of the accessories, but you're also getting the high frame rate, you're getting the one millisecond response time. But more importantly than that, you're actually giving a high quality panel. We're also getting not only full support for G-Sync, but we also do have HDR10. See, it's all about your quality and your performance. So the nice things about the display is that of course it does have a very narrow bezel. So there's essentially no bezels on the top three sides, which does help to keep you more in the game. And 240 looks so smooth. Too bad we can't show you 240 in a video or a good gameplay in a video. So if you would like to experience being a winner, you could check out the LG UltraGear 27GN750 at the link in the description. Up your game, up you life. Trademark. Not really. - For those of you who are not aware. I know MBA was probably the biggest one who was doing this. So a lot of NBA players played in a televised tournament on ESPN, where they played for, I think it was $100,000 to charity. And that was what ESPN was broadcasting instead of any type of sports. So, that was probably the most mainstream eSports has probably ever been. - Yeah, well, it's interesting because this has definitely been a trend over the last few years of more and more eSports sort of landing on the traditional TV network that you would traditionally find with normal sporting events. But the thing is, you look at the ESPNs of the world, there is no sports going on at all. They're desperate for something to put on air and while they've sort of dipped their toes in covering things like Dota tournaments, it really hasn't been a major focus, but of course there are huge tournaments for other more traditional eSports titles, like CS:GO, like Fortnite. Did I just say, Fortnite is a traditional eSports title? - You did, but I mean, I would have trouble arguing that it's not. Mainly because again, it's one of the titles that really popularized it. Because obviously you've had like StarCraft for decades at this point, right? 20 years? - Well, yes, StarCraft, I think was probably one of the biggest sort of eSports games they really even revolutionized the term, right? Because, you look, especially in Korea, eSports has sort of really been synonymous with the way that StarCraft 1, and of course StarCraft 2 have built out over. Yeah guys, it's probably has been almost 20 years at this point. What's interesting about this though, is that there's certainly downsides specifically when it comes to all of these celebrities and athletes who have started streaming who've started participating in some of these online events because there can absolutely be a downside, right? So just a couple months ago, there was a NASCAR driver who got fired for using a racial slur on stream, which obviously is just stupid. And even sort of more recently, there was an Audi driver for Formula E who got literally fired from the team because he hired a ringer. He hired a professional sim racer to play as him in the race. - Wait, so the professional driver? - Yes. In real life, formula E, real car. - Now did Audi immediately hire that ringer? - (laughs) Well, it's not the same thing. So while I will say that I obviously am biased here, but I do think that racing is probably the closest sort of eSport to the real world competition. It's not the same thing, right? I mean, even the best sim in the world. - There's no controller or a joystick on the basketball, that's what I'm saying. - Exactly. I can't just press X to pass, it's literally like, this is not how you, how do I just jazz hands, but this is how I pass. - I couldn't see that you did jazz hands, so I'm really glad that you vocalized that for me. - eSports have obviously come a long way and they're gonna continue to grow, right? I feel there's no doubt. I'm sure these drivers who got fired were probably used to giving an interview after they win a race, but probably not so much when you're streaming for hours-a-day, there's certainly a downsides to that, right? All it takes is for you to say one stupid thing that you weren't thinking about you're on stream, and boom! You could be fired. There's huge consequences here. That being said, I would say for the vast majority of these cases, it's been a really cool thing for eSports to see these real drivers or real athletes playing these games. And not only just sort of experiencing sort of everyone playing together, but also seeing all these drivers hanging out and chatting on their streams and doing ridiculous silly things like racing lawn mowers on a game or something. There's a lot that I think is being added there and it's opening up a lot of people who've probably never even tried sim racing or never even tried 2K to actually not only jump into the game, but also promote the entire idea of these games as legitimate eSports. - I 100% agree with you there. Again, eSports the whole point of why this would be succeeding right now, is that they can be all online. And so if it was truly their breakout moment, I feel like the Dota tournament or the League of Legends tournament wouldn't have missed to be. - I think it comes down to money, right? So if you were one of these companies, who's really trying to organize this huge splashy event, where obviously you invite tons of people from all over the place. You're trying to get a lot of media buzz around it, it makes sense that you wanna make some huge physical event. If that's not a thing, and certainly with the economic uncertainty of not knowing sort of where the money is coming from, whether or not advertisers are going to go on board, I get that some tournaments certainly have not gone forward and some things have been delayed, but I still think that this is a positive overall trend, right? Because you're going to see more of these things set up to be online. - So I agree that's a positive trend. So what I think this sets up is for the next generation of eSports players. I think it's going to be their time to shine. Now you're going to see, the big sport-heavy dad, the suburban dad really, who is seeing on ESPN, which he watches religiously, eSports being a legitimate, not only hobby, but a legitimate career choice for some people. I think this is gonna open up the accessibility of eSports. And so while it may not be exploding right now, the way we would maybe think it is with everything being online, I do think it sets up the openness for everything to explode maybe in a couple of years. So there are still a ton of hurdles that eSports has to get over that are completely irrelevant to current world situations. The biggest one is that, most professional eSport players, or, not most, but a lot of them are under the age of 18. - Well, I mean, eSports has had a long history of sort of younger people excelling, right? I mean, there's a lot of cases where, I mean, look at Ninja when he was younger, he really played very heavily in the competitive Halo scene and sort of as he got older, not to say that he's some old man or whatever now, but he obviously transitioned into streaming. Still is a very good gamer, but maybe not quite as competitive as someone who's legitimately in these tournaments day-in and day-out. - Riot owns League of Legends and they can hold those tournaments all day long, no one else can hold those tournaments. There's the issue of the NBA and ESPN, were holding this 2K tournament. Well, what happens when 2K says, \"Well, we don't want you to do that \"because we own the rights 2K,\" so you get into to rights usage. Now I believe that F1 is fully licensed through, the game is fully licensed. - For that specifically all of the drivers are playing on the official F1 game and it is an official F1 Virtual Grand Prix. It's a actually a similar thing, although not quite as sort of harmonious when you look at like NASCAR. So you look at something like iRacing, which is very much the sort of dominant simulation sort of tool that NASCAR drivers have used for a long time. A lot of the NASCAR drivers were driving and they were actually being commentated on by the legitimate NASCAR commentators, and it was very much like a real race. Obviously these things are always a little bit different, but yeah, it's been interesting to see. I do think eSports while certainly has more growing pains. I mean, if you've watched any of these sort of events, you've seen that, it's maybe not the highest production value in the world, certainly nothing like these sort of sporting events that have been meticulously planned and honed and sort of the productions have gotten so good that we don't even think twice about it. Or in fact, if you see one small problem on Monday Night Football, you're like, \"Oh my God, I can't believe it,\" when you think about just how incredibly complex these things are. - I think the next couple months will really play a big factor into that. Live sports are starting to come back. Just recently we had a football game. - Oh, look at Matt. Well said sir, well said. - I believe that was played in what? A completely empty stadium? If we start seeing that more, do we still get this traction with eSports on ESPN? Because, what's amazing in a really cool way is that we're talking about ESPN and Twitch as equal rivals right now. Five years ago (chuckles) someone would be like, \"What are you, crazy?\" If we start getting live sports, have we established enough of that eSports seed for it to continue to grow? Or does it kind of get brushed aside when live sports comes back? - I don't think it's gonna be that cut and dry because yes, live sports are slowly coming back, but sure, yeah. So pretty much every sporting event in the entire world as they're coming back or playing or racing or whatever the case is with no fans, obviously that makes sense. I think people would much rather see something versus nothing at all. But I think on the other aspect of things, these sort of comebacks are going to be slow. And ultimately, I think one of the biggest issues longterm for eSports is the fact that these new games come out so frequently. It's difficult to imagine when you look at something like Overwatch, right? Overwatch has been a real leader the last few years in trying to establish more of a professional league straight out of something like the NBA or the NFL or football or whatever the case is. But I think one of the issues is that you still need that longevity. I think that's probably the bigger issue longterm with eSports. Is finding these games that really have the staying power, not for just a few years, but for a decade or more. But I think what makes this even better now is the fact that because these huge games like Valorant really are taking advantage of Twitch to launch in a way that we've never seen before, right? I mean the drop system for Valorant was insane, - But it was really genius of them to say, \"Okay, well, in order to get a beta key for this,\" remember Valorant is at the time of recording, this is not even out yet. \"The only way to get a beta key is \"to watch the Twitch streams,\" and so it was a really ingenious way to do this. - Yeah, I know, absolutely man I feel like it's a very interesting time for eSports in streaming in general, because really you gotta look at the positive in life, right? If everyone has more free time to try a new thing, that's great, right? Develop that new streaming skill, get better at FIFA or Overwatch, or whatever game it is that you want. And spend more time interacting with people who you may have seen on those glossy, well produced NASCAR interviews like Ricky Bobby. But then on the flip side, you actually get that more raw, realistic sort of interaction with people who on some sides disappoint you and get fired from their jobs, but also might give you a better appreciation for the people who are really these well-rounded talented individuals who are not only good at their sport, but good as a human being as well, and that's always a good thing. - Thank you so much for watching this episode of This Is. Let us know what you think, is it really eSports time to shine? What's your favorite eSport? Tell us whatever you want, I don't care. Just tell us in the comment. - And of course, make sure to check out the wonderful LG UltraGear in the description of this video. Thanks LG for sponsoring our ramblings about eSports. (upbeat music)",
    "transcript_keywords": [
        "eSports",
        "sort",
        "thing",
        "Sports",
        "events",
        "game",
        "time",
        "ESPN",
        "things",
        "lot",
        "huge",
        "people",
        "NASCAR",
        "eSport",
        "world",
        "games",
        "Austin",
        "years",
        "tournament",
        "real"
    ],
    "transcript_entity_values": [
        "Twitch",
        "StarCraft 1",
        "iRacing",
        "hours",
        "Korea",
        "Audi",
        "the last few months",
        "F1",
        "100,000",
        "ESPN",
        "one",
        "these tournaments day",
        "a couple months ago",
        "Valorant",
        "three",
        "G-Sync",
        "the age of 18",
        "Twitch",
        "LG",
        "today",
        "IPS",
        "a couple of years",
        "the last few years",
        "F1 Virtual Grand Prix",
        "eSport",
        "F1",
        "NBA",
        "almost 20 years",
        "2",
        "all day long",
        "a decade",
        "Valorant",
        "60",
        "Ninja",
        "Matt",
        "months",
        "eSport",
        "Fortnite",
        "Hertz",
        "100%",
        "Overwatch",
        "Dota 2",
        "Austin",
        "1080P",
        "Dota",
        "Wimbledon",
        "Five years ago",
        "Ricky Bobby",
        "League of Legends",
        "March",
        "StarCraft",
        "NFL",
        "20 years",
        "MBA",
        "this year",
        "27GN750",
        "the next couple months",
        "NASCAR",
        "the League of Legends",
        "240",
        "decades",
        "StarCraft 2",
        "Monday Night Football",
        "eSports",
        "only now after",
        "LG UltraGear",
        "Sky Sports",
        "a ton",
        "FIFA",
        "just a few years"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PRODUCT",
        "ORG",
        "TIME",
        "GPE",
        "ORG",
        "DATE",
        "PERSON",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "DATE",
        "PERSON",
        "GPE",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE"
    ]
}