{
    "id": "Q1itPkQZ7LM",
    "title": "Lenovo Smart Clock Review: Your Voice Is The Snooze Button",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-06-03T14:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=Q1itPkQZ7LM",
    "category": "Science & Technology",
    "tags": [
        "lenovo smart clock review",
        "lenovo smart display review",
        "google smart clock",
        "android clock",
        "google home clock",
        "google clock",
        "home tech",
        "google assistant alarm clock",
        "mrmobile",
        "michael fisher",
        "android central",
        "modern dad"
    ],
    "views": 281685,
    "likes": 7083,
    "comments_count": 453,
    "description": "Typical alarm clock from Walmart: about $12.   Lenovo Smart Clock with Google Assistant: $79.   Being able to shout \"STOP!\" at your alarm clock at 7am to snooze it: priceless.   The Lenovo Smart Clock is like a Google Home Mini, mashed together with a smartphone screen from 2010, inside a box covered in carpet. It does almost everything a Google Home Mini can do, but falls well short of the functionality of something like a Nest Home Hub  and that shortfall is intentional. Find out who this thing is for (and see what it's like to make a phone call from an alarm clock) in MrMobile's Lenovo Smart Clock Review!    [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S LENOVO SMART CLOCK REVIEW]  MrMobile's Lenovo Smart Clock Review video was produced following seven days with a Lenovo Smart Clock review device provided by Lenovo. Preproduction device running pre-release software. The review sample is Lenovo property provided on a loan basis. No production compensation was requested or received, and no copy approval was granted.   [LINKS]  Lenovo Smart Clock [Lenovo]:   Lenovo Smart Clock [B&H]:   Lenovo Smart Clock Review [Modern Dad]:  Lenovo Smart Clock Hands-On [Android Central]:    [MUSIC]  Days and Days by Eternity Bro, available at Premium Beat:   Tangerine Daydream by GG Riggs, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #lenovosmartclock #smartclock #googlesmartclock #androidclock #smarthome #tech #hometech",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/51o",
        "http://mrmobile.tech/51n",
        "https://www.youtube.com/watch?v=BxwSMiMUrNs",
        "https://www.premiumbeat.com/royalty_free_music/songs/days-and-days",
        "https://www.premiumbeat.com/royalty-free-tracks/tangerine-daydream",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Narrator] Right now you could go to a Target or Wal-Mart and buy an alarm clock for less money than it takes to go to the movies. So why would anybody drop $80 on this one from Lenovo? Well for one thing, because snoozing a smart clock is as easy as talking to it. - Hey Google, five more minutes. - [Smart Clock] Okay, be back in five minutes. (upbeat music) - [Narrator] Okay, there's a lot more to the Lenovo smart clock than that. It's basically a Google Home mini stuffed into a fabric coated casing with a display on the front. It's not as big as it looks on video. It's nowhere near the size of the Lenovo Smart Display I reviewed last year. And at only four inches across, the screen is smaller than most smartphones. But that means it doesn't take up to much space on the bedside table I totally didn't buy just for the purposes of making this video. And despite that small size, that three watt speaker packs a wallop. - [Michael] Set volume to maximum. (\"Mr. Tillman\" by John Misty) Jesus. (\"Mr. Tillman\" by John Misty) - [Narrator] This music is coming through Spotify, which works just like it does on any Google Home product. And you can use these two front facing microphones to ask anything you'd ask another Google Home. - What's the forecast? - [Smart Clock] In Somerville today, it'll be partly cloudy, with a forecasted high of 72 and a low of 53. - [Narrator] If it creeps you out to have a microphone right next to your pillow, well first of all, you might wanna stop falling asleep right next to your smartphone, like 60% of us do. If you can't part with your pre-sleep phone scroll, though, a USB port on the back of the smart clock ensures you can still charge your phone, even though the clock uses up a power outlet of its own. And next to that USB port is the solution to your other privacy problem, a mute switch to turn off the mic. - [Smart Clock] The mic is muted. - [Narrator] Now keep I mind that muting the mic means you won't be able to use what I think is the coolest feature, silencing or snoozing the alarm just by talking to it. - Stop. - [Narrator] If you don't trust your sleepy morning self with that much power, you can also leave it muted and tap the top of the casing if you need a snooze. And that duality sort of pervades the interface. You can do most anything on the smart clock through taps or voice input, from brightening the screen to adjusting the volume to checking your calendar. And those microphones work really well, by the way. I only had one or two failed commands over a whole week with the device. It even listens well while it's playing music. - [Michael] Set volume to five. (upbeat music) - [Narrator] I should mention here that I'm not the best to showcase everything a Google Home can do, because I just don't have a lot of smart home stuff. So if you wanna see how the smart clock can control the nest video doorbell for example, check out Modern Dad's video linked below. Oh, and speaking of video, there's no camera on this device, but you can, indeed, make good old fashioned phone calls. - [Michael] Interesting, I did not know that I could call you from my alarm clock, but here we are. (laughing) I know. - [Woman] It's a little, it's fuzzy and such but I can understand you. - [Michael] Well, that's better than the $12 Target alarm clock can do, I guess. - [Narrator] Voice calls through your alarm clock. 2019 is pretty weird. Okay, let's talk shortcomings. While the speaker is loud, it doesn't have a ton of bass. Visually, you're confined to only as many clock faces as Lenovo provides. And while you can ask it to show you pictures from your Google Photos gallery, you can't currently use those photos as a clock face. Also you can't use the clock to play videos. And you really wouldn't want to because from its high reflectivity to it's low resolution, this LCD just isn't that great. On the bright side, or the bright and then dim side, it does automatically dim when you turn the lights out. And it can be set to brighten gradually in the morning to simulate a sunrise. Although for the record, I was never able to figure out how to make my review unit do that. (upbeat music) So, should you buy one? Well, first of all, I'll say that this is probably a lot better as a gift. I mean I'd be much happier to receive one that to spend money on it. So set a reminder for stocking stuffers around the holidays. But there is one target customer who makes a lot of sense for this, and that's the person who's already got one Google Home in one room of their house and is considering another. If you don't have a smart speaker in your bedroom yet, and you don't need a big display for video, this costs the same amount of money as the recently discounted Google Home. It sounds almost as good and it pulls double duty as the world's smartest alarm clock. - [Smart Alarm] Your alarm is set for tomorrow at 8:00 a.m. Goodnight, Michael. - [Narrator] Bizarre and superfluous? Totally. But pretty cool all the same. Oh yes, yes indeed. If you're more of the Alexa persuasion, be on the look out for the Amazon Echo Show 5 coming this summer. It'll retail for $90 and it'll pack video calling, too. If you'd like to see a Mr. Mobile review of that one, let me know in the comments. (upbeat music) Disclosure, this review was produced using a smart clock review sample provided by Lenovo. No compensation changed hands, and I gave Lenovo no copy approval. That means you're seeing it at the same time they are. If you like reviews like this, please subscribe to the Mr. Mobile on YouTube and don't forget to check out Modern Dad's video as well. Until next time, thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "Google Home",
        "smart clock",
        "clock",
        "Google",
        "Home",
        "smart",
        "Lenovo smart clock",
        "Lenovo",
        "alarm clock",
        "Lenovo smart",
        "Lenovo Smart Display",
        "video",
        "Google Home mini",
        "Modern Dad video",
        "Google Home product",
        "alarm",
        "discounted Google Home",
        "smart home",
        "smart clock review",
        "Set"
    ],
    "transcript_entity_values": [
        "Lenovo",
        "a ton",
        "72",
        "Jesus",
        "Michael] Interesting",
        "Goodnight",
        "John Misty",
        "8:00 a.m.",
        "Spotify",
        "only four inches",
        "around the holidays",
        "Alexa",
        "60%",
        "tomorrow",
        "last year",
        "YouTube",
        "Google Home",
        "USB",
        "80",
        "Mobile",
        "Target",
        "today",
        "one",
        "first",
        "three watt",
        "53",
        "five",
        "Michael",
        "two",
        "a Google Home",
        "12",
        "the Amazon Echo Show 5",
        "five minutes",
        "Wal-Mart",
        "Somerville",
        "2019",
        "a whole week",
        "90",
        "five more minutes",
        "LCD",
        "Tillman",
        "Google Photos",
        "Michael] Set",
        "another Google Home"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERCENT",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "EVENT",
        "TIME",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "MONEY",
        "TIME",
        "ORG",
        "PERSON",
        "LOC",
        "PERSON",
        "ORG"
    ]
}