{
    "id": "q2xLYzg01qE",
    "title": "Why There's No Channel One in America",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-05-15T17:22:05Z",
    "video_url": "https://www.youtube.com/watch?v=q2xLYzg01qE",
    "category": "Science & Technology",
    "tags": [],
    "views": 374088,
    "likes": 17906,
    "comments_count": 1419,
    "description": "Sign up for Private Internet Access VPN at   What happened to channel one on your TV?  Leave a reply with your requests for future episodes, or tweet them here:   Buy a TV On Amazon (PAID LINK):   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/piatechquickie",
        "https://twitter.com/jmart604",
        "https://geni.us/S4AvK0m",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- If you've ever been flipping through channels out of boredom, so yeah, all of us, (laughs) just kidding, I don't have cable. At some point, you've probably noticed something curious. Where the heck is channel one? I mean, when you think about it, it's even weirder than how your computer likes to number drives starting with zero. At least it's not skipping any numbers, but your TV just acts like the number one doesn't exist. You're like, get your head outta the sand. Well, it turns out that a really long time ago, there was a channel one. Back in the 1940s when commercial television was just starting to become a thing, the FCC in the United States assigned certain frequencies to certain channels, with frequencies increasing as you went up the dial. Channel one was assigned to the space between 50 and 56 megahertz, so a little ways below today's FM radio stations, which start around 88 megahertz. There actually were several TV stations operating on channel one in the early and mid 1940s, including what is now WNBC, a major station out of New York City. And there's nothing inherently wrong with channel one's frequency range that would make it more susceptible to interference or some kind of technical problem. But after the end of World War II, the FCC had to deal with an issue that didn't just affect TV broadcasters. You see, demand for different slices of the broadcast spectrum boomed as during the war radio technology rapidly progressed. And now that the war was over, the FCC had to make both radio users and TV broadcasters happy. So the agency decided to cut down how many channels were given to TV broadcast. And remember, back then cable TV wasn't a thing yet. So if you were going to watch something, it was going to be over the air on a limited number of frequency bands. But even so, the FCC decided that the 18 channels allocated to television during the first half of the 1940s was too many, so they cut the number down to 13 in 1946. Channel one actually survived this purge, but the FCC needed a piece of spectrum to reserve for low-power community television, designed to cover smaller areas than the major stations. So channel one was bumped to an even lower frequency and was only allowed to be used for community TV. However, radio and TV were still actually sharing lots of frequencies, which caused interference issues. In fact, channel six was the only channel that wasn't shared. And to make matters worse, the FCC said that stations could be as close as 80 miles apart, exacerbating the interface problem. I could've told ya that would've been an issue. (laughs) So the FCC decided to give even more of the spectrum exclusively to radio, the medium of the future. And they decided to sacrifice channel one, especially as no low-power community TV stations were even built between 1946 and 1948 when channel one was axed. Although the FCC could have renumbered the channels and made the old channel two the new channel one, they simply decided not to bother. And channel one faded into the dustbin of history. Now, the convention of not having a channel one carried over into analog cable TV. And even today, after the digital transition, you don't usually see a whole lot of programming numbered as channel one, even though cable operators and digital TV stations have leeway in channel numbering and could've put more things on channel one if they wanted to. However, channel one is sometimes used as a channel where pay-TV subscribers can make on-demand selections or for local news networks run by the cable provider, such as what Spectrum customers get in New York. So hopefully this clears up any confusion. I think now I'm gonna try and find out why James Bond worked for MI6 instead of MI1. David? (crickets chirping) Speaking of that thing I just said, I'm gonna speak about our sponsor (laughs) Private Internet Access. PIA is a VPN that lets you mask your IP and encrypts your traffic to and from your devices. They're reliable too with over 3,200 servers in 45 countries. PIA has no bandwidth caps, but they do have configurable encryption and an Internet kill switch so you stay in control of your connection. When combined with private browsing, PIA can make websites think you're in a different country. (laughs) Got 'em. You can try it now risk-free with their 30-day money-back guarantee and connect up to five devices at once with their clients on Windows, macOS, Android, iOS, and Linux. And you can forget about malware because their MACE feature blocks requests to known malware and tracking domains. So what are ya waiting for? Check it out at lmg.gg/piatechquickie today. All right, that's it for this video, guys. Thanks for watching. Hey, you wanna learn some more stuff about other things that are also interesting? Check out our other videos. And if you have something that you want us to talk about on Techquickie, leave a comment below. Maybe we'll do a video on it.",
    "transcript_keywords": [
        "channel",
        "FCC",
        "FCC decided",
        "channels",
        "stations",
        "radio",
        "decided",
        "make",
        "cable",
        "spectrum",
        "number",
        "PIA",
        "War",
        "thing",
        "United States assigned",
        "United States",
        "community",
        "frequencies",
        "frequency",
        "television"
    ],
    "transcript_entity_values": [
        "Techquickie",
        "New York",
        "Private Internet Access",
        "30-day",
        "around 88 megahertz",
        "IP",
        "Windows",
        "MACE",
        "World War II",
        "PIA",
        "the early and mid 1940s",
        "13",
        "18",
        "James Bond",
        "David",
        "Linux",
        "WNBC",
        "1946",
        "FCC",
        "two",
        "Channel one",
        "over 3,200",
        "up to five",
        "Android",
        "the 1940s",
        "45",
        "the United States",
        "New York City",
        "the first half of the 1940s",
        "six",
        "VPN",
        "between 50 and 56 megahertz",
        "today",
        "zero",
        "between 1946 and 1948"
    ],
    "transcript_entity_types": [
        "GPE",
        "GPE",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PERSON",
        "EVENT",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "GPE",
        "GPE",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE"
    ]
}