{
    "id": "Q49htudxPl4",
    "title": "Red Magic 6 Teardown! - I made a mistake....",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-07-08T13:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=Q49htudxPl4",
    "category": "Howto & Style",
    "tags": [
        "Red magic 6",
        "red magic 6 pro",
        "gaming phone",
        "smartphone",
        "android",
        "iphone",
        "best gaming phone",
        "nubia red magic 6",
        "rog phone 5",
        "red magic",
        "nubia",
        "unique phone",
        "cool phone",
        "phone with cooling fan",
        "teardown",
        "red magic 6 repair"
    ],
    "views": 776952,
    "likes": 39183,
    "comments_count": 1558,
    "description": "A Fan *INSIDE* a smartphone?! Join me on my Stage Channel on July 9th at 9pm MT to chat -  - Thanks to Discord for sponsoring todays video. Some phones have intersting things inside. This new Red Magic 6 Gaming phone from Nubia is one of those interesting phones. There is a spinning turbo fan inside that is used to cool the phone down in extreme gaming situations. Today we are going to see what that turbo fan looks like from the inside.   Get my razor knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://discord.gg/JFtYmhTceq",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Gaming phones are some of the most interesting and innovative phones on the market, especially when they have cool little gimmicks...like an internal cooling turbo fan. Today we'll be taking apart the Red Magic 6 to see how that fan works, and we'll do it with the phone turned on alive through the whole operation. Let's get started. [Intro] We know the fan sits on the left edge of the phone and blows air out through that side vent. But we do need physical access to it. Sometimes I speed up the glass removal part since it's a bit tedious. But today, since we're operating while the phone is still awake, I'll show you the whole process so you can hear if at any point the phone decides to kick the bucket, the fan will turn off as it blows it's last breath. Plus we can multitask with the perfect segue to our sponsor, Discord. Discord is releasing a new type of voice channel with real time audio-only conversations. It's called Stages. Groups of people like you and me can come hang out and chat together. Instead of just watching a video like we enjoy doing here on YouTube, we can actually interact with each other, asking questions and stuff in real time. I'll be hosting a live Discord Stage event on July 9th at 9:00PM mountain time. And if you want to come hang out, it's totally free to join. It only takes about 15 seconds to set up an account. We'll be talking about YouTube, electric cars, and maybe even a secret project I have planned for later this month. You know, normal stuff Q and A style. I think it will be fun. I'll leave an invite link in the description so you can add it to your calendar and I'll see you over there. And would you look at that, the glass is off. That was convenient. Plus everything is still alive. The fan's blowing more hot air than a politician in voting season. The fan looks to be pretty similar to last year's size-wise, except for the construction is totally different. The metal air chamber is still attached to the back glass plate, and you can see dollops of thermal paste that help the processors dissipate their heat into the metal chamber where that air flow is happening through it. The chamber helps keep the motherboard out of the air stream so it won't collect dust like a desktop computer does. Probably a good idea. I'll unplug the RGB's and we can get a closer look at this thin metal duct. The air flows into the phone frame, takes an abrupt 90 degree turn up towards the back glass into the vent, and then jets out the far side of the phone. The design has changed quite a bit over the years. Last year, with the Red Magic 5G, the cooling fan is generally in the same spot, but the duct work is larger and screwed down over the motherboard. The air is channeled between the metal duct and the glass. And the year before, the Red Magic 3 kept that same fan placement and size, but pulled the air in from the center of the panel, right below the camera module. Moving air does accomplish quite a lot when it comes to removing heat, especially while the phone is working hard. Now, this is where I realize that I've made a mistake. As you can hear the fan is still working, but I can't turn the phone off. Someone, I don't want to name names, sliced through the power cable during the back glass removal. So it looks like we'll have to pull the plug manually. And hopefully we'll find a way to turn the phone back on again after we're done because without a power button, that becomes extremely difficult. With the metal plate holding down the battery's ribbon is removed, I can unplug the dual battery connectors, along with the broken power button, side volume buttons, USB-C port and extension ribbon. There are 7 more screws holding down the top plastics. These are all different sizes. Then I can pop off the back panel which exposes the motherboard. Then I can remove 7 more screws surrounding the bottom plastics, which can also come off releasing the large copper sheet that covers the battery and the plugs. One more screw holds down the bottom board. And then I can unsnap the fingerprint reader, wire cable, and pull out the SIM card tray. The USB-C charging port is capable of charging at 66 watts. It's on it's own little ribbon and does have a rubber ring around the tip which will help with the water resistance with at least one point on the phone. The plastic loudspeaker also has some black water proofing mesh over the opening, which will help with water as well, but doesn't have any foam balls. Before we can get a good look at the fan, we need to remove the battery. Nubia fails in this aspect with how much glue they've added. It makes repair and recycling much more difficult, but with some isopropyl alcohol we can start dissolving the adhesive before prying it out from the frame. The battery has dual plugs and a 5,050 milliamp hour capacity. Finally, the motherboard. The Red Magic 6 has an 8 megapixel selfie camera...and a headphone jack. The headphone jack also has a clear rubber gasket around the opening to help seal the hole. Not too shabby on water resistance so far. The backside of the motherboard has 2 wire ribbons and a regular ribbon that can just unclip like a little Lego. Then we're free to scope out the triple camera setup. We have an 8 megapixel ultra wide camera up top, then a 65 megapixel camera in the middle, and a 2 megapixel macro camera down at the bottom none of which have OIS. I'll set this down gently. With the motherboard out of the way we see quite a bit of thermal paste, helping even more heat escape from underneath the screen side of the phone. And, of course, we still have our little fan friend who is very securely glued into the frame of the phone. Which makes sense. It's a moving part and needs to be secure. But that won't stop us from getting a better look. If there is water resistance, we're going to find it. The probably with making the fan water tight is that would mean that the air flow would also be severely restricted. The Legion Duel 2 gaming phone managed to make their phone with two internal cooling fans IP 58. But, it also snapped in half. So you win some, you lose some. The Red Magic 6's fan is shaped kind of like a turbo fan on a jet engine, which means it can move quite a lot of air in a very small space. But, judging by the lack of water proofing mesh, it's pretty safe to assume that this fan could also act as a boat propeller sucking water into the phone just like it would air. Which makes it kind of the opposite of water resistant, especially if the fan is turned on under water. Neither side of the duct has any protection. Nubia would have to find a way to seal the duct work to the fans in order to get the water protection that other flagships have. But, you know, water resistance isn't important to everybody. But something that is important to everyone is a working power button. I have severe doubts about this thing ever turning on again now that the power button is sliced. With the battery back in place and the top plastic screwed in, along with the bottom plastics and loudspeaker, we can give it a try....and nothing. Plugging in the phone will sometimes turn a phone on, but this Red Magic 6 just goes to a charging screen, which means it's kind of turned on, I guess. Not something people usually want to hear. I can try going to the boot menu and power things on. But even in here we need the power button to select reboot system now. Not very helpful. A sliced power button is rather inconvenient. We do have a rather long shot option though. The volume button ribbon and the power button ribbon have the same sized plugs, and a button is pretty much a button. So if I stretch the volume button ribbon over to the power button plug...gently of course, since the only thing worse than one torn ribbon is two torn ribbons. I can use one of the volume buttons as the power button. And very surprisingly, to me especially, it works. If anything deserves a thumbs up, it's that. And even after everything I've done to this phone, it's still alive and well, with the fan spinning up a storm. Nice work, Nubia. Good to know that if I ever need to turn on or off this phone in the future, I just need to completely disassemble it, swap the volume and power button ribbons and I'm good to go. Easy. The Red Magic 6 is very well constructed from both the inside as well as the outside. I'm curious, does your own phone ever get hot? Let me know down in the comments. Don't forget to come join the hangout on Discord. I'll leave that linked down in the description. And thanks a ton for watching, I'll see you around.",
    "transcript_keywords": [
        "Red Magic",
        "phone",
        "power button",
        "fan",
        "button",
        "air",
        "power",
        "water",
        "Red",
        "Magic",
        "button ribbon",
        "ribbon",
        "volume button ribbon",
        "power button ribbon",
        "water resistance",
        "Discord",
        "glass",
        "innovative phones",
        "cool little gimmicks",
        "back"
    ],
    "transcript_entity_values": [
        "8 megapixel",
        "65 megapixel",
        "58",
        "Red Magic 6",
        "later this month",
        "90 degree",
        "at least one",
        "the year before",
        "Lego",
        "July 9th",
        "two",
        "YouTube",
        "jack",
        "about 15 seconds",
        "RGB",
        "Discord",
        "half",
        "SIM",
        "Nubia",
        "66 watts",
        "last year's",
        "9:00PM",
        "Last year",
        "today",
        "Today",
        "One",
        "YouTube",
        "USB",
        "one",
        "5,050",
        "7",
        "Nubia",
        "the years",
        "2"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "FAC",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "TIME",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL"
    ]
}