{
    "id": "q4vayNhU5Vc",
    "title": "$370 vs $5000 Fortnite Laptop Challenge",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-05-19T16:13:08Z",
    "video_url": "https://www.youtube.com/watch?v=q4vayNhU5Vc",
    "category": "Science & Technology",
    "tags": [
        "fortnite",
        "fortnite battle royale",
        "battle royale",
        "laptop",
        "fortnite laptop",
        "fortnight",
        "fortnite notebook",
        "fortnite gaming laptop",
        "fortnite gaming pc",
        "fortnite setup",
        "gaming pc",
        "low end pc",
        "fortnite gameplay",
        "fortnite pc",
        "fortnite fps",
        "gaming laptop",
        "austin evans"
    ],
    "views": 3503953,
    "likes": 56929,
    "comments_count": 6456,
    "description": "Fortnite Battle Royale meets four gaming laptops from $370 to $5000! Can You Play Fortnite on a $200 Laptop?  Acer Aspire E15 on Amazon:  Acer Aspire 5 on Amazon:  Dell G3 Gaming Laptop:  $5000 Asus ROG G703 on Amazon:   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://www.youtube.com/watch?v=0Xi2rurVAvs",
        "http://austin.tech/aspiree152018",
        "http://austin.tech/aspire5",
        "http://austin.tech/dellg3",
        "http://austin.tech/asusg703",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "Hey guys this is Austin. Fortnite is the hottest game out right now and recently I did a video trying to run Fortnite on a $200 laptop. However, after that video I've had a ton of questions asking what is a good laptop to actually play Fortnite with? So here are going to be four of my favourite laptops at a wide range of budgets starting at 370 dollars This is the 2018 Acer Aspire E15 It's actually the follow-up to the most popular laptop on Amazon that I recently took a look at Essentially what you're getting here is not only an update to the eighth generation of core processors But also some key upgrades that are gonna help on the graphics side. Inside you're getting an Intel Core i3-8130U Now bumping up to the 8th generation of core processors means that while this is still going to be dual-core They've added turbo boost basically meaning that as opposed to your processor being limited like 2.5 gigahertz or so This guy will boost up to 3.4 gigahertz all day long. This guy's also rocking dual channel memory. Now That was an option on the previous model But you actually had to go and upgrade yourself whereas this has 6 gigabytes of DDR3 memory out of the box Now the idea that is DDR3 is a little bit of a disappointment But the important thing is is that because we have integrated graphics, Dual Channel Memory is going to make a big difference You need all the bandwidth you can give to that internal GPU We considered that you're spending less than 400 ollars the rest of the laptop actually isn't going to be too bad hardware wise. So you're going to be getting a 15.6 inch 1080p panel. It's not going to be super high res or super high quality But again, for the budget not complaining at all You're getting a good trackpad, getting a decent keyboard, and you're getting a wide selection of ports Including not only a USB C but Ethernet and USB A and well, ok I'm just saying all this because I really want to show you that this guy still has a DVD drive something that (uh) Pretty rare on laptops these days. So for 380 bucks got a little bit of everything So, of course, you should keep your expectations in check. With this laptop, We're going to need to turn the settings down Well, we're gonna turn them all down actually. So it's like fortnite we have all of our settings cranked down and we were running at 600p But the important thing to mention is that this is a $370 laptop there We are getting a pretty consistent 30 frames per second in. And- -No, it's not going to be the best way of playing the game at all but importantly we are actually able to play it with the idea that we are spending so Little and running on a laptop which is so cheap and yet we're still getting a playable for tonight experience is pretty impressive It does this a little something about how Epic was able to optimize the game To really get it to be playable on such a wide range of hardware now, of course There are some other things that you're going to notice when you're playing. The fans are actually not going to be too loud on this Laptop, but the screen's viewing angles are fairly narrow. So you do want to make sure that's pretty much going to be dead-on AKA I had to turn it to make sure it looks good on camera and not to my eyes But the important thing is look it's fortnite. We're playing it 34 frames per second However, say that your budget is a little bit higher than three hundred and seventy dollars Well, that's where this comes in. The Acer Aspire five, not to be confused with the Aspire E15 We're just taking a look at. Now If you guys have watched the channel for any length of time you'll know that I really Really like this laptop. Spending that extra money is going to get us a huge upgrade to pretty much all aspects of performance here So first of all, we're going to be going up from a core i3 to a core i5 on this laptop That means that we're going from dual core to quad core processor, which is a huge boon well Basically everything but especially when it comes to gaming four cores is going to be helpful The real secret sauce here though is the MX 150 NVIDIA GPU inside They're going from integrated to dedicated graphics, even in something that's going to be fairly modest like this is a huge difference when it comes to gaming on Fortnite as you'll see our settings are going to be much higher than 600p with everything turned down with 30 frames per second. At least I really hope so because I've played this before and it was much better I like how I'm suddenly doubting my own videos. Like wait, this is, this was faster, right? But what if it's not- -faster and I look dumb. The rest of the laptop is going to be pretty much the same as far as hardware goes There are some slight tweaks, but the keyboard the trackpad the screen are all going to be fairly similar but there are some other improvements on the internals here including we go from 6 to 8 gigabytes of RAM and Thankfully instead of having a slow mechanical hard drive This does come standard with a 256 gigabyte SSD. Back again to Fortnight, and this is a much, much better experience So not only were able to bump the resolution from 600 P to 1080 P But also importantly we were able to bump up the settings from very low and turning everything off to a pretty respectable Medium setting, and as you guys can see performance is not going to be bad We're averaging in the neighborhood of 40-45 frames per second here now Don't get me wrong. If all you have is 370 dollars You're going to be able to game on the other Acer, but for my money spending $200 more to go from barely being able to run the game on minimum settings, to something that's going to be downright Playable for pretty much anyone is kind of worth it as far as I'm concerned And of course this is going to apply to more than just playing fortnight So having a dedicated GPU as well as a quad-core CPU Means that this actually can do a bit of video editing maybe nothing too intense or a lot of 4k stuff but it is going to have the power and it's going to have the RAM to handle that and on top of that all of This stuff including the CPU and the GPU Is going to be very helpful when it comes to you know Other games that are not fortnite, as if anyone still plays those. I really hope you guys can tell how much of a better experience this is. It really is kind of hard to justify spending that much more money than $600 when you can get something this this playable. Now, yeah, we're going to be losing a few things So we're running in the mid 40s on the frame rate So if we did want to get that solid 1080p60 experience Especially with higher settings as you guys will see in a minute We do have to spend a bit more money But I think for the most part this is going to be totally playable and most importantly, you know we're not gonna die because it Decides to run it 10 frames per second in the middle of a battle which definitely doesn't happen to the other one at all imagine those that you have yourself a massive budget of $1,000 to spend on your gaming laptop or more specifically 950 dollars. With that you can get the brand-new Dell G3 gaming laptop. This is a really interesting mid-range option So on the inside you're getting some very high-end internals, but on the outside you're getting something that looks a little bit more budget So it's made out of plastic. It's got a 1080p display But don't let looks fool you. This guy has the absolute specs to handle games like fortnight and much more. Inside you're going to find a brand new intel core i7-8750H With a full 6 cores to work with, this is almost going to be overkill for current games, certainly for fortnite. so what that extra power is going to allow you to do is Fairly high-end video editing as well as stuff like streaming. Stuff like that is really going to be very taxing on the CPU So having a full 6 cores to work with is going to make multitasking and streaming super-easy Of course, you're also going to be able to play some pretty high-end games as well. Inside the G3 is rocking a GTX 1050 TI Now this is not going to be a crazy high end GPU But it's going to be very much in the mid-range and importantly, for what we're going to be doing, It's going to be plenty for that 1080p display, which I will mention is much nicer than the ones on the much cheaper Acer's It's still not going to blow you away. It doesn't have any like G-Sync or anything like high refresh rates But importantly the display is definitely not garbage town, which is always appreciated when you're spending almost a thousand dollars. Interestingly, Dell offers this in a fairly wide range of colors So in addition to the standard black, that you find on most gaming laptops, you can get it in this which is blue or you can get it in a white and blue which honestly Kind of feel like I should have went with instead But on top of that you're also going to be able to get blue on the inside. A nd what is really cool Is that even the backlighting on the keyboard is blue. It definitely stands out compared to pretty much any other black and red gaming laptop Out there. Don't expect any major surprises when it comes to the rest of the hardware It is made of plastic So it's not going to be the most solid feeling laptop on the world but there's nothing really that makes me worry. The keyboard is decent, the trackpad is actually surprisingly nice and importantly you are going to get the rest of the internals to back up that awesome processor and decent graphics card. 8 gigabytes of RAM which can easily be expanded up to 16 gigabytes, as well as a 128 gigabyte SSD that is backed up with a one terabyte hard drive. Jump into fortnight and here at 1080p on high settings The G3 actually does a pretty decent job. So right now we're averaging between 40 to 50 frames per second It's a little bit higher right now since I'm looking at rocks, but this is going to be a playable experience Now what you'll notice is that while this is definitely not the huge jump up that it was going from the integrated graphics to the MX 150 as someone's chasing me and about to shoot me um But this is going to be a noticeable difference and especially when you're playing other games That are, well, not fortnite, that extra GPU resource is going to be very helpful. No! They made me dance! No! No! No! Nooo! Performance though is actually really nice here. Now the difference between medium and high settings is actually fairly noticeable you kind of think about it is like going from PS4 to a PS4 Pro or something You're not getting that same resolution boost, but you are getting what's still a pretty smooth experience That is not really going to be held back too much by performance if high settings aren't good enough for you though May I interest you in this? The assuit are OGG 703 aka a $5,000 gaming laptop that will crush Everything so not only is this going to be one of the biggest and heaviest? Laptops that have ever taken a look at for the specs inside are going to be absolutely ridiculous inside The Asus is rocking the Core i9-8950HK. Not only is this going to be the first core? I never put into a laptop, but it is obscenely fast So while it's still going to be six core like the Core i7 model But it is going to clock way way higher. This one specifically has been overclocked to four point eight gigahertz. Keep mind I'm talking about a laptop here a six core 4.8 gigahertz laptop that my friends is Ridiculous overkill at its finest also inside this beast is a full GTX 1080 graphics card 64 gigabytes of RAM 3 SSDs and raid as well as well some future back problems if you want to carry this with you every day it is a Little bit large some would say a little bit ridiculous others would say kind of perfect I would say this my friends is the way that Fortnite was meant to be played so, of course we have full epic settings here because this is going to be a 17.3 inch 1080p panel we're going to be able to not only max out the resolution but also the framerate so this is a 144 Hertz g-sync panel, and we're actually being able to pretty much fully saturate right now I'm running between 130 and 140 frames per second on full max settings on my 5 custom helper laptop How I mention that this thing is ridiculous yet. So there's gonna be a couple major upgrades between $1000 laptop, which most people consider to be very high-end and something that's going to be this completely insane first of all, of course We're running on full epic settings and you actually do notice a difference in the graphical settings have definitely been turned up but almost more Important than that we get a much smoother experience all the other laptops have 60 Hertz panels and while they look nice running at something like a 120 130 frames per second is So so much smoother So what you're gonna find here is that knowledge is a response time going to be faster But just everything about it is just buttery smooth It's kind of hard to see the cross on a YouTube video where we're obviously not recording in such a high frame rate But in person it looks absolutely insane. You're such a contrast in the beginning this video. I was playing on a $370 laptop with integrated graphics running on minimum settings like 30 frames per second and now we're playing on one of the most expensive laptops in the world with the highest settings across the board on fortnight and Yeah, it's a slightly different experience. I got to say so there you have it the best laptops to play fortnight with in 2018 So of course, there's good budget options There's some really good options in the middle or if you want to be totally insane and show off to all your friends You can start saving $5,000 now",
    "transcript_keywords": [
        "laptop",
        "settings",
        "core",
        "Pretty",
        "Fortnite",
        "gaming laptop",
        "laptops",
        "frames",
        "bit",
        "GPU",
        "Inside",
        "Acer Aspire",
        "dual channel memory",
        "experience",
        "high",
        "high settings",
        "playing",
        "gaming",
        "graphics",
        "running"
    ],
    "transcript_entity_values": [
        "5",
        "370",
        "G3",
        "CPU Means",
        "first",
        "fortnight",
        "Dell G3",
        "four",
        "8 gigabytes",
        "one",
        "60",
        "YouTube",
        "Dell",
        "four point eight gigahertz",
        "Epic",
        "the mid 40s",
        "GPU",
        "34",
        "six",
        "600",
        "2018",
        "380 bucks",
        "Core",
        "USB",
        "Acer",
        "Austin",
        "17.3 inch",
        "intel",
        "almost a thousand dollars",
        "Hertz",
        "these days",
        "MX",
        "GTX",
        "15.6 inch",
        "one terabyte",
        "SSD",
        "4k",
        "Fortnite",
        "1,000",
        "DDR3",
        "tonight",
        "eighth",
        "2.5 gigahertz",
        "6 to 8 gigabytes",
        "600",
        "950 dollars",
        "1080",
        "G-Sync",
        "10",
        "Amazon",
        "370 dollars",
        "between $1000",
        "Important",
        "64 gigabytes",
        "6 gigabytes",
        "200",
        "Fortnite",
        "CPU",
        "144",
        "40-45",
        "4.8 gigahertz",
        "up to 3.4 gigahertz",
        "1080p60",
        "128 gigabyte",
        "between 130 and 140",
        "5,000",
        "Asus",
        "Intel Core",
        "RAM",
        "less than 400",
        "30",
        "PS4",
        "120 130",
        "150",
        "second",
        "6",
        "8th",
        "all day long",
        "five",
        "between 40 to 50",
        "256 gigabyte",
        "NVIDIA",
        "16 gigabytes",
        "3"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "MONEY",
        "PRODUCT",
        "TIME",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "QUANTITY",
        "CARDINAL"
    ]
}