{
    "id": "q72dA533sCg",
    "title": "Ford's Coolest Electric Truck is from 1978!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-04-18T21:55:51Z",
    "video_url": "https://www.youtube.com/watch?v=q72dA533sCg",
    "category": "Science & Technology",
    "tags": [
        "electric truck",
        "F100",
        "Ford F100",
        "Ford F100 Eliminator",
        "MKBHD",
        "electrified",
        "electrified truck"
    ],
    "views": 1658712,
    "likes": 96727,
    "comments_count": 4250,
    "description": "Here's a concept: Old classic truck... Electrified!  MKBHD Merch:   Ford's official page:   Tech I'm using right now:   Intro Track: Jordyn Edmonds  Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://media.ford.com/content/fordmedia/fna/us/en/news/2021/11/02/all-electric-f-100-eluminator-concept.html",
        "https://www.amazon.com/shop/MKBHD",
        "http://smarturl.it/jordynedmonds",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - What's up? MKBHD here. And I today now have a new favorite two-door electric vehicle. And when I say that out loud, you probably picture one thing. This is very different. (upbeat music) So I've been talking about these electric vehicle prototypes for a bit. You know, how I've been saying they're easy to build. You can make one, 'cause it's true. We see car companies all the time just build one single car with a custom chassis on some electric motors and a battery, and boom, they parade that around. But the hard part is building and shipping them in mass. But all that being said, this is easily one of the coolest electric car builds I've ever seen. So it's made by Ford and this is actually a concept car so they don't even have plans to ship it. But after seeing all the reactions to this and driving it around for myself for a day, I think it would be amazing if they reconsidered it. But either way, let me show you around this thing. So, basically, what you're looking at right now is a 1978 Ford F-100 Eluminator but under the hood is the guts of a 2022 Ford Mustang Mach-E GT, that's the Performance Edition. It is a wild juxtaposition of brand-new 2022 things alongside the 40-year-old solid metal and glass things of this older truck. I swear, this was a Doug Miro video, there'd be endless quirks and features. But yeah, the final result here is an electric truck that not only looks like really nothing else on the road, but it actually drives basically the same as the Performance Edition Mach-E, which is one of the faster ones out there. 480 horsepower, over 600-pound feet of torque. Yes, you can brake hold launch. Yes, it does 0 to 60 in 3.5 seconds. And yeah, it does feel and look and sound ridiculous while doing it. (Man whooping) (wind whooshing) Now, I don't know about you, but I don't get a chance to look at trucks from 1978 very often, so sorry if this is super unsurprising. But pretty much everything about the outside of this truck is either in awesome shape or custom rebuilt as new. So it's got the style and the lines of the times. It's got the silver and copper paint colors. The old school wheels are also custom to match. They also happen to hide the bright red performance calipers of the Mach-E's brakes under there pretty well. Just poking around this thing, it's fun to see how much of the original body is left untouched. The six-foot bed is basically completely solid metal and the tailgate's super heavy to open and close 'cause there's no mechanical assistance like modern trucks. Even the doors, when you open them, I don't know, I just find it fascinating that you can just look at the mechanical method right in there for holding the door open at two different amounts. Probably the only way you would know that this is a restomod if you saw it on the street would be if maybe you noticed the camera cutouts. There is one in the back license plate here for the reverse camera and there's another one up at the front in the grille cutout up here, at which point you realize the whole grille is fake. It's just a black plastic in there like the rest of the Mustang Mach-Es. Well, either that or you happen to see it plugged in and charging because that's a giveaway. That flap at the front left bumper is, in fact, a normal CCS charging port. The inside though, okay, this is where it goes crazy. There is a healthy combination of old and new and even some new that's disguised as old to fit better with the general aesthetic. I think it's super cool. Now, obviously there's no hiding the dashboard. It's got the Mach-E's huge vertical touchscreen with the knob and everything, and there's also a display as the dash behind the steering wheel, so not the original dash. I think some people would've wanted the original dash, but there's so many new systems and things going on here like the fact that it's showing me 200 miles of range, for example, that I just don't know how they could convert all of that stuff. So all the software is in here; it's working. The backup and forward cameras are functional. They also brought in the headlight controls from the Mach-E but I did notice they're sideways, so maybe they didn't fit in the normal spot. And then the more you look around, the more you see parts cleverly disguised as old. The steering wheel, for example, it's new, but it says F-100 on it and it's got the brown color. And the seats are all new but with the tan color to match the rest of the interior, which is completely decidedly old school. So you get the plaid stitching at the bottom of the door, little metal pieces everywhere for adjusting the side view mirrors. The glove compartment is just a metal box, like nothing fancy at all. And the entire ceiling too is stitched with leather. And the sun visors are just like metal wires with leather pieces on them. There's also old school speakers behind the seats that are hooked up and seem to be playing great quality audio, which leads me to believe they're also new disguised as old. You better believe this car has manual rolling up windows. There's no way they could get rid of that. It's mandatory for a car of this style. So, yeah, a little bit of old and a little bit of new, and this is the combo you get. It's just so funny seeing this old whip rolling around through the windshield but you can still see the top half of a huge touchscreen that's only in new cars. It seems sacrilegious to have a center console with wireless chargers right next to manual roll up windows and door locks, but that's really what this is all about. It's adding the modern creature comforts to a comfortable, familiar old truck. So I did get to drive this thing around the studio a bit for a day before Ford went and took it away to the, I think they brought it straight to the New York Auto Show. But I really got three main questions from people that I showed this to. One, what's under the hood? Which is an interesting question. Two, how does it drive? And three, can I get one? All good questions. So, first of all, literally under the hood is Mustang Mach-E. So this is a custom chassis holding things together by a company called Roadster Shop. But, yeah, basically all the electronics and HVAC and wiring, things that are normally in the front of a Mach-E and hidden, they're all still here. Plus, basically that open bucket for storage where the front trunk is. So, yeah, this thing still has a real front trunk. This 1978 restomod Ford F-100 has a bigger front trunk than most other electric cars on the road right now. So, okay, how does it drive? This is a funny one. So it's quite a character, as you can imagine. Very livable and smooth and normal at low speeds, like around a neighborhood. This would actually be totally fun to drive. Maybe forgive me if this is sacrilegious, but I think I'd prefer to drive this over the '70s version because you've got the electric torque, it's smooth and silent, no gear shifting, you've got regenerative braking, one-pedal driving. It's great but it's also a massively wide metal truck that can lurch from 0 to 60 in 3.5 seconds. And if you really pin it and start playing with it, it has very impressive acceleration, but it's obviously not gonna handle great. You can feel the dipping and swaying of the chassis more than pretty much anything else capable of going this fast. I didn't have it long enough to see how well the range holds up, but, hey, if it's quoting me about 200 miles of range, that's not amazing but that's also not terrible considering this thing has the aerodynamics of a block of cheese. So after playing with it, like I said, people were like, \"Where can I actually get one of these?\" And like I said, it is a concept car so this isn't an actual version that you'll ever be able to buy. But Ford is selling a crate motor that you can actually use to convert other older cars to electric, so you don't have to build everything by hand like Zack is with his Hummer EV. And it's only $4,000. It's 3,900 bucks for that, which was lower than I expected it to be. So I think that's the big takeaway of this. This concept truck, which is so cool, is really just a proof of concept, and I think it's awesome. I wanna shout out Ford for making something so fun like this. Definitely tag or send someone this video who would want a retro modern truck like this. That's really what this is, the ultimate retro modern truck. Thanks for watching, subscribe for more. I'll see you guys in the next one. Peace! (upbeat music)",
    "transcript_keywords": [
        "Ford",
        "electric",
        "truck",
        "Ford Mustang MachE",
        "car",
        "MachE",
        "thing",
        "things",
        "electric car builds",
        "metal",
        "front",
        "Performance Edition MachE",
        "Mustang MachE",
        "Performance Edition",
        "drive",
        "basically",
        "yeah",
        "electric vehicle",
        "Ford Mustang",
        "modern truck"
    ],
    "transcript_entity_values": [
        "'70s",
        "Roadster Shop",
        "today",
        "200 miles",
        "three",
        "one",
        "Zack",
        "480",
        "One",
        "Doug Miro",
        "Two",
        "only $4,000",
        "3,900 bucks",
        "HVAC",
        "Ford",
        "Mustang Mach-E.",
        "Hummer EV",
        "0 to 60",
        "half",
        "first",
        "the New York Auto Show",
        "about 200 miles",
        "2022",
        "0",
        "CCS",
        "600-pound feet",
        "Mach",
        "Mustang Mach-E GT",
        "40-year-old",
        "a day",
        "six-foot",
        "This 1978",
        "Mustang",
        "3.5 seconds",
        "60",
        "1978",
        "F-100",
        "F-100 Eluminator",
        "two"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "NORP",
        "PRODUCT",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL"
    ]
}