{
    "id": "Q8xDN5myZlk",
    "title": "Xbox Wireless Headset: First Impressions",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-03-15T14:11:34Z",
    "video_url": "https://www.youtube.com/watch?v=Q8xDN5myZlk",
    "category": "Science & Technology",
    "tags": [
        "Xbox",
        "Gaming",
        "Xbox Series X",
        "Console",
        "Headset",
        "Headphones",
        "Microphone",
        "Activing Noise Cancelling",
        "ANC",
        "Comfortable",
        "Linus",
        "Unboxing",
        "Microsoft",
        "Affordable",
        "Wireless",
        "Multi Connection",
        "Bluetooth"
    ],
    "views": 903933,
    "likes": 32794,
    "comments_count": 2182,
    "description": "Get $25 off all pairs of footwear using offer code shortcircuit at   The Xbox Wireless Headset is just $100, and it's something that we needed to see what you get for that price point from Microsoft itself.  Grab the Xbox Wireless Headset at   Buy Xbox Series X Console  On Amazon (PAID LINK):    On BestBuy (PAID LINK):    Buy Xbox Controller On Amazon (PAID LINK):      On B&H (PAID LINK):  On BestBuy (PAID LINK):   Buy ASUS 4K Gaming Monitor On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):    On BestBuy (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.vessi.com/shortcircuit",
        "https://lmg.gg/eh3CH",
        "https://geni.us/sXYZX",
        "https://geni.us/mfBcO",
        "https://geni.us/K6RC",
        "https://geni.us/BO4xO",
        "https://geni.us/F0cke",
        "https://geni.us/hLNe8",
        "https://geni.us/lNtyCA",
        "https://geni.us/BgbLl",
        "https://geni.us/0JAaa",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- The subject of today's video is the X-Box wireless headset. Microsoft promises no less than exceptional sound with a light and flexible design that's perfect for gaming all day. That's right my friends, 15 hours of rated battery life with the added benefit of pairing directly to your Microsoft X-Box console. And that was an outer carton for press I think. This is the actual retail packaging, oopsie daisies. (Linus laughs) Let's see what's in here, shall we? Congratulations on being one of the first people to receive the all new group wireless headset which delivers best in class evil. (Linus chuckling) - [Man] What? - Despicable Me. - [Man] I know - [Linus] Comfortable and intuitive design. Really all three of these condense down to what I already said. It's lightweight. It's comfortable. It sounds good. And it's got great connectivity. So like many new wireless headsets and headphones, one of the features here is being able to seamlessly use the device as you switch between your other devices. So you're on your laptop for example or you're on your phone, you can just, (Linus snapping figures) switch right over. So it uses the built-in connectivity on your X-Box meaning you don't need a dongle or anything like that to get low latency, high fidelity audio. And then it uses Bluetooth to connect to other things. Now this is interesting, to keep my reaction authentic I haven't looked at any of the available materials for this before sitting down with it. And that is a very... That is a very funky bendy microphone. It's got two mics, one for your voice, that one's right there. And then one for noise cancellation. So, you know, if your little sister or whatever will hit this one first and then this mic will know, hey, that probably ain't relevant. And it'll just focus on your own voice. That's cool. We've got these dials on the ear cups. So this one right here is labeled game and peeps. So that would be your fellow gamers. So you can say, \"Hey, yeah. No, I want to hear more of the game right now,\" or \"No, I want more of my emphasis towards my chat.\" And then this one right over here is volume control, easy peasy. (clattering) In terms of included accessories, we've got a USB type C cable and not a whole lot else. There is a microphone mute that's down here on the bottom of the microphone boom arm, but you can also configure it through software to automatically mute. So we're going to take a little bit of a look at that. First of all, I want to know how lightweight and comfortable it is because as you guys know I am all about lightweight gaming peripherals, okay? I need the lightest gaming peripherals for my maximum enjoyment. (Linus laughing) That's our volume. Just turn the volume down so I don't get kind of startled here. (indistinct) The noise isolation is excellent. I can't hear a damn thing you just said. What was that? - [David] Oh, nothing. We weren't talking about you behind your back. - Oh, cool. Okay. - [Jono] We like you. So much. (David and Jono laughing) - That's... Oh, that's cool. It's kind of a pain in the butt to get it dialed in in the first place, but that is a cool feature. Once it stretches out, it doesn't move. So when it's on your head, it won't accidentally change. That's really neat. I like it. So see that? I can't pull it down. - [David] Yeah, that's pretty cool. - I think Microsoft has struck a really good balance here of ear cup pressure and headband pressure. And one of the big mistakes that even experienced headphone makers can make is not putting deep enough or strong enough padding on the headband. And you can see they've used, instead of like memory foam or something like that, which sounds really good on paper, they've used a really strongly rebounding foam. That's important because a memory foam if you're wearing it for four or five, six hours at a time is going to get too compressed and you'll start to feel the hard plastic or metal band that's underneath it. Whereas this does a pretty good job of having kind of a three point mounting system to your head with the ear cups and up here. It's also worth noting that in the ear cups they have gone with, see that? A slower rebounding, more of like a memory foam style. There's a great degree of variability in people's head shapes and ear position. So that's a reason that I am disappointed to see that there's only a small amount of play in the ear cups here. You see that? Nothing side to side. See, I'm just flexing the plastic and just a little bit up and down. Okay, back to this pair... Okay, I think we're just in pairing mode. So I guess that, we better grab the X-Box, hey? Big shout out to Vessi Footwear for sponsoring today's video. Vessi Footwear is known for being lightweight, comfortable, and most importantly, water resistant. The shoes are made with a material called dynamax which keeps your feet dynamic to the max. Sorry, excuse me. Cool in the summer and warm in the winter. Lots of us here at LMG wear them all the time and you can too. So keep your feet dry by using offer code, short circuit, to get $25 off at vessi.com/shortcircuit. (swooshing) Oh, dang it. We got to update the gold controller. One moment please. This will be my first time using it bare back. (chattering) I took it home, but I just, I couldn't do it. (Linus laughing) This thing is so baller. Anyone wanna buy it? The pairing button also acts as a power button so you can conserve battery. Nice. Show me the headset. There isn't like an update you need for the X-Box to like detect this thing. Is there? Yeah, nothing. Let's give it the old sheddy shut down, Mc'shut downerson. The headset powered off automatically when I shut off the console though. So that's cool. Again, more power saving features. Actually we can take this opportunity to talk about the looks. I think they are fine. (all laughing) No, honestly though, like they're pretty gamely looking, but not to the point where as an adult, you feel stupid wearing them, you know? I will say because the mic is so short, the mic indicator is not actually as useful as it is on some other mics like maybe your face shape will be slightly different. Your eyes are sort of more forward and you can actually see that. I can't see this. Like this is cut off by my cheekbones. So it serves no real purpose for me but your mileage may vary. Hey, update for the headset. There we go. So there's a Linus tech tip for you. Try turning it off and turn your back on again. I... (Linus laughing) Oh, Tempest engine. - [Man] Hardware accelerated. - Oh, well let's help that game developers use it. - [Man] They do. - Well, good for them. - [Man] Yeah. - The dual sense, I, look I'm not arguing with you about the dual sense. We have never argued... I've got a golden control. (background laughs) Hey, I got sound now. (background cheering) EQ, so we're doing a way with that. Let's go custom and just leave it flat, bass boost though. You want that bass boost? - [David] Oh, yeah. - [Linus] Let's do it. - [David] I wanna hear bass from here. - [Linus] Auto mute. This is cool. So it silence is your mic when you're not speaking. So people can't hear your mom calling you for dinner or whatever the case may be. Let's throw it on medium for starters. Mic monitoring. Cool. So yeah, I was hearing myself through the headphones. I'm going to turn that off though. Now I'm hearing a little bit of scratchiness or interference sometimes in sort of sudden sounds. Like you know how when you first turn on a wireless accessory sometimes it can be a little like (Linus screeching) for a second and then it's fine? As I'm navigating around I am hearing a little bit of that but let's see what happens in game. (eerie music) Wow that bass boost though. This controller is terrible. (eerie music) Hey, by the way, does anyone want to buy it? (Linus laughing) It's really great. Okay, we need to lose the bass boost. That much is very clear to me. I think my audio snobbery is real, these... (eerie music) Okay, I got to remember how much they cost though. Can I just use them a little bit more? Spacial audio, very good. Like the bass is so loose. (Linus growling) Like it's just, somehow it manages to have overdone bass and yet I feel like I can't enjoy the engine rumble at all. Does that make sense? - [Man] Yeah. - It's a $100. Hold on. It's a $100. Here's the bottom line when it comes to sound, you are paying for convenience and features, one touch pairing, the automatic muting, support for, you know, Dolby Atmos. All of that is good stuff. And actually I'm a huge fan of the idea of being able to quickly switch between focusing more on the game or focusing more on chat 'cause it's the kind of thing that if your group is changing over to another game sometimes you'll have your end game music turned up or turned down and you'll need to fine tune that kind of thing. That is great. It's comfortable. It is lightweight. It definitely meets my expectations there. But if you're buying this for US $99 expecting that somehow your mind is going be blown because your audio file headphones that costs 250 or $300 sound flat compared to this, you are in for a disappointment. It is still a $99 headset. Microsoft's engineers are not magic. They cannot make a $99 headset sound like a $300 headphone. But if you're after it more for the features and if your point of comparison is other $99 headsets then I think you're in pretty good shape. One thing that could totally push me over the edge and to make me say, \"This, yeah, this thing is great,\" is if the microphone stands out. So I'm going to go ahead, I'm going to unpair it from the Xbox. I'm going to pair it to my laptop here and we're going to see what we think. Yeah, the effortless connection selling point is really not blending for me right now but hopefully that's just due to us being using pre-production firmware on it. But then we did just update it. Let's try disconnecting it from the Xbox for now then. Okay, for better or for worse, I now have it paired to my phone, but not my laptop. So this is what the microphone sounds like. I haven't heard it yet. Hopefully it's pretty good. Okay, I wanna hear this. (swooshing) Sounds, it sounds pretty damn good. If Microsoft's goal with this product is to deliver good enough sound quality while also improving the experience of everyone around you for anyone that buys the first party X-Box headset then I say, mission accomplished. Is it audio file grade? Absolutely not. But if that was what you expected then you just weren't being realistic quite frankly. It's definitely already a little kind of sweatier than I would prefer. I'd love to see Microsoft come out with like a mesh style ear cup. You can see that they have made it easily replaceable. So maybe that's something that we will see down the line but overall a 100 bucks, yeah. Any more than a 100 bucks, aah, it starts to get a little bit tougher unless the audio quality gets better. Hope you enjoyed the video guys. Subscribe to Short Circuit for more first impressions and unboxings like this one. And I will see you there.",
    "transcript_keywords": [
        "good",
        "yeah",
        "cool",
        "XBox",
        "headset",
        "Microsoft",
        "thing",
        "ear",
        "hey",
        "sound",
        "sounds",
        "ear cups",
        "bass",
        "game",
        "kind",
        "bit",
        "pretty",
        "audio",
        "Comfortable",
        "pretty good"
    ],
    "transcript_entity_values": [
        "Microsoft X-Box",
        "all day",
        "three",
        "One",
        "one",
        "LMG",
        "USB",
        "US",
        "six hours",
        "the summer",
        "Vessi Footwear",
        "25",
        "the X-Box",
        "15 hours",
        "second",
        "Linus] Auto",
        "David",
        "Microsoft",
        "Tempest",
        "Xbox",
        "Jono",
        "100",
        "100 bucks",
        "first",
        "99",
        "two",
        "four",
        "more than a 100 bucks",
        "Short Circuit",
        "300",
        "Linus",
        "250",
        "Dolby Atmos",
        "First",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "TIME",
        "DATE",
        "PERSON",
        "MONEY",
        "FAC",
        "TIME",
        "ORDINAL",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "ORG",
        "FAC",
        "PERSON",
        "MONEY",
        "MONEY",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE"
    ]
}