{
    "id": "q90v9FLXi1E",
    "title": "Google Pixel 7 event in 14 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-10-06T16:27:43Z",
    "video_url": "https://www.youtube.com/watch?v=q90v9FLXi1E",
    "category": "Science & Technology",
    "tags": [
        "pixel 7",
        "pixel 7 pro",
        "google pixel",
        "google pixel 7",
        "pixel watch",
        "google pixel watch",
        "google",
        "pixel",
        "made by google event",
        "made by google",
        "tensor",
        "google earbuds",
        "pixel earbuds",
        "pixel buds",
        "flagship phone",
        "best phone",
        "google io",
        "google i/o",
        "consumer tech",
        "google pixel 7 pro",
        "pixel 7 pro camera",
        "pixel 7 pro review",
        "pixel 7 pro unboxing",
        "google pixel 7 pro unboxing",
        "pixel 7 review",
        "pixel phone",
        "pixel 7 camera",
        "tech",
        "supercut"
    ],
    "views": 503976,
    "likes": 9078,
    "comments_count": 1066,
    "description": "Miss out on the Pixel event? Weve got you covered with the major highlights on all of the must-know announcements, including the Pixel Tablet, the price and release date for the Pixel 7 and 7 Pro, and the Pixel Watch.   0:00 Google Tensor G2 0:20 Pixel 7 0:59 Pixel 7 Pro 2:04 Voice Assistant Updates 3:25 Pixel 7 + 7 Pro Camera Features 9:36 Pixel Watch 11:51 Pixel Tablet  Read more:    Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/3MrkGxX",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- Hi everyone. Welcome to Made by Google 2022. Pixel isn't only a phone experience, it's a personal, intelligent, and cohesive computing experience. And we're excited to advance the Pixel computing experience this year with our new Google Tensor G2 mobile compute platform. - I'm excited to show you the new standard for smartphones, Pixel 7 and Pixel 7 Pro. Pixel 7 has a silky matte finish on the aluminum camera bar and housing, three color options. It features a sharp 6.3 inch display with smaller bezels and 25% higher peak brightness for incredible outdoor visibility during the day. Pixel 7 also includes a great all day battery with up to 72 hours between charges when you use Extreme Battery Saver mode. It sports a dual rear camera system as well as an upgraded ultra wide front facing camera with a larger sensor for better nighttime selfies and stunning 4K video. And we're taking the Pixel lineup to new heights with Pixel 7 Pro. You can see the premium polished aluminum finish on the camera bar and housing, which complements its three colors. Pixel 7 Pro has an upgraded super sharp 6.7 inch display. With its variable refresh rate, you get responsive gaming and smooth scrolling without killing your battery. Pixel 7 Pro has a triple rear camera system, featuring upgraded telephoto and ultra wide cameras. It's front facing ultra wide camera is great for low light selfies, videos, and more. And the front camera has another role to play. Pixel 7 and Pixel 7 Pro's front camera uses our advanced machine learn learning models for face recognition to power face unlock. So you have the faster, more secure under display fingerprint reader, and now you have the convenience of unlocking your phone with a glance. Our next generation chip includes a dedicated TPU so we can bring Google's state of the art AI and personal intelligence directly to the phone. So now machine learning runs up to 60% faster and up to 20% more efficiently on Pixel 7 and 7 Pro. Google's industry leading understanding of human language and speech powers our most helpful voice experience with new capabilities on Pixel 7 and 7 Pro thanks to Tensor G2. On Pixel 7, assistant voice typing will automatically suggest relevant emoji to insert, and it's much more forgiving now in case you don't know the exact name of the emoji you're looking for. Ever get an audio message when you're in a quiet place without headphones? It's frustrating, right? Well, Pixel 7 can now use Google's advanced speech recognition model to transcribe your audio messages right in the message app so you can quickly skim them. And if there are any reporters in the crowd, you'll be happy to hear that the recorder app on Pixel 7 is getting speaker labels later this year. On-device models will separate the speakers for you. Pixel devices are the only phones with Pixel Call Assist, a suite of features that helps with everything from making calls to avoiding them. With Pixel 7, the Direct My Call experience gets even easier. Instead of listening to a long recorded message describing each option, you'll see a list of menu options right away. You can tap the option you want even before it's spoken. Coming in a feature drop later this year, Clear Calling will make it even easier to hear the other person at the other end of the line. Just like the acclaimed background noise suppression on Pixel Buds Pro, Clear Calling uses machine learning to recognize, isolate, and eliminate distracting sounds like wind and traffic noise while enhancing your caller's voice. - With Pixel 7 and Google Tensor G2, we continue to lead in computational photography. So last year we introduced Real Tone. Over the past year we've added more than 10,000 images to the data sets used to tune Pixel's camera. We've also partnered with a community of BIPOC and non-Western photographers, editors, and visual producers from Diversify Photo to evaluate how we are delivering improvements to Real Tune. Finding that perfect angle for a selfie can be particularly challenging for blind and low vision users. Pixel 7 can solve that with our new guided frame. Here it is in action. - [Automated Voice] Move your phone slightly left and down. Move your phone slightly right and up. Ready for selfie. Three, two, one. Photo taken of face. - With Tensor G2's new (indistinct), night site is now twice as fast, reducing unwanted motion blur and producing beautiful low light images with the same amount of clarity. Of course, we all know blurriness doesn't happen just at night. Pixel 7 fixes that by automatically fusing images from the ultra wide and main cameras together to help ensure faces are clear. Tensor G2 goes even further, using a cutting edge machine learning approach to remove even more blur in even more photos so your images are incredibly sharp. Now most of us have a large collection of old photos, but you might have taken them on a phone or a camera that doesn't quite match the quality of a Pixel phone. Pixel 7 can help fix those photos for you with a brand new feature called Photo Unblur, which is only available with Google Photos on Pixel 7 and Pixel 7 Pro. Photo Unblur uses Tensor G2's machine learning capabilities to remove blur and visual noise from entire images. Pixel 7 brings big improvements to the video camera. We're introducing Cinematic Blur to the Pixel camera. With Tensor G2 Pixel 7 can generate very high quality depth information at low power and low latency. Tensor G2 powers lots of other video improvements too, like the new 10-bit HDR. With our highest quality video stabilization technology, Tensor G2 brings together hardware and software to help you get pro looking videos that capture the moment and not your movement. The auto focus is better too, so your subject stays in focus while on the move. Lastly, we are extending our speech enhancement and 4K 60 frames per second across all Pixel 7 cameras, so you can be heard clearly without the background noise and record the moment in brilliant high resolution. - With Google Tensor G2, Pixel 7 Pro pushes computational photography to new heights with Pixel's pro level zoom. It cleverly combines state-of-the-art hardware, software, and machine learning to create amazing zoom photos across any magnification. Our next generation Super Res Zoom allows us to roughly double the magnification of our optical lenses. So starting at 2X, Super Res Zoom crops Pixel 7 Pro's main 50 megapixel camera using a high resolution mode to provide a 12.5 megapixel image. To fix those smaller and noisier pixels it re-mosaics the image into a traditional Bayer format so our imaging pipeline can de-noise it through HDR+ bracketing, which aligns and merges a burst of frames. The result is a full 12.5 megapixel photo at 2X that looks stunning and similar to what you would get from a dedicated 2X telephoto camera. And because both phones share the same large main sensor, you can get this high quality 2X shot on both Pixel 7 Pro and Pixel 7. Keep zooming on your Pixel 7 Pro and Super Res Zoom takes a photo from both the telephoto and the main camera. Then a new ML model on Tensor G2 aligns and fuses these together to create a composite that's as sharp as possible. As you keep pinching to zoom, Pixel 7 Pro's upgraded 5X telephoto camera kicks in and Tensor G2 powers a new ML auto focus algorithm that ensures your photos are sharp and detailed. Pinch to zoom into 10X and Super Res Zoom performs the same process it does at 2X to create a full 12 megapixel photo that's similar to a dedicated 10X telephoto camera. At 15X zoom, even small movements translate into jarring changes in the view finder. Pixel 7 Pro Zoom Stabilization keeps your camera steady when zooming past 15X. It identifies the subject in the view finder, then stabilizes the camera on it, even if your hands are drifting or shaking. At 20X, Pro level zoom uses a new ML model on Tensor G2 that upscales your photos to provide even more resolution. Pixel 7 Pro's new ultra wide lens is 21% wider than Pixel 7's and it now has auto focus which powers our new Macro Focus. So now you can get vivid close ups of objects as close as three centimeters away with Pixel's signature HDR+ quality. - Pixel 7 and Pixel 7 Pro are the pinnacles of Pixel helpfulness, and we're making them available to even more users in more places. They're available for pre-order starting today and on shelf next week. We want people to give Pixel a try, so while phones in this tier typically start at $799, we're starting the price at just $599. The Pixel 7 Pro starts at $899, much lower than other flagship devices. - Hey everyone, we're so excited today to finally give you a complete look at our new flagship Google Pixel Watch. Pixel Watch features a beautiful, custom-developed 3D cover glass that's tough and scratch resistant. With Pixel Watch, you can simplify your life with the best of Google on your wrist. Adjust your thermostat from your watch with the Google Home app. Listen to your favorite artists with YouTube Music whether you're on a run, without your phone, or just running an errand. Set your favorite Google Photos images as a custom watch face. See quick notifications from Gmail and Calendar. Make checkout and transit a breeze with Google Wallet. Get turn by turn directions directly on your watch with Google Maps. And with Google Assistant, you can use your voice to do quick actions like sending messages, setting timers, controlling your music, and starting your run. Beyond Google integrations, Wear OS unlocks rich ecosystem of your favorite experiences from the Bitmoji watch face to apps like Line, Adidas Running, Strava, Calm, Spotify, and so many more. Pixel Watch is also the first Wear OS device with Fitbit. Pixel Watch uses a combination of on device machine learning and deep optimization down to the processor level to give you an accurate measurement of your heart rate continuously at once per second, whether you're working out or resting and all the times in between while maintaining an all day battery life up to 24 hours. With rich heart rate data, you can use your daily readiness score with Fitbit Premium to assess whether you're ready to work out or should prioritize recovery. And during your workout, Pixel Watch will track active zone minutes which helps you maximize the time you spend in your target heart rate zones. You'll be able to assess your heart rhythm for AFib with the ECG app and provide peace of mind for you and your loved ones with emergency SOS. And fall detection is coming in 2023. On top of all of that, we're bringing the sleep tracking experience you know and love from Fitbit to Pixel Watch. Google Pixel Watch starts at $349 and it's available for pre-order today and on shelves starting next week. - The Pixel family doesn't feel complete without a larger screen. Google Pixel Tablet. The foundation for the Pixel Tablet is Android including material you, so you can completely personalize it with custom color palettes, new color variants based on your wallpaper and lock screens. You saw the (indistinct) IO earlier this year, and since then we partnered closely with developers to make sure apps take advantage of large screen features like split screen and stylus support. This is also the first time we're bringing the power of Google Tensor G2 to an all new form factor. With Pixel Tablet, we're taking everything we've learned from years of making product for the home and for Pixel and combining it into one great device. By pairing it with a new charging speaker dock, tada! Let's take a moment. (crowd cheering) It keeps your devices charged and makes your tablet helpful 24/7 and it unlocks a whole new set of experiences in the home. My Pixel Tablet also gives me easy control of all my smart home devices. So I can turn the lights off in the house, set the thermostat to the perfect sleek temperature without ever getting out of bed. And my favorite Pixel Tablet feature is seeing my memories curated by Google Photos while it's docked. And of course, the dock itself serves as a charger, so your tablet's always ready for hours of entertainment. And we took special care to tune the magnets so it can easily dock or undock the Pixel Tablet, and we can't wait to share more when it's available next year. - The Pixel family is finally all coming together. I hope you love them as much as we do and thank you so much for watching today. (dramatic pop music)",
    "transcript_keywords": [
        "Pixel",
        "Google Pixel Watch",
        "Pixel Watch",
        "Pixel Tablet",
        "Pro",
        "Google Pixel",
        "Google",
        "Google Pixel Tablet",
        "Google Tensor",
        "Pixel Buds Pro",
        "Tensor",
        "Super Res Zoom",
        "camera",
        "Pixel pro level",
        "Watch",
        "Pixel pro",
        "Pixel camera",
        "Google Photos",
        "zoom",
        "Pixel Watch features"
    ],
    "transcript_entity_values": [
        "hours",
        "Pixel 7's",
        "Android",
        "up to 20%",
        "three",
        "the day",
        "Tensor G2",
        "Pixel 7 and",
        "Cinematic Blur",
        "12.5 megapixel",
        "SOS",
        "Google Pixel Watch",
        "Three",
        "ML",
        "Pixel Watch",
        "7",
        "Calendar",
        "2023",
        "12 megapixel",
        "Pixel 7 Pro and Pixel 7",
        "Google Maps",
        "Pixel 7 Pro",
        "Google Photos on Pixel 7 and Pixel 7 Pro",
        "50 megapixel",
        "799",
        "Real Tune",
        "Tensor G2",
        "The Pixel 7 Pro",
        "Google Tensor G2",
        "Pixel",
        "Google",
        "Google Wallet",
        "YouTube Music",
        "Gmail",
        "Wear OS",
        "daily",
        "349",
        "Tensor G2's",
        "25%",
        "this year",
        "IO",
        "first",
        "up to 72 hours",
        "Adidas Running",
        "2X",
        "earlier this year",
        "10",
        "Pixel Call Assist",
        "last year",
        "next year",
        "the Google Home",
        "Pixel Buds Pro, Clear Calling",
        "Macro Focus",
        "Pixel 7",
        "Strava",
        "BIPOC",
        "Pixel 7 Pro's",
        "21%",
        "three centimeters",
        "4",
        "Pixel Watch",
        "Google Photos",
        "Fitbit",
        "just $599",
        "second",
        "later this year",
        "up to 24 hours",
        "Tensor G2",
        "Bayer",
        "the Pixel Tablet",
        "Diversify Photo",
        "Super Res Zoom",
        "Pixel 7 and",
        "Pixel",
        "Fitbit Premium",
        "ECG",
        "Google Pixel Tablet",
        "today",
        "non-Western",
        "Spotify",
        "more than 10,000",
        "years",
        "My Pixel Tablet",
        "Line,",
        "Photo Unblur",
        "two",
        "the past year",
        "899",
        "Pixel Tablet",
        "up to 60%",
        "Bitmoji",
        "6.3 inch",
        "next week",
        "TPU",
        "minutes",
        "6.7 inch",
        "Pixel 7",
        "Google Photos"
    ],
    "transcript_entity_types": [
        "TIME",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "WORK_OF_ART",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "PERCENT",
        "DATE",
        "GPE",
        "ORDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "LAW",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORDINAL",
        "DATE",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "NORP",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PERSON",
        "PERCENT",
        "PERSON",
        "QUANTITY",
        "DATE",
        "ORG",
        "TIME",
        "QUANTITY",
        "EVENT",
        "LOC"
    ]
}