{
    "id": "QafmP9eVyVI",
    "title": "I Was EXPECTING More! - LG Gram 16\" 2-in1",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-12-17T20:37:20Z",
    "video_url": "https://www.youtube.com/watch?v=QafmP9eVyVI",
    "category": "Science & Technology",
    "tags": [],
    "views": 642029,
    "likes": 25155,
    "comments_count": 1454,
    "description": "With the holidays approaching, save time on your work to enjoy the holidays with tools like Grammarly! Sign up for a FREE account and get 20% off Grammarly Premium:    The LG Gram is an office favorite for laptops among the staff, but Anthony has a few different ideas with the 16\" 2-in-1 laptop. Let's find out what he thinks!  Buy LG Gram 2-in-1 WQXGA On Amazon:  On Best Buy:  On Newegg:   Buy iFixit Pro Tech Tool Kit On Amazon:  On Best Buy:  On Newegg:   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - Intro 0:26 - Specs 1:50 - Exterior Impressions 4:52 - Sponsor - Grammarly! 5:38 - Powering it up! 6:04 - Bloatware impressions 7:20 - Speaker impressions 8:05 - Weighing the laptop 8:32 - Stylus impressions 9:00 - Did we get the right laptop? 10:39 - The correct specs! 11:40 - Webcam impressions 12:09 - Tablet mode impressions 12:21 - Fingerprint magnet 12:39 - Laptop internal impressions 14:20 - Final thoughts",
    "description_links": [
        "https://grammarly.com/shortcircuit",
        "https://geni.us/GJ7f",
        "https://geni.us/m7BAk",
        "https://geni.us/bVGi0",
        "https://geni.us/d888Q",
        "https://geni.us/ZHTZa7",
        "https://geni.us/h42RUXH",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Bet you were expecting Alex for this one, huh? (quiet bright music) Well, not today, Alex is elsewhere. For now, you've got me and this here LG gram. I actually haven't used LGs grams yet. I used an LG laptop a while ago, it was like, really old, I'm talking like Pentium 4 era. It might've actually been a Pentium 4 or Pentium Mobile. So what have we got here. This is a Core i7-1165G7, okay. A 16-inch LCD, so this is comparable in size to the new MacBooks. 16 gigs of LPDDR4x, that sounds like if it's LPDDR4x, then chances are it's soldered, so. We'll see about that, I've got a iFixit kit down here, we'll open it up and take a look. Got a terabyte SSD, NVME. No wired LAN, I don't know why they even bother to list it. Wireless LAN, Intel Wi-Fi 6 AX201, seems pretty standard these days. Bluetooth 5.1, it's built in. fingerprint reader, yep, and Thunderbolt, cool. And hang on, (Linus shouting) is this the right laptop? 'Cause the laptop that I was told that I was going to be looking at runs Windows 11, but this is Windows 10. Okay, I guess we'll find out together. Ah, we've got a mystery on our hands. Let's get into it. Okay. That's nice. Yeah, that is pretty light, I'm not sure if I would call it a gram. In fact, I think it's more than a kilogram. All right. These dollops of glue or whatever that is. (imitating glue unsticking) The few grams I've seen so far, they've looked really plasticky and not premium, really, but this, this feels a lot nicer. I'm not sure that it's not still plastic, but it could be magnesium or something like that. I wish I had more information about it, but they gave me this like pre-brief guide. That was just like, \"hey, it runs Windows 11 and it's got a 16-inch screen and it weighs this much. Hey, here's some influencer talk.\" And I'm just like, okay, cool. I would've liked to have more information, but okay, here we are. I really like the 15.6-inch class of laptops, and the 16 inch is, well, it's that, but with less bezel, I'm not a huge fan of how cramped this numpad is, but I'm glad to have it, I guess. Where are the speakers? They're downward firing. We have a headphone jack, two USB Type-C ports. I'm not sure if, yeah, they're both Thunderbolt ports, they're both labeled Thunderbolt. That looks like, I'm not sure if that's a power LED or a charging LED, probably charging if I had to guess. On the right-hand side, we've got a Micro SD card slot, that looks like the power button, and a full-size Type-A port with a little trapdoor latch. This is something that I kind of felt like Apple dropped the ball on with their previous generation MacBooks. There's totally enough space here for a Type-A port, like full size, without this little trapdoor thing, little hinge, if they had just come flush with the side of the laptop, instead of beveling it up like that. (quiet upbeat music) I'm not sure how I feel about the blocky font they got going here. It's clear, it might be too clear. I'm not sure how to feel about it. Like shift and enter and backspace all looks good, but like this, I don't know. I'm not looking at my keyboard very often anyway I guess, so it doesn't matter that much. Feels like there's a lot of travel actually. Wait, there's a power button right here. What was that other button? It's got a dedicated sleep button, right! Because you can use it as a giant tablet. I can see using it like this with the stylus or something like that, or like this, with it kinda like that. I don't feel especially confident in this arrangement. There's no bumpers or rubber or anything there, so like if I didn't have this desk mat, okay, well it's a little more stable than I thought it would be, but it still kind of moves. Then again, I don't know, the hinge feels pretty solid, so maybe I'm just being a hater. Oh man, it's got a battery? It's an active stylus? Why couldn't they have just licensed the tech from Wacom? (Linus shouting) Hello? Two buttons, these can be mapped to pretty much whatever you might want, I'm sure. A lot of visitors, there's a lot of background shouting, there's me and I'm just rambling, 'cause like, I don't know, what am I doing here? And Linus is panicking over there, I don't know what's going on. I just work here. Anyway, shall we turn it on? First, I'm gonna turn you on to Grammarly. Thanks to Grammarly for sponsoring today's video. It's a busy time of year, so Grammarly is here to help you get your work done more efficiently. Grammarly is a digital writing assistant that helps you with grammar and spelling suggestions across a wide range of programs like Office, your web browser, and more. Simply install the new Grammarly desktop app, log in, and start typing. There's also Grammarly Premium, which provides more in-depth feedback like the vocabulary and clarity suggestion tools. They help you save time and make your writing more compelling by finding synonyms for overused words and completely removing unnecessary words. Work smarter, not harder this holiday season. If you're writing online, use Grammarly. Go to grammarly.com/shortcircuit to sign up for a free account and get 20% off Grammarly Premium today, to help you save time and work better. (quiet bright music) All right, let's power it up. The sleep and wake button doesn't seem to work for that task, so, boop! Think that power button doubles as the fingerprint reader, 'cause they don't see another place where it could be. Gram. Is this an, this is an LCD, yes. It is a very nice, high contrast LCD though. It looks like it's only 60 hertz. It is running Windows, wait, yeah, this is Windows 10. Am I looking at the right laptop? (laptop pinging) Shut up, you! Your PC comes with Alexa built in. (laughs) Oh no, I do not want A-L-E-X-A! Stay off my computer, Jeff. The heck is Virtoo? Link your smartphone to your PC. This is built into Windows! Why are we doing this? See, Alex doesn't talk about crapware and bloatware, I absolutely care about that stuff. You know, pre-installed crap, if it's actually crap that you're not gonna use, is how they're subsidizing the laptop, and this thing I don't think is a cheap laptop. Disney+ is installed for some reason, McAfee LiveSafe. Okay, cool, lower the charging capacity of the battery to 80% to expand battery life. Actually, probably something we should do. Instant booting, setup so the system will automatically boot up when you open up the notebook computer. Okay, so this is the thing that kind of caught me off guard with the Macs. Apple makes it so that you open the lid and the computer turns on even from complete off. This has that functionality as well, but you can turn it off if you don't like it. I feel like I'm being very negative about it, but like, I don't, generally speaking, like pre-installed software. I like a more vanilla experience, and it kind of does grate me a little bit that it's not something that Alex usually looks at. What Alex does look at are the speakers. And give you sticky keys. Anyway, \"Crab Rave,\" let's try it. (energetic electronic music) (music stops) Perfectly serviceable. (quiet bright music) Not the best I've heard, I don't think it's quite as good as the MacBook, I could go up and get one. Very good speakers, a good showing. I would say that maybe could use more bass, et cetera. Like, it's got enough chassis probably to include bigger resonance chambers, but at the same time, they are constrained by their self-imposed limit of however many grams this thing weighs, I think it's like 1350. What do we got here? This is pounds. 3.173, and with the pencil it's 3.211. And for everybody else, 1.439 kilograms, and with the pencil, 1.456. Is that what they claimed? Thought it was 1350 that they claimed. Maybe I actually do have the wrong laptop! Wait, yeah, supposedly less than three pounds, isn't it? Oh, I'm confused now. I'm confused now! Quickly, banana for scale. (exhales deeply) Familiarity. Pen input seems pretty responsive. Touching it like this, there's a little floating thing here and I can kinda outrun it, but that's just a function of it being 60 hertz. It's generally pretty, okay, nevermind, it's a little floaty. Okay, nevermind. Specs. So 17 inches, I don't, wait, 1350. Yeah, right, so how did this gain, like it gained 91 grams? This might not be the right laptop. I might've been reviewing the wrong laptop this whole time. Wouldn't that be hilarious? Oh yeah, that's totally a different model number. (laughs) We need to call Colton. (mysterious music) I've made an interesting discovery, a series of discoveries actually. Apparently this wasn't necessarily supposed to be the LG gram 17, it's just the LG gram 2-in-1 that we were kind of looking at, and it turns out that this is the 16-inch version. And in fact, the 16-inch version is 1,480 grams, so this is actually a little lighter. (quiet upbeat music) The reason for that actually is it's got an aluminum and magnesium alloy chassis. Cool, that's why I thought it was a little bit more premium-feeling than previous LG grams. Presumably the LG gram 17 is the plastic one. because that does only weigh 1350 grams. So, so this is the Influencer Brief and Content Guide. Okay, fair enough. So note that it says LG gram 2-in-1 16 up here, on this here image. About the product, 17-inch screen, 17 inch. Also it shows Windows 11, and there's an entire whole-ass slide here talking about the LG gram advantage, which is literally just Windows 11 talking points. I think LG got confused, in turn, we got confused. This is in fact the 16 and the 16 I shall review, or continue reviewing. Yeah. (music stops) Where do I pick up from here? (quiet bright music) The speakers were pretty good, screen looks pretty good to me. This is why I'm so negative right now, there's no specs! 16 inches, 2560x1600 IPS LCD with Corning Gorilla Glass 6. Great, cool, I love it. DCI-P3 99%, okay, typical minimum, 95, great. Where's the brightness? This is HDR, is it like, just HDR capable? Is it HDR ARE, HDR 400, HDR whatever, like? (groans) Why can't I have more information? LG, put this information on your website. I just saw that checkbox turned on and it's in fact not HDR capable, it just can stream HDR video for some reason. Normally that doesn't show up if there's no HDR capabilities. Oh no! Okay, let's try the stylus. Like, I mean, it's got this hover thing, which is great. Webcam, let's try the webcam. Seems reasonable. I think it's pretty obvious that it's like 720P. I see a little bit of fringing and fuzz in the darker spots. Whites are blown out. Again, it's perfectly fine, like if I tilt it down like this, oh, it gets even worse. There's so much noise. Also, it's like really cold over there, like that white is super blue and I'm just super orange. I can't really test the tablet mode and stuff. This is so impractical. Really what you'd want it for is for this, this kind of thing. Probably like closer to this for most people. Oh, look at all the fingerprints on this thing already. Like this was fresh out of the packaging and I've just been touching it. That's a problem. I think that's the magnesium, magnesium's pretty good at picking up fingerprints like that. How well does it wipe off? Oh, not easily. That's bad. Yeah, you're gonna clean this thing constantly, or wear gloves. (bright music) There we go. (exhales deeply) So that's a big battery. Oh, there's so much empty space in here! They could have put such big speakers in here. Look at all this empty, right next to the speakers even! There's just empty space. You could make big old cans here and they don't have to even weigh much, they're just need to be there to direct the sound. (sighs) At the very least., we've got a spare M.2, so it's not unexpected that people are going to get into this. What's the SSD? SK Hynix, well, it's an SK Hynix of some variety. Very OEM, one terabyte. Looks NVME to me. Oh yeah, this is an NVME-only slot, the other slot can take NVME or SATA. The RAM is soldered, and that sucks. But yeah, that's rather disappointing. I would have expected A, this to come off more easily, certainly not to have screws hidden underneath plastic plugs. And B, there to be more efficient use of the space, instead, it's mostly empty. I get that the idea of the gram is to be as lightweight as possible, but like, when you're making concessions like having these major chamfers here, it doesn't make a whole lot of sense given the internal volume that's going to waste here. Like this battery could be thinner and use up more area, that way the actual laptop could be thinner if you wanted that. Like, I don't know, I'm not an engineer, but it seems a lot like there's a lot of missed opportunities here. I don't know why I went into this so aggro. I don't know why I'm being so negative. I don't know. I just generally feel like at this point I was expecting more from the gram. Not everything has to be a MacBook, but this is like kind of MacBook price, I think this thing is like $2,200 or something like that. Let me get this thing back together, get it powered back on, and then we'll close it out. Yeah, it was the bloatware that really got to me, that's what really annoyed me I think, is the stuff that they had pre-installed on this thing and everything kind of went downhill from there. Like it felt good at first, except then you end up with these fingerprints all over it. It looked like it had pretty decent IO at first, except really you just get two USB Type-C/Thunderbolt ports and a Type-A, which depending on your point of view is better than what Apple does. I don't want to hate it as much as I do. I don't know why I hate it, other than that it came with a bunch of stuff. That's easily fixable, I could just reinstall Windows. But I feel like the out-of-the-box experience is something that many companies like LG, like Acer, like HP, like Dell, typically make a negative thing. I dunno, for a computer that I'm spending this much money for, I expect a certain level of respect as a user and I feel like LG kinda didn't do it. That being said, I mean, you've got a pretty decent pen, it's not bad. You've got the convertible aspect of it. You've got the quality materials that you need to make sure you keep clean at all times. The display is really nice. It's not super bright, it's not HDR like I thought it was. The speakers are pretty great. Fundamentally, it's a good laptop. Yeah, so here's this one for 1499 for the 512 gig SSD and a Core i5. So yeah, this thing is like 2200 bucks, something like that. If I were to go to apple.com, I know Apple's not everybody's cup of tea, but like Dell, even, a better laptop that's a little bit heavier, and that's just all there is to it. That's the LG gram's, that's its shtick. So you're paying for the lightness, which you're not even really getting in this 16-inch form factor anyway. So that's the LG gram. I know I'm being kind of down on it. I know Linus loves the gram series, I know a lot of people here love the gram series, and it's, again, fundamentally a good laptop, but I don't think the price is right and I don't think that it necessarily is the best user experience, especially when it comes to servicing. With that said, if you thought that this was a good user experience, maybe you can get subscribed and like this video, maybe check out some more videos similar to this one or not like this one. I do some retro stuff from time to time, and Alex does laptops and cars. Lots of stuff to choose from.",
    "transcript_keywords": [
        "gram",
        "laptop",
        "thing",
        "Windows",
        "pretty",
        "HDR",
        "Yeah",
        "kind",
        "Grammarly",
        "good",
        "grams",
        "Alex",
        "lot",
        "feel",
        "pretty good",
        "time",
        "speakers",
        "Grammarly Premium",
        "button",
        "good laptop"
    ],
    "transcript_entity_values": [
        "Alexa",
        "Webcam",
        "99%",
        "1350",
        "60 hertz",
        "Wacom",
        "4",
        "20%",
        "Alex",
        "17",
        "1.456",
        "Windows",
        "Colton",
        "Wireless LAN",
        "LAN",
        "1499",
        "Intel Wi-Fi 6 AX201",
        "IO",
        "720P.",
        "Windows 10",
        "LCD",
        "Pentium Mobile",
        "the 16 inch",
        "Linus",
        "95",
        "Content Guide",
        "MacBook",
        "2",
        "gram",
        "SK Hynix",
        "Dell",
        "today",
        "Micro SD",
        "HP",
        "this holiday season",
        "15.6-inch",
        "Influencer",
        "LPDDR4x",
        "only 60",
        "LPDDR4x",
        "Jeff",
        "LGs",
        "2560x1600 IPS LCD",
        "NVME",
        "first",
        "two",
        "1350 grams",
        "USB Type-C",
        "Windows 11",
        "1.439 kilograms",
        "MacBooks",
        "SSD",
        "Crab Rave",
        "Virtoo",
        "2,200",
        "Core",
        "Thunderbolt",
        "3.173",
        "RAM",
        "1,480 grams",
        "one",
        "1350",
        "iFixit",
        "Grammarly",
        "16 inches",
        "17 inch",
        "91 grams",
        "LG",
        "17 inches",
        "these days",
        "17-inch",
        "512",
        "McAfee LiveSafe",
        "First",
        "Apple",
        "Grammarly Premium",
        "80%",
        "Corning Gorilla Glass 6",
        "DCI",
        "Acer",
        "Macs",
        "16",
        "more than a kilogram",
        "less than three pounds",
        "Two",
        "3.211",
        "SATA",
        "16-inch"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "LOC",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "FAC",
        "CARDINAL",
        "EVENT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY"
    ]
}