{
    "id": "Qcl438V5tb8",
    "title": "My Portable Gaming Setup (2017)",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2017-09-19T16:53:50Z",
    "video_url": "https://www.youtube.com/watch?v=Qcl438V5tb8",
    "category": "Science & Technology",
    "tags": [
        "gaming",
        "gaming setup",
        "setup",
        "portable gaming",
        "gaming setup 2017",
        "gaming laptop",
        "backpack",
        "gaming pc",
        "acer",
        "acer predator",
        "austin evans"
    ],
    "views": 1528299,
    "likes": 25682,
    "comments_count": 1908,
    "description": "Acer Predator Helios 300 on Amazon:  Samsung T5 portable SSD on Amazon:  BenQ ZOWIE FK1 gaming mouse on Amazon:  Xbox One Design Lab game controller:  Status CB-1 headphones on Amazon:  Belkin surge protector on Amazon:   Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "http://amzn.to/2fyjbzI",
        "http://austin.tech/samsungt5",
        "http://austin.tech/fk1",
        "https://xboxdesignlab.xbox.com/en-us/customize?productid=900WZDF9XJVG",
        "http://austin.tech/statuscb1",
        "http://austin.tech/multitap",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin, and this is my portable gaming setup. So, it might not look like much from the outside, but inside this bag is everything I need to game on the go. First of all, I've got to give a big shout-out to Acer for sponsoring this video. The star of my portable setup is their Predator Helios 300 laptop. For just over a thousand dollars, what you're getting here is a pretty well-built laptop. So, yes, for some people, the gamer aesthetic might be a little bit strong. But, for me, I feel like it's fairly subtle, and you do have that nice brushed aluminum look. What really makes this guy special are the specs. So, inside it's rocking a Core i7-7700 HQ processor. GTX 1060 graphics, as well as 16 gigs of DDR4 memory, as well as a 256-gigabyte SSD. Take a look at the benchmarks and you'll see that that Core i7 is about as good as it gets as far as gaming laptops go right now. With the GTX 1060 inside, it is a big step up over the 1050 Ti, and especially the 1050. It's also pretty upgradeable. So, underneath a pair of doors on the bottom of the laptop, both of which only need a single screw to get into. Not only can you upgrade this guy to 32 gigabytes of memory, but there's also an entirely empty 2.5\" drive bay for adding a hard drive or another SSD. It's also rocking a 15.6-inch 1080p IPS panel. So, a lot of laptops, weirdly even gaming laptops, will skimp in the screen department, but this is a solid IPS panel. It's got good viewing angles, solid color, and 1080p is a good sweet spot for that GTX 1060 inside. It's also running a basically clean build of Windows 10, which is nice. So, if you want to get into the gaming side of things, there is the Xbox app, which gives you Game DVR as well as you can connect with people on Xbox One. And one of the only things that's actually pretty loaded is Acer's PredatorSense software, which is fairly basic but allows you to take a look at things like temperature as well as control fan profiles. With the Helios, we're able to play most games on high, if not ultra, settings at 1080p. So, Forza Horizon 3 is a good example of this. Now, I typically play it on the Xbox One, where it runs at a decent 30 frames per second on high settings. But, here, not only can we crank it up to ultra, but more importantly we have an unlocked frame rate, where we're getting anywhere between 60 to 80 frames per second. A game that I don't get to play near enough but really enjoy is StarCraft II. Now, it's something that's been out for a few years. It shouldn't be any big surprise that we're easily able to play on full ultra settings at 1080p. Next we have PlayerUnknown's Battlegrounds. So, PUBG is a game that's actually seen a fair bit of optimization lately, and it runs pretty well here. So, a 1080p with a mix of medium-high and a couple of ultra settings, we're actually able to get a pretty consistent 50 to 60 frames per second. Oh god, oh god. That was a bad idea. Running naked down the street: totally recommended. Never gonna go wrong. Now, to go along with the laptop, I actually do use a Samsung T5, which I keep in this little carrying case. So, this is where I keep my Steam library. So, because I go between different computers, both here at the office as well as my personal laptop, so, it's nice to be able to keep all of my games in one place. So, I don't have to download them again all over the place, keep them updated. And because this is natively USB-C, it will go right into the Predator's USB-C port, and give me an extra 500 gigs of storage for games. So when it comes to actually gaming, I don't use anything all that crazy. I use a pretty standard mousepad as well as the BenQ FK1 Mouse. Don't let looks fool you. Even though this is a very basic, plain-looking mouse, it actually performs really well. So, I'm not really a big fan of more flashy mice, with a ton of buttons and RGB. So, really this is all I need for a gaming setup, and it definitely doesn't hurt that it's only like 60 bucks. While the Predator keyboard paired with the BenQ Mouse is what I need for about 90% of my games, I actually do like to play some racing games like Forza, which is where the Xbox One controller comes in. So, this is one of their custom Design Lab controllers that I actually did a video on a few months ago. But, as far as the actual functionality, it's the exact same as any of the new Xbox One controllers that feature Bluetooth. So, some of the older ones, you either had to plug in via USB or use one of the wireless dongles. But, for this guy, all I need to do is pair it with the laptop and I'm up and running. For headphones, I'm still rocking these Status CB-1s. So this is actually my second pair. I actually sort of wore through the first. But, I really do love these. So, not only do they sound really nice, especially considering the 80-dollar price tag, but they're super comfortable for long gaming sessions. And on top of that, they do fold up so you can easily fit them in a bag. It might not be exciting but I also keep a 4-port tap on me. So, not only does this turn one outlet into four, but you also get three USB ports. Especially when you're traveling and you need to plug a couple laptops or tablets or phones in, this thing can be a life saver. Everything goes inside a Tumi T-Pass bag. Now, don't get me wrong, this is definitely on the pricey side. But, not only does it carry all of my accessories, as well as sometimes some video gear, but most importantly, the Helios 300. It might not be overkill but I'm pretty happy with how the setup turned out. So, as always, links to all this stuff will be in the description of this video, and let me know what you guys think about my setup in the comments below. Anyway, thank you guys so much for watching, and I will catch you on the next one.",
    "transcript_keywords": [
        "Xbox",
        "gaming",
        "laptop",
        "pretty",
        "Austin",
        "games",
        "inside",
        "laptops",
        "gaming laptops",
        "game",
        "play",
        "GTX",
        "setup",
        "Hey guys",
        "Helios",
        "good",
        "Predator",
        "settings",
        "big",
        "ultra"
    ],
    "transcript_entity_values": [
        "a few months ago",
        "Game DVR",
        "three",
        "PredatorSense",
        "PlayerUnknown",
        "USB-C",
        "first",
        "Core",
        "just over a thousand dollars",
        "32 gigabytes",
        "USB",
        "Acer",
        "Austin",
        "only like 60 bucks",
        "RGB",
        "IPS",
        "2.5",
        "Windows 10",
        "30",
        "Xbox One",
        "a few years",
        "BenQ",
        "Xbox",
        "Forza Horizon 3",
        "80-dollar",
        "four",
        "Predator Helios 300",
        "4",
        "300",
        "one",
        "1080p",
        "15.6-inch 1080p",
        "second",
        "Bluetooth",
        "256-gigabyte",
        "1060",
        "GTX",
        "16",
        "between 60 to 80",
        "PUBG",
        "50 to 60",
        "StarCraft II",
        "500",
        "a ton",
        "SSD",
        "about 90%",
        "Samsung T5",
        "Design Lab",
        "Forza",
        "Tumi T-Pass",
        "Helios",
        "the BenQ Mouse",
        "First",
        "Predator"
    ],
    "transcript_entity_types": [
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG"
    ]
}