{
    "id": "QDTic6qRtyk",
    "title": "The most popular foldable, for some reason - Samsung Galaxy Z Flip 4",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-09-09T18:15:09Z",
    "video_url": "https://www.youtube.com/watch?v=QDTic6qRtyk",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy"
    ],
    "views": 620266,
    "likes": 22389,
    "comments_count": 1983,
    "description": "Get a dbrand skin or case today at   Riley hasn't used a folding phone, so when we got Samsung's new Z Flip 4 he demanded he air his grievances on the next generation of phone form factors.   Buy Galaxy Z Flip 4:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Riley's flipping out 0:27 Unboxing 1:25 Design first impressions 3:04 Ports and buttons 4:04 Thoughts on folding compared to flipping 4:54 Sponsor - dbrand 6:25 Charging impressions + setup 7:47 Thoughts on the crease and colours 8:55 Front cover screen impressions 11:05 Speaker impressions 11:52 Specs 12:42 Cover camera selfie impressions 14:07 Main camera impressions 14:46 Using the camera folded 16:13 Update policy 16:36 Overall thoughts 16:51 Outro 17:00 Linus reacts to the Flip 4's skin",
    "description_links": [
        "https://dbrand.com/shortlinus",
        "https://lmg.gg/cRWOa",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "Aww mother flipping flip. We're gonna unbox a flipping phone today. I'm coming into this as a complete flipping newcomer. I've actually never used, I don't think I've ever used a Galaxy Fold either, like a Z Fold, like the big one. And I've never used one of these either. The smaller flippy boys. I did have a Motorola Razr, as you guys must have. But I also had the even more impressive Motorola Sliver. That one had iTunes. Enough about that. We're here to look at these Samsung Galaxy Z Flip 4. So I'm coming at it as a newcomer. I don't really get why you would want this but there are people who love it apparently. I think I heard that it's the most popular folding phone in the world. But we're gonna see. We're gonna take a look at this with a fresh pair of eyes. It's got an icon of a backpack and then warranty repeating over and over. - [David] Oh I see. - Well, I'll have to trust Dbrand, bro, that this skin protects the Flip from drops and scratches and such because I'm a bit of a dropper of phones and that's all I'm gonna say. (Laughing) Um, okay. In the case that's, what, is that all we have? There's definitely nothing else in here. Okay we do have some extra goodies. We got, okay. This is just a booklet telling you to do stuff. Very cool. The USBC to C charging cord. No charger in the box? You fools. And onto the phone itself. So this design is apparently very very similar to the Flip 3 that came out last year, but they've just kind of like done some refinements. I think that the bezels are a little bit smaller. The actual thickness is less thick. And I believe that the cameras protrude out a little less. But again, newcomer. I don't really have the context for this. So I'm gonna give you the straight up raw experience of someone who's never used a flip phone before. Here we go. Let's flip it. Before I even look at anything else. How does it feel? Just before we go any further, I don't understand what the point of this is. You have a phone that's nice and thin, it fits in your pocket. And then what are you gonna do with it? You're gonna double the thickness. - [Bell] It fits better. - It doesn't. Okay, look at that. I'm standing here. I don't even know that the phone's there to be honest. It's so thin. Now I'm gonna fold it in half. Oh, I got this big weight in my pocket. Look at this. You can see it. - [Bell] It weighs the same. - Yeah, but it's denser. It's dense. Now look, you can see it protruding. I don't want things to protrude at me. Now that we've established that, let's look at the exterior of the phone. You know what? This is funny. I've heard so much about the front glass and how far they've come. But like with the screen off, that crease in the middle is super noticeable. And like maybe I won't notice it as much when the phone is actually on, but anyways. We got the front of the phone with Samsung's their own folding glass situation. With a, I think it's got a screen protector on it, but they do have Gorilla Glass Victus plus on the back display here. On the right side we've got a power button that also looks like it's a fingerprint reader. Yep, that is a fingerprint reader on the side there next to the volume rocker. On the top we got microphone, I guess. On this side, SIM card tray that's not a dual SIM. A speaker's on the bottom. USB type C 2.0, which we spotted on the specs, which is interesting. I would expect that you should have like at least 3.0. Sometimes you have to make sacrifices to have a completely unnecessary feature that doesn't make any sense. I'm not a hater. This is the most popular folding phone in the world. How does that make sense? - [David] It's the cheapest they can afford. - Is it people buying it because they wanna put it in their purses? Moving on. We have, I guess two other mics at the bottom there and no headphone jack. Again, makes no sense. On the back we have two 12 megapixel cameras with dual pixel face detection auto focus. And on the front we have a 10 megapixel. So, interesting. This is what I don't get either. Okay. If I was gonna have a phone like this, I guess this is the trade off, because they wanna have a hinge that is strong enough that you can like put it there and put it at any angle. You know. There was another example in the in the product promo that they had like someone using this like a camcorder like this and they were like, yeah, oh we're in the '90s again. And that's dumb. To me, the coolest thing about my old Motorola Razr was the fact that I could kinda pick it up with one hand and just like (whooshing sound) flip it up. And this is like really annoying to me. Have it in my pocket. Okay. Oh I have a call or something. I take it out. I have to like fully do that. Or I have to use two hands I guess. Before we turn this thing on, Dbrand demands I tell you more about them. Bell, What do we, what's the big deal? What does Dbrand want? - [Bell] Everyone knows their skins are great. You know? We're gonna talk about something different though. - Okay. - [Bell] Check out these. We'll do a before and after. We're gonna do a review of them. - Height extending insoles? So you can join the six foot club? Sorry what? Dbrand is making these? Is this a joke? At Six Foot Club, we deliver unique quality products that will give you a boost in height, increasing your confidence and positively changing the world's perception. This is such a weird thing to We can't eliminate height bias, but we can help you capitalize on it. Now you too can enjoy the benefits of being taller. This is such a weird take. We can't stop ageism, but we can give you a mask so you look younger so people hire you. Time defying height boost. Air pocket compression, sizing for wide feet. - Oh you're so tall. - Now my shoes are too tight. - Wow. - Wow. That right there, that could be the change that you need in your life. - Because yeah, this is like where your eyes are. It's scary. You're a tall man. - I'm six, I'm six one. Dbrand doesn't only force us to have slightly awkward conversations about immutable characteristics. They also sell cool skins and cases and stuff. So go to dbrand.com/shortlinus (hand clapping) Get it? To see those. So we just charged this thing and it went from 0 to 61 percent in like 10 minutes or something. That seems crazy to me. Wait, has it not been set up? Okay. So we finished this setup process on the phone and there's a whole thing of like a whole list of warnings that you have to think about now cause you have a foldable phone. This stuff seems to be specific to the folding display. When you fold the phone, make sure there's nothing inside such as a card, keys, or coins. This phone isn't dust resistant. Exposure to small particles such as sand may cause damage. And this, like, this is still the thing with this form factor again. Like the benefit just seems so small compared to all the risks. All the extra stuff. Like you can see here. I just noticed this. I don't know how well you can see that but there's like this little exposed hinge and I feel it when I'm running my finger over there. And like, if I go fast that could take some skin off. It couldn't. But it feel, it doesn't feel comfortable. It feels like it's in the way. So this phone is water resistant, IP X 8. So immersion in any liquid, other than fresh water. - [David] What? - Oh, such as salt water or alcohol can damage your phone. You can immerse it in only water. (laughing) I guess it can handle water immersion, but there are little bits where dust can get in. All right. We're in. As I suspected, once the screen is on and you're looking at it kind of head on, you don't see the crease at all. Although as soon as you move it you kind of start to see ah, ah, there she is. Whoa. There it is. You can't hide from me. To me, phones are tools. Okay? I get a small phone because to me there's greater utility in being able to use it one handed. Some people want a big screen because that's more important to them than being comfortable. Like they're fine like shifting the phone around in their hand in order to get their thumb to certain places. And I'm not judging them for that. But I am saying they're wrong. I'm just gonna, how many asides have I stopped to do to talk about the stupid form factor? It's not stupid. It's fine. Hey if you care about that kind of stuff you're probably gonna care about the colors. And let me tell you this thing comes in Bora purple and pink gold and blue and graphite. There's more. There's a Bespoke edition for if you really wanna just impress people. Show off the gold frame, yellow front, white back. And there's other combinations as well. (laughing) Okay. One thing I am curious about is what this front screen can do. Because apparently they've made some improvements to the rear display here. So what can you do with it? That's my question. How do I, I thought you were able to like swipe through things on it. Oh, there we go. Oh, no play. Okay. So there's a music player. Alarms. I'm guessing you can't like set alarms from there but it'll tell you when you have an alarm. What's this? Audio recording? Open phone to continue. What's the point of that? (David laughing) Interesting. It has the buttons UI by default. I thought that the gesture UI is just like default across the board, but Samsung's holding on. Take it outta my pocket, do that. Oh, and then I can swipe right away if I press the power button. Okay. Uh oh. I'm in a dangerous situation. I better record audio. And then oh, delete. Recording discarded. That's okay. So that right there. That's a pretty cool use case for this tiny little screen. What else? A timer. That's great. A calendar. Very useful. You can unlock the phone while it's closed with your fingerprint. That's pretty cool. Oh nice. Okay. So I was wondering if you like cause it's annoying to have to swipe through all of those to get to the end and you can actually reorder them. So if I want like the calendar up at the top, then I'm gonna do that. Nice. All right. Let's play a music thing and see if that shows up on the front screen playing. Okay. We're playing music now, but you can't tell cause I turned the volume off. What does it show on the cover? There's a little music icon. So if I tap the little thing it shows up but if I lock, put in my pocket, bring it up. It should be the first thing. That should be intuitive. Right? These guys were asking, oh can you answer calls while it's unfolded? But at that point, I mean first of all, no probably not obviously like the earpiece and the mic are not right next to each other right now. So no, you probably have to unfold it. But at that point he's like, why are we asking about all these things that you can do with its when it's closed when you can just do that and take the call. There are just so many questions in the world. - [David] You're not a Smartwatch guy, are you? - The Flip 3 had a dual front facing speakers as far as I'm aware. This one does as well. I'm at 4k now. This is 120 Hertz display. Dynamic ammo led, whatever that means. 2640 by 1080, 22 by 9 aspect ratio. Just like the last one. So cinematic content is gonna be good. Now we have max. (upbeat music) Ah. (lively upbeat music) Pretty good. I refuse to do a more in depth speaker comparison for this phone because if you're really concerned about the speaker quality on a phone that you're, be honest, you're primarily getting so that you can use it as jewelry in your purse. Then you got your priorities messed up man. Back to the display. It's HDR 10 plus certified. And it's got 1200 nits peak brightness for HDR. You may have noticed me using the fingerprint sensor quite a bit here. And I have noticed that it is impressively fast. Okay. So I've ragged on this on this phone for some things so far but for the most part, the specs of it are actually really competitive with other flagship phones. I mean, it's got the Snapdragon 8 plus Gen 1 which is the new flagship, you know, top tier processor that you're gonna see in most flagship phones coming out. I think it's got 128 gigs of storage and 8 gigs at that 9 99 USD base tier. I mean that's pretty impressive. And as you saw, we got the fast charging which is really nice. Although maybe part of the reason that it was so good at the fast charging is because the battery is only 3700 million amp hours which is not horrible but it's kind of like mid, low mid. Oh, another thing that I forgot to mention when we were talking about the front screen here is the fact that if you have this front screen on a foldable phone, you want that to be able to take a selfie, right? This is a test. They better have camera shortcut mapped to double click on the power button. That should just be default. Disappointed. Oh, but it opened it inside. That's stupid. I'm so confused. We got the phone unlocked on the home screen. Okay. Close the phone. Double click. It goes to camera. Nevermind. I guess it does work. It didn't do it the first time because it was deeking me out. It was psyching me out. If you wanna get real dramatic with it. Hello. (laughing) Nice to see you. If I took a photo like this and sent it to you, would you even know I took it on a foldable phone that was folded in half? Tap to take photo. It looked like it was in portrait mode but it took a landscape photo. Oh right. Whoops. I have to do this. Double tap to show full preview. Oh there. - [David] Ah. - That's really dumb. Right? It's a 1.9 inch Super AMOLED. 512 by 260. I mean that looks remarkably sharp for like I mean it's a tiny screen. Tiny screen, what do you expect? Just use the main camera for this. Don't use the top. Selfie. (laughing) And you know, it's a Samsung camera. That's a little more washed out, like gray colors than I would expect. Let's say one on the regular. (camera clicking) One on the ultra wide. (camera clicking) That's really wide. I mean, you know, I'm not gonna go spend too long in the Samsung photo app here because like you know, they're kind of all the same. They have their cool extra Samsung features. Modes for your for your camera. Super slowmo, slow motion. It can do 4k at, 4k at 30 or 60 FBS and then various, you know, slow motion modes with your 1080 P and 720 P etcetera. As we said though, one of the cool things about having a phone with a flexy form factor is the fact that you can use these kind of different camera modes here. So I dunno if you can see. When it's flat, the viewfinder takes up that much of the screen but if you bend it, it shifts now so that the viewfinders up here and you got your controls down here. Instead of holding it, I could like put it down and now, you know, it's being used as a phone stand and I can take that photo. So there's one use. You can also switch which side the view finder is on by pressing this button. So now this will be maybe even better like this, you know what I mean? Hook this around a corner. (slurping) Oh yeah. That's what I like to see. - [David] Okay. - We saw this video and we decided to take that out. This says Samsung. Although I am kind of surprised that they put two 12 megapixel cameras on this when I believe that Samsung's S series phones have much higher megapixels. I think they have at least 50. I think they might have a 64 megapixel on one of those. - [David] That makes it way worse. - That makes this worse, yeah. - [David] No that makes the 50, more megapixels is stupid at that sensor size. - Oh. I know that like more mega pixels doesn't necessarily equate to better photos. I'm just saying that like, you know, that gives you greater flexibility. If you wanna like zoom all the way in on something or whatever, you know. Okay David? And if you're buying this one just for the camera, you're making a mistake once again. I'm talking about you. And because it's a Samsung phone, they changed their policy recently in terms of Android OS updates and security updates. So this one is going to get the four years of Android OS updates that other Samsung phones are getting as well as five years of security updates. But Samsung is leading the way in stupid form factors. Yes. So this was my experience of a foldable phone. I think that, you know, basically my preconceptions about the idea of a foldable phone were largely confirmed. I still don't understand the utility of having like a regular phone that folds in half. So subscribe to Tech Linked and to Short Circuit, I guess. Love you so much. Watch another video now. Bye. (laughing) - Hey Linus. - Hi. - Dbrand sent over a phone for you. - Ah, no warranty. Very funny. Oh, oh God. - Oh my God. - Yeah, I'm kidding. - Isn't it a nice skin though? - That's very charming. I wish it said trust me, bro. Can we get the trust me bro version?",
    "transcript_keywords": [
        "phone",
        "Aww mother flipping",
        "Samsung",
        "thing",
        "mother flipping flip",
        "screen",
        "foldable phone",
        "phones",
        "Dbrand",
        "flip",
        "flipping phone today",
        "camera",
        "Aww mother",
        "kind",
        "front screen",
        "Samsung phone",
        "mother flipping",
        "front",
        "things",
        "flipping phone"
    ],
    "transcript_entity_values": [
        "USBC",
        "at least 50",
        "half",
        "10 minutes",
        "David] Ah",
        "22",
        "a Z Fold",
        "Bespoke",
        "last year",
        "Hertz",
        "iTunes",
        "One",
        "8",
        "Audio",
        "4k",
        "USB",
        "USD",
        "Selfie",
        "one",
        "60",
        "720",
        "Flip",
        "Bell",
        "9",
        "260",
        "10 megapixel",
        "Gen 1",
        "FBS",
        "Tech Linked",
        "max",
        "David",
        "Samsung",
        "2640",
        "128",
        "Dbrand",
        "50",
        "first",
        "only 3700 million",
        "Gorilla Glass Victus",
        "at least 3.0",
        "two",
        "120",
        "Motorola Sliver",
        "the '90s",
        "1080",
        "Android",
        "five years",
        "1200",
        "a Motorola Razr",
        "0 to 61 percent",
        "30",
        "two 12 megapixel",
        "Motorola Razr",
        "C 2.0",
        "512",
        "Six Foot Club",
        "Short Circuit",
        "Linus",
        "Galaxy Fold",
        "the four years",
        "six",
        "Bora",
        "jack",
        "64 megapixel",
        "today",
        "1.9 inch",
        "UI"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "EVENT",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "GPE",
        "PERSON",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "ORG"
    ]
}