{
    "id": "qgK38sg1ws4",
    "title": "I’m NOT Supposed to Have This - Stadia Dev Kit",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-12-08T19:33:03Z",
    "video_url": "https://www.youtube.com/watch?v=qgK38sg1ws4",
    "category": "Science & Technology",
    "tags": [
        "Google",
        "Stadia",
        "Dev Kit",
        "Dev Node",
        "Server",
        "Cloud Gaming",
        "Gaming",
        "Game Development",
        "Google Graveyard",
        "Killed By Google",
        "Xbox",
        "Playstation"
    ],
    "views": 1786112,
    "likes": 66670,
    "comments_count": 2062,
    "description": "Visit  and use offer code LTT for 10% off  Signup for a Hetzner server and use code LTT22 to save $20 at:   A game developer for Google Stadia reached out and offered us a Stadia Dev Node! What secrets does it hold inside, how do you develop games for a dedicated cloud service, and what were they possible doing with this Radeon Pro V320 graphics card?  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:50 Game Dev 3:22 What's in the Box 5:35 How is it useful 7:00 The Portal 8:45 RIP Stadia 10:20 Business as Usual 12:20 Conclusion",
    "description_links": [
        "https://www.squarespace.com/LTT",
        "https://linustechtips.hetzner.com/en/cloud-usa-22",
        "https://linustechtips.com/topic/1472756-i%E2%80%99m-not-supposed-to-have-this/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- [Riley] Do you have any idea? - I know how to (beep) do this! This is my job! Do you have any idea- (production beeps) Do you have any idea how games were developed for Google Stadia? 'Cause I don't, but it has got to be totally different, and I bet it's fascinating. And if we don't learn about it now, we may never get the opportunity. The thing is for traditional consoles, there's always some development hardware and documentation that goes missing and finds its way onto eBay, even if it takes years. But this time, everything's in the cloud. So next month, when Google presses that button, it's gone. Or is it? See, the thing about rug-pulling an entire industry of passionate creatives is that someone is gonna end up salty enough to say, \"Screw it,\" to your NDA and talk to the press, and we found one such someone. (box thuds) It's real. We not only got our hands on extensive documentation and screen captures so that we can preserve this important little piece of gaming history, but we also got a Stadia Development Node, a piece of hardware designed to play Stadia cloud games, but from right in front of you. Time really is a flat circle, isn't it? I had no idea that these things even existed, but they do, and we're gonna be taking a close look. You know what else exists? This message from our sponsor. - Hetzner. Hetzner offers high-performance cloud service for a great price. They now cover the east and west coast of the United States with their latest location in Hillsboro, Oregon. Use the code LTT22 at the link below for $20 off. (upbeat music) - When you create a game, particularly AAA, assets are often version controlled by Perforce and stored on a local server as well as on your own workstation. As you develop, team members submit their changes to the server, and new builds get created for QA to test. These builds are then loaded onto dev kits that will attempt to run them locally on pre-production hardware. That's pretty much the workflow that we've shown before, and the process with Stadia game development was similar, but with a key difference, and that's that for most developers, there is no local testing hardware at all. Instead, you would have to submit your build and wait for it to transfer to Google's servers, a process that could take up to 40 minutes for, wait for it, about two gigabytes of content. For context, a 60-gigabyte game should take just a few minutes to load onto a dev kit console as long as you've got good infrastructure. Talk about an efficiency nightmare. There are workarounds if you're desperate. Someone can make a change in Unity, for example, and then just try it on their development workstation to see if it works. But to properly verify, you need to run it on the same hardware that the user will have in a built package. That's why in a typical studio, most devs would have their own console or more than one console at their desk so they can quickly verify changes. Of course, that version of things, you know, where Stadia doesn't have local dev kits, doesn't really jive with the existence of this, does it? Ah, well, when these slow transfer speeds (grunts) become an insurmountable problem for you, you can actually reach out to Google and request a local Dev Node like this one, which is basically (grunts) a Stadia cloud server that sits right on your desk. As far as our friend could tell, they didn't just hand them out to anyone though. You had to justify why you needed one. And (grunts) even once you were approved, the experience wasn't exactly with a white glove. For example, they asked Google about providing controllers, and the reply was a link to the product page where they could buy them for MSRP. Nice. So with all that work out of the way, what exactly is it that you get in the mail? On the surface, it appears to be a Stadia-branded Lenovo ThinkStation, but maybe we're gonna find something more interesting on the inside. (Linus grunts) (Dev Node case rattles) There we go, a little dusty. What are we looking at here? Well, it isn't getting less standard-looking. I love that Lenovo does their front IO on an actual hard PCB instead of with wires. So that's pretty cool for cable management. Wow, 64 gigs of RAM. That's a lot for a gaming pc. I wonder if that's just Lenovo's minimum spec. Mind you'd think that they're ordering enough to customize the branding on the front. Oh, that's apparently really easy to do. (laughs) Modular. Even the CPU's only a six-core, meaning that this thing has pretty pedestrian specs, other than, you know, obviously having a workstation-class GPU in it. And even this workstation GPU, it's not exactly a powerful one, not that we'll have any way of knowing that for sure because unfortunately, we couldn't find any reference to the Radeon Pro V320 on AMD's site whatsoever. And in fact, the only resource we could find was a TechPowerUp page that had different specs listed than the card that we have. The page says 16 gigs of ram, but ours apparently only has eight. So it's actually even worse than a basic V320. You know what's not bad? Is our basic blank T-shirts, lttstore.com. (GPU clicks) So if this thing isn't powerful then, how could it be useful for development? Well, it's because it's not for actually doing development. Like a console dev kit, this station is for testing to see how your game is gonna run. It's not for making the game, so it makes sense that you would want a test node that isn't too powerful. You'd want something that's as close to the servers that Google is using to run the service as possible. That way, what the dev sees there at their station should be representative of the end-user experience. Now obviously, an army of Lenovo ThinkStations isn't exactly what Google is using in their data centers. They actually confirmed the hardware specs for Stadia, and we know that each of their servers can run four 1080p instances. Ours can only do one, but it seems to be pretty close, erring on the side of not as powerful. Our dev friend who sent us the node mentioned that with how well some games ran at 1080p through the cloud, the data center nodes might actually have better GPUs, and I guess obviously the 4K nodes would be substantially better than this, but we weren't able to get our hands on one of those. Hey, look at that, you got Stadia splash screen in the BIOS. - [Plouffe] This is what happens. - This is it? Oh, okay. - The fan gets louder. - Fan's ramping up. (Dev Node thuds) Can fit so much fan in this bad boy. And that's actually as far as we're gonna get with the software. If we connected this ethernet cable, it might boot up, but our kit would immediately phone home, reporting a location that is hundreds or thousands of kilometers from where it's supposed to be, and our friend would get a nasty letter in the mail from Google's lawyers. But that doesn't mean our adventure is over. If we could plug it into a network and launch a game, it might look a little something like this. You launch the Stadia partner portal on your PC and select a node from the pool. It'll either be a remote one or your local one if you're so lucky. Once it's reserved, you then create an instance of your game by selecting the application and which version of it you want to launch. There's a one-terabyte drive in our nodes, so you can store plenty of iterations of your projects as long as you have the space. You select which endpoint you want your instance to launch from, and boom, we're in. At this point, you're testing your game like you would on any other dev kit. Pretty cool, but this local node actually still suffers from a problem that the main servers at Google also have. When you're testing unfinished software, crashes and hangs are inevitable, and they can sometimes be so bad that you need to restart your test console. With Stadia, that takes at least 10 to 15 minutes for it to reboot and re-register itself with the backend. I don't know when the last time you restarted your PS5 or your Xbox was, but I mean a minute, maybe two minutes tops. So it's easy to see why developers might want to avoid this sort of workflow, considering how much time is potentially wasted at all these steps of the game creation process. But somehow, they were still doing it, developing for Stadia, and everything seemed to be going pretty okay. So why did Google just kill this entire project? The memes have certainly been fun, but humor aside, there are also legions of satisfied Stadia customers and successful devs who were making money hand over fist, at least once the payment model got changed from getting cash up front to a cut of the subscription revenue based on time played. So there are people whose lives have been affected in a very negative way by Google's decision here. Like if you had a big chunk of the userbase playing your game every day, we're talking potentially hundreds of thousands of dollars a month. Without hard numbers, we can't say exactly how many Stadia users and Stadia Pro subscribers there were, but a few rough internet estimates put the peak at about 2 million, and that sounds realistic given that anyone with a phone could install the free app. However, Stadia Pro was a monthly $10 subscription, and the estimate seemed to vary for that one between 160 to 180,000 active users. If we average to 170, that's 1.7 million in revenue per month, which is a lot of money, but not nearly enough when you consider the overhead that it needs to support. The Stadia team at Google was apparently hundreds of employees, nearly 300 at its peak. Plus they needed to maintain hardware and programs for distributing it and infrastructure, and obviously, they needed to pay out a significant chunk of that revenue in shares to game developers. But in spite of how obviously unsustainable all of that sounds now in the aftermath, apparently at no point did anyone internally at Google seem to acknowledge that Stadia was on its deathbed. Despite all of the outside rumors, it was seemingly business as usual right up until the very bitter end. In February of 2021, Google shut down their in-house dev studio, but insisted that it was for the best so they could focus on the business side of things. Then in July, they tried lowering their cut of the sales. Then in September, they moved Jack Buser to Google Cloud's head of gaming solutions. In November, they cut the price of the hardware from $60 to $22 as the program was now two years old, cute. And then in February of 2022, they said that everything was perfectly fine despite rumors of an internal Stadia deprioritization. Right. Our inside source says that they and every other studio were being lied to just as much as we were, and we have no way of knowing how high up the chain you actually needed to be to know what was going on. When rumors popped up in the summer, they emailed corporate, the dev friend, and they got a reassuring reply. A couple of days before the announcement, they actually got a new version of the SDK, the software development kit that was pushed out to developers to work on Stadia. An industry colleague of our friends from another studio even flew from Japan to San Francisco to talk about the future of Stadia with Google the day before they shut it all down. Now luckily for the team we got this unit from, the writing was on the wall and they had already pivoted to porting their game to other platforms. As for others, Google's actually trying pretty hard to properly pay out studios' fair shares, almost like a severance for a fired employee. Customers have already been refunded or are going to get refunds, and Google isn't broke. So hopefully, the checks clear and that's all sorted out pretty quickly. In fact, they've done such a good job of canning this thing that the person we spoke with only had good things to say about their experience dealing with Google. They all seem friendly, they're nice to work with. It almost has this like super weird mutual breakup vibe. Will anyone ever trust Google if they try to re-enter the gaming space? Almost certainly not, but there doesn't seem to be a lot of anger either. With the entirety of what's referred to as the Google graveyard being in plain view for anyone to see, it's almost like everyone kind of knew this was coming, but they were willing to take the bag of money for their work and see if, who knows, maybe this is one of those projects that stays. Hey, maybe that's where the name came from. Stay-dia. Huh, not so much. Though maybe it will stay around in some form. I have no evidence to support either of these theories, but I think it's possible that Google could sell the technology to an interested party, and I also don't think it's impossible that Stadia could resurface as a business-to-business product. Say a mobile carrier wanted to introduce a cloud gaming service, they could use white-label Stadia to spin it up extremely quickly. Until that happens though, it's yet another line on killedbygoogle.com, which for those who are not in the know, is an amazing site that chronicles all the products and services that Google has launched, ran sometimes for years, and ultimately killed. At least in this case, unlike Google Play Music, which is still better than YouTube Music, they have fully compensated their customers and seemingly partners. But there is one more thing that I would like to see resolved, that's the Stadia controller. While it can be used on your PC with a USB-C cable, I suspect that many gamers in 2022 and beyond are not gonna wanna deal with that and are gonna end up junking them. So Google, I'm asking you, please either provide a fix or open up the firmware so that the community can work on getting it working wirelessly over Bluetooth. Please and thank you. And thank you for checking out our sponsor, Squarespace. If you need to build a brand online, you need a website. \"But Linus, I just learned how to turn on the little flashlight on my phone. How am I gonna build a whole website,\" you ask. With Squarespace. Squarespace is a one-stop, no-frills, all-in-one platform for expanding your presence on the internet. Squarespace lets you build beautiful websites, engage with your audience, and sell anything and everything, from products to content without needing to attend the Linus Techwarts School of Tech Wizardry. We love Squarespace so much that we use it here at Linus Media Group. Its custom templates make it easy to stand out with a plethora of themes and customization options to fit your needs, and you can maximize your visibility thanks to their suite of integrated SEO features. There's also analytic insights to help you optimize for performance so you can see what's working well and what needs tweaking. So don't wait, get started today and head to squarespace.com/ltt to get 10% off your first purchase. If you guys enjoyed this video, maybe check out the last time we tried all the streaming services. That was our last chance to do it. Now it's over for Stadia, probably (indistinct) at some point.",
    "transcript_keywords": [
        "Google",
        "Stadia",
        "Google Stadia",
        "game",
        "Stadia cloud games",
        "Stadia game development",
        "Stadia Development Node",
        "dev",
        "Stadia cloud",
        "Stadia Pro",
        "Stadia cloud server",
        "hardware",
        "play Stadia cloud",
        "pretty",
        "cloud",
        "development",
        "Stadia game",
        "Node",
        "dev kit",
        "thing"
    ],
    "transcript_entity_values": [
        "one",
        "1.7 million",
        "V320",
        "Stadia",
        "eBay",
        "eight",
        "the Linus Techwarts School of Tech",
        "Stadia Pro",
        "Google Play Music",
        "USB-C",
        "next month",
        "Google Stadia",
        "monthly",
        "10%",
        "February of 2022",
        "killedbygoogle.com",
        "GPU",
        "A couple of days",
        "nearly 300",
        "64",
        "hundreds of thousands of dollars",
        "Xbox",
        "AMD",
        "20",
        "Linus",
        "July",
        "the summer",
        "NDA",
        "YouTube Music",
        "years",
        "1080p",
        "first",
        "2022",
        "at least 10",
        "Oregon",
        "170",
        "two minutes",
        "Hetzner",
        "4",
        "Unity",
        "Lenovo",
        "Squarespace",
        "CPU",
        "about two gigabytes",
        "six",
        "two years old",
        "Stadia",
        "hundreds",
        "SDK",
        "more than one",
        "Stadia",
        "west coast",
        "Google",
        "Linus Media Group",
        "September",
        "10",
        "February of 2021",
        "Hillsboro",
        "one-terabyte",
        "IO",
        "Dev Node",
        "MSRP",
        "Jack Buser",
        "up to 40 minutes",
        "Japan",
        "16",
        "about 2 million",
        "four 1080p",
        "PS5",
        "November",
        "$60 to $22",
        "idea-",
        "PCB",
        "San Francisco",
        "Google Cloud's",
        "TechPowerUp",
        "Stadia",
        "60-gigabyte",
        "Lenovo ThinkStations",
        "Lenovo ThinkStation",
        "Dev Node",
        "just a few minutes",
        "today",
        "AAA",
        "RAM",
        "one between 160 to 180,000",
        "hundreds or thousands",
        "the United States",
        "Perforce"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PERCENT",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "NORP",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "LOC",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "GPE",
        "QUANTITY",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "GPE",
        "WORK_OF_ART",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG"
    ]
}