{
    "id": "QinFy0RFDr8",
    "title": "Why Microsoft’s CEO is ready to take on Google with ChatGPT",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-02-08T00:02:53Z",
    "video_url": "https://www.youtube.com/watch?v=QinFy0RFDr8",
    "category": "Science & Technology",
    "tags": [
        "chatgpt",
        "ai",
        "artificial intelligence",
        "microsoft",
        "what is chatgpt",
        "how to use chatgpt",
        "chatgpt explained",
        "bing",
        "google search",
        "google",
        "search engine",
        "best search engine",
        "chatgpt examples",
        "chat gpt trading bot",
        "chat gpt tutorial",
        "Satya Nadella",
        "microsoft ceo",
        "satya nadella interview",
        "the verge",
        "deocder",
        "nilay patel",
        "nilay patel decoder",
        "openai",
        "open ai"
    ],
    "views": 277361,
    "likes": 8569,
    "comments_count": 587,
    "description": "Microsoft has announced a new version of its search engine Bing, powered by an upgraded version of the same AI technology that underpins chatbot ChatGPT. The Verges Nilay Patel sat down withMicrosoft CEO Satya Nadella to discuss.   Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:",
    "description_links": [
        "http://bit.ly/3x9aeUO",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv"
    ],
    "transcript": "- Hey everybody, it's Nilay. I have a very special episode of the Decoder podcast today with Microsoft CEO, Satya Nadella. I'm actually sitting on the Microsoft campus right now. The company just announced a new version of the Bing search engine that's powered by OpenAI. OpenAI makes ChatGPT. Microsoft is using a new version of that model to run Bing, actually answer questions in the Bing search box. And there's a new version of the Edge web browser that has a chat box right next to it where you can just ask it to summarize webpages for you, do all kinds of things. It is a big new step in search. Microsoft is not being shy about directly competing with Google in search, and I got the chance to ask Satya all about it. - Satya Nadella, you are the CEO of Microsoft. Thank you for coming on Decoder today. - Thank you so much Nilay for having me. - So Microsoft just announced a huge new version of Bing. It's powered by a bunch of OpenAI technology. A couple weeks ago, the company made a what was called a multi-billion dollar, multi-year investment in OpenAI. Tell us what's going on. - Well, I mean, today's announcement is all about rethinking the largest, software category there is, search, with this new generation of AI, because it's a platform shift, and you get to sort of reimagine pretty much everything, right? Starting with the core ranking. In fact, perhaps the most salient part of today's announcement is we've had the best gain in relevance in the core ranking using some of these large models. Second is it's not just a search engine, it's an answer engine, because we've always had answers, but with these large models, the fidelity of the answers just gets so much better. And then we've incorporated chat right into search, which is grounded in search data. So you can do a natural language prompt, which is an auto query, which is long. You get a great answer, and then you can engage in a conversation with that as the grounding or the context. So it's about basically, essentially bringing in fact a more sophisticated model, larger model, next generation model, compared to ChatGPT and grounding it in search data. The other last thing we also added was a co-pilot for the web, so that you, in Edge, can be looking at any website or any document on a website, like a 10-Q for example, and then do things like summarization. So a whole lot of these features all coming together essentially as the new Bing. - So a really interesting piece of the puzzle here is a lot of this is powered by OpenAI and OpenAI technology. OpenAI CEO, Sam Altman, was on stage with you today. You've been working with OpenAI for three years, but you haven't acquired them. You've made a huge investment into them. Why work with an outside technology vendor for the largest software category in the world? - Well, I mean, look, first of all, you gotta remember the relationship with OpenAI and our cooperation with OpenAI has got many facets. The most important thing is what we've done over the last four years is to actually build out the core infrastructure on which OpenAI is built. I mean, these large models, the training infrastructure and the inference infrastructure doesn't look like just vanilla cloud, right? So we have had to essentially evolve Azure to be pretty specialized AI infrastructure on which OpenAI is built. And by the way, Inception is also using Azure, Character.AI is using Azure. There will be many others who will also use Azure infrastructure. So we are very excited about that part. And then of course, we get to incorporate these large models inside of our products and make those large models available as Azure AI. And in all of this, we both have an investment return and we have a commercial return. And so we think we are well-placed to partner. Like I will never assume that great partnerships can't be both great returns for our customers, shareholders, and Microsoft. - There is a lot of talk today in the presentation about the values that are coming into Bing, about the safety work that's being done, about the responsible AI work that Microsoft has done for years. How do you make sure that bridges the gap to OpenAI, which is not your company, but obviously very tied very closely, and how do you make sure your products inherit all those values even when you're working with an outside company? - Yeah, first of all, OpenAI cares about safety. I mean, in some sense, their entire Inception was about how to think about safety in AI and alignment in AI. And so we share that. And we've had our principles as we talked about it today, Nilay, which since 2016, we've published the principles, ever since quite frankly we've been very focused on what I'll call the hard work of incorporating it in the engineering practice of building products, right? Starting with design, one of the things I think a lot about is when you have, let's say a new model coming, it's probably most important to actually put human in the loop versus design the human out, so that you can in fact ensure that the human agency, judgment, is what you use to train the model to be aligned with human feedback. So that's kind of what we are doing. Like when I look at even what we are doing in Bing is taking it even one step further to even ground it in the context, which is search. So I always say, look, these generator models just don't randomly generate stuff. You prompted it. So there's a whole lot you can do in the meta prompt and the sequence of prompts you generate, which we can assist with. So there's a lot of, I'll call it product design choices one gets to make, of when you think about AI, AI safety. Then you, let's come at it the other way, right? You have to take real care on the pre-trained data, right? Because that's where, you know, after all the models are trained on pre-trained data, what's the quality, the provenance of that pre-trained data? That's a place where we've done a lot of work. Second, then the safety around the model, right? At runtime we have lots of classifiers around harmful content or bias, which we then catch. And then of course the take down, ultimately in the application layer, you also have more of the safety net for it. So this is all ones that come down to, I would call it the everyday engineering practice. And guess what? Search is like that, search is an AI product. I mean, one of the things, it's kind of interesting, that we are now talking about a new algorithmic breakthrough in these large models. But we've always had AI models for, you know, decades now. And we've really built, you know, our sense of what is authoritative, how to detect authoritative, how to ensure harmful content doesn't get through. And those are all practices that will now be used. - So that leads me into, I think, the value exchange of search right now. So in a traditional search model, I ask Bing some question, it might return some snippet, but it usually returns a list of links. I go visit a webpage, the creator of that webpage might capture some advertising revenue or something else. Now you're just answering the question directly and you've trained the model on other people's information, other people's reporting, I'm very biased in favor of reporting. How do you make sure that they get the value back? - It's a very important, in fact, one of the biggest things that is different about the way we have done the design now, and I'd really encourage people to go look at it. This is about, look at the end of the day, search is about fair use. Ultimately, all this content we only get to use inside of a search engine if you're generating traffic for the people who create it. And so that's why if you look at whether it's in the answer, whether it's in chat, these are just a different way to represent the 10 blue links more in the context of what the user wants. So the core measure, even what SEO looks like, if anything, that'll be the thing in the next multiple years, we'll all learn. Perhaps there will be new incentives in SEO to even generate more authoritative content that then gets in. So overall, everything you saw there had annotations, everything was linkable. And that'll be the goal, whether it's inside a search, whether it's in the answer or even in the chat session. - But if I ask the new Bing, what are the 10 best gaming TVs? And it just makes me a list, why should I, the user, then click on the link to \"The Verge,\" which has another list of the 10 best gaming TVs? - Well, I mean, that's a great question. But even there you will sort of say, \"Hey, where did these things come from and would you want to go dig in?\" Like even search today has that, like we have answers, they may not be as high quality answers, they just start getting better. So I don't think of this as a complete departure from what is expected of a search engine today, which is supposed to really respond to your query while giving them the links that they can then click on like ads, and search works that way. - The reason I ask this is obviously, when you say, you're taking on a larger software category in the world, that's search, there's a dominant player in Google. If Google stops sending as much traffic from its search engine results page to publishers, to creators, to other websites, regulators around the world would freak out, because they have a dominant market share. Bing does not have a dominant market share. When you evaluate the risks, both IP risks, legal risks, regulatory risks, you say, \"Well look, we don't have the share, we can take a step forward in how we present these results in a way that our competitor cannot.\" - That's not how I come at it. - I'm just curious. - Yeah, I come at it primarily on like basic. Today, if you look at the search category, it's great. It works 50% of the time. (Nilay laughs) It doesn't work for the other 50% of the time. So I think what really I wanna do is to go back and say, \"Look, is there some new powerful technology that can make a search a better product without fundamentally changing how search gets permission to even exist as a product?\" Which is other people's content organized in useful ways so that users can find them. To me, that is the category. And so we will live and die by our ability to help publishers get their content to be seen by more people. Up to now, you're absolutely right. Google dominates this market by a significant margin. We hope, in fact, if anything, having two, you know, or multiple search engine, it's not just us. There'll be others who will be competitors. By having more, let's call it evenly spread search share, will only help publishers all get traffic from multiple sources. And by the way, advertisers better pricing. And so publishers will make more money, advertisers will make more money, and users will have great innovation. Oh and think about what a great day it'll be. (Nilay laughs) - I am eager for there to be more competition in search. What I'm curious about is if more and more people are producing more and more AI content and that becomes the base layer that you're training against. So if instead of me writing a story about the Chinese spy balloon, I ask Bing to write such a story, and that gets fed back into Bing. Eventually the amount of original content in the ecosystem begins to wither. Is that a feedback loop that you're worried about? - So yeah, absolutely. But the way I look at it and say is what people sort of talk about, like my daughter sent me this unbelievable example the other day. She's taking some French lit class and she said, Hey, I was using this AI tool to summarize what I was writing and it took me two hours, because she was doing meta prompts and prompts, and learned more about that text than ever before. And so I feel like a little bit, let's give ourselves a little permission to think about what is original content. Because as I said, AI just doesn't generate it. You prompted it. You have a draft which you edit today. I mean, I would be unemployable, but for the red squiggly in Microsoft Word, because that's what helps me write anything. So I think we all used and evolved to use new tools. I think of it that way, right? I think it, yes, it'll create, you know, some of the drudgery of knowledge work may go away, but doesn't mean I won't enjoy. Like in fact, the best place, Nilay, I feel it, is in GitHub Copilot, right? Coding, I mean, it's not like suddenly you are not coding. If anything, you are more in the flow of coding with some of these prompts. You read more code, you accept more code. So I think it's just a different way for us to perhaps enjoy our knowledge work more. - That brings us to the the second product, right? Which is the co-pilot inside of the Edge browser. If you look at Bing, you have an opportunity now to capture market share from Google. If you look at Edge, you have an opportunity to capture a market share from Chrome, potentially Safari if you go to the iPhone. Is that how you're seeing this? This is an inflection point. You have a new technology. You have a lead with this partnership with OpenAI. It's creating an opportunity for you to go take share, or is it you are expanding the category and you think you can initiate new users in a new way. - Like, I always sort of, you know, I start always not from zero sum, but I sort of sort of look and say, \"Hey, how does the category expand? How can we participate in that expansion?\" That's I think at the foundational level, but at the same time, you know, there will be, like these are places where the dominant browser is Chrome. I mean, forget anywhere else. On Windows, Google makes more money than all of Microsoft, right? So let's start there. So there's a huge opportunity for us if we got some additional share, well, for whether it's our browser or our search engine. And so that's kind of how I look at it, which is let's build first a product that is competitive in the marketplace, that's actually serving user needs. And like all things, Nilay, I'm also, I'm not a one platform guy. I'm like, I want ask, I grew up in a Microsoft. - Yeah, This is your big change in Microsoft from your leadership. - Not really. The Microsoft that I grew up in, because I always remember, yeah, that Microsoft software, like Office was on the Mac before even Windows. So that's kind of the Microsoft that I learned from. And I'll always make sure that our software is everywhere where users want it. - It's been a relative period of calm between Microsoft and Google. There was a previous period of, I would say antipathy or more open antipathy. Recently you've partnered on things like Android on some of your hardware. You've partnered, I think Microsoft 365 on Chromebooks is some partnership that was recently announced. Do you expect this new sort of head-on competition against their most important product to change that relationship? - First of all, I mean, look, I have the greatest of admirations for Google and what they've done. And you know, they're an unbelievable company with great talent and, you know, and I have a lot of respect for Sundar and his team. So therefore, I just want us to innovate, right? So there's always, I mean, we compete today. Today was a day where we brought some more competition to search. We've been at it, believe me, I've been at it for 20 years and I've been waiting for it. But look, at the end of the day, let's not, you know, they're the 800-pound gorilla on this, which is what they are. And I hope that with our innovation, they will definitely want to come out and show that they can dance. And I want people to know that we made them dance, and I think that'll be a great day. - What was the moment in the development of the product where you said, okay, it's ready, we should announce it like this, with a pretty direct shot at the 800-pound gorilla. Was there a light switch that flipped for you? Was it committee decision? How'd that work? - So when I first saw this new model, because the model that you saw today is the next generation model. - Is it GPT-4? - I'll let Sam, at the right time, talk about his numbers. So it is the next generation model and it's been done as we said, we called it the Prometheus model, because as I said, we've done a lot to the model to ground it in search, right? So the search use case is pretty unique and so we needed to ground it in that as well. So when I first saw the raw model back in the summer of, I would say 2022, is when I thought that this is a game changer in terms of the search category, aside from everything else that I'm excited about, because I do care about Azure having these APIs even. So we've been at it. In fact, I'll never forget my first query I did on the model, which I think sort of for me, growing up, you know, I always felt, like if only I could read Rumi, translate it into Urdu, transliterate it into English, that is my dream. I just put that in as one long query. And it was magical to see it generate it. And I said, \"Man, this is different.\" And you could have, I mean I could have programmed it, done some multi turn. - That was your first query? - That was the query that changed. - You're one of the classiest people I've ever met in my entire life. I mean that's like a very complicated. - It was just one of, I've read Lorca. I mean people like, well look, poetry is great, man. - I mean, I buy it. My first query was like, are you alive? So that's where I would've gone. So you run this query, right? To translate, Rumi is a Indian poet. - Persian. - Persian. Into across two languages. And you receive the response, and you think, okay, this is a product, or this is a product with revenue possibility, or this is a product with market share possibility. - Yeah, I mean like all things, one of the things that I think about is in the end, platform shifts, the two things have to happen. You have to retool pretty much every product of yours, right? So you gotta rethink it, whether it's on the way you build it, what its core features are, it's kind of like, you know, how Microsoft had to pivot for the cloud, right? Which is, you had to rethink Exchange. It was not an Exchange server. It was Exchange as a service. Or, what we had to do with, you know, our server infrastructure. We had to rebuild essentially a new core stack in Azure. So every time with transitions, you have to essentially rewrite it. That's kind of how I think about it. The second thing is you also have to think about the business model. Sometimes these transitions are pretty harsh. I'll tell you the last transition from having, you know, the high share server business with great gross margins, and saying, hey, the new business is called cloud and it's going to have one fourth the margins, is like the new news. It was pretty harsh, so we made it. Whereas in here, I look at this, there are two things. One is it's absolutely new tech, but it builds on cloud, right? So that's one place where we already have relevance, and so there is the next generation of cloud. And second in search, the economics are interesting, which is we already have a profitable business, but with very little share. And so every day I just want a few users and a little bit more gross margin. And so yeah, I did see, I think a tremendous opportunity for us to make some real progress here. - So the model right now, last I think, like Bing is an $11 billion a year revenue business. Something like that? - Something like that. I think Amy's gonna talk about, I don't know how she wants to talk about it, yeah. - Incredible hobby. I wish I had an $11 billion a year hobby. You want to grow that into a real business. You wanna take share, but obviously the new technology does not have the same cost structure as the old search query, right? I'm sure that whatever you're doing with OpenAI, it's more compute intensive. And then obviously, you have that partner sitting in the middle of it, and then the monetization model is still search ads, right? It's direct response search ads. But as you bring more and more content on the screen, that model might change or the price of those ads might change. Are you, huh? - It's so wonderful. - Yeah. - I mean, just think about what you just said. You said, okay, here is the largest software category where we have the smallest share, and what you just painted out is an unbelievable picture of incremental GM. If Steve Ballmer saw that, he would've like lit up and said, \"Oh my god.\" Very few times in history do opportunities like that show up where you suddenly can start a new race with a base where every day is incremental GM for you, and someone else has to play to protect it all, every user and all the GM. - So I wanna wrap up with two questions here. One, I just wanna come back to this. I think you are going to face a lot of scrutiny from publishers, creators, other website owners saying, \"Hey, that is our training data.\" You are already seeing it, right? Getty is suing a handful of the image generation AI companies saying, \"Hey, you're generating results with our watermark in it,\" right? \"This is obviously ours.\" So I'm curious if you have a view of the potential IP risk on the downside or on the positive side of how to grow and keep the ecosystem vibe. - I mean, on the search side, I'm very, very clear. The search category is about fair use so that we can generate traffic back to publishers. And so that's sort of, we wanna stay very focused. - [Nilay] And is that a KPI that you're keeping track of traffic you're sending out. - Absolutely, a hundred percent. Like, I mean that's the only way we are gonna be, our bots are not gonna be allowed to crawl search if we are not driving traffic. So therefore, that I think is the core of the category. In other places, again, it'll have to be really thought through as to what is the fair use. - Yeah. - And then sometimes, I think there'll be some legal cases that will also have to create precedent, but at the end of the day, I don't think any of this can be done without a framework of law that governs it and ultimately financial incentives that benefit. If anything, I look at this and say, \"God, is this something where the fact that there's going to be more competition can really help publishers get more monetization, advertisers get better returns for their investment, and users have more choice?\" - All right, I wanna end with a question that I think is the most important question. You have described a transformational moment in the largest software category in the world. You've said it obviously, there's a moment of increased competition against the dominant player. What was it like in the room when you decided to stick with the Bing brand, right? There had to been a slide with like 50 options. I'm assuming it's Microsoft. There's some passionate back and forth debate. Eventually someone decides, was it you who decided? - Yeah, we wanted to call it Azure Search 2023 Edition. - [Nilay] Xbox Live Search. (both laugh) Just go for it. - No, or bring back Clippy. - Yeah. - No, look, really, interestingly enough, it was not much of a discussion because we felt, look, we love Bing, we have been at it. I was there at the day of launch of Bing, I worked on it. - But it has a lot of baggage as a brand. - You know, it's like, look, brands can be rebuilt as long as there's innovation. I think the brands are only as good as the product and as good as the innovation. And so we're gonna go work it. - And that was your choice. - Absolutely. - All right, well, Satya, thank you so much for talking today. It was really exciting to see all the new stuff. I'm eager to see how it grows in the future. - Thank you so much, Nilay. - That's great. I have like 50 more, but I can feel the waves all around me. (laughs) - It was fun, that was great. - Huh? Thanks again for Satya for taking the time to talk to me on Decoder. Open your podcast app, subscribe to Decoder. I host it, it's great. It's a lot of conversations like that. Tom Warren and I are here at Microsoft. We're gonna be trying out the new Bing. Stay tuned. Lots of videos, hands-on impressions, and maybe a little bit more coming from Microsoft.",
    "transcript_keywords": [
        "search",
        "Microsoft",
        "Bing",
        "model",
        "search engine",
        "OpenAI",
        "Bing search",
        "today",
        "Bing search engine",
        "large models",
        "share",
        "great",
        "product",
        "models",
        "things",
        "lot",
        "Azure",
        "category",
        "Yeah",
        "search category"
    ],
    "transcript_entity_values": [
        "Azure",
        "zero",
        "Decoder",
        "Bing",
        "Android",
        "Inception",
        "Sam",
        "the day",
        "three years",
        "the end of the day",
        "Office",
        "Rumi",
        "Safari",
        "GitHub Copilot",
        "50%",
        "A couple weeks ago",
        "English",
        "Sundar",
        "Chrome",
        "One",
        "Sam Altman",
        "Exchange",
        "50",
        "Tom Warren",
        "Edge",
        "Lorca",
        "Microsoft",
        "KPI",
        "the other 50%",
        "every day",
        "Steve Ballmer",
        "Getty",
        "the next multiple years",
        "Second",
        "GM",
        "Nilay",
        "Google",
        "Persian",
        "20 years",
        "Indian",
        "decades",
        "first",
        "IP",
        "Chinese",
        "10",
        "$11 billion",
        "Today",
        "Amy",
        "the last four years",
        "The Verge",
        "AI",
        "Azure AI",
        "the summer",
        "Windows",
        "2016",
        "Nilay",
        "two hours",
        "one fourth",
        "second",
        "800-pound",
        "First",
        "one",
        "a hundred percent",
        "Chromebooks",
        "today",
        "Bing",
        "year",
        "years",
        "Satya",
        "two",
        "Satya Nadella",
        "Azure Search",
        "French",
        "a day",
        "Urdu",
        "Prometheus",
        "iPhone",
        "Mac",
        "2022"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERCENT",
        "DATE",
        "LANGUAGE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERCENT",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "ORDINAL",
        "ORG",
        "NORP",
        "ORG",
        "NORP",
        "DATE",
        "NORP",
        "DATE",
        "ORDINAL",
        "ORG",
        "NORP",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "WORK_OF_ART",
        "TIME",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "NORP",
        "DATE",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE"
    ]
}