{
    "id": "QiPRnPXOvjc",
    "title": "I edited a Dave2D video on iPad Pro",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2018-12-22T05:47:31Z",
    "video_url": "https://www.youtube.com/watch?v=QiPRnPXOvjc",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "iPad Pro final cut pro x",
        "iPad pro video",
        "iPad Pro video editing",
        "12.9 iPad Pro",
        "iPad Pro review",
        "iPad Pro unboxing",
        "iPad Pro",
        "2018",
        "2018 iPad Pro",
        "New iPad Pro",
        "2018 iPad Pro Review",
        "Review",
        "unboxing",
        "2018 iPad Pro Unboxing",
        "jonathan morrison",
        "tld",
        "A12X",
        "A12X Bionic",
        "iPad Pro vs PC",
        "iPad Pro vs MacBook Pro",
        "MacBook Air",
        "Mac Mini",
        "Apple",
        "iPhone XS",
        "iPad Pro Benchmark",
        "iPad Pro Hands on",
        "iPad Pro vs iPad",
        "iPad Pro vs Pixel Slate"
    ],
    "views": 553441,
    "likes": 12912,
    "comments_count": 845,
    "description": "Thanks to LastPass for sponsoring this video! Click here to start using LastPass now!  Full Dave2D Video edited on iPad Pro!   This is the new 2018 MacBook Air!   Which has the best smartphone camera?   The Definitive iPhone XR Review:  iPhone XR Unboxing & Impressions!:   TLD Behind the Scenes!  Mobile users:   Music via Musicbed:   My Audio Setup & Gear:   Instagram:   What you need to edit your video like I did here! iPad Pro (11 or 13 inch):  Apple Pencil 2nd Gen:  iPad Pro Keyboard (12.9 inch model):  iPad Pro Keyboard (11 inch model):  Twelve South Tablet Stand:  Bluetooth Speakers (I like these):  Or Use A HomePod:  GREAT Camera for Videos:  Fav Lens To Go With That Camera Thingy:",
    "description_links": [
        "http://bit.ly/2A5d2Ff",
        "https://www.youtube.com/watch?v=PIoJeY0rx-w",
        "https://youtu.be/ZUbo3q0f2t0",
        "https://youtu.be/oF5vWKfcaow",
        "https://youtu.be/i0JV95H1TDM",
        "https://youtu.be/Bat05NtQ4y8",
        "http://bit.ly/TLDBreakdown",
        "https://www.youtube.com/channel/UCDlQwv99CovKafGvxyaiNDA/join",
        "http://share.mscbd.fm/tldtoday",
        "https://youtu.be/v9hu-Avj2oE?list=PLq...",
        "http://www.instagram.com/tldtoday",
        "https://bhpho.to/2FuAwsN",
        "https://bhpho.to/2FvqIhX",
        "https://bhpho.to/2Fu6K7i",
        "https://bhpho.to/2Fu6K7i",
        "https://amzn.to/2K8PPWu",
        "https://amzn.to/2PCGQmD",
        "https://apple.co/2DsQ6lO",
        "https://bhpho.to/2BdRLMR",
        "https://bhpho.to/2FreDdE"
    ],
    "transcript": "(ambient guitar music) - Hey, how's it going? Dave2D here. So if this video looks and sounds and feels a little. - Okay, Johnathan here, back with round two of editing a video on the iPad Pro. So a couple weeks ago, hung out with my guy, Dave2D, and we shot a video that went live on his channel. And I'm not gonna say that it was well-received and that no one knew that it was edited on an iPad Pro. But it was pretty well received, and nobody knew it was edited on an iPad Pro. This one's a long one, so kick back, relax, grab your popcorn. But before we jump in, I wanna give a huge shout-out to today's sponsor, LastPass. So it's 2018, soon to be 2019, and nobody should be using 12345678 as their password, and with that LastPass takes the burden off trying to remember a complex password and getting locked out. So with LastPass, it essentially does all the legwork for you from entering the username to the password. It's super-secure with multi-factor authentication, and the best part is is that it works on both iOS and Androids. So if you guys wanna check it out for yourselves and support the channel, make sure you guys hit the link below. And again, big thanks to LastPass for sponsoring today's video. But now back to the iPad Pro edit-off. Now, with this video, I to fight every bone in my body not to edit this on the plane ride back from Toronto hanging with Dave. I did though, that wouldn't capture the edit process on video. I did however, get a little bit of a head start in terms of importing, organizing, doing a little bit of color grade and also syncing the audio with the video because unlike the Kevin Kenson video where that audio was recorded internally into the Sony A73, this was done externally. So inside LumaFusion, we have the blue clip which is the video and below that is the green clip which is for the audio. The simplest way I found to sync those up is find the actual first wave point at the clap, cut there, do the same thing with the audio, line em up, and you are good to go. Now, hopefully, with future versions of LumaFusion, they come up with some sort of automatic sync or at least a way to kind of nest or compound clip because if I could do this, and then kind of group that into one clip and make the cuts, it would make my life much easier. But with this again, I wanna do something a little different and also challenge myself in addition to the original Kevin Kenson video. Now, for those that watched the previous video, for the most part I do tend to enjoy editing to music like with it loud and that kind of dictates the style and the feel. But with this, I think I wanna get the talking head portion with Dave out of the way, and kind of keep it true to his normal style. Now quick tip, with LumaFusion there's a really cool audio mixer you can access by tapping here. So we have all the channels pulled up. And what I did was completely mute the Sony A73 audio, and all we're hearing is the external audio which is a shotgun mic into a sound device's MixPre-3. And again, just the fluidity and the smoothness of the timeline, scrubbing, pitching, zooming, still continues to blow my mind even multiple times through this on the iPad Pro. (thumping) (clapping) (man talking off camera) - What is his speed? - (laughs) Dave is such a sweetheart. So sound speed, camera speed, I guess if you hang around people who know what they're doing long enough, you kind of at least can fake like you know what you're doing. And I think the actual origin story of that is back when camera's actually recorded to film, it would take a certain amount of time before if would actually speed up to the proper frame rate, and that is why you say, sound speed, camera speed. With this cut though, I think in my head I know. We did a couple takes at the beginning, so I can kinda scrub already to the actually real take. And it's just gonna be like this smooth, relaxing process because Dave2D, he should read an Audible book, and it's just one of the most soothing voices you'll ever hear. - The laptop that I use-- - Okay, so that I know, we're ahead of the game. - The laptop that. - Nope. - Dave2D here. So if this video looks. - There's the intro. So I'm gonna scrub in. - Hey how's it go-- - There we go. So that is the endpoint that I want. And shout-out to everybody on Twitter that answered this question. Instead of actually selecting a clip, cutting, deleting, cutting, deleting, if you have nothing selected, and you actually, you know, hit a blade, that will cut both of them at the same time. So really helpful there. And I think because if we scrub back, this is connected to that. So if I delete it, boom. It's cutting both, so just a little efficiency tip in LumaFusion. Also again, just kinda talking about the speed, the fluidity, this clip is actually color graded. And again, it's just playing it real time, 4K, just no dropped frames, no lag, it's kind of crazy. Here's what the clip looked like before. So not bad, and here's what it looked like after. So I wanted more of like this cool kind of just ambient feel to match Dave's voice. The actual blue, the white of the setup, and I think it turned out pretty. (kissing noise) Now, the more and more I kind of edited within LumaFusion, yes the Pencil is helpful in terms of that kind of acts as your mouse, but I would say in terms of what's more beneficial, I would say the keyboard, hands down. Because just having the ability to use a Space Forward to play and pause is like immensely helpful. I'm gonna try to actually see if I can edit this video without the Apple Pencil. I did that with the Kevin Kenson video, so it'll be a little bit of a challenge this time to see if I can do this only with my hands and the actual Apple keyboard. Again, for keyboard shortcuts, LumaFusion Command + B is to blade. I'm gonna make sure that both clips aren't selected. And, there we go. So now I'm gonna find the next point where Dave talks about the laptop. - What I used the most this year was actually the DREVO Cap-- - Cool, so that is the talking point about the, and you can kind of start to feel like if you look at the wave forms, you can see that's kinda like the beginning of a sentence. So I'm gonna roughly put it there. Command + B. This Command + X, and, again, because that is attached to this, it should delete everything, And then we should have one cohesive smooth cut hopefully. - The lap-- The lap-- - It's not bad. We're gonna mask that with a little B-roll. - Used most of in 2018, so I'm gonna start it with the hardware and then kind of go into the details of it. The laptop that I use-- - I think I can get that a little tighter. Yeah, so that's nice, just having the ability to cut both at the same time and then delete. - The l-- Ils of it. The lap-- - And you know cutting is such a specific style. Sometimes you kind of want that voice to lead into the next sentence. In this case, I actually think maybe that's more Dave's style. So I'm gonna leave a little bit of that breath just for that pacing because he is such a smooth, natural talker. - Kind of go into the details of it. The laptop that I used the most this year - That feels like Dave. - Is actually the Razer Blade 15. - So I'm gonna get a real, real, real, real precise cut right here and then try and blend that with the next line down the road. - I really like the wireless. - Okay, here we go. So I know that's, that what I want. Let's see if I can make that work. Command + X. - Wired, I really like wireless expe-- - Ooh, that's not bad. - Coupled the perfect keyboard, and it actually featured a different keyboard, a control keyboard, but that thing was wired. I really like the wireless experience, so I just went with the DREVO Calibur more often than not this year. And a great keyboard, highly recommend it. - Dave is worried about the length of this video because I made him shoot this at midnight. So right now we're about a minute and eight seconds in. If we can hit like three minutes, I'll feel good. So Dave is on standby with the updates. It's gotta feel like pretty nerve-wracking not editing your own video, having it in someone else's hands especially mine on an iPad Pro. If I screw this up, this could be hugely terrible for him, and I'm sorry Dave. I'm also very thankful for putting that trust in my hand. So you see here what I did there was I actually had the main clip selected, so it cut both. Command + B, that does the entire video and audio. And again, that's kind of a big tip when you're editing video, pay attention to the wave forms. If you see little minute chunks, that's more than likely not gonna be like the cohesive sentence you want. It depends on your style obviously. But with Dave, someone who has a really good talking presence I know if he's hitting like a big chunk of audio that's more than likely going to be the take that I want. - This particular for-- - Okay, a little bit of natural. - Just have like a black base and stuff. This is silver, white, looks clean. - That like describes every Dave2D video. Clean, clean and calm. We're at two minutes so again I think if we hit the three minute mark, Dave will be content with that. Hopefully, four minutes if I can stretch it out a little bit with some little fancy editing. So you can see editing is so much just all about feeling, anticipating, knowing when that next cut or something's gonna happen. I know it's weird, but it's just kind of how I get into it. - The Pixel 3 is probably the best camera in my opinion. I feel like it just shoots the nicest. - We clearly now know, it is not the Pixel 3. Thanks, Marques. Pocophone. We should have put a Pocophone in the setup. I've talked about it before, but just obviously the smoothness, the fluidity, the silence, like you can hear everything else around right now. The outside, the people, the neighbors next door. They get mad at us because we're loud, and they're making noise right now. (faint chatter) Hopefully they're not watching this, I don't think they will because I don't think they like us. - And I think it looks good that's why I went with it. There's a white power bank for-- - Ooh! We hit three minutes. I'm gonna text Dave right now, he'll be happy. He was worried it was gonna be short because it was so late at night. - And other draw-- We get their desktop use, but if you're interested-- - Okay, this is gonna be a challenging cut because... - Uh, there's another mouse in here so. This. - I gotta, this is. (sighs) - Uh, there's another mouse. - Let me see if I can get that uh out of there. This is gonna be a challenging cut. - Whole color setup. There's another mouse in here. So this. - Yeet. - I use this mouse, this. - I think I can do it. So let's take effectively, three cuts hopefully that sounds like one cohesive sentence. - There's another mouse in here, so this is a Logitech. - Almost, almost, almost. - Or setup. There's another mouse in here, so this is the Logitech. - (groans) No. I need to go the other way, so I'll take. Let me take less of that, and then more of this. No that's too much. I gotta get like in there. Okay. Here we go. - There's another mouse in here, so this is the Logitech. - (tsks) Sometimes you just gotta like close your eyes. - Matches my whole color setup. There's another mouse in here, so this is the Logitech G703, and it's a gaming mouse. And I switch over to-- - So three cuts, one sentence. - This mouse when I'm playing games but. And yeah I hope you guys enjoy this video. Thumbs if you liked it, subs if you loved it. I'll see you guys next time. - Bam! Cold hard four minutes and 27 seconds. With nothing, with no Dave2D intro. Let me let him know. Four minutes and 27 seconds. Now with this particular project, one idea I had in mind right now was that because there's no sync or anything, what I think I might do is bounce this as one file. That way when I bring in the music and the B-roll, instead of worrying about the audio being connected to the video, I just have one file. Sometimes I'll do this when I'm on the road taking something on my MacBook Pro. I'll chop a talking head, do the color, do the sound, and that way I just have what I need instead of all of the unnecessary stuff. I know it's not necessary for this. But I'm just gonna see what that workflow looks like. So let's try that. I'm going to. Nope I wanna bounce, not import. Movie, let's go ahead and try to go into I'm going to the Rendered Movies Folder. We'll go High Quality. It's gonna be amazing when you can do ProRes on this stuff. Like that'll be the day. So, let's go and hit Export. Alright, okay, there we go. So I already have that into Rendered Movies Folder. What I'm going to do is, let's go ahead and actually create a backup of this one. So we're gonna duplicate it. And we're going to. I'm a choose a Command + A. No, that'll delete everything. Alright, we got that blank slate. Here's the bounced file. And again, the purpose of this was just so I can have the audio melded with the video, and I'm not gonna worry about that. I can just throw in some music and just finish this guy up. Now, what I'm most excited for is when the music comes into play because there's this track that's super, it's not Dave2D. He's never used it, but I heard it and just Dave's calm voice with this track I think is just gonna be like. So we got the Dave2D folder. We got the Dave2D intro. So I'm gonna drop that in. Now, now's where the Dave2D video kinda starts to come together. Let me see, what I wanna do is actually bring this back up. Because in the original project, I actually muted that main one, so I don't want that in this case. - Hey, how's it going? Dave2D here. So if this video, looks-- - Alright, so. Here's the Dave intro. (smooth R&B music) What I would like to do is see if we can actually mute that. And then let the background track do that. So I'm a tighten that up a little bit. - Hey, how's it going? Dave-- - That is a clean, clean, clean cut. This track right here. I just, I wanna here Dave's voice over it. (ambient guitar music) Can you hear Dave's voice over that? Dave2D here. Today I'm gonna give you the most soothing voice on YouTube and talk to you about graphs and benchmarks and give you the most dense information you'll ever see with beautiful colors and lovely closeups. (laughing) I'm excited to see it with the intro. (ambient guitar music) - Hey, how's it going? Dave2D here. So if this video looks-- - Yeah, I'm gonna cut that off a little bit. Give it a little bit of a mini-cut before. (ambient guitar music) - Hey how's it going? Dave2D-- - Yeah, that's like the, that's the feeling right there. (ambient guitar music) - Hey, how's it going? Dave2D here. So if this video looks and sounds and-- - 'Kay, so that I think. I'm feeling that. Sorry, Dave, I'm gonna make the executive call on that one. I like that over your voice. It just works. What I'm gonna do here is actually. Maybe I'll bring the volume of that down just a little bit, so it's not like a huge difference from when we bring it in. So it's not a huge difference when we kind of bring it down with the voice or the narration. So I'm gonna start at negative three decibels. (ambient guitar music) - Hey, how's it going? Dave2D here-- - Create a little marker. - D here. So if this video looks and sounds and feels a little bit different, it's because there's something special going on. If you're-- - Yeah, I'm like, it just makes me happy. The calmness. A little marker. Bring that down a click. Let's see how that feels. - You're interested, follow my Twitter. In a couple days, you'll find out why, but-- - I feel like Dave's videos really aren't like super music-driven. - Behind me is the computer setup that I used most of in 2018. So I'm gonna start it with the hardware and then kind of go into the details of it. The laptop that I used the most this year was actually the Razer Blade 15. So this is a device that has a 144 hertz screen. Great for gaming which I did way too much of this year. - I kind of dig that, so like if we go like just from the beginning. Here the flow. I wanna do some sort of montage-y intro for Dave, but it's just not. (ambient guitar music) - Hey, how's it going? Dave2D here. So if this video looks and sounds and feels a little bit different, it's because there's something special going on. If you're interested, follow my Twitter. In a couple days, you'll find out why. But behind me is the computer setup that I used most of-- - Maybe we'll make that a little bit of a less drastic. So I'll give him some more time. - If you're interested, follow my Twitter. In a couple days, you'll find out why. But behind me is the computer setup that I used most of in 2018. So I'm gonna start it with hardware. - Okay, so that'll be the point where things just. It'll come down to that point. So, now it's time to start laying some, some B-roll. I know just from shooting everything, we got some good Dave shot's in here. Look at that man! How could you not like that face? Look at that guy. He looks so happy in that Poke Ball. (clicking) Alright, let's get to the. I know I want one particular shot. Now, I think I did something stupid here. Because I bounced the original file, I don't have any of that color graded stuff which I wanted to just copy and paste as a base point to this B-roll 'cause I think for the most part it should match. So I wanna see if you can actually go within Projects and actually see if you can copy and paste attributes. So that would be cool. So what I'm gonna try and do is actually copy attributes from the previous file. Option + A, Copy, and then see if I can paste those in the new file. Here. Option + A, paste. Ooh, it works, so that's pretty clutch. You can, again, paste attributes from a previous project and then apply them to a separate project which I think is cool. - Only Twitter in a couple days, you'll find out why. But behind me, is the computer setup that I used most of in 2018. So I'm gonna start it with the hardware and then kind of go into the details of it. The l-- - Cut, Command + P. The main reason why I did that was just in case there were points during the video where I wanted to cut and intertwine maybe like mini-music montage. That was the reason for bouncing. Unnecessary, but it was just one way to slim things down and one less thing to worry about. - Laptop that I used the most this year was actually the Razer Blade 15. - Man, Dave just will make anything sound cool. I want that laptop now. - Came in Mercury Silver or mer-- - Okay what I think might help this one too is the, what's also maybe mildly bugging me is the composition of this one. So I think if we just maybe bring that in a little bit this'll kind of lessen the affect of it not being as stable. Let me try that. - [Dave] Just liked the way that it felt. And when it came in Mercury Silver, Mercury-- - Like that feels better. That feels better. - But behind me is the computer setup that I used most of in 2018, so I'm gonna start it with the hardware and then kind of go into the details of it. The laptop that I used the most this year was actually the Razer Blade 15. So this is a device that has a 144 hertz screen. Great for gaming which I did way too much of this year. Great for video editing, and the thing is I had access to a lot of other laptops, but I actually went with this one the most because of the design of it. I just liked the way that it looked. Liked the way that it felt, and when it came in Mercury Silver, or Mercury White, I forget what they called it. It's just, no-brainer, this was the laptop that I went with. - I'll use this for the intro for the monitor. And then I'll save the Overwatch for a little later. So I want that just like a half beat before he comes in with the line. - Super long battery life. The monitor is the 38UC99 from LG. It's a widescreen monitor, not super-col-- - This kind of shows off - Or accurate-- - More of the wideness I would say. - Color accurate enough. But I like the width of it. And I think the thing I like the most about this-- - Okay, blade there. Give Dave some talk time. - This monitor, is just how clean it looks. A lot of monitors that are big, just have like a black base and stuff. This is silver, white, looks clean. Now when it comes to smartphones-- - Alright so, let's go ahead and just straight up here. - Think the thing I like the most about this monitor is just how clean it looks. A lot of monitors that are big just have like a black base and stuff. This is silver, white, looks clean. - Personally, I'm not great at writing shots down in my head. I'm terrible with that. But at least I'll see them in my head. So with this, Dave did the talking first, and because of that, it allowed me to put myself in a place where I knew what shots I had to get afterwards. That way we can tell the story and get the coverage because a lot of the times, if you just go out and the talking is separate from the actual B-roll or the story it kind of feels disconnected in a way. So one tip, just always be cognizant of if you're gonna do your talking first, do your talking and make notes or vice versa. Be aware of what was shot and then implement that into your talking. - There's a lamp in the background, so this lamp was made by Xioami. It normally has a red power cord, but I spent some time to put nail polish on it. I don't think it looks great, but I just can't stand red. I felt like if it was gonna go in the scene, it had to be blue. And this is something that I wanted to do for a while, but I finally did it earlier today to make it match the whole setup. Now, in the drawer-- - Okay, I think that's the audio point where we can. Let me see what we got in the bank. I know, I have Dave's music in here, but let me see what we got. Pull back from that. I don't think any of these are gonna work with Dave. (bubbly electronic music) That's like the Stevie Status one. (louder, more intense music) That's too much. (woman laughing) Yeah. (high-pitched electronic music) Nope. Not Dave2D approved. (ethereal electronic music) (thumping electronic music) Imagine if we threw that in Dave. - [Man] Oh my God. Remember I have headphones. (rhythmic electronic music) (man laughing) - Oh, you got headphones on. (rhythmic tropical music) Dave can't get away with this. It's like a Latin drop, right? - [Man] Yeah. - It's very Latin. (man's voice offscreen) We'll see what, let's try it. - [Man] I'm digging it. - That whole setup. Now in the drawers there are some headphones. These are the B&O H8 I believe. I could be wrong, I'll link em properly below. And there's a blue drive here. So this is from Angel Bird. It's an SSD, super-fast, super-small, and I think it looks good. That's why I went with it. There's a white power bank from Anker, just clean looking white power bank. Anker, if you ever watch this, I would love to see this color in USB-C. There's also a knife in here, and the only reason why I have-- - That's where, that can't work for Dave. - [Man] That's like, Dave2D on vacation. - Yeah. (people laughing) Can't work for Dave, as much as I want it to. (rock music with strong beat) I'll go back to the Dave, the Dave mix. (lighter indie rock music) - There's also a knife in here, and the only reason why I have this knife is because it looks super-cool to me. White and blue, or kind of silver and blue, it just really matches my whole color setup. There's another mouse in here. So this is the Logitech G703, and it's a gaming mouse. And I switch over to this mouse when I'm playing games, but the battery life on this thing's really short so I don't use it for regular desktop use. But if you're interested, this is probably the best gaming mouse that is on the market right now in my opinion. Now, in the other drawer, with-- - (chuckles) Did you see his iPad drawings? - [Man] (laughs) No. - They're amazing. - [Man] Are they on there right now? - Well, I'm gonna pop em in there. You can see em for the final. I need Dave2D's art in my (man laughing) iPad review. - [Dave] And when you look at devices and they just are really nice looking, it's inviting to use, right? It just makes you want to use the device more, so I feel like Apple nailed the design element this year and just makes people wanna use this thing-- - I don't want this video to end, but it's gonna end right now. I'm almost done. Stupid idea number two. - Full setup is kind of like a snapshot - Almost, almost in the banks. - of the devices that I used the most of over 2018. And yeah, I hope you guys enjoyed this video! Thumbs if you liked it, subs if you loved it. I'll see you guys next time. - That's a genius ending. - Yeah, Dave's outro? - Yeah. - [Man] Super dope. I love it, I'll steal it when you're both gone. (men laughing) - [Young Man] I think we all did. - See you guys next time. - (whooshing) Add that little end slate. (smooth R&B music) I'll give him a little length at the end. - You guys next time. (smooth R&B music) - [Young Man] Can I guess at the length? - Huh? - [Young Man] Can I guess the length? - You wanna guess the length of the total video? - [Young Man] Yeah. - Okay, go. - [Young Man] Five minutes and 37 seconds. - Four minutes and 38 seconds. - [Young Man] Okay. - Because I wanna keep it like Dave2D, I don't throw like super montage-y B-roll everywhere. I gotta keep it true to Dave. - In the drawers there are some headphones. - I do like this track a lot though for the end. It's a disaster. I'm just kidding, it's amazing. Start to finish to edit was two hours, like an hour and 50 minutes. Yeah. Pretty much like eight seconds. I think it's probably gonna end up being around real time, the finished cut is four minutes and 38 seconds. I wanted to, like if it was me, I think I would have like thrown some montage-y B-roll, but that's not really like Dave2D. Yeah, it's not your style, so I kept it true-- Yeah, the only thing I tweaked was there was one track that I really liked that was super-ambient that I think went well with your voice. So I just-- One that I found. I don't think I would use it. But I used it with your intro splash. So I'll just like, I'll let you see the intro real quick, and then I'll export it. But, I don't even know what this looks like but. It's like. Let's see. I know. (ambient music) I have it plugged into my normal speakers because I like to edit to speakers. And it's just the iPad into this giant dock that gives me audio out and that allows me to charge it. So and then the Apple keyboard. The Pencil, I tried to challenge myself not to use it just because people were asking, what's more valuable, the keyboard or the Pencil. Yeah, it was just iPad and the keyboard, I-- Yeah. Yeah. (laughs) Yeah, it's crazy though, here we go. (ambient guitar music) - [Dave] Hey, how's it going? Dave2D here. So if this video looks and sounds and feels a little bit different. It's because there's something special going on. If you're interested, follow my Twitter. In a couple days, you'll find out why. But behind me is the computer setup that I used most of in 2018. So I'm gonna start it with the hardware and then go into the details of it. The laptop that I used the most this year was actually the Razer Blade 15. So this is a device that has a 144 hertz screen. Great for gaming, which I did way to much of this year. Great for video editing. And the thing is I had access to a lot of other laptops but I actually just went this one, the most because of the design-- - Yes, I had to stay true to you, and then-- Not real, I mean, I, whatever, I know we've talked about it. I don't really watch like all your Windows videos, but I watch enough of your videos to know your style. So like the ending worked out really well. We got your sick drawing in there. - [Dave] It just makes people wanna use it more. So that's probably why I've kept onto it. But that's basically this whole setup is kind of like a snapshot of the devices that I used the most of over 2018. And, yeah I hope you guys enjoyed this video. Thumbs if you liked it, subs if you loved it. I'll see you guys next time. (ambient pop music) - Bam. Oops, I don't want the camera off. Is the camera off? Good now? So, yeah, I'm gonna bounce it so it'll be done like in seven seconds and then, (people laughing) and then I'll send it to you. Sweet, thanks dude. (man's voice offscreen)",
    "transcript_keywords": [
        "Dave",
        "video",
        "kind",
        "Yeah",
        "Kevin Kenson video",
        "iPad Pro",
        "cut",
        "setup",
        "mouse",
        "bit",
        "time",
        "Dave voice",
        "Pro",
        "audio",
        "Razer Blade",
        "Kenson video",
        "Dave videos",
        "laptop",
        "start",
        "year"
    ],
    "transcript_entity_values": [
        "Four minutes and 27 seconds",
        "seven seconds",
        "DREVO",
        "Sweet",
        "Twitter",
        "Projects",
        "4",
        "2018",
        "smartphones-- - Alright",
        "two minutes",
        "Pencil",
        "Overwatch",
        "Toronto",
        "Angel Bird",
        "Windows",
        "over 2018",
        "three",
        "LastPass",
        "one",
        "R&B",
        "SSD",
        "12345678",
        "this year",
        "Kevin Kenson",
        "USB-C.",
        "the Rendered Movies Folder",
        "this at",
        "two",
        "Latin",
        "Twitter",
        "Rendered Movies Folder",
        "the iPad Pro",
        "Apple",
        "Latin",
        "three minutes",
        "first",
        "Marques",
        "YouTube",
        "Mercury Silver",
        "Anker",
        "Pretty much like eight seconds",
        "Sony",
        "Four minutes and 38 seconds",
        "LG",
        "a couple days",
        "Xioami",
        "Johnathan",
        "the day",
        "ProRes",
        "Mercury White",
        "Androids",
        "Kay",
        "2019",
        "a Space Forward",
        "MacBook Pro",
        "3",
        "144",
        "an hour and 50 minutes",
        "Audible",
        "two hours",
        "Copy",
        "LumaFusion",
        "the Apple Pencil",
        "about a minute and eight seconds",
        "15",
        "midnight",
        "Thumbs",
        "looks--",
        "The l-- - Cut",
        "iPad",
        "iPad Pro",
        "three minute",
        "High Quality",
        "LumaFusion Command",
        "LumaFusion",
        "four minutes",
        "Poke Ball",
        "four minutes and 38 seconds",
        "today",
        "Dave",
        "Logitech",
        "four minutes and 27 seconds",
        "Five minutes and 37 seconds",
        "a couple weeks ago"
    ],
    "transcript_entity_types": [
        "TIME",
        "TIME",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "TIME",
        "PERSON",
        "PRODUCT",
        "GPE",
        "FAC",
        "NORP",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "TIME",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "LANGUAGE",
        "TIME",
        "ORDINAL",
        "ORG",
        "PERSON",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERSON",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "TIME",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "FAC",
        "TIME",
        "PERSON",
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "TIME",
        "TIME",
        "DATE"
    ]
}