{
    "id": "Qju1aITk_WY",
    "title": "Why it took TWO YEARS to Build a Laptop Test Lab",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-07-04T17:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=Qju1aITk_WY",
    "category": "Science & Technology",
    "tags": [
        "ltt labs",
        "labs",
        "update",
        "linus tour",
        "game benchmarking",
        "automated benchmarking",
        "laptop",
        "gaming",
        "MSI",
        "RGB",
        "testing",
        "keyboard",
        "display",
        "ai",
        "studio",
        "titan",
        "raider",
        "performance",
        "battery life"
    ],
    "views": 1012284,
    "likes": 43118,
    "comments_count": 1622,
    "description": "Thanks to MSI for sending us the laptops and sponsoring this video! Check out the MSI laptop 20th-anniversary exclusive deals (save up to USD $1,000) at   Buy Titan 18HX with $800 off (limited time only) at  Save $300 (limited time) on Stealth 18 AI Studio at  Get your Raider 18 HX now at   Laptops are difficult to test thanks to how many components they have. After just two years, the lab is confident in their methodologies and were so close to being ready. Come check it out.  Also check out our LABS website here   Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   GET A VPN:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:33 Step 1 1:07 Endurance Test 2:28 Why LABS 3:28 Laptop Weight Classes 4:50 Gaming Benchmarking 7:29 Thermals 9:13 Noise Test 10:42 Speakers 11:02 Display 13:26 Keyboard 13:55 WiFi 14:30 Outro",
    "description_links": [
        "https://msi.gm/SC643209",
        "https://msi.gm/SDED48BD",
        "https://msi.gm/SBE2D81D",
        "https://msi.gm/S164BCDD",
        "https://www.lttlabs.com/",
        "https://linustechtips.com/topic/1575619-testing-laptops-properly-is-really-hard/",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "http://www.piavpn.com/linus",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "Displays, performance, battery life, and so much more. Laptops are one of the most complicated product categories to test because until you can evaluate every individual part, you can never hope to see the whole picture. Which is why it's taken us Two years to nail down a comprehensive test suite so strap in with some help from our sponsor MSI who provided some Test subjects for this run-through and by the time we're done You're gonna know how our labs team can help you avoid the craptops and find yourself a slaptop. Shipments typically arrive in the afternoon which leaves us only a few hours to kick things off We start with a quick physical to make sure that what we got matches what it says on the tin and to clean out any pre-installed garbage like McAfee or Norton We went back and forth on this practice quite a bit and ultimately what we decided was that it was best for us to test the hardware without it being influenced by performance sapping bloat and also sometimes it would falsely identify our Markbench automation software as a virus, so... Now in a perfect world These are fresh from the factory, but every now and then we'll get a review sample that's been passed around, so we'll do a full system reset, then we'll write down the default power profile before changing it to the most battery economical mode, in this case, super battery. Then we chuck it into our 20 degree environmental test chamber, fully charged, and we go home to rejuvenate our mortal shells. Endurance testing typically needs to run overnight because it can take a very long time depending on the system. We use 720p YouTube video playback at a usable but fairly dim 200 nits with 100% display scaling, and we make sure to turn off any keyboard RGB for our endurance test. Hardware info is used for logging, which we found is lightweight enough to only negligibly impact our tests. Then we pull it out, dead as a doornail. Man, this Stealth 18 AI Studio is smaller than its name, especially when you factor in the Core Ultra 9 185H and RTX 4080 in here, sheesh. Now these sponsored MSI laptops are just for demonstration purposes for this video. We're gonna be publishing our independent, non-sponsored test results at lttlabs.com. The reason we test like this isn't because we don't trust manufacturers. I mean, we don't. But not necessarily because we think they're all liars. Sometimes they are, but even the best intentioned manufacturers rarely agree with each other on how to test their devices. And if you dig into the fine print, you'll find all kinds of interesting choices, like nigh unusable brightness levels, disabled wireless connectivity, or a battery life test where they do nothing but display a desktop background. That's why we created our own set of criteria that we feel the average person would agree represents, sure, economical, but actual real-world use of the device. We also have a second test to give you guys a range that looks at how well it'll handle a full stress situation on top of our maximum endurance test. By the way, in the future? Once we get our PAM, or Power Analysis Module, we'd like to incorporate charge times, as well as discharge times. Speaking of charging, while it's getting re-energized, we determine what sort of weight class our laptop sits in. You'd think that we could do this with just specs, but without going on a two-hour rant, we can't. So, what we do is we pop it back into the Out-of-Box Performance Mode, and make sure that the Windows Power Mode is set to Best Performance for consistency's sake. After that, we run a quick... 1080p Total War Warhammer 3 benchmark, which uses a good mix of CPU and GPU that we can use to determine what tests we should bother with. For example, if we're looking at a netbook that scores under 20 FPS or just straight up DNFs, we'll focus on lighter esports titles rather than wasting time on Cyberpunk. In the case of the Titan 18HX, with an Intel Core i9-4900HX, 128GB of DDR5 memory, and an RTX 4090 mobile GPU, we'll be looking at numbers so high... We can assume that Dota 2 runs fine and move on to other things. It also lets us know if something appears to be faulty. For instance, we test a laptop that we think should be somewhere in the heavyweight or middleweight tier, but ends up performing more like a featherweight, then before we do any more rigorous testing, we'll dig around and find the root cause. Sometimes they're from storefronts like AliExpress, and they just plain suck. Sometimes it's old stock with dried out thermal paste, and then sometimes just a really slow laptop. Either way, it gives us a really good idea of what to expect. Once the unit's recharged, we'll do a couple of quick battery stress tests before moving on to gaming. Max brightness refresh rate, keyboard RGB on full blast, you know, whatever the maxed out power mode is, the winks. We'll hit it with Prime95 for CPU only devices, as well as a combustor workload for a simulated gaming load on our gaming laptops. Then comes our suite of gaming benchmarks, courtesy of Markbench. This automated system runs what we call harnesses, which are created on a per-game basis using either canned benchmarks that are built into the game or our own custom playthroughs. It gives us reliable, easily graphable data and what's cool is it can even handle some productivity tests, like Cinebench 2024 and PugetBench's Premiere Pro and Photoshop benchmarks. 3DMark's storage test and UL Procyon Office productivity aren't in Markbench yet, but we are working on them. And together, all of these numbers give us a clear picture of the machine's performance, both in gaming and in general usability. This is all done with the fans running in... Whatever profile they're set to out of the box, and the goal here is to record the typical non-tinkerer end user experience. Now we have observed cases where we might get a few more FPS with the cooling system cranked 211, but what we suspect is that most people want their laptop to stay firmly planted on the table instead of taking off and hovering. Though, if the fans happen to creep up to uncomfortable levels on their own, well hey, that's just part of the manufacturer's design. It's worth mentioning here that non-battery performance testing is currently performed out in the open in the lab, not in the environmental chamber. It's not as strictly managed, but it is still a controlled thermal environment thanks to our central HVAC system, and it sits around 21 degrees Celsius. For an example of what some of our testing data might look like, here's some runs on our Titan 18HX from MSI at 1080p, 1440p, and 2400p. Pretty impressive, thanks at least in part to MSI's OverBoost Ultra, which unlocks a whopping 270 watts of total system power. And things get even more interesting if you look at CPU-only tasks like Cinebench 2024. Without the GPU sucking up valuable resources, our CPU rocketed up to 200 watts of power consumption, giving this machine very respectable numbers for a laptop chip. I mean, it's hard to quite achieve desktop performance in a... portable form factor, but this shows about how close we can get. At what cost though? Let's head back to the environmental chamber and talk about heat. Back at the chamber, after fighting with Lucas on who gets to use it for the day, we make sure that our machine under test is plugged in for maximum performance, and then we run it through a series of stress tests with 10-minute breaks in between so it can cool off. Currently we use a set of 15-minute... thermal load tests using Cinebench for raw CPU, Furmark for raw GPU, and then both a F1 23 loop as well as Combuster's GL-MSI-02 PhysX CPU set to medium for both a real world as well as synthetic combined load test. With that said we are still experimenting to determine the ideal methodology here. We know that there are power viruses that can run the components hotter, but no one in their right mind is finding new prime numbers of the laptop. So leave a like if you think that the current system is good, or a comment if you think you have other ideas. Looking at our results, modern Core i9 mobile chips can get hot, and our Titan 18HX is no exception even with its vapor chamber cooling design. However, in modern devices that are basically designed to throttle, the more important metric to look at is sustained clock speed which we report on a graph that looks like this. For gamers, a combined workload like our F1 23 loop is a better representation of how the cooling system is going to handle a typical gaming load. Now one step that we'd love to add in the future is a set of thermal imaging shots from a FLIR camera while any device is at its peak thermal load. This would tell us whether all the heat is sailing comfortably out of the vents at the back, or whether it's being conducted through your poor delicate fingies. Give us time though. Another two years? Who knows? Anywho, speaking of, with all the design delays, not to mention permit delays, our full-fledged Anechoic chamber is gonna be a while. So we built this quiet room as a placeholder. Now you guys know from experience that some devices can practically scream in pain as they try to stay cool. So we're gonna be using this to both test devices and speakers. And what's cool is even in its current temporary state, it's so quiet, nobody can hear me scream! AHHHHH!!!! Oh, that's not how it works, Linus. It is not how it works. You told me I could scream in here. Yeah, but I can hear you just fine. Uh, uh... Look, Gary! Arc! Go! My arc! My arc! There are still a few more things that we need to do to get our noise floor lower, but we're currently measuring about 23 decibels in this bad boy, which is low enough that we can comfortably evaluate under-load acoustics for all but the quietest of devices. Our mic sits roughly two feet from the screen, which is about where someone would be using a laptop. And then we look at as much of the fan noise curve as we can, depending on the available operating modes. We're not going to be actually publishing numbers from here yet. This foam is just some temporary crap that we ordered from Amazon. This is garbage. We're going to be replacing it. And we have some work to do on our methodology, but we're going to make an announcement once we change out to both the finished version of this chamber and the full one. Moving on to speakers, our Stealth Studio here has a six-speaker surround sound system that's tuned by DynAudio with two pairs of dual force-cancelling woofers. That's a fancy way of saying that it should look pretty good on our testing mic. Speaking of looking good, that's why our team here wears only the best merch from lttstore.com, like these new Labs Phase Hoodies! Next up is my favorite part, display testing. For laptops, it's almost exactly the same as testing any other display. So we hook up our Stealth 18 AI Studio to the network in a darkened room like this one and launch CalMan Client 3, while another laptop, right here, runs CalMan Ultimate from Portrait Displays. We then carefully position our CR300 and CR100 colorimeters. These guys measure 10% window-sized color swatches to check for accuracy, color gamut capabilities, and brightness. By the way, you might have heard us say... this display has an average Delta E2000 of 2 or 3, or something along those lines. Well, while that's great for measuring SDR content, more and more displays are featuring proper HDR or high dynamic range. So, we're in the middle of transitioning over to Delta E ITP to paint a better picture of what that experience looks like. Anyway, that whole conversation is well beyond the scope of this video. For now, testing is done in this office upstairs where we've hung some black Duvetyne and blocked the automatic light sensor with paper and tape. This is what it looks like without any of our lights turned on. Eventually, the plan is to have a full media room where we'll test displays and put some couches, a big projector for some subjective audio evaluation as well. Rome wasn't built in a day. Beyond color accuracy, gamut and brightness, we use an LDAT as well as an OSRTT to measure response time and latency whenever supported. We take Pursuit Motion photos. Using SmoothFrog to check for ghosting or inverse ghosting for subjective analysis. And if there are local dimming zones, most common on mini-LED displays or an OLED where every pixel is a dimming zone, we calculate how many there are and take a look at how much bloom they cause. Once the testing is complete, we're able to spit out indecipherable numbers like these that some of you have asked us to explain. Let's use the 4K 120Hz mini-LED that's on both of our demo machines to explore brightness. Our Stealth 18 AI studio hit around 1,100 nits of peak brightness in a 10% window in Gamer Mode. That means that you can expect a high contrast and poppy HDR experience as dimming zones light up for flashes of light and explosions while other zones in darker parts of the scene stay dim. The total nits value indicates how bright those spots are, with a higher value meaning a brighter image. It goes deeper than that, just like color accuracy goes deeper than \"smaller number better.\" But to learn more, you're just going to have to stay tuned for a Tech Quickie. MSI also wanted us to test the ultra-low profile mechanical keyboard on the Titan 18HX, but due to some setbacks, we can't quite test laptop keyboards yet. We can get an accurate scan, and our robot works great now. That's like 90% of the battle. But our logging software runs on a separate device. So that's great for standalone keyboards, but we still need to develop a way to set up low-latency input pass-through. Rome built, etc, etc. Stay tuned. Same goes for our EMC chamber from Raymond EMC. We expect to be able to test Wi-Fi sometime in about Q3, but with that said, Wi-Fi 6 and 6E have already been a substantial improvement over previous versions, with stable and fast connections being pretty affordable these days, and 7 is even stronger. So it's relatively safe to say that if you're buying a device with Wi-Fi 6 and above, you're probably going to be okay for typical web browsing and video call use. Ah, barring any annoying driver issues. Media tech. Excuse me, sorry. *cough* I know this whole thing has been a long time coming and the videos on ShortCircuit might not go into enough detail for some of you, at least not yet, but that is where LTTLABS.com is going to come into play. The site is up, it's getting regular content updates now, and the goal is to have every product that comes into our warehouse go through our lab for testing to determine whether it's worth your hard-earned money before it makes it any further. Massive thanks to MSI for sending over these guinea pigs and for sponsoring our efforts to keep them honest. Ha ha! We're gonna have all the laptops that we showed off today linked in the description down below, as well as the LTT Labs website. Go check it out and leave some feedback for our team. Now, based on MSI's usual feedback, they probably want some more screen time for their devices, so... Here we go! Whether you need the ultimate gaming and engineering laptop or a portable desktop replacement, MSI's Titan series devices have got you covered. A little too much power for you? Well, look no further than their Raider gaming laptops, or for something smaller that still packs a major punch, try the Stealth 18 AI Studio, complete with the latest Meteor Lake processors from Intel. You can check out all of these at the link in the video description. Thanks for watching. If you guys enjoyed this video and you want to know more about how the lab is being utilized, maybe sign up on Floatplane. We've got an hour plus long video that goes over exactly that.",
    "transcript_keywords": [
        "test",
        "laptop",
        "MSI",
        "tests",
        "testing",
        "system",
        "power",
        "performance",
        "devices",
        "gaming",
        "Laptops",
        "chamber",
        "time",
        "test laptop keyboards",
        "CPU",
        "Titan",
        "set",
        "Stealth",
        "video",
        "endurance test"
    ],
    "transcript_entity_values": [
        "one",
        "LTT Labs",
        "Norton",
        "20",
        "Raider",
        "4080",
        "Pursuit Motion",
        "Floatplane",
        "RGB",
        "Max",
        "about 23 decibels",
        "HVAC",
        "10%",
        "chuck",
        "3DMark",
        "GPU",
        "Raymond EMC",
        "SDR",
        "21 degrees Celsius",
        "two-hour",
        "Cinebench",
        "Furmark",
        "FPS",
        "Combuster",
        "a day",
        "Meteor Lake",
        "Wi-Fi 6",
        "GL",
        "7",
        "LDAT",
        "CR300",
        "Linus",
        "the day",
        "Intel Core",
        "4900HX",
        "PugetBench",
        "128GB",
        "Power Analysis Module",
        "Premiere Pro",
        "SmoothFrog",
        "AliExpress",
        "2400p",
        "Rome",
        "MSI",
        "FLIR",
        "Amazon",
        "DynAudio",
        "200 watts",
        "Two years",
        "the Core Ultra 9 185H",
        "Markbench",
        "Titan",
        "4",
        "Lucas",
        "Wi-Fi 6",
        "Q3",
        "EMC",
        "CPU",
        "six",
        "211",
        "Delta",
        "Gary",
        "Intel",
        "OSRTT",
        "Stealth 18 AI Studio",
        "DDR5",
        "90%",
        "270 watts",
        "ShortCircuit",
        "only a few hours",
        "1080p",
        "around 1,100",
        "100%",
        "3",
        "18",
        "Markbench",
        "Gamer Mode",
        "Wi-Fi",
        "two",
        "OverBoost Ultra",
        "Duvetyne",
        "these days",
        "roughly two feet",
        "6E",
        "CalMan Client 3",
        "second",
        "McAfee",
        "Another two years",
        "today",
        "4090",
        "PhysX",
        "2024",
        "UL Procyon Office",
        "AI Studio",
        "200",
        "Total War Warhammer",
        "15-minute",
        "Delta E ITP",
        "2",
        "F1 23",
        "10-minute",
        "Core"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "LOC",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "FAC",
        "NORP",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "FAC",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "TIME",
        "ORG",
        "CARDINAL",
        "LAW",
        "TIME",
        "ORG"
    ]
}