{
    "id": "qlzvOEhOuRM",
    "title": "Moto Z3 Play Review: The Phone With A Mod In The Box",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-07-07T15:52:14Z",
    "video_url": "https://www.youtube.com/watch?v=qlzvOEhOuRM",
    "category": "Science & Technology",
    "tags": [
        "moto z3 play review",
        "moto z3 play mods",
        "moto z3 review",
        "moto z3 force review",
        "moto mods",
        "moto mods 2018",
        "mrmobile",
        "michael fisher",
        "android central"
    ],
    "views": 507415,
    "likes": 11112,
    "comments_count": 846,
    "description": "This video brought to you by TunnelBear. (Rawr!) Get 59% off a 2-year TunnelBear VPN plan using MrMobile's exclusive link:    [Moto Z3 Play Review]  You know whats cooler than a smartphone that lasts all day long? A smartphone that lasts all day long  and still has 80 percent battery left at bedtime. Is that enough to sell you on Motorolas Moto Mod lifestyle? Lets find out in the MrMobile review of the Moto Z3 Play!    [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S MOTO Z3 PLAY REVIEW]  MrMobile's Moto Z3 Play Review was produced following six days with a Moto Z3 Play review device provided by Motorola. The device was running prerelease software and was tested on T-Mobile US (via Project Fi) in Massachusetts and Connecticut, USA.   [PRODUCTS IN THIS VIDEO]:  Moto Z3 Play [Amazon]:    [MUSIC]  Stir Crazy by Tonemassif, available at Premium Beat:   Days and Days by Eternity Bro, available at Premium Beat:   Skyrocketing by Vincent Tone, available at Premium beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "http://click.tunnelbear.com/aff_c?offer_id=76",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/4r0",
        "https://www.premiumbeat.com/royalty-free-tracks/stir-crazy",
        "https://www.premiumbeat.com/royalty_free_music/songs/days-and-days",
        "https://www.premiumbeat.com/royalty-free-tracks/skyrocketing",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] You know what's cooler than a smart phone that lasts all day long? A smart phone that lasts all day long and still has 80% left at bedtime. Is that enough to sell you on Motorola's Moto Mod Lifestyle? Let's find out in the Mr. Mobile review of the Moto Z3 Play. (upbeat music) Every year since 2016, Motorola has unveiled another few Moto Z smart phones and each year the geek in me has been very grateful for the excuse to dust off my collection of Moto Mods and slap 'em on the back. This is the last model year the company promises to support these magnetic accessories and the pace of new mod releases has slowed, accordingly. Some crowd funded concepts like the Walkie Talkie never materialized. While the full qwerty keyboard is so delayed I've just given up on it. But hey, that Polaroid photo printer made it to market and even if you're not into the quirky stuff, the catalog of mod's as it is, is really excellent. The JBL Sound Boost 2 is just as loud and bassy as any Bluetooth speaker of a comparable size and it's way simpler to connect. And if you need a jolt in a jif, Motorola's Turbo Power Pack ramps up the milliamps just as quickly as an external power bank and with a lot less bulk too. I've sometimes criticized the Moto mod approach because it forces you to carry a bag full of accessories to make the most of your phone. But honestly, even if you told me I could only have these two, I'd still be happier with the Moto Z3 Play than with another phone and comparable accessories. Moto mods do make sense. Normally, this is where I'd pivot away from mods to start talkin' about the phone, but this year, Motorola has done something I've wanted it to do from the start. It's bundled a Moto Mod right in the box. It's not the flashiest, just a 2,200 milliamp hour battery. It doesn't even have quick charge. But it's the reason this phone is the new endurance champ. I left the mod attached to my phone in efficiency mode and went out for a 12 hour day of Goggle maps navigation, hotel hunting, and endless photos and videos on the 4th of July. The Moto mod battery lasted all day, ticking over to empty just as I came home. Be sure you're hearing me here. That's just the mod's battery. The phone still had 80% power left in its internal battery, which could have kept me goin' for another 12 hours, thanks to the efficient platform it's built on. But a long lasting phone is only a good thing if you enjoy using it. And I can only say that about half the time here. Moving the fingerprint sensor to the side is not a deal breaker in itself, but it is annoying. The phone constantly buzzes when you're holding it as it gets partial reads of your fingertips. And splitting off the power button into it's own thing on the other side of the phone wasn't the way to go. It's just as awkward as I feared. Also, I feel like the Z3 to play has more bugs than previous Motorola's. Those custom gestures to launch the camera and flashlight are still great but they're less reliable now. One day they stopped working altogether along with the fingerprint sensor. A restart fixed the problem. I should note that I'm running pre-released software. I've reached out to Moto for comment but other bugs have been going on a long time. Like that weird way Moto display sometimes flickers on and off even when nothing appears to trigger it. And I'm a Bluetooth guy so this doesn't bother me, but some will lament the loss of the headphone jack. There is a dongle in the box as a concession. No conversation about compromise on a Moto Z would be complete without clickin' into the camera. To be fair, this is a mid-range smart phone so mid-range photos shouldn't be a surprise and that's thanks in part to the mid-range silicon, which can't quite match the image processing chops of higher end chips. Now, Moto does a lot given those limitations. And my favorite new feature is the cinemagraph mode. Now if you weren't using a Windows phone back in 2013 with the other seven of us, a cinemagraph creates this kind of weird melange of photo and video. You can do the same thing with third party apps but this works much better than the top result I found in the Play Store. Just to find that second camera on the back, portrait mode does a passable job of isolating you from the background. The usual edge detection issues aside. And out in the optical onslaught of the mid-summer sun both front and rear cameras pop out shots you won't be ashamed to share. Peep a little closer at those pixels and you start to see the lack of sharpness. The tendency of HDR to wash out the highlights as it tries to bring up the shadows. The very not good low light performance. It's still a go if you don't mind tweaking your photos to death. This one was quite popular on Instagram once I dropped the lows, upped the saturation, applied some luxe, added contrast, added structure, brought up the shadows, and the highlights, and applied a little vignette. If that's not a workload you wanna have very often, well this probably isn't the camera for you. Most frustrating, Moto keeps adding features to the camera but botching the execution. I've never gotten spot color to work well. It's either too little or too much. Text scanner gets full by even moderately fancy fonts. Cutting yourself out and replacing the background, you get the idea. I'm gonna get ready to take us out and I'll let you gaze on some non-stabilized 4K video footage while I do so. (upbeat music) When you combine the underwhelming optics with the silvering absence of Verizon wireless in the launch lineup this year, this phone's unlocked price of almost $500 has an unfortunate effect. It brings to mind the One Plus Six, which outclasses the Z3 Play in almost every metric for only $30 more. Motorola does distinguish itself in the details. The hydrophobic coating on the internals to guard against water damage, the excellent crystal talk noise reduction that I've been praising for six years, the gesture navigation that's more intuitive than anything else on Android, the way Motorola gets fast responsiveness from a mid-range spec sheet. It's all great but as much as I value those details, they don't add up to quite enough to make this phone stand out. Get the Z3 Play if you've got a stack of mods at home that you don't wanna abandon or you need a phone that works on Sprint and Verizon and packs the best staying power on the market. Do yourself a favor and get it through Amazon for $450. And maybe, if Motorola had a better track record of supporting it's phones with Android updates, I could call it closer to even. As it stands, I'm forced to agree with the vast majority of the folks who responded to my casual poll on Twitter. If you haven't yet bought into the mods, the Z3 Play doesn't really bring enough to make you wanna change your mind. Hopefully, the next thing out of Chicago will do a little better, and I'll tell you a little more about that after we pay the bills. Stick with me, won't you? This video is brought to you by TunnelBear. True story, it's the first VPN I ever used and I'm genuinely glad to sponsor it. TunnelBear lets you browse the web safely on a public hotspot which I'm on frequently. And it lets you do it with the flick of a switch. TunnelBear even opened itself up to an independent audit to prove it's keeping its security promises. Mainly though, gotta be real, I'm here for the mascot. (bear growling) Help support Mr. Mobile, secure your browsing for the next two years, and save almost 60%, hit the links in the description to secure your special deal on TunnelBear. And thanks. Folks I don't know what Motorola's planning to unveil at its Chicago headquarters on August 2nd. I just know the company's promising a whole new way to connect and that it's invited a bunch of media, including yours truly to attend. Make sure you don't miss it and subscribe to The Mr. Mobile here on YouTube. Of course, we got a lot more videos between here and there, so until next time, thanks for watching and stay mobile my friends.",
    "transcript_keywords": [
        "Motorola Moto Mod",
        "Moto Mod",
        "Moto Mod Lifestyle",
        "Moto",
        "phone",
        "Moto Mods",
        "Moto mod battery",
        "Motorola",
        "smart phone",
        "Mod",
        "Moto mod approach",
        "Motorola Moto",
        "Play",
        "Mods",
        "midrange smart phone",
        "Motorola Turbo Power",
        "mod battery",
        "Mod Lifestyle",
        "smart",
        "year"
    ],
    "transcript_entity_values": [
        "third",
        "Instagram",
        "the 4th of July",
        "the Play Store",
        "Z3 Play",
        "Verizon",
        "Turbo Power Pack",
        "2013",
        "2016",
        "the Walkie Talkie",
        "all day",
        "six years",
        "2,200 milliamp hour",
        "almost 60%",
        "Goggle",
        "Moto",
        "450",
        "the next two years",
        "Mobile",
        "all day long",
        "this year",
        "Motorola",
        "mid-summer",
        "Amazon",
        "The JBL Sound Boost 2",
        "Moto Z",
        "almost $500",
        "first",
        "jack",
        "Moto Mod",
        "each year",
        "the last model year",
        "Moto Mods",
        "two",
        "4",
        "Chicago",
        "only $30",
        "Z3",
        "another 12 hours",
        "Polaroid",
        "second",
        "One day",
        "August 2nd",
        "a 12 hour",
        "about half",
        "Every year",
        "seven",
        "Twitter",
        "the Z3 Play",
        "Moto Mod Lifestyle",
        "TunnelBear",
        "Android",
        "Sprint",
        "YouTube",
        "80%"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "PERCENT",
        "FAC",
        "ORG",
        "MONEY",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "MONEY",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "TIME",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERCENT"
    ]
}