{
    "id": "Qpd1B_k5KKQ",
    "title": "Choosing The Best Battery Pack For Your Smartphone",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-08-19T19:36:28Z",
    "video_url": "https://www.youtube.com/watch?v=Qpd1B_k5KKQ",
    "category": "People & Blogs",
    "tags": [
        "best battery pack",
        "best power bank",
        "best external battery",
        "best smartphone battery",
        "power bank charger",
        "power bank 2016",
        "best battery 2016",
        "power bank for laptop",
        "smartphone battery",
        "mrmobile",
        "michael fisher",
        "android central",
        "imore",
        "windows central",
        "pocketnow",
        "android authority",
        "captain2phones",
        "battery",
        "smartphone",
        "anker",
        "oneplus 3",
        "mobile nations",
        "note 7",
        "aukey",
        "fonesalesman",
        "ravpower",
        "easyacc"
    ],
    "views": 211517,
    "likes": 7140,
    "comments_count": 456,
    "description": "Shopping for a portable battery pack in 2016 is a daunting challenge  but I've collected between twenty and thirty power banks in my time reviewing technology, and I've found that the secret to making the search a little less complicated is to focus on three key areas: safety, capacity, and speed. This video includes products that excel in each field, and some even marry the benefits of all three with that all-important bonus: novelty. Join me for the MrMobile Portable Power Pack roundup!   [SUBSCRIBE]     [ADDENDUM] I neglected to state that the ResQ battery is made from eco-friendly materials. While this doesn't entirely mitigate my concerns about disposable batteries, it deserves a mention.   [ABOUT THIS VIDEO]  Michael Fisher's Portable Battery Pack Roundup was produced using a mix of loaner devices and products purchased by Michael Fisher and Mobile Nations. Time of use ranged from one week to two years. No promotional consideration was paid by any vendor in exchange for being featured in this video.   [PRODUCTS]  EasyAcc Rugged Power Bank 20000   ANKER PowerCore Slim 5000   ANKER PowerCore 15600   RAVPower ACE 22000 Power Bank   RAVPower Turbo 20100 Power Bank   AUKEY 30000 Power Bank with AiPower Tech & Lightning Input   Fonesalesman QiStone+   Cheero Ingress Power Cube   RESQ Battery    [SOCIALIZE]         [MUSIC]  \"The Ballad of MrMobile\" (Mobile Nations, 2016)  \"Financial District\" by Olive Musique, available at Premium Beat:    [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/o",
        "http://mrmobile.tech/h",
        "http://mrmobile.tech/i",
        "http://mrmobile.tech/j",
        "http://mrmobile.tech/k",
        "http://mrmobile.tech/l",
        "http://mrmobile.tech/m",
        "http://www.cheero.net/usa/lp/ingress/",
        "https://digitaloffers.imore.com/sales/pre-charged-single-use-disposable-battery-for-microusb-pack",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.premiumbeat.com/royalty_free_music/songs/financial-district",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] Admit it, your smartphone doesn't last as long as you want it to. Whether you're marathoning Pokemon Go or running a mobile office, your phone battery is basically guaranteed to throw in the towel well before you're done. Today's solution for many is pocketable power packs, but not all batteries are created equal. So, which one's right for you? I'm Michael Fisher and I've got 10,000 of these things. Let me show you what to look for. (upbeat music) - [Michael] For me, the most important thing to consider in a power pack, is capacity. This is typically measured in units called milliamp-hours. If you have a modern iPhone, your built in battery is between 1700 and 2700 mAh, and most of today's Android flagships range from 2600 to 3600. So, let's keep it simple and assume your phone has a 3000 mAh battery. Buying a 3000 mAh power pack, then, should give you double the battery life, in theory. But, of course, life doesn't actually work that way. The act of charging a phone is not 100% efficient. Some energy is wasted as heat, thanks to something called line loss. Not all chargers offer consistent voltage. And many battery packs don't use the highest quality cells. It's pretty simple to combat this inefficiency. Get the highest capacity battery you can, given your price range and how portable you need the battery to be. Brand wise, RAVPower and ANKER stand out as companies doing a good job on the miniaturization front. The next most important thing is charging speed. Essentially, all modern flagship phones support some variation of quick charging, and more and more power packs are emerging to support those standards. For me, quick charging is non-negotiable. A power pack is much more useful if it can charge your phone while you're using it. Look for Quick Charge 3.0, if you've got an Android or Windows phone. It's most likely to give you the fastest charging rate and it's backward compatible with Quick Charge 2.0. Any of these will also charge an iPhone, by the way, for those, just look for a charger capable of putting out two amps or more, if you want it to charge quickly. It also never hurts to look for the made for iPhone sticker. Also, see if you can find a battery that supports quick charging on the receiving side. These packs have a lot of capacity, which means they take hours to top up, and Quick Charge really helps with that. There's a new charger due to hit the market called the iTron that advertises insanely quick top up times, but it hasn't yet hit the market. One nice thing about having such a breadth of options is that there's something for everyone. I picked up this charger because I love playing Ingress and I like the custom LED job more than I dislike the lack of quick charging. I got this one from Fonesalesman around the same time, because I've always been a fan of wireless charging. And not only can this top up a phone wirelessly, the pack itself can be recharged without a cable, too. If you spend more time in the woods than in the workplace, this pack from EasyACC offers a rugged housing, a built in flashlight, and water resistance, a rarity on power banks. Topping off the size and weight scale of my collection is this one from AUKEY, which also has a flashlight but ditches the water proofing for a crazy 30,000 mAh reserve. On the opposite side of the scale, the PowerCore Slim has a much smaller reserve, but it's thin and so stylish that it won the red dot award for design. And, if you're just looking for a quick top up, RESQ makes these little latch on pick me ups, obviously designed to be sold at gas stations and convenience stores. Given the worlds electronic waste problem, the idea of more disposable batteries is tough to get behind, but these are convenient, colorful, and cheap. In a pinch, I could see them coming in really handy. Finally, there's the nice to have options. If you're planning on having to charge more than ole device at once, many banks offer multiple ports. Some of them assign different amperage to different jacks, while others decide for themselves how much power to kick out based on which device you connect. Some companies make custom made battery cases that latch directly onto specific phones, which is less versatile, but sometimes more elegant. And, because we're talking about a lot of potential energy locked away in these things, it's always nice to look for a UL or CE mark for a little piece of mind. Research the brand you're buying from, too. It's no guarantee, sure, but mainly my point is to buy from legit companies with an established presence. The up shot, there is no single best power pack. Like smartphones themselves, the best fit for you will depend on what kind of user you are. But, picking one from the masses is a lot simpler if you follow the priority list of safety, capacity, and speed. Subscribe to be the first to see Mobile Tech videos just like this one, folks. Mr Mobile uploads twice a week. Thanks for watching. Until next time, stay mobile my friends.",
    "transcript_keywords": [
        "quick",
        "quick charging",
        "Quick Charge",
        "battery",
        "power pack",
        "charge",
        "power",
        "charging",
        "pack",
        "phone",
        "packs",
        "quick top",
        "marathoning Pokemon",
        "mobile",
        "mAh",
        "mAh power pack",
        "Michael Fisher",
        "top",
        "capacity",
        "supports quick charging"
    ],
    "transcript_entity_values": [
        "Today",
        "3000",
        "Android",
        "AUKEY",
        "10,000",
        "30,000",
        "RAVPower",
        "CE",
        "milliamp-hours",
        "hours",
        "RESQ",
        "3600",
        "Ingress",
        "Mobile Tech",
        "the PowerCore Slim",
        "Fonesalesman",
        "UL",
        "2700",
        "Mobile",
        "today",
        "iPhone",
        "One",
        "first",
        "Michael",
        "two",
        "iTron",
        "between 1700",
        "100%",
        "Quick Charge 2.0",
        "2600",
        "Pokemon Go",
        "Michael Fisher",
        "3.0",
        "Android",
        "ANKER"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "TIME",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}