{
    "id": "qPlRZaSKbPY",
    "title": "ZOMBIE EDITION SURVIVAL BOX",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-01-21T18:28:29Z",
    "video_url": "https://www.youtube.com/watch?v=qPlRZaSKbPY",
    "category": "Science & Technology",
    "tags": [
        "zombie apocalypse",
        "zombie",
        "apocalypse",
        "walking dead",
        "zombies",
        "knife",
        "knives",
        "survival",
        "edc",
        "gear",
        "sog",
        "kniv",
        "sweden",
        "unboxtherapy",
        "unbox therapy",
        "survival gear",
        "camping",
        "bushcraft",
        "tech",
        "survival kit",
        "blade",
        "technology",
        "tactical",
        "survival skills (tv genre)",
        "unboxing",
        "hunting",
        "kit",
        "everyday carry",
        "best",
        "axe",
        "carry",
        "spyderco",
        "kershaw",
        "survival knife",
        "bug out bag",
        "gerber",
        "wilderness survival",
        "prepper",
        "survival skills",
        "fishing",
        "backpacking",
        "backpack",
        "bug out",
        "kabar",
        "survive",
        "paracord",
        "bag",
        "fire",
        "knife (sports equipment)"
    ],
    "views": 4044394,
    "likes": 77143,
    "comments_count": 4518,
    "description": "Team Crispy LIVE -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://www.eventbrite.com/e/team-crispy-live-tickets-20744028949",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "- What's up guys? Lew here, back with another video, and it's another surprise type deal. It's a BattlBox, so it's gonna be survival type gear. And this one's a little bit different, because it says Special Zombie Addition on it. Before I jump inside this box, I want to give a shout out. Shout our to a special event, a live event that's happening in Las Angeles on February the 6th. Jack, is that right? February the 6th. It's called Team Crispy Live. Anyway, you got myself, you got MKBHD, you got John from TLD, you got Austin Evans, and you got Judner from UrAvgConsumer. We're gonna be on stage, I don't know what we're doing. I really don't, but we're gonna be there. And you're gonna be there. We're gonna shake hands. We're gonna try to entertain you. Will that happen? I can't make any guarantees. I say you just come down and say what's up. I'll put a link in the description so you can buy a ticket. They're like six bucks or something. If you're interested, click the link, come check it out, and come say what's up. Or hello. Or how ya doin'. Or how she goin'. Or, but this is an unboxing video because you are watching Unbox Therapy. So, let's do the damn thing, and as usual, we are greeted with the dry grass fire starter. When you're talking about survival, you're talking about fire. Huge component. The best thing about unboxing these boxes, it's like so many things. Oooh. Mora Kniv, or knive, without the E. Probably because it has something to do with Sweden. This is made in Sweden by appointment to HM, the King of Sweden. This message approved by the King of Sweden. This video sponsored, Jack put it in here somewhere. Sponsored by The King of Sweden. I'll bill ya later. Swedish King. (laughs) Blade of high carbon steel with an anti-corrosive black coating, robust sheath, and a fire starter. Broccoli, with a side of coriander, and finished with cayenne pepper. Whoa. Carbon steel made in Sweden. Can you see that, Jack? (whistles) Whew. I got to say, I think the King of Sweden, he's not messing around. Goes in there like that. This is the fire steel, kind of clips in there, and comes out. What do ya say, should we create a couple sparks? (metal rubbing) Whoa! Whew! (striking) Whew! Do it yourself zombie bracelet kit. Is this Walking Dead approved right here? This is obviously for putting the bracelet on. Oh, wow! Right inside there, that looks like another little fire steel. So they say there's 12 feet of para cord in here, you can use this for everything. What do we have here? It's another blade. This, again, we've got the para cord. You can see the skull on there. Oh, this is just a patch. A velcro patch. So you can, (laughs) that's gonna live there the rest of the video. Zombie Outbreak Response Team. Okay, I'm like a legit, I'm a General right now. Zombie apocalypse kit inside a sardine can. Compass, whistle, matches, first aid, razor blade, pencil, non-aspirin pain reliever. Not sure why it's important that it's non-aspirin. Reflective signal surface, fish hook, fishing line, duct tape, no paper, sugar, salt, gum, reclosable bag, antibiotic ointment, tea, safety pin, and alcohol prep pad. Seems really light for all that stuff. A hundred foot, seven-strand core para cord. That's just a huge hunk of para cord. Zombie survival can. In case of a zombie apocalypse, drink entire content to ensure speedy escape. Then fill the can with rocks, and throw the can at a zombie. We're having a little fun with this one. This one is obviiously a energy drink of some kind. If I do it, you have to do it. Here we go. (smacking) Not bad. Little sip. (whistles) Oof. Holy, it's got some weight to it. (bang) Whew! (banging) Yeah, all right. That's the real deal. A sheath, I believe. Jack, catch. Is this a poster? (makes a shooting noises) A little zombie head of some kind. It's a pretty uh, pretty fellow right there. Zombie tinder. Water proof, all weather fire. Never expires. Can be lit with a spark. Okay, looks kind of weird, too. Looks like zombie guts, look at that. Should we try and light some of this? Jack, we're gonna, this is gonna catch up to us one day. You know that, right? Here we go. Whoa! Geez, I didn't even get to the wick. That stuff really lights up, hey. Okay, we got the wick going now. So rather than sitting down there trying to maintain a flame, as you like put stuff on top of this, (blowing) I think I'm done now, for the day. All right, there you have it, another Survival Box Edition of Unbox Therapy. I'm not gonna do that. (laughing) All right, thanks very much for watching. I need to be careful, this is sharp as hell, Jack. Appreciate your viewership. If you enjoyed this content, make sure to leave a thumbs up down below, and I'll catch you in the next ep- What am I, look, I'm like. I'll catch you on the next episode. It's because the hands are involved. When the hands are involved and there's an ax in play, well that could make for a bad day. See that, you see what I did? Later!",
    "transcript_keywords": [
        "Sweden",
        "Zombie",
        "King of Sweden",
        "King",
        "Jack",
        "Special Zombie Addition",
        "fire",
        "para cord",
        "Whew",
        "Team Crispy Live",
        "Unbox Therapy",
        "survival",
        "live",
        "para",
        "video",
        "steel",
        "cord",
        "kind",
        "catch",
        "Las Angeles"
    ],
    "transcript_entity_values": [
        "the King of Sweden",
        "Lew",
        "this Walking Dead",
        "Mora Kniv",
        "seven",
        "Austin Evans",
        "Broccoli",
        "the day",
        "Swedish",
        "BattlBox",
        "first",
        "John",
        "Jack",
        "Zombie Outbreak Response Team",
        "TLD",
        "one day",
        "six bucks",
        "The King of Sweden",
        "the King of Sweden",
        "12 feet",
        "bill ya",
        "A hundred foot",
        "a bad day",
        "Sweden",
        "February the 6th",
        "Team Crispy Live",
        "Judner",
        "Las Angeles",
        "Compass"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "NORP",
        "ORG",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "DATE",
        "GPE",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "GPE",
        "ORG"
    ]
}