{
    "id": "QPwnjBVybsQ",
    "title": "Unicorn Cupcakes!!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-09-10T00:23:37Z",
    "video_url": "https://www.youtube.com/watch?v=QPwnjBVybsQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "rosana pansino",
        "unicorn cupcakes",
        "how to make unicorn cupcakes"
    ],
    "views": 301461,
    "likes": 8547,
    "comments_count": 836,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it going, it's Justine and today we are doing a part unboxing, part baking or decorating, depending upon what's in this box. My friend Rosanna, she does this really fun cooking series called Nerdy Nummies. She also makes really fun lifestyle videos and you guys know we've done tons of videos together. She also has a baking line, and this is kind of like the second iteration of the line. Last year was the launch and this is some new stuff in here, and I don't even know what's in here. So let's open it up and see. This knife is so incredibly sharp. It's also pink. I am so excited. All of her stuff is so well thought out, and so cute, and pretty, and practical. Let's see what we've got. Pink paper. These I'm actually quite excited about. So these are like cupcake tins, but she also makes them really pretty colors too. Do you guys know what this is? (chuckles) A poop cupcake tin. They call them swirls but let's be real, we all know what it really is. What else do we have in here? Oh my goodness. Speaking of poop, Swirl Candy Molds. This is just what everyone needs. I should make some of those for my next party. Oh Stamp Cookie Cutters. I've never tried these before so I'm excited to try that out. What's really cool though is 'cause like they basically will just stamp a little design onto your cookie. Everything looks so good! And look at this little matching, tiny little pan, to match the cupcake tin. What a great color palette. These are cute - Unicorn Cupcake Decorating Kit. Oh this is great. I think this might be what I wanna make because I feel like this is something that I can handle and probably won't be messed up. I always see all the incredible things that Ro makes and then I'm over here like, no, no, no, no, no, no, no, no, oh geez! These are little Unicorn Treat Molds. They'll probably make little like chocolate melts; all kinds of things in here. This is something I'm familiar with. So Ro and I did a baking challenge and we made princess cakes of each other. If you haven't seen the video be sure to check it out. Wow is that icing a freaking delight. - Isn't it great? - Wow! Oh these are so cute! So these are for icing and I love the colors. Purple is one of my favorite colors. This is a great color. We also have a little apron, oh and a hat! Say no more. I mean I'm gonna look so good. How do I put this on? I think I did it wrong. Yeah I definitely did it wrong. Everything always looks cute on Ro. (chuckles) Do I look good or what? I need to play around with the sizing I think. I feel like Ratatouille. Okay let's make something now. Unicorn Cupcake Decorating Kit; \"Everything you need to decorate 12 magical unicorn cupcakes.\" Let's see what's in here. Oh look at these. They're little unicorn candles. These cute little pastel sprinkles, unicorn ears. Look at them, the little eyes! Okay let's get some cupcakes made. Wow that was pretty magical. Oh my gosh they're so cute. These are adorable. This is such a cute pan. No I'm so sorry, I'm so sorry little cakes. I'm so sorry. Like I dropped the freaking pan. Some of these got a little squished. So I'm just gonna do like a simple little icing because everything is so organized now that I don't know where anything is. This is a professional cooking show. Extremely professional. We've got Ro's little bags. Jam some icing in these. I forgot to put the freaking tip in the bag. I'll just cut it. Clearly I already screwed this up. How could I forget to do the most important part? I think these are still gonna look beautiful. See I forgot to put a tip in this so let's just hope that this works out okay. I probably should've started from the outside and then worked my way around. Each one has a little bit of personality, just like people; some people have better ones. Let's, ear for you. I wonder if these are edible. Mm, they are. Can you hear me crunching? - [Videographer] Oh yeah. - Yeah I'm sorry. We'll put your ear over there. Okay let's put in the little unicorn horns. These are actually candles. I mean these are so easy to make that I can even handle it so that is saying something. Okay now I gotta put a little bit of sprinkles on them. Just a little bit, just for like a little, oh, yep. Alright well. I think I should've cut a smaller hole. Well I guess since we're here I'm just gonna use the whole packet. Here they are! Our little unicorn cupcakes. I actually had a lot of fun making these and this is incredibly easy. I mean pretty much everything that you need to make them is in the kit. You even get the little cupcake liners with the little eyes on it. I'll put a link in the description if you guys wanna check out this stuff from Ro's baking line. Now I'm going like put this in the freezer because I never wanna forget what a good job I did. Let me know if there's anything else you'd like to see me bake here on my channel, or even if it's non-baking related. What kind of videos would you guys like to see? Leave those in the comments below and I will see you guys in my next video. But I will only see you if you hit the bell because that's basically the only way that you'll be notified. Also be sure to subscribe and hopefully I will see you soon. Okay. That's, that's it. Ow! The funny bone is not funny! - [Videographer] To the, here. Vacuum right up to the lens. (relaxed joyful music)",
    "transcript_keywords": [
        "Justine and today",
        "called Nerdy Nummies",
        "Unicorn Cupcake Decorating",
        "Nerdy Nummies",
        "Unicorn",
        "Cupcake Decorating Kit",
        "put",
        "cupcake",
        "cute",
        "make",
        "Justine",
        "Unicorn Cupcake",
        "guys",
        "Cupcake Decorating",
        "series called Nerdy",
        "cute Unicorn Cupcake",
        "Decorating Kit",
        "cupcakes",
        "friend Rosanna",
        "cupcake tin"
    ],
    "transcript_entity_values": [
        "Unicorn Cupcake Decorating Kit",
        "Unicorn Treat Molds",
        "Swirl Candy Molds",
        "second",
        "12",
        "Rosanna",
        "Last year",
        "today",
        "Justine"
    ],
    "transcript_entity_types": [
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "PERSON"
    ]
}