{
    "id": "QQ9fCK4oWdg",
    "title": "Apple Watch Series 4 hands-on",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-09-12T21:53:35Z",
    "video_url": "https://www.youtube.com/watch?v=QQ9fCK4oWdg",
    "category": "Science & Technology",
    "tags": [
        "apple watch",
        "apple watch 4",
        "apple watch 2018",
        "watch os 5",
        "watchos 5 apple",
        "apple watch review",
        "apple watch vs",
        "series 4",
        "first look",
        "apple watch sport",
        "watch",
        "smart watch",
        "smartwatch",
        "apple watch 2",
        "apple watch 3",
        "apple event",
        "apple event 2018",
        "apple keynote",
        "new iphone",
        "iphone 10",
        "event",
        "apple 2018",
        "iphone 11",
        "what to expect",
        "2018 iphone",
        "2018",
        "hands on",
        "review",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "mkbhd",
        "apple",
        "verge",
        "the verge"
    ],
    "views": 1681366,
    "likes": 13457,
    "comments_count": 943,
    "description": "Apple unveiled its Apple Watch Series 4 line of smartwatches today and the changes are immediately obvious. Its the first major design overhaul of the Watch since its debut more than three years ago. The Watchs screen now goes nearly edge-to-edge, thanks to a larger display which also lets watchOS 5 show more information through Apples built-in app complications.  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey everybody. This is the Apple Watch Series 4. What you're looking at here is the new 44 millimeter version, so it's a little bit bigger. I've got it compared to my old Apple Watch here, so you can see that the screen is a little bit bigger. But also, more importantly, the screen goes closer to the edge. It's 30% bigger than it was before. Now, if this larger size isn't for you, it is also available in this smaller 40 millimeter version. So there you go. Those are the two sizes there. Now things that are new here besides the larger edge-to-edge screen is that the new larger screen allows you to do more things. So you can see that you can fit just a ton of complications on this thing. And they all can do stuff. So if I tap on music here. Go through music. And so you'll see, I'm scrolling on this digital crown. And the digital crown, this little wheel here, has been updated. And it has a haptic feedback to it now. You can kind of feel it when you scroll it around. There's just a little bit of a vibration there, which is pretty fascinating. It has a stainless steel casing and other things that are different, they've moved the microphone over to this side because they've moved the speakers over here and made them much, much louder. So it's more convenient for making calls. But of course the biggest deal with the Apple Watch are health features. And there are a bunch of new health features here. One of them, for example, is they can detect an irregular heartbeat. They can also tell you if your heartbeat is too low. And all new here, and the FDA has approved, an ECG. And so, there's sensors around the ring of the heart rate monitor and then also on the digital crown here. And so when you're wearing it, you should be able to just hold your finger on there. It'll read the sensor here and underneath. And you'll be able to get an ECG. Unfortunately that's not running on these models yet. Now there are, of course, new watch faces. So you can see these crazy complication-filled watch faces. But if we wanted to take a look at what else we got here, there's these cool vapor watch faces. So this shows you how cool the screen looks. We could even go, here's the fire. It is just super fire. Another thing that's new is fall detection. So if it detects that you fall down because you flailed your arms around, it is able to say hey, it looks like you've fallen. Do you want us to call emergency services? And if you do, it'll do. And if you don't answer at all, it'll wait a beat and then it will call emergency services for you. Which is a pretty nice feature. It comes in silver, gold, space gray. They're aluminum. And this finish here is the brand-new gold finish. Pre-orders start on Friday and they ship on the 21st. The smaller one, the standard one, it costs 399 with GPS. And if you want, you could spend 499 and get an LTE. Hey everybody, thanks so much for watching. This has been a crazy, packed hands-on event. We're gonna have way more coverage of all of the iPhone news and all of the Apple Watch news. So keep it locked to The Verge.",
    "transcript_keywords": [
        "Apple Watch Series",
        "Apple Watch",
        "Watch",
        "Watch Series",
        "watch faces",
        "Apple",
        "screen",
        "bit bigger",
        "bit",
        "digital crown",
        "bigger",
        "millimeter version",
        "things",
        "larger",
        "digital",
        "crown",
        "faces",
        "Hey",
        "Series",
        "ECG"
    ],
    "transcript_entity_values": [
        "LTE",
        "the Apple Watch",
        "FDA",
        "44 millimeter",
        "40 millimeter",
        "ECG",
        "399",
        "two",
        "the Apple Watch Series 4",
        "30%",
        "Friday",
        "499",
        "iPhone",
        "One",
        "Apple Watch",
        "the 21st"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE"
    ]
}