{
    "id": "QR5r1EfvheI",
    "title": "How To Make Any Laptop Touch Screen!",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-12-08T18:52:25Z",
    "video_url": "https://www.youtube.com/watch?v=QR5r1EfvheI",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "airbar",
        "neonode",
        "neonode airbar",
        "touch",
        "touchscreen",
        "touch screen",
        "screen",
        "windows",
        "mac",
        "pc",
        "macbook",
        "macbook pro",
        "apple",
        "cool gadget",
        "cool gadgets",
        "2016",
        "best",
        "video",
        "cool",
        "inventions",
        "smartphone",
        "futuristic",
        "iphone 7",
        "test",
        "iphone",
        "invention",
        "new inventions",
        "innovation",
        "android",
        "amazing inventions",
        "new gadgets",
        "amazing",
        "awesome inventions",
        "things",
        "cool technology",
        "cool inventions",
        "products"
    ],
    "views": 6627027,
    "likes": 133462,
    "comments_count": 6404,
    "description": "(   ) --- Today's Mystery Video -   Neonode Airbar (USA Link) -  Neonode Airbar (International) -   This cool contraption can turn any laptop into a touchscreen. Results are better in Windows but it also sort of works on Mac OS.   More info from the manufacturer -  Air bar gives your PC touchscreen capabilities. The sleek, lightweight device emits an in visible light field over a PC screen that senses touch from any finger, stylus, paintbrush, etc. Air bar enables touch for Chromebooks PCs running Windows 8 or Windows 10.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/udkebYgekeY?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://amzn.to/2hb8oee",
        "http://geni.us/U4ee2A1",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "[Singing Michael Jackson - Billie Jean] [Michael Jackson - Billie Jean playing through phone] WOO! When he grabbed his crotch, people lost their minds. He Did WHAT?! He TOUCHED THERE?! I think we got a cool one today - this thing here, it's called the Airbar Apparently, this device right here attaches to any laptop, and turns the screen into a touchscreen. Any laptop! So it comes in a few different sizes, This one right here is for a 15.6 inch laptop Something in that neighborhood It looks like there's one available for 14, 13, as well as 11. Plug in. Hard to miss. Jack, when you plug in, is it hard to miss? Touch. Just go crazy. Is there an innuendo happening here? There's something romantic about this. Your finger, or with gloves, and even a paintbrush. WHAT?! Enhanced User Experience. Pinch, sweep, zoom and scroll. It works with most notebooks. Running Windows 10, Windows 8.1 and Chrome OS. Okay, we have a f***ing MacBook here. Do you think it'll work? Let's give it a shot. Let's give it a shot. Alright, so... line it up. Oh! Is it me or did that just...? OH! WOAH! The screen is a touchscreen now! Woooooooah! That's a touchscreen MacBook Pro! Now the question is: how precise is this? It's close but, Maybe if we move it a bit that way. Oh that's better. It's just a matter of lining it up correctly for your display. But that, my friends, is a touchscreen. Let's try and play a video. [Video on screen plays] The precision is not exactly what I would call pin-point, (giggles) GET IT! It's fine for hitting icons that are huge, But if you're trying to get in on something that's real small, It is quite frustrating actually. Now keep in mind the product officially on the back, States the compatibility. Windows 10, Windows 8.1 and Chrome OS. In my experience the drivers that exist, generally speaking for items like this, accessories like this, Can function on Mac OS, sometimes maybe, with a little bit less polish I've got Pixelmator open. This'll tell us how close it is to the actual tap point. What's going on here? WOAH! Oh, so that's not working? Does work, which is cool, but this is the point of the video where you cut and you go: \"Okay, got a PC laptop now, let's see what the difference is.\" Okay, got a PC laptop now, let's see what the difference is! I can tell right away when I line up the Airbar, That fit is PRECISE! So I'm gonna remove the little sticky parts. These little white lines fit perfectly When you lift this off, you'll see the little tiny magnets stay there When you put those magnets on and fold this down, it works, as you'd expect. But then, when you wanna use the Airbar, It just drops on to the right position. You wanna, apparently, have a little tiny gap above the edge of the Airbar. Windows found a driver - this is Windows 7 Pro. It found a driver, apparently. Oh, this is WAY better than on the MacBook. Way, way better. Oh, it's bang on precise. It's super precise. Let's see if I can grab the little scroll over here. WOW! It's not even comparable to the other one. I don't think that has to do with the software, that's the thing, I think if this company made one, That was the exact form factor of the MacBook display, Something tells me... OH! They just launched YouTube Rewind! You never know, you might see your... Your old pal Lew in there! Oh! Look it even realizes I might want touch input. As well, for the text. Let's open up paint here. OOOH BABY! Let's do a little Jack Attack here! There he is - Mr. Pixel Jack! Lotta ear. He's also been working out so he's a little more buff than usual. Those are his muscles right there. That... That's A Hundred Per.. That's like a proper touchscreen! I hope you're getting that! That's very beyond my expectations for precision. Not functioning so well on a MacBook Pro, But that's not what it's designed for so who cares? Here, in windows, Bang-on precision, you can see the size of trying to hit an X, let's see this little X right here... BOOM! And it's not like you're completely committed to it, I like the way they designed it in the sense of \"You wanna get rid of it? Okay! BOOM.\" I think this thing's pretty cool. I can see a number of different circumstances in which, touch could be a cool thing to experiment with. Maybe for artistic endeavors. IT'S A TOUCHSCREEN! For any laptop. Look at it - that's all it takes.",
    "transcript_keywords": [
        "Windows",
        "WOO",
        "touchscreen",
        "laptop",
        "Airbar",
        "MacBook",
        "touchscreen MacBook Pro",
        "MacBook Pro",
        "precise",
        "Pro",
        "cool",
        "thing",
        "Jack",
        "Apparently",
        "Airbar Apparently",
        "WOAH",
        "Chrome",
        "Touch",
        "precision",
        "Hard to miss"
    ],
    "transcript_entity_values": [
        "14",
        "Jack Attack",
        "Pixelmator",
        "Lew",
        "MacBook Pro!",
        "Michael Jackson - Billie Jean",
        "Airbar",
        "11",
        "Running Windows 10",
        "States",
        "today",
        "buff",
        "Jack",
        "15.6 inch",
        "a MacBook Pro",
        "Windows 8.1",
        "Woooooooah",
        "Windows 7 Pro",
        "YouTube Rewind",
        "Mac OS",
        "Michael Jackson - Billie",
        "Pixel Jack",
        "Windows 10",
        "Hundred",
        "Airbar",
        "Bang",
        "13",
        "Chrome",
        "MacBook"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "DATE",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "WORK_OF_ART",
        "PRODUCT",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "FAC"
    ]
}