{
    "id": "Qr5yTzbr7GY",
    "title": "Galaxy S22 is Boring",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-02-10T18:06:57Z",
    "video_url": "https://www.youtube.com/watch?v=Qr5yTzbr7GY",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 45013,
    "likes": 1729,
    "comments_count": 293,
    "description": "Samsung's S22 line up is kind of confusing Steam Deck Doesn't Suck:  Android is BROKEN - Google Pixel 6:  PlayStations Big Move - Sony Buys Bungie:  Did Microsoft Break Gaming?  PS5 GamePass:   Subscribe!  Twitter:  Matt:  Instagram:   CHAPTERS --------------------------------------------------- 0:00 MATT FACT 0:08 Matt stunlocks Austin 0:42 S22 is good, but 1:10 S22 Designs 1:54 This phone is unfinished 2:31 Downgrade from S21? 3:01 Galaxy Note going away? 3:56 S22 Camera Specs 5:07 S22 Ultra Comparison 6:10 S22 Prices 7:36 S21 Still good value? 8:00 S22 CPU Specs 8:50 Im a little disappointed 9:15 Will Samsung make their own chip? 9:55 S22 UPDATE",
    "description_links": [
        "https://youtu.be/zbNRbCtO-Cg",
        "https://youtu.be/tktBL8CCC4Q",
        "https://youtu.be/YmP9TChpaQ4",
        "https://youtu.be/fsCEfkCijtw",
        "https://youtu.be/zgSlAJaHEvA",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- It's a Matt fact. I hit you with your own Matt fact. - God, hashtag Matt fact. Hello and welcome to This Is. Austin tonight we own the night. What? - That is the tagline to the new S22 lineup. - [Austin] What we're getting here is, in my opinion, a small downgrade in some ways, and generally speaking, a totally reasonable upgrade in others. But I will tell you, there's not that much exciting with the S22 line. I am sure they are completely competent phones. So as we record this, we have not gotten hands on but we've been briefed on all the information or at least a lot of it. And, it lacks the wow factor that I think that some of the S line phones have had in the past. It's just a very good phone, but there's no like big headlining, like that 400 billion times space similar. It's just, it's just a good device. - And that's I think, these phones are really good. Like there's, you know, we're saying like, oh it's not that big of an upgrade. That's because it's, they were so good that you can't make huge leaps and bounds every year with it. Cause like the S21, is one of the best phones you could still right now. It's still, yeah, right now, one of the best phones you can get on the market. So it makes sense that like the S22 is not gonna be like massively different - Before we get into what is new and good about these devices. I want to actually point out something I don't like. - [Matt] Go ahead. - The design. - Yeah, look, I'm glad you bring that up. I don't think that I've liked the design of a Samsung phone, since about the S7. And I know, oh, here we go. - You know what I love? - Here we go. - The design of the Samsung Galaxy Z Flip 3, the greatest device ever that I put a deep red skin on, link in the description - Let me re qualify my statement. - Okay. - I haven't liked the S line of phones since about the S7 - You didn't like the S21? - No, I didn't. - [Austin] Oh my God, dude. - I don't know. I don't like kind of like the big bump that they do on the back. - It was so stylized though. It was so stylized because its part of the frame. - It's not my style that's all I'm saying. - I feel like this phone looks like it's unfinished. Like to me, especially considering that there's nothing that's all that special. Like the, the best color I think is like this, like sort of like wine or burgundy color. That's this red, I mean, the color's fine but it's like, they just didn't even try just there's nothing going on. At least with the S21, it had the idea that the frame and the camera bump were all one nice piece. And even on the S22, which has a sort of similar look on the surface, it's no longer one piece. They actually have a camera bump and the frame and there's a little divide between them, which just doesn't seem as premium as last year. It just doesn't feel like they're pushing the envelope on the design as much, which when you pair that with the fact that the rest of the phone is an upgrade but nothing revolutionary. It's easy to say like, oh, this is not maybe the greatest year in the world for an upgrade because it's like, especially if you're on an S21 almost, I think, a downgrade as far as the actual look and the, maybe not the feel, but, maybe slightly. - Yeah. Once, that's one of the things we'll know when we actually get our hands on it with the feel, one of the things we talk about, the Ultra, which is the most visually different. - [Austin] Yeah. - [Matt] Which is a big thing that they're doing again this year is the Ultra is just now the Note it's something that we kind of talked about for a while is the note line gonna get enveloped into like maybe, the the Z fold line? Is it gonna go on the S line? - Anyway it can catch on fire? When you look at the Ultra, it does have all the Ultra specs, right? So you do have the 10 times optical zoom. Now that might not sound super impressive but traditionally, what they've done is they've done like 4X and 5X kind of zooms. - [Matt] And they like, and they digitally add the additional. - [Austin] yeah, this is 10x, optically. And then you can go digitally to the a 100x zoom. Very cool. 10x is, as far as I know, one of the most tight zoom lenses I've ever seen on a smartphone that's exciting. I'm excited to try it. They didn't talk that much about it. So it's gotta be a tiny sensor. It's probably not super, super impressive. - I believe it is a tiny sensor. - That's fine, because you also have a 3x telephoto Ultra wide standard, standard is 108 megapixels. And I think actually one thing I will give them credit for is that while again we have not had hands on yet, so stay tuned, make sure you're subscribed, but all the camera hardware across all the S22s has been updated this year. So there's no carryover sensors or whatever. Everything is new and updated in one way or another including the new 108 megapixel sensor, which I believe is slightly larger than before. And honestly they are very heavily pushing the cameras of these devices. - [Matt] Yeah. - [Austin] You know, they let out with talking about how, you know, video is one of the most important things that most people do on their phone. Whether it's watching it or capturing it. And so that was one of the big sort of impetuses for the S22, was to improve the video and the camera performance across the board. And it does seem like they've done that especially considering that, I mean, let's be real. The S21 already took excellent photos. - It's crazy. Because you have like so much of their J lines which is the budget side of phones. Then you get, now we have different tiers of their premium line of phones. - S21 fan edition just came out Plus S22s, you're right, I mean, pretty much from 1200 actually, no, all the way up to what is it? 17 or 1800 bucks for the fold 3 now? - Yeah, and you could still get some of the, like the fold two. You could still get the Z flip 2. Like, like I said, it's good and bad depending on how you look at it, because it's it's great that you have so many choices. - Yeah. - But it is complicated to kind of keep track of what you're losing versus one what you're losing versus other. And I think this is the first year that like in the S line that you lose quite a bit from the base S22 to the Ultra. - Yeah, so top line, the Ultra is the only one that has the S Pen, and it's not like last year where I think they had an S Pen attachment. No, this actually is a proper S Pen. It goes inside the phone and it has super low latency. When you step down to the S22 Plus, you obviously have a slightly smaller device. In fact, actually one thing I will give them props for I believe all of the phones this year are slightly smaller which I'm a big fan of, especially because I am a person who likes really compact devices. Generally speaking they're about a little bit smaller everywhere like, so for me, the S22, the standard version of S22 is what I'm really excited for. That's gonna be a little bit narrower a little bit less tall, a little bit easier to carry. But once you go down, you're right there is a little bit of a gap between features, right? So when you go to the S22 Plus you lose the high megapixel camera. You go down to 50 megapixel. You also lose the 10x space zoom. There are a couple other things. But, then when you go to the S22 then you lose stuff like wifi 6E it has wifi 6 and it doesn't support the super fast charging. So it's fairly reasonable, especially considering that it's $800 for the S22. $1,000 for the S22 Plus and $1,200 for the S22 Ultra. - I mean, those are big gaps. - They're big gaps, but I mean, to be fair it makes sense when you spend more, you get more out of it - Yeah, right. - But it's not like in some previous years where you could pretty much get whichever one you want and just pick the size. There are real feature and sort of major differences between them all. - So let me ask you this though. The S21 hasn't gone down in price like it has in previous generations. - Yeah. They've had chip shortage issues, I think. Keeping up with the S21 - Right. - But, I think it's safe to assume that we're gonna start to see it go down a little bit. - Well, I think they're clearing it out. So I don't know this for sure. So this is just pure speculation on my part, but because they have the S21 fan edition, which just came out. - Yeah. - I think that there's a lot of incentive especially because they had such a hard time keeping it in stock, for the S21 to just go away. Traditionally, they've kept it around and you know the price has been lowered and you know you can get it for another six months or a year. Whatever. I think the S21 is just gonna be gone. Won't even be an option, which is sad because again the pink and gold colorway is one of the most attractive phones of all time. - I'm gonna be a little bit more skeptical on that and I'm gonna say it's gonna stick around for a little bit it. - Okay. - All right. Do you think it's worth it to get a base 22 over one of the 21's? - Even the base S22, even though it doesn't have the 108 megapixel camera. - Yeah. - It still has improved camera hardware across the board. That phone was already no slouch. So I'm excited to see what that looks like. - And that's kind of the point I'm making is like the S21 again is currently one of the best phones you can possibly buy right now. And if they start doing heavy discounts on that like how much better do you think that camera's really gonna be in this one here? And if you can get it for, you know, a couple hundred bucks off - If you can, I think that's a big, that's a big question. - Yeah - I don't think Samsung were unreasonable with their pricing. I think it's very much in line with what these phones will kind of do as far as they slot into the market but they have some good upgrades. I think the cameras seem to be improved. The screens also are brighter now for some specific situations, like when you're in sunlight and what not, you've got yourself, the brand new Snapdragon 8 Gen 1 for the U.S. and actually a side note internationally, like always, they will be an Exynos model and this is gonna be the first Exynos processor with the AMD RDNA 2 graphics, which Exynos stuff has had a little bit of a checkered past, because I think some years it's pretty decent. A lot of years it's either not as efficient or not as powerful or both compared to the Qualcomm version and here in the U.S. and some other markets, we don't have the option, you just get the Qualcomm or you don't. So, I'm excited to see. I'm maybe a little skeptical but there is a potential for the international version of this phone to have very powerful graphics. I'm excited to try it. - And that's something I was a little bit more curious about with this one which, I'll be honest, I'm a little disappointed with. With Samsung making Google's chip which was pretty much just a modified Exynos. - Yep. - I kind of expected that this line would be kind of the same chip that Google has, or at least, you know - The Tensor Chip. - like the same level, but it's, you know, if it truly is like in the past where its just been a lower spec version of the Qualcomm one. That's going to be a little disappointing. When is Samsung just gonna start saying we're not using the Qualcomm chip, we're just gonna make this one across the board. - It's really hard for them to do mostly because Qualcomm has a really good relationship with U.S. carriers. And the thing is every chip in every phone has to be sort of certified but, the thing is they've got such a embedded relationship that it's very difficult, not impossible, but it's difficult for Samsung to get the Exynos chip sort of on board and ultimately for carriers to be like, yeah, sure, we like this. - Let us know what you think about the S22. Is it a good upgrade? Is it bad upgrade? Is it just meh upgrade? Be sure to like and subscribe, ring the notification bell. - And most importantly, gimme back my colorway, Samsung - Absolutely - Pink and gold. - So update, since we actually recorded the video Samsung have a bunch of exclusive colors that are only on samsung.com and spoil alert. They have some of the colors that I was asking for that make the design far less boring. So.",
    "transcript_keywords": [
        "Matt fact",
        "yeah",
        "phones",
        "Ultra",
        "phone",
        "Samsung",
        "line",
        "bit",
        "hashtag Matt fact",
        "big",
        "good",
        "year",
        "Matt",
        "camera",
        "kind",
        "fact",
        "chip",
        "upgrade",
        "Qualcomm",
        "Exynos"
    ],
    "transcript_entity_values": [
        "Ultra",
        "last year",
        "S22s",
        "a couple hundred bucks",
        "Ultra",
        "S21",
        "one",
        "S7",
        "108",
        "the Samsung Galaxy Z Flip 3",
        "another six months or a year",
        "the S22 Ultra",
        "S Pen",
        "S21",
        "some previous years",
        "S22",
        "Google",
        "Exynos",
        "2",
        "22",
        "tonight",
        "Matt",
        "the S Pen",
        "the greatest year",
        "1200",
        "108 megapixels",
        "17",
        "years",
        "Qualcomm",
        "3",
        "1,200",
        "Austin",
        "Samsung",
        "every year",
        "the S22 Plus",
        "two",
        "6E",
        "Exynos",
        "1,000",
        "6",
        "21",
        "800",
        "this year",
        "the first year",
        "400 billion",
        "50 megapixel",
        "first",
        "the S22 Plus and $",
        "4X",
        "Ultra",
        "3x",
        "1800 bucks",
        "Snapdragon 8",
        "S Pen",
        "U.S.",
        "Plus S22s",
        "10"
    ],
    "transcript_entity_types": [
        "NORP",
        "DATE",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERSON",
        "EVENT",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "NORP",
        "MONEY",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "EVENT",
        "GPE",
        "WORK_OF_ART",
        "CARDINAL"
    ]
}