{
    "id": "Qr6Eh6IdEZY",
    "title": "PS5: it's here. And it's huge.",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-11-14T00:10:34Z",
    "video_url": "https://www.youtube.com/watch?v=Qr6Eh6IdEZY",
    "category": "Science & Technology",
    "tags": [
        "Sony",
        "PS5",
        "Console",
        "Gaming",
        "4K",
        "8K",
        "Next Gen",
        "Playstation"
    ],
    "views": 1523819,
    "likes": 59831,
    "comments_count": 4275,
    "description": "Grab a ModMic Wireless for your favorite headset at   We finally got our hands on the PS5 and yes it's big. It's almost as big as Linus.   Buy the PS5 Console On Amazon (PAID LINK):  On Newegg (PAID LINK):      On B&H (PAID LINK):  On BestBuy (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/wirelessmodmicsc",
        "https://geni.us/Y5FTimg",
        "https://geni.us/vjZx",
        "https://geni.us/PIzXkB",
        "https://geni.us/jKHve",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- How ironic is it, David, that out of the two of us, I'm the first one with a PlayStation 5. - [David] Sad. - It's finally here. Launch Day PlayStation 5, ladies and gentlemen. And look, we even got a special fancy package, which honestly I'm going to discard immediately. David, do you want this to put on your wall? - [David] 0%. - Would you frame it and put it on your wall? - [David] Nope, I will not. - No, it's not cool enough? - [David] No. - Ow. Last bit came real easy there. We've got the disc version. So as you guys already know, the PlayStation 5 comes in two versions. For 500 US dollars, you get the one with a Blu-ray drive, and for 400 US dollars, you get the one where you have to buy full priced games instead of buying them second hand. Now, (sighs) okay, David, I know you're just a full fat guy in the first place and you were gonna get the disk version, no matter what. - [David] No. - No? Did you digital? - I got the digital. - Shut up. - [David] Yeah, I didn't buy a single disc for my PS4. - Really? - [David] Yeah. - So you're not gonna do the whole, like, you know, resell your games that you've already played? You're a collector. - [David] I'm a collector of digital things. - A collector. And you have no use for it as a Blu-ray player? - [David] No, everything's on digital now. - Alright, so David's digital transformation is complete. The key specs here are, of course, that it's running a new Zen 2-based SoC with much, much faster storage. Not to mention, a better, more advanced storage architecture than any previous console in Sony's lineup. And, of course, HDMI 2.1 connectivity, which is where... Oh yeah, all those fancy logos in the corner. That's right. This thing can output 4K 120 hertz HDR, and even 8K. This is a terrible sleeve. It just, like, came apart. Look, hello. BK Audio, 4K HD. We're taking immersion. Let's get this puppy open. Box number three. I just wanna feel the controller that supposedly is so advanced and game changing that they couldn't allow, like, plebeian PlayStation 4 controllers to work in PS5 games. Of course, the CPU and storage aren't the only things that are new here. The GPU is running the same RDNA 2 architecture that AMD announced with their RX 6000 Series graphics cards. What we're expecting from that is ray tracing support, although we don't really know anything about the actual performance compared to Nvidia's RTX series just yet, as well as extremely powerful, just more traditional rasterized graphics performance. There's a stand? Really chunky HDMI cable. Why is this cool? No, you know what would make me feel 2.1 and next-gen? Like, a super slim one that's, like, no broader than the connector itself. Like, sleek. Ah, teach thorough. Power connector, internal power supply, which is nice. Both of the new gen consoles have internal power supplies, though Sony had already pulled that off with the PlayStation 4, of course. And this is it, hey. It's heavy. It's surprisingly heavy. We'd be remiss if we didn't pull out an Xbox controller for a comparison here. Now this has a couple of AA batteries in it. And you know what? In fairness, the weight's not different. James pointed out that I should clarify this is a Series X controller. And I was like, \"Oh, why do we have to clarify that?\" And I was like, \"Oh, yeah, because, like, they didn't change it. (laughs) It's hard to tell.\" I like the feel on the handle a lot better than the PS4 controller. Like, a lot. This is the first, first party PlayStation controller that, to me, feels like it's actually designed for human hands. Going back even to the PlayStation 1, right? Like, how hard the lines were on that thing. And PS2 was no better. It's like Sony had this light bulb moment that went, \"Oh, the hand is curved. (David chuckles) Oh.\" I like it. And then what are all the fancy features of the pad up here now? - Well, it's a touch pad. - You can, like, rock it. It's a touch pad. You can yell it. - [David] It's the same a PS4. There's also a mic on there. - And then the big killer app here is, of course, these triggers having haptic feedback built into them now. So the idea is like, what, if you're on the throttle, you're ripping down the road or whatever else, it really feels like it's, like, weighted. - [David] The haptic feedback is the controller. It's resistive triggers. - Sorry, sorry, that's what I meant by... Isn't technically a resistive trigger haptic? - [David] I know it's around, sure. - Yeah, so whatever, whatever the terminology is, it's got the same kind of force feedback that you might find in something like a driving wheel, except that it's built right into the triggers on your controller. No complaints about the thumb sticks. I think thumb stick technology has pretty much reached peak, you know, thumb waggle thing. I mean, everyone but Nintendo can figure it out at least. Well, that's a fair criticism. - [David] Yeah. - Okay, the Pro Controller is fine, you're right. When I said they were about the same, kind of nailed it. Wait, are you able to see that scale? I don't have my overhead. - Yeah, I can. - Yeah, okay. They are, like, basically the same weight. I intentionally sequestered myself. I haven't looked at anyone else's impressions of the PlayStation 5 controller yet. So my surprise is very real. I think this might be the more comfortable of the two. D-pad sucks though. But then this D-pad sucks too. So, like, alright, let's have a look at the console. Let's see if it is truly as big as everyone says it is. Oh, sponsors, right. This video is brought to you by Antlion Audio featuring the ModMic wireless microphone. It allows you to turn your favorite headphones into a headset (fingers click) just like that. It features a 12 plus hour battery that can be charged even while in use. And it's got two mic modes allowing for omni or uni directional pickup patterns with a switch on the mic. You can seamlessly connect with PC, Mac, Linux and PlayStation. And you can check it out at lmg.gg/wirelessmodmic. What, did you open it? - I, well- - Did you come over here and open it and spoil it? - No, James took photos. - You dick. - He took photos. - You dick. You looked at my PlayStation before I got a chance to look at my PlayStation. - [David] I ordered my PlayStation first, okay? - Yuck. (David laughs) I gotta give Sony this, their product photographers do a great job. From all the photography, I got the impression that these were a little bit more rounded, kind of like the front here, and a little less, like, \"Yeah, I pop my collars 'cause I'm like...\" Also I think they were going for, like, Alienware futuristic curve, but it actually just ends up kind of looking warped. It just looks kind of defective to me. (upbeat music) Where are your hooks? Reveal your hooks to me. Ah! - Oh. It falls down. - Yes, it's down. And the hook that I thought was the hook is definitely the hook. So you can see there's these little dots. These ones right here act as like the lock. So that's the one that you gotta bend back. So this, there we go. What do you think, David? It's worse. (chuckles) - [David] Yeah. - It's worse. (laughs) It's immediately worse. I love the two-sided cooling fan intake though. That's pretty sick. Am I harping on it too much? - [David] No. - Does it really matter? - [David] It's ugly. Everyone knows it's ugly. - Yeah, okay, that's fair. At least it has USB Type-C. - [David] And an NVMe slot. - An apparently fast-charging USB port on the front. Two more USB 3s on the back, hardline LAN, HDMI. That's freaking awesome. Look how accessible that is. Blows me away that Sony was the one. Sony. Out of Sony and Microsoft, Sony was the one to go, \"You know what? Let's make the storage upgradable on this thing via non-proprietary means.\" So Sony, if they're going to go, \"Yeah, it's just a computer. Why don't you just put an M.2 in it?\" I love this. I am so stoked. It can accept a 110 millimeter M.2. I'll talk about why that's important in a minute here. But Sony is able to go, \"Yeah, it's expensive today and a year from now, two years from now.\" Remember it's been seven years since the last PlayStation launch. Seven years from now, you will literally be able to buy one of these gumstick M.2s that's fast enough for the PlayStation 5 at Best Buy, chuck it in there, it'll probably be like 40 bucks, and you're off to the races. In the long term, that's the right move. So most M.2s are 80 mil, and you can see the mount for that is right here. But if you step up to 110 millimeter, you can get some that are higher performance. Like, for example, Intel has Optane-based M.2s that are 110 millimeters. Now Optane doesn't have the sequential speeds that the PlayStation needs yet, but the latency is extremely fast. So if we get a new generation of Optane and a Gen 4 M.2, like 110 mil, that would probably be the Cadillac of storage upgrades for the PlayStation 5. Are Cadillacs even cool anymore? Doesn't matter. You guys understood what I was saying. And you can also get 110 mils in higher capacities because there's more room for NAND flash chips on them. Sometimes. Now the fact that the PlayStation 5 supports it means we're gonna see it, I think. 'Cause the thing is, even though console gamers tend to have this negative stereotype of being, you know, poor gamers among the PC master race, well, the people who take that stuff seriously, they're not. And I think we're gonna see people spending, you know, literally double the price of this console on just massive storage upgrades for it, because unfortunately, only about, what is it, like, 675 gigs of the onboard storage? - Yeah, available. - Is user accessible for installing games. I mean, if you're playing \"Call of Duty: Modern Warfare\" or whatever... You got \"Red Dead Redemption 2,\" you got \"CoD,\" you got like, what- - [David] It's definitely two with expansions. - Yeah, like, three more games, you're done. That's it. Now just like the Xbox, you can hook up USB bay storage and copy your games to and from it, but it's (sighs). You can do it on a PC too. Nobody likes doing it. You know, you can have a Steam game somewhere else. You can, like, back up your Steam game somewhere else and then just copy them over when you're gonna use them, but it sucks. It's not the best. - [David] You can't use that for PS5 games, only PS4 games. - Oh, they don't even allow you to put PS5 games on it and copy them? - [David] Not yet. I'm sure it'll come, but not yet. - Just like M.2 upgrades. (David laughs) Does that not look like a defect? Oh, this is nice. Look at this. They've got a little PlayStation logo embossed here so that you know which spot it's supposed to go in. - [David] Look at the texture on the inside of the white thing though. - Oh. Oh, that's cute. It's got little Xs, Os, squares and circles. You will not be able to see that from there, but it's adorable. You'll have to take my word for it. Okay, this was easy once I figured out how to do it. A slot, why? Why? Slots grooves should not exist. The year is 2020. The are literally the worst. Why does it need a stand? There's no ventilation down here. Oh, there's a little bit actually. Torx? (David laughs) No, it should be Phillips. Hello? Oh, there's a little cover. There's a cover nubbin. Why can I not turn this again? I no longer care. I'm sure other people will figure it out. That's not better. I think I'd probably go naked. I don't think I'd put it on the stand, man. Maybe we're thinking about this all wrong, David. Maybe Sony is just big-brain way out ahead of us on this one. 'Cause think about it. Think about the evolution of the console's role in our lives, like, in our families. It used to be a toy for the kids. Then it turned into like something that adults would own, but they would hide away when company came over. And now it's something that you wear loud and proud, like, you know, I'm a gamer. You wear, like, T-shirts that are like, \"Oh, look at me. I use keyboards and I think that's cool.\" You know, like that kind of thing. lttstore.com. So maybe this is Sony's way of saying, \"Loud and proud. It doesn't fit in your media console, and, dammit, it's not supposed to. It's supposed to be on a pedestal next to your TV as a monument to what a gamer you are.\" Nothing? No applause? That was my- (David claps) (audience cheers) - Thank you. There it goes, yeah. (David cheers) - Of course, it's a ShortCircuit so that's as far as we go today, but make sure you're subscribed to \"Linus Tech Tips\" because we will of course be putting the PlayStation 5 through its paces. So knowing what you know about how the Series X and Series S compare to each other in terms of performance, 'cause this is what, like, 12 teraflops and the Series S is like four? - [David] Yeah. - So it's like three times the teraflops. Does it concern you at all that the PlayStation is 10? Knowing that they are in terms of the actual CPU and GPU architecturally similar, which is not the same as the entire system architecture and the software, do you think the gaming experience is going to be noticeably different? - [David] Oh, it'll be 10% sharper for multi-platform games on Xbox, but it always just comes down to games. - Right. I mean, there is the fact that Sony has offloaded, what, is it audio? - [David] Audio, that's the audio and the I/O. - And I/O. That's a big oops. And can you even lay it down flat? Like, both Xboxes are designed so you can put them flat. No, you could- - [David] With the stand, you go flat. You can take the stand off and then put it on. - I mean, you can, but like...",
    "transcript_keywords": [
        "PlayStation",
        "Sony",
        "Yeah",
        "games",
        "controller",
        "David",
        "Series",
        "storage",
        "thing",
        "put",
        "console",
        "kind",
        "Audio",
        "USB",
        "digital",
        "Day PlayStation",
        "Steam game",
        "buy",
        "stand",
        "Launch Day PlayStation"
    ],
    "transcript_entity_values": [
        "Call of Duty: Modern Warfare",
        "Linus Tech Tips",
        "Optane",
        "12 plus hour",
        "CoD",
        "Xs",
        "40 bucks",
        "4",
        "USB",
        "PlayStation 4",
        "2020",
        "the Series S",
        "LAN",
        "BK Audio",
        "10",
        "AMD",
        "Nvidia",
        "110 millimeter",
        "Cadillac",
        "NAND",
        "2",
        "PlayStation",
        "Nintendo",
        "the PlayStation 4",
        "a minute",
        "today",
        "Linux",
        "110 millimeters",
        "Mac",
        "12 teraflops",
        "Xboxes",
        "110 mils",
        "500 US dollars",
        "two years from now",
        "675",
        "David",
        "Red Dead Redemption 2",
        "first",
        "Alienware",
        "David] Audio",
        "Sony",
        "two",
        "GPU",
        "SoC",
        "80 mil",
        "Xbox",
        "CPU",
        "2.1",
        "PS4",
        "Cadillacs",
        "the PlayStation 5",
        "second",
        "Microsoft",
        "PlayStation 1",
        "PS5",
        "HDMI",
        "10%",
        "Antlion Audio",
        "ShortCircuit",
        "the Pro Controller",
        "Best Buy",
        "a year from now",
        "The year",
        "110 mil",
        "Phillips",
        "PlayStation 5",
        "Intel",
        "400 US dollars",
        "three",
        "chuck",
        "the Series X and",
        "PS4",
        "Zen 2-",
        "ModMic",
        "seven years",
        "0%",
        "Blu-ray",
        "Seven years from now",
        "four",
        "USB Type-C.",
        "PlayStation first",
        "Two",
        "Blu-ray drive",
        "James"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "TIME",
        "DATE",
        "ORG",
        "QUANTITY",
        "GPE",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "EVENT",
        "NORP",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON"
    ]
}