{
    "id": "qSIsMqSoRNs",
    "title": "iPhone X vs iPhone 8 vs 8 Plus - Which Should You Buy?",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-09-15T05:55:43Z",
    "video_url": "https://www.youtube.com/watch?v=qSIsMqSoRNs",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "iPhone 8",
        "iPhone X",
        "iPhone X review",
        "review",
        "unboxing",
        "iPhone 8 review",
        "iPhone 8 vs iPhone X",
        "iPhone 8 vs 8 Plus",
        "iPhone X speed test",
        "A11 Bionic",
        "2017",
        "tech",
        "apple iPhone X",
        "iphone 8 plus",
        "iphone",
        "iphone 8 unboxing",
        "iphone 8 leaks",
        "iphone x unboxing",
        "iphone edition",
        "iphone 8 hands on",
        "new iphone",
        "iphone 2017",
        "iphone 8 camera",
        "iphone 8 vs 7",
        "iphone 8 release date",
        "ios 11",
        "iphone x vs iphone 8",
        "iPhone ten"
    ],
    "views": 582690,
    "likes": 12823,
    "comments_count": 1777,
    "description": "iPhone X Hands on:  iPhone X (ten) vs iPhone 8 vs 8 Plus - Which Should You Buy?   The iPhone X (ten) packs a 5.8\" OLED Display, A11 Bionic Processor, a Dual 12 megapixel camera with improved Portrait mode, Face ID, an wireless charging and more.   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/1L7JFN7tQLs",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo, guys, Jonathan here and not only are we fresh off the announcement of the brand new iPhone X, but also the iPhone 8 and 8 Plus as well. I got a chance to go hands on and extensively cover the iPhone X, so if you missed that video I will drop a link down below, but today I wanna focus on both the iPhone 8 and 8 Plus, help to make it a little bit easier for anyone who's potentially on the fence about buying one of those phones or even waiting for the iPhone X. Now, hands down the iPhone 8 and 8 Plus naming scheme was purely a marketing move. They very easily could've and probably should have named these the iPhone 7s and 7s Plus, but honestly I can't really hate on them for that because business wise it was a super smart move. Everybody up until the point where essentially everything got leaked, would've assumed that the iPhone 8 was Apple's giant big flagship release this year, but as we've seen that is clearly the iPhone X and because these phones are more than a month apart in release, I think it's safe to say it's gonna be a pretty big end of the year for Apple. Now, one thing different with he iPhone 8 and 8 Plus is the iPhone 6 to 6s and 7 all shared aluminum bodies, whereas for the iPhone 8 and 8 Plus those feature an all glass back, which not only change up the look and the feel, but also introduces wireless charging. So, for anyone out there who thought that maybe wireless charging was exclusive to the iPhone X, nope you get that across the 8 and the 8 Plus as well. And as you start to see throughout this video these three phones share more features than you might think. Now, as far as the colors go, gone is rose gold. So, no longer do we have to argue about whether it's pink or rose gold, we are now simply left with silver, gold, and space gray. Honestly, after seeing these in person I think I'm gonna have to say gold is my favorite. It just looks the nicest by far. And surprisingly I'm gonna say the silver is my runner up and the space gray out of these three was my least favorite. Now, as far as the displays go there definitely are some improvements, nothing drastic though. The iPhone 8 is still rockin' a 4.7 inch display with the same resolution, whereas the iPhone 8 Plus is rockin' a 5.5 inch display with the same resolution as well. Upgrades that both these phones share are improved stereo speakers. Surprisingly both the iPhone 8 and 8 Plus share the exact same A11 Bionic chip found in the iPhone X, so maybe you're not ready to give up that home button, whereas the iPhone X really isn't doing it for ya, it's nice to know that you're not gonna have to sacrifice performance. So, if you missed my iPhone X video, crazy name aside, that A11 chip is supposed to be stupid fast. I think there were some preliminary benchmarks that leak showing that it was just as fast as a 13 inch MacBook Pro, which is kinda crazy if you think about it. I for one am super excited to get this in house, check it out, test it out for myself. And if there's anything as far as performance goes that you guys wanna see, let me know with a comment down below. Now, as far as the cameras go the iPhone 8 is rockin' a single 12 megapixel shooter. It is supposed to be an improved sensor with what Apple is calling deeper pixels. Not sure exactly what that means, but it's supposed to translate to more accurate colors. Then of course we'll have to see once I get one in house. Now, as far as the iPhone 8 Plus, that again is rockin' a dual lens configuration like we saw in the 7 Plus, but if you're curious what's different between the iPhone 8 Plus and the iPhone X, obviously one, we have a vertical configuration in the iPhone X, but the biggest difference between the two is the iPhone X actually has OIS on both the lenses, where the iPhone 8 Plus only has OIS on the single main shooter. Just like the iPhone X though, there are of course improvements to portrait mode on the iPhone 8 Plus as well on top of that, what Apple is calling Portrait Lighting, which essentially give you the ability to manipulate different lighting elements in environments either pre or post photo. What's kinda cool, too, on top of that, beyond the ability to tweak things in post, you could just shoot a regular portrait mode photo without any portrait lighting effect and still decide to add it in later. Now, from there hands down one of the biggest upgrades to come to the iPhone 8, the 8 Plus, and the X, this is one feature that all three of these phones share is video. These phons all shoot at 4K, 60 frames per second. It might be a little crazier for me is 240 FPS slow motion at 1080P. Go Pros don't shoot 4K 60, none of the Canons shoot 4K 60, I think the GH5 will get you 4K 60 FPS, but is nearly two grand, so hopefully that should put things into perspective. So, from there anyone who's kinda on the fence between the iPhone 8 and 8 Plus or the iPhone X, I think one of the biggest questions is, are you ready to give up that home button? Both the iPhone 8 and 8 Plus still have that comfortable familiar touch ID home button where the iPhone X obviously does not. Essentially you're almost kinda guinea piggying a first generation product with he iPhone X because do you trust face unlock? Is it gonna be good enough? We've already seen some controversy, so that is something you definitely have to ask yourself. For me what draws me most towards the iPhone X is you're essentially getting all of the Plus features in a smaller form factor. You're gettin' a bigger screen, you're getting dual cameras, with OIS on both lenses, so for me that's kinda almost the way to go. I will say, though, if I had to guess between these three phones I would think the iPhone 8 Plus would still have the best battery life out of the three, followed by the iPhone X and of course lastly the iPhone 8. Ultimately, features aside though, it comes down to pricing. Do you wanna pony up the cash for the iPhone X? The iPhone 8 starts at $699, the iPhone 8 Plus starts at $799, and then we of course have the iPhone X which starts all the way up at $999. So, for those watching right now there's a good chance you may have just pre-ordered an iPhone 8 or 8 Plus or you could be holding out for the iPhone X. Let me know what you went with and why, I would love to hear what you think. Aside form that, thank you guys very much for watching. If you enjoyed this video if it helped, make sure you guys drop a like down below. This is Jonathan and I'll catch you guys later.",
    "transcript_keywords": [
        "iPhone",
        "phones",
        "Apple",
        "video",
        "kind",
        "guys",
        "phones share",
        "portrait",
        "OIS",
        "gold",
        "share",
        "rockin",
        "hands",
        "cover the iPhone",
        "essentially",
        "shoot",
        "Lighting",
        "features",
        "Portrait Lighting",
        "starts"
    ],
    "transcript_entity_values": [
        "iPhone 8 and 8 Plus",
        "two",
        "GH5",
        "more than a month",
        "13 inch",
        "iPhone",
        "4.7 inch",
        "the 7 Plus",
        "240",
        "4",
        "nearly two",
        "999",
        "6s",
        "799",
        "8 Plus",
        "Apple",
        "Portrait Lighting",
        "Plus",
        "iPhone X",
        "Canons",
        "the 8 Plus",
        "699",
        "second",
        "three",
        "first",
        "A11 Bionic",
        "one",
        "MacBook Pro",
        "1080P. Go Pros",
        "5.5 inch",
        "today",
        "the iPhone 8 Plus",
        "8",
        "12 megapixel",
        "60",
        "this year",
        "A11",
        "Jonathan",
        "the iPhone X. Now"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "FAC",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "DATE",
        "EVENT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG"
    ]
}