{
    "id": "qu1LVroXsSc",
    "title": "Electric bikes: everything you need to know",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-10-10T14:00:15Z",
    "video_url": "https://www.youtube.com/watch?v=qu1LVroXsSc",
    "category": "Science & Technology",
    "tags": [
        "electric bike",
        "electric bikes",
        "ebikes",
        "e bikes",
        "e-bikes",
        "electric",
        "bikes",
        "rideable",
        "electric rideables",
        "trek",
        "John burke",
        "scorpion ebike",
        "scorpion",
        "radwagon",
        "radwagon bike",
        "rideables",
        "bike life",
        "bikers",
        "hoverboards",
        "skateboards",
        "scooters",
        "motorcycles",
        "mopeds",
        "unicycles",
        "tricycles",
        "how to",
        "how",
        "how to buy",
        "price",
        "battery",
        "first look",
        "electric bike review",
        "hands on",
        "specs",
        "kickstarter",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "apple",
        "google",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 781190,
    "likes": 11915,
    "comments_count": 751,
    "description": "We love electric rideables. Hoverboards, skateboards, scooters, motorcycles, mopeds, unicycles, tricycles You name it, weve ridden it. But electric bikes belong in a category of their own because they are more than just a fun tech fad. They could actually be the future of transportation. That said, theres a lot to choose from out there, and you dont want to get fooled, so heres what you need to know.    Around 5:20 in the video, we say that in Europe, class 1 e-bikes are the most popular. Actually, the most popular e-bikes in the EU are unregulated with motors rated at 250W.  Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2M4zGnG",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat remixed music) - So we here at The Verge love electric rideables. Hoverboards, skateboards, scooters, motorcycles, mopeds, unicycles, tricycles, you name it, we've ridden it. But I'm here to tell you why I think electric bikes in particular are more than just a fun tech fad. I think they could actually be the future of transportation. But that said, there's a lot out there, and you don't wanna get fooled. So here's some stuff you need to know about e-bikes. (downbeat remixed music) Obviously e-bikes are not new. They've been around for decades. And if you live in China or Europe, it's a good bet that e-bikes are already a way of life for you. In Europe, for example, e-bikes have long helped older adults maintain independence and are just now really blowing up with younger riders. But here in the U.S., e-bikes are still pretty niche. They only account for a 4% of total bikes sales. Compare that to more bike-friendly countries like the Netherlands where there are more e-bikes sold than regular bikes. Overall, experts predict that worldwide sales will hit $23.8 billion by 2025. But Americans are slowly coming around. Sales of electric-bikes in the U.S. have grown more than eight folds since 2014. It took a long time to get to this point. Now one of the first patents for an electric-bike was registered in 1895 by an inventor named Ogden Bolton. Now Bolton didn't actually end up making or selling any of his bikes, but amazingly some of the same design details can be found in e-bikes today. A rear hub motor with a battery centrally mounted on the frame. Now I know what you're thinking. What the hell is he talking about? A rear hub motor, amps and volts. I don't wanna get ahead of myself. So let's talk about the basics before we get to why e-bikes are the future of transportation. (upbeat dance music) So generally speaking e-bikes are bicycles with a battery-powered assist that comes through when you pedal or in some cases use a throttle. Pushing on the pedal activates a small motor that gives you a boost. So when you're zipping up a hill or cruising over rough terrain, you don't have to break a sweat. Twisting a throttle does the same thing but without pedaling. There are two types of motors. There's the mid-drive which is located in the middle of the bike usually between the two pedals. And then there's the hub motor which is located in the center of either the front or the rear wheel. There are pros and cons to both types of motors. Hub drives have been around forever and tend to be cheaper and more versatile. They're really excellent motors for anyone needing a reliable e-bike for long, mostly flat commuting. Mid-drives are usually smaller and lighter and can allow for greater torque than hub drives making them well suited for hilly areas and off road use. Their center position on the bike also creates a more balanced ride. And changing a tire on a mid-drive bike is usually less of a pain in the ass. E-bikes also tend to use different types of sensors to determine how best to dole out power. There are two types, torque sensors and cadence sensors. Torque sensors regulate the motor based on how hard you're pushing the pedals, while cadence sensors work off of how fast you pedal. Good bikes use torque sensors while the low enders have cadence only, and a lot of bikes use both. I highly recommend testing out both types of motors before buying an e-bikes to see which is the best for you. Think about how you plan on using the bike. Commuting, off-roading, touring? The better e-bikes brands usually match the appropriate motor placement with the type of bike they're selling. Most mountain bikes come with mid-range motors while the majority of commuter bikes sold in hill-less Amsterdam are hub based. They see me rollin' They hatin' Tryin' to catch me ridin' dirty (funky percussion music) Now let's talk power. Manufacturers will often offer power ratings for a variety of reasons. Until recently power ratings were a way for bike companies to dance around Europe's strict importation laws which prohibited anything stronger than 250 watts. But now the continent allows the sale of bikes with way more powerful motors, which is good because it allows bikes to be seen as a viable alternative to cars. Still power ratings can be pretty subjective, and you can probably get away with just ignoring them. To get a better idea of how much maximum power you'll actually feel, check to see if they list the volts and the amps. Multiply those two together to get the watt hours or the number of watts that can be delivered in an hour. This gives you a great sense of how much range you'll get. For example, Rad Power Bikes' excellent cargo bike the RadWagon has a battery pack that is 48 volts and 14 amp hours. 48 times 14 equals 672 watt hours. If you're thrifty with your energy usage, each mile you travel will cost you about 20 watt hours. Therefore, a 672 watt hour pack will get you about 34 miles of range. (light electronic music) Alright, let's talk classes. There are three classes of e-bikes in the U.S. Class one is pedal assist with no throttle. Class two is throttle assisted but with a maximum speed of 20 miles per hour. In a class three, it's pedal assist only, no throttle, but with a maximum speed of 28 miles per hour. In Europe they only have two classes. Class one, which is by far the most popular, has a maximum speed of 25 kilometers an hour with no helmet required. Class two is 1,000 watt plus motors capable of going 45 kilometer an hour, require a helmet and can't be ridden on bike paths. They're basically motorcycles. So where can you buy an e-bike? Well, your local bike store is honestly your best bet. You're gonna get a selection that's been curated by the owners, and the folks that work there are gonna have answers to all your burning questions. Amazon is obviously another place, but there's some pretty serious trade-offs that you have to consider. Your bike could arrive pretty banged up. And the companies that sell e-bikes on Amazon are a little bit ephemeral, here one day, gone the next. It's not just Amazon of course. A majority of the e-bikes sold in the U.S. are just cobbled together from off-the-shelf Chinese made parts that you can find in the catalog. And if that sounds easy, it's because it is. It helps explain why there are like a billion e-bikes companies on Kickstarter and Indiegogo trying to impress you with their flashy designs and futuristic tech. Many don't come with warranties or any customer support. And it's very likely that you're buying a Chinese model that's just been rebranded for Western marketing and sold at a markup. If you find an e-bike that you like, an interesting test is to search the bike's specs on Alibaba to see if something similar is being sold in Asia. It might even be cheaper. Alright, so I promised to explain why I think that e-bikes are the future of transportation. So here we go. First, it lowers the barrier to biking. So if you're someone who's older or you're stressed out about the strains of biking, it really lowers the barrier, and it's easier to justify getting on a bike and just ride. You're more likely to ditch your car or delete you Uber app if you know you're gonna get to where you wanna go without getting sweating and stressed out. And look, if you're worried about electric bikes taking all the fun out of cycling, well, you're wrong. A study of the cognitive and psychological effects of outdoor cycling actually found the same results for e-bikes and traditional bikes. Let's say climate change has got you down. Electric bikes are way more sustainable than electric cars. They're gonna make our cities more livable, and they're gonna help clear up traffic congestion. So as our cities are becoming more congested, some companies are turning to e-bikes to make their deliveries. Domino's Pizza recently announced they're gonna be using Rad Power Bikes to make pizza deliveries in some cities. UPS is using electric cargo bikes. German delivery company DPD is gonna be using these really cute looking mini trucks that are actually e-bikes in disguise. E-bikes are changing the way that businesses are doing business. (light uplifting music) So the other day I was riding an e-bike to work, and a remarkable thing happened. Well, first, I wasn't killed, which, in a city as deadly for bikers as New York, is a minor miracle. But more importantly I got to the office super quick, much faster than if I had taken the subway, and I wasn't a sweaty, stressed out mess when I arrived. Here e-bikes are almost exclusively used by food deliver workers, and it got me thinking about how far behind the rest of the world the U.S. is when it comes to bikes. We see them more as recreation than as transportation. Something to be used in fair weather and not in the rain and the snow like the Dutch do. But come on, our U.S. women's team just beat them in the World Cup. Surely we can compete in the saddle as well. Our streets are designed for cars, and pedestrians and bikers are really just an afterthought. But e-bikes can open up a whole world, especially for people with different abilities. Look, they're not gonna solve everything, but I can guarantee that once you start riding, you're not going to wanna stop. Did we make that word up? Is that a real word, rideable? It's like a lunchable, but you ride it. (laughs) What the hell is that thing? (engine hums) - [Assistant] Maybe it'll be really quick.",
    "transcript_keywords": [
        "Verge love electric",
        "ebikes",
        "bikes",
        "Verge love",
        "bike",
        "power",
        "motors",
        "motor",
        "electric bikes",
        "Verge",
        "hour",
        "hub motor",
        "ebike",
        "hub",
        "Europe",
        "sensors",
        "Rad Power Bikes",
        "electric",
        "watt hours",
        "pedal"
    ],
    "transcript_entity_values": [
        "Bolton",
        "New York",
        "48 volts",
        "1,000 watt",
        "one",
        "Rad Power Bikes",
        "Americans",
        "watts",
        "1895",
        "672 watt hours",
        "DPD",
        "three",
        "Dutch",
        "14",
        "4%",
        "today",
        "48",
        "45 kilometer an hour",
        "more than eight",
        "about 34 miles",
        "Europe",
        "Indiegogo",
        "First",
        "about 20 watt hours",
        "the watt hours",
        "the World Cup",
        "Ogden Bolton",
        "Domino",
        "Rad Power Bikes'",
        "14 amp hours",
        "two",
        "RadWagon",
        "Amazon",
        "2014",
        "one day",
        "Hoverboards",
        "Alibaba",
        "an hour",
        "China",
        "Kickstarter",
        "28 miles per hour",
        "20 miles per hour",
        "2025",
        "decades",
        "25 kilometers an hour",
        "first",
        "$23.8 billion",
        "Asia",
        "672 watt hour",
        "Netherlands",
        "German",
        "U.S.",
        "Chinese",
        "Amsterdam"
    ],
    "transcript_entity_types": [
        "PERSON",
        "GPE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "NORP",
        "LOC",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "LOC",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "TIME",
        "EVENT",
        "PERSON",
        "PERSON",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "TIME",
        "GPE",
        "GPE",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "MONEY",
        "LOC",
        "TIME",
        "GPE",
        "NORP",
        "GPE",
        "NORP",
        "GPE"
    ]
}