{
    "id": "qUKg8Y-0dWs",
    "title": "The truth about drilling for water in Africa...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-03-13T13:49:00Z",
    "video_url": "https://www.youtube.com/watch?v=qUKg8Y-0dWs",
    "category": "Howto & Style",
    "tags": [
        "Water Africa",
        "Borehole",
        "water well africa",
        "mr beast",
        "mr beast philanthropy",
        "africa well",
        "kenya well",
        "build school in africa",
        "build library in africa",
        "how to dig a well",
        "education"
    ],
    "views": 873269,
    "likes": 72474,
    "comments_count": 3848,
    "description": "We found water!! THANK YOU to everyone who donated books and Thank you again for watching my videos. It took thousands and thousands of people to make this borehole and library project possible - Thanks to YOU, yes YOU, the person reading this right now, Budalangi will never run out of water again!   Watch the Library Video HERE:   My grandma befriended Philip in South Africa about 15 years ago - and he has been an honorary member of my family ever since. Coming to family reunions - weddings - and even though we aren't actually related - he is definitely family. If you want to help out the community in Kenya - you can donate to his foundation here:   Get my Shirts and Razor Knife here!    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/7R71uDa3DNw",
        "https://www.upliftpamoja.com/",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So we're behind the library right now drilling the borehole. Water is extremely important and if you don't have it, you'll spend every waking moment looking for your next drop. Which is why behind me we are drilling a hole 600 feet into the ground so that this town right here will never run out and I'm going to show you how it happens. Let's get started. [Intro] The reason we're drilling the borehole right here next to the library is because here in Budalangi there is no indoor plumbing. There are no faucets you can turn on and have running water. And Philip, if you remember Philip my uncle, he grew up here in this town. -[Philip] Apart from just not having plumbing we also have the issue of being close to water. So the distance it takes you to come get water. When I was growing up here we used to walk for about 2 or 3 miles to get water. But now, with this borehole right here, we can get the water closer and also we'll get the water at a very high volume. -[Zack] When we're looking for water underground, it's not like there's some giant lake that we're going to tap into. The earth acts as a sponge. If we were to only drill down 15 or 30 feet, it wouldn't supply enough water because the ground at that level is not saturated enough to satisfy a large town. Plus with the shallow pump sometimes the water is salty which is not good to cook with or good to drink. We are bypassing all of those layers to the super saturated earth so that this will always have good, clean, pure, water in abundant supply. The main water source for the village right now is a water pump that was installed about 30 years ago. Philip remembers using this pump as a kid. And as you can see right now it has fallen kind of into disrepair. Plus it's manual and everyone has to fill up their water jugs by hand. Because this particular water pump is so shallow it runs out of water around noon. There's no more water for people who come later and they have to wait overnight for the hole to resaturate and provide water again the next morning. It would be pretty disappointing to walk 2 or 3 miles to the water hole and find it empty. The way the drilling machine works is that it has these long metal poles. Each one of these are about 5 meters in length and they are hoisted up onto the arm and set inside of the borehole. Then the top of the machine acts as a hammer drill pounding the metal rods into the ground as they rotate, pulverizing the rock underneath. I've been told that if the rock is soft each one of these metal poles takes around 15-20 minutes to go into the earth. But once we hit bedrock or granite it could take up to an hour for each one of these 5 meter rods to be sunk down into the ground. These rods are just making a hole by the way. They will be taken back out once the hole is finished. So with this process we're not necessarily ever striking water. We are finding water, going past it so that the hole always stays filled. The deeper into the earth we go, the deeper into the water table we go and the more water we will be able to get back out. They're taking a break for a minute so I can show you how it works from the inside like we always do. So behind me on this massive truck there's a compressor. And I didn't know this at first but these tubes are actually hollow. Air blows down through the tubes, out the end of the hammer as it's jackhammering underneath the ground which is what is spitting all the water up and out of the hole as we go deeper. And all of this rock around the outside of the hole is from the rock that was pulverized as we've been drilling. Once the hole itself is done being drilled down through all of the rock. We have to put a casing around the interior of that hole so it doesn't collapse on itself. And that casing in this particular case is done with ABS pipe that's threaded on one end and perforated all through the center. The perforation actually looks pretty cool from the inside. And what it does is allows the water to seep in from the rocks around it like the sponge we were talking about earlier, and fill up the tube so that it can be pumped out. We only want to be pumping water and not any rocks or debris, or anything from the sides of the tunnel. The tube is hoisted up into the air and I'm going to let you spend some time here with the tube as it rotates getting screwed onto the tubes beneath it. We can't just drop the tubes down in the shaft, they have to be connected to each other, each one threaded into the other. Once it's securely threaded we drop it down into the hole, clamp it down near the bottom and repeat the process all over again until we fill the entire 5 or 6 hundred foot shaft with this casing. It's a pretty cool process. The metal we're standing on, this is where the giant tank...how many liters is the tank? -10,000 liters. -10,000 liters. Plus, not only is the borehole right next to our library, but over here is a hospital as well as an elementary school. And so this area will kind of be the central hub for anyone who needs to come get water. If there ever is a drought and the water table drops, we're going to be so low into the ground that a drought would not affect this borehole as much as the other ones around here. And of course, all of this is possible, the borehole and the library, is because you guys are here right now watching my videos. I get a small fraction of a penny anytime someone views my content, and we get to use that money for cool things like this - an awesome library and a borehole that's going to supply water to anyone in a two mile radius. It's amazing, so thank you for watching. Now we have to get the water from that hole 600 feet down to the top of this tower. [African music playing] [Children cheering] We haven't even connected it to the tank yet. Everybody's filling up their water bottles. We need to get the water from here all the way over to there that tank. [Water sounds] [Children having fun and cheering] [African music playing] Straight from the earth. Oh I'm outta here! Woo! And there you have it. Unlimited water coming from more than 400 feet in the ground that'll never be interrupted. Eventually we'll have solar panels up top so this will all happen automatically off the grid. Woo! That's Philip. But I have a flight to catch so we won't see the solar panels installed up top. But this is absolutely amazing. And huge thanks to you for watching my videos, making all this possible, and for donating books to the library. This is now a hub of health, water, and knowledge right here in Budalangi, Kenya. Thanks a ton for watching and I'll see you around. [African music playing]",
    "transcript_keywords": [
        "Water",
        "hole",
        "borehole",
        "ground",
        "water pump",
        "drilling",
        "library",
        "Philip",
        "water hole",
        "rock",
        "water table",
        "earth",
        "tubes",
        "pump",
        "metal",
        "feet",
        "watching",
        "top",
        "tank",
        "tube"
    ],
    "transcript_entity_values": [
        "5 meter",
        "600 feet",
        "Kenya",
        "-10,000",
        "Philip",
        "two mile",
        "about 30 years ago",
        "15 or 30 feet",
        "a minute",
        "African",
        "up to an hour",
        "about 5 meters",
        "overnight",
        "3 miles",
        "more than 400 feet",
        "the next morning",
        "5",
        "6 hundred foot",
        "first",
        "about 2",
        "around noon",
        "Budalangi",
        "one",
        "15-20 minutes",
        "2"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "GPE",
        "NORP",
        "PERSON",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "TIME",
        "NORP",
        "TIME",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "GPE",
        "CARDINAL",
        "TIME",
        "CARDINAL"
    ]
}