{
    "id": "Qv-SSuD71a4",
    "title": "4 HomePods - What will happen?!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-03-30T18:06:37Z",
    "video_url": "https://www.youtube.com/watch?v=Qv-SSuD71a4",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "homepods",
        "multiple homepods",
        "airplay 2",
        "stereo homepods"
    ],
    "views": 295015,
    "likes": 9094,
    "comments_count": 961,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it going, it's Justine. And today, I'm testing something out, because I don't know what's gonna happen. I haven't tried this, I have yet to have all of my... (calm music) Did I do something? Wait, okay, no. I think I might have touched them by accident. I have yet to have all of my HomePods in one room, next to each other, where they can hear me fairly equally. So, what I'm wondering is if I say, \"Hey,\" which one's gonna answer me? Are they all gonna play, is just one gonna play? What determines who's gonna respond to my voice? Because I'm not really sure. This is the one that I've been keeping in my office, I think this is the one that I have downstairs in my kitchen, this one I think is in my bedroom, and this one I also have downstairs in another room. So these are my babies, these are my children. Yes, I know, I have a problem. I've already addressed it, with myself, with you guys, but at least the issue has been addressed, and that means maybe I'm one step closer to not being an Apple addict anymore. But, for the time being I am. Leave me alone. I'll do what I want. I'll do what I want with my body, I'll do what I want with my money, and this is what I choose to do with it. For the sake of not triggering any of your smart devices, I'm gonna be bleeping out the word, So I won't trigger any of you guys watching this video. So as you can see here, all four of the HomePods are there at the bottom. We've got the game room HomePod, my office HomePod, my room HomePod, and the upstairs HomePod. It's time for the test. Who's gonna answer first? Hey, play me some music. - Okay, I'll start with The Writer by Ellie Goulding. - Okay so this one answered me. - Hey, play me some music. - Let's get going with some Katy Perry. - Okay now she's still playing. So what if I play all four of them? (jumbled music) Wait, they're all playing something different now. Play me some Slayer. - Here's Slayer. (jumbled music) - Maybe if I move over here. Play me some Backstreet Boys. - Sure, here's a personalized station of Backstreet Boys. - Hey, play me some Bette Midler. Okay now-- - Here's a personalized station of Bette Midler. (\"In My Life\" by Bette Midler) - Hmm. Well this experiment is not as exciting as I thought it was gonna be. How can I get them all to play the same thing at the same time? Because without the latest iOS release, (sighs) Okay. Okay so here we have our song. And if I hit play, I can decide where I wanna go. So I can play in the game room, my office, (\"Cool Kids\" by Echosmith) It's playing there. Here's my office one, it's playing right here. My room, this one. And the upstairs is over here. (\"Cool Kids\" by Echosmith) So by using AirPlay, I'm able to decide which one I wanna play to, but, unfortunately, without the software update, that hopefully will be coming very very soon, I wanna be able to play the same song on all of these devices at the same time. That will be a release in the future iOS update, but right now, it's not a thing. And it's so upsetting because I really wanna have these set as stereo speakers on my TV. And much like Sonos, I'm able to play the same song throughout the entire house on all of them. But I can't do that here. I wonder if I hit play on all of them. (jumbled music) Okay, well it's playing all different songs. So that's not gonna work out very well. Play Echosmith, Cool Kids. Why did you decide to pick it up? - Here's Cool Kids by Echosmith. - Play Cool Kids by Echosmith. No, now she's still picking it up. - Playing Cool Kids by Echosmith. (\"Cool Kids\" by Echosmith) It's a great song. Okay, so. What do I do now? Basically, my test is over. If you have four HomePods plus your phone, only one of them is gonna decide to answer you. I was really hoping this would get crazy, and all four of them would answer, and things would get silly. Do you wanna be my best friend? - That's nice. (Justine laughs) I'd like to be your friend. - Well, which one? So, you wanna be my friend. (\"Cool Kids\" by Echosmith) Well I guess since I'm here, I'll give you an update on how I'm loving my HomePods so far. And honestly, I know that there has been a lot of backlash, but there's also been a lot of people who really really love them, and I, yes, I'm one of the people who really really love my HomePod. HomePods. We're like family. These are my best friends. I feel like it's been a big toss-up between people who love the HomePod and people who don't like the HomePod, and honestly, I think it's absolutely great. For what I do, and what I need it for, it is perfect. It sounds great in every room, I have HomeKit completely integrated, so all of my lights are completely connected to this, and when I come home, my lights turn on, and when I leave, my lights turn off, and I can set specific timers to do all kinds of different routines, and, yes, you can do that with other smart devices too, but obviously, this works perfectly with my Apple Ecosystem. 'Cause if you guys are new here, then, you might not know that I'm a really big Apple fan. Surprise. The news is out. But in all seriousness, they really need to get the update rolled out, where we're able to use the surround sound and be able to use this in all rooms and be able to play the same songs. I feel like a lot of people may be waiting for that update to buy one. I know that was my original recommendation, to just buy one, and then if you wanna buy more later, then do it when the update is out. But I clearly did not heed my own warning. Or my suggestion. 'Cause, like I said, I have a problem. Anyway, I'm sorry that this wasn't a more interesting video. I was hoping that something crazy would happen, but since it didn't, I thought I would share that with you anyway, in case you were just as curious as I was to see what would happen. And nothing really happened. So that's that. Lemme know if you guys have any other suggestions for videos in the comments below, and lemme know what you guys think of the HomePod. Do you have one, do you not have one? I would love to hear all of your thoughts. And I will see you guys in the next video. Bye! Hey, play me some music. - I'll start with Smoke and Mirrors, by Imagine Dragons. - Good choice. (\"Smoke and Mirrors\" by Imagine Dragons) I would make one note, though. Whenever I say, Hey... All four of these light up at the same time. Now I'm really leaving. Bye! (\"Blimp\" by Matt Fax)",
    "transcript_keywords": [
        "play",
        "Cool Kids",
        "Play Cool Kids",
        "HomePod",
        "Hey",
        "room",
        "Justine",
        "guys",
        "HomePods",
        "playing",
        "Kids by Echosmith",
        "Echosmith",
        "Kids",
        "Cool",
        "update",
        "Playing Cool Kids",
        "Play Echosmith",
        "time",
        "room HomePod",
        "Play Cool"
    ],
    "transcript_entity_values": [
        "Katy Perry",
        "Backstreet Boys",
        "AirPlay",
        "one",
        "Sonos",
        "Apple",
        "Justine",
        "all four",
        "HomeKit",
        "Imagine Dragons",
        "Ellie Goulding",
        "Blimp",
        "Cool Kids",
        "HomePod",
        "HomePods",
        "Backstreet Boys",
        "four",
        "only one",
        "today",
        "Bette Midler",
        "Echosmith",
        "In My Life",
        "Matt Fax",
        "first",
        "Slayer"
    ],
    "transcript_entity_types": [
        "PERSON",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "ORDINAL",
        "PERSON"
    ]
}