{
    "id": "qvqRUDv21As",
    "title": "The Dual Screen Phone You Already Forgot About? - Durability Test!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-09-08T14:45:01Z",
    "video_url": "https://www.youtube.com/watch?v=qvqRUDv21As",
    "category": "Howto & Style",
    "tags": [
        "Dual Screen phone",
        "LG Velvet durability test",
        "LG Velvet review",
        "LG smartphone",
        "LG Velvet unboxing",
        "Best smartphone",
        "Android",
        "iPhone",
        "LG Velvet bend test",
        "velvet",
        "2 screen smartphone",
        "cool tech"
    ],
    "views": 1955341,
    "likes": 80608,
    "comments_count": 5945,
    "description": "Its time to see how durable LG's new Velvet phone is... The LG Velvet is a super thin smartphone with all the bells and whistles of 2015 and the 5G of 2020. AND it has a dual screen option. Should be interesting. I tried out a new camera for this video! Not sure if its my favorite. Might take me a little bit to get the settings figured out.   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So we're going to do a two-for-one this video. The first thing is, I got a new camera so I'm testing it out for the first time. Let me know how you like it down in the comments. There might be a few hitches here and there. Today we're also going to test the durability of the LG Velvet 5G a sleek looking phone with a detachable second display...which we'll take a look at later in the video if the phone survives that long. The LG Velvet currently costs only $600. And it's called the Velvet because of the soft glow of the foil underneath the back glass. And it's minimalist raindrop-style camera, which is rather refreshing after seeing the camel hump on the Note 20 Ultras. We'll get a closer look at those cameras in just a second. Let's get started. [Intro] LG isn't playing that race to the largest camera bump game that Samsung and Apple are playing. In fact, two of the three lenses are sitting flush with the back glass. Pretty sleek. Samsung's over here looking like Pangaea did 200 million years ago. Let's get on with the scratch test. You know how it goes. LG has been making smartphones for a really long time now. Kind of falling off the radar here and there, but for the most part being pretty consistent. I think my brother is even using an LG phone. The curved glass screen of this Velvet scratches at a level 6, with deeper grooves at a level 7. The teardrop camera notch up here at the top is a 16 megapixel little guy that can film in 1080p. There is no earpiece grill, just a large cavern of a slit where the stereo sound comes out of. The phone is still ip68 water resistant though, so don't let the big hole scare you. And it's still made from aluminum so don't let that sound scare you either. It's got a dedicated metal Google Assistant button on the side kind of convenient. It's right underneath the individual up and down volume buttons. On the right side of the phone we have more metal and a power button. Up at the top we have some clear shipping protection so the phone doesn't rub inside of the box. And the SIM card tray has a slot for expandable memory. So far this guy's looking pretty good. And if we flip the phone around...wait a minute...could it be? [Romantic music] A headphone jack?! The legend spoke of this relic, but it's been ages since I've seen one in person. I thought they were all extinct. LG has taken the tech from 2015 and 2020 and made an incredibly thin sandwich out of it...which makes me a bit nervous for the bend test. The main camera up top is a 48 megapixel. Then we have the 5 megapixel depth camera and an 8 megapixel ultra wide camera down at the bottom. Then the flash is right below that, finishing off the raindrop aesthetic with the decreasing circle sizes. It's a single colored flash. The Velvet does have wireless charging on the back side. And on the front side we have the P OLED 6.8 inch 1080p display. It is on the large end of things. And lasts about 25 seconds under the heat from my lighter before going white. It does mostly recover at the end, but there is still permanent damage, which shows us once again that fire is indeed bad for cell phones. One thing that should be good for cell phones though is fingerprints. I don't have the best luck with these since I do stuff with my hands. So my fingers are either dirty, calloused, wet, or otherwise unpristine, and this LG Velvet just can't handle it. No matter how many fingers I try, there's still no success. Kind of unfortunate. The ultrasonic fingerprint sensor on my Note 10 Plus does a slightly better job, but it's still not perfect. The test that really matters though is the bend test. LG is still sitting on the antiquated thinner is better train and is only 7.9 millimeters thick. The Velvet is thinner than both the iPhone 11 and the Samsung Note 20 Ultra and that thinness definitely shows itself off as flexiness in the bend test. With a few creaks and groans, the phone flexes from the back and the front, but locks out and doesn't sustain any permanent damage. The back glass does separate from the frame, but there are no cracks in the screen like we saw with the OnePlus Nord. I'm pretty happy with the LG Velvet. It's a Swiss army knife of a smartphone for a relatively realistic price. And what makes it even more interesting is the accessory options. LG was pretty clever for offering a $200 dual screen case. And I have a theory as to how they can make that second screen so cheap. If we plug the phone into the case screen combo, we can see that the screen has exactly the same shape cut and notch as the screen from the phone. You might say this is for aesthetics so both sides look the same since the camera cutout doesn't need to be there on that second display, but I get that LG scored some pretty hefty discounts with these extra screens by buying the exact same screen that they used for the phone and just putting it in the case instead...avoiding those extra design costs, and utilizing economies of scale to maximize profit margins, all while making a useful accessory. LG is playing chess while the rest of the smartphone world is playing checkers. The second screen can multitask, like watching YouTube videos on one side while texting on the other. And the brightness control dims both screens at the same time. The whole body is made from plastic so it can protect the phone. And it can fold all the way around backwards to get out of the way if you just want to use one screen. Let's see if my theory is correct though. I think this second screen can be removed and then plugged directly into the main phone since it probably has the same Lego-style connector. The main difference would be that the phone glass is curved and this extra screen glass is flat. But it would still be interesting to see if it works when we do that full teardown video. Removing the screen usually kills the screen, but this Velvet second display has a thin bead of glue around the outside. And after some gentle persuasion with my heat and razor blade, I can get the screen to lift off in one piece. The long screen ribbon is hidden under the backside of this circuit board, but it's interesting to see that the screen has the exact same internal cutouts for the fingerprint scanner and front camera that the main phone probably has. So it looks so far like my theory is correct. No need to go through that RND for the second screen when you can just reuse the first one. Once we pop out that blue circuit board, the screen can pull away. We'll try to install it on the phone during the actual teardown video. I'm impressed. There are a lot of features here for a $600 phone, and it's half the price of other flagships out there. And for only $200 more we get a whole second screen. I hope Samsung and Apple are paying attention to this. Let me know what you think of this contraption down in the comments. And come hang out with me on Instagram and Twitter. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "screen",
        "phone",
        "Velvet",
        "camera",
        "glass",
        "test",
        "Pretty",
        "back glass",
        "Samsung",
        "side",
        "main phone",
        "back",
        "cell phones",
        "extra screen glass",
        "glass screen",
        "screen glass",
        "Note",
        "phone glass",
        "bend test",
        "screens"
    ],
    "transcript_entity_values": [
        "only 7.9 millimeters",
        "6.8 inch",
        "Google",
        "only $200",
        "8 megapixel",
        "2020",
        "ip68",
        "Lego",
        "1080p",
        "2015",
        "Instagram",
        "two",
        "jack",
        "three",
        "YouTube",
        "only $600",
        "6",
        "the OnePlus Nord",
        "a minute",
        "Velvet",
        "half",
        "Pangaea",
        "SIM",
        "The LG Velvet",
        "5 megapixel",
        "600",
        "5",
        "Apple",
        "first",
        "second",
        "the LG Velvet",
        "RND",
        "Swiss",
        "Samsung",
        "Today",
        "Samsung Note 20",
        "200 million years ago",
        "16 megapixel",
        "One",
        "about 25 seconds",
        "48 megapixel",
        "one",
        "200",
        "Twitter",
        "Velvet",
        "LG"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "MONEY",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "DATE",
        "ORG",
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "NORP",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG"
    ]
}