{
    "id": "QY8lVkfiCfU",
    "title": "The WORST Gaming Setup EVER Is Made Of... Lasers?",
    "channel": "Dawid Does Tech Stuff",
    "channel_id": "UCvcRA2Hva1lULVf4GCouH8w",
    "subscriber_count": 688000,
    "upload_date": "2021-07-10T13:00:08Z",
    "video_url": "https://www.youtube.com/watch?v=QY8lVkfiCfU",
    "category": "Science & Technology",
    "tags": [
        "lasers",
        "pc",
        "pc gaming",
        "computer",
        "gaming setup",
        "worst",
        "worst pc gaming setup",
        "mouse",
        "keyboard",
        "gaming peripheral setups",
        "terrible",
        "dawid does tech stuff",
        "2021"
    ],
    "views": 147976,
    "likes": 8990,
    "comments_count": 507,
    "description": "I try a PC gaming setup made entirely of laser based peripherals and it's pretty terrible.   For some Noob-Friendly, Dawid-approved T-shirts, and more, shop   -Here is a link to my Patreon page, it would be awesome if you check it out:   -Follow me on whichever Social media you don't hate- Discord:  Twitch:  Twitch shorts channel:  YouTube:",
    "description_links": [
        "https://dawiddoesmerch.com/",
        "https://www.patreon.com/DawidDoesTechStuff",
        "https://discord.gg/b34uVGaYVB",
        "https://www.twitch.tv/dawiddoestechstuff",
        "https://www.youtube.com/channel/UCAiMJaOrvTik7XyJethz-ig",
        "http://www.youtube.com/c/dawiddoestechstuff"
    ],
    "transcript": "*laughing* I love that this is the extent to which you ... *more laughing* It is a well-known fact that lasers make everything better. And fun fact, our merch is actually made entirely of lasers. Although, I may have found an exception to this rule Peripherals Because I am willing to bet money that in these three little boxes, I have the worst gaming peripheral set ever. And they all use lasers as a pretty central part of their marketing. Now, unfortunately, the only part of the peripheral setup that we're missing here Is laser-based headphones but I don't think we have that technology yet. Intro sequence Now today we've got a whole gaming setup made of lasers. Starting with a laser projector that we're going to use as a display. Next up we've got the very minimalist designed laser keyboard. And then finally we have a weird gamer-looking laser mousepad. Uh, which I can't imagine is going to work very well. But it does look cool. It is called the Odin and it is apparently the world's first laser mouse. Which has a BC award. I wonder if it's one of those buy one, get one free award kind of deals that you get? but with that, let's start off with the keyboard, which uhm.. actually looks like it's modelled on an old iPhone. But before we have a look at it, let's see what accompanying stuff it comes with. You pretty much just get a very short micro USB cable. Considering it's something as high-tech as a laser keyboard, I'd expect it to use USB type C but whatever. Oo it's so tiny. It's designed to be portable, and it is definitely portable. The build quality is very \"Dollar Store Electronics\" feeling. There is a lot going on on this front face. It looks like there are two cameras here And then I'm assuming that's the laser projector up here that actually beams the keyboard onto your desk. and then there's what looks like another sensor down here. On the bottom, it's got a very exciting laser warning. but yeah, other than the huge amount of sensors on the front there is not much else going on. So let's move on to the Odin. Ooo this is like an Apple Level unboxing experience we've got going here. Oh my god, that thing looks awful. Uhm, but before we get into that Let's see what's in this little pouch. So this is actually quite interesting, I can imagine the laser keyboard works in a similar way. It seems like there are multiple infrared sensors that can cross-reference the position of your fingers and stuff. So, yeah, I'm really excited to see if this works well. Wow. That build quality What's quite funny about its appearance This way around it looks like a menacing A.I. that's about to betray your entire life. But if you turn it around it becomes like a sad Transformer. Look at that :( *sad music playing* At least it's nice and portable Although I think that this would just be such a humiliating thing to use in public Imagine you see somebody with a full laser set up in a Starbucks Next up we have the AnyBeam MEMS Laser Scanning Projector Ooo, now this AnyBeam's Laser projector was significantly more expensive than the other two and it feels better made. in terms of rear I.O., again, we don't have USB 3.1 Type-C which is a complete outrage. but we do have an HDMI port and a headphone Jack. On the side, we've got a little rocker button that you use to control the on-screen menu I guess and then we have a very confidence-inspiring little speaker. and finally, on the bottom, we have a quarter-20 jack with another awesome laser warning. other than that, in the box, you don't get anything. So you don't get any of the cables you need to get this thing started. Or any form of 'stand' for it, so you do need to figure that out yourself. groovy music So I guess this is how we're starting off with the setup. I don't really have any framework of reference for how big the thing is going to beam. and what surface it wants, so I started off with a mouse pad. I feel like that makes sense somehow. The same thing goes for the little projector. I don't know what its throw distance is or anything. So I'm just kinda pointing it at the wall hoping that it will work here. I have discovered a couple of ergonomic problems. So, these don't have any grip on the base So they very easily slide around I don't know how stable they're going to be on any surface. But yeah, let's power this up to see if any of this stuff works, even reasonably well. Is that it? Is that as bright as it goes? Let's adjust *Laughs at the image* *laughs more* so in the marketing material, they say that this can go up to 100 inches across. Well, I think you'd have to be very, VERY, far away from the wall for that to be the case. So they say, \"it's always in focus\" and I think what they meant by that is that it's never in focus Because it's SO BLURRY The texture of just rubbing on the mousepad feels super weird. Is this on? Is this supposed to be doing anything? Maybe it's the mousepad? Okay so it's been my entire life But I've actually been able to set all this stuff up to work. I think what we need to do here is test our skills and play in a lobby with actual human beings. Uhm, I think that's going to go very well. Oh ok, so I can just tap to shoot and then... how do I... .... No way! HaHaHaHaHa It doesn't register a continued keypress So you can't just click and hold to walk, It only registers the Keypress when you lift off the surface. *More laughing* That's about how you can move. Arrrggggg... did I hit them? Hey! I actually almost killed that guy *laughs* and that noise isn't distracting at all. beep beep beep beep *laughing* I'm going to have to figure something out because this is *laughs* I love that this is the extent to which you can *laughs more* Wait, wait, no, there has to be a setting I can change. Maybe in-game Because that is ridiculous, that is just *laughs* No, do you know what, honestly screw this, I'm going to switch over to a monitor. That is too horrible, No, I tap out, like I'm sorry, F*ck that *laughs* god darn nit that is too awful After rage-quitting on that terrible little projector which, somehow, on-camera actually looks better than in-person, if you can believe that. Just the biggest waste of $230 ever but anyway, after I rage-quit on that projector, I spent ages trying various setting configurations to see if I can find some useable configuration for CSGO That didn't work, I actually got my account banned because I got kicked from so many matches. after that, I went into GTA V to see if I could make that playable somehow and this happened *laughs* It's like Franklin is suffering from a seizure. Come on dude, you can make it out the door! Come on *Laughs* After another pretty spectacular failure, I did some research and apparently, Skyrim has a walk toggle button so you can cover long distances in-game, without flaring up your wankers cramp So I decided to install that and give it a try Okay, I may have loaded into the middle of a fight but that's okay. There we go, 'C', we're moving in a video game. And then every time I need to stop, I just press C. Look at that! This is ... OW .. Spider! No Uhm, it can only register one input at a time Aww, this is... arg... Uhm, the bow... Does not work very well... Ok, so we've equipped that. Now I can run around and hopefully smack some spiders. Arg, OK, I missed it. Do I... Let me quickly... Ah, the paper... I've bent the paper... Oh, something... No! Just turn around... why am I... Oh, I'm stuck I need to run away again. This is honestly completely unusable. Ok, like... there we go! There we go Frostbite spider. You're gonna ... HIT... Smack the thing! Ok, I'm just gonna stand still, turn around, and fight it. Smack it!! Arg This is hardly what I'd call responsive on any level. Just... Hit the... okay Now, I'm gonna toggle... RUN DARN NIT *Laughs* God Darn nit *Music* Going into this video, I had a strong feeling that these were gonna be terrible But they ended up being so much worse than I thought they were going to be. Like... Nintendo Virtual Boy - BAD Now, I know they aren't really marketed for gamers aside from, arguably, the little laser projector but even for their intended use case They are infuriating to use Genuinely can't imagine a worse peripheral setup than this Which brings me to the end of the video. Thank you very much for watching! If you liked the video, please do 'like' and 'subscribe' to the channel for more videos like this one. Until the next video, Bye-bye! *music*",
    "transcript_keywords": [
        "laser",
        "laser projector",
        "Laughs",
        "laser keyboard",
        "projector",
        "lasers",
        "laser keyboard works",
        "Laser Scanning Projector",
        "thing",
        "work",
        "laser warning",
        "keyboard",
        "MEMS Laser Scanning",
        "AnyBeam Laser projector",
        "video",
        "peripheral setup",
        "peripheral",
        "designed laser keyboard",
        "USB",
        "imagine"
    ],
    "transcript_entity_values": [
        "first",
        "Starbucks",
        "quarter-20",
        "GTA",
        "three",
        "230",
        "USB",
        "the AnyBeam MEMS Laser Scanning Projector Ooo",
        "AnyBeam",
        "Nintendo Virtual Boy - BAD",
        "BC",
        "two",
        "Franklin",
        "CSGO",
        "I.O.",
        "iPhone",
        "today",
        "Jack",
        "one",
        "up to 100 inches",
        "Odin",
        "Skyrim",
        "Keypress",
        "Come on *Laughs*"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART"
    ]
}