{
    "id": "QzwaB8uo3fU",
    "title": "Unboxing one of the most controversial games this year - The Last of Us 2",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-06-24T22:29:27Z",
    "video_url": "https://www.youtube.com/watch?v=QzwaB8uo3fU",
    "category": "Gaming",
    "tags": [
        "The Last of Us 2",
        "David",
        "Unboxing",
        "Sony",
        "Playstation",
        "Naughty Dogs",
        "Ellie",
        "Joel",
        "Special Edition",
        "Press Kit",
        "Guitar",
        "Figurine",
        "Dark",
        "Excited",
        "Gaming",
        "Console"
    ],
    "views": 221385,
    "likes": 13639,
    "comments_count": 1535,
    "description": "We got our hands on the Press Kit for The Last of Us Part 2! David is pretty excited to check it out.   Buy The Last of Us Part 2 Game On Amazon (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy TLOU 2 Dual Shock 4 Controller On Amazon (Paid Link):   On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy TLOU 2 Headset On Amazon (Paid Link):  On BHPhoto (Paid Link):   On NewEgg (Paid Link):   Buy Playstation 4 Pro Console On Amazon (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):  On StockX (Paid Link):  On Best Buy (Paid Link):   Check out David's review of The Last Of Us 2 at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/95Y5",
        "https://geni.us/lXNxgo7",
        "https://geni.us/WwKRWK",
        "https://geni.us/fdFwG",
        "https://geni.us/9qOBmru",
        "https://geni.us/sATW",
        "https://geni.us/S2aCcd",
        "https://geni.us/9qOBmru",
        "https://geni.us/cZzreM",
        "https://geni.us/fSA9A5R",
        "https://geni.us/k2Q9",
        "https://geni.us/SKvw",
        "https://shop-links.co/1725432053657143300",
        "https://shop-links.co/1725432052986354954",
        "https://youtu.be/lh09ZR2Alzw",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Welcome to one of the coolest days of my life. Because! We're gonna be unboxing the press edition of The Last of Us Part II. This is so exciting. Okay, so I'm currently playing through the game. I haven't looked at this too much because I wanted it to be just a real treat and a real surprise. This thing is huge. I don't think I. Oh, I can! Oh, I'm so strong! This is amazing. (grunting) This is, The Last of Us Part II press edition. There is only 200 of these in the world and I'm so excited to unbox it but also just to share it with you guys, this is insane. I'm like blown away that they sent us one of these. So, as you can see, the box is kind of a old-gun case sort a thing. It's really nice the styling of it. On the back, we have our number 169 of 200. I don't know if that's just lucky but I think we're the right people to get the 69 one. Let's see what it looks like inside. (chuckles) This is frigging sweet. This honestly blows my expectations away. I thought it was just gonna be like styrofoam and a bunch of stuff but the little detail of this moss and the woodchips and the rust and the tattoo that Ellie has in this game, this is amazing. This is one of the coolest things I've ever seen in my life. I'm beyond blown away. I mean this is my first unboxing of a press edition of a video game. So I don't know how this compares to other ones but there is so much stuff in here. The first we have a little metal plate, it's kind of a message from the game director, Neil Druckman disclosing. We got it for free. Thank you Naughty Dog, you're the coolest. That's pretty sweet. Let's go for these pins next. So we got some pretty sweet little pins. This game is unreal. It's a technical wonder and I think there's a really interesting discussion going online about what's the value of fun and entertainment in a video game versus kind of more dark stuff. So, I think it's really important for people to play and engage with that discussion and so I encourage you to go play. I'm having an amazing time playing this game. It's so much fun. My girlfriend actually made me stop playing when she had to leave because she isn't into it and she doesn't like video games. So it's like a movie it's like real life, it's incredible. Technically I'd never seen a game like this, it's blows me away. What's next? Let's see what this is. Oh, a little jacket patch, Last of Us Part II. Oh, a bracelet? I think this is one of the friendship bracelets in the game. You know what? I'm gonna wear this for the rest of the video. Maybe I'm not smart enough to figure out how to do this. I'm gonna let it limply a rest on my wrist until it falls off. All right, let's look at these headphones. Moderately comfortable they're like stiff. The ear cushions aren't super comfortable but I think the point is more the branding. Well, Last of Us Part II branding the color and all this stuff. Presumably these are similar to the PlayStation gold headphones which are pretty good for the price. Part of the tattoo detailing in there, that's nice. That's really nice. I'm a little angry, Ellie. If haven't heard, the theme of this game is hatred. And so you can imagine how dark it gets. Whooh! It's a little vinyl! That's really cool. Unfortunately, we don't have a record player. I'm just gonna have to imagine what it sounds like. Well, if you guys don't know, there's actually a quite a bit of music in the game. You can actually pick up a guitar at many different places and play some pretty elaborate stuff. There's some pretty funny YouTube videos of people playing real pop songs with The Last of Us guitars. That's cool that they've included music. The Purpose In Loss and Desolation Road I'm not sure which one those are, but there's kind of a song that keeps repeating in the game that different characters sing. I'm imagining it's that one. I'm not going for the game yet. Let's see what this is. This is a big box. A little ribbon thing. My Last of Us themed weapon for eviscerating people. Oh, some kind of backpack! Oh, I recognize this pin from the game. It's nice when companies make merged products that aren't like Last of Us two or something crazy where you wouldn't ever wanna wear it. It's cool people that know what that is. They know what that is. We also have our wireless dongle for the headset, a charging cobbler and an aux cable. If you wanna plug it in directly to the controller. What should we do next? Okay, it's actually like it's been in moss. Like it's been overgrown. This is nice, it's a DualShock 4. It's pretty subtle. This is nice, it's got the fan, part of the tattoo here, it's got the branding on the touch pad but otherwise it's a DualShock 4. I like this controller, I'm excited to see what they do next gen, but it's pretty nice. Art book next. Well, there's more stuff under there. Oh my gosh! It just keeps giving! Cool, I think these are just little stickers. This is so fun. Yeah, just Ellie's tattoo sticker, Naughty Dog Last of Us stickers. Let's look at these art books, The Last of Us Part II. This game is a beautiful looking game and I'm genuinely excited to see what they did with the art. The art books a little small but it's packaged in here so I can't complain. If I was gonna like leave it on my coffee table or something I'd want it to be a little bit bigger but the print quality is fairly high and it's just nice to have. It's like a nice little thing you can tuck away and if someone really loves The Last of Us, maybe you can just like give it to them or whatever. The Last of Us Part II, this feels like a CD. Oh no, not a CD, Oh! Another message from Neil Druckman. How much stuff is there in this thing? This is insane. Oh, Ooh! (chuckles) That's interesting. So these are like wooden guitar picks. They're definitely decorated 'cause they're like wood then they wouldn't hold up to play, like I think against the metal strings they would deteriorate pretty quick but they're nice, they feel good they're cool. They're just like a nice little decoration thing again at least tattoo seems to be the theme of the branding. Ooh, this is the biggest box yet. What is this?! Oh, I think I know what this is. (laughs) This is huge! Holy smokes! This is so cool. Okay. Oh Gosh, how do I get it outta here? (grunts) (sniffs) Oh, it smells good! (sniffs) I don't know why it smell it's good but it does. (sniffs) Is that Ellie playing the guitar figure? Holy smokes. Wow, the detail on this thing. If you don't know, Ellie is one of the main characters in the first game, she was bitten and didn't turn into a zombie which is one of the kindest of the whole point of the first game is you're trying to get her to a place where they can make a cure from her. And so she has a whole difficult past. There's wood green in the plastic, the clothing has this incredible texture and the blood is a different paint on top of it. The base is okay. I don't know statutes that well, I guess but this is incredible. The paint job is flawless. There's so much detail, like the blood on the backpack from where the arrows would have had blood. There's a little blood on the machete. It's really lovely. Yeah, we're gonna have this on a set somewhere. I tell you what, I tell you what Ellie? Okay, and finally, this is a steel box version of the game. So you have Ellie on the front and Abby on the back. And I can't say too much, I just don't wanna spoil it for you guys, just go out and play it. We have two disks, one looks like a data desk and one like the regular game. Let me know in the comments below, if you buy physical versions and why or if you buy digital and why? This is pretty amazing, it has like everything you can possibly get from the game. If I was gonna have one thing for myself, I think was most impressed with the statue and the backpack honestly, like it's kind of cool that I'd haven't need little backpack that is a little nerdy but just not too nerdy. I guess now that we've unboxed everything, why don't we play the game for a bit and see how that looks. So now I'm playing The Last of Us Part II with my fancy new remote and my fancy new headphones. I think it's one of those headphones that you're not gonna buy and if you can buy nicer ones but they're okay. If I had them at home I think they would hang up on a pedestal just to look cool. This game looks unreal, unfortunately, because we're recording to Nogato there's no HDR but if you have a PS4 Pro and an HRTV, this game looks insane. So on PS4 Pro runs at 1440P locked 30fps, there's a few dips and on regular PS4 it's just 1080p 30fps and it's actually more consistent. This is one of the best looking games I've ever seen. The detail, the lighting, there's no ray tracing, but Naughty Dog has worked to kind of fake it where if you walk through an area that's like all red leaves or all green leaves, like it'll kind of look like it's bouncing and your character will have a cask. It's the little things. We've had kind of footsteps and snow for a long time or mud and characters getting wet but this game has just a technical proficiency and an attention to detail that I haven't seen executed so well before. Man, I can't wait if there's ever a PC part of this or even just the next gen version that'll actually run at 60 frames, Oh buddy. I am so lucky that I got to inbox this guys. I'm really happy that I got to share it with you guys. I've never seen a press box that cool. I was blown away, I didn't know that things like this existed and so I'm happy that we got to do this together. You, me together, you me. Thanks for watching short circuit. That was so much fun. That was really fun to unbox this with you guys. If you like unboxings, we have plenty of other ones. You can check something else out on our channel. If you want more of me, Riley@James. we also have our couple critics movie podcast where we talk silly things about movies all the time.",
    "transcript_keywords": [
        "game",
        "Part",
        "nice",
        "Ellie",
        "kind",
        "pretty",
        "cool",
        "thing",
        "stuff",
        "Naughty Dog",
        "video game",
        "playing",
        "play",
        "guys",
        "things",
        "people",
        "tattoo",
        "fun",
        "box",
        "detail"
    ],
    "transcript_entity_values": [
        "Ellie",
        "number 169",
        "PS4",
        "a PS4 Pro and an HRTV",
        "only 200",
        "60",
        "one",
        "the coolest days",
        "Abby",
        "Us",
        "PS4 Pro",
        "YouTube",
        "200",
        "1440P",
        "Us Part II",
        "Naughty Dog",
        "Neil Druckman",
        "first",
        "two",
        "The Last of Us Part II",
        "Nogato",
        "69",
        "The Purpose In Loss",
        "PlayStation"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "EVENT",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT"
    ]
}