{
    "id": "R6NastrlWnU",
    "title": "I'm switching to e-ink! - BOOX Tab Ultra",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-12-22T20:03:53Z",
    "video_url": "https://www.youtube.com/watch?v=R6NastrlWnU",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy"
    ],
    "views": 700445,
    "likes": 20635,
    "comments_count": 1102,
    "description": "Thanks to MANSCAPED for sponsoring the video! Get 20% OFF + Free Shipping at   Riley loves tablets, but usually recommends the iPad when asked which people should buy, but when Onyx sent us their new BOOX Tab Ultra ePaper/eInk tablet with full-featured Android running on it, Riley knew he had to get his hands on it.  Buy a BOOX Tab Ultra:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Riley is full of beans today 1:16 Unboxing the tablet, pen, and keyboard cover 3:07 Design impressions and IO 4:57 Sponsor - Manscaped 5:28 Does an ePaper tablet make sense? 6:15 Going through the settings 7:30 Comparing refresh rates 8:13 Comparing quality between modes 9:14 Unique auto-rotate features 10:19 Speaker/Display impressions - Crab Rave 11:34 Sketching impressions 12:42 Handwrite-to-text and Keyboard typing experience 13:21 Trying out the camera 14:07 Reading experience 14:27 Gaming? - Genshin Impact 15:11 Overall thoughts 15:32 Outro",
    "description_links": [
        "https://manscaped.com/CIRCUIT",
        "https://geni.us/Qsdjn",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Editor. (Riley clapping) Editor, go on my face to start and then I'm reading this, so show this pretty quick, okay? (Riley chuckling) Boox! (Riley laughing) Hey, everybody, it's a Boox. Make a different in the world. Make a different product, which is what the Boox is. (Riley laughing) I can't say the name of the product without laughing. Boox? Really? (Riley laughing) It's a variant on, it must be like book. Because if you don't know, this product is a tablet, it's an Android 11 tablet with an e-ink screen. So I guess, obviously, when you think e-ink screen, you think e-readers. Reading, what do you read? You read books. Books are spelled with a KS. Let's change it to an X for fun. Boox. (Riley laughing) I actually was interested in this product when it popped up in the queue because I'm like, listen, I'm the iPad guy, right? This is a tablet, but it's got a e-ink screen, that's very interesting. But it's got also an iPad-like keyboard folio. It's called the Tab Ultra, which is a Samsung thing. We got Apple in here, we got Samsung, we got Kindle. It's all the same. Okay, this is kind of cool packaging. I like that. It feels premium. Okay. Oh. Wow. It's kinda hefty. I mean, apparently, it's only 6.7 millimeters thin, but how much does it weigh? That's my question. Apparently it's 480 grams, so that's something. But before we get deeper into there, let's dive deeper into the box. Okay, we got a stylus that I will look closer at later. We got a USB-A to C cord. Quickstart guide. Now, I've ignored the quickstart guide before, to my peril, so I'm just gonna take a quick gander, okay? Nice. I read the quickstart guide. So hopefully, this thing will go smooth as a baby's bottom. Now we also have, before I really get into that, we also have the fancy iPad cover. Are they gonna sue me for saying that? Come at me, Boox. This immediately feels very similar to the iPad one. Oh, nope, it's got more of like a leathery feel. Ooh! You know what? I was viewing this product in such a derogatory way. I was like, (Riley blowing raspberries) \"Who's gonna buy this thing?\" I thought it was kinda cool, but like, a lot of the times, I'm interested in kinda niche tech products that a lot of people aren't. But now I'm looking at it and I'm like, yo, this looks premium. There's a different colored key. That's really the main contributor to me changing my mind about this. I have to have a specialized. Oh. (Riley grunting) Oh, now it's dirty. Okay, the stylus, I gotta say right off the bat though, it feels nice. It's like the Apple pencil in the sense that it is like the actual real size of a proper pencil. Once again, I'm sorry. I'm sorry, Boox, for making fun of you in the beginning because this feels nice. $600 for the tablet, the folio, the stylus. And if I spent $600 on that and I got this, it feels premium. I mean, we got to this kinda like metal, brushed metal type of thing going on in the back. They say it's an anti-fingerprint coating, although I do see some marks on it already. On this side, I don't know if that counts as the bottom, we got a, I'm not gonna call it a smart connector, I guess, pogo pins. Oh, and it also tells you how fast it can charge as well. Five volts at three amps. That's 15 watts. Okay, and on the, I guess, on the left side, looking at the screen we got, I guess that must be the power button and a fingerprint reader? It is! It is a fingerprint reader. Nice. This is a speaker. This might be a mic. I think this is an indicator light perhaps, but we'll find out when we turn it on. On this side we have, oh, this is the magnetic mount for the stylus. Boom, just like an iPad. Look at that. Once again, I feel taken care of. (stylus thudding) Oh. If I did it like that, it will come off the iPad too. I think the real test is whether you can shake it up and down like. Oh! Ah! I had it on wrong. Jake, I had the pen on wrong. It's doing great now. (Riley laughing) And on the, I guess, right side, we have another speaker, stereo speakers, nice. And a SIM card slot. Oh, my bad. This is not a SIM card slot, it is a SD card slot, which they call a TF card slot and agree to disagree. Oh, a USB-C, right, which is why the card came with that. And on the back of that camera module, I don't know what the specs are right now, I will find out later after this word from our sponsor. You like that? This video is brought to you by Manscaped. You know, Christmas is right around the corner and their new Performance Package 4.0 will make a great gift for your partner. The package includes their waterproof and cordless Lawn Mower 4.0, their Weed Whacker ear and nose trimmer for tricky trimming, and their Crop Preserver and Crop Reviver for your deodorizing and hydration needs. For limited time, you'll also get two free gifts, the shed travel bag and the Manscaped anti-chafing boxer briefs. Don't wait, go to manscaped.com and use promo code Short Circuit for 20% off, plus free international shipping. Go, turn on. Ooh. Oh man, that really made me feel like I was about to play some Pokemon. I'm intrigued by the idea of ePaper tablets, but I think that there's a reason that they haven't become incredibly popular, except as e-readers, which is primarily the fact that, you know. Ooh, the backlight kicked in. That's cool. The fact that the refresh rate necessarily has to be lower for an e-ink screen than it is for an LCD, a regular type of screen. But Boox apparently has multiple refresh modes where there's like an HD mode for reading books with a low refresh rate and then there's a balanced and a high refresh rate and super high refresh rate. As I swipe, nothing's happening until I complete the swipe and then it decides to refresh. But I'm gonna wanna go into the settings right away and try and get to the faster refresh rate. Just like scrolling a little bit like that, I'm skipping past four items. Here's power. Power is gonna be at the bottom. Even if I just scroll like a little bit. So that's something that's kind of annoying to me right off the bat. I want to be able to just adjust a little bit. The other thing that's jumping out to me is this is Android 11, but this looks like iOS. There's a sidebar with all the categories and then over here you've got, once you click into a category, it's gonna show you the option. Anyways, display, full refresh frequency. What does that mean? Oh, every five taps, it's gonna fully refresh the screen instead of partially refresh it? There's Genshin Impact on here? - [Bell] You love Genshin Impact. - I mean, it is on ultra fast. - [Brandon] Does it work? - Okay, so you can set specific apps to have certain types of refresh rates. We got HD mode, balanced mode, fast mode and ultra fast. And ultra fast has even heavier detail loss, but suitable for playing videos? Oh, my gosh. Wow. So this is in ultra fast mode and even just when nothing's happening on screen, it degrades the quality in order to have that higher refresh rate. So I had to look close to see. This text looks pretty rough. I mean, like I said. Okay, so right from the control center, you can get right into refresh modes and I guess you can change it while you're actually in the app. I'm opening the Boox website and I'm scrolling. Okay, we have finer control over scroll. Okay, let's see. Fast. Is that better? I can't even tell, I think it's like a little bit better. - [Brandon] It looks the same. - But not that different. Let's go to ultra fast. I mean, okay, so that's noticeably smoother. That's interesting. So if you can just go to the control center, you can, oh okay. You can adjust the backlight. It's not just on and off. There's levels to it. That's pretty cool. What's the moon thing? Wait, what? Oh, it is dual tone. That's what they mean by dual tone light is that you have a backlight that is cool and you have a backlight that is warm. Oh, you can have them both at max for a mix. Can I zoom in? Ooh, look at this. I'm zooming in on paper, but actually, so I'm in ultra fast mode. I'm gonna switch real quick to HD and see if that makes the image look any better. He's got ghosting lines all over. Oh, I'm the ghost of Linus Sebastian. Can you see the. - [Brandon] Oh yeah. - That's weird. Because I had it set to five taps, it let me kind of tap around five times before it did a full refresh and got rid of the ghost image. So if I zoom in here, we have that ghost image there until I do a number of taps and then is it gonna do a full refresh? Maybe it knows when I just stop touching it for a bit? Yeah. And then it's like, \"Okay, lay off for a second so I can do the full refresh.\" I'm fairly happy with the browsing experience, especially like scrolling like this. This is an e-ink screen, that's pretty impressive. This thing has a 1872 by 1404 resolution and it's a 10.3 inch screen, which I never said, although you should be able to tell based on you knowing exactly how big my hands are. Okay, we're back to the super premium feeling keyboard. This thing is about to go from janky e-ink tablet to the most premium. Ooh. So you can set it to auto-rotate like a normal device or you can set it to only auto-rotate to the flipped orientation that you desire for it. - [Brandon] It's kinda awesome. - It is kind of cool. If you're like, I'm only using this to e-read, to read books and I only read books like this, so I only wanted to know if I, like, in my bed and I have my phone upside down or something. Okay, I'm in the keyboard folio and now this is interesting. Unlike an iPad or. I turned auto-rotate off. Oh, keyboard access auto landscape. And they may have keyboard shortcuts. Cool. So I guess it's saying when you connect it into the keyboard folio, it'll automatically go to landscape. But I thought it wasn't doing that. Then you got keyboard shortcuts here, which is actually pretty cool that they tell you right upfront. But it only applies to the Onyx official keyboard, which is this thing. So you can use other Bluetooth keyboards with it, although it comes with it. So that might be kind of weird. (tablet beeping) Oh, I thought that was part of the Crab Rave, but no, it tells you. (Riley imitating tablet beeping) This is so funny because there's also ghosting. (\"Crab Rave\" playing) Hello? It sounds a little less offensive when you turn the volume down a little bit and it's not trying so hard. At max volume, that definitely sounds obviously distorted. It doesn't sound very good. Just the fact that this is an e-ink tablet and I'm playing a video with sound on YouTube, that's fun. That's fun by itself. This entire time, the video's been playing the ghosting from various other things. App icons, the control center, pinched to zoom, that's all there. If I was using this for either work or for reading and someone sent me a video and I wanted to checkly. Checkly. And I wanted to quickly check it, I get the gist of what was going on. (\"Crab Rave\" playing) Very blurry. Okay, just for giggles. Jake, humor me. I'm gonna play the video in HD mode, which is the lowest refresh rate. Whoo. (Riley chuckling) You see that? (Riley imitating upbeat music) The speakers weren't incredibly impressive, but they'll do the job. A big use case of this other than just reading books is taking notes. They have the pen and everything. And you know, I'm sure that's part of the marketing is that \"Oh, this is a device you could get, take nice notes with.\" So let's open the notes app. I'm guessing this is Boox's own notes app. If I put my hand on nothing. Wait, but I thought we were not, we were just in regular HD mode. Hello? Because it seems pretty responsive for an e-ink screen. Honestly, that's crazy. The stylus apparently has 4,096 levels of pressure sensitivity, which is a number that I remember being associated with other styluses that I've used. So I'm going very lightly. It's a thin line and then I press, it gets thick. Thin, thick. Yeah. Nice. The notes app seems cool. Real quick, I wanna see the multitasking. Is there no multitasking menu? Even when you set the default home screen refresh beat to ultra fast, when you scroll on something like this, it doesn't scroll like the webpage incrementally, it just jumps, which is annoying. But this is kinda cool. When you swipe to the right from the home screen, you get this little launcher place where you got your library with a number of books that I imagine that you might be reading recently. Let's go back to notepad because there's a couple features I just wanna look at. Hello. Nice. Bro. Broo, with two Os. Nice. But if I wanted to actually type with the keyboard. Typing experience is pretty good. The keys feel kinda mushy. Yeah, there's not as much of a tactile bump as I would like. They definitely feel, I think at first glance, you feel them and you're kind of like, \"Ooh, that feels kind of tactile.\" But there's a lot of travel distance. There's more travel distance than I would like. It's just like, \"Oh, you wanna press me? Oh, okay.\" So on the back, there's a 16 megapixel camera, but I couldn't find a camera app. So it might be that it's called the smart scanner because it's only really meant to be used to scan documents. That's so funny. Okay, smile. Here's your photo. What do you wanna do with it? I can import it, I can go to the next step. All right, here we are. Crop it. You can rotate it, you can hand write on it, add text. You can detect text in the document, right here on the tablet? And then send it to your notes app or create a PDF. Okay, I can send to a note, I can send it over Bluetooth. Use Onyx mail. Nearby, you can use nearby share, like Android's feature? Yeah, this is like the default Android nearby share. So it's like air-dropping, but for Androids. The problems of philosophy. Gimme a little sample. Boom. How do I change the view and stuff? I don't know how people use, I've never used an e-reader this big, so I don't know how people read. I would want the text to be smaller and there must be a way to do that. I don't know how to do it though. Anyways. (Riley laughing) The reading seems fine. But what I'm really interested in is gaming on the e-ink, on the Boox Tab Ultra. Because yeah, this thing has, we installed Genshin Impact on it. Can you play that with just the touch controls? I've never played this game. They don't say in the specs page what the actual CPU is. It just says Qualcomm octa-core. There's four gigs of LPDDR4X RAM and 128 gigs of storage. Okay, will it go in the background if I go to the home screen? Hopefully. - [Speaker] Who are you? (indistinct) - Okay. This is me gaming. (Riley laughing) We wanted to open Genshin Impact for the memes, but that didn't really work out. In conclusion, I came into this thinking that this was just gonna be like a janky fun little tablet, but this is like a full featured Android tablet. With the whole app ecosystem, with the refresh rate that actually makes it usable in some cases that you wouldn't expect an e-ink tablet to be able to be usable in. Overall, I'm pretty impressed with the usability, with the build quality. More impressed than I thought I'd be. Thanks for watching, Short Circuit. That's us. If you wanna watch more videos, click this one somewhere to watch one of my iPad ones. And I love you and never leave.",
    "transcript_keywords": [
        "refresh",
        "refresh rate",
        "Boox",
        "kind",
        "screen",
        "ultra fast",
        "eink screen",
        "Ultra",
        "thing",
        "fast",
        "eink",
        "tablet",
        "cool",
        "Genshin Impact",
        "keyboard",
        "Nice",
        "mode",
        "rate",
        "full refresh",
        "app"
    ],
    "transcript_entity_values": [
        "Crab Rave",
        "15 watts",
        "iPad",
        "Android 11",
        "Kindle",
        "Jake",
        "Qualcomm",
        "three",
        "only 6.7 millimeters",
        "Riley",
        "20%",
        "the Crab Rave",
        "Boox",
        "second",
        "Genshin Impact",
        "1404",
        "max",
        "10.3 inch",
        "Samsung",
        "Performance Package 4.0",
        "Genshin Impact",
        "128",
        "480 grams",
        "ePaper",
        "Brandon",
        "Linus Sebastian",
        "first",
        "4,096",
        "TF",
        "Five volts",
        "Weed Whacker",
        "two",
        "Pokemon",
        "Android",
        "four",
        "LCD",
        "600",
        "the Boox Tab Ultra",
        "Manscaped",
        "Short Circuit",
        "LPDDR4X RAM",
        "the Tab Ultra",
        "SD",
        "KS",
        "Androids",
        "Christmas",
        "five",
        "Genshin",
        "YouTube",
        "CPU",
        "1872",
        "Apple",
        "16 megapixel",
        "Onyx"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERCENT",
        "ORG",
        "PERSON",
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "EVENT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG"
    ]
}