{
    "id": "R_8BsUZIHgc",
    "title": "The Cheapest Gaming Laptop GPU - How Good Is It?",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-08-01T20:26:16Z",
    "video_url": "https://www.youtube.com/watch?v=R_8BsUZIHgc",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Nvidia",
        "Cheapest Laptop",
        "Cheapest Gaming Laptop",
        "Best Gaming Laptop",
        "Best value",
        "GTX 1050",
        "GTX 960M",
        "GTX 950M",
        "Overwatch",
        "940MX",
        "pubG",
        "benchmarks"
    ],
    "views": 605652,
    "likes": 14189,
    "comments_count": 1092,
    "description": "Dave2D review of the Nvidia MX150 - the best value for cheap gaming laptops. MX150 Laptops -   Music Credits: Background: Fili - Closure  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2u12iH0",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going Dave 2d here so this is a video on the Mx 150, the new laptop GPU from Nvidia and There's a little bit confusion with this chip because the naming system isn't normal the whole Mx and then number isn't something they've done before in the past so I thought I would do a little video that kind of talks about the GPU This is a Laptop GPU that was derived from the same chip as the desktop GT 1030, but it's surprisingly faster Which is weird right because this is the laptop version, so a few days ago I did a video on this thing the acer aspire 5 and I showcase some games playing at 1080p on high graphics settings and a lot of people were interested in this thing But they wanted to see other games at other resolutions other graphics settings So I thought I'd just kind of spend some time in the weekend played a ton of games I have some more data lightweight titles are handled easily on this GPU so shooters mobas, whatever you want you'll comfortably be able to hit 60 frames per second at 1080p on Ultra Graphics even something like Diablo 3 which can get Graphically intense will float above 70 frames per second with overwatch at 1080p I had to drop it to high settings to keep good frame rates, but it still looks really good Games that are more demanding. You'll have to drop it to medium settings at 1080p To stay close to sixty frames per second and remember you always have the option of lowering your resolution to keep your framerate up But let's step back for a moment a lot of these games are triple-a titles these are Flagship games are often used to benchmarks high-end desktop graphics and now a six hundred dollar laptop Can play a lot of them at 60 frames per second that's crazy The thing that this thing replaced like the GPU that this thing replaced is called the 940 Mx and that thing could not handle most of these games at 1080p This is really cool. There are limitations though the Heaviest Games like witcher 3 and Gta 5 they can still run but you have to put it the lowest resolution And graphic settings just to keep up smooth frame rates So yeah, if you're only going to be playing these ultra demanding games Then you're going to need a better GPU something like PUBG dusting is not a well optimised game So you'll need to lower the resolution and graphics settings to make it smooth Overall I'm really impressed with the Mx 150. It's a lower-end GPU that's designed to fit into the whole mid tier laptop segment But the performance is surprisingly good. It really is twice as good as a 940 Mx. That's replacing It's kind of in-between the 950 m and 960 m from last year but it's not as good as the GTX 1050 and I'm not saying this is the greatest GPU ever but these $600 mid-tier laptops are very capable for gaming. Now I want to mention a few other things first the CPU and GPU Combination that you see in this thing is actually pretty common for this particular GPU so it's a 7200U It's a Kaby lake CPU and the Mx 150 and when you look at the internals you'll often see a single heat pipe and at First you might think oh my God This is terrible a single heat pipe for both components But remember this is a 15, watt CPU a lot of gaming laptops have quad-Core 45 Watt CPU that just produce a lot more heat so the thermal management on this thing is actually very sufficient Another thing if you'll notice I don't have an FPS counter in any of my game footage And if you're wondering why it's because this CPU isn't great for recording while playing games the moment I start recording the frame rates drop a good seven to ten frames per second And I didn't want to have you know inaccurate frame rates reading up at the top So you'll have to refer the graphs for performance, but if you're looking to pick up this laptop to stream It's not a good idea And the last thing I want to mention is that this thing does not have shadow play so in the menu There's often this feature by Nvidia that allows you to record gameplay While you're playing that feature seems to be disabled on the Mx 150. I don't think it's specific to this laptop I think it's across all the Mx 150 laptops, but yeah, it's missing. Okay, so that's it for this video Hope it cleared some things up some of you liked it subs if you loved it. See you guys next time",
    "transcript_keywords": [
        "high graphics settings",
        "graphics settings",
        "GPU",
        "data lightweight titles",
        "Graphically intense",
        "ultra demanding games",
        "frame rates",
        "laptop GPU",
        "games",
        "frame rates drop",
        "thing",
        "good frame rates",
        "high graphics",
        "highend desktop graphics",
        "high settings",
        "settings",
        "graphics",
        "Flagship games",
        "Ultra Graphics",
        "frames"
    ],
    "transcript_entity_values": [
        "Gta 5",
        "60",
        "Dave",
        "600",
        "CPU",
        "GPU",
        "Ultra Graphics",
        "940",
        "GPU Combination",
        "the Heaviest Games",
        "First",
        "150",
        "second",
        "1080p",
        "a few days ago",
        "950",
        "GTX",
        "Mx",
        "the weekend",
        "sixty",
        "quad-Core 45 Watt CPU",
        "3",
        "first",
        "GT",
        "7200U",
        "a good seven to ten",
        "15, watt CPU",
        "six hundred dollar",
        "960",
        "70",
        "last year",
        "5",
        "FPS",
        "Nvidia",
        "Kaby"
    ],
    "transcript_entity_types": [
        "LAW",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "EVENT",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC"
    ]
}