{
    "id": "r_cP5B8apKo",
    "title": "THE CRAZIEST SWISS ARMY KNIFE",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-06-29T16:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=r_cP5B8apKo",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadget",
        "gadgets",
        "unboxing",
        "review",
        "swiss army",
        "swiss army knife",
        "swiss",
        "army",
        "knife",
        "pocket",
        "pocket knife",
        "best",
        "test",
        "vs",
        "innovation",
        "edc",
        "things",
        "inventions",
        "cool",
        "new inventions",
        "4k",
        "apple iphone",
        "futuristic",
        "new",
        "iphone",
        "samsung",
        "android",
        "knives",
        "2016",
        "awesome inventions",
        "weird",
        "video",
        "invention",
        "future",
        "cool gadgets",
        "new gadgets",
        "new technology",
        "android (operating system)",
        "top",
        "durability",
        "cool inventions",
        "survive",
        "unbox",
        "knife (sports equipment)"
    ],
    "views": 3751503,
    "likes": 64705,
    "comments_count": 2913,
    "description": "(   ) --- Today's Mystery Video -   Swiss Army SwissChamp XAVT -   My childhood dream has come true... This might be the ultimate Swiss Army knife!  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/LnFWkmDSXTI",
        "http://amzn.to/292Fack",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys? Lew here back with another video And today, I have something that means a lot to me because when I was a kid I was really into these things Well maybe not this one exactly but Swiss Army Knives in general. The idea of a multi functional, multifaceted object A gadget if you will. In fact one of my very first gadgets I ever had was a pocket knife This thing in front of me is the top enchilada The big cheese in the world of Swiss Army Knives The childhood version of me would appreciate this moment. Lets crack her open! Oooooh! Ha Ha practical. I don't know about that What do we have here? Okay, a battery of course? Oh my goodness, an altimeter, barometer, watch. All on this little screen right here. You know, it's still pockitable though. Maybe I was a little over the top in terms of practicality. I mean if you could only have one tool you know how they always say if you go to a desert island and you can only take one record with you for the rest of your life what would it be. what if the same question existed for one pocket tool. alright, battery. ahhh that is cool! the swiss army logo is a button. This is a watch style battery right here There we go! oooh! (beep) barometer, timer, alarm, stopwatch, temperature. It's got a thermometer on it and then the time which I haven't set yet Wow! what are we working with, alright, flathead blade bottle opener larger flathead and can opener. Right right right can opener versus cap lifter magnifying glass, never know when you might need that you might be looking for Jack Philips, solid Philips by the way pliers a screwdriver with like a Torx bit and you can flip it and change it out oh wow, and there's actually extra bits in here another little Torx, a flathead, a couple of options What is this It's a flashlight! Can you make that out? Ha! Oh! A little saw blade Style That's an even crazier saw Look at those teeth. Cut some twigs with that I need to know what that is. A reamer or a punch is what that's called Thats, look at that! The classic The classic knife blade is still on there somewhere trying not to stab myself here i don't think you're intended to like open them all at once scissors do we have scissors here. What an amazing contraption here. I'm also noticing a ruler in here i almost missed that, inches and centimeters on the other side A file, with some little tiny teeth on it aswell What's this? Ohh I gotta lot that one up. Uhh Pharmaceutical spatula. Got to be your favorite Jack right there Wow am I ever running out of space here A pruning blade, so there you have it Various can opener, bottle openers, pruners, blades, serrated blades, flash lights, screwdrivers, corkscrew Holy! You got it all little, you've even got tweezers toothpick and a pen. I also missed that, like a pretty good pretty good sized pen there Obviously not the most practical version of each of these tools but when combined but seriously though, use one tool at a time. The right tool for the job",
    "transcript_keywords": [
        "Swiss Army Knives",
        "Swiss Army",
        "Army Knives",
        "swiss army logo",
        "Army",
        "Swiss",
        "Knives",
        "opener",
        "blade",
        "tool",
        "Wow",
        "guys",
        "battery",
        "flathead",
        "Knives in general",
        "Jack Philips",
        "Philips",
        "Torx",
        "Jack",
        "army logo"
    ],
    "transcript_entity_values": [
        "flathead",
        "Jack",
        "Torx",
        "Philips",
        "Lew",
        "today",
        "first",
        "Jack Philips",
        "Swiss Army",
        "Swiss Army Knives",
        "the swiss army",
        "one"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}