{
    "id": "rBYjlgwmf0E",
    "title": "It tried so hard and got so far… - REDMAGIC 4K Gaming Monitor",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-11-20T21:20:57Z",
    "video_url": "https://www.youtube.com/watch?v=rBYjlgwmf0E",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "redmagic",
        "gaming phone",
        "gaming monitor",
        "4k",
        "160hz",
        "pro",
        "esports",
        "miniled",
        "LED"
    ],
    "views": 187251,
    "likes": 6324,
    "comments_count": 417,
    "description": "Check out RhinoShields Black Friday sale and save up to 55%% off:   REDMAGIC is known for their line of gaming phones, but now they're entering the competitive gaming monitor market. With a 4K 160Hz Mini-LED panel, eye-searing brightness, and a (relatively) low price tag, is this the new gaming monitor to beat? Plouffe is here to find out!  Buy a RedMagic 27\" 4K Mini LED Monitor:  Buy an LG UltraGear 27\" 2K OLED Monitor:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Boxing 0:48 Unboxing 2:26 Design and stand impressions 4:29 I/O walkthrough 5:07 Sponsor - Rhinoshield 5:41 Cable cover, RGB, and OSD 7:03 LABS minimum brightness test results 7:53 Response time impressions 8:53 HDR impressions and LABS test results 10:21 Gaming and colour impressions 10:52 Overall thoughts and pricing 12:07 Outro",
    "description_links": [
        "https://url.rhinoshield.io/ShortcircuitBF",
        "https://lmg.gg/ETLw3",
        "https://lmg.gg/MiYHa",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "Red Magic makes phones, but can they make a gaming monitor? Normally we get these things right out of the box real quick, but this box is actually pretty neat, so we're gonna take a look at it. First of all, I'd like to point out, it is a mini-LED gaming monitor, 27 inch, if that wasn't clear. It's got G-mooage, whatever that might be, a bunch of specs here, and then on the side here, we've got the Red Magic logo. We got this cool black and white silver dude coming out of the monitor on the box, and then on the bottom, win more games. That's pretty good. It actually is a pretty decent display. It's 4K, not 60, but 160, so like 4K is finally seeing some pretty high refresh rates at reasonable prices, which we'll get to later. Ah, there we go. Ba-da-bing, ba-da-boom. We have a power cable, external power source, for those of you who really crave that. All right, it's not G-mooage, it's GM001J, looks to be the product name. And inside this bag here, we got a bunch of cables. The USB-B cable, we got a Type-C cable. We'll get to the IO later, but this does have a 90-watt power delivery on the USB-C cable. Got our HDMI cable, probably 2.1, does it say on here? Oh my lanta, it does, signal cable, ZH HDMI 2.1. We got our DisplayPort cable, 1.4, but you're gonna need this if you wanna do 4K, 160. We've got our user manual for the GM001J. It's reporting some pretty decent numbers with a really low average Delta-E. Based on what I've heard, I don't quite believe that, but it is pretty good, so we'll get to that later on. Here's our stand. This is beefy, and I've never seen one that's this big, so I'm excited. And then we got the other part of our stand, the bottom. One nice note, we've got the two-column support, so this thing's going nowhere, just like Spider-Man. Okay, so there's a cable cover in here. We just take this off, so you just pop it up, take it off. Run your cables through the side right here, and then you, and there you go. That's actually pretty good. And we've got our panel in the box. I love the back of this thing. It's a cool triangle with, I'm hoping, RGB, but we'll see. Wow, oh, it's not too bad. It's like seven kilos when the stand is on. I figured this out. It's probably a headphone hanger. I really don't know what else you would use this for, and I'll be honest, I don't like that it's behind the monitor instead of on the sides, because I don't wanna reach around to put my headphones away, but I'd rather have it and not need it than need it and not have it. Aside from that, I wanna talk about the design, because they call it RoboAesthetic Hardcore Attack. Now, to me, it just looks like a monitor. I admit, I do like the cool triangle on the back, but I don't really get where the RoboAesthetic is coming in to, that cable cover comes off way too easily, by the way. I don't know, maybe it's just me, but be careful if you're handling this thing. But let's talk about all the other stuff we wanna see, like wow, okay, height adjust. Wow. One thing I don't like is the chin. Personally, now that I'm feeling it, there's this huge gap here, and there's this giant chin here. I don't know why that is there. Maybe there's an IR remote or something, but there wasn't one in the box, so I don't know what it's for. We'll find out later. Maybe it's for the OSD or something like that. But what I love is, not once, but both ways, baby. You might not think that's a big feature, but some monitors can only pivot one way, and if you really, especially with the chin on the bottom here, if you wanna make this vertical someday, you really wanna line everything up nicely. Imagine if your monitor's here, and you've gotta match this chin bar with your other monitor, it's gonna look bad. So thankfully, you just go the other way. Yeah, I really don't like this weird crevice that's going on here. I don't know if that's where all the IO is or something, but it just feels kinda janky. And then I don't like the chin. I know I mentioned that already, but I really don't like the chin. Otherwise, it seems fine. We've read some reviews, because this is out already, and some people online are complaining about the build quality and all that. I'm not gonna say it's amazing or anything. I don't think it's that bad. Although, this top cap is kinda missing. I don't know if it just got lost in labs or what, but we don't have ours. As for IO, we've got a couple of USB-A ports, USB-B, USB-C with 90-watt power delivery, and DisplayPort, as well as DP 1.4 right next to it, two HDMI 2.1s, headphone jack, and a power connector. I've complained in the past about plugging things in from the bottom, and how I like how LG and Corsair do it, where you just plug it straight into the back, and I'm gonna complain about it here, especially because, yeah, it's got this whole cover thing, and it's gonna be a massive headache to try to get cables in and out of there. Don't like it. I'm gonna plug it in and power it on, take a look at this RGB on the back, but not before a word from our sponsor, RhinoShield. Their Black Friday sale is on now, and you can save up to a whopping 55% off. RhinoShield is known for its protective, monomaterial phone cases, which can be easily recycled. Check out their Mod NX case with its super-strong magnetic back, satisfyingly clicky buttons, and protective shock-spread technology. Or the SolidSuit, with its grippy design. And check out their DYOC function on their website, where you can upload your photos, use their library of stickers, add text, and let your imagination run wild. Follow the link below and check out the massive sale today. Minor correction, this is on a cable cover, so you can take this on or off. I still don't really like it, because it's hard to get back on. Get on there, cable cover. Yo, check it out! It's doing it! It's got RGB, and you know what the cool thing is? It's not just like LEDs that shine. It's actually covered in something. It looks pretty cool, but it's a little dim. We'll see in a second, once I turn it around, if it splashes off the back wall very well. Other than that, I don't know if I'm crazy about the segmentation on the pattern here. I kind of would prefer if this was just one giant diffused light source, but you know, to each their own. Maybe someone out there likes it. I still don't really get what the chin is for, other than maybe a handle to pull the monitor down. On the back, we've got a navigation nipple for the OSD. Out of the box, it'll come calibrated for sRGB, DCI-P3, and Adobe RGB, which is pretty handy. So on most monitors, you press the button to go into the menu, or you press the button to, at the very least, action on whatever you're on in the menu. With this, it just turns it off, and that feels really bad. I'm gonna try really hard to not do that again, but there's a good chance it's gonna happen. So, okay, so this is just the navigation. That's good. Otherwise, this looks like a pretty standard OSD. You can change your color temperature, hue, saturation, brightness, all that. One thing that we wanted to talk about is that this doesn't actually get that dim, and so while the vast majority of you won't care about that, most people use their monitors at at least 50% brightness, if not max, and they want brighter is better, but some people, especially ones who are sensitive to light, wanna keep their monitors dim, or if they live in a cave, or if they're like me, and they're in the basement with all the blinds closed and everything, they want it a little dimmer. You can't do that with this one. The lowest this monitor is going to get is 130 nits, which is kinda wild. You wanna see at least 50 to 60. It's got 1,152 local dimming zones, which is fantastic on a screen this size, only 27 inches. The RGB is not doing anything on the back of this wall, so don't expect it to light up the back of your monitor or your gaming station or anything like that. Now, with 160 hertz, you're usually gonna have a pretty smooth experience. As for response time, we measured about 5.5 milliseconds. We recommend not turning on any overdrive. One cool thing I'm noticing as I'm watching the frogs go across here is you can really see the local dimming try to do its magic. I'm seeing a ton of flickering all up in here as the white frog is passing across this gray background. It's not a super pronounced effect, but it's a bit of strobing that might bother some people depending on the game they're playing. This is just an IPS panel, but it's not bad. There's no major trails on any of the frogs, just a kind of like small blur on the back of them, which is pretty standard. One thing to note is you probably want to keep variable refresh rate turned on because with it off, we actually noticed that there was more latency, but it went from 3.8 to 9.8, introducing about six extra milliseconds of latency. It's especially weird because the local dimming isn't adding latency either. We tested with it both on and off, so just keep VRR on. One of the problems with HDR with this monitor and often with mini LED in general is while it has all these dimming zones because it's trying to fight bloom, it has trouble getting super bright in the 1% window screen. So what you end up with is it'll do crazy full bright, but then when you get to the 1%, 5%, 10% windows, like those pinpoints of brightness, it's more like 500, 600 nits, which is okay. It's still bright and HDR with local dimming is still going to look a lot better than HDR without local dimming or SDR content in general, but it's a key feature that OLED still wins in. For example, in this display, we measured a 1% window of 640 nits, and then in HDR, full screen brightness went all the way up to 1575 nits, which is pretty crazy. I can't see much blooming just when I'm watching content on here. Like that's one thing I'd like to point out. Ooh, no, you can see it. When my mouse is over a black spot, you can see it bloom. However, with over 1,100 zones, it means that that blooming is going to be very minimal. So instead of trying to light up a square, you know, like this big, it's going to be lighting up one like this big. And so that bloom is going to be much less pronounced than it would be on a monitor with say 500 zones. I can make it out in person just barely. Those 1,100 plus zones are really putting in some work, but if I kind of just, you see how it gets a little bit whiter around the crosshair? It's definitely noticeable in person, but it is pretty minor. Honestly, everything looks okay. I can definitely tell that it's an IPS panel. The whole thing looks a little bit washed out compared to more high contrast displays like OLED or even VA, to be frank. It doesn't look bad necessarily. It's just, once you get used to a certain thing, nothing else looks as good. That being said, the colors pop. They're pretty vibrant. The green, especially, that was showing up right there. I really like these, the blue outline for the glory kill stuff. It looks great. Honestly, it's okay. I'm not like crazy sold on this thing. I also think that 4K is just kind of wild. Like this is Doom Eternal. The game is pretty old. Yeah, we're getting 200 plus FPS, an ultra nightmare, but it's also Doom Eternal. Nothing else has come out that's like this optimized. The thing about this monitor though is it's 4K, 160, color accurate, mini LED, 1152 dimming zones. It's a lot of features and it's 869, 769 right now on sale. It's really hard for me to recommend something like this at this price range, because when you go up to about $1,000, you get the LG 240 Hertz OLED. It's only 1440p. I get it. However, gaming at 4K is not easy. So unless you've got like a 3090 at least, if not a 4090, good luck getting proper frame rates on today's games that keep coming out unoptimized. At the sale price, it's a bit more enticing, but if this thing is only MSRP, I just can't really recommend it, unfortunately. Either save up just a little bit more and get the LG or save money and get a four or $500 1440p gaming monitor. I think you're better off. This is ShortCircuit. I'm Bloof. This is the Red Magic 4K gaming monitor and it's pretty cool. If you wanna check out another pretty cool monitor, check out the Alienware 500 Hertz. Pretty fast.",
    "transcript_keywords": [
        "pretty",
        "monitor",
        "thing",
        "cable",
        "back",
        "Red Magic",
        "cable cover",
        "gaming monitor",
        "pretty cool",
        "cool",
        "pretty good",
        "pretty cool monitor",
        "chin",
        "RGB",
        "kind",
        "dimming",
        "good",
        "monitors",
        "local dimming",
        "box"
    ],
    "transcript_entity_values": [
        "VRR",
        "130",
        "Yo",
        "only 27 inches",
        "869",
        "SolidSuit",
        "1.4",
        "Spider-Man",
        "4",
        "USB",
        "Corsair",
        "at least 50%",
        "Doom Eternal",
        "160",
        "ZH HDMI",
        "RhinoShield",
        "600",
        "Adobe RGB",
        "four or $500",
        "Friday",
        "seven kilos",
        "DisplayPort",
        "SDR",
        "500",
        "27 inch",
        "today",
        "IR",
        "Bloof",
        "Hertz",
        "a ton",
        "Ba-da-bing",
        "about 5.5 milliseconds",
        "VA",
        "at least 50 to",
        "about $1,000",
        "3090",
        "OSD",
        "max",
        "1%",
        "Mod NX",
        "Alienware",
        "2.1s",
        "two",
        "769",
        "9.8",
        "2.1",
        "more like 500",
        "Delta-E. Based",
        "one",
        "55%",
        "RoboAesthetic Hardcore Attack",
        "second",
        "200",
        "the 1%, 5%",
        "LG",
        "DCI-P3",
        "HDMI",
        "1575",
        "10%",
        "DYOC",
        "ShortCircuit",
        "First",
        "jack",
        "4090",
        "3.8",
        "One",
        "60",
        "90-watt",
        "IO",
        "RoboAesthetic",
        "IPS",
        "about six extra milliseconds",
        "1,100",
        "RGB",
        "1,152",
        "Red Magic",
        "640",
        "1152"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "WORK_OF_ART",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERCENT",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "WORK_OF_ART",
        "ORDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ]
}