{
    "id": "rCqisXxtego",
    "title": "Ever Tried Bone Conduction?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-05-09T22:48:39Z",
    "video_url": "https://www.youtube.com/watch?v=rCqisXxtego",
    "category": "Science & Technology",
    "tags": [
        "bone conduction",
        "bone",
        "conduction",
        "headphones",
        "best headphones",
        "wireless headphones",
        "tech",
        "technology",
        "unboxtherapy",
        "unbox therapy",
        "aftershokz",
        "bluez",
        "2s",
        "wireless bluetooth",
        "bluetooth",
        "aftershokz bluez",
        "review",
        "unboxing",
        "wireless",
        "best",
        "android",
        "iphone 6s",
        "iphone",
        "apple",
        "samsung",
        "smartphone",
        "6s",
        "new",
        "galaxy",
        "phone",
        "gadgets",
        "iphone 6",
        "test",
        "iphone 7",
        "s7",
        "vs",
        "plus",
        "apple iphone 6s",
        "apple inc. (publisher)",
        "android (operating system)",
        "s7 edge",
        "edge",
        "apple iphone",
        "galaxy s7",
        "smartphone (video game platform)"
    ],
    "views": 2436632,
    "likes": 48231,
    "comments_count": 2877,
    "description": "Aftershokz Bluez 2S Wireless Bone Conduction Bluetooth Headphones -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/20QzOWd",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys Lew here back with another video and today I've got something that I wanted to try out for a long time but haven't had the chance to This is... bone conduction audio from a company called Aftershokz These are the Bluez 2S Lew, What is bone conduction... audio Essentially these things sit in front of your ears. What No, not in them, in front of them and you got some fancy anatomical action going on inside of your skull. right here That somehow allows audio to be transferred via your bones. Never thought I would want that The future. Premium pitch stereo sound, sweat resistant, 6 hours of battery life they are wireless. That's what they look like there. The benefit here is that you don't have something obstructing your actual ears, these guys. Little bit of a first here Look at that Ferrari Red right there They also have a noise canceling microphone there Will it even work with glasses? Let's see here Look at that Jack you see that there? So it's one size fits all type deal That's your power switch aswell as your USB port for charging these up. volume controls are there aswell I guess all the bone conduction magic happens on this section right here Interesting Micro USB to charge it up weird rubbery thing, I'm guessing this is to give you a stickier fit stickier maybe tighter I guess it's somewhat adjustable Little traveling pouch Honestly the most surprising thing about these to me was the reviews on Amazon. People like them Apparently these are the way to go So of course this is the moment of truth This is why you tune in your favourite show here on YouTube Oh wow Letting me know they're now in pairing mode Ooh this is exciting guys! Bluez 2S Hmm, there's something interesting about not having headphones in your ears but instead infront of them Look at me I'm moving I'm boxing I'm playing basketball maybe? and, I can hear the real world Oh there's like a vibration to it Woahhh That is an odd sensation it's like somebody's tickling me not that I don't like that Jack stay away from me okay so it's not obstructing my hearing I can hear what's around me are we getting a lot of bleed out of them? No..? but it's clear I mean it sounds like they're in.. it's very odd It sounds like they're in my ears but they're not I'm also interested in these not just for music but for listening to podcast's This is SO weird for a podcast it sounds great but I can still talk to you it's very bizarre listen they're not blasting my head away like a pair of real but there's a different kind of thump to it because of the vibration I don't think I'd use them to replace my actual headphones but there's something about them I like would it be wierd to say that it tickles in a pleasant way? I can hear my surroundings but it's like there's a soundtrack going on along with it and it's tapped into my brain it's like the sound is it's already there it's in my brain What if you're like some kind of mastermind surgeon you like to have classical music on Mozart or something This is way more fleshed out than I had imagined not a gimmick very cool and as I said ealier tickles.. in a pleasant way Ohhahhhh",
    "transcript_keywords": [
        "video and today",
        "long time",
        "company called Aftershokz",
        "Lew here back",
        "bone conduction audio",
        "bone conduction",
        "guys Lew",
        "Lew",
        "audio Essentially",
        "called Aftershokz",
        "Interesting Micro USB",
        "ears",
        "audio",
        "bone",
        "conduction audio",
        "sounds",
        "conduction",
        "bone conduction magic",
        "guys",
        "hear"
    ],
    "transcript_entity_values": [
        "Amazon",
        "Ohhahhhh",
        "Lew",
        "Ferrari Red",
        "first",
        "USB",
        "Aftershokz These",
        "6 hours",
        "Interesting Micro USB",
        "Mozart",
        "Bluez",
        "Jack",
        "one"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL"
    ]
}