{
    "id": "ReGwlUGifN4",
    "title": "A surprising performance boost! - AlphaCool @ Computex 2023",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-06-02T18:28:39Z",
    "video_url": "https://www.youtube.com/watch?v=ReGwlUGifN4",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy"
    ],
    "views": 333772,
    "likes": 13186,
    "comments_count": 545,
    "description": "Thanks to Secretlab for sponsoring today's video! Check them out at   Alphacool is here at Computex with some creative cooling solutions. From metal fans to custom 3D-scanned watercooling setups, Alex stopped by to check it all out and see if any of these could end up in your next PC.  Check out some of Alphacool's current products: Eisbaer Aurora AIO 360mm CPU Cooler:  Eisfuegel Flow Indicator:  Susurro 120mm Fan:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 We love happy accidents 0:14 AlphaCool Metal Fan 2:21 Carbon fiber 4090 waterblock 2:57 Sponsor - Secretlab 3:29 Core 1 CPU cooler 5:09 Apex Pro Skeleton case 5:42 More upcoming watercooling features 6:51 Un-named watercooling prototype 8:01 3D-scanned server setups 8:27 Outro",
    "description_links": [
        "https://lmg.gg/secretlab",
        "https://geni.us/9Ags8",
        "https://geni.us/ljOKV7",
        "https://lmg.gg/cygMI",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Normally, innovative products come from years of smart people doing detailed engineering and stuff like that. AlphaCool does have some products like that here at their Computex booth, but the best thing was a simple happy accident. This right here is the AlphaCool metal fan and they came up with this idea very simply because marketing wanted it, they wanted a metal fan and it's made out of zinc, so it's not all that expensive. It looks really cool, and then turns out it's amazing. So if we look at the structure of this thing, so we have the zinc housing and then a plastic sort of bearing carrier with an O-ring that goes around it that's all sandwiched together. And what they found out is it works fan freaking tastic, no pun intended. They aren't totally sure why, but this is an incredibly quiet fan. They tested in their lab and they were like \"That seems like it's wrong.\" And then they sent to Igor's lab and he was like \"Yeah, this thing is incredible.\" So this fan right here is currently running a 2,900 RPM, and even though it's loud here you can't tell, this sounds like a 900 RPM fan. It is absolutely crazy. They aren't totally sure why this is, but their guesses are that first of all, the metal has a lot of mass, it can stop transferring vibrations. Also, the O-ring there is probably like a decoupling layer of sorts, but either way, the results do not lie. I want a bunch of these on my case because not only does it look cool, but it works so darn well. To connect to your PC, it's a very simple daisy chain. None of this overcomplicated nonsense, just a very simple fan header that goes in something like this. They are considering doing an RGB version in the future. Probably just a little center bit here, but I really like just the classiness of the metal, no RGB. When it goes on sale, this fan is expected to be only 29 US dollars, which for the performance and the looks, seems like an absolute steal. They have three versions here, so the chromed out one, white one, and of course the black, but because of the modular design, it's super easy for either them or just the user to make this any color that you want. The next product that we have here is the complete opposite. When I saw this carbon fiber on top of this 4090 water block, I just completely assumed that it was marketing BS and they were like \"No, it'll just make it pretty, carbon fiber,\" cool. But there's a really good reason for this. Typically it just is not possible to fit this kind of hardware into a one new chassis because that would mean that you have to do an additional 10 millimeters of thickness to hit the stiffness that is required for a water block. Dang, it does look really cool though. Almost as cool as the segue to our sponsor. - You wanna know a secret? Secretlab chairs are great, they're sleek, ergonomic, high quality chairs are built to withstand the rigors of gaming or office work for long hours. Their Titan EVO 2022 series chair offers four-way lumbar support, comes with a magnetic memory foam head pillow, and is offered a different upholsteries, like hybrid leatherette, soft weave fabric, and Napa leather. Secretlab also has a range of gaming chairs designed collaboration with popular games such as \"League of Legends\", \"Valorant\", and \"Overwatch\". Head to the link in the description and check out Secretlab chairs today. - Up next, we've got the new Core 1 CPU Cooler. They said that their old version wasn't quite able to keep up with the 13900 K just because the dye is getting so big, it's outputting so much heat, it's absolutely a ridiculous CPU, I love it. But the new one right here, you can sort of see that they have greatly increased the amount of fins and the area of those bins. They say that that drop temps by 10 whole degrees, but the most interesting thing is that it just looks freaking great. Very recurring theme. So right here is in white, but then they've diamond cut the edge right around here and it looks absolutely fantastic. Now of course as being AlphaCool, they love cooling servers and they've taken all of their learnings from the Core 1 and put it into a 1U block. Said it was a huge pain in the arse because you have to go in here, you can't have fittings on the top of course, and then it goes up, over, and then down onto the fins that cool your CPU. And of course you get some cool functional carbon fiber right here. But of course if you're cooling a server, you don't want some piddly CPU that gets cooled by something like this. You want the big monster. And this right here they said, basically what it is is it's four of these guys but just slapped around like that. You can really see it in this one right here where it goes down and it's just channeled out in each direction like that. It gets collected around and back out. But of course, functional carbon fiber only gets you so far. Let's look at some carbon fiber that's there just to be fancy. With the Apex Pro Skeleton Case, this thing right here is packed to the gills with carbon fiber water cooling stuff, and all of these little pieces right here were CNC machined. You might be thinking this will be insanely expensive, and at $900, it kind of is, but that's not too bad given that for that, you still do get the distribution plate, vertical GPU mount, and all of, well, this craziness right here. If you want a more bare bones version, it does come in at more like 400 Euro. But if you haven't water cooled before, it can be rather scary. And AlphaCool has a couple of things to help you out starting with the core distribution plate. If we look here, normally on something like this, you just have tapped holes straight into the acrylic and it's a little bit scary because if you tighten it too much, you can have micro cracks that will lead to leaks or you can just strip it out and, I don't know, she's done, return it. To fix this, AlphaCool has the G1 quarter threading in metal and then if you look very closely, they have two O-rings on the inside of it. So although it's not impossible to screw up, I'm sure someone will find a way, it's a lot harder than before. Another way that you can have a very bad day is if you overtighten the screws that hold your distribution plate in place. To overcome that, they have these little push pins here so you screw one side into your radiator or case and the other one into your distribution plate. This right here stops at a certain amount so you can't overtighten and blow everything up, and then you can just push it on and it's just way simpler than the normal way that you have to do it. Of course, you're a skilled craftsman, you're not scared about accidentally cracking your (indistinct) clocks. You're scared of sometime down the line something coming loose and your computer getting filled with water. But AlphaCool has a solution for that. Right here we have a prototype, and they don't have it named yet, but I wanna call it the AlphaCool Save Your Bacon. Let's have a look here. This right here, it's currently pressurized to minus 420 millibar. Nice, and if we come over here, we can take this tube that has water flowing through it at the moment and if we give it a little cut, not all the way through, of course, but just a little cut. Am I through? Oh, there we go. You can see that happening. You can see that it is sucking in air and it's getting very mad, but no water is coming out, which is absolutely fantastic. Even though we are sucking in air, there is still some water flow so your components aren't gonna just fry themselves and you can do a proper shutdown. Couple more small things. They have a radiator that has RGB on it now. Very cool. Apparently it also has two more cooling channels, so it works very good. Also over here you can see that they have a water-cooled server. What they said they've actually been doing is 3D scanning client server chassis and then designing them a completely custom water cooling setup. This can be very, very critical if you have like a 1U server chassis, because having even a little bit extra tubing can be enough to pop it up. And then what do you know, top doesn't go on, doesn't slot in, bad time. What hopefully wasn't a bad time though was you watching this video. Huge thanks for watching. Hit like, get subscribed, just have a great old day. See you later.",
    "transcript_keywords": [
        "fan",
        "carbon fiber",
        "years of smart",
        "smart people",
        "people doing detailed",
        "detailed engineering",
        "water",
        "cool",
        "innovative products",
        "AlphaCool",
        "metal fan",
        "AlphaCool metal fan",
        "carbon",
        "fiber",
        "thing",
        "metal",
        "CPU",
        "distribution plate",
        "cooling",
        "Computex booth"
    ],
    "transcript_entity_values": [
        "1U",
        "minus 420",
        "three",
        "long hours",
        "one",
        "Nice",
        "the AlphaCool Save Your Bacon",
        "900",
        "only 29 US dollars",
        "Napa",
        "Core 1 CPU Cooler",
        "Overwatch",
        "10 whole degrees",
        "the Apex Pro Skeleton Case",
        "Igor",
        "Valorant",
        "Computex",
        "first",
        "G1 quarter",
        "more like 400 Euro",
        "two",
        "four",
        "GPU",
        "an additional 10 millimeters",
        "CNC",
        "RGB",
        "2,900",
        "AlphaCool",
        "Secretlab",
        "CPU",
        "today"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "GPE",
        "LAW",
        "MONEY",
        "MONEY",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PERSON",
        "GPE",
        "ORDINAL",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE"
    ]
}