{
    "id": "RF72hGIdrG8",
    "title": "Does the Apple Watch Ultra use REAL Sapphire!? - (Plus hidden solar!)",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-11-25T14:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=RF72hGIdrG8",
    "category": "Howto & Style",
    "tags": [
        "Apple Watch Ultra",
        "Apple Watch",
        "Apple",
        "iPhone",
        "New Apple Watch",
        "Samsung Watch 5",
        "Garmin Fenix 7",
        "Sapphire",
        "Sapphire solar",
        "sapphire crystal",
        "power sapphire",
        "smart watch",
        "wearable",
        "technology",
        "durability test",
        "jerryrig",
        "apple watch ultra",
        "apple watch ultra review",
        "apple watch series 8"
    ],
    "views": 3050225,
    "likes": 97672,
    "comments_count": 3063,
    "description": "Its time to see if Apple has fixed the Sapphire Crystal on the new Apple Watch UItra! RHINOSHIELD X BLACK FRIDAY:  Up to 60% off sitewide + EXTRA 10% off with code: jerryrig  Thanks to Rhinoshield for sponsoring this video. Sapphire is one of the COOLEST materials ever made. Synthetic man made precious stones that have incredible physically protective anti scratching attributes. Was that a run on sentence? heck if I know I aint no english major. I am however enthralled with sapphire and I wish more smartphones had it installed. Today we take a look at the new Apple Watch Ultra sapphire, along with the Samsung Watch 5 sapphire, as well as a new smart watch with hidden solar panels - the Garmin Fenix 7 Sapphire Solar. Its time to Durability Test them all:  Current Apple Watch Ultra Price:  Current Samsung Watch 5 Price:  Current Garmin Fenix 7 Solar:   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://bit.ly/3TPkThe",
        "https://amzn.to/3Ey28s1",
        "https://amzn.to/3GMXg55",
        "https://amzn.to/3tZ41t6",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "There has been a lot of talk about sapphire lately specifically around watches. This Apple watch Ultra is supposed to be sapphire. This Galaxy watch 5 is supposed to be sapphire. And this Garmin Fenix 7 is supposed to have sapphire, along with some solar panels. I'm pretty excited about this one. Sapphire is an extremely premium and very valuable man-made material, with a hardness level up near diamonds. To make sapphire, ingredients are subject to extreme heat for weeks to create a large block called a bool, which is then cut up or cored and sliced to make watch faces or cell phone screens. It's a super interesting process. As you probably know, we see smart phone screens scratching at a level 6, with deeper grooves at a level 7. But sapphire...sapphire scratches at a level 8 or 9. It's exponentially harder than glass on the Mohs scale of hardness. We've seen sapphire used quite a bit with the TSO watches that we've tested in the past, as well as on the displays of Kyocera's lineup of ultra rugged smartphones. Apple however, ever since the iPhone 5, has claimed that they're using sapphire. And while it is technically true, it's a subpar grade of sapphire that still gets marked up at a level 6. Apple even used their impure sapphire on the $1300 Apple watch series 3, so I have some major doubts about the quality of sapphire here on the Apple watch Ultra. Which is kind of embarrassing. If other companies can get their hands on the real stuff, Apple, as one of the most valuable companies in the world, should be able to as well. So today we're going to see how well that sapphire on the Apple watch Ultra holds up and compare it to Samsung sapphire and Garmin sapphire. And hopefully, fingers crossed, everyone's sapphire is legit. And speaking of protecting, huge thanks to Rhinoshield for sponsoring this video. Rhinoshield is known for creating durable and customizable phone cases and accessories. You can bling out a personalized one-of-a-kind case of your own, or pick from a plethora of other unique designs. From NASA, the NBA, PewDiePie, or you know, you can just keep it simple with some solid color, magsafe, friendly cases, which all come with lifetime warranties. Personally I'm a big fan of the 100% recycled paper packaging. Rhinoshield is having their biggest sale of the year with all products up to 60% off. And you can take an additional 10% off of that using code jerryrig with the link down in the description. Whether you need a more solid handle on your device, with a pop-out grip max or grip mini, or you just want 360 degree protection for your own phone, or as a gift for someone else, the link is down in the description. Unfortunately Rhinoshield did not send me any cases from their NASA collection. But if you need a case you should definitely scroll through those because there are some real winners. Huge thanks to Rhinoshield for sponsoring this video. And now it's time to see if all of these companies are telling the truth about their sapphire. Let's get started. [Intro] In our journey today to find out if Apple, Samsung, and Garmin are using real sapphire, we have a few tools, the first of which is our diamond selector tool which tests the thermal conductivity of gemstones to see if they are real or not. Diamonds and sapphire are 5x more thermally conductive than copper. Can you imagine a sapphire frying pan? It might cost a million bucks, but it would cook your eggs so fast. The thermal conductivity means that the glass lens of the Pixel 7 Pro will not register on our tool, but the sapphire camera lens of the iPhone 14 will. My wife's cubic zirconia ring won't thermally register, but her real diamond will. The glass Fossil won't register. But the extra hard and premium sapphire crystal Tiso watch face will. And, of course, if we take our massive block of sapphire which has not been cored out yet, it also registers as a gemstone. Maybe we should add a loop and turn this into an earring. The second method we'll use to verify gemstone status is with the Mohs scale of hardness. Plastic would scratch at a 2 or 3, glass at a 5 or 6, and sapphire would be a level 8 or 9...just shy of a level 10 diamond. Sapphire is extremely scratch resistant. I've been testing sapphire for a while now and Apple's sapphire has consistently had marks below a level 8 which doesn't really jive with where the crystal is supposed to fall, but we'll see where today takes us. Starting with the cheapest of our three watches, the Samsung Galaxy watch 5 at right around $300. That's a pretty cheap price point for something as premium as sapphire, but we'll see what happens. This is the 44 millimeter aluminum bodied watch which obviously has fitness and sleep tracking. And if we flip it over we have the heart rate sensors and a water resistance of five atmospheres, which is right around 50 meters. And, of course, some sapphire crystal branding on the back. The correct verbage for sapphire is always going to be sapphire crystal since the only attribute sapphire shares with glass is that they are both clear. The ingredients, atomic structure, and thermal conductivity are all very different. And lucky for Samsung, the Galaxy watch 5 indeed is sapphire. It doesn't ping quite as high as the Tiso but still registers. We'll head over to the scratch test to validate our findings since two tests are always better than one. We can see that the level 5 does not leave a mark. However, with level 6 I can feel and hear the tip of the pick start to catch on the surface of the sapphire. This could be an impurity thing, or it could also be the polish or texture of the watch face that's catching. The Mohs scale of hardness is a qualitative scale that ranks minerals and is not necessarily used to generate precise comparisons between the different minerals on the same level. So while I do feel the pick catching, I don't visibly see any damage to the sapphire. I can also feel the level 7 pick catch, but we don't see any real damage until level 8. Nice work, Samsung. The Galaxy watch 5 is using sapphire. Let's move over to the most expensive watch on the table, and the one I'm looking forward to the most the Garmin Fenix 7 Sapphire Solar, which currently sits at around $900. Now online this is advertised as having titanium, but it's far too light in person to be made entirely from metal. The only titanium here is on the blue cap around the watch face. Everything white is made from plastic, which is fine, just different than I was anticipating. It's a very lightweight watch. The display is also very different from the Samsung. Instead of an AMOLED screen, the Garmin is using a transflective memory and pixel display, which is like a one bit per pixel LCD with basically a zero refresh rate. It's what allows us to get 22 days worth of battery life with the solar panels in the display instead of just 50 hours like we see on the Samsung. But that extra long battery life comes with an astronomical sacrifice in brightness. On the back it has more titanium with a water resistance rating of 100 meters twice as much as the Samsung. But, you know, if I ever find myself 100 meters under water, something's really wrong. Good to know that my watch will still work though. Also on the back we have the power sapphire branding which, of course, is the reason we're here. Pulling out the diamond tester tool. Remember, the lights are not an indicator of purity, just thermal conductivity. But the readings of the Garmin are off the charts when compared to the Samsung watch. Working our way up through the secondary verification, Mohs scale of hardness, picks 6 and 7 both feel and sound smoother on Garmin sapphire. And then level 8 is again where we start seeing major damage to the crystal. The Garmin Fenix 7 is using real sapphire. Thumbs up for that. Came outside to check the solar intensity on the watch. And if we go right here we can see that it is indeed finding the sun and charging the batteries. And it keeps track of the solar illumination throughout the day which is pretty interesting. Now for the Apple watch. This guy is a tad cheaper than the Garmin, sitting at around $800. A major downside to the Apple watch is that it requires an iPhone to set up, which definitely limits who can use it. This is unfortunate since the Apple watch Ultra is probably the most feature rich wearable on the planet, and probably the best piece of hardware that Apple has ever made. But I shouldn't have to downgrade my cellphone to upgrade my watch. It's a shame it's locked into their ecosystem. The Apple watch Ultra is heavy and solid out of the box, having a full titanium body. Luckily my iPhone 14 still functions enough after the durability test to get the Ultra up and running. If this wasn't locked to an iPhone, I would probably totally be rocking it. It does have a retina LCD display which brings our battery life to 36 hours instead of 22 days like the Garmin watch. But we do get all that brightness back which is pretty nice. On the back of the watch we get all the heart rate sensor stuff, as well as another 100 meter depth rating and some more sapphire crystal branding, which is what we're here to check on. The improved watch band looks very secure. One time my buddy Dan was cliff jumping into a lake and lost his Apple watch for 9 months under water. We eventually found it and I fixed it. You should definitely check out that video if you haven't already. But yeah, this new watch band is definitely more secure than the previous versions. It's also [beeping sounds] real sapphire. Three for three. Of course we can double check with our Mohs scale of hardness. Level 5 slides smoothly over the surface. But again, similar to the Galaxy watch, the level 6 pick starts gripping which you can audibly hear. There are some markings where the pick was moving on the surface. And you can again hear the grip of the level 7 pick, and these markings are a tad more visible. And, of course, our level 8 pick is where the real damage begins. So it does look like Apple is still using the same sapphire that they've always been using. Samsung might have the same supplier. Or it could be a polishing issue, but out of the three, the Garmin sapphire feels to me most like the Tiso and like it'll hold up the best. Either way though, it's incredibly cool to see all three watches using such a premium material. A synthesized, man-made, technological marvel, making its way onto the technology we use everyday. The average person, of course, wouldn't be able to visually tell the difference between glass and sapphire. But since you're here watching my videos, you're already far superior to the average person, and we've now scientifically confirmed sapphire's existence on each watch. Make sure your above average self hits that subscribe button if you haven't already. Come hang out with me on Instagram. I'd say Twitter as well, but that's like offering a free seat on the Hindenburg. And by free I meant 8 dollars. Don't forget about the massive discounts from Rhinoshield using the link in the description. And thanks a ton for watching, I'll see you around.",
    "transcript_keywords": [
        "Apple watch Ultra",
        "sapphire",
        "Apple watch",
        "watch",
        "Apple",
        "watch Ultra",
        "Garmin sapphire",
        "Galaxy watch",
        "level",
        "Garmin",
        "Samsung",
        "Samsung Galaxy watch",
        "sapphire crystal",
        "Garmin Fenix",
        "Ultra",
        "real sapphire",
        "Garmin sapphire feels",
        "Apple sapphire",
        "Mohs scale",
        "real"
    ],
    "transcript_entity_values": [
        "the iPhone 5",
        "1300",
        "a million bucks",
        "Garmin Fenix 7 Sapphire Solar",
        "iPhone",
        "polish",
        "9",
        "Samsung Galaxy",
        "Rhinoshield",
        "TSO",
        "6",
        "8",
        "around $800",
        "Twitter",
        "the year",
        "around $900",
        "Instagram",
        "up to 60%",
        "100%",
        "two",
        "NASA",
        "36 hours",
        "100 meter",
        "three",
        "6",
        "22 days",
        "8",
        "the 44 millimeter",
        "Garmin",
        "the day",
        "Three",
        "8 dollars",
        "zero",
        "The Apple watch Ultra",
        "an additional 10%",
        "10",
        "100 meters",
        "5",
        "Apple",
        "five",
        "Kyocera",
        "Rhinoshield",
        "Hindenburg",
        "around $300",
        "first",
        "second",
        "9 months",
        "5x",
        "Sapphire",
        "around 50 meters",
        "LCD",
        "weeks",
        "today",
        "Samsung",
        "cubic",
        "2",
        "Dan",
        "The Garmin Fenix 7",
        "3",
        "5",
        "One",
        "Galaxy",
        "just 50 hours",
        "AMOLED",
        "one",
        "7",
        "NBA",
        "Tiso",
        "Rhinoshield",
        "the Pixel 7 Pro",
        "PewDiePie"
    ],
    "transcript_entity_types": [
        "EVENT",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "NORP",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "PERCENT",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "MONEY",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "GPE"
    ]
}