{
    "id": "rfPq8gZszdM",
    "title": "The Soundbar You Won't Regret Buying - Sony HT-A7000",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-08-30T22:00:21Z",
    "video_url": "https://www.youtube.com/watch?v=rfPq8gZszdM",
    "category": "Science & Technology",
    "tags": [
        "Sony",
        "Soundbar",
        "HT-A7000",
        "HT",
        "A7000",
        "Dolby Atmos",
        "DTS:X",
        "Audio",
        "Subwoofer",
        "Compact",
        "Tweeters",
        "Beam speakers",
        "Sub",
        "Rear Speakers",
        "Cinematic",
        "Cinema",
        "Quality",
        "Performance",
        "SW5",
        "Gaming",
        "Playstation",
        "Bravia",
        "TV",
        "Television",
        "HDMI 2.1",
        "Apple Airplay 2",
        "Games"
    ],
    "views": 3064414,
    "likes": 49551,
    "comments_count": 1949,
    "description": "Thanks to Sony for sponsoring today's video! Check out Sony's new HT-A7000 soundbar at   We usually aren't the biggest fans of soundbars, but the Sony HT-A7000 may have changed our minds. The HT-A7000 provides a full surround sound experience with Dolby Atmos and the ability to add a subwoofer and rear speakers! Let's see how easy it is to set up in our living room studio.  Buy Sony Bravia X90H 65X900H On Amazon (PAID LINK):  On Best Buy (PAID LINK):  On Newegg (PAID LINK):   Buy Sony SW5 Subwoofer On B&H (PAID LINK):   Buy Sony SA-RS3S Rear Speakers On B&H (PAID LINK):   Buy Rear Speaker Stands On Amazon (PAID LINK):  On Best Buy (PAID LINK):  On Newegg (PAID LINK):   Buy PlayStation 5 On Amazon (PAID LINK):  On Best Buy (PAID LINK):  On Newegg (PAID LINK):   Buy Apple iPhone 12 On Amazon (PAID LINK):  On Best Buy (PAID LINK):  On Newegg (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - Intro 0:12 - Unboxing 3:03 - A closer look at the speakers 4:11 - Soundbar and tv setup 6:27 - Subwoofer impressions and setup 7:01 - Configuring the soundbar 9:34 - Sound calibration 10:22 - Rear speaker set up 11:04 - Gaming sound test 11:51 - Apple Airplay 2 test 12:17 - Conclusion",
    "description_links": [
        "https://bit.ly/SonyHTA7000Soundbar",
        "https://geni.us/2r1NKgy",
        "https://geni.us/7KUUap1",
        "https://geni.us/xyOpY",
        "https://geni.us/EAQst",
        "https://geni.us/1Z7rM",
        "https://geni.us/8pSdN",
        "https://geni.us/tKhluRE",
        "https://geni.us/p9IDRZ",
        "https://geni.us/mO2M",
        "https://geni.us/YBfn9",
        "https://geni.us/5gIZ98",
        "https://geni.us/rVLu6XA",
        "https://geni.us/5MaBf",
        "https://geni.us/UraHDfT",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- It's been a number of years since Sony has released a new flagship soundbar, but that's exactly what we've got today. In this video, sponsored by Sony, taking a look at the A7000. Now, one thing you guys might notice immediately, is that unlike the ST5000, which was their previous top-of-the-line, there's no subwoofer included. Well, apparently this was based on customer feedback, where people were telling Sony, like, \"Look, I want your top-of-the-line sound bar, but I live in an apartment.\" (box clatters) Whoops. \"Realistically, I'm never gonna be able to turn the thing on, anyway.\" So what they've done is they've essentially unbundled the two things. So it comes in at a whopping $700 lower price. So it's $1300 instead of $2000 dollars US. And then, (box drops) you can just add your own subwoofer to it, if you want, based on your needs. So we've actually got the higher end one, that's $700, which would put this combo right up at the same price as the old one. Or you can go for the more basic one, which is $400. So this is the SW5, and even though they don't come together, they're supposed to just (Linus snaps) instantly pair. Now, one of the biggest reasons that Sony is replacing their old flagship, cause already, if you guys remember, I've talked about it a fair bit in the past. Both in sponsored videos, and outside of them, it already sounded great, had support for DTS-X, Dolby Atmos, and was a 7.1.2 setup so it already had upward firing speakers so you have those virtual, like top channels, but, technology has moved on, and HDMI 2.0 has been replaced... Ah, here we go. Bam, this thing is a beast. ...With HDMI 2.1, so the new A7000 has support for 8K 30 Hz or 4K 120 Hz and all the latest devices. Oh, there's a little label here, for which one is the HDMI input. Oh, these are both HDMI. Oh, okay. I can see why they did it this way, because everyone's gonna need to plug this into their TV via the HDMI outport right here. And then you can use it to not only replace that input from your TV, but actually switch. So it's got two HDMI inputs. In terms of the rest of the IO. We've got an optical input. Just in case your TV doesn't support ARC or eARC. This does support eARC though, it's part of the HDMI 2.1 specification. It's got an analogue in. If you have an analogue source you wanna hook up to it. It's got a USB port and this S-Center out. If you've never heard of that before, I don't blame you, but Sony has a feature on their Bravia TV's that allows you to use the built in speaker of the TV. And they've actually got ones that have that speaker built right into the display. It vibrates the display. So you can actually use your TV as a center channel with this soundbar. Not that you would necessarily need to because this thing is absolutely bristling with Sony's X-balanced speakers. Oh, that's interesting. I had expected the grill to be removable like on their old one, but it looks like either it doesn't come off or it's something you have to unscrew. How many of these are there? Uh-oh yeah, it might not be intended to come off. Interesting. That's quite unexpected. No, that's fine. We can still get a look at this. So one of the things Sony has done really well with their previous soundbars is creating a really wide soundstage. So you can see we've got our center drivers right here and then we've got our right and left. And then this right here, this is what Sony apparently calls their Beam Tweeters. That's really interesting. They've got these small to large perforations here and apparently what this is about is creating a more accurate and wider soundstage. So that's, that's pretty cool. And then, ah, yes, this is another thing. So we can't oh yes... No we can't see them, built into this are also two subwoofers. So the idea is that if they're shipping it without a dedicated subwoofer, it should have pretty good bass performance out of the box. Confirmed though. They've got these little, these little kind of spacers here to make sure this doesn't get punched in. This is intended to be run with the grill. Not naked. But I'm still glad we pried it up so we could have a better look at that. Right into a small problem when we went to set up the sound bar. Our Bravia TV has a stand that kinda... We would need a deeper media console. So we're in deepening our media console like this. There we go. - [Brandon] Don't try this at home. - Don't try it. Yeah. Don't try this at home. (Linus humming) Nice Now it seems like as good a time as any, to have a look at our accessory package. We've got a remote. So you can use this to control the built-in OLED screen in the front. Or if you have a Sony TV, there'll be an on-screen display that'll come up. So we should see that on this one. Power cable. HDMI cable. The three and a half millimeter cable for hooking up your TV as a center channel, batteries and a wall mount. That's right. My friends it's wall mount ready. Ah, yes. So the downside of using optical, well, the upside of using optical is compatibility. If you have a device that doesn't support ARC or eARC, then you're gonna want to use optical. But the downside is that it doesn't support the same high definition formats that eARC does. So you're not gonna be running Dolby Atmos over optical, it just doesn't work that way. Yeah. It's it's funny, 'cause you think of like \"optical\", you know, as like a high-speed connection. But that particular optical standard hasn't been touched in like 15, 20 years. Yeah. So it's really, really slow. This soundbar has support for every surround format that you could want today. Dolby Atmos, DTS-X. I mean, those are really the main ones. When you're plugging in your soundbar, Sony helpfully stickered over the ports not to use on the soundbar itself, but you need to make sure you're plugging into the correct port on your TV. So I'm going to hit the one right here that is labeled ARC. Then for my PlayStation 5, I'm gonna plug that into, whatever, HDMI 1. Okay. There. Now, any content running on the smart TV itself and any content playing off of the PlayStation 5 will all be routed through the sound bar. That's kind of the whole point of audio return channel, is that the audio can go out to the soundbar either through the TV or directly through the soundbar to the TV. It just doesn't matter. Hey. Check this out. This is the SW5. And it's got this kind of like... I can't tell exactly what this is made of. It has kind of like a leather wrapped look to what I think is just a plastic mold. But, I dunno, it looks kind of cool. - [Jono] They call it \"textured surface.\" - They call it textured surface. Apparently. Thanks Jono. I mean it is... - [Guy In the back] A real creative name - Look, I can tell it's a textured surface. Okay? (guy in the back laughs) Let's see just how painless the setup process is. I'm gonna power up the sound bar. So like a pairing button somewhere. That's what I get for pulling the stickers off. I misread the label and I plugged into the wrong thing. That's why there's no setup wizard. Okay. Where'd that notification go? Yeah, probably on the notifications set up. There we go. \"Reconnect the device to HDMI 4\" Oh, all right. And we've got a sound now. That's an improvement. Before we do anything else, I wanna run their sound field optimization, set up things. So it uses microphones built into the sound bar to optimize based on the shape and size of your room. I don't really wanna add the surround speakers yet. So I wanna do that after, 'cause I wanna experience it without them, but I do want to optimize the surround. Okay. \"Allow sound may come from the speakers. Do not stand in front of the speaker during optimization.\" All right. I'm going. (soundbar beeps) Shh. Okay. I am really impressed though. Did that sound like it was coming from above us or what? - [Brandon] It totally soun... - [Jono] It did. - Okay, so normally I would be like. \"Okay, well the product is working as it's supposed to.\" That shouldn't blow my mind. But Brandon look up. That is a 26, I believe 26 foot ceiling with acoustic treatment on it. I didn't think it was really gonna be able to meaningfully bounce anything off of it. But here we are. In the next part of the set up. It's prompting me to set up Alexa. So it has support for Google Assistant, Alexa, and this is new, it supports AirPlay 2. So we're gonna try that before we're done here as well. I don't know if I'm gonna bother with Alexa, for the time being, no. Yes. Spotify and Chromecast, but that's not new. AirPlay 2 is new with this model. Oh, this is good to know, both of the inputs on it are full HDMI 2.1 standard. So you can do 4K 120 or 8K. That's not a given. Oh, that's another thing, it has DSEE this isn't a new Sony feature. They do have other products, but I believe it's their first soundbar with DSEE. So what it does is it takes low bitrate music. So from services like YouTube Music, for example, and it will on the fly, AI upscale it or up sample it. I've tried it before. And it's not, you know, the same as just having lossless files in the first place, but it is a noticeable effect for sure. Now I wanna hear the demo. There's two demos. It has a Dolby Atmos demo and then a 3D Reality Audio demo. That's definitely better than when we tried it before we optimized it. I think part of it is just that a subwoofer does add more chutzpah to it. Like to be clear, it already had decent bass for a soundbar, like considering that as a soundbar was good, but I would probably recommend if your living space accommodates it, add the subwoofer. Let's try their 3D Reality Audio demo. This is really showing off how wide the soundstage is. One of the tests for that is if you're listening to music, you should be able to make out exactly where each instrument was on the, on a virtual stage. And yeah, that's pretty clear. Of course, the best way to get surround is to add surround speakers. So we're gonna do that next. These are Sony's RS3S surround speakers. And if you find you don't get enough of a surround effect from the soundbar on its own, you can add a couple of these on speaker stands. They do need to be powered, but other than that, they connect wirelessly to the soundbar and they should enhance the surround experience. The rear speakers are M5 threaded in case you were wondering. So we're gonna go ahead and mount them to our stands. Something I should've mentioned by the way, if you want to experience Sony's 360 immersive music, you do have to subscribe to a supported music service like Tidal. The light is green on that one. I think these might've just, picked up. Either way, I wanna recalibrate it for the room with these accounted for though. Okay. Let's do it again. (soundbar beeps) Oh yeah. Okay. Time to enjoy, \"Linus is terrible driving.\" The challenge here is I want to hear what it's like to have a car coming up behind me, and I have to pass one for that to happen. You could definitely feel like, the gravel kind of being kicked all around, coming from all around you though. That is a pretty fantastic surround experience. I think it's fair to say at this point that if you have another person living in your house that doesn't wanna deal with the whole fussing about with inputs on a receiver or whatever, a good quality soundbar it is really hard to go wrong. This is a pretty freaking sweet setup. Oh. And we didn't even try AirPlay 2 yet. Let's go ahead and do that. Step one is: Have an iPhone. Step two: Try to cast. Step three: AirPlay and Bluetooth devices. Step four: Enter this code. That's pretty big sound. I'm at like 70%. (\"Noisestorm - Crab Rave\") I mean, that's louder than you would reasonably want to listen to in your living room. I would think. And I think that's about the end of the video here today. Thank you Sony, for sponsoring this video and sending over your A7000. It looks like a worthy successor to the ST5000. And make sure you're subscribed to Short Circuit for more videos like this one.",
    "transcript_keywords": [
        "Sony",
        "HDMI",
        "soundbar",
        "sound",
        "Dolby Atmos",
        "support",
        "surround",
        "thing",
        "speakers",
        "sound bar",
        "Sony Xbalanced speakers",
        "yeah",
        "kind",
        "optical",
        "surround speakers",
        "things Sony",
        "pretty",
        "add",
        "Atmos",
        "support ARC"
    ],
    "transcript_entity_values": [
        "400",
        "Alexa",
        "PlayStation 5",
        "Tidal",
        "three",
        "One",
        "8",
        "4",
        "$2000 dollars",
        "one",
        "US",
        "USB",
        "AirPlay 2",
        "AirPlay",
        "15,",
        "the PlayStation 5",
        "HDMI 1",
        "700",
        "Google",
        "Bravia TV",
        "Chromecast",
        "DSEE",
        "Reality Audio",
        "Bravia TV's",
        "today",
        "IO",
        "Alexa",
        "YouTube Music",
        "26",
        "Noisestorm - Crab Rave",
        "Jono",
        "360",
        "1300",
        "M5",
        "Brandon",
        "26 foot",
        "first",
        "Sony",
        "Bam",
        "HDMI",
        "three and a",
        "two",
        "HDMI 2.0",
        "20 years",
        "this S-Center",
        "four",
        "7.1.2",
        "Short Circuit",
        "Spotify",
        "Linus",
        "Dolby Atmos",
        "2.1",
        "years",
        "ST5000",
        "70%"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "PRODUCT",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "GPE",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PERCENT"
    ]
}