{
    "id": "rfS8afbILm8",
    "title": "Is the Razer hype REAL!? - Razer Book 13",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-11-12T21:30:41Z",
    "video_url": "https://www.youtube.com/watch?v=rfS8afbILm8",
    "category": "Science & Technology",
    "tags": [],
    "views": 635529,
    "likes": 24999,
    "comments_count": 1433,
    "description": "iFixit Black Friday Deals: Use code CIRCUIT10 for $10 & $50 on select items at    iFixit Amazon Store (PAID LINK):   The Razer Book 13 is made for productivity, it's a good first attempt, but it doesn't quite hit the mark. What do you guys think?  Find the Razer Book 13 at   Buy Dell XPS 15 9500 On Amazon (PAID LINK):  On Beat Buy (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://iFixit.com/Linus",
        "https://geni.us/yM92",
        "https://lmg.gg/TZhNd",
        "https://geni.us/R3R17",
        "https://shop-links.co/1725432030468968926",
        "https://geni.us/uPLb2Xy",
        "https://geni.us/YZbYx",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- So lots of various companies are pretty bad for this, but I think Razer's the worst. Where kind of like two, three times a year they're like, guys, we reinvented the wheel. Gaming's never gonna be the same. Creativity is never going to be the same. Like, wow, wha! And then like it's, it's a pink blade or something like that. And you're just like, guys, cool I guess, but why? No, that's not the level of hype. But here they might actually have something. Like, it's the new Razor Book 13. Terrible name guys. You couldn't think of anything? Like whatever, it looks pretty sweet though. Let's get into it. All right. That's an interesting, oh, is that the power brick? Wow, 65 watts in this size right here is actually pretty impressive. It seems like it's just a standard charger. I was wondering if it was like gallium nitride but I guess not. This is a pre-production unit so we aren't allowed to run benchmarks on it or whatever, but, meh, we're going to anyway. All right. Only a couple little scuffs now, but I don't, ooh, a lot of scuffs actually. Oh, it's fine. They're coming off. Pre-production marks aside though, this thing feels and looks great. It just has the, I dunno, razor stiffness, I guess you could call it. It's all aluminum CNC machine and just generally feels great. Has that almost like Apple feel about it. You know how they're just super solid. I guess Razer's always had that as well. Just a nice, very tame Razer logo on the back. See that there? - [Jono] Oh yeah. - It's not their typical like straight gamer stuff, which I appreciate in this. - [Jono] Is that RGB? - Yeah, no RGB. So you get a full-size Type-A. Awesome. That's the sort of thing that's just such a pain if you're using like an XPS 13. We have Thunderbolt on this side, Thunderbolt on the other side. So you can, you know, charge from both sides of the laptop. Awesome. Then we have what? Full sized HDMI. And my only complaint here is that it's a micro SD card instead of full size. They probably just didn't have the space though. And on something this size I'm not really going to complain. So I guess we just go ahead and turn it on, but first I'm going to turn you on to our sponsor. iFixit. (chuckles) Thanks to iFixit for sponsoring today's video. iFixit's Black Friday deals start now and it's the perfect time of year to start your iFixit tool collection or give them as gifts. Can't wrap gifts? No problem. Right now, take $10 off the ProTech bundle and $50 off the ultimate iFixit kit. Head to iFixit.com/Linus and use code circuit10 for another $10 off. Hurry! The code expires December 1st. Oh, there's the RGB. They, there's no way that Razer could, you know, make a computer and just leave it boring. This one that we have right here is the 1920 by 1200. So it's a 16 by 10 display. This is the one thing that I thought Razer probably would get wrong. They'd be like, it's a productivity machine, but like with gaming display and stuff or whatever, like I figured they go kind of just the Blade Stealth route and not fully commit. This extra bit right here is just so nice though. And it really just adds that like modern look to it. Just that nice little, (clicks). It also feels surprisingly heavy. Like it's not, it's just under three pounds, actually just under three pounds is kind of heavy. It's like really dense. Like when you hold it it has that real just block of aluminum feel. So if you look here, there's absolutely no flex in the chassis here at all. Like I'm just, I'm pushing really hard right now. One thing that is interesting about this screen is that it has gorilla glass on it. So you can I'm not going to do anything that would scratch it but the things that would scratch other laptop screens are not going to scratch this one nearly as easily. There is a version with their i5 model that doesn't have touch. Wouldn't necessarily recommend getting that one. And there's also a 4k touch model which I also probably wouldn't recommend. Like this is plenty sharp. I can bring it right about here. I can start seeing pixels. And I don't know, I'm not doing this very often. So this right here has an Intel Core i7 1165 G7. That gets you four cores, this is one of the tiger light guys. Along with that, we have 16 gigabytes of RAM. I believe that that's all soldered. We'll find that out in a bit. A, oh, 240 gigabyte SSD. I would want to see at least five 12. And then yeah, the Iris XE graphics, which, you know, if you actually want to game, get a Razor Blade 15. Probably just completely skip the Blade Stealth. Especially since now this thing right here is going to deliver not the same but a very similar gaming experience to what you'd get on the Stealth because the Intel XE graphics are quite good. (mumbling) Oh, okay. First big problem. Small backspace. You'll probably get used to it, but that's why? That's it. I'm not super concerned about it. You will get used to that after being really mad for a week or two. I don't know how I feel about this. If I'm honest, it's good. But I don't know if it's great. It seems like the problem is is that the top of the key is a lot more like it has a lot of give whereas the bottom of the key has a nice snap to it. So if you're hitting the bottom of the key, it's fine. But if you're doing something like coming across, oh no. Some, so like Z, it's totally fine there. Like, you press the top and it just actuates. But if you look like Q, you're already hitting like the chassis before the key's actuating. So they're not quite consistent. So some of them like J here, J is a great key. You can hit J all day long. Yeah. They're just inconsistent. Okay, let's type on it for like a minute and then I'll get back to you if I still don't really like it. (typing) Yup. That's what like maybe a B plus? I think Linus might enjoy it more. He kind of likes the older Razor laptop keyboards which I hated. So your mileage might vary but I think it's safe to say that it, it doesn't quite stack up to like the Dells or the HPs in a similar form factor. As for the track pad though, that's at least a bright point on this. It's the kind of track pad that you sort of just don't really think about. 'Cause it just does what you want it to do and is like they're maximizing their space up here. Really no complaints for that. Okay, we're going to try and do the classic synced crab rave. (upbeat pop music) - [Jono] That's it? - Yeah that's it. That's all you're getting. - [Jono] What? - Okay, we're... (upbeat pop music) (laughing) Yeah, you got wrecked Razer. That's hilariously bad. (uplifting music) That's not a 2020 speaker set up in a, what is this $1,800 laptop or something? Let's find that out. All right. 1599.99 gets you the speakers of a $600 laptop. I imagine at least the battery is pretty good. So it's 55 watt hours. You're going to get what, in the new Intel, probably like nine, 10 hours, something like that? That said, you can still get that in much cheaper laptops. The layout in here though is really nice. You just get your SSD that you can take out. You don't get access to the RAM, but whatever. I don't really expect that in laptops like this. And then we have this nice big old vapor chamber that just kind of goes all the way around here. I don't know that we've seen a vapor chamber in a thin and light yet. They're just kind of, they're taking over everything. It's frigging sweet. That does mean though that like your Intel XE graphics and stuff are probably going to run probably the best out of all of the laptops around on this guy. Just because of that extra cooling. Intel is really good in their mobile designs for just extracting every single last little watt that they can out of your cooling and VRM system. So I imagine this right here will be among if not the fastest like little 13 inch laptops that you can get. I guess that's about it. I'm kind of torn on this. Like Razer got everything that everyone else gets wrong right. Like in this tiny laptop, they got great IO. The IO is awesome. Cooling: excellent. Big old battery. They have the 16 by 10 display. They have everything that I would expect them to totally screw up. Oh, Windows facial recognition, they also have that. But they just kind of lost it with the keyboard for me personally. Like if you're using a laptop like this, what you're going to be doing most of the time, I think is like answering emails, writing in word documents, watching crabs dance. You can do that very well on this actually. - [Jono] Excel spreadsheets. - All of that's going to be fine but could be better just because of that keyboard. And the speakers are pretty disappointing as well. I really want to see a Razor Book version two with a better keyboard and a brighter screen and better speakers. And then I'll probably use it every single day. Anyway, I hope that you guys have a great old day. Get subscribed to Short Circuit. Get subscribed to LTT and I don't know, go buy something from a local business. They're not doing too great right now. See you later.",
    "transcript_keywords": [
        "Razer",
        "kind",
        "laptop",
        "great",
        "Razor",
        "guess",
        "Intel",
        "nice",
        "yeah",
        "pretty",
        "Blade Stealth",
        "thing",
        "guys",
        "blade",
        "Razor Book",
        "laptops",
        "iFixit",
        "key",
        "RGB",
        "Stealth"
    ],
    "transcript_entity_values": [
        "16 gigabytes",
        "three pounds",
        "XE",
        "1599.99",
        "55 watt hours",
        "15",
        "year",
        "Razer",
        "three",
        "XPS 13",
        "1920",
        "One",
        "RAM",
        "1165",
        "4k",
        "one",
        "iFixit",
        "Intel Core",
        "65 watts",
        "Intel",
        "LTT",
        "13",
        "IO",
        "13 inch",
        "Razor Blade",
        "2020",
        "the Blade Stealth",
        "Iris XE",
        "Dells",
        "10",
        "December 1st",
        "Razor",
        "nine, 10 hours",
        "at least five 12",
        "16",
        "two",
        "Razer",
        "G7",
        "1,800",
        "Black Friday",
        "1200",
        "four",
        "600",
        "Short Circuit",
        "Razor Book",
        "CNC",
        "RGB",
        "a week",
        "ProTech",
        "Linus",
        "SD",
        "First",
        "50",
        "every single day",
        "240 gigabyte",
        "10",
        "Apple",
        "today"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "PERSON",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "MONEY",
        "DATE",
        "QUANTITY",
        "MONEY",
        "ORG",
        "DATE"
    ]
}