{
    "id": "rGTMxQJuWxE",
    "title": "OnePlus Open Durability Test - You guessed wrong...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-12-01T16:58:46Z",
    "video_url": "https://www.youtube.com/watch?v=rGTMxQJuWxE",
    "category": "Howto & Style",
    "tags": [
        "OnePlus Open",
        "OnePlus folding phone",
        "OnePlus",
        "Samsung",
        "iPhone",
        "android",
        "oneplus fold",
        "oneplus open review",
        "oneplus open vs",
        "Christmas lights",
        "Christmas",
        "oneplus open fold"
    ],
    "views": 1296128,
    "likes": 46551,
    "comments_count": 2064,
    "description": "Today we are durability testing the OnePlus Open. Grab some GOVEE Christmas lights on Amazon HERE:  or on their website   They have SO MANY LIGHTS. And huge thanks to Govee for sponsoring this video. The OnePlus open has caught the eye of many - but is the OnePlus Open as durable as the Samsung Galaxy Fold? Or will it snap in half like the Google Pixel? There is only one way to find out - and that's with a JerryRigEverything durability test!   Get my Discounted JerryRig Knife HERE:    #goveeoutdoorlights",
    "description_links": [
        "https://bit.ly/3RidGr3",
        "https://bit.ly/3sVQ5TO",
        "https://www.jerryrigknife.com/"
    ],
    "transcript": "Today we have the OnePlus Open. OnePlus says this $1,699 smartphone has an extremely prestigious bill of materials, including aerospace-grade titanium, carbon fiber, and a very special proprietary cobalt molybdenum alloy. And with all of those big buzzy words, I still don't have high hopes that this OnePlus Open will survive the rest of this video. It also has the largest camera bump Humanity has ever seen. I think before this phone kicks the bucket, we should check out the camera while installing Christmas lights from today's sponsor, Govee. Right now we're filming with the front camera on the OnePlus Open, but I'll switch to the bigger back crammers here in a minute. Just make sure you don't look over here, there's stuff going on that you're not allowed to see just yet. And now we're filming with the giant rear camera with the phone in the open position and I can already tell there's a major difference. One of the massive perks of having a folding phone is to use the nice rear camera as a selfie camera. Let's install the lights. when GOI asked if I would install their permanent outdoor Christmas lights, They actually had no idea that I've installed Christmas lights Professionally for 3 years and this isn't my first rodeo. But with 11 million registered users, these year-round IP67 waterproof lights aren't Govee's first rodeo either. Each one of the individual LED bulbs can be programmed to be whatever color you like, and each light has a 50,000 hour lifespan that can withstand temperatures from negative 20 degrees all the way up to 60 degrees. I'm installing Govee's regular permanent outdoor lights, which just permanently stick under a neve with 3M adhesive, and since they're LEDs, a single wall outlet can handle up to 200 feet worth of lights. Govee also sells a professional version that can be cut and spliced together for larger or more complex two story houses. And it has the same programmable LED system, which is nice since when it's not the holidays, the lights can double as white eve lighting. I even took a strand and put it underwater in the freezer for a week and it even still works. That's...that's ridiculous. And I know my old boss is going to hate me for saying this, but these permanent outdoor Govee lights are far less expensive than having a professional come out and install your lights for you. I'll leave a link for these down in the video description. Thanks to Govee for sponsoring this video, and thanks to the OnePlus Open for filming. Let's get started. [Intro] Turns out that OnePlus actually includes a wall charger and a phone case inside of the box. Kind of a rare addition these days, but hey, I'll take it. It also looks like during my quick foray to the outside world, my exterior screen is already scratched. Oh no, just a plastic screen protector. Historically speaking, OnePlus is kind of hit or miss when it comes to durability. During my durability test, the OnePlus 11 cracked the back glass, and the OnePlus 10 Pro kind of cracked completely in half. But all of one plus's previous phones did start scratching at level six with deeper grooves out of level 7. And this OnePlus Open, with its ceramic guard glass, is the same...at least on the outside. As we open the Open, you might notice that there are some wonky refresh lines running diagonally on the screen. This is the variable refresh rate Flexi Fluid AMOLED dropping down to a single hertz. The refreshing is not visible to the naked eye, just my camera. Something that is visible to the naked eye on this inner screen, however, are the scratches at a level 2, with deeper grooves at a level fingernail. Just like every other folding phone out there, like the Flip, the Razr, and the Pixel Fold, may it rest in peace, The flexible inner screen is made from plastic and is very easily marred. OnePlus does advertise this center screen as having ultra thin glass, which is a Samsung thing. And like Samsung, that ultra thin glass is not what's on the touchable exterior area. The touchable exterior area of the frame is made from aluminum. The long list of premium materials like titanium, carbon fiber, and that cobalt molybdenum alloy are going to be found on the inside. Hit that subscribe button so you don't miss the teardown video. Or maybe we can get all the insides to pop out onto the outsides here in a few minutes. You never know with OnePlus. It's nice that the mute switch slider is back. Super cool feature. And I do think every phone should have one of these. It's extremely convenient not having to unlock a phone to silence notifications. Everything so far appears to be made from metal and is symmetrical, which pleases me. Even the spine is metal. The bottom of the phone has some more loudspeakers as well as our 67 watt USB-C port. There is no wireless charging on the OnePlus open nor is there any waterproof rating to speak of. I mean, yeah, IPX4 which is splash resistant, but that's nothing compared to the IPX8 submersible rating of the Samsung folding phones. One thing that the Open has that the Fold does not is a camera bump the size of a dinner plate. The top camera is our main 48 megapixel. Then we have a 64 megapixel 3x optical telephoto camera on the left covered by that same hubcap size slab of glass. And finally, a 48 megapixel ultra wide at the bottom with the Hasselblad logo that OnePlus paid $150 million for taking up the fourth quadrant on the right, Out casting the plastic covered LED flash to the far corner of the phone to clear up space. Nothing against the Hasselblad logo of course, but if MKBHD's end of year camera comparisons have taught us anything, it's that you don't get what you pay for when it comes to smartphone cameras. And they're all basically the same anyway. Same with the back glass panel. Scratch resistant of course, but as we all know, glass is glass and glass breaks. Case to fire is learning that lesson the hard way. Now OnePlus has done something here that no other folding phone has been able to do withstand 1 million folds. 1 million is an astronomical number for any moving part, especially for parts so small and intricate as what's required in a folding phone hinge. However, OnePlus's 1 million actuations were performed in a controlled lab, and a lab is not always indicative of real life scenarios. Dirt and dust do exist in real life. I do like how the hinge back here has both slabs of glass meeting in the center. Both the rear panel and the exterior screen touch. I think one of the reasons that the Google Pixel Fold failed is that its halves didn't support each other when bent from the wrong direction. There is a bit of noise when these two halves munch together some dirt in the center, but so far it appears as if none of the dust has gotten inside to interfere with the hinge gears. Everything is still operating smoothly, so thumbs up for that. The exterior screen of the Pixel Fold is a 6.3 inch, 120 hertz variable refresh rate with 1 billion colors. OnePlus is calling it a super fluid OLED and it lasts for about 25 seconds before leaving a white burn mark on the pixels. There's also a whole punch cutout for the front-facing 32 megapixal cover camera. If we open up the open to the inner screen, there is another cutout for the 20 megapixel interior selfie camera. In here, OnePlus is calling this a flexi-fluid AMOLED with the same 1 billion colors and 120 hertz variable refresh rate at a full 7.82 inches. I have to talk quite a bit faster with this one since the plastic screen starts to burn and go permanently black after about 5 seconds. It does look pretty cool though. Interesting how the burn marks skip the high and low points in the crease of the hinge. It also appears like the magnets in the upper corners of the phone are collecting some more of the iron rich granules of dirt from earlier. One thing I also approve of considerably is OnePlus' decision to move the fingerprint scanner right on top of the side mounted power button. Even though it doesn't work for me in particular, it might be because we sliced the scanner with the razor earlier. It's also a tad dirty. And third, my thumbprint is basically non-existent after working on my bunker project for the past month. So we can't be too hard on OnePlus for a non-functioning scanner this time around. Finally the bin test. Yeah, the OnePlus Open can survive a million folds in a pristine environment. And it can survive some heftily forcible folds in my environment. And it can survive being bent from either direction while in its folded state, as we would expect. But can the OnePlus Open survive being folded over backwards in completely the wrong direction? Yes. Yes it can. Take a look at that. Absolutely astounding. The OnePlus Open can bend over backwards, lock out, and not break. Oh it bends, yes, but at a remarkably resilient radius. Remember, I have no problem snapping weak phones in half. But it turns out this OnePlus Open is not a weak phone. The inner screen is stretched a bit and doesn't quite snapshot like it used to, but it's still 100% functional. 100% intact and 100% passes my durability test. I'm a fan. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "OnePlus Open",
        "OnePlus",
        "Open",
        "phone",
        "camera",
        "lights",
        "Christmas lights",
        "OnePlus Open survive",
        "screen",
        "glass",
        "Govee",
        "folding phone",
        "Christmas lights Professionally",
        "Pixel Fold",
        "outdoor Govee lights",
        "outdoor Christmas lights",
        "exterior screen",
        "installing Christmas lights",
        "Fold",
        "Govee lights"
    ],
    "transcript_entity_values": [
        "Hasselblad",
        "200 feet",
        "OnePlus",
        "Govee",
        "3x",
        "Flip",
        "OnePlus",
        "Flexi Fluid",
        "67 watt",
        "1 million",
        "100%",
        "two",
        "OnePlus 11",
        "120",
        "six",
        "the OnePlus Open",
        "$150 million",
        "IPX8",
        "IPX4",
        "the past month",
        "50,000 hour",
        "half",
        "7.82 inches",
        "1 billion",
        "120 hertz",
        "the OnePlus Open",
        "OnePlus",
        "this OnePlus Open",
        "Govee",
        "OnePlus 10 Pro",
        "OnePlus Open",
        "Humanity",
        "the Pixel Fold",
        "60 degrees",
        "3 years",
        "64",
        "first",
        "about 5 seconds",
        "11 million",
        "a few minutes",
        "Christmas",
        "AMOLED",
        "Fold",
        "Samsung",
        "today",
        "these days",
        "third",
        "Today",
        "3",
        "One",
        "fourth",
        "about 25 seconds",
        "48 megapixel",
        "20 degrees",
        "6.3 inch",
        "32",
        "20 megapixel",
        "The OnePlus Open",
        "a week",
        "one",
        "a million",
        "GOI",
        "1,699",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "LAW",
        "PERSON",
        "EVENT",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "TIME",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL"
    ]
}