{
    "id": "Rh9YQGz5PqA",
    "title": "Vivo Nex S - Hidden Camera Durability Test! - Scratch and Bend",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-07-13T15:13:21Z",
    "video_url": "https://www.youtube.com/watch?v=Rh9YQGz5PqA",
    "category": "Howto & Style",
    "tags": [
        "Vivo Nex",
        "Vivo Nex S",
        "Bezelless smartphone",
        "Durability test",
        "Nex S Durability",
        "All screen smartphone",
        "Hidden camera",
        "Motorized camera",
        "no bezzel",
        "Vivo",
        "Bend test",
        "scratch test",
        "chinese smartphone",
        "best phone",
        "tech",
        "Vivo Nex Review",
        "Hands on",
        "Nex Unboxing",
        "Find x",
        "iPhone",
        "Apple",
        "Andoird"
    ],
    "views": 4942696,
    "likes": 74036,
    "comments_count": 5635,
    "description": "Hidden Camera smartphones like the Vivo Nex are the way to the future. Motorized cameras that hide inside the phone body while not in use allow for larger screens and more 'high tech' looking smartphones. Vivo has made one of the coolest phones weve seen so far on my channel, and its time to durability test the Vivo Nex S. Will the Nex S survive being scratched bent and you know... burned?  Also, we take a close look at the earpiece of the Vivo Nex S. There is no physical speaker on the Nex, the sound comes out through vibrations.. and it does sound a little bit different than normal. You'll have to listen yourself to know for sure.    Would you buy the Vivo Nex S? Should we make a transparent version of the Nex S so we can see the camera unit working inside?  Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Vivo Nex S is that sweet looking, bezel-less Android smartphone with the motorized popup front facing camera, and in-screen fingerprint scanner. Probably the most futuristic smartphone we've tested so far this year. Even though it looks epic from the outside, I'm honestly more excited to take this one apart and review it from the inside. But, like always, we got to test it first while it's all in one piece. Let's get started. [Intro] Right off the bat this thing looks incredible. Full screen design with no notch just looks good. The colorful edge to edge display is impressive all by itself, but we aren't really here to talk about the screen. There is so much other weird tech inside of this phone to check out, starting with that camera. It just pops out of the top like a daisy in springtime. It activates by poking out like an accessory on R2-D2 each time I turn on the front facing camera. And then it retracts as soon as I switch back to the rear camera or exit the app. The sound you hear isn't the actual sound the hardware is making. It's an added affect. There are actually 3 sounds. I'm going to leave mine muted, but if you're looking to impress your friends or show off the mechanical extremity of your phone, the extra sound is a nice effect. The extended camera niblet does feel very solid. There is no wiggle to the block. And when I press down hard on that camera, it will dip in for just a second and then come back up, or retract all the way if I press in too hard. It's still very firm though, and feels like it can handle it's own. The only way to know for sure will be to see how solid those tracks are from the inside, and see how the lifting mechanism is made. But for now, it seems like it can handle normal abuse. Even when I try to hold the camera out while it's pulling itself inside, the first time the motor is strong enough to yank the camera from my grip. But the second time, the gears spin for a second and then succeed in pulling it back. It's surprisingly strong. Thumbs up for that. We'll come back to the front camera in a second, but now let's see what else the phone has to offer. It's definitely nice of Vivo to include a plastic screen protector on both sides of the phone. Any protection is good protection. Now we can start with the scratch test. There is no mention of Gorilla Glass on this Nex S, but since we've made it past the level 3 pick, we know the screen is not plastic. We start seeing scratches at a level 6, with deeper grooves at a level 7, meaning we're looking at tempered glass. Sapphire would be a level 8 unless, of course, it's Apple's sapphire, that's still a level 6. You might have noticed that there is no earpiece on this phone. It doesn't pop out with a robotic camera on top either. The Vivo says it uses vibrations instead of a speaker. It's definitely a weird thing that takes some getting used to, but it works. No matter where you put your ear on the frame of the phone, you can hear sound imminating from the device...kind of like those bone conduction speakers. For example, this is what a normal earpiece sounds like. This is coming out of an iPhone 8. It's pretty standard across all smartphones with a little speaker inside the earpiece. You can't discern one smartphone from the other just by the earpiece inside of the phone. Unless, of course, there is no earpiece speaker inside of the phone. This is what it sounds like from inside the Vivo S Nex. It's done through vibrations instead of a speaker, and pretty much sounds the same no matter where you're listening on the phone, since the vibrations encompass the whole frame. It sounds a lot like a speaker phone, but contained in a much smaller area. Another successfully hidden component is the fingerprint scanner hidden underneath the display. I tested this previously with the Vivo X20, and even with scratches on the glass, the Vivo Nex S still functions. Hiding the scanner under the screen is pretty impressive technologically and physically. I made a super in-depth video on what that particular component looks like with the Vivo X20. It's pretty magical. With a closeup look at this Nex display, you can't even see where the scanner is hidden, so they're doing a pretty good job. The sides of the phone are made from metal, including the volume button and power button. At the top of the phone we have our headphone jack, which is incredible. Vivo has a bezel-less, notch-less phone and still includes that headphone jack...while Apple's over there claiming there's no room and dongles are the way to the future. Last time I checked, Apple's sold 23 different dongles, so you know what direction Apple's taking their innovation. Taking a closer look at the front facing 8 megapixel camera. The metal housing is solid with no loose movements in any direction. The camera lens is made from glass, which is important because aluminum is lower on the hardness scale than glass is, which means no matter how many times the lens extrudes out of the phone, it won't ever get scratched up by the metal right next to it...even if it ends up rubbing a bit. A scratched up camera lens would be annoying. The back of the camera has more metal and a little auto-lifting logo on the back. I'm still excited to see it from the inside, but I'll be patient. This phone is not water-resistant by the way. The Vivo Nex has a textured assistant button on the side. This guy's name is Jovi. I don't know what his competency is compared to Bixby, Siri, or Google, but he is there permanently. The bottom of the phone has our standard USB-C charging port and a dual SIM card tray. Fun fact, if you ever still your little tool in the wrong hole, like this little microphone hole right here off to the side of the tray, it probably won't cause any damage since the microphones are placed off at an angle inside the phone and the tool only goes straight in. The psychedelic back panel is pretty intense. Instead of Vivo just picking one color, we get all the colors. It is glass, which makes me think that a clear phone might be a real possibility. I'll have to give that a try. Let me know in the comments if you want to see that one. One thing I would change is that this camera setup is doing the whole death sensor blurred background thing. I still prefer an extra telephoto or wide-angle camera lens over a blurred background feature. A blurred background can basically be accomplished with just one lens anyway. The dual color LED flash is also under the glass on this one. And now for the burn test. This wall to wall, 6.6 inch AMOLED display lasted quite a while. A burn test is basically a mandatory, yet semi-pointless stepping stone to get to the next event. Kind of like what algebra is to graduation. The Nex lasted an impressive 16 seconds under the heat from my lighter, which coincidentally is about how long I lasted in math class. Hit that subscribe button if you haven't yet. The structural bend test is next. We'll see if the motorized rails inside of the frame compromise the structural integrity of the phone. There is a little more bend than I'm comfortable seeing, but still no cracked glass or catastrophic failure no matter what side the pressure is applied from. So I'm very pleased to report that this technologically advanced metal and glass sandwich passes my durability test...even the protrudy bits. Phones passing my test is a very good thing. It means that manufacturers are putting thought into construction and the longevity of our devices, which is good for us as consumers and our wallets, but also the planet. Phones are pretty hard to recycle, so the longer they last, the better. Now we just need Vivo to bring their stuff here to the United States. Only China, India, Russia, Malaysia, Hong Kong, and Taiwan get the cool phones at the moment. No US or UK, unfortunately. I'll keep the description updated if that changes. And come hang out with me on Twitter and Instagram. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "phone",
        "camera",
        "Vivo",
        "Vivo Nex",
        "inside",
        "Nex",
        "Android smartphone",
        "Glass",
        "bezelless Android smartphone",
        "bezelless Android",
        "back",
        "camera lens",
        "pretty",
        "test",
        "Android",
        "front facing camera",
        "sounds",
        "Phones",
        "Apple",
        "facing camera"
    ],
    "transcript_entity_values": [
        "US",
        "Google",
        "Russia",
        "The Vivo Nex S",
        "Nex",
        "8 megapixel",
        "R2-D2",
        "23",
        "Bixby",
        "China",
        "UK",
        "Gorilla Glass",
        "8",
        "Instagram",
        "India",
        "Siri",
        "6.6 inch",
        "jack",
        "6",
        "the Vivo Nex S",
        "Twitter",
        "Jovi",
        "this year",
        "the United States",
        "Taiwan",
        "Apple",
        "this Nex S",
        "first",
        "second",
        "Sapphire",
        "Malaysia",
        "Android",
        "16 seconds",
        "3",
        "The Vivo Nex",
        "the Vivo S Nex",
        "One",
        "one",
        "Hong Kong"
    ],
    "transcript_entity_types": [
        "GPE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "QUANTITY",
        "LOC",
        "CARDINAL",
        "GPE",
        "GPE",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "GPE",
        "GPE",
        "ORG",
        "FAC",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "GPE",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE"
    ]
}