{
    "id": "rhKa8ZaGgzc",
    "title": "A Speaker In An Ammo Box?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-01-28T23:16:57Z",
    "video_url": "https://www.youtube.com/watch?v=rhKa8ZaGgzc",
    "category": "Science & Technology",
    "tags": [
        "bluetooth speaker",
        "bluetooth",
        "speaker",
        "speakers",
        "best",
        "best bluetooth speaker",
        "2016",
        "wifi",
        "thodio",
        "a-box",
        "ammo",
        "box",
        "audio",
        "iphone",
        "android",
        "sonos",
        "bluetooth speakers",
        "wireless",
        "wireless speaker",
        "wireless speakers",
        "best wireless speaker",
        "unboxtherapy",
        "unbox therapy",
        "tech",
        "technology",
        "unboxing",
        "review",
        "apple",
        "sound",
        "samsung",
        "bass",
        "ue boom",
        "gadgets",
        "6s",
        "iphone 6s",
        "test",
        "galaxy",
        "smartphone",
        "iphone 6",
        "s6",
        "plus",
        "apple iphone 6s",
        "iphone 6s plus",
        "android (operating system)",
        "portable",
        "beats",
        "bose",
        "loud",
        "boombox"
    ],
    "views": 1576579,
    "likes": 39770,
    "comments_count": 3797,
    "description": "Thodio .50 A-BOX -   This might just be the best sounding bluetooth speaker we've ever tested in the Unbox Therapy HQ.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://bit.ly/20vXMqp",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "- What's up, guys? Lou here, back with another video. And as you can tell in front of me I have... An unusual object. This thing came in some unmarked cardboard. I had no idea what it was or what to expect, and I started to pull it out, I'm like, \"Oh my goodness.\" That's an ammunition box. Our people sending me ammunition? This obviously is not that. This my friends is a speaker built into... An ammunition box. What? Why? I mean, it does look cool. So, maybe the question is why not? Something that's really cool here is you can actually crack this thing open and look at the internal components. Look at that. Woah, you can see the driver units here. Fairly substantial in size. Very importantly, that rather large battery down at the bottom there, and then some insulation, as well, some foam insulation. This is not your run of the mill, kind of off the shelf, type deal. A power switch over here on the side. It also acts as the volume switch, too. And then over here on this side, you got a USB port. I'm assuming that's gonna be used to charge up whichever device you're using to feed audio into this. Power, mini jack, and an antenna. It seems to be that the company here, the name of the company is thoh-dio, or thah-dio. Probably thah-dio. Thah-dio or thoh-dio. I assume it's gonna be the power brick. Yes, sir. What looks like a pretty high quality, actually, mini jack cable, mini jack cable and it says professional, low noise audio cable. Why do we have an antenna? Is there a radio in here? Well, there's no way to control the radio. Is it Bluetooth? Maybe it does, let's boot it up and see. What's cool here is you can actually get a little light. See that little light in there? It's kinda cool. Also, if you inspect what look like kevler woofers, you see those often on high end studio monitor type speakers. Oh, it does have Bluetooth. It allows your friends to do what they normally do and kick you off of your own speaker. You know, everybody loves to be a DJ when Bluetooth is involved. I like to call them Bluetooth DJs. Jack knows what I'm talking about. Have you heard this new band? They're like the coolest. (stereo beeps) Oh! This thing, I'm guessing, is gonna be no joke, so let's play somethin' real quick. (loud techno music) Oh, man! (loud music) Wow! This is a legit stereo in a pretty small form factor here and it looks, in my opinion, fairly badass, as well. So, I love getting this kinda stuff here at Unbox Therapy that I didn't know existed and being pleasantly surprised. Yeah, you literally called me during a Bluetooth speaker video. - [Caller] Can you hear me? - Well, now you're in the video. He just left. What a day, what a change I gotta shit ton of bills that I gotta pay New Bluetooth champion. Wow! New Bluetooth champion. (loud techno music) These guys might of brought their A game just based on looking at the components and feeling the weight of it and whatnot. This is what you bring after you play Men's League Hockey. You put this thing in the parking lot and everybody's like, \"Excuse me?!\" This is probably gonna have a permanent home on my deck where I barbecue. These barbecued beats right here, and it's the only way I'll eat em'. Thank you very much for watching, guys. Appreciate your viewership. It is time as usual to roll out. To roll out! (loud techno music)",
    "transcript_keywords": [
        "Bluetooth",
        "mini jack",
        "Bluetooth champion",
        "jack",
        "cool",
        "thing",
        "ammunition box",
        "mini jack cable",
        "ammunition",
        "mini",
        "Bluetooth speaker video",
        "speaker",
        "video",
        "cable",
        "power",
        "thahdio",
        "kind",
        "jack cable",
        "guys",
        "Bluetooth speaker"
    ],
    "transcript_entity_values": [
        "thah-dio",
        "USB",
        "Bluetooth",
        "Unbox Therapy",
        "mini jack",
        "Men's League Hockey",
        "New Bluetooth",
        "Jack",
        "Lou",
        "mini jack"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "NORP",
        "PERSON",
        "PERSON",
        "ORG"
    ]
}