{
    "id": "RJlBaYOgB4M",
    "title": "I don't need it... - 500Hz Alienware AW2524HF",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-10-25T20:42:27Z",
    "video_url": "https://www.youtube.com/watch?v=RJlBaYOgB4M",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "alienware",
        "monitor",
        "gaming",
        "esports",
        "cs:go",
        "counterstrike 2"
    ],
    "views": 218984,
    "likes": 7613,
    "comments_count": 560,
    "description": "Get Exclusive NordSecurity deals here   All products are risk-free with Nord's 30-day money-back guarantee!  With the rise of Esports, monitors have had to get better FAST, and Alienware's new AW2524HF is bringing 500Hz gameplay down to a more accessible price. With some features missing from its older brother, will Plouffe find this to be worth the wait?  Buy an Alienware AW2524HF 500Hz Monitor:  Buy an Alienware AW2524H 500Hz Monitor:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Pretty much the fastest 0:47 Unboxing 2:56 Design and stand adjustments 4:39 Does FPS Matter? 5:07 Buttons and IO 5:43 Sponsor - Nord Security 6:35 Setup and LABS colour accuracy results 7:55 Frame time and ghosting issues 10:29 Playing at 500Hz in CS:GO 12:06 HDR thoughts in Doom Eternal 13:40 Pricing and overall thoughts 14:54 Outro",
    "description_links": [
        "https://NordSecurity.com/shortcircuit",
        "https://lmg.gg/R2OTx",
        "https://geni.us/VRVW",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "What's faster than a 500Hz display? Well, supposedly an Asus display at 540, but that's not out yet. So for now, we've got the AW2524HF from Alienware. One thing I noticed is it's got this cute little whale on the handle. I've never noticed that once before. I own an Alienware display in case that wasn't already known by everyone. And it's not 500Hz, though. And I'll tell you something, 500Hz is a dream. A dream come true. It's so fast. It's like you're looking through a window, honestly. I know that people say that basically every time. This feels like looking through a window into the real world. It's so smooth. This is the only time where it's indistinguishable. We'll play Counter-Strike on it later and just show you guys how instant everything is. Got a stand here. This is only a 24.5 inch monitor and it's only 1080p. But that's because you're trying to hit those max refresh rates for insane esports gaming. That's not necessarily what I'm interested in. I like a high refresh rate, but I don't know, past 240. It's hard for me to tell the difference. Until you make another big jump, like from 240 to 500, then you can actually feel it. In the box, probably should have told you guys as I pulled them out, we've got a USB-C to DisplayPort cable. We've also got a C13. We'll see later if this hooks up directly to the monitor or if there's a power brick. Then we've got a regular DisplayPort cable. This is what we're going to be using today to actually hit 500Hz. If you're stuck with HDMI, it's not going to hit there. It'll hit like 240, I think, at 1080p. We've also got our handy-dandy USB B to A cable. This is actually really handy for stuff like, say, you want to use the USB ports on the back of your monitor. You just hook up the B to A on your computer and it'll transfer all the signals. For me, I'm not sure how much latency it introduces, but I put the dongle from my mouse on my monitor just to save a USB port on my computer. We've got our stand. Whoa, this one took a lot of effort to get out of the bag. We've got the classic big ol' column into a big ol' twisty screw here at the bottom. Pretty universal design that most people seem to use. Not everybody. We've definitely unboxed a few monitors that don't use this system, but it's just so easy. We've also got this box. What's in the Alienware box? It's got the little AlienHead on it. I love Alienware's logo. Man, I remember when Alienware wasn't owned by Dell and it was actually crazy. Them and Voodoo. As for what's in here, it looks like it's just safety and regulatory information as well as a little AlienHead sticker if you want to rep the brand a little bit. And then we've got the display in here. We're going to do the old click-clack and pull it out. Click-clack-pull. Oh, and then we've got a little product guide here that tells me how to do all the things I just did. We've actually reviewed the previous iteration of this, the AW2524 non-HF on LTT. And let me tell you, it was beautiful then and right now it looks great except for some of these scuff marks. One moment, please. It's got a pretty sweet stand. It's not super big. And the nice thing is it's got these angles here. So if you're one of those really hardcore CSGO players who does the whole angled keyboard trick, you can have it lined up against your monitor there if it's really that close. But you know, when it's only 25 inches, 24 and a half, you got to get in there. As for the stand's capabilities, it can swivel. Yep. Oh, but it's on the stand, not the arm. You know, I kind of like that. It feels a bit like sturdier when it's on the stand itself, not on the arm. Oh, baby. It tells you to not try to pivot it when it's all the way lowered, though, in the little booklet we got. So I'm going to put it back here and check out the this is the max height and then tilt to, you know, it's always welcome. But let's see how low this monitor can go. That's not bad. It's going to fit just about any desk and it's going to fit just about any height. Something else I just noticed is it's got a little headphone stand for you. So whenever, you know, you're done gaming, just take it off. But there in terms of just design, you know, I like it. It's simple. It works. It's got the big 500 hertz badge right here. Big Alienware lettering on the front, which I'm not crazy about that much branding, but it's really not that bad. There's nothing on the stand down here. No Alien Head logo. Then if we look at the back, like most Alienware logos, it's got the first model number over here, 25. And then we've got the little Alien Head back here. Neat little fun fact. We had not this guy, but the previous iteration at LTX at the Does FPS Matter booth. And Bell ran it. He's pretty good at games. I've played against and with him in a couple of shooters. He's pretty good. And he said that the 500 hertz did not really improve his gameplay or anyone's for that matter. Now, someone who is a dedicated professional esports player, it'll probably make a difference for them. For the average person, probably not. Took it off the stand real quick to show you guys the IO. We've got our C13 power plug here for our internal power supply. If you really need a dedicated external brick, then this monitor probably isn't for you. We've got our USB-B port, couple of USB-A ports, and then a couple more down here actually as well. So we've got four USB-A 3.2. And then we've also got HDMI 2.1 and a couple of DisplayPort 1.4. Aside from that, we've got a navigation nipple down here. And then what looks like a power button right there. We're going to turn it on in just a minute and I'll tell you all about the panel that's in this bad boy. But not before a word from our sponsor. Nord Security. If you keep up with the tech news, as I do, you know that hackers are always looking for new ways to compromise everything from tech giant servers to grandma's computer. Thankfully, Nord Security's well-rounded protection package is there to help protect your files, devices, and personal data online. And maybe get a package for your grandma too. She's a matriarch. Check out NordPass, a password manager that helps you generate and store unique passwords across your devices and browsers. Or NordLocker, a powerful file encryption and sharing service that makes it easy to store important documents or embarrassing pictures you don't want leaked to the world like GamGam's boudoir photos that you did not mean to find. Cybercrime is everywhere these days, so make sure you're taking precautions when you surf the web. Right now, you can get four months free on all of Nord's products. So head to nordsecurity.com slash linus or click the link in the description below. Alright, it's turned on. Let's see, it says 60 hertz there and I believe it. This does not feel good at all. We're using DisplayPort because even though the HDMI connector is HDMI 2.1, it's not enough. For 500 hertz, 1080p, it ain't enough. So we're in 1080p, that's great. Advanced 60, garbage. Goes up to 480. Now, you got to change a menu setting to hit 500, but oh man, even 480. Like we'll get that 20 extra hertz, but it's really not much. Yeah, let's do it. Let's do it. It says 480 in the corner. Okay, great. It's working. Let's check out our OSD. It's the classic Alienware OSD with the navigation nipple. I'm pretty big on this, but that's mostly just because I've gotten really used to it because I have an Alienware monitor. We found sRGB to be the most color accurate with a Delta E average of only one and a max error of just 2.7. But it only does about 90% DCI-P3, which is still respectable, especially because this monitor is not about creation. This monitor is about gaming at the fastest speeds possible. So we've got a 4090. You know, we've got 1080p. It's going to be probably CPU bottlenecked and we'll see how good it actually works. Overclock. 500 hertz, baby. It's doing it. It's trying. Did it do it? I don't know. Oh, it doesn't feel like it feels like it's back to 60. Maybe I have to enable it and then go in and change it back from 60 to 500. Don't get me wrong. This feels the exact same as 480 did to me. When you're going between 480 and 500, there is not a whole lot of difference. At 500 hertz, that's a two millisecond frame time. Two milliseconds of frame time is very impressive. The problem is you start to see a lot of diminishing returns after about 120, 240 hertz. At 60 hertz, you're seeing about 16.67 milliseconds of frame time. And then once you jump down to or once you jump up to 120, you have that. So it goes to about 8.3. And then you have it again at 240 to four. And then you have it again at 480 to like 2.2 or something. And then, you know, the 500 gets you that flat, even two milliseconds. That's great. But like there's a huge difference between 16 and eight and even eight and four, but four to two. It's you know, it's pretty minor. That being said, my main test for just checking, you know, what my refresh rate is probably running at is I just jiggle my mouse and I try to like see how many cursors are on screen at once. Look at all those. That's science. That's scientific right there. Let's do a quick UFO test. Dang, 500 FPS refresh rate. So it looks pretty good, but I'm surprised by how much ghosting I'm seeing on the white and green frogs in particular. We've got Vsync off, but on it doesn't seem to make any difference with that ghosting either. So even at 500 hertz, unless there's some setting that I'm completely unaware of, you're just not going to fix that ghosting. Part of the problem is that while this is IPS and it looks beautiful in terms of color and even viewing angles aren't too bad. Unfortunately, it's just not going to be quite as snappy as something like OLED or even just a TN panel. That stuff is lightning quick, especially OLED, counts in literally like microseconds for pixel response time. So unfortunately, we're going to end up with a little bit of ghosting, at least on certain colors or shades like we're seeing here. We're going to try some games, though, because there is a massive difference between trying to play a game and notice a frame rate versus watching it on a test pattern. For me, I find ghosting is perceptible, but not like super perceptible, if that makes any sense. Like when you're gaming, you're kind of busy looking at everything all over the place. So it's not until you start to pixel peep and like look for things specifically that you start to actually notice it, unless a panel is really bad. If a panel is really bad, you can tell pretty quickly. Now, twenty four and a half inch or twenty four to twenty five is pretty typical for esports sized monitors. And it's also pretty typical for displays that are this fast. The problem with that, at least for people who are used to bigger displays, is that it's really small. One of the first things that both Bell and I noticed was like, wow, we went to sit down in front of this and I'm like, I've got to like get right in front of this thing because it's tiny. And so it's going to be a price that you're going to have to pay. You cannot get five hundred hertz refresh rate in a bigger monitor, at least not yet, maybe a few years from now, but definitely not yet. So, you know, we set our FPS max to a thousand just to make sure that this thing can breathe as much as it wants to. And we are now getting, you know, six hundred, seven hundred, maybe eight hundred frames a second, depending on where you are. Yes, something doesn't feel right. Like it's it's hitting high FPS, but it's still with how blurry it gets when I shake this much. It still doesn't feel like five hundred hertz because it's fast IPS and the moving picture response time isn't going to be as good as you might want it to be. It still doesn't feel perfect. We saw the ghosting on the frogs. We see when I shake the camera really quickly, it gets a little blurry and a little blendy. So I think that at the end of the day, refresh rate just isn't king. It's important. And is this going to look amazing? Yeah, we'll fire up another game just to look at how good the colors are and all that. I think that when you're deciding on what monitor to buy, you really need to examine a lot more than just refresh rate and PPI. Let's fire up Doom. Let's see how Doom feels. We've got HDR turned on now in Windows and in our sweet, sweet display here and in the game. I got to say it looks OK. It's putting up some decent bright spots. We measured three hundred and thirty three nits peak brightness and HDR, which is fine. The problem with this thing is it's not you know, it's not meant for stuff like this. It's not meant to look cinematic. It's meant to give you the fastest frame rate possible. This thing looks fine in game. I will admit, when you're watching content like this and you're not looking for individual issues, it looks OK. You're not going to see a ton of bloom unless it's a very obvious example of, oh, here's a pinpoint here on a dark spot. Those bright flashes from the gun actually look terrible. It brightens up my whole screen, essentially, instead of like just here. OK, so that's a really good example of that looking real bad. It doesn't help that I'm also low health and so I've got some red filter on my screen. It's not as bad now that the film is gone, but it still brightens too much of my screen instead of a simple pinpoint right where my muzzle flash is. There's a reason that they're not even really promoting HDR all that heavily for this version. The main difference between the HF and the H is that this does not have the G-Sync badge. It does not have native G-Sync module on it. It's got FreeSync Premium, which is pretty sweet. I will admit, right now, this is not an awful experience and I'd be more than happy to play this. I'd probably play it in HDR instead of SDR. This one, without the G-Sync module, the AW2524HF is $650 right now, which is kind of a lot for a 24 and a half inch 1080p display that doesn't even have a great HDR experience. However, there's really no competition at 500Hz or there's not much, especially not when you want fast IPS for better colors than a TN panel is going to give you. What makes it even better is the NVIDIA one with G-Sync is $830. So if you want to save like $200 and you were already thinking of getting the non-F version, honestly, you've done yourself a favor by waiting because $200 less makes this a lot more affordable to a lot of people. I personally probably wouldn't buy this. I think that 500Hz, it's a little too much for most people. $240 is still really good and still a huge jump, especially different panel technology like OLED where you have those lightning fast pixel response times. It's a fantastic experience. This is still really, really good. And there are absolutely gamers out there who not only want this, but need it to get that edge over their opponent. So if that's you, the AW2524HF from Alienware might be worth checking out. This is Short Circuit. If you want to look at another video, check out the LG27GR95QE. That's an OLED monitor. It does 240Hz. It's not 500, but it's still real fast.",
    "transcript_keywords": [
        "Alienware",
        "monitor",
        "hertz",
        "Pretty",
        "good",
        "stand",
        "refresh rate",
        "rate",
        "bad",
        "feel",
        "time",
        "big",
        "lot",
        "difference",
        "pretty good",
        "refresh",
        "HDR",
        "thing",
        "display",
        "feels"
    ],
    "transcript_entity_values": [
        "500Hz",
        "60 to 500",
        "three hundred and thirty three",
        "24 and a half",
        "USB",
        "NVIDIA",
        "two millisecond",
        "G-Sync",
        "Bell",
        "about 8.3",
        "twenty four and a half inch or",
        "24.5 inch",
        "just a minute",
        "830",
        "DisplayPort",
        "SDR",
        "500",
        "a thousand",
        "Short Circuit",
        "four to two",
        "GamGam",
        "Dell",
        "480",
        "today",
        "six hundred, seven hundred",
        "FPS",
        "about 16.67 milliseconds",
        "3.2",
        "500Hz",
        "a ton",
        "25",
        "five hundred",
        "eight hundred",
        "24 and a half inch",
        "OSD",
        "LTT",
        "TN",
        "max",
        "non-HF",
        "240",
        "240 hertz",
        "Alienware",
        "only 25 inches",
        "first",
        "2.7",
        "Asus",
        "twenty four to twenty five",
        "540",
        "HF",
        "200",
        "CPU",
        "2.1",
        "eight",
        "slash linus",
        "about 90%",
        "Nord Security's",
        "between 16 and eight",
        "Two milliseconds",
        "Nord",
        "second",
        "CSGO",
        "DCI-P3",
        "NordPass",
        "HDMI",
        "2.2",
        "AW2524",
        "120",
        "two milliseconds",
        "the end of the day",
        "hertz",
        "1080p",
        "only one",
        "Voodoo",
        "4090",
        "NordLocker",
        "Windows",
        "One",
        "four months",
        "C13",
        "60",
        "20",
        "240",
        "Nord Security",
        "IO",
        "650",
        "FreeSync Premium",
        "only 1080p",
        "Vsync",
        "a few years from now",
        "four",
        "between 480 and",
        "OLED",
        "240Hz",
        "about 120"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "MONEY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "MONEY",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ]
}