{
    "id": "RjPotg-6e6g",
    "title": "Retromini Clone GBA Review",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2018-01-02T16:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=RjPotg-6e6g",
    "category": "Science & Technology",
    "tags": [
        "Nintendo",
        "Retromini",
        "Retro Mini",
        "video game",
        "handheld",
        "Game Boy",
        "Game Boy Advance",
        "NES",
        "Super NES",
        "clone",
        "emulation",
        "retro gaming",
        "ROM",
        "rechargeable",
        "review",
        "This Does Not Compute"
    ],
    "views": 116725,
    "likes": 2252,
    "comments_count": 287,
    "description": "There are plenty of clone handheld consoles out there. Does the Game Boy Advance-focused Retromini stand out from the rest?  Amazon search (multiple sellers):   -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by Lakey Inspired ( and Epidemic Sound ( Intro music by BoxCat Games (",
    "description_links": [
        "https://www.amazon.com/s/ref=nb_sb_noss_2?url=search-alias%3Daps",
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "http://www.soundcloud.com/lakeyinspired)",
        "http://www.epidemicsound.com).",
        "http://www.box-cat.com)."
    ],
    "transcript": "Hey everyone, it's Colin. How's it goin'? There are plenty of handheld systems out there that can play retro game titles. But they often fall short in one way or another. Is this one able to break the mold? [ Music - Intro ] This is the Retromini. Despite its appearance as a shrunken-down Game Boy Pocket, it's advertised as a Game Boy Advance emulator. It has a two inch backlit screen, with a 240x160 pixel resolution, just like the original. The handling of it is decent: The front buttons and D-Pad are fairly responsive, and neither too clicky nor too mushy. But the shoulder buttons are hidden on the back behind the screen, and they feel just plain crowded. The fact that they used super clicky tact switches doesn't help matters either. There's a headphone jack on the bottom, but there's no video output or even a link port. The manufacturer claims a battery life of six hours. I got a little over five with a game playing its demo loop continuously. Charging happens over MicroUSB, and the battery is replaceable. It uses a standard pack most commonly seen in old-school Nokia cellphones. The Retromini lacks a cartridge slot, so it only plays games off of ROM files. Forty titles are built-in to the console, all of 'em well-known. Zelda: Link to the Past, Mario Kart Advance, F-Zero: Maximum Velocity, Pokmon Emerald, and more. It also has a MicroSD card slot, and includes an 8 gig card in the box. On my unit at least, that card came preloaded with over 500 GBA game ROMs, again, all commercial titles. Now, I realize the vast majority of people who buy consoles like this are gonna use pirated ROM files, but there's still a big difference between offering the capability and actively engaging in piracy as a selling point. Needless to say, this console is not officially licensed to include these games. In addition to those files, the system can play music, videos, and eBooks loaded to the SD card. Just like its game selection, a few \"example\" media files come preloaded, including a copy of the song Hotel California by the Eagles, and this... weird video with that Crazy Frog character from the late '90s. [] Some things just can't be unseen. But who cares about that? What's the gameplay experience like? In a word: mediocre. The emulation does work, but it has obvious performance problems. It definitely has a lower framerate than original GBA hardware, sometimes noticeably so. Also, it seems to play games slightly slower than normal and the audio quality tends to suffer a bit too, though at least the built-in speaker gets decently loud. Another limitation is the support for ROM files. As far as handheld consoles go, only GBA games are supported. I tried Game Boy and Game Boy Color files, but it wouldn't even recognize 'em. Yet the console will play NES and Super NES ROMs, albeit with some pretty poor video scaling. But even when playing GBA games, the screen hurts the experience a bit. Color saturation isn't very good, and my unit had a bit of a blue tint to it. Despite the fact it's running at the game's native resolution, somehow the screen doesn't appear as sharp as it should, as if there's a small amount of interpolation going on. But for all this console's flaws, at least it does support not only game saves, but also save states. So really, the Retromini is nothing special. Just like other typical clone consoles, its otherwise good intentions are let down by the way they're executed. The handling of this console would be good, if *only* the shoulder buttons weren't so annoying. The screen would be a major selling point, if *only* a higher quality part was used. Its emulation would be attractive, if *only* it didn't perform rather poorly. The ability to play your own ROMs off of an SD card would be really convenient, if *only* it supported other Game Boy models too. And ultimately, I'd be willing to overlook *a lot* of these flaws, if *only* the console didn't cost me $60. If you like the video, I'd appreciate a thumbs-up and be sure to subscribe if you haven't already. You can follow me on Twitter and Instagram at thisdoesnotcomp, and as always, thanks for watching.",
    "transcript_keywords": [
        "Game Boy",
        "game",
        "GBA game ROMs",
        "Game Boy Advance",
        "Game Boy Pocket",
        "GBA games",
        "games",
        "Boy",
        "ROM files",
        "Colin",
        "Game Boy Color",
        "console",
        "files",
        "GBA",
        "play",
        "card",
        "shrunkendown Game Boy",
        "screen",
        "playing GBA games",
        "GBA game"
    ],
    "transcript_entity_values": [
        "NES",
        "F-Zero",
        "Nokia",
        "Retromini",
        "two inch",
        "Crazy Frog",
        "a little over five",
        "MicroSD",
        "Instagram",
        "240x160",
        "8",
        "60",
        "Hotel California",
        "500",
        "GBA",
        "jack",
        "SD",
        "one",
        "Eagles",
        "Pokmon Emerald",
        "Game Boy",
        "MicroUSB",
        "the late '90s",
        "Forty",
        "Zelda",
        "Colin",
        "Mario Kart Advance",
        "six hours",
        "Twitter",
        "Game Boy",
        "D-Pad"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "LOC",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "TIME",
        "PERSON",
        "PERSON",
        "ORG"
    ]
}