{
    "id": "rkL1rs1oGmc",
    "title": "NEW TINY 4K CAMERA! Sony RX0 II Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-03-26T03:45:35Z",
    "video_url": "https://www.youtube.com/watch?v=rkL1rs1oGmc",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "4k camera",
        "sony rx0ii",
        "review",
        "test footage",
        "sony alpha"
    ],
    "views": 281069,
    "likes": 7735,
    "comments_count": 879,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys. It's Justine and today we are checking out the brand new RX 0 Mark 2 that was just announced by Sony. It has a one inch sensor. It's the same sensor that is in the RX 100 Mark 5, which a lot of us use for vlogging. Not only will it now record 4k internally, it has a much more advanced auto focusing, especially with eye auto focus. And it also has a flip up screen. What is this? I don't care who you are. No one can tell me that this is not absolutely the cutest thing that you have ever seen. This entire camera is waterproof up to 30 feet and you guys can tell right here that this body of it is made of a very rugged material. It's small. It's compact, which makes it perfect for traveling. It's also so inconspicuous. It's one of those things where it's not intrusive. So you're not carrying around a massive camera. A lot of people get intimidated, especially with the vlogging, when you have this huge camera that you're carrying around. I got a chance to check this out for the past week so I thought that we'd take it out on a few adventures. I went to visit some poppies here in California because we've had so much rain, everything's so beautiful. Everything is green. The flowers are blooming everywhere. So I took this out and here's a little bit of footage that we got from the poppy fields. (lively music) Look at this. - Small face. - Look at this. This is my first time testing this out. This is the new RX 0. We are on our way to see some poppies. - [Woman Offscreen] Possibly. - Possibly. The poppies may not be there. They may be sleeping. They are very picky at the times that they wanna come out but this is my RX 0 2 vlog. It looks as though there may be a lot of people here. (lively music) Flip screens are great. I can see what I'm doing. Let's give away your money. - [Woman Offscreen] There's no sign anywhere that says how much money. - It doesn't, but I'm assuming it's $10 because it said on the internet. Hi, how are you? - I'm good, how are you? - Good, thank you. - Alright, so it's $10 for parking. - [Woman Offscreen] Do I just go on to the other? (women yelling) - First stop at the poppy fields is using the restroom. It took us about an hour and a half to get here, so it's quite a long drive but definitely worth it. (lively music) So pretty. We're trying to figure out which way to go now to get some of the best shots. I've been testing out the high frame rate and just taking some photos. This camera's so cute and perfect for sort of a situation like this. We've found, are these ants? Why do they have wings? Oh, I'm disgusted. We're moving on. (lively music) The first version did record 4k, but not internally so you needed an external recorder to be able to record 4k. But this one does record 4k internally so you don't need anything extra. This one is the original version. As you can see it looks very very similar to the second version. But since this screen does flip up, you can see that it is just slightly a little bit thicker. I'm really excited because that was really one of the things that I wish this camera originally had. I would love to know what quality do you guys even watch your videos in. Because I always talk about shooting in 4k and a lot of people say I don't ever even actually watch content in 4k. Especially if you're in Safari and you're on Youtube, you don't even get the option to watch 4k. It only goes to 1080, which kind of drives me crazy. I put all this effort into exporting 4k videos for you guys and you don't even get to enjoy the crisp quality. Also another cool thing about this camera is you're able to transfer 4k footage of this directly to your phone. Sony also announced two new apps. If you've been in the Sony family for a while then you're probably extremely familiar with the Play Memories app, which allows you to transfer videos and footage from your cameras to your phone. But they now have a new app. It's now called the Image Edge Mobile. But it also allows you to do remote camera on and off, which this is something that I think is awesome, because if you do have your camera mounted somewhere and you can't actually reach it, so I'm looking up at the corner of my room, like if I had it mounted up there I wouldn't have to reach up and get it, because using Bluetooth, if I did have power going to it, I wouldn't actually ever have to touch it. I could just use this to be able to control it. So in addition to overhauling the Play Memories app, which is now the Image Edge Mobile, they now have this movie edit add on app, which is kind of awesome because you basically can take all of those videos that you've just transferred to your phone and you can edit them. Having a very simple image editor, especially something that is developed by Sony to work with their cameras and their footage, is such a blessing. I can't even get over this, because it's such a simple app. The app is extremely intuitive. You just go through and you can add some of the videos. So these are some of the videos that I already captured. Brought those in just like that. And here's your timeline. It's super simple. And you can just drag and drop. You can easily change the aspect ratio right here. So if you wanna do an Instagram story. - [Justine, On Phone] Oh my gosh, so we're at Puppies and- - [Justine] So you can go in and trim. And it's so fast. Click okay and that's it. That's basically, that's everything. This camera also has some in body image stabilization, which is pretty impressive. I'm just watching some of this footage and it all does look super smooth. So just knowing if you're out vlogging and filming, at least your footage will look pretty steady. So let's turn this on. I have been using it for a little bit but you can see here, that flips up, so you guys can see yourself. This also has super slow motion, so much like most of Sony's cameras, you may be familiar with the high frame rate. So this can shoot up to 964,000 frames a second, which is pretty fast. Obviously the higher the frame rate the decrease in the quality of the content. So usually I just shoot on 60 frames even though it's not 4k. But you can still slow that down and still have higher quality video. The auto focus on this is really fast, but one of the things to note is it doesn't have a continuous auto focus. So once you hit record, whatever the set distance is that it's focused, it will stay in that focus range. This does sometimes cause problems if you are filming yourself and then you're trying to film something far away or something super close. So to avoid running into any of those issues, whenever I was out filming and I was filming myself I would stop recording, flip it around, and then grab that focus and continue filming. So it is kind of a different style when you are used to just continuously vlogging. So I'm definitely hoping that in the next version that is something that they implement. Because having a continuous auto focus really is such a key part of vlogging. It's already hard enough vlogging and making videos by yourself and then having to worry about if the footage is in focus. That's where this flip up screen is super helpful. If you like shooting in picture profiles you can also do that on here. I used to do that a lot more but when I'm just shooting stuff like this, I'm not really doing anything that crazy, I sort of just keep it on a normal picture profile, nothing too crazy. But if you do love to have more flexibility when you're color grading your footage you can use different picture profiles on here. So you can basically customize this to match any of your bigger Sony cameras like your A7S, your A7S2, your A7S3s. We're out here testing out the RX0 Mark 2. Obviously the key feature of this is it does have the flip up screen. This is so awesome because I can actually see myself and you, Jenna. Watch, I'm gonna hit record. - [Jenna] It's so bright. - It's super bright. This is cool. I've been taking some photos and some videos. So I'll show you guys some of those. It's so pretty out. (lively music) There's some pictures. Wow, that actually looks really good. I'm impressed. That's, that's a me problem. I also love this track feature. So if you are shooting something like a vertical video like this, I can put that on Lindsey right there and I can hit start and it will automatically track her. If she is moving around and you do wanna keep something in frame. This makes it super simple that if you are shooting horizontal video and you do wanna post something on Instagram, you can easily track your subject and then export this. And then that's it. Let me show you guys inside here. This is where you have your SD card, your HDMI out, your micro USB. And then this is also really exciting because you can use a microphone input with this, which is kind of silly because RX 100 Mark 5 doesn't even have an audio input. That's something that I've always wanted on that camera. Over here, this opens up as well and that's where your battery goes. Got your record and your off buttons. And on the bottom, that's where you can screw in a tripod or any other mounts. And of course this is waterproof. So make sure that if you take this in the water that this stays closed. One of the cool things about this camera is that it's waterproof. Now the last time that I tested out the RX 0 I was on an exotic vacation in Hawaii. Well I'm not on a vacation in Hawaii right now but I am at breakfast and I do have a glass of water. So how about I put you guys in it? Is this even gonna fit? I think so. Oh I should drink some, displacement. Okay, well it's in there. (underwater sound effects) Is this better than Hawaii, a Hawaii vacation testing out my camera? (underwater sound effects) This is the best underwater test. It's definitely better than my sister's. She didn't take her camera into a pool with a waterproof scooter, did she? She did. This little grip many of you guys have seen before. So you can plug that right here in the back and that'll allow you to control your camera. So watch this. I am recording now. It has a little recording button right here. You can also zoom, zooming in, zooming out. This is what it looks like zoomed all the way in. It's nice because you can zoom while you're recording as well. Also folds out into a little tripod. Oh my gosh. It's so cute. Now I'm gonna leave you guys with some vlog footage that I filmed from this over the past few days. If this is something that you guys are looking for, like a small portable little camera, shoots 4k, it's rugged, it's waterproof, small, compact, inconspicuous, great onboard audio. It also does interval shooting so you can do really cool time lapses. It's just a super fun edition to my toolkit. You guys, Los Angeles traffic is no joke. People don't know how to drive and the roads aren't made for this many people. It's actually shocking that anybody ever gets around or anywhere on time, which usually they don't. I'm on my way to Lily's Girl Love event. I went to one last year and it was so much fun and I absolutely love Lily. So maybe I'll have her say hi to my vlog. We'll see. Lily. Oh my gosh. How are you? I haven't vlogged in so long. - Really? - So this feels so weird for me. - But you're so naturally good at it. - Yeah but it's been so long. - But you're you. You paved the way for every other vlogger out there. - This event is amazing. - Thanks, I'm so glad you could. - Congrats on your talk show. - Thank you. It's crazy. It's a whole thing. - When I saw that news I started freaking out. I was in my room screaming. I should actually have filmed it. But since I don't vlog anymore. - That's okay. Some moments can be for us. - That's true. I love you. Congratulations. - Thanks for coming, I appreciate it. - We're on our way to Puppies and Planks. - Puppies and Planks. (mellow music) - This is the craziest thing ever. I am so in shock. There are so many dogs. This is wild. So we're at Puppies and Planks. Here's Lindsey and Luna. - Yes. - This is the craziest thing ever. There are dogs and fitness activities all day. I've never seen anything like this ever. - I've never seen so many dogs in one place. - This is insane. - And there's food trucks. There's porta potties. You know it's a big deal. - It is. - 'Cause the porta potties are here. I'm excited. - We gotta find Cassie. She did such a great job. Cassie, this is incredible. - Thanks you guys for coming here. How are you? - Can you say hi to my vlog? - Hi vlog. We're here. - Cassie did this all. You put this all on. - This is crazy. - It's incredible. Congratulations. - Okay, I didn't know if it was gonna rain. I didn't know if anyone's gonna show up but look at all the dogs. So many dogs - There are so many people. So many dogs. - So many dogs. - I love it, I love it. Oh my gosh, I'm so excited for you. - Thanks for coming. Thanks for coming. Ah, it means so much to me you guys. - [Announcer] Alright, now, puppy squats. If you have a puppy, pick up. - Like 15 pounds. - Woo. - [Announcer] Fast, having your arms out like this, holding something up, helps to correct any postural problems. - But overall I think this is a super fun camera. The only thing that you need to pay attention to is your focus, to make sure that things are in focus. And I do love the flip up screen. The first time that I saw this I was just in shock. I was like what? How did they make this so small and tiny? It's super cool. I don't think that this is a camera for absolutely everyone but I do think that if this something that you're looking for, this is a really great camera. It shoots 4k. It's so inconspicuous that when I was out vlogging nobody even thought twice. It's just so small that no one's gonna think that you're recording high quality content on this. But surprise, you are. I look forward to seeing what you guys think of this, and especially the new Sony Imaging app. I'm so excited about that. I do so much on the go and on my phone and on my iPad that having things like this to make my work flow easier when I'm on the go is so exciting. (siren sound) (lively music)",
    "transcript_keywords": [
        "camera",
        "guys",
        "Sony",
        "super",
        "love",
        "focus",
        "footage",
        "videos",
        "Sony cameras",
        "thing",
        "things",
        "flip",
        "app",
        "record",
        "vlogging",
        "dogs",
        "Puppies and Planks",
        "cameras",
        "people",
        "Mark"
    ],
    "transcript_entity_values": [
        "A7S",
        "4k",
        "Safari",
        "Luna",
        "all day",
        "RX 0",
        "second",
        "one",
        "the Play Memories",
        "iPad",
        "the past week",
        "the Image Edge Mobile",
        "15 pounds",
        "Justine",
        "Lindsey",
        "Sony",
        "Hawaii",
        "Instagram",
        "Bluetooth",
        "Lily's Girl Love",
        "last year",
        "Los Angeles",
        "up to 30 feet",
        "Puppies and Planks",
        "964,000",
        "SD",
        "1080",
        "today",
        "two",
        "10",
        "California",
        "Jenna",
        "Cassie",
        "60",
        "first",
        "about an hour and a half",
        "Sony Imaging",
        "the past few days",
        "Youtube",
        "USB",
        "RX",
        "One"
    ],
    "transcript_entity_types": [
        "GPE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "GPE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "GPE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}