{
    "id": "RlPesrNpPNQ",
    "title": "Intel tried to keep this from me - Intel Arc Pro GPUs",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-08-13T17:54:58Z",
    "video_url": "https://www.youtube.com/watch?v=RlPesrNpPNQ",
    "category": "Science & Technology",
    "tags": [
        "intel",
        "arc",
        "alchemist",
        "arc pro",
        "gpu",
        "graphics card",
        "video card",
        "workstation",
        "professional",
        "nvidia",
        "rtx",
        "siggraph",
        "2022",
        "video encoder",
        "ray tracing",
        "photogrammetry",
        "animation",
        "digital twin",
        "performance",
        "arctic sound-m",
        "datacenter",
        "plask",
        "webcam",
        "motion capture",
        "mocap",
        "video",
        "manus",
        "finger tracking",
        "tracking",
        "glove"
    ],
    "views": 877680,
    "likes": 38550,
    "comments_count": 1005,
    "description": "Play Crossout for FREE on PC, Xbox Series X|S and PS5:   See you in battle!  Purchase the Viewsonic X2000-4K at   We almost didnt attend SIGGRAPH, but we had to go when Intel revealed Arc Pro GPUs. Is it everything graphics professionals hoped it would be, and if not, what did Nvidia announce?  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:54 Arc Pro A40 demos 1:57 Arc Pro A40 & A50 specs 3:05 Arctic Sound-M datacenter GPUs (SuperMicro) 4:23 No Nvidia on the show floor 5:17 Webcam-based motion capture (Plask) 6:03 Finger-tracking gloves (Manus) 7:00 Conclusion",
    "description_links": [
        "https://xoplay.link/ltt.",
        "https://geni.us/7vBAO",
        "https://linustechtips.com/topic/1449242-intel-tried-to-keep-this-from-me/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- This is it, Intel Arc Pro. These cards are the first of their kind, the A40 and A50. And when we heard they'd be at SIGGRAPH, we rushed over here to see them. And it looks like Intel did too. (laughs) Oh, Intel. But why did Intel choose SIGGRAPH of all places to launch new GPUs? Why hasn't Nvidia announced theirs? And is there even anything on the show floor here that might make use of either of them? There's only one way to find out. And only one way to hear about our sponsor. - View Sonic. Their X2000B-4K projector offers a 4k HDR experience with an ultra short 0.22 throw ratio. It's capable of a 100-inch screen from just 23 centimeters away. You can learn more at the link down below. (\"Supernova\") - Of the new Arc Pro GPUs, the A40 is what Intel is calling an entry level professional card, with a TDP of 50 Watts and a low-profile compatible, single-slot form factor. There's a halfway decent performance, and that's a very good sign, considering the integrated AV1 encode engine and fast, mature H.264 and 5 encoders common to all our GPUs. That's so tempting, that I could see people buying an A40 for that alone, even if they're using it alongside another GPU in the same system, which is why it's so strange that Intel isn't opting to show off that encode capability at SIGGRAPH. Instead, they've got a 5B renderer demo, connected up to SketchUp, which runs at about 30 or 40 FPS in a simpler scene like this, that Intel says is indicative of, for example, an interior designer or floor planner workload. Fair enough. This is SIGGRAPH after all. And the six gigs of video memory is more than enough to handle a scene like this. Only about four gigs are in use here at the moment. On the other side, Intel's got another A40 running Topaz AI video enhancement, which to be fair to Intel, is something that's more likely to be used alongside that encoding engine. Unfortunately, these are the only demos Intel has on the floor. No, A50s are running, although the only major difference between the A40 and A50 is a bump up to a 75-Watt TDP and commensurate cooler design, in a dual slot configuration as well. Everything else, the ray tracing and compute cores, video memory, PCI express bandwidth, you name it, is identical between these two cards. That means that you might be able to make an A40 into an A50 with a simple TDP adjustment assuming you shore up the cooling. Like regular Arc, Intel's saying that they're targeting aggressive price points for their performance class, but they won't tell me how much, maybe they don't even know yet. Because both of these cards are rated within 75 Watts of power drop, they don't require any external power connectors which is a bonus for small form factor PCs like the NUCs they have on display here. Their PCI Express X16 cards, but they're wired for 8X at Gen 4 speeds, which at this performance level is probably plenty, but we'll have to see for ourselves when we get our hands on them. As for display outputs, both boast quad mini display port 2.0 connections with HDMI 2.1 output capability rated for 4k 60. So HDMI 2.0. Surprisingly, Intel's exhibit isn't the only place to find Arc GPUs. And for that, we're here at Supermicro's booth to look at these, Intel's Arctic Sound-M server-grade GPUs. See what they did there? Arc, Arctic Sound. (chuckles) Anyway. Unlike the previous Arctic Sound GPUs that have been available, these are based on Big Alchemists the same GPU cores as the A500 and A700 series GPUs. These just began shipping in late July and Supermicro here will be one of the first to deploy servers with them. What we have here are two different, unnamed SKUs. The low profile card is 75 Watts and the full size, beefy boy is 150 Watts. From what Intel said about them so far, the smaller card is actually a dual SOC design, where the big one is a single kind of monolithic GPU. Supermicro is wisely leaning heavily on the hardware video encoders in their data sheets here. And they tell me that in their testing, Intel's performance estimates on the encoder are incredibly understated. The low profile card alone has been tested to handle up to 60 streams of 1080p 60 streaming video, which is just insane. If we're really nice to them, they say that they'll let us take one for a test drive sometime soon. Is that right? Yeah, that's right. As for the competition, Nvidia, who's sponsoring SIGGRAPH, doesn't have a booth here. And sadly, did not announce any new GPUs in the event this year, which is strange, given how much time they spent talking about the RTX reveal during SIGGRAPH 2018 in this year's special address. Instead, we got more details on their plans for the Metaverse and new updates to Nvidia's Omniverse platform. Now, I'm just as excited about this stuff as the next person. Take that how you will but without hardware, it's tough to see how all of this photogrammetry and AI motion capture will be applicable to anyone really. There's a seriously massive amount of compute horsepower that goes into things like digital twin simulations and with current gen hardware, it's tough to see how they expect to democratize these things. We'll have to wait a little longer to see what their plans are, and hopefully it's not just crank up the TDP like we've heard so far. Speaking of photogrammetry, while the tech will make it easier to rapidly create 3d models, even for novices, actually animating those models is another story entirely. There's plenty of examples of professional grade motion capture on the floor here but what about you guys at home? Enter Plask, a company that's been using some pretty advanced software techniques to take captured 2d video from a video camera or a webcam and translate it into motion data. If you've ever heard of rotoscoping, the technique used back in the eighties and nineties, where animation was done by drawing over frames of video, this is basically that, but entirely automatic. The best part of it is that it's free for individual use. I can foresee a lot of VTubers picking up on this, if they haven't already. And they might pick up on finger tracking gloves too. There's a few of them on the show floor but Manus here is special because it was their tech that actually was used by Keanu Reeves for motion capture for the Matrix demo for Unreal Engine 5. Granted this is probably far more expensive than Elite Motion that VTubers use for hand tracking today, but it is extremely accurate. Think about your fingers for a second. The fine motor control most of us have over our fingers, the little movements you can make, those can't be fully captured by film alone. It's incredibly difficult. What makes these super cool is that not only do they track those fine movements, they automatically map out the layout of your hand. Each joint and bone segment are accounted for at 120 Hertz. They're also wireless, although they're being used wired here. So when these trickled down to consumers, it's gotta make VR so much more immersive. They already have some work for Unity and Unreal Engine baked in, and they used SteamVR to boot. So it's not a huge leap from here. SIGGRAPH's not our normal hot. So this might have been a little bit of a weird video. Still, there were some things that we just couldn't ignore for many reasons. And here we are, unfortunately, it's not as exciting as it could have been. Arc is still dripping out at a very slow pace, and Nvidia is still holding out on us. But at the end of the day, there's a lot of exciting things here. And hopefully, you've found it exciting too. And hopefully, you'll find our sponsor exciting as well. - Crossout. Crossout is a free to play online vehicle shooter on PC, PS4, PS5, Xbox One, and Xbox Series X and S. Every vehicle is made from a huge arsenal of parts, from structural elements to wheels and weapons. So you have creative freedom as you create your ideal rig. There's chainsaws, Gatling guns, power drills, lasers, and that's not including all the engine and chassis options. It's easy to get started. You can quickly craft a new vehicle from scratch with their in-game editor for a test drive or head right into battle. It's got PvP modes, PV raids, there's even a narrative-driven, open world campaign called adventure mode. So you can play solo or with a friend. So what are you waiting for? Download Crossout today using our link below and receive a free bonus for signing up. - Thanks for watching guys. It's been a while since we've last done a show like this. Maybe, check out one of our older show videos. See what things used to be like.",
    "transcript_keywords": [
        "Intel",
        "Intel Arc Pro",
        "SIGGRAPH",
        "Intel choose SIGGRAPH",
        "GPUs",
        "Arc Pro GPUs",
        "video",
        "Arc",
        "Arc Pro",
        "Intel Arc",
        "Arctic Sound GPUs",
        "Intel Arctic",
        "find Arc GPUs",
        "TDP",
        "Watts",
        "Intel Arctic SoundM",
        "engine",
        "Nvidia",
        "floor",
        "motion"
    ],
    "transcript_entity_values": [
        "about 30",
        "2.0",
        "A40",
        "one",
        "year",
        "second",
        "SOC",
        "100-inch",
        "75-Watt TDP",
        "Xbox One",
        "Arctic Sound-M",
        "first",
        "0.22",
        "SIGGRAPH 2018",
        "Supernova",
        "TDP",
        "late July",
        "Hertz",
        "VTubers",
        "Supermicro",
        "Matrix",
        "SketchUp",
        "GPU",
        "75",
        "today",
        "4k",
        "Watts",
        "the end of the day",
        "Arc",
        "Manus",
        "120",
        "Only about four",
        "Arctic",
        "SIGGRAPH",
        "Watts",
        "Intel Arc Pro",
        "PCI",
        "A700",
        "Keanu Reeves",
        "Unity and Unreal Engine",
        "PS5",
        "Arc Pro",
        "Xbox Series X",
        "3d",
        "5",
        "4k 60",
        "150",
        "the eighties and nineties",
        "1080p 60",
        "PV",
        "2.1",
        "Crossout",
        "Omniverse",
        "Topaz AI",
        "Nvidia",
        "A50s",
        "Plask",
        "six",
        "Metaverse",
        "5B",
        "PCI Express X16",
        "this year",
        "50",
        "Fair",
        "PS4",
        "60",
        "just 23 centimeters",
        "only one",
        "Elite Motion",
        "two",
        "Gen 4",
        "Intel",
        "A500",
        "2d"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "FAC",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "LOC",
        "ORDINAL",
        "CARDINAL",
        "EVENT",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "PRODUCT",
        "CARDINAL"
    ]
}