{
    "id": "RM7SobH8ZO0",
    "title": "Dope Tech: Nothing Phone 2 Redesign!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-07-03T19:00:23Z",
    "video_url": "https://www.youtube.com/watch?v=RM7SobH8ZO0",
    "category": "Science & Technology",
    "tags": [
        "nothing phone",
        "nothing phone 2",
        "xr stage",
        "8k video wall",
        "virtual proudction",
        "Dope Tech",
        "MKBHD",
        "Cleo Abram",
        "escenario xr",
        "pared de video 8k",
        "producción virtual",
        "Tecnología alucinante"
    ],
    "views": 3659211,
    "likes": 137643,
    "comments_count": 4191,
    "description": "Cleo's video:   Thanks Eight Sleep for sponsoring DopeTech! Get $300 off the Pod Cover with code MKBHD until Cyber Monday at   Nothing Phone 2   Zerospace at    MKBHD Merch:   Tech I'm using right now:   Playlist of MKBHD Intro music:   Phone2 provided by Nothing for preview Pod Cover provided by EightSleep ~     0:00 Virtual Production XR Stage 7:47 EightSleep Water Cooled Bed 12:50 Nothing Phone 2 (Exclusive)",
    "description_links": [
        "https://youtu.be/u7pu1cQBqtQ",
        "https://www.eightsleep.com/mkbhd/",
        "https://geni.us/YSt2be",
        "https://www.zerospace.co/",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "- Hey, what's up? MKBHD here. Welcome back to \"Dope Tech.\" We already know tech and production value is already some of the most fun stuff we do here, and I remember one of my favorite episodes of this we ever did was playing with the cinema robots in Portland and by the end thinking, this is crazy, but I think we might have to get one of these things. And I have a sneaky feeling that might be happening again on this shoot, because, well, this isn't my normal studio, as you may have thought. It's gonna get interesting. (dramatic music) (music relaxes) All right, welcome back to another episode of \"Dope Tech.\" I've got three really interesting things I wanna show you guys for this one. The first one, as you could probably already tell, is a piece of video production tech. I get unnecessarily excited about the bleeding edge of production, video stuff. But this, this is a whole different kind of production. This would be what's referred to as virtual production. So let's rewind for a second. I'm gonna oversimplify, but I think there's basically three different types, three different levels of production. Level one being everything is practical. Everything is real, it's exactly how you see it. The background, everything you see in this frame, a YouTube video for example, might be totally practical. That's level one. Level two is where some of the things you're seeing in the video are virtual. Maybe it's a blue screen, a green screen, maybe it's a virtual animal or some magical video animation or some motion graphics or things like that. But then number three, the top level, would be fully virtual, completely unreal, as I would say. Think like \"The Lion King\" or \"Avatar.\" So I recently got to visit a studio space in Brooklyn, New York called ZeroSpace that has something called an xR Stage. And this thing is somewhere right on the border, blurring the line between level two and level three. It's kind of real, but technically not real. So there are a whole bunch of shows and things you probably watch right now, \"The Mandalorian\" being probably the most famous among them, that use this version of virtual production. So I mentioned the green screens or blue screens earlier. These are obviously cool, because in the edit, you can replace anything that's the color green with whatever you want, maybe a new background or environment. And then if the actors are good enough, they can act like that environment is really around them. But this is next level. So this is the xR Stage. What you're looking at is a 50-plus foot 8K video wall, very expensive, but absolutely loaded with tech when you point cameras at them, and the advantages are very real. So number one, the actors or anyone in front of the screen can actually have an easier time interacting with their environment because they can actually see it instead of imagining, you know, a totally different environment when there's just like a bunch of green and some trackers. Then number two, the camera's position in space is actually tracked with this little piece here from RedSpy on top of the camera, and that information is relayed in real time back to the display, so the background actually moves when the camera moves. Now, this is huge. So if you build a volumetric environment, a 3D environment in something like Unreal Engine, the camera movement maintains this parallax effect and looks super realistic, like you're actually in a new space, unlike what I did in the intro which was just sort of like a taste of what it's capable of with a flat image. So then number three, and this is actually a huge one if you're an editor, there's no green spill. Like if you've ever tried to edit a green screen video, you already know it takes a lot of talent and editing to fully remove the background green, and even still there's occasional green light spilling onto fabric and skin and like glass and reflections and things like that, the last 2% of green. But with the video wall, there is no green spill. Well, actually, there is spill, but it isn't green. It's just light that perfectly matches your environment. There's actually all kinds of extra lights and things like that around the set as well, even a ceiling display to make this happen. So all of the lights and all of the colors of light hitting the person in the environment will look just exactly like they're supposed to as if they were actually in that space. So all of that is awesome, but the most impressive thing that I learned while I was there, and this really blew my mind, is you already know you can have a camera and then a person and then a background video wall, and then as the camera's moving around the parallax effect matches to show what the camera should see in real time. But this setup can actually do more than one camera at the same time. And if you're thinking, wait a second, how can two different cameras, how can that background moving effect work with two different camera angles at the same time? Won't one of them always be wrong? Or what happens if they overlap? And this is where it gets crazy. So this giant 8K video wall is refreshing at 120 frames per second. And so as there are two different cameras pointed at it, each camera is shooting 60 fps, but they're synced up so that they're actually each shooting alternating frames. I'm gonna say that again. Each camera is shooting 60 fps, but they're not shooting the same 60 fps. So it's almost as if like one blinks while the other shoots a frame and then the other blinks while the other shoots a frame, and they go back and forth. And so both cameras can be pointed at the same wall at the same time and see completely different things. So that solves the problem for two different video cameras both motion tracking correctly at the same time. Matter of fact, this particular display that ZeroSpace has can go up to 180 frames per second, which can accommodate six different motion-tracked cameras all shooting 30 fps, the correct frame rate, all at the same time and all seeing six different things! So I got to explore the space with fellow creator Cleo Abram, and she's put together an awesome video on her channel, Huge If True. It really blew our minds that this worked so well and that, you know, even to our natural, our naked eye, like, things could kind of blend and you can kind of see that two things are happening at once, but absolutely nothing that one camera sees bleeds into what the other camera sees. We literally had them light up the display behind us and it showed up as a perfectly blue blue screen on one camera and a perfectly green green screen to a different camera at the same time. And it just showed up as like kind of bluish, greenish to our eyes. So seeing this, then all the gears start turning about all the ways you could use this. I just imagine you have, you know, the crazy desert background of \"The Mandalorian,\" but the lines for the actors to read are on the wall but the cameras can't see them, or tracking points, or just all kinds of... It's just so many things you can do with it! It really got me thinking of if there's a way that we could use some parts of this in our own space. Obviously we build, these are real sets, they're not virtual sets, but I just, you know, I want to think about ways that maybe I could do something like this in our own space. Anyway, do yourself a favor and watch Cleo's video, which is also going live today. We got even way more into the details and some real-world examples of the xR Stage, plus a bunch of other interesting examples of virtual production techniques, complete with animations and more mind-blowing video facts. Literally as soon as you finish this video, it'll be the first link below the like button. Click that, watch hers. It's so worth it. And shout out again to ZeroSpace for letting us explore. Again, I'm gonna probably be back in touch with you guys. I'm gonna try to figure out a way to make that happen here somehow, some way. Okay, next one, hard pivot to a piece of tech that I've been using actually for a while. It's a piece of home tech, that's why I'm home for this one, and sleeping tech. Actually, when I was first told about the existence of this piece of tech, I was kind of surprised about it, but then I had a lot of questions. And so when Eight Sleep reached out and wanted to sponsor this video and they had all the answers, well, I was very interested. So you might have heard of Eight Sleep, they're kind of blowing up recently. But basically the main thing they make is a temperature-controlled bed. Actually it's a topper. So what it does is it wraps around your current mattress. It's called a Pod Cover. And the main feature, the idea is it completely controls the temperature of the surface of your bed. So it can be nice and crisp and cool when you first climb into bed and then nice and warm in the morning and make it easier to get out of bed, which is pretty awesome. I feel like there's two types of people, people that fall asleep instantly in like five minutes, and then people who think it's like a superpower to be able to fall asleep instantly, and that's me. I'm in the second group for sure. I've historically took at least half an hour to fall asleep anytime. But science shows pretty definitively, you've probably heard this before, that cool temperatures are pretty ideal for falling asleep quickly and then staying asleep and being well rested. Basically that temperature is one of the absolute top factors for quality of sleep. So the Eight Sleep, basically what it is it's this box next to the bed which has a bunch of stuff in it, a compressor, a reservoir, and a whole computer, it barely makes a whisper of noise, and that connects to the bed via tubes. And then the whole top of this bed, this cover is lined with these capillaries through the whole thing, these veins for either the warm or cooled water to flow through. And importantly, there's two halves. So if you sleep at a different temperature from your partner, which let's be honest, I feel like everyone says they do, then you can have each side of the bed be a different temperature. And then the piece that brings it all together is this app on the phone that lets you basically turn a dial to bring it between minus 10 and 10. Those are the levels of temperature, and that signifies basically 55 degrees Fahrenheit all the way at the bottom, which is pretty chill, all the way up to 110 degrees Fahrenheit at plus 10, which is straight up hot. So I don't need nearly that much range, but it's nice to have. I go to sleep at minus four and I warm up to plus two. That's as warm as I really ever need it. But yeah, I guess now I can say my bed, this bed is literally water cooled, so that's pretty sick. So the thing is, once you've used it for I think about a week, basically it settles into a routine where it cools down before you get into bed and slowly adjusts temperature over the course of the night. They call it Autopilot I think. But there are different stages of sleep where it'll slowly warm up overnight until it's at the temperature that you wanna wake up at. But then on top of that, there's a host of other features that are in the Eight Sleep membership, which is a monthly subscription, which I don't love, but it actually has a bunch of really useful features. So the first is Autopilot, which I talked about, but then the second, there are a bunch of these sleep tracking features. I had typically worn the Apple Watch to sleep for the past couple months, and it's on your wrist and it can read a bunch of things about you from your wrist. But clearly the best thing to measure your sleep would be the thing you sleep on, so the mattress itself. So it can tell when you get into bed of course, when you get up, and it graphs out when you're in these different stages of sleep through the night. It even somehow measures your heart rate and breathing rate if you want it to. And then it does a good job in the UI of highlighting with like little green or red markers when things are going well and when things are a little bit off. So you can see here on this terrible night of sleep I had that there are certain things clearly that I didn't do well. Like I went to sleep late despite waking up at a normal time, and I fell asleep quickly, but I took a while to get up. So the next night of sleep you can see was much better. Whole bunch of green here, basically flawless. It also has a vibration alarm. It will literally lightly vibrate just your side of the bed to wake you up silently, which is pretty sick. And it also gets continuous software updates over time. Honestly, this thing has been pretty awesome for me personally over the past couple of weeks that I've had it. Like I said, I've had it for a while. The one thing that I feel like is pretty definitive proof, for me anyway, that it's working or helping me sleep better, the Apple Watch likes to tell me when I have a low heart rate. When I go below 40 beats per minute for a long time, it gives me a low heart rate notification. But that's actually potentially a good thing if you're recovering well. And the first week or two after I started sleeping well with the cooled mattress, I would wake up with like, 10 to 15 low heart rate notifications, which meant that my heart rate was getting lower and I was recovering better and sleeping better, which is pretty cool. So in an age where humans are basically sleeping worse than ever before with all the tech around us, all the screens that are around us every night, it's pretty cool to have a piece of tech that actually helps us sleep better. At least it helps me anyway. You can try it too if you want to. You can get $200 off by using the code MKBHD on their site. I definitely think this qualifies as Dope Tech. Okay, last but not least, how about a little bit of an exclusive. This is your first look at the Nothing Phone 2, which looks a lot like the Nothing Phone 1. But you guys have heard a lot of the hype, you've seen some of the teasers, so let me show you what I am allowed to show you of what's new. So this is the Phone 1 here with the glyphs and the lights on the back, and this is the Phone 2. Slightly tweaked design. Definitely nothing dramatic at first glance here, since they're trying to establish their visual design as a young company. You know, you can't go dramatically changing it every time. But same shapes, slightly lighter gray, slightly more rounded glass actually on the back. But we'll get to all that in the full review video of this phone. For now, in this exclusive, I can show you what's actually new with the Glyph interface, the actual lights on the back. So first of all, Nothing Phone 1 had five strips of white LEDs with this pattern. With this new one, the shapes are in the same place, but there are some tweaks. You can see the arc around the camera is split into two strips, and the big one in the middle is now separated out into six pieces. These are all still white LEDs, no color or RGB or anything crazy. But the main improvement is actually just that there are more addressable LED zones inside of each of the strips, which is kind of fun. So you probably remember you could already use the bottom exclamation mark as a charging progress indicator. That does still work. So before the entire back of the phone had a total of 12 different LED lighting zones controllable by the software. This new one has a total of 33 across the back, and just this strip up here at the top gets 16 to itself. So it's much more precise and granular, and so they've designed some features actually around using that as a progress indicator. So there's a volume indicator now. So when you have media playing, it literally just shows your volume level, and as you move it up and down you can see that light go up and down with it. There's a Glyph Timer built in. So you can set a timer to a predetermined length of time using the UI, then flip the phone over to start the timer. And you can see it slowly rolls down through the LEDs to count down and give you a visual indicator of when the timer will be over. I kind of like this one for working. Those of you who use the Pomodoro Technique will probably find this useful. And there's also plans for this to be addressable by third parties. So you can imagine, so Uber and Zomato are the only two that are signed up right now, but kind of the same way Apple had to get developers on board with their Live Activities in iOS, same idea. You can imagine waiting for an Uber and turning the phone down and sort of seeing the progress of when the car gets closer and closer until it arrives. Things like that. Ideally they can get more on board for things that just make sense for progress bar stuff. Now, you might remember, last time I was specifically asking for more customization stuff so I could tell what app I was getting a notification from without flipping the phone over. This is still all white LEDs, so there's no colors or anything like that, but there is one new feature called Essential Notifications, where basically if you have a certain app that's important to you that you get notifications from, it'll stay lit up in this corner strip, and this stays lit until that notification is addressed. So it's not fully customizable, like I can't assign a a different app to each of the different lighting zones, but for at least this one app you'll always know when you've got a notification from it. And then they also added this neat little Glyph Composer. So if you wanna literally design your own ringtone, you can go full DJ mode. (phone beeping) So that is your first look at the Glyph update on the back of the new Nothing Phone 2. Still sort of like on the borderline between gimmick and useful for a lot of people, but it is at least a little bit more customizable. And you'll have to get subscribed to see all the rest of the new stuff with this phone, so that you'll know what I've been finding in my testing. That's coming up. The sub button is below, of course. But that's been it. Thanks for watching \"Dope Tech.\" Catch you guys in the next one. Peace. (groovy upbeat music)",
    "transcript_keywords": [
        "things",
        "Sleep",
        "camera",
        "video",
        "green",
        "phone",
        "time",
        "Tech",
        "thing",
        "bed",
        "Dope Tech",
        "back",
        "cameras",
        "kind",
        "pretty",
        "basically",
        "Level",
        "production",
        "video wall",
        "environment"
    ],
    "transcript_entity_values": [
        "Autopilot",
        "Cleo Abram",
        "between minus 10 and 10",
        "about a week",
        "the Phone 1",
        "YouTube",
        "Brooklyn",
        "today",
        "the Nothing Phone 2",
        "three",
        "Apple",
        "30",
        "10 to 15",
        "55 degrees Fahrenheit",
        "one",
        "40",
        "number three",
        "110 degrees Fahrenheit",
        "monthly",
        "up to plus two",
        "ZeroSpace",
        "third",
        "Essential Notifications",
        "Live Activities in iOS",
        "8",
        "200",
        "50-plus",
        "like five minutes",
        "12",
        "more than one",
        "UI",
        "Cleo",
        "Glyph",
        "the Phone 2",
        "Zomato",
        "the next night",
        "five",
        "The Lion King",
        "180",
        "minus four",
        "first",
        "The Mandalorian",
        "Portland",
        "Eight Sleep",
        "the Nothing Phone 1",
        "Glyph",
        "the night",
        "RGB",
        "2%",
        "33",
        "second",
        "Unreal Engine",
        "a second",
        "overnight",
        "number two",
        "60",
        "six",
        "the Apple Watch",
        "at least half an hour",
        "Eight",
        "the first week",
        "two",
        "16",
        "the past couple of weeks",
        "only two",
        "the past couple months",
        "Dope Tech",
        "120",
        "Nothing Phone 2",
        "New York"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "EVENT",
        "GPE",
        "GPE",
        "DATE",
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "EVENT",
        "PERSON",
        "TIME",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "WORK_OF_ART",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "TIME",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "TIME",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "PRODUCT",
        "GPE"
    ]
}