{
    "id": "RmUR2XSXu2U",
    "title": "Yay, \"new\" processors...",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2020-05-02T01:22:03Z",
    "video_url": "https://www.youtube.com/watch?v=RmUR2XSXu2U",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "Intel",
        "10th gen",
        "Intel 10th gen",
        "desktop",
        "Comet Lake",
        "Intel Core i9 10900",
        "core",
        "hyperthreading",
        "Core i3",
        "Core i5",
        "Core i7",
        "14nm",
        "SKylake",
        "performance",
        "review",
        "benchmarks",
        "Intel vs. Ryzen"
    ],
    "views": 476676,
    "likes": 23412,
    "comments_count": 827,
    "description": "Get iFixit's NEW Mahi Driver Kit today at   GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   Buy Intel 10th Gen CPUs On Amazon (PAID LINK):  On Newegg (PAID LINK):   NEWS SOURCES  10TH GEN IS IT THO? Intel 10th gen processors   Why new motherboards?  Forwards-compatible with Rocket Lake, including PCIe 4.0    AN E3 BY ANY OTHER NAME Geoff Keighleys Summer Game Fest     SPACESHIP!! NASA awards moon lander contracts  NASA licensing ventilator design for free   QUICK BITS  WONT BE BACK FOR A FORTNIGHTAT LEAST Epic Games cancels Fortnite World Cup  Fortnite is the future of the internet   VAN-GUARD YOUR SYSTEM At least you can disable it while youre not playing   NOOOOOO!!! Valve ends support for SteamVR on Mac  delays Dota 2 The International    I SEE RIGHT THROUGH YOU China is checking everyones temperatures with smart glasses now   UH, IM GOOD ATUH LINE Looking for a job? Let a LinkedIn AI coach you on interview skills  ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.ifixit.com/techlinked",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://geni.us/F6V9gM",
        "https://geni.us/uMrvP",
        "https://linustechtips.com/main/topic/1186620-intel-10th-gen-cpus-revealed-w-asus-z490-motherboards/",
        "https://hexus.net/tech/news/cpu/142075-intel-releases-10th-gen-core-chips-mainstream-desktop/",
        "https://www.anandtech.com/show/15723/the-intel-z490-motherboard-overview",
        "https://videocardz.com/newz/gigabyte-intel-z490-motherboards-will-support-11th-gen-rocket-lake-s",
        "https://youtu.be/oFa_SNzlqH4",
        "https://www.gamesindustry.biz/articles/2020-05-01-geoff-keighleys-summer-game-fest-is-his-latest-push-to-rally-the-industry",
        "https://www.youtube.com/watch?v=igp5BHoYZYE",
        "https://twitter.com/geoffkeighley/status/1256237433861083140",
        "https://arstechnica.com/science/2020/04/nasa-awards-lunar-lander-contracts-to-blue-origin-dynetics-and-starship/",
        "https://www.engadget.com/nasa-jpl-ventilator-fda-approval-221346849.html",
        "https://www.pcgamer.com/epic-cancels-plans-for-a-fortnite-world-cup-in-2020/",
        "https://www.theverge.com/2020/4/30/21242668/fortnite-party-royale-social-space-metaverse-travis-scott",
        "https://www.kitguru.net/gaming/matthew-wilson/riots-vanguard-anti-cheat-can-now-be-disabled-from-the-windows-system-tray/",
        "https://appleinsider.com/articles/20/05/01/valve-abandons-the-macos-version-of-steamvrValve",
        "https://www.kitguru.net/gaming/matthew-wilson/dota-2-the-international-tournament-delayed/",
        "http://blog.dota2.com/2020/04/the-international-2/",
        "https://www.reuters.com/article/us-health-coronavirus-china-detection-gl/chinese-startup-rokid-sees-opportunity-with-covid-fighting-smart-glasses-idUSKBN22D4TQ",
        "https://gizmodo.com/linkedin-has-an-ai-to-help-with-your-interview-game-1843190264",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "Hello. My name is Jamestiffer. Thats not true, but what is true is everything I'm about to say next within reason. Shall we begin later? [Riley in background] Sounds good! Intel has launched its 10th Gen Comet Lake desktop processors, although, as most of the relevant tech press has pointed out already, Calling these 10th Gen might be a bit of a stretch, as theyre essentially modified versions of the 9th Gen lineup. Those modifications include the addition of hyper-threading to every processor in the Core series and, like, 3 different types of boost clock I mean you got Turbo Boost, but then you've got Turbo Boost Max 3.0, and Thermal Velocity Boost Single / All Core Turbo. Ah. Its likeits like I just spent a 5.3Ghz there myself. Despite the seemingly light modifications, these processors are launching alongside the new Z490 Chipset, Which brings support for Wi-Fi 6, 2.5G Ethernet, and a new LGA 1200 socket. [Riley, in unenthusiastic voice] Yay. While theres apparently no support yet for PCIe 4.0, which AMD did include in the Ryzen 3000 lineup, some are speculating that Z490 supports the feature and it will be forward compatible with Intels 11th Gen Rocket Lake CPUs. And by speculating, I mean that this guy from Gigabyte straight up said it in a livestream, so... [livestream audio] Will Z490 motherboards support 11th Gen Intel Rocket Lake? Uhm... Yes. [laughter] [in background] Woopsies! But, cool? Yeah! Geoff Keighley is taking a swing at replacing the cancelled E3 expo with a 4-month-long online event what?called Summer Game Fest. Keighley calls it a global festival uhcomposed of digital showcases, game trailers, launches, in-game events, and free game demos. A long list of game companies including 2K, Activision, Blizzard, EA, Microsoft, Sony, basically all of them are confirmed to be showing something or another as part of the festival between June and August, with a big finale taking place at Gamescon [Gamescom]Ghhathat's how I call it!, on August 24th Keighley says that if summer Games Fest is successful, it could come back in 2021 or just happen year round orthen, is it really a festival, or just a way of life. [in background] The new normal! [chuckle] [in background] Games all the time! Whoo! Yeah, I'm a hedonist now! And NASA has awarded three contracts to develop lunar landing systems to space companies Dynetics, Blue Origin, andof courseSpacex [Oh yeah sound effect] The three companies have until 2024 to build systems that could allow humans, like me, to travel to the Moon, land there, and start building permanent human civilizations, you know, by 2028. Im going to be living there for 10 years by 2028 [in background] Bring my dog! Humans like me! I'm going to space! While Dynetics and the Jeff Bezos-owned Blue Origin are working on multi-phase systems, with ascent and descent components, SpaceXs proposal involves its own solitary Starship A graphic shows Starship sitting there on the moon, with the the panel open in the side, out of which astronauts, who are jovial, descend on what looks like a window cleaning platform I mean, hey. Sounds like a good plan if it works, and if Elon hasn't gotten coronavirus by then. He seemed wilder on Twitter than usual as of late. [in background] Free America now! He's just sweating, his hair stuck to his forehead [laughter in background] To the Moon! And then Mars! Now, its time for the Quick Bits, brought to you by iFixit. I fix it! You fix it! We all scream for Fixit! [chuckle] iFixits Mahi Driver Kit comes up loaded with a hefty 1/4 aluminum driver with a magnetic bit socket, a knurled handle for a no-slip textured grip, and a silky smooth swivel top. There's also 48, and a 1/4 steel driver bits that are build to survive the toughest and torque-iest fasteners in any home or shop project. Every bit is held in place by a laser-cut foam case with a magnetized lid that doubles as a sorting tray, so it's perfect for those who are prone to dropping crap all over the place, you know? Visit iFixit.com/techlinked and pick it up todaythat's the new Mahi Driver Kit. Get it now. Or we're friends-off [in background] Oh no! Do you want to come to my birthday party [in background] No. or not? Dah! I love those darn Quick Bits, you know? [laughter in background] Get me all fan-sassy/fan-sa-cy! [in background] Whoo-hoo! Epic Games has officially canceled the Fortnite World Cup. What an epic disappointment. Apparently, even an online version of the event would have been impractical to execute. But save your tears, gamers cause you can still rock out with your skins out in Party Royale, the games new social media space. Its just social space. Its aits a medium. And Fortnites Ready Player One vibes increase on the daily. Chillin with the squad just continues to be more lit, and straight fire [laughter in background] But the game that has put a fire under Fortnites feet, Valorant, is getting a welcome update. Players can now disable the games anti-cheat, called Vanguard, in the Windows System Tray Vanguard still runs at the kernel level, and youll have to re-enable it to play the game, but at least you can have a false sense of security when youre just chilling with the game off on Tiktok [in background] Really? Owned by Tencent Valve has ended support for SteamVR on macOS. Noo! Noooo! [in background] Noooo! [in background] Sarcastic! Hey, look. If you're a mac VR player, I'm sorry, but it kind of makes sense, you know. There's very few of you. Valve also delayed Dota 2, the International, to next year, so at least you know you're not the only one getting the short end of the stick. All the ends are short, you know? You know what you should do? Come tocome to PC. We have so much VR, its crazy. The longest sticks. China is using smart glasses to check citizens temperatures as part of COVID-19 screening in parks, schools, and public spaces in general. Normally, Id find mesures like this a little intrusive, but were in a pandemic and you know? And its justified means. [in background] Authoritarianism. Nice one, Chinese government. Feels weird. And the job market kind of sucks right now, obviously, but if youve managed to get an interview, LinkedIns new AI can coach you through it. It will give you suggested responses for recorded or written [repeat] It will give you suggested responses for a recorded or written portion of your interview, so you can prove you know how to ask a robot for help. [Riley, with robotic voice in background] Do that one more time, but with feeling. [with robotic voice] Where do you see yourself in five years? [with different robotic voice] Under my boot! And thats it for this video, guys. Come back on Monday for more tech news, hopefully delivered by... [with robotic voice] a human. [in background] Wait... are you [video cuts off]",
    "transcript_keywords": [
        "Turbo Boost Max",
        "Gen Rocket Lake",
        "Gen Comet Lake",
        "Turbo Boost",
        "Gen Intel Rocket",
        "Game",
        "Velocity Boost Single",
        "Thermal Velocity Boost",
        "Intel Rocket Lake",
        "Gen",
        "Mahi Driver Kit",
        "Rocket Lake",
        "Games",
        "boost",
        "Summer Game Fest",
        "Core Turbo",
        "Turbo",
        "Gen Intel",
        "Gen Rocket",
        "Quick Bits"
    ],
    "transcript_entity_values": [
        "3",
        "SpaceXs",
        "Jamestiffer",
        "Summer Game Fest",
        "Tiktok",
        "Gamescon",
        "Mahi Driver Kit",
        "10th",
        "Gen Comet Lake",
        "Intel",
        "Jeff Bezos-",
        "three",
        "G Ethernet",
        "between June and August",
        "2024",
        "Turbo Boost",
        "Elon",
        "Riley",
        "One",
        "Noo",
        "one",
        "9th",
        "iFixit",
        "Geoff Keighley",
        "2028",
        "2021",
        "3000",
        "EA",
        "Whoo-hoo",
        "Dynetics",
        "Activision",
        "Wi-Fi 6",
        "AI",
        "Tencent Valve",
        "Blue Origin",
        "digital",
        "next year",
        "Twitter",
        "Party Royale",
        "Microsoft",
        "Valorant",
        "Chipset",
        "11th",
        "Keighley",
        "August 24th",
        "4-month-long",
        "daily",
        "China",
        "AMD",
        "the Fortnite World Cup",
        "COVID-19",
        "Sony",
        "Chinese",
        "2.5",
        "E3",
        "Monday",
        "48",
        "five years",
        "Gigabyte",
        "Mars",
        "Vanguard",
        "Intels 11th Gen Rocket Lake",
        "Moon",
        "Fortnites",
        "LGA 1200",
        "the Windows System Tray Vanguard",
        "NASA",
        "Blizzard",
        "Moon",
        "Fixit",
        "1/4",
        "10 years",
        "2",
        "LinkedIns",
        "the Quick Bits",
        "Z490"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PERSON",
        "EVENT",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "EVENT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "GPE",
        "ORG",
        "EVENT",
        "ORG",
        "ORG",
        "NORP",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "LOC",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL"
    ]
}