{
    "id": "RpBZBw6Xb2c",
    "title": "Will A Microsoft Refurb Xbox Series X Give You Botulism?",
    "channel": "Dawid Does Tech Stuff",
    "channel_id": "UCvcRA2Hva1lULVf4GCouH8w",
    "subscriber_count": 688000,
    "upload_date": "2022-04-13T17:00:25Z",
    "video_url": "https://www.youtube.com/watch?v=RpBZBw6Xb2c",
    "category": "Science & Technology",
    "tags": [
        "dawid",
        "dawid does tech stuff",
        "PC",
        "gaming",
        "intel",
        "AMD",
        "Corsair",
        "Gaming",
        "Game",
        "Computer",
        "Gaming PC",
        "David Does Tech Stuff",
        "DDTS",
        "Tech",
        "Stuff",
        "xbox",
        "console",
        "refurbished xbox",
        "microsoft refurbish"
    ],
    "views": 278744,
    "likes": 11014,
    "comments_count": 726,
    "description": "*Video Sponsor* Get the awesome Be quiet! 500DX case here (Affiliate link):   I bought an official Microsoft refurbished Xbox series X to see if it's worth the high cost.  Link to the refurb series x bundle (Also on Canadian store):   Get some AWESOME Dawid merch here:   -Here is a link to my Patreon page, it would be awesome if you check it out:   -Follow me on whichever Social media you don't hate-  Discord:  Twitch:  Twitch shorts channel:  YouTube:",
    "description_links": [
        "https://amzn.to/37LgLLO",
        "https://www.microsoft.com/en-us/store/b/xboxconsoles?icid=XboxCat_QL1_Consoles",
        "https://dawiddoesmerch.com",
        "https://www.patreon.com/DawidDoesTechStuff",
        "https://discord.gg/b34uVGaYVB",
        "https://www.twitch.tv/dawiddoestechstuff",
        "https://www.youtube.com/channel/UCAiMJaOrvTik7XyJethz-ig",
        "http://www.youtube.com/c/dawiddoestechstuff"
    ],
    "transcript": "For today's video, I bought an official Microsoft refurbished Xbox Series X. Which is the worst named console ever. They should have called it something cool like the Thunder Tornado. Which actually would work quite well, because then you could call the little one the Thunder Ghost. But anyway, what we're gonna do in today's video is, I'm gonna unbox the console. I'm gonna invade its personal space and then spend some time gaming on it. So that, by the end of the video, I can let you know if this refurb will give you botulism. But before we get into that, it's time for a word from today's video sponsor! Today's video is sponsored by be quiet! and their PureBase 500DX case. Now the PureBase 500DX does check a lot of my boxes. It is easy to build in. It looks great. It comes with 340 millimeter be quiet! fans, and in conjunction with a bunch of other be quiet! parts, it led to one of the quietest gaming systems I've built in a very long time. So if you're in the market for a new case for your gaming system, treat yourself to a be quiet! PureBase 500DX using the link in my video description below! Thank you be quiet! for sponsoring today's video. Now I'm assuming that this first littler box is the controller, so let's open it up and have a look. Oh yes we have our Carbon Black Xbox controller. Now instead, you can get the Elite controller if you want some more controller EP, but I went with this just to keep the price down. In here we actually just have what looks like an Xbox box and there we have our refurbished Series X X series Xbox X Series X - uh - which is exciting. I'm curious to see what kind of condition it's gonna be in. Interestingly from the box, it does seem to come with a controller, So it seems like they make you buy a second one. I didn't realize that that's how this was gonna work. It's nice and protected. We have our our X Series X X over here. I think this joke is going to become very labored very quickly. I feel like it immediately has been labored. We've got an HDMI cable which says Ultra high speed on it and I think this actually can handle 4K 120. And then we do have a controller that comes with the console so they are forcing you to buy a second one. For this refurb bundle I quite like the Xbox controller. The only thing that really bothers me about it is that it doesn't come with a rechargeable battery pack. That's really stupid. And then finally we have our X Series Xbox Series X. So let's take that out. Oh it's quite heavy. Oh cool. There is the top, with what looks like a very industrial fan under there. That is a dope looking fan. Wow it is a fingerprint magnet. Now on first impressions, this refurbished Thunder Tornado is in pretty good condition. Although there is some slight discoloration on the plastics around buttons and stuff like that but it's not too bad. I think if they were to sell this in Japan they would refer to it as \"having a slight feeling of use\". Another good sign is the fact that there are no obvious scratches around any of the ports on the back. Which means this was a pretty well looked after console. Anyway, with that let's dig a bit deeper. Now before we tear the console down, there's just one quick note i need to make. I've been using this for the last week and while transporting it between the office and my home I was carrying it in a bag that was hanging a little bit lower than I realized and I may have knocked it against the curb slightly... Um, so there is some cosmetic damage on the console which is very much my fault and not Microsoft's. Okay! So with that, let's do a quick tear-down of the model X because I can't not break everything I buy and have a closer look at the insides. Now if you look at the sticker it does actually show you the service date. There we go. That's one down. Pry it out, oh okay we are safe. So that's been removed and then here we have the inside of our... uh... of our terribly named Xbox. Now in having a look here, it looks pretty good. You can see there's a little bit of dust buildup over there. Now I've only been using the console for about a week so I don't know how much of that is gonna be due to my use but yeah we'll have a closer look in there and then we'll see how clean it is. Other than that though, it does look like it's in very good condition in here. Wow, everything is really really tightened down in here. Oh there's a little master chief helmet on the fan which is some good fan service. Oh yeah, there we go, that came out very nicely and then here we've got a pretty serious looking fan. Which as you can see there is basically no resistance in that motor, that's awesome! And in practice it has been very quiet. In terms of dust it seems pretty clean. All of the connectors do seem to be in very good condition so that's a nice sign. There we go, and it's off! Oh, there are some ribbon cables. Though, that is, we all know ribbon cables are my favorite thing in the universe. and I am pretty sure I just broke that connector... I really hope it's something pointless. It seems like the actual pins in the connector or on the top plastic bit that i just broke. Yeah that's not ideal. Okay that one opens much more easily... kind of lift that out. Oh no! That is in fact the ribbon cable that connects the entire front I.O. to the motherboard yeah so I am really hoping that this connector still works because otherwise I'm not going to be able to power it on anymore. Although none of that is Microsoft's fault. Well it's not the refurbisher's fault. That is a combination of ribbon cables being awful and me being stupid. So anyway, let's put the case aside on that very depressing note. So over here we have our power supply with this kind of rubber gasket around it to reduce vibration. We have our Blu-ray player on this side and then if we flip the whole assembly around, we have a massive heat sink, which I'd say there's still a little bit of dust. Again, all of this is in very good condition. It does look essentially like a new console inside. And then under here we have our south bridge which has clearly been recycled from an Xbox one. Although I am no expert, this is just a fine looking PCB to me. If you know more about the stuff than I do, let me know in the comment section down below what you think of of this bad boy! It does look pretty decent to me though and then under that we've got a pretty thick piece of aluminum. If I'm not mistaken i think that under here, this copper plate is actually a vapor chamber with the heatsink attached to it. Which is good. Vapor chambers are very effective at cooling. Oh hold on just a second, I think I may have skipped a step here, because the whole base just disassembled. Uh and then under here we have the back of the... just all of it... we have our SSD, which I wonder if that was what they had to replace because the actual, this little tin lid, did seem quite deformed. It did seem like they they had removed it before so I don't know, maybe they had to replace the storage for this Series X - uh - other than that though the thermal pads or thermal putty seems fine. That is an interesting solution. The kind of like really thin bit of metal that they like stick over it like that. I wonder what the thinking is behind that because it's actually the same here with this. I really do not like this thing because you have to kind of wedge things in between like mosfets and stuff and I just don't want to have to get a prying tool this close to like power delivery components. Yeah this is a stupid thing. That has actually worked really... there we go... finally that process really sucks. I do not like this little thin bastard at all! There's nothing really that makes you think that there's been some serious surgery that's gone into fixing this thing. Although what is clear was that this console was reassembled by the hulk because all the screws are so difficult to undo, ugh! Oh we should just be able to separate.. oh okay, that was more of a pop than a gentle separation but that's fine. Now this is an aluminum plate with some thermal putty on it, for what i'm assuming is more power delivery under here, and then this is the base of the the vapor chamber which as you can see has a bunch of thermal putty and then thermal paste for the APU. Now the thermal paste is actually surprisingly dry and I actually think that that may mean that when the hulk was refurbishing this thing, they didn't actually remove the the heatsink from the APU which is here. That is quite a beefcake APU we've got going there but again that thermal paste is very dry. I don't like that. Uh other than that though this is a a very sexy PCB, like I am at pretty much full mast at this point. Again, on this side like just look at that! Oh yeah! Just look at that! Nice! But I mean, again for a refurb, everything looks like it's in very good condition. Again aside from the the thermal paste it seems a little bit dry. We also have another master chief helmet on here so yeah i'd say good job hulk, uh you did a reasonable job refurbing this thing. Um so now comes the especially difficult part which is having an idiot like me try and reassemble this thing without it breaking. Although I am worried about that little connector and after being aroused by a PCB, I decided to reassemble the refurbished Thunder Tornado which I accomplished with only a couple slight snags. Oh I'm so stupid I forgot that plate and i'm gonna have to remove the little ashtray from hell thing. Oh I needed to screw that down. Come on! Oh... what is this screw? So aside from the very suspicious leftover screw, I think I have very professionally reassembled the terribly named Xbox. I've even covered up the little screw holes so that nobody would know that I opened it up. Uh, but the final test is gonna be if this thing still works after my little... uh... little ribbon cable catastrophe. So let's try and power it up... A few moments later... okay Um, Yay! Power buttons worked. Yay, it works. So after having my botulism free tear down of the Thunder Tornado, what was my week like gaming on it? Well it was really good. I only had a couple of small technical problems with it. The first one was almost every time I plugged a different display into it, the resolution would revert to 640 x 480 for some reason. Although it was really easily fixed. I just had to restart the console. And then the other problem that I had with it, was that Ori crashed like three times in a row. Uh but it never did that again so I don't know. All of this stuff could be pretty Xbox specific problems... Let me know in the comment section down below if you've had similar issues with your Xbox but other than that, it ran very well. Uh, my main problem with this official refurb though is that it basically costs the same as just buying a new one. It's barely any cheaper which means that there are only a couple of reasons why I think you'd get it. Either a new one isn't in stock, which is very plausible, or you just prefer buying refurbs. You know it's just kind of better saving a dumpster console, as opposed to having them make a new one for you. It's kind of like getting a used pound puppy as opposed to buying a new brand name puppy from like a puppy mill. You know the one is just kind of a bit better than the other one. So if you really, really want a Series X, this may be a great way to get one. Anyway with that, Thank- you very much for watching. If you enjoyed the video, like and subscribe to the channel for more videos like this one, and until the next one, bye!",
    "transcript_keywords": [
        "Series Xbox Series",
        "Xbox",
        "Xbox Series",
        "series Xbox",
        "Series",
        "today video",
        "Thunder Tornado",
        "refurbished Xbox Series",
        "good",
        "console",
        "video",
        "pretty",
        "thing",
        "good condition",
        "refurbished Thunder Tornado",
        "Xbox controller",
        "bit",
        "kind",
        "thermal",
        "Thunder"
    ],
    "transcript_entity_values": [
        "Microsoft",
        "first",
        "Xbox Series X. Which",
        "three",
        "SSD",
        "HDMI",
        "the Thunder Tornado",
        "Xbox X Series X",
        "480",
        "APU",
        "PureBase 500DX",
        "4",
        "340 millimeter",
        "Blu-ray",
        "Thunder Tornado",
        "this Series X - uh - other",
        "Today",
        "second",
        "I.O.",
        "today",
        "Thunder Tornado",
        "Japan",
        "Xbox",
        "the last week",
        "PCB",
        "Elite",
        "one",
        "Carbon Black Xbox",
        "A few moments later",
        "about a week",
        "PureBase 500DX",
        "640",
        "Ori",
        "the Thunder Ghost",
        "our X Series"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "EVENT",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "EVENT",
        "DATE",
        "ORDINAL",
        "ORG",
        "DATE",
        "EVENT",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "EVENT",
        "EVENT"
    ]
}