{
    "id": "RPiXf8JEE8M",
    "title": "The WORST Handheld",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-11-18T18:10:24Z",
    "video_url": "https://www.youtube.com/watch?v=RPiXf8JEE8M",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 310026,
    "likes": 7043,
    "comments_count": 785,
    "description": "Nintendo, PlayStation, and SEGA...who has the best handled? Twitter is DONE:  I Wasted $420.69 on Walmart Tech:  $20 MacBook:  Tech We REALLY Wish Came Back:  TikTok Made Me Buy It:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Hello and Welcome 0:18 Game Boy Advance SP 1:10 DSi 1:37 New 3DS XL 2:11 Sega Game Gear 2:33 Switch 3:33 3DS 4:04 Game Boy Color 4:35 Sega Nomad 5:05 Logitech G Cloud 5:13 Game Boy Advance 6:05 PS Vita 6:50 DS 7:42 Switch Lite 8:34 2DS 9:14 DSi XL 9:28 DS Lite 9:51 Switch OLED 10:28 Sony PSP 11:09 3DS XL 11:22 The PlayDate 11:45 New 2DS XL 12:13 PSP Go 12:45 nVidia Shield Portable 13:19 Game Boy Light 13:41 Game Boy Micro 14:45 Game Boy Pocket 15:07 Steam Deck 15:40 Game Boy",
    "description_links": [
        "https://youtu.be/7lhjgup4w54",
        "https://youtu.be/v5f_R8rtNnE",
        "https://youtu.be/MEhqzqD3MPU",
        "https://youtu.be/IF8QJEovEcY",
        "https://youtu.be/vUBtSnsWL_0",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- This gonna be a good video. (screaming) We're redoing this intro right now. - No we're not. No, we're not. Aaron, if you redo it, I'm firing you and putting you in the basement permanently. Which handheld is the best-Tier, S-Tier, F-tier. We're gonna go with it. (smacking sound) - No, you gotta get the tape. What is that? - GameBoy Advance SP! (victorious chime) - Moving on. - No, no, no, no. - What more do you need to say about the world's greatest console. - In 2003, AA batteries were so much more prevalent than the proprietary power cable that came with the SP that you had to recharge. - Matt, let me just take a guess, you weren't paying for your own batteries in 2003, were you? - I was working at Radio Shack at the time, and I had a big old discount. - [Austin] The GameBoy Advance was the pinnacle, in my opinion, of Nintendo Handheld. You also had a folded clamshell design. Can I put it to S plus tier, right now? You're upsetting. - No! Oh my god. - If I have one veto in this entire thing, I'm gonna burn on the very first item. This stays at S-Tier. - Fine, fine, fine. - I love the GameBoy Advanced SP. - You wanna use your one veto of the, of the episode? I'll give it to you. You know what, you're not gonna be able to veto. (smacking sounds) - You gotta get- Just pick them up. - It's like suction-cupping to the table. - We have little bits of tape on all these, so that'll stick on the board. - DSI! - Do you want a fun fact? - Yeah. - I spent my very first YouTube paycheck on a DSI and Pokemon HeartGold. - I'm gonna put it in B. - B what? I'm actually gonna say C. I actually think today, if I'm gonna play DS game, I'd rather play it on a DS Lite. I like the size of it. It was an upgrade, but it wasn't a true upgrade, in my opinion. - All right. - Wait, can I pick one? - Yeah, you go ahead, you go ahead and pick one. - Just tell me when to stop. - Stop. (smacking sound) - The New 3DS XL. Okay, so this is the last of the non-Switch handhelds right, so. It had an extra joystick. - It was fine. It was, but like, it had more power, but like, what were you doing with that. power? - Not a lot. Honestly, I mean, I think that the New 3DS, unlike the DSI, which actually removed features, the New 3DS was an improvement. The XL was a little big, I preferred the regular size. But I'm gonna just say, C as well? This feels like a very DSI-ish. - Yeah. Yeah. Yeah. - Can you please pick a non-Nintendo console? (smacking sound) - The Sega Game Gear. Look, man, this was the first handheld console with color. - The game gear was cool, but I feel like I lost my nerd card. So you- Wow! A? - [Kenzie] And you could also play Sega Master System cartridges with an adapter. - Yes. All right, I'm gonna pick one right now. I'm gonna go... Kenzie, tell me when to stop. [Kenzie] Stop. (smacking sound) - The Switch! - The Switch! - The Switch has to be ranked pretty highly, right? Not only is this on track to be one of the most popular consoles of all time, Nintendo is still selling them like absolute hotcakes, five years after they're release. - Yeah. - So it's not a super powerful console, but the development tools are terrific, and Nintendo have done a good job of supporting it. Remind you, the Switch doesn't have the performance to play like a PS4, Xbox One game, in the same settings, but most games can be ported to the Switch in a pretty important way. And of course, there are tons of Pokemon games, Zelda games, all the classic Nintendo titles that work really well on the Switch. This has gotta be A-tier for me. - I think it's B, because I think, what's ahead of it? I don't think there's a Switch that's S-tier. - You think that that like the OLED or the Lite is better than the... - I do. I definitely do. - You think B? Wow. Matt, That's, that's harsh. It's harsh. - It's, it's not meant to be harsh, it's meant to be fair. If I had it my way, all consoles would be handheld, so. - And cloud-based too, apparently. - Pick another. - Oh pick another one? - I don't wanna, I don't wanna pick one. (smacking sound) (rattling sounds) We need better tape. Apparently. - The 3DS! - The 3DS! - Original. - [Matt] The 3D was more gimmick than anything. I personally don't know anyone who really played with it. They usually just turned it off. - It also wasn't that good, right, like so... - Yeah it- - Almost every other version of the 3DS is better than the launch one, in my opinion. So if we're gonna take the regular Switch is B, and the potential, like, OLEDs. I mean, this was expensive and they had to cut the price, but they did kind of bring it up. - That's my thoughts. It was so expensive. It was bad hardware and it was expensive. - All right. - So I'm gonna do one now. (smacking sound) The GameBoy Color. - Oh, that's gonna be high. - Oh yeah. Nothing matters other than this came in this translucent purple. And lime green. - So this is nine years after the original GameBoy, and the only real difference was that it had color support. The games were slightly more higher fidelity. - Yeah. So for a Next Generation GameBoy, it was a very minor upgrade. I'm leaning toward B for this one. It was not a massive upgrade, and it took them nine years to barely iterate on the original GameBoy. But it was good. - All right, I'll give you B. I'll give you B. - All right, moving on. Oh no, it's the Sega Nomad, - The Sega Nomad! - the one I thought. Okay. Basically this is just a Genesis that you can use portably, which meant that the battery life was terrible. - [Matt] Yep. - [Austin] And that it was not very good. - [Kenzie] It was based on the Mega Jet, a portable version of the Genesis for airline flights. - Look, this, this has gotta be D or F, is my thought. This thing was just not very good. - I will give you, I will give you the big fat F. (booing) All right, I'm gonna go with... - Stop cheating. Just pick one. You can't look at which one it is. (Matt laughs) F. - The Logitech Cloud. - Moving on. Moving on. Moving on. - Yeah. F. F. - Go ahead and pick one. - We're just gonna move on from that one? - Yeah. - Okay. All right. Cool. GameBoy Advance! This is pretty much life size. - [Matt] Yeah! - GameBoy Advance, as you could probably tell from my ranking of the SP, was, I think the pinnacle of the GameBoy line. It still kept backwards compatibility, pretty much all GameBoy and GameBoy Color games work. - I have a steam deck. - Yep. - And I don't have a single game on that steam deck, that isn't a GameBoy game. My nostalgia glasses have been surgically grafted to my face when it comes to the GameBoy Advance. - It's also comfy too, right? This is the only... - It was. Ergonomically. It was amazing. - Matt, do not. No, no, no, no, Matt! No! Not on top of it! How dare you! get that down! (Matt laughs) I can't veto him. I'm so mad right now. It was not as good as the SP! - Hey, hey, hey. Get that down there. - I'll put it in A. 'Cause I'm saving my veto. - Okay good. - For something, something more nefarious. - All right, my turn? - Yeah, your turn. - I'm gonna go all the way (smacking sound) to the PS Vita. So the Vita, I think, is a little bit of a complicated one, because this was a true successor to the PSP. I mean, a beautiful OLED display, a touchscreen interface, you had the rear touch panel. - The problem I have with the Vita is it's, and we're gonna a, we're gonna get an earful for this, for having to look at Vita face. It's really good hardware. Sony did nothing with it. - Yeah. - And because of that, I'm giving it at best a B. - Oh, I was actually gonna say C. Vita was good, but Vita never really hit its full, true potential, like the PSP. - And I'm, and I'm blaming Sony for that. I'm like, yeah. - What? Matt blaming Sony for something? I can't believe it. - Sorry, Sony ponies! The Xbox handheld was so much better. The DS! - Oh, the original fat model. - The original DS. I don't know, like it's so chunky. - Yeah. - Which, you know, obviously chunky is great, but this guy here just wasn't, it wasn't it? - Let's be charitable for a second. (Matt making a falling sound) No, no! Hold, wait, wait, wait! Calm down. Calm down. Stop, stop, stop, stop. Calm down, Matt - I don't know what you're talking about. I didn't do anything. - The DS did bring a lot of things, right? So obviously the DS line was tremendously successful. It brought in a touchscreen, which was very exciting, and it was really cool gimmick as well as a microphone. And it had two screens! AKA the Nintendo DS! Dual Screen. - Is that what that stands for? - That's what it means. It also was Nintendo DS for Da (Minecraft hit sound). - Well it's going- - No! Wait, stop! - It's going in D. That's what that D stands for. - I'm. noticing that we have a trend here. The original 3DS and the DS are in D-tier. And I feel like every other slim model and upgrade are gonna be... (Austin makes clicking sounds) - Yeah, because they've improved upon 'em. You know what else they improved upon? - Yeah. They did. - The Switch Lite. - But how are we gonna rank this one, Matt? So I will just get my cards on the table right now. I use a Switch Lite. Not because it's the cheapest one, but because I never plug my Switch into the TV. And as much as the joy-cons are nice, joy-cons, to me, when you're using it in handheld mode, there's a little bit of creakiness with your Switch, no matter what kind of Switch you're using, like to me, that bothers me. The fact that this is a full proper unit. - I'm gonna give this one. - Whoa, whoa, whoa. Okay. Wait, wait, wait, wait, wait, wait, wait. Before you stick that tape on there, I cannot, in good conscious, give it an A. - What? - I can give it a B. No, no, no, here's the thing, though. I can give it a B. I can give it a B. Here's the thing- - I'm confused by how much you, - No, no, no, - By how hard you argued for, for, for the the regular Switch to go B. - No one's gonna say the Switch Lite is better, except me, but that's just 'cause I'm a weirdo who likes small things. - I fully agree with you. Wait, what? What? What was that last booker? (smacking sound) The 2DS! - Actually though, - Look. - I can make an argument for this. - I can make an argument for this one too, because it shed the stupid gimmick of 3D that no one really cared about. You know? - When this first got announced, myself and pretty much everyone thought that it was April Fool's joke. - Yeah. - It looked ridiculous. After actually spending some time with the 2DS. And I've made many videos over the years on the 2DS. First of all, all it was available for cheap. So I think it was like 130 bucks new, but it went down to a hundred dollars. There were certain points... - Oh it went even cheaper. Ready for this one? Yeah. I bought mine for $49.99. - The 2DS also, I'll be real, was the most comfortable version of the 3DS line for me. - Yeah. - I would at least give it a B. I really liked the 2DS. - Pick one. I picked the last couple times. - DSI XL. I didn't like this one. It was, I believe the first time that Nintendo had done a bigger version of a console, not a smaller version, which would become the standard going forward. D. - D. - So we'll go with DS Lite. - I liked this. - So, this one was, this one was decent. - [Austin] The DS Lite had much better hardware than the original DS. It basically had all of the upgrades you wanted. The problem is though, we put the, we put the regular DS in D, and the DS Lite, while better, it was basically just the same thing, except in a better chassis. - I would give it a B. - I can give you that. - I would give it a B. - Okay. The Switch OLED. It was good. - Yeah, it's great. What can you say about the Switch OLED that hasn't already been said about? - How about this? You take a Switch and you give it an OLED screen and you change the name and charge $349.99, available at nintendo.com/austin for a 0% discount. - The screen is really good. - The screen is really good. - Really good! - The only thing I can really ding the Switch OLED for is that, unlike the DSI, unlike the new 3DS, this does not have any more performance, this does not have any additional capabilities. Where are you are on this? I could go either A or B. - I, I'm going A on that one. That was my plan all along. I just, you know, like, yeah, it's pricey, but I think that price is worth it when you're looking at it. So, alright, what do we got next? The PSP. - Oh. Okay. - The PSP, I have a love-hate relationship with. I was an early adopter of MiniDisc. - Oh good lord, Matt! - I got so excited when the PSP came out. I'm like, I have all these MiniDiscs. I had little cases of MiniDiscs. I couldn't use it, but PSP was good. I'm putting this solid in B. - Well. No. Hell no. Hell no. A or S. A minimal. - All right. - A, A, I'm like, for this. I'm A but like, peeking. It's just peeking a little into S. - You put that, you putting it on the line? You could get Stepbrothers for it. (cool music) (beep) Here we go. Easy one 3DS XL. - It's exactly the same as the DSI XL. It was the 3DS, except just a little bit bigger. Meh. Oh, now I'm covering it. Everyone can see it's right, there - Yeah. - Why is the Playdate here? This is not okay. - It's a handheld. - No offense to Panic, who have made a terrific little console. I don't know Matt, I'm not, I don't think this, this, this goes... This goes... (ding) Okay. - All right. Go ahead, and we're. Here, we'll- (smacking sound) - New 2DS XL, okay. (ominous sound) It would be easy to say that the New 2DS XL should go into the XL tier, however, this actually was better than it seemed. It had the more powerful performance because it was a new console and it actually had really pretty nice screens, nice hardware. I'm gonna say it at least it belongs in C. C is like every console. You're either a good or not good, but C is like the baseline. - All right. If you wanna, where are you gonna put the PSP Go? - Oh. So it was ahead of its time. So this was an all digital version of the PS. - It was ahead of its time, but so late at the same time. - Way too ahead of its time. It was a full digital console. No ability to play UMD, so you had to download stuff. I actually would normally say it's a little higher, but the problem is, that because they've shut the PSP store down, this is quite literally a useless console. - Yeah. - Unless you have games downloaded. I'm gonna say C. It was good. It just wasn't. This is, this is becoming chaos. Okay. Alright. That's, that's, I don't like that. - All right. We got the Nvidia Shield Portable. - Portable? The portable. - Oh man. So the Shield was an interesting console, because it ran Android. - [Matt] Yeah. - [Austin] There was a touchscreen, as well as it had a nice big chunky grip controller. Everything. It was all kind of built in. Ultimately it did kind of fail, and I think largely because, this was at a time in which the Vita was starting to kind of wind down. Microconsoles were a thing. - Yeah. - People thought that Android had a real future of being a real gaming platform, but ultimately everyone just decided to play free to play games. I'm gonna give this like a D. It was okay. It was not super strong. - I have to, I have to abstain because I didn't play it. (smacking sound) The GameBoy Light. Now this is not light as in weight, it is light as in this was a backlit version of the GameBoy Pocket. - This makes me sad. It was essentially a GameBoy Pocket that had a backlit screen, but it was not a very good one. Where, where are you going with this? What you're putting in C? Nah. D. D. D. - D? Yeah. (smacking sounds) - Okay. That one's stuck, so I'll let you get it. - The GameBoy Micro! - Oh! Wow! The Micro was essentially a GameBoy Advance, shrunk to the absolute minimum. The screen was like, two inches in change. It dropped the headphone jack, but it had a little dongle before dongles were cool. Matt, can I tell you one of my deep regrets in life? - What is that? - So when these came out, they did not sell particularly well. I don't remember how much they were at the time. I was at an FYE, maybe 2006, 2007, and they had in the front little like glass cabinet absolutely stacked full of GameBoy Micros. Do you know how much they were selling them for, Matt? - How much were they selling 'em for? - $20. - $20? - [Austin] If you watch this video, maybe take a pause and take a look at how much a GameBoy Micro costs today. I would've been rich. - It's a lot. - I would've been rich. I could've cleaned that cabinet out. This thing was neat, but it ultimately. I think was way too flawed, and it came out way too late, right? People are buying DSes. No one wanted to buy a GameBoy Micro. - No. - Like it just didn't make sense. C, D, I don't know. - I'd be inclined for D. Yeah. - D is very crowded, but. - D is crowded because Nintendo doesn't always make good games. - All right. Final three, Matt. Hit me. - [Matt] Final three! - Hit me. - The GameBoy Pocket. - A good console. - So, it was a more power efficient, lighter, about half the size. - It also ran on two As instead of like four, AAs, which was very nice. I'm like B or C. - Oh. You know what? There's room here. I'm gonna put it right on that line there. - This Tier list is the most chaotic thing we've ever made. Second to last is. - [Matt] The Steam Deck. - What? What the heck are we gonna do with the Steam Deck, Matt? What- - I'll be honest, I, look, I think it's a solid A. Where I do worry with the Steam Deck, that it's a like a little outdated. Development took a little while. But it's doing really well. Valve is doing a ton to make this optimized. - They are. - But I think A is very comfortable for this. - I think A's a little generous, but I can give it an A. - [Austin] Yeah. - That means we have one more left in this. - What, possibly could we have not covered, at this point? - The one that I saved for last, specifically, so I can veto whatever you say. - Oh no. - The original GameBoy! Came out in 1989 and this dominated the world. (Matt laughing) - You don't need- Whoa! Hey, hey, hey! (Matt laughs harder) Hey! Hey! There's plenty of space up there! - It is the S tears of the S-Tier. - Put some respect on the SP's name. - This thing. Nintendo didn't like, had this out for for almost 10 years, because they didn't need to make improvements on it because it was- - More than four colors? Psh. - Who needs it? - Green, green, green, and dark green are all the colors I need. - Speaking of all the colors you need, like, subscribe, follow, and check us out for the next one. Let us know what your S-tier is. Let us know what your F-tier is. Let us know what the Playdate, is that even part of the handheld thing. - No it's not. - And rate us five stars if you're time traveling. (Austin laughs) - Ah.",
    "transcript_keywords": [
        "Switch",
        "Yeah",
        "GameBoy",
        "good",
        "GameBoy Advance",
        "Switch Lite",
        "give",
        "Matt",
        "Switch OLED",
        "Wait",
        "Nintendo",
        "Lite",
        "console",
        "PSP",
        "pick",
        "thing",
        "time",
        "GameBoy Micro",
        "stop",
        "Vita"
    ],
    "transcript_entity_values": [
        "1989",
        "Android",
        "XL",
        "Aaron",
        "FYE",
        "three",
        "Microconsoles",
        "GameBoy",
        "the Nvidia Shield Portable",
        "a hundred dollars",
        "non-Switch",
        "349.99",
        "49.99",
        "the PS Vita",
        "PSP",
        "jack",
        "Nintendo",
        "YouTube",
        "nine years",
        "DSes",
        "the Steam Deck",
        "MiniDisc",
        "XL",
        "PS4",
        "2DS",
        "D.",
        "0%",
        "Second",
        "pinnacle",
        "S. A",
        "Matt",
        "two inches",
        "Austin",
        "C. C",
        "UMD",
        "PS",
        "Xbox One",
        "Switch Lite",
        "Xbox",
        "Genesis",
        "F. F. - Go",
        "Dual Screen",
        "GameBoy Micros",
        "Micro",
        "first",
        "2DS",
        "Vita",
        "D. D. D. - D",
        "Switch",
        "SP",
        "DSI",
        "DS Lite",
        "20",
        "D. - D. -",
        "Radio Shack",
        "2006",
        "non-Nintendo",
        "2003",
        "GameBoy Micro!",
        "Kenzie",
        "3DS",
        "Next Generation GameBoy",
        "The GameBoy Color",
        "2DS",
        "second",
        "five",
        "C. Vita",
        "Lite",
        "First",
        "almost 10 years",
        "Zelda",
        "one",
        "five years",
        "GameBoy Color",
        "four",
        "GameBoy Micro",
        "GameBoy Advance",
        "Sega Master System",
        "today",
        "Stepbrothers",
        "the S-Tier",
        "Da",
        "MiniDiscs",
        "130 bucks",
        "F",
        "the years",
        "Shield",
        "the Mega Jet",
        "two",
        "S-Tier",
        "the Switch Lite",
        "Pokemon",
        "More than four",
        "Sony",
        "Pokemon HeartGold",
        "about half",
        "Vita",
        "2007",
        "April",
        "Switch"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "CARDINAL",
        "NORP",
        "PERCENT",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "MONEY",
        "PRODUCT",
        "DATE",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "ORG"
    ]
}