{
    "id": "rPUccVeV4I0",
    "title": "ASUS GL702ZC - 8 Core Beast!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-11-15T20:29:50Z",
    "video_url": "https://www.youtube.com/watch?v=rPUccVeV4I0",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Best editing Laptop",
        "best laptop",
        "editing laptop",
        "Strix",
        "ROG Strix",
        "gl702zc",
        "radeon rx 580",
        "Laptop",
        "2017",
        "laptop 2017",
        "laptop review",
        "strix gl702zc review",
        "notebook",
        "video editing",
        "dave lee",
        "fast laptop",
        "8 core laptop",
        "8 cores",
        "video production",
        "fastest laptop",
        "nvidia",
        "best gaming laptop",
        "cheapest laptop",
        "ryzen 7",
        "amd"
    ],
    "views": 599526,
    "likes": 13741,
    "comments_count": 1067,
    "description": "Dave2D review of the new 17\" ROG Strix GL702ZC. The best laptop from ASUS for multi-core applications with it's new 8-core CPU! Purchase Here -   ASUSs new ROG Strix GL702ZC laptop is pushing the boundaries of laptop CPUs. This monster has 8 cores from the AMD Ryzen 7 1700 CPU and the Radeon RX 580 with 4GB of GDDR5 VRAM. This graphic card performs similar to the GeForce GTX 1060. All models come with a matte Full HD display with FreeSync for a smooth viewing experience. If youre looking to video edit or run applications that use all 8 cores, prepare to be blown away.   Music Credits: Fili - Splash  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2zK2CeL",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going? Dave2D here And in front of me is the Asus GL702ZC It's the easiest name in the world to remember. There's actually a bunch of \"702\" devices This is the most powerful one because it's got an eight-core CPU So if you don't know that much about CPU cores, the average ultrabook has two cores, the average gaming laptop has a four core CPU This thing is rocking a new eight-core CPU from AMD, called the Ryzen 7 1700 It's actually a desktop class CPU, super powerful, and they were able to stick it into a laptop That's not like, super thick or super large. It's still a little bit bigger It's not like the thinnest laptop out there But it's a very portable device for an eight-core Windows PC. Now, the design isn't my favorite It's not the color or anything. I mean there are some red accents, but it's more just the actual aesthetic It's more of a dated Asus look The current Asus laptops like the ones in the end of 2017 look pretty clean They're more like brushed metal with silver and gray accents This is more like the classic black with a bit of red The port selection is pretty standard for a 17 inch laptop There is a USB-C port, but there's no Thunderbolt 3 support. The build quality is not bad It feels kind of like average Asus laptops, it's not bad or anything It's just not ultra premium. Now, to get inside this laptop It's not the easiest thing. It's doable There's a bunch of screws, but you have to put quite a bit of force to get the plastic off But once you're inside, the RAM and the drives are user replaceable Interestingly, the CPU looks to be replaceable as well. I think I see a little bit of a socket on the motherboard It's not just soldered right on The battery down here is 76 watt hours and battery life is not great We're looking at an hour and a half, like 90 minutes of battery life for the screen of 250 nits with everything I just like, normal settings. It's actually one of the lowest battery life I've seen on a laptop, and the AC adapter is also pretty large It's a 350 watt brick But keep in mind that this is a desktop class CPU It literally is something that they pull from desktops And they stuck it in here, and it's an AMD GPU so you're missing things like Nvidia Optimus So a battery consumption is going to be high But the other thing is AMD could technically improve on this stuff with some software updates over time The keyboard and trackpad feel pretty similar to Asus laptops I mean it's a very standard looking Asus keyboard. Comfortable to type on Slightly mushier keys than I'd like but, it's good otherwise Trackpad, Windows Precision drivers, plastic surface. It's a good trackpad I think most people like it. The speakers are actually way better than I thought they'd be. These are actually one of the best Possibly, the best Asus speakers I've seen on a laptop. I guess it's because it's a bigger chassis There's like more room for stuff in there, but they sound good, not super loud or anything But the clarity is there and the base is more pronounced than you'd expect Alright, performance in this machine can be very impressive Single core stuff is kind of run-of-the-mill, nothing super special But the multi-core stuff is crazy good. This laptop flexes so hard on basically every single other laptop that I've tested before In the Cinebench CPU test, this thing scores over 1400 points That's like 40 percent better than even desktop-class CPUs like the 7700K The thermals on this thing are actually not bad as well Temperatures are good, cooling eight active CPU cores at once It's obviously not easy, but they're able to do it, but fan noise isn't super quiet. It's not crazy loud, but it's definitely audible The gaming performance gives me mixed opinions It's not bad per se, it's running at RX 580, the mobile version and that's similar to like a laptop GTX 1060's, very respectable. On the 1080p screen, I'm still getting very good frame rates even on max graphics But this is the kind of performance if you'd expect for like 11 or maybe $1200. GTX 1060 laptops aren't super expensive This thing starts at $1500 and where this thing shines and quite frankly this is what people should be buying this laptop for, is video editing. This thing crushes so hard in Adobe Premiere So Premiere has always been a relatively weak performer on laptops It's a very CPU-hungry application, and even high-end gaming laptops with four core CPUs don't do nearly as well as desktops that have like eight or ten core CPUs. This thing keeps up This thing's actually faster than a lot of the systems that I've used in the past year It's actually faster than like the $10,000 Mac Pro in Adobe Premiere, which is crazy. It's a $1500 system The screen is okay. It's good for gaming. It's a 1080p panel It's bright But I wish it was high-res because that's what I would use this computer for I wish it had like a 4K panel with really good color accuracy and stuff, but that's just not the case. So again, I feel like Asus made something That's a little bit niche but this time I feel like it's A little bit confusing because they have components in here that are very gamer-oriented So I mean it's the ROG brand, it's got some red accents It's got a 1080p screen, and I think they're actually making a 1080p 120 Hz screen option But at the same time, the strength of this device is seriously in multi-core stuff, which most games in 2017 or even like early 2018 won't be able to take that much advantage of This thing really shines in video editing But it's stuck with a non 4K panel and not a super color accurate panel either So if you look at the price of this thing, it's actually a pretty good value for people that are editing videos. To be able to get this kind of performance in this kind of portable form factor for $1500 like, a year ago This would have been impossible, but right now If you're trying to pick up this thing for games, I wouldn't recommend it It's not a bad machine for it, but for $1500 You can get devices, that even ones made by Asus, that are just more suited for gamers Okay, hope you guys enjoyed this video! Thumbs if you liked it, subs if you loved it. See you guys next time.",
    "transcript_keywords": [
        "Asus laptops",
        "Asus",
        "CPU",
        "laptop",
        "thing",
        "average Asus laptops",
        "eightcore CPU",
        "good",
        "CPU cores",
        "core CPUs",
        "desktop class CPU",
        "laptops",
        "current Asus laptops",
        "super",
        "class CPU",
        "CPUs",
        "bit",
        "stuff",
        "core CPU",
        "Adobe Premiere"
    ],
    "transcript_entity_values": [
        "10,000",
        "RX 580",
        "a 350 watt",
        "1060",
        "a year ago",
        "Windows Precision",
        "702",
        "Mac Pro",
        "an hour and a half",
        "4",
        "AMD",
        "CPU",
        "GPU",
        "Asus",
        "76 watt hours",
        "ROG",
        "ten",
        "Nvidia Optimus",
        "AC",
        "90 minutes",
        "maybe $1200",
        "the past year",
        "eight",
        "11",
        "GTX",
        "CPU",
        "Adobe Premiere",
        "two",
        "3",
        "Asus",
        "2017",
        "early 2018",
        "four",
        "the Ryzen 7 1700",
        "1400",
        "1080p 120 Hz",
        "RAM",
        "AMD",
        "Cinebench",
        "1500",
        "40 percent",
        "17 inch",
        "250",
        "Thumbs",
        "the end of 2017",
        "1080p",
        "max"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "LAW",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON"
    ]
}