{
    "id": "RPvb0rS6y-A",
    "title": "Elon Musk and Tesla’s “Master Plan” | The Vergecast",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-03-03T22:02:51Z",
    "video_url": "https://www.youtube.com/watch?v=RPvb0rS6y-A",
    "category": "Science & Technology",
    "tags": [
        "elon musk",
        "tesla",
        "tesla master plan 3",
        "elon musk news",
        "elon musk interview",
        "elon musk today",
        "tesla investor day",
        "tesla new factory",
        "tesla new factory in mexico",
        "tesla investor day 2023",
        "tesla investor day highlights",
        "tesla investor day 2023 highlights",
        "the verge",
        "vergecast",
        "tech podcast",
        "the vergecast podcast"
    ],
    "views": 27888,
    "likes": 522,
    "comments_count": 112,
    "description": "Nilay Patel, Alex Cranz, and Richard Lawler discuss all the things that happened with Elon and his companies, including more Twitter layoffs and Teslas Master Plan on its Investor Day.   00:00 - Twitter layoffs 03:14 - Tesla Investor Day  Watch the full episode here:    Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://youtu.be/ZZcLmWY2Rgo",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "(upbeat electronic music) - There's a lot of Elon news but kind of like none of it matters. Like, I don't know how else to describe that, Alex. - He was doing some like A+ posting this week. - He was tweeting replies to people arguing about the war in Ukraine during Tesla Investor Day. I mean, he was backstage at his own Investor Day, replying to randos on Twitter. All right, let's go through the Elon headlines. He laid off more people over the weekend, including Esther Crawford who was a woman who very famously was sleeping on the ground and was gonna be like that head of Twitter Blue, his product. She got laid off along with a bunch of other founders from companies Twitter had acquired who had accelerating vesting schedules, bigger payouts because of their stock and so on. More cleaning house. He apologized, he said it was necessary. Twitter, financially quite dicey. Like we don't know what's going on there. There's a lot of rumors that he's picked a new CEO. The CEO, Esther Crawford, slept on the floor by herself in a sleeping bag. The guy, they think that will be the new CEO of Twitter, he just moved in with his wife and newborn baby and is sleeping there. - Oof. No. - So that's the level of commitment that Elon's looking for is does your family sleep here as well? We'll see. Twitter has gone down a lot recently. It's been very slow. Errors are spiking. The main timeline just like didn't work this week. Twitter also has shut off its internal slack and employees went over a day without working. Just all fully ridiculous. Then all the things that we thought would happen when Elon bought Twitter have like started to happen. And I don't mean the, he fired everybody and the site's not reliable. We didn't actually predict that part of it. We predicted a bunch of moderation crises and that is beginning to happen as well. So there was a report out of the Department of Energy that the Department of Energy is low confidence has deduced, has decided that Covid leaked out of a lab in Wuhan, China. That's obviously, there's discrepancy with what the Department of Energy thinks compared to other parts of the government. This is an ongoing debate in a scientific community. Elon tweets about it, gets reprimanded in Chinese state media. It says don't bite the hand that feeds you, in using a Chinese idiom. There's a huge problem for Elon. China is a huge market for Tesla. Like he's gotta keep that in check or leave China, right? Like the same way that, I dunno, the NBA gets in trouble for kowtowing in China. Like Elon's got the same problem only now he owns Twitter and he's addicted to it and he loves owning the libs. This is the problem. - He has no one to just say no. Before that it was the moderators at Twitter and he fired them all. - Well he had a response to the SEC. He, he like, he wanted to try and make up a little acronym for them and he's complained and complained and complained about their restrictions on his tweeting. I feel like that's not gonna go over well with the Chinese government. - I feel like it's not gonna go over well with the Chinese government. So that's Twitter. So just escalating chaos at Twitter, including now some of the problems that we thought we would see. And then there's Investor Day, which was, we are recording this on Thursday. You're listening to it on Friday. We all watched Investor Day on Wednesday night. It was very long. It was four hours long. I will say Elon's deputies at Tesla by and large all very polished, all very put together, very committed, very passionate. Elon looking like he just showed up off the street. Like rambling. Like they kept dragging him out there to be like now Elon's gonna talk about robots. And he'd be like, here's a render of Optimus. And he'd say something like, \"Yeah, I think it's pretty important. This could change the economy.\" And then he would look off into the distance and say, \"What does economy even mean?\" And then everyone would politely clap and then they would like bring out the head of supply chain to be like, \"Here's how we're gonna make more cars.\" But overall it was four hours, they announced nothing new. Right? And there's no, they hinted at the new platform. Everyone thought we were gonna see it. They hinted at cheaper cars, everyone thought we were gonna see it, but we didn't see it. And the stock price collapsed. - It sounded to me like a long presentation of Elon's people telling investors why they're going to need a lot more money for for the next period. - Yeah, I got some of that vibe. You know, there's something really interesting. So Tesla is very innovative as a company and like the way they design, package, and build cars is new and novel, right? This core argument they're making, which is that a big car company like a GM or a Ford or whoever is, or VW, is like their job is to go buy parts from lots of suppliers and then they integrate all the parts and there's like so many parts in the car and that's why they're hard to upgrade over the air and all this stuff. Like all that is a 100% true. It's just that was the argument at the beginning of Tesla. That was the argument when the model three was coming out, right? We're now making a mass market car. We've designed and built it from the ground up. We are using less computers, less supplier computers in the in the car. We are designing the manufacturing at the same time. To me, this is all very familiar to the Tesla story we've heard for years. It's also really familiar to the story of every other kind of high end EV startup that we are now familiar with. Like when you go hang out with Rivian, they tell you a story about how traditional car makers are lazy and they don't realize that cars are computers. Like you can get this from lots of places in the market. So there was just a weirdness to Tesla restating their core value proposition in that way because for the larger part of the market, this is always what they've been investing in, right? It's Tesla makes better cars cause it designs them differently and it's much more of a computer company than a car company. But we are now at the point where Ford is like we've done it, like we split ourselves into two divisions and we're gonna act this way too. There was just something weird there. I was like, it's weird to see Tesla repeating himself. - Well, and I think this was, this kind of reinforced a lot of investors fear that he was spending too much time with Twitter and not enough time-- - Yeah, he was tweeting during the Investor Day. - Yeah. And so he, and then he was like, I think Elon has definitely gotten to a point where he has forgotten that actually he does owe people things, he does, just because he is the richest man in the world on paper. Well, not anymore. - Oh, he is again. - He's still has to like. Is he again? - He's back. - Yeah, he's back. But he's got a lot of other people that he has obligations to. And I think he keeps forgetting that because he's like, \"Oh, I got a tweet and it's real important.\" And the investors kind of reminded him. - Yeah. I think there's a real world in which any one of the deputies we saw at Tesla yesterday, he could say, \"You're the CEO now.\" And that might be a good thing. The same way, like when Shotwell's the COO of SpaceX, very much in charge of SpaceX. He doesn't have that person at Tesla. He does not have that person at Twitter delegating. - And he needs it. - It's a hot management tip fresh from decoder. You should sometimes delegate some things. He did roll out the new master plan. It is about renewable energy and it's not really about building cars. He wants to increase the world's energy storage capacity. They have some new ideas about battery technology. Musk, Elon, he's like, this will need substantially less than 30% of all nickel on Earth. Which is an incredible thing to say. (both laugh) It's just good. It's like, yeah, you know I have a plan. - Just a little nickel shortage. Don't worry about it. - Don't worry. It'll be less than 30% of all nickel on the planet. And it's like, yeah, you should set your goals high. And then they talked a lot about just in general manufacturing more efficiently. And then they did spend some time talking about full self-driving and how they think they can get full self-driving out the door. The cars will be taxis, the cars will be in service more often. They'll be driving themselves around, making money for you while you're sleeping. And that will go a long way to sustainability. That was the part of the whole presentation where I was like, what are the car? No. Like we're a long way from there. Like as far away from that as we are from Optimus. - And (indistinct) already promised it, and didn't deliver it for several years. - Right. - We've heard it. - I'm just thinking of the day where like you forget you left something in your car and you send your car out to be an Uber and your laptop's in there, your child, something. - Your child. - I don't know. I don't have a kid. I assume people sometimes forget them in their cars. Like. - Look, you get my car and Max is in it, it's actually the rates goes up. She's very entertaining. She happily sing you any song from Encanto you want while you're on your-- - She's the MC for the ride. She's got a little like bowler hat on. She's like, \"Welcome.\" - Yeah, yeah. - But yeah, like that's-- - She'll tell you any number of jokes about butts. She's very funny. Very into them. She's four. The whole thing I think kind of landed with a thought. It landed with a thought with the Tesla fanboys who were expecting to see a new car and instead got very long explanations of like, you know, assembly efficiency in factories. - And some of 'em couldn't get into the event with the whole Mars blog guy. Like there were people who were supposed to be able to be there who suddenly couldn't. - Yeah. But then they tweeted Elon and they got in. - Of-course, because customer service is what he does now. - That's his whole job. - Delegate sir. (upbeat electronic music)",
    "transcript_keywords": [
        "Twitter",
        "Elon",
        "Tesla",
        "Investor Day",
        "Yeah",
        "Tesla Investor Day",
        "car",
        "cars",
        "Day",
        "Elon bought Twitter",
        "lot",
        "Investor",
        "CEO",
        "people",
        "Esther Crawford",
        "Tesla Investor",
        "Energy",
        "Twitter Blue",
        "thought",
        "Chinese"
    ],
    "transcript_entity_values": [
        "four hours",
        "the Investor Day",
        "Ford",
        "Elon",
        "Encanto",
        "this week",
        "four",
        "GM",
        "Elon",
        "Earth",
        "three",
        "yesterday",
        "Twitter",
        "the day",
        "Tesla",
        "Mars",
        "NBA",
        "less than 30%",
        "Ukraine",
        "Wuhan",
        "Wednesday night",
        "the Department of Energy",
        "the weekend",
        "Twitter",
        "years",
        "EV",
        "several years",
        "100%",
        "SpaceX",
        "VW",
        "two",
        "Thursday",
        "Tesla Investor Day",
        "SEC",
        "that's--",
        "Covid",
        "China",
        "Alex",
        "Esther Crawford",
        "Elon",
        "Shotwell",
        "Rivian",
        "Max",
        "Twitter Blue",
        "Friday",
        "Optimus",
        "Optimus",
        "Chinese"
    ],
    "transcript_entity_types": [
        "TIME",
        "EVENT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "LOC",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "LOC",
        "ORG",
        "PERCENT",
        "GPE",
        "GPE",
        "TIME",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "EVENT",
        "ORG",
        "PERSON",
        "PERSON",
        "GPE",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "NORP",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "WORK_OF_ART",
        "NORP"
    ]
}