{
    "id": "RRIpnXcqYJE",
    "title": "This Under-Screen Camera Is INCREDIBLE! - ZTE Axon 30 5G",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-08-16T12:00:08Z",
    "video_url": "https://www.youtube.com/watch?v=RRIpnXcqYJE",
    "category": "Science & Technology",
    "tags": [
        "ZTE",
        "Axon",
        "30 5G",
        "Under-screen",
        "Under Screen",
        "Camera",
        "Selfie camera",
        "hole punch",
        "notch",
        "invisible",
        "affordable",
        "cheap",
        "full screen content",
        "viewing",
        "high refresh rate",
        "400 ppi",
        "snapdrago",
        "870",
        "Samsung",
        "Fold3",
        "smartphone",
        "mobile device",
        "Linus",
        "unboxing"
    ],
    "views": 436939,
    "likes": 20346,
    "comments_count": 1290,
    "description": "Get 10% off all Jackery products with code LinusTechTips at   ZTE releases the Axon 30 5G, the second iteration with their under-screen camera tech for the front-facing aka the selfie camera. This new model feels like they just left other companies way behind.   Check out the ZTE Axon 30 5G at   Get the Galaxy Fold 3 5G:   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.jackery.com?aff=27",
        "https://lmg.gg/eIqJ0",
        "https://geni.us/gLfaG9e",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- The big deal today with the ZTE Axon 30 5G is that this is gonna be our first look at a 2nd generation under-display camera. If you guys remember, the 20 5G was actually the first phone with an under-display camera that actually made it into production. And this one claims that it has taken everything that they learned from that first attempt and made it even better. Now, right out of the gate, the specs don't actually sound better. In fact, we're going from a 32-megapixel front facing camera to just a 16-megapixel front facing camera, but ZTE claims that the pixel density of the display in front of the front facing camera, as well as a special secondary driver for that portion of the display makes it so that it is far less noticeable in day-to-day use. Let's do our unboxing experience first, and then we're gonna dig right into the front facing camera. So inside the box, ZTE has not followed the industry trend of not including a power adapter. Actually, wow, this thing feels robust. 65-watt power adapter. It's a heavy boy. Nice thick USB Type-C to Type-C power cable. And of course, oh, look at that, that's adorable. They still include a Type-C to headphone jack. SIM removal tool and a pretty basic case. Basic is the kindest word that I can have for it. Okay, let's put this on and totally ruin the fantastic, gorgeous finish of this phone. We're not gonna do that. And, yeah, we're gonna appreciate this for what it is. Oh, that's weird. Oh, it's a peel. Okay. It's like that is a really weird color there. (chuckles) Okay. There we go, that's more like it. There's one here too. Here we go. Look at that. microSD and nano-SIM, dual-SIM if you prefer. USB Type-C for charging, got a speaker here. Now that's interesting, our headphone speaker is extremely slim. I'm gonna have to check later to see if it has stereo sound. On the left side, there's nothing, no buttons. So you'll never be trying to press the lock button or the volume rocker on the right and accidentally mash something over on the left-hand side. At the top, we've just got a secondary microphone there for noise canceling. I don't see an IR emitter. Sometimes you find those on phones that are more intended for the Chinese or Indian market. 64-megapixel main shooter. You've actually got a total of four cameras on the back, uses a Samsung sensor. And then moving around to the front, okay. (laughs) That's pretty impressive. Andy, can you see it? - [Andy] I can't. - Oh, wait, well, that doesn't help. (Andy laughs) Okay, how about now? Can you see it? Where is it? Is it on the side? Is it in the middle? Where is it? - [Andy] I can't really see it at all. - [Linus] Okay, I gotta get the old one out here because that is hard to spot. The old one actually, you can see it defaults to having a black bar at the top, so that it can mask it. It's a lot harder to see it. I'm gonna have to just go ahead and fix that. Can you make it out? - [Jono] Oh, yeah! - [Linus] Yeah, there it is. But what about in my left hand? - [Andy] No, nothing. - Now to my eye, I can see it, but instead of looking like kind of a green spot, it just looks like there's a series of kinda like banding, right? If you've got a low bit rate video clip that you're watching and there's some colors that instead of, you know, blending together nicely, they have kinda these bands, it looks like a really subtle kind of white banding effect, just in a little rectangle up at the top of the device. I'm willing to bet that if I give it to you at an angle and you'll be able to see it a bit better. Oh, it's crazy hard to spot. I'm not expecting it to be easy. And then here, just for the sake of having a similar comparison shot, let's get the Fold out here. It's super noticeable. Thanks to Jackery for sponsoring this video, their Explorer 1500 Portable Power Station has enough juice to keep all your devices powered and connected. Its enormous 1500-watt-hour capacity and 1800-watt output rate allows up to seven devices to be plugged in simultaneously. It takes only 4 hours to recharge from 0 to 80%. And you can get 10% off with code LinusTechTips at the link down below. What's interesting about this then is that given that while I'm enjoying fullscreen content, I didn't find the Fold particularly distracting in day-to-day use. I'm expecting this to be the kinda thing you forget about. At least, that is until you open up your camera app. So let's have a look at what the performance of this front facing camera looks like. Oh, image quality enhancement, it is advised to turn it on for better results. What looks like is mostly a sharpening filter. (camera shutters) See? There's a processing delay there. It says, \"picture quality is improving.\" Their sharpening filter is clearly doing far more than just sharpening. That is markedly better than what I was expecting looking at the initial preview here. In the preview, it looks like I've got Vaseline smeared over the lens. Okay, let's see what happens if I don't turn on the processing here. (camera shutters) No delay, but it looks super soft. I gotta try more, like an apples to apples comparison. Okay, I'm gonna take the exact same picture and stabilize this. (camera shuttering) That is like a two steamboats processing delay, but that difference is crazy. My eye color looks way more natural. My shirt, instead of looking like it's reflecting off of something, it's true to life. Now, we can definitely find problems. Look at this, this orange smudge over on the side of the frame. Oh, that's from this light source on the lamp back there. Can they see that in the a cam? - [Andy] Yeah. - [Linus] Interesting. I'm willing to bet that we wouldn't have that same problem if we were using the rear camera. Let's go ahead and turn it around and I'll take a picture of myself here. (camera shutters) Okay. Oh yeah, nothing. Oh, that's stupid face I'm looking. What am I even doing? Let's compare it to last gen here. This button is the AI button, when you switched to the rear camera, this enhanced one. So it's probably using the neural processor in the Snapdragon 870 to accelerate that upscaling. Meanwhile, the Axon 20 5G doesn't have a similar function. There is simply no way about it. You can see that ZTE and Samsung are struggling with the same things here. You can see that same kinda high contrast look in both of these images, but the difference is that ZTE has figured out how to fix it and Samsung is just giving you that result out of the front facing camera. See? You can really see that same kinda dark eyes kinda haunted look, Andy? Man, that is cool. Okay, let's talk about some other key specs. It ships in two varieties with 8 gigs of RAM and 128 gigs of storage or with 12 gigs of RAM and 256 gigs of storage. So it's 2460 by 1080, it's got a 4200-milliamp-hour battery, and it supports 65-watt charging. And of course, includes a power adapter that is capable of delivering that. I don't believe it has any support for wireless charging, but it is an OLED display and has other traditionally high-end phone features like support for 128 hertz refresh rate, not to mention that it samples the actual touch interface at 360 hertz, so it feels extremely responsive. And that does pan out in practice. Now let's go ahead and consume some HDR content here. It's not blindingly bright, but definitely bright enough to have a solid HDR viewing experience. Gesture controls, gesture navigation by default, so if you're into that, then go for it. And if you're not, then you can always change it. Oh yeah, we should try out the in-display fingerprint reader. I mean, this is so crazy. This was like holy grail technology, not that long ago, under-screen camera, under-screen fingerprint reader. So you've got absolutely no interruption to your content whatsoever. Okay, let's try that out. Those have gotten really invisible. Let's try and unlock it with my meat mitts now. Oh, I missed. Right there, okay, reasonably fast. So you can just have an auxiliary WiFi network and it'll default to 2.4 full range and 5 gigahertz for performance. Huh? I don't know if I've seen that before. I didn't notice any kind of horrible vivid mode out of the box and actually looks like they ship in standard mode, which is really nice to see. Screen refresh rate, yeah, let's switch between 60, 120. Actually, it looks like it's in 60 right now, browsing the menu. So if you want maximum smoothness, it looks like you're gonna wanna turn on 120 hertz manually. I kinda want us to try the selfie camera outside. Can I just go do that and come back real quick? - [Andy] Sure. - All right, I'm gonna do that. Now on the Fold 3, we noticed a thing where if there was strong backlighting on the subject, we could see this kind of a rainbow effect. So maybe if we have something like a white car behind me, we'll have problems with that. Oh, there's kind of like a haze around it. Yeah, that's interesting. It's not to nearly the same degree that we saw with the Fold 3 though. Let's try taking some pictures here. I'm gonna turn on the processing in our parking lot here. So you can see this video is definitely on process. Wow, it is bright today. How does someone manage to close their eyes when they are the one taking the picture? Okay, but seriously, it was just really bright out. The haze goes away to a very significant degree. It's like, it's not amazing, but it's serviceable. And when you consider that you can watch fullscreen content with absolutely no interruption whatsoever. That is a compelling selling point. It's freaking awesome. Like, look at this. Even when there's like a bright light, right where you would notice it, it is way better than the one on the Fold. Look, I vowed to wait out the notch, all right? I won. I lasted. Note 9 daily driver, no notch. I now have multiple, multiple devices to choose from that I don't have to put up with that ridiculous bullet wound in my screen. This is fantastic. It's a good time to be a Linus. I would just watch everything in like widescreen like this, for sure, just cause I can. I mean, I think it's fair to say, ZTE is a full generation ahead of Samsung on this. And Lord only knows where Apple is on this technology. We don't know yet. Did this thing ship with AnTuTu on it? AnTuTu Benchmark. For those of you wondering, the Snapdragon 870 is basically an 865, but newer. Here, we'll do a quick Geekbench benchmark. Okay, check this out. 982 single core, 3157 multi-core that should give you guys some idea of where the Snapdragon 870 falls compared to the 865 or the 865+. Now I don't wanna pretend that this is all sunshine and rainbows. Something that I noticed on our review unit, which tends to be a handpicked one, not to say that it is better, but it's typically not defective is that I've already got some separation between the back of the housing and the front. Maybe that was when I was putting that case on or something. Let me just see if it'll click back into place here. Oh, there it goes. - [Film Crew Member] There we go. - I guess that's pretty much it. So Riley, go ahead and shoot TechLinked and don't forget to subscribe and subscribe to TechLinked, it's a good show.",
    "transcript_keywords": [
        "front facing camera",
        "camera",
        "facing camera",
        "front facing",
        "kind",
        "front",
        "underdisplay camera",
        "yeah",
        "ZTE",
        "big deal today",
        "big deal",
        "power adapter",
        "Fold",
        "facing",
        "power",
        "Samsung",
        "generation underdisplay camera",
        "turn",
        "ahead",
        "back"
    ],
    "transcript_entity_values": [
        "20 5",
        "secondary",
        "32-megapixel",
        "RAM",
        "65-watt",
        "8",
        "60",
        "Riley",
        "between 60",
        "4200-milliamp-hour",
        "Fold",
        "9",
        "30 5",
        "64",
        "Andy",
        "Vaseline",
        "Apple",
        "AI",
        "16-megapixel",
        "2.4",
        "120 hertz",
        "Geekbench",
        "Samsung",
        "0 to 80%",
        "128",
        "982",
        "3157",
        "microSD",
        "only 4 hours",
        "Indian",
        "256",
        "360",
        "daily",
        "first",
        "1500-watt-hour",
        "2nd",
        "Chinese",
        "2460",
        "865",
        "up to seven",
        "two",
        "Jackery",
        "10%",
        "1080",
        "120",
        "four",
        "TechLinked",
        "5 gigahertz",
        "USB Type-C",
        "Explorer 1500 Portable Power Station",
        "ZTE",
        "nano-SIM",
        "12",
        "hertz",
        "Linus",
        "jack",
        "1800-watt",
        "LinusTechTips",
        "today",
        "IR"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "ORDINAL",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "DATE",
        "ORG"
    ]
}