{
    "id": "RRwDkyStFzY",
    "title": "This is NOT Worth It - Unboxing Counterfeit Merch 2022",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-12-18T17:59:00Z",
    "video_url": "https://www.youtube.com/watch?v=RRwDkyStFzY",
    "category": "Science & Technology",
    "tags": [
        "Merch",
        "LTTStore.com",
        "T-Shirt",
        "Laptop Sleeve",
        "Backpack",
        "LTT",
        "Counterfeit",
        "Fake Merch",
        "Coffee Mug",
        "Bento Box",
        "Water Bottle",
        "Stickers"
    ],
    "views": 2581047,
    "likes": 86443,
    "comments_count": 3347,
    "description": "Make device repair a breeze with iFixit's FixMat at   We bought more counterfeit merch to see if things have gotten any better over the last couple of years. Now that we've launched more products, we're seeing more non-clothing items, but that doesn't mean they're any good.  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:53 Backpack 3:50 Water Bottle 5:05 Stickers 6:40 iPhone Case/Mug/Towl 8:45 Bento Box 10:17 T-Shirts 14:20 Laptop Sleeve 15:20 Skirt 16:16 Hoodie/Mask/Comforter 18:50 Fashion Show 20:01 Outro",
    "description_links": [
        "https://www.iFixit.com/LTT",
        "https://linustechtips.com/topic/1474764-the-worst-counterfeit-merch-ive-ever-seen/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Who in their right mind would buy YouTuber merch for $250 when you can get it for a fraction of the price? That's right, we're back with two tables of counterfeit LTT merch. Everything from backpacks to water bottles to things that we don't even sell, all with extensive notes from our product development team. So are they garbage? Are they better than what we're making? There's only one way to find out. By hearing this message from our sponsor, iFixit. Are you traumatized with visions of lost screws and missing components dancing in your head? Make those visions go away with iFixit's FixMat. Click the link below or stay until the end of the video to learn more. (upbeat music) Even at 1/5 of the price, I'd be pretty disappointed. If it wasn't for the circle around the LTT, I wouldn't even know that they were trying to knock off our logo. Is that Comic Sans? - [Jake] I'm pretty sure that's MS Paint, like drawing lines. - The print quality is terrible, with light fringing around the outside. Oh my god. They printed this (laughs) and just put a pocket over top of it. I think this might actually be made out of the, like, recyclable paper material that comes over top of a TV or monitor. - Oh, I know what you're talking about. Like the monitor film. - Yeah, I think it's a paper-backed canvas. (all gasping) Ah, yeah, you know what? They got the water bottle mesh. Oh, ooh. Oh, we've got our second piece of counterfeit merch. - [David] That's a point for this backpack. You can put a water bottle on the outside. - Yeah, exactly. (others laughing) - Hey, why would I take the one that doesn't even have an external water bottle holder? Hello. I belong to someone with extremely low standards. To be clear, I'm not shaming anyone who doesn't have a ton of money to spend on a backpack. I'm saying if you spend 50 US dollars on this one, you ain't doing it right. That's all. (laughs) Oh, care instructions. Oh, uh, assembled in USA of US. (others laughing) 100% polyester. That I believe. (laughs) This is great, Kyle. I can hear it in his voice. And why is it off white? It's gonna get dirty. How strong is it? Not bad. It holds, it holds. They got a box stitch on the arm strap. (fabric ripping) Not confidence inspiring, but it didn't break. Okay, well if ours can survive that then this one has to too. Okay, all right. I gotta give them points for durability. Bridget described the material as crunchy feeling. (Jake groaning) Due to the construction, it actually does manage to cushion the laptop pouch a little bit. I gotta give credit where it's due. Okay, wait. This is hilarious. The bottom where they print it actually has little dotted guidelines for where to sew on the pocket, and you can completely see them. They're just unfinished. \"I don't hate the name tag inside but I could rip it with my hands,\" says Bridget. Oh. - Whoa! - Oh. Fair enough, Bridget. Oh wow. I can actually see through it. Hi. Kyle complained about the smell. I didn't actually smell it. Oh, I don't think it's that bad. I think he's being fussy. Oh my god. You can get stuff for like, if you're American, you can get stuff for like 25 bucks that stomps this. See ya! Oh, I haven't actually worn it. It really doesn't seem very comfortable. These guys at least got the font right. I think they actually bothered to rip the graphic off of our site. But why? Why would you make it bigger so that you can cut off the top and bottom if you know that your printable area is this? Just make it smaller. With that said, I think I've seen and used water bottles from this factory before because I recognize this lid. I have an ASUS one that has served me very well. It's just not insulated. (sighs) Again, nothing wrong with this water bottle if you don't mind a non-insulated bottle, but 28 Canadian dollars? Buy a real one. Not even remotely comparable. Vacuum sealed, twist off cap. Sarah points out that the logo is obviously image traced because some points are pointy and other points are rounded. Probably could have put a little more effort in. I can crush it with my hands. Oh wow, I did manage to bend it a bit. - No, it'll deflect back. - What are you doing? What are you doing, bud? - [David] My beautiful... - (chuckles) Do you know how much I paid for this? (David laughs) That'll buff out. (grunts) Hey! What's next? Feel like I'm ready for my first day of school. Just give me (groans). Oh my god, why? - [Jake] That's called The Big Linus Sticker. - Big Linus Sticker. Available in a variety of sizes. - [David] I think that's the extra large size, so it's $22 Canadian. - This is a 15 US dollar sticker? - [David] Somebody made commission on that, you know? You have to leave it on there for a week. - Mm, okay. (David laughs) What is that supposed to be? It's the Linus Tec;h Tip sticker, with a semicolon in the name. Oh, perfect. So this is intended for a water bottle. Well, I just happen to have a water bottle. There's more complaints about the smell, this time from Bridget, but I guess they've been sitting for long enough that it's kind of gone away. - [David] It looks good on there. - It does look good. Now no one will mistake my water bottle for theirs. I gotta give them credit for the adhesive. It goes on easy, comes off easy, and is also pretty easy to cut to size. I'm gonna leave this on my framework permanently. Nice clean cut. Oh, yeah! Now I gotta find somewhere for the value four pack. - Oh, beautiful. - Oh! (laughs) I kinda like the stickers. I mean, obviously our stickers are better. This is our 2022 pack with the recyclable packaging. Really cool. Done by Sarah Designs. They're dye cut. They've got metallic and holographic elements and you can select them from the bonus bin for free with every order. You're not gonna throw this at me? - [Jake] Here, you can have a phone to put in that. - Wow, cool. It's an iPhone case. This is actually not bad. As far as cell phone case kiosk cases go, the fit's, like, kind of bang on actually. Oh, again, $30. What? I mean, I guess custom printing. Look, if I wanted a picture of my family on the back of my phone or something like that, I'd pay 30 bucks for this. Now I just have to find a convenient cell phone pocket in this backpack. How about the one pocket? Perfect. - [Jake] Don't throw it, don't throw it! Oh, go ahead. - Oh, he threw it! It's Wide Linus on a mug. Print quality is actually not that bad. Sarah's comments, \"Why don't we sell this?\" (Jake laughs) Kyle says, \"I want a coffee mug.\" \"Why I have no coffee mug?\" You know, both Bridget and Sarah criticized the print quality, but the source of this picture is actually really low quality. I think this is a good quality print of a bad quality source. (slurps) Cheers, Redbubble. You kind of nailed this one. Oh, it's dusty. Why did I drink from this? There's definitely floaties. Oh, well this is the actual LTT towel and we've got oh, from AliExpress. The LTT towel. This is a towel? - [Jake] It's a hand towel. - Oh, oh oh, okay. Oh, it's supposed to be a hand towel. - [Jake] $6.09. - Six bucks, hey? Yeah, it feels more like a shammy than a towel. Like the smooth side of this that they printed on, I don't even know if I'd be able to dry my hands on it. Oh, we can find that out easily enough. One moment please. (Linus screams) - [Jake] I'm good at being a towel rack. - It's dignified working here. Okay, now tell me, are my hands dry? (laughs) - Are they just clammy or are they wet? I can't tell. - They're just still wet. It just really doesn't dry very well. - [Jake] I accept tips, tech tips. - Tech tips. (laughs) Well, I guess what we're working on now is a beach bag. Day bag for the beach. So let's get our towel in there. All right, what's next? Oi! It has instructions on it to not make counterfeit merch, but it is counterfeit merch. This is from AliExpress? - [Jake] Yes. - Do not LTT. LTT Double Layer Bento Box Lunch Box Salad Food Bento Box Linus Linus Tech Tips Hot Sexy Linus LTT. That is the unabridged product description for this. I mean, the price is right. 10 US dollars. Oh, this one smells. I would not put food in this. (both groaning) Would you put food in this? - [Jake] This part doesn't smell. - No, that part I think is fine. I think it's the gray plastic. (Jake gags) (Linus laughs) He basically just like- - [Jake] Do it, do it! Put your nose in there and smell. - Hand, fart, cup and smell. (both laughing) Leak proof. I don't believe you. Let's find out. You ready? - [Jake] You have to lock it after you do it. - I'm gonna lock it. There is no rubber seal. Jake, there is no way. No way that this doesn't leak. It doesn't even have a tightening clasp. It just goes on. I think I'm about to wet my pants. Oh, look at this. - [Jake] Okay, now put the water back in the cup and drink it. - Oh man. Washable and reusable. Mm, I see. - [David] (laughs) I'm sure it's reusable. - Well, here goes my lunch. Hopefully that doesn't leak. Here's what we're gonna do. I'm gonna put on all the T-shirts without looking at any of them, and then I'm gonna see them as I take them off. - [Jake] That's it. - Oh, this is a real one. - [Jake] That's a real one. So you look good when you take 'em off. - Big reveal, okay. It's a nice hand feel. Good stretch. - [Jake] I like our new shirts. - Oh yeah, I love the new shirts. Here we go, first one. Oh wow. That is the cheapest possible printing process. This is literally worse than what you could do if you just went to Best Buy and bought like heat transfer inkjet printer paper. Sarah, really big logo. Bonus points for almost being the right Pantone color. - [Jake] Open the product page. Look, it's on the wrong side. Or is that just my brain? Yeah, that's the wrong side. - Yeah, it's totally on the opposite side, it doesn't have the white background and it's $25. This is $4 more than our shirts! To their credit, one of the issues I find on cheap shirts a lot is that the thread that they're using is not stretchy. No thread breakage. Mind you, the entire shirt just stretched out from me doing that. It did not spring back. I can see what Bridget was talking about with the really small, like, holes. It's hard to get in and out of this one. How's this for a look? - [David] Fantastic. - Establish major power bills. - [David] I love this. - [Linus] Is that a mining rig? - [David] Yeah. - And a Doge? And me. Is that a speaker? No, that's a graphics card. \"Why is the tag sticky?\" asks Sarah. Oh, that is a really weird texture. This has got to be the most uncomfortable fabric I've ever felt in the T-shirt. - Oh God. It's like almost soft, but then somehow still really gritty at the same time. - Yeah. - It feels like they printed on the whole t-shirt, that like weird crappy print. - Yeah. - What is that? Is that like- - Grody? Oh, this is the last one. Look at these. Look at these seams. - [Jake] What's that stain? - Yeah, why is there- - [Jake] Is this used? - [Linus] Why is there marks in the armpit? - [Jake] Looks like deodorant almost, but that doesn't make sense. - You too can have this t-shirt complete with schmoo. Sarah actually didn't mind the design. - [David] Yeah, the design is sick. - Yeah, the design's kind of cool. - [Jake] David wants that one. - If I was like in an edgy, weird band, like this was our tour shirt. Establish major, established major power bills! (Linus imitates guitar) This is an active shirt. That's what they're going for? Oh, this would be horrible to work out in. - [Jake] I think you should put that one on bear. - $28. All right, I will try that one on on its own. - [Jake] To feel the fabric. - Well, this one's a shirt. What is up with the black outline? Sarah's got that it's thick with four Cs. Four Cs of thick. I'm with her on that. - [Jake]] It's cheaper though. It's cheaper than our shirts. - [Linus] It is technically cheaper than our shirts. - [Jake] That's a win. - [Linus] Technically. - [David] That's if you don't count the cost of regret. (Jake laughs) (Linus laughs) - [Jake] I love that it's the old text. - [Linus] Oh my god, it's that picture. Oh wow. - [Jake] You look like that guy. - Yeah, it's really uncomfortable. If it's cotton, it's gotta be the world's worst cotton. 100% cotton they say. I only learned recently that there are grades of cotton. This ain't it. This doesn't get a grade. Made in Madagascar. Machine wash cold with light colors. 100% polyester. Yeah. Yeah, it is. All that chafing. Man, if I actually did anything in this... 10 out of 10 would not wear, but the design's kind of cool. Ah, David, this one or meth tips? Which one? Which one do I wear for the rest of the video? - [David] I think meth tips. - Feeling cool? (Jake laughs) To their credit, the inside is quite soft and cushy feeling. That's a laptop sleeve. Okay, what's the price though? If this is 15 bucks, then I'm okay. \"Graphic design is barf,\" says Sarah. (laughs) Oh, wow. And they didn't print all the way to the edge of the fabric (laughs) so there's a white strip. \"Sounds like snow pants when you hold it,\" says Bridget. I love their critiques. - [Jake] It does. - Oh, Bridget says this interior fabric will shed. It actually feels nice, but yeah, she's right. That could be a big problem. $37. - Woo! - That is too much. We're definitely gonna need our laptop for the day at the beach, though. Most real laptops do bend like this, so this should be fine. Nothing makes me respect the creator warehouse team more than seeing someone else try to do their job and fail this hard. Ooh, wait. (Jake laughs) - Oh no! Oh, that is such a weird thing to have on a skirt. - [Jake] Take off your pants. - So that's good. Ah, okay. Woo. That's (clears throat) to be adjusted. They're quite revealing. (Jake laughs) - [Jake] You have to wear it for the rest of the video. Don't point your legs up. Keep your legs down. - Wearing a skirt that happens to be in your own skin tone? Not recommended. Linus Moans Tips. \"There will be no breathing in this,\" says Bridget. \"The black stitching is unfortunate and shows how uneven the stitches are.\" Yeah, that's quality. Look at these threads hanging here. - [Jake] Trying not to look. Yeah, just don't slip that camera. - [David] I don't want to get the close up. - [Jake] (laughs) Here's something to cover up with. - The Linus lightweight hoodie. Sarah's only comment: \"Feels bad, man.\" Oh, it's not that bad, Sarah. I mean, it looks nothing like the quality of the pictures would lead you to believe it is. Oh my God. That print quality though. Can you see the cracking from there? - [David] Yeah. - Also, this is huge compared to the picture. The picture shows it being like this big. And this is $40. Look at this sleeve. Look at all the loose threads on this. - [Jake] Custom mask. - Oh, custom masks. So timely too. Even if I didn't have a beard, this is gonna be pretty leaky. I mean, a face covering is better than no face covering at all if you're like coughing or whatever, but it's already come off my face. Oh wow, you've got a big one coming. I do like a big one. - [Jake] Legitimately, something to cover up with. I'll take the mask. - Ooh! The LTT bedspread blanket duvet cover comforter! We got it in a queen, hey? I am 100% putting this on the guest bed. Comforter filled, sewn, and finished in the USA with fabric made in China. 100% polyester comforter. Great. That is not gonna be good for sleep. You would be shocked how much moisture your body loses while you sleep. And if you're under something that's not breathable, it all goes into your mattress. Oh my God. Hold on, David. I'm gonna need to step back a little bit here. Oh! (yelps) (others laughing) - [Jake] Did you get that on camera? - Yep. - Oh God. Wait, is it stuck? - Oh, what? Is that just like a loose thread. Oh wow! - Quality. - The quality of this is terrible. - It looks kind of cool. - You know what? The printing though is better than a lot of the stuff we looked at. - It's pretty low res. - Oh, it's very low res. I mean, it's not their artwork. - [David] Why is there a hole in the gap of the T? - Oh yeah. - What? (laughs) Oh, that's terrible. What happened here? - Is it in the design file? - [Linus] I don't know. - [Jake] It is. - [Linus] Oh, it's in the design. Why? - It totally is. - With how vibrant this looks in the picture though, I would be pissed for $148. - [David] Whoo! - For those of you wondering, by the way, yes. The bento box has leaked through the bottom of the backpack leaving a nice little wet spot on our couch here. Oh, and I realize we haven't really done like the full ensemble shot here. I mean, that was my whole thing, right? Like we got the back to school ensemble. So we'll do the (upbeat music) sweater around the waist. Guys, look casual. Okay, just gotta (sighs). Ope! Just gotta tuck into bed now and tell you a little story from our sponsor. iFixit. Their newest offering is the FixMat. It helps you stay organized through your repair process with six easy access sorting bins for screws and small components. The powerful magnetic sheet ensures that tiny parts stay put and helps you avoid runaway screws. And with the included rollaway-proof dry erase pen, labeling and relabeling your projects has never been easier. It's got a non-slip, sturdy foam backing that keeps the FixMat where you put it, and it's made of ESD safe materials to protect your sensitive electronics. It's also designed to be stackable so you can keep multiple projects organized at the same time while saving precious counter space. So quit screwing around. - [Jake] Hah! - And keep your screws in line by heading over to the link in the video description to check out the FixMat. If you guys enjoyed this video, you might enjoy Counterfeit Merch Part One, the Merchening.",
    "transcript_keywords": [
        "Yeah",
        "water bottle",
        "Sarah",
        "Linus",
        "Bridget",
        "put",
        "LTT",
        "quality",
        "water",
        "Big Linus Sticker",
        "god",
        "Box Linus Linus",
        "bottle",
        "tips",
        "Big",
        "wow",
        "print",
        "towel",
        "good",
        "Linus Linus Tech"
    ],
    "transcript_entity_values": [
        "my first day",
        "ASUS",
        "Bento Box",
        "iFixit",
        "50 US dollars",
        "buff",
        "second",
        "The Big Linus Sticker",
        "1/5",
        "one",
        "American",
        "Bridget",
        "Jake groaning",
        "four",
        "Jake",
        "Jake gags",
        "first",
        "25",
        "David] Whoo",
        "One",
        "China",
        "a week",
        "30",
        "Merchening",
        "15 bucks",
        "David]",
        "4",
        "Redbubble",
        "David",
        "iPhone",
        "AliExpress",
        "25 bucks",
        "Ope",
        "ESD",
        "Sarah",
        "Sarah Designs",
        "28",
        "MS Paint",
        "Comic Sans",
        "a ton",
        "10",
        "Linus Moans Tips",
        "28 Canadian dollars",
        "Cs",
        "100%",
        "Pantone",
        "250",
        "40",
        "US",
        "LTT",
        "15",
        "Jake] David",
        "30 bucks",
        "10 US dollars",
        "FixMat",
        "USA",
        "YouTuber",
        "Kyle",
        "6.09",
        "Linus",
        "six",
        "37",
        "$22",
        "Madagascar",
        "Canadian",
        "Linus",
        "the day",
        "2022",
        "148",
        "only one",
        "FixMat",
        "two",
        "Four"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON",
        "ORDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "GPE",
        "DATE",
        "MONEY",
        "PERSON",
        "MONEY",
        "PERSON",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "PERCENT",
        "ORG",
        "MONEY",
        "MONEY",
        "GPE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "MONEY",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON",
        "MONEY",
        "WORK_OF_ART",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "GPE",
        "NORP",
        "PERSON",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL"
    ]
}