{
    "id": "RsAZ62xlzSw",
    "title": "Exploring Toxic Ruins with a Mavic ZOOM!!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-08-23T15:02:31Z",
    "video_url": "https://www.youtube.com/watch?v=RsAZ62xlzSw",
    "category": "Howto & Style",
    "tags": [
        "Mavic 2",
        "Mavic 2 Zoom",
        "Mavic 2 Pro",
        "Mavic 2 review",
        "Mavic 2 hands on",
        "best drone",
        "new drone",
        "DJI Mavic 2",
        "Hasselblad",
        "Consumer drone",
        "aerial drone",
        "Mavic two",
        "zoom drone",
        "Tintic Standard Reduction Mill",
        "Tintic Mill",
        "abandoned",
        "drone history",
        "Utah",
        "Augustin process",
        "Harold Mill",
        "Ruins"
    ],
    "views": 293511,
    "likes": 11607,
    "comments_count": 961,
    "description": "DJI just released the Mavic 2! Today we will be checking out the Mavic 2 Zoom drone. Seriously one of the coolest drones Ive ever flown:   Huge thanks to DJI for letting me get an early look at their drone.  If you want more detail on the drone check out the link above.   Check out my Mavic 2 PRO review here:  Flight time of 31 minutes! Max speed of 44 miles per hour!! (72 kph)  There are so many new features of DJI's new hardware! More than I'm able to cover in just one video. Hit that subscribe button and Ill have more videos on the way.   The Tintic reduction mill information is here:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://youtu.be/ULo9WBeZiuo",
        "https://en.wikipedia.org/wiki/Tintic_Standard_Reduction_Mill",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today, on this super hot day in the middle of nowhere, we are reviewing one of the 2 drones that DJI has released today. This is the Mavic 2 Zoom drone. And behind me are the ruins of a Tintic Standard Reduction Mill, which has been off limits to the public for the last 15 years. It was built in the 1920's, about 100 years ago, and the only way to get close to it without trespassing is with one of these. With the zoom feature on this drone we can get pretty up close and personal. Let's get started. [Intro] Alright, so this is the Mavic 2 Zoom, and there are a couple major differences between this and the previous Mavic 1. My favorite is that it actually has sensors on every single side. Sensors on the side, sensors on the front, and sensors on the back. So no matter what direction you're flying this thing, it's going to be pretty hard to wreck not impossible to wreck, but much harder than the previous Mavic and the other DJI drones. [Music playing] While these ruins might look like a colorful graffiti gangster castle, it was actually built around 1920, about 100 years ago, to refine the ore. Ore is a special type of rock that contains many types of valuable elements like gold, copper, silver and lead. If you can extract those elements from the ore, you get instant money. It was built into the side of a hill because gravity would help flow the ore from the beginning of the process, all the way down to the end after the precious metals were extracted. Unfortunately, this mill only lasted about 5 years, partially because of an antiquated extraction method called the augustine process. One cool thing about the DJI Zoom is that it's camera can actually look up at the sky instead of staying level with the horizon. And it doesn't catch any of the propellers while filming. It adds a whole new dynamic to the camera. One cool trick you can do with a drone that has a 2x optical zoom, is something called perspective distortion. When I'm flying toward something, or flying away from something, I can zoom in or zoom out at the exact same time and make the background and foreground have kind of like a warp affect to it. You can add this in post sometimes, but you lose image quality. Where I'm doing it directly out of the drone with the lens itself, I'm not losing any of that quality with a crop. The augustine process was an acid drying leaching process, in which the ore was first roasted with salt and then leached in a strong brine solution, and finally precipitated with copper to recover the silver. Each batch required about 140 hours to run. And the recovery rate was pretty high. About 85% of the silver, 60% of the copper, 32% of the lead, and 7% of the gold was able to be extracted from the ore. The reason the whole place is off limits currently is because of the high levels of lead and arsenic left over in the mill, covering the landscape, making it relatively dangerous to humans and trespassers. And also because the buildings are basically falling apart. You can see the metal reinforced re-bar popping out of the concrete in many locations. Another problem was that it didn't get enough quality ore from the nearby mine, which shut down the whole building 5 years after it was constructed. You can still see evidence of the water tanks, ore bins, the crushing rolls, the iron boxes, and the leaching tanks. It's a pretty cool bit of history. So with the Zoom drone, you might be thinking to yourself, 'well, it's probably easier to spy on people', which isn't the case at all. The drone is still relatively loud. While it's one of DJI's quieter drones, there's no way this is sneaking up on anybody. So we have the Mavic 2 side-by-side with the original Mavic. We can see some differences right off the bat. We have the side sensors on the side. And then rear sensors on the back, which the original Mavic does not have. The original Mavic is only equipped with sensors in the front on both sides. One thing I do want to point out is the gimbal construction of the 2 drones. So we can see this one right here, there's no extra like ribbon cables dangling around anywhere. But with this drone, every time that I would clamp in the drone for transportation with this little plastic piece, I was always worried about catching that little ribbon cable right there on the side. It seems like a much more fragile design on the original Mavic, where on the Mavic 2, they fixed it. I want to point out the LED lights as well. It's kind of hard to see them in the sun, but this guy right here is lit up red, whereas on the Mavic 2, right here it's a different type of LED light, but it's much brighter. The Mavic 2 remote remains pretty unchanged compared to the Mavic 1. We have the same directional joy sticks and antennas. But over here on the right hand side is a switch where we can switch between tripod mode, which keeps the drone stable during time lapses. Then we have our positioning mode for normal flight. And then sport mode, which turns off some of the safety features and allows the drone to go super fast. The top of the controller has the same gimbal adjustment circle, except for this time with the Mavic 2 it can adjust all the way up, allowing the camera to look at the sky while you're flying. And then the knob on the right is specific to the zoom drone, allowing it to zoom in and zoom out on different objects, which is pretty cool, and one of my favorite features of this particular drone. And there you have it. We got the full experience of exploring a poisonous landscape with the safety of a zoom drone. I'm a pretty big fan. With all the safety features on the sides, back and front, it definitely makes it safer to fly, which is important because these things are an investment. I'll leave the current pricing in a link down in the video description. And if you have any questions, leave them down in the comments. Thanks a ton for watching and I'll see you around. [Music playing]",
    "transcript_keywords": [
        "Mavic",
        "Zoom drone",
        "Zoom",
        "drone",
        "Tintic Standard Reduction",
        "original Mavic",
        "released today",
        "Standard Reduction Mill",
        "ore",
        "side",
        "previous Mavic",
        "super hot day",
        "sensors",
        "pretty",
        "hot day",
        "DJI Zoom",
        "drones",
        "DJI",
        "Today",
        "Tintic Standard"
    ],
    "transcript_entity_values": [
        "Mavic 1",
        "about 100 years ago",
        "augustine",
        "Zoom",
        "about 5 years",
        "60%",
        "Mavic 2 Zoom",
        "5 years",
        "1920",
        "DJI",
        "2x",
        "7%",
        "the DJI Zoom",
        "about 140 hours",
        "first",
        "Tintic Standard Reduction Mill",
        "32%",
        "today",
        "Mavic",
        "Today",
        "One",
        "Mavic 2",
        "About 85%",
        "one",
        "the last 15 years",
        "2"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "PERCENT",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "FAC",
        "TIME",
        "ORDINAL",
        "ORG",
        "PERCENT",
        "DATE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "CARDINAL"
    ]
}