{
    "id": "rSkr9bPKnPU",
    "title": "Sennheiser PXC-550: Better Than Bose?",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-12-09T18:37:50Z",
    "video_url": "https://www.youtube.com/watch?v=rSkr9bPKnPU",
    "category": "People & Blogs",
    "tags": [
        "sennheiser pxc 550 review",
        "pxc-550 review",
        "sennheiser pxc 550 vs qc35",
        "sennheiser vs bose",
        "bose qc35 review",
        "pxc-550 vs qc35",
        "qc35 vs pxc550",
        "bose vs sennheiser",
        "best travel headphones",
        "best noise canceling",
        "best headphones 2016",
        "michael fisher",
        "mrmobile"
    ],
    "views": 186246,
    "likes": 5551,
    "comments_count": 347,
    "description": "Questions in headlines are often cheap tricks, but in this case I just couldn't help it. I've measured every set of acoustic headphones I've tested in 2016 against the excellent Bose QC35, and thus far every single pair has come up short. How does the storied Sennheiser brand fare with its high-end PXC-550? Find out in MrMobile's PXC-550 review!   [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  Sennheiser PXC-550 on Amazon:   Bose QC35 on Amazon:    [ABOUT THIS VIDEO]  MrMobile's Sennheiser PXC-550 review was produced following over two months of usage on PXC-550 review hardware on loan from Sennheiser. The headphones were paired with a variety of devices, including a MacBook Pro Retina 2015, iPad Pro 9.7, Moto Z, Google Pixel, and iPhone 7.   [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"Financial District\" by Olive Musique, available at Premium Beat:    [SOCIALIZE]         [IMAGE CREDIT]  Custom thumbnail by Jose Negron, Mobile Nations   [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/b9",
        "http://mrmobile.tech/ba",
        "https://www.premiumbeat.com/royalty_free_music/songs/financial-district",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] Let me say this up front, I hate putting a question in a headline. Too often it's used as a cheap shortcut for easy clicks. But in this case, it's not just an appropriate question, it's the most important one. This is the Sennheiser PXC-550, and it's one of the more expensive travel headsets you can buy. What I want to know is, is it better than the Bose QC 35? The headset I've used as the benchmark for quality in 2016. I'm Mr. Mobile, let's find out. Sennheiser's reputation for quality is keenly reflected in this headset. Once you get past the flimsy carrying case that's not quite as nice as the one you get from Bose, the cans themselves are excellently made with black plastic done up in soft touch paint and framed by metal accents. The 550 looks fancier than the QC 35, it's adjustable headband sliders feel better made and there's a tech bonus too, the right side earpiece plays host to a touch pad that lets you control volume and track selection with a series of swipes. Also, there's no humdrum power button. Instead, you turn the 550 off and on by twisting the cans to their stowed or deployed position. It takes some getting used to but after a while, once you get into the flow, the coolness outweighs the slight inconvenience. In terms of battery life, the headset will last you about as long as the Bose will, which is to say forever. I've used it on trains, buses, cars, planes, and on walks to every Dunkin' Donuts in between and the only times the headset has fallen short of it's 30 hour battery claim are the times I forget to turn them off. You gotta get used to stowing them properly when you wanna save juice because as far as I can tell, there's no automatic power off. And how does it sound? Tremendous. Remember how blown away I was by the acoustic noise cancellation on the QC 35? The 550 is almost, if not just as, good. And it's smarter too, the CapTune app for Android and iOS lets you adjust how intense that noise cancellation is. It tells you things like battery level and what sound mode you're in and it gives you an EQ with some presets to play around with. Though those will only work on locally stored media. Now if you want, you can adjust the effect mode right on the headphones with the tap of a button and those work with all audio and your options are club, movie, speech, or off. I prefer the latter. The 550 kicks out nice even sound without the need of any audio effects. So what's bad about it? Well, that damn wind problem is no better on the Sennheiser than on the Bose. Wear these in a stiff breeze and the air over the microphones will make you feel like someone's blowing in your ear, and not in a good way. Also the headset is a little less flexible, tighter on the head than some others. And the otherwise lovely computer voice calls everything a phone, even if you pair it to a laptop or a tablet. - [Automated] Phone one connected. - [Michael] Oh speaking of phone calls, I don't really like them on noise cancelling headsets, I think the artificial side tone makes everyone sound far away and the experience here isn't much different. Callers also said my voice quality on their end wasn't particularly good, if there was any kind of background noise. Are those downsides enough to bring down the 550? Not at all. Look, it's expensive, even more than the already pricey QC 35, but to my ear, it equals or exceeds the Bose product in nearly every category. Now in terms of overall comfort, I still have to give the point to the QC 35. Then if I were choosing between the two, I'd still go for the Bose to save a few bucks and for the additional decibel or two in noise cancellation. But the 550 gets so much right in such a classy package that I can't give it anything but a thumbs up. If you travel a ton, and you've got the cash, snap these up, you probably won't regret it. I've reviewed almost as many headsets as smartphones in 2016 so if you're in the market for something less expensive, more flashy, or just plain insane, then check out Mr. Mobile's other videos on YouTube and remember to subscribe while you're there. Till next time. Thanks for watching, and stay mobile my friends. Huh?",
    "transcript_keywords": [
        "hate putting",
        "Bose",
        "headset",
        "noise",
        "noise cancellation",
        "Sennheiser",
        "headsets",
        "sound",
        "putting a question",
        "Mobile",
        "quality",
        "question",
        "battery",
        "cancellation",
        "front",
        "headline",
        "good",
        "phone",
        "expensive",
        "hate"
    ],
    "transcript_entity_values": [
        "Sennheiser",
        "Bose",
        "a ton",
        "Bose",
        "the QC 35",
        "550",
        "2016",
        "CapTune",
        "30 hour",
        "QC 35",
        "Mobile",
        "a few bucks",
        "YouTube",
        "Michael",
        "two",
        "EQ",
        "the Sennheiser PXC-550",
        "one",
        "Android"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "EVENT",
        "CARDINAL",
        "DATE",
        "PERSON",
        "TIME",
        "EVENT",
        "PERSON",
        "MONEY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}