{
    "id": "RSTNhvDGbYI",
    "title": "Old-fashioned rice cookers are extremely clever",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2020-01-15T15:25:09Z",
    "video_url": "https://www.youtube.com/watch?v=RSTNhvDGbYI",
    "category": "Science & Technology",
    "tags": [],
    "views": 2560354,
    "likes": 115862,
    "comments_count": 7813,
    "description": "You can support this channel on Patreon! Link below     Bet you didn't think a rice cooker was so interesting, did ya?  Links! Get your links! Hot, fresh, links! Technology Connextras (the second channel that stuff goes on sometimes):  Technology Connections on Twitter:  The TC Subreddit  Wanna see that rice cooker patent?   You can support this channel on Patreon! Thanks to contributions from viewers like you, Technology Connections can continue being as weird and unpredictable as it is. If youd like to join the cool people who bring these totally rad videos to you (Im hip and with it!), you can find out how at the link below. Thank you for your consideration!   And thank you to the following patrons! Yaniv, Francis Fisher, The War Academy, Conor Killeen, Jay, Dave Anderson, Noah McCann, Eric Hansen, Dane Peterson, Jeremy Kitchen, Audin Malmin, Adam D. Ruppe, Rafa Wiosna, Matthew Giraitis, Kevin Landrigan, Carl Yazbek, Logan Kriete, Hunter Schwisow, Matt Falcon, Kieran Cox, Eric Wood, Paul Williams, Brent LaRowe, Lurker239, Felix Freiberger, James Ryan, Lukas Komischke, h.drew foy, Jason Nevins, Jeffrey, BlancoGrande, Stephen Pick, Technicalleigh, John McLusky, Adam Coddington, Lolucoca, Steven Metcalf, Justin Talbot, Christopher Jett, SovietBear, Mike Mason, Techmoan, Kotanu, Christopher Luna, Paul Mills, Brian G. Shacklett, Chris Hartl, Andrew, Tony, Matthew Baron, Mark Critchley, Andres Plaza, Charlie Hankin, Craig Leverenz, Casey Kikendall, Sebi Jecklin, Warmo, The8TrackKid, Drew McClain, Michael Snowden, Ed Hall, Julian Rapoport, Christopher Bassett, Ryan Cozzubbo, Marcus Schwartz, Johan Schoeman, Matt Taylor, Patrick Musson, Lars JJ, Richard Lindsey, Kollin O'Dannel, Peek, blouerat, Robert Toth, Joseph Hill, Marc Ethier, Thijs Dortmann, Brady Brown, Stein Strindhaug, foophoof, Ernie Smith, Christopher Dickey, Mitchel J. Mullin II, Matthew Razza, Trix Farrar, Marco Anastasi, Pavlo Pravdiukov, Howard Kraut, Mike Bailey, Michael Bernstein, Kevin Strehl, Yona, neko, Grayson Lang, Jeffery Grajkowski, Eric Merrill, Stefan Berndtsson, Michael Sims, Christopher Leidich, Mike Friedman, Andr Waage Srensen, Sam Redfern, Tully, Chris LeChien, fussel, Corey A Hudson, EpicLPer, Luc Ritchie, Eric Romero, Ryan Hardy, Taylor Martin, thefanification, Ewen McNeill, Henrik Ripa, Albin Flyckt, Shane Zamora, Alex Ilyin, Andrew \"FastLizard4\" Adams, Avi Drissman, Phil Taprogge, Sam Witney, Jonathan Skowronek, Tim Grov, Pieter van der Eems, Brian Condron, Reto Jost, Vince Terranova, Andrew Montagne, David Scott, Mike Nichols, Brandon Enright, James Fialho, Christian Torelli, The Paul Allen, toasterking, Jason Brady, Jake Shep83, Nick Pollard, Manalope, Andy S, Robert, Johan Greefkes, Jacob Dixon, Rob Kefford, Benjamin A., Nathaniel, Michel Sievers, Colin, MrHammond, Aaron Rennow, Bee Jay, Countzero, Kodapan, Eli Krumholz, Guillaume Tremblay-Beaumont, Sha Nasti, Laria, Stephen Hinton, thegeoffreak, Elliot Clark, Bob Slovick, Jason Burgett, Jib Systems, Andrew Rosenwinkel, Grazer, Bob B, Mike Noe, Scott Rowland, Steve Kralik, Your name, Kirill Polstainen, Felix Winkelnkemper, BoostCookie, 98abaile, Charles, Sebastian Sparrer, Matt Mullett, Andreas Kuzma, Paul Moffat, Max, Alessandro Robert Nilsen, Ryan Benson, Neil Forker, Vincent Beelte, Johnni Winther, Mark Hesse, Nathan Blubaugh, lululombard, Armando Fox, Nelson, Angelo van der Sijpt, William Evans, VilleS, Anton Afanasev, Kilrah, Ray, Liam O'Flynn, Gideon Ritter, Oliver Lee, Lennart Sorensen, Mitch Radoll, Will Wren, Viorel, Reaghan Kekeis, lohphat, Vivian Pypher, Brandon Whiting, Scott Herron, Marlo Delfin Gonzales, Zachary Hazlett, Peter Stewart, Robin Johnsen, Nomad, Eric, Phia Westfall, Tom Rolfe, Jeremey Hastings, Mark Wayt, Matthew Reynolds, Arthur Robillard, Sonic the Anonymous Hedgehog, Lee Tustain, Ramon Gamez, Vaughn B., Breunie Ploeg, Braden McDorman, Julien Oster, Jake Hickman, Trae Palmer, Gary Hampson, Lennart Rosam, Chris Wallace, Matt Shea, Jason Baker, Galimaufry, Aaron Helton, Michael Holmes, Kevin Hollywood, Trey Harris, Peter Pfundstein, Wilhelm Screamer, Alan Boyd, Mat Stu, RYAN INGOGLIA, Charlycobra, Thomas Kolanus, William Kisley, Daniel Johnson, Potch, Reemt Rhmkorf, Robin Rattay, Bruce Justyn, Rae McIntosh, Justin D, Adam Zawisza, LordJakson, Triancia, Joshua Moncrieff, Max Barnash, Microfrost, Sinirlan, Mitch Schenk, Juan Olivares, Mike Bird, Emmett Ray, Michael Shaffer, Sputnik, Jason Spriggs, Danny S., Gregory Kumpula, Tom Burns, Daniel Pf, Yung Kim, John W Campbell, Matthew Jones, Slappy826, Steven Ingles, Robert Howcroft, Some Random, Jeremy Heiden, Garrick Kwan, Vince Batchelor, Peter Sarossy, Tracy Cogsdill",
    "description_links": [
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://patents.google.com/patent/US4315139A",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "I dont know about you, but I find cooking rice to be an extremely difficult task. Luckily somebody invented the automatic rice cooker and now all of my rice cooking problems have been solved! Hooray! Now, you might think that rice cookers are a pretty boring small kitchen appliance. But actually, theyre among the... well, OK... If were looking at what they *do* then yeah, heh this aint no toaster, thats for sure! But, while the device itself may seem pretty unremarkable, and indeed is, the principle by which it works is fascinating! Simply by exploiting one of the chemical properties of water, this device can tell when the rice has been cooked, and the result is a perfectly cooked batch of the worlds second favorite grain. Assuming you got the water to rice ratio correct, that is. So how does it work? Well, to find out, first we need to learn a little bit about water. As Im sure we all know, at sea level water boils at 212 degrees Fahrenheit. Isnt that just a delightfully easy number to remember? I dont know what the heck that is in Celsius, probably some silly arbitrary thing, but anyway that number isnt the whole story. You see, water doesnt just boil at that temperature. It *starts* to boil. See, if you got a pot of water on the stove, and you watch its temperature rise with a thermometer, well what do you suppose happens once it gets to boiling point? You can see the temperature steadily rising as it approaches, so you might think that once it hits boiling point the water will just *poof* disappear and turn into a big 'ol cloud of water vapor. But of course, thats not what happens. The temperature just plateaus, and it wont go any higher. But the stove (or hot plate) is still dumping energy into the water, so why isnt it getting any hotter? The answer is physics, and more specifically the principle known as the latent heat of vaporization. This is a fun concept important to many fields of study, from meteorology to refrigeration. Also known as enthalpy of vaporization, this is the amount of energy required to transition a liquid into a gas. And its a LOT more energy than just raising the temperature of that liquid (boiling of water starts to becomes audible) OK, what we need to understand here is how latent heat differs from sensible heat. Sensible heat is something like, oh I dunno 68 degrees? That's a a pretty sensible room temperature-- Ohhh, oh, Sensible, like can be sensed. Got it. (though it is still spelled \"sensible\") Sensible heat is the figure we can sense, or measure. The thermometer is looking at the sensible heat when it tells us how hot something is. But as the water (or any other substance) reaches its phase change temperature, adding energy into it will not raise the sensible heat. Instead, that energy gets absorbed by the molecules to free them from their liquid state, and that takes a heckuva lotta energy. (boiling gets louder) We dont need to be too worried about that extra energy right now. Well get to that when we tackle air conditioning and refrigeration. But what you need to know for the purposes of cooking rice is that liquid water cannot exist at a temperature higher than its boiling point. Dumping more energy into it will simply make it boil away faster. It will not make it get any hotter. So what does that have to do with cooking rice? Well, see, cooking rice is all about making water hot so that the rice will absorb it and the starches convert to the other... things and all that jazz. And that rice is cooked once it has absorbed all the water. You dont want to keep cooking it after that point or it will burn, and you dont want to not cook it long enough or youll have rice al dente which Im pretty sure isnt actually a thing. So, in an ideal world, wed have a way to tell precisely when that rice has finished cooking. And, thanks to latent heat of vaporization, we do! See, water cant get hotter than its boiling point. But cooked rice can. And once you know that little factoid, you can easily make a device which will cook rice to completion, and automatically stop. This is a very basic rice cooker. It cooks rice... and thats it. None of that fancy multi-function nonsense. Side-note - I actually have a nicer rice cooker with a whole electronic interface thing that can do fancy things like slow cook or steam vegetables but its got one of those gasket deals going on in the lid and frankly it gets really gross all the time. And its a pain to clean. Now Im not certainly someone who eats rice as a staple food but when I discovered that this cheap, basic unit had just a plain glass lid and both it and the bowl are dishwasher safe, I was like Life Changer! and bought it on the spot. Truthfully I prefer it to my fancier one by a large margin simply because it doesnt get gross and it cooks rice just as well, which is all I use a rice cooker for anyway. Plus it doesnt beep incessantly for 15 seconds when its done, so thats a nice plus. Sometimes basic is in fact better, but thats all down to your personal priorities and preferences, and Im sure you all tell me why my priorities and preferences are wrong! Anyway, this device is so incredibly simple and yet entirely automatic and I just love that sort of thing. At the bottom, youve got a round heating element with a little button thing poking up through the center. This guy is spring-loaded and is the heart of its automatic operation. The rice cooker has two modes: Cooking, and keep warm. Whenever its plugged in its in the warming mode. If we flip it over and take off the bottom, well see that theres a buncha wires. In the keep-warm state, current comes in through the power cord, and passes through this big resistor to limit the current before going through the heating element. The lever to engage cooking is attached to that button thing, and importantly it closes these contacts. This bypasses the resistor and allows the heating element to run at full power. In this case, its a mere 300 watts. This is after all a tiny little rice cooker. Also, this changes which of the little neon indicators lights up. Useful! Youll see that right now I cannot get the lever to stay engaged. Thats because the button thing isnt depressed. This serves as a safety feature to prevent the heating element from operating at full power if the pot were to be removed. Ordinarily the weight of the bowl would press down on it, but in this case I need to substitute my fingers. With it depressed, youll see that the lever will now stick in the down position. Whats keeping it there is a permanent magnet, which you can just barely see here. And this is where things get really interesting. The magnet is sticking to the bottom of the button, and its overcoming the force of a second spring inside the button trying to push it away. Which, luckily, it manages to do. But heres the thing about magnets. Get things hot, and suddenly magnets dont work anymore. Uh-oh here comes a Blanket Statement Abatement Alert! Magnets are confusing. Ferromagnetism. Paramagnetism. Curie points. Theres just so much that hurts my brain. So, please do not assume Im an expert here, cause Im not. Regarding this magnetic phenomenon Im about to describe, this is my very best interpretation from what Ive uncovered through looking at patents, a very rudimentary understanding of magnetic interaction, and also some forum threads where people were arguing about this. If Ive gotten something wrong here, please correct me in the comments. And also, please check to see if someone else has already provided a correction, thanks. All magnetic materials have whats called a Curie temperature, or Curie point. For ordinary ferromagnetic materials, once you reach this temperature they cease to be ferromagnetic at all. In the case of a permanent magnet, if you get it to the Curie temperature ... youve broken the magnet permanently. So now its a permanent not-magnet. But materials that are attracted to permanent magnets will regain their attraction once theyve cooled back down. This button thing is made of an alloy that has a Curie temperature just a bit higher than the boiling point of water. This allows it to function as a temperature-dependent kill switch. Thanks to the outer spring, its always held firmly in contact with the bottom of the pot, which ensures it and the pot are at nearly equal temperatures. So long as theres liquid water sitting in that pot, the pot itself cannot get hotter than water's boiling point. This means that the button remains magnetic, and the magnet is able to overcome the force of the inner spring, so the device stays in cook mode But, once the rice has absorbed all of the water (and / or once all the remaining water has boiled away) the energy being added to the pot by the heating element is no longer being absorbed as latent heat. Now, the pot can quickly start to exceed the boiling point of water. And once it gets past the Curie point of that little sensing button, the magnet is no longer attracted to it, so the spring overcomes the magnet and... *click* the rice cooker switches back to the warming mode. Now, I dont know about you, but I think this is some of the most amazing ingenuity out there. This incredibly basic device is not only exploting the physical properties of water, but also the physical properties of magnetism to automate the cooking of rice in an elegant and effective way. Sure, my fancier rice cooker may have some fuzzy logic and a microcontroller in there, but anybody can program an Arduino with some inputs and outputs. So this is much more interesting, at least I think so. These days, only the most basic rice cookers continue to use this method of automation. But, for decades this is just how rice cookers worked. Ive tried to find when exactly this method was first put into production, and short of looking through every rice cooker related patent out there, the answer isnt obvious. However, its been in use at least since the late seventies, having come across this patent. And you might be surprised to learn that rice cookers are a rather recent invention. When you consider that weve had mechanical refrigeration for over a century now, it can seem a little weird that it took until 1956 for the first automated rice cooker to appear on sale in Japan, produced by Toshiba. Those early rice cookers used a sort of double boiler to indirectly heat the pot. Everyones favorite source of knowledge claims that that went out of style in the 1960s but, citation needed. Anyway. Thats it! I hope you enjoyed this video. While I wouldnt necessarily call this device Automatic Beyond Belief! it is certainly among the most clever forms of automation out there. Even if I have to push the lever down. And of course, thanks to everyone supporting the channel on Patreon, with a special thanks going to these nifty people scrolling up your screen. CED part 5 is coming soon, so be on the lookout for it! For now, though... eat up! insensibly smooth jazz I dont know about you, but I find the teleprompter to be a little finicky today Their among well ok, if were looking at they d .. yeah no I dont like THAT take So, in an ideal world, ( makes weird noises as he checks his shirt ) So, in an ideal world It cooks rice. And thats it. None of this pbbbbttptt But, once the rice has absorbed .. bleuw I just noticed an error. Well try to fix it Materials that are attracted to permanent magnets will regain pbbpbpbppb (this one was excessive) Hey, it's me! The SPIRIT OF THE CREDITS! Usually, I'm the SPIRIT OF THE ENDSCREEN but the shoot went real well and there aren't many bloopers. So now you get to spend more time with ME!!! And I'm here to tell you that you're a pretty cool human! Well, and I suppose there could be some non-humans watching, too. You're all cool! Oh, wait, but y'all need to be able to read to see this part. Does that mean the SPIRIT OF THE ENDSCREEN can't talk to animals? Goodness isn't this an existential crisis? And so is reaching the end! AUGH!!",
    "transcript_keywords": [
        "rice",
        "rice cooker",
        "water",
        "cooking rice",
        "extremely difficult task",
        "temperature",
        "boiling point",
        "cooker",
        "cooking",
        "heat",
        "point",
        "cooks rice",
        "thing",
        "Curie temperature",
        "energy",
        "pot",
        "Curie",
        "magnet",
        "button thing",
        "button"
    ],
    "transcript_entity_values": [
        "Curie",
        "a mere 300 watts",
        "Celsius",
        "pbbpbpbppb",
        "two",
        "1956",
        "the late seventies",
        "decades",
        "These days",
        "Patreon",
        "Japan",
        "68 degrees",
        "15 seconds",
        "the 1960s",
        "Arduino",
        "first",
        "over a century",
        "5",
        "Toshiba",
        "Automatic",
        "212 degrees Fahrenheit",
        "second",
        "Curie"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "QUANTITY",
        "TIME",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORDINAL",
        "PERSON"
    ]
}