{
    "id": "rszK4_Pk6G8",
    "title": "NEW iPad Air with TouchID!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-10-21T16:18:50Z",
    "video_url": "https://www.youtube.com/watch?v=rszK4_Pk6G8",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iPad air",
        "iPad Air 4th gen"
    ],
    "views": 2435601,
    "likes": 63325,
    "comments_count": 4749,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Today we're unboxing the brand new fourth gen iPad Air, and it's pink! It also has touch ID on the power button. (calm bass music) The iPad Air starts at $599, it has a 10.9 inch liquid retina display, A14 bionic chip, touch ID on the power button, and has storage up to 256 gigs. It has support for Apple Pencil, Magic Keyboard, and the Smart Keyboard Folio. (gasps) here it is! Oh my good, look at this. Beautiful pink color. It's like a beautiful perfect rose gold, oh my gosh, take a look at this, just look at this. Look at this. Okay, look at this, look at this power button. Let's turn it on and set it up. Ooh, there it is, Apple, Apple logo. Oh, you're beautiful, you're beautiful, you're beautiful. I'm gonna place you right there with your new friends. What else is in this box? iPad Air instructional. Two Apple stickers. Got the USB-C 20-watt charger, USB-C cable. Have you guys seen this before? That focus is so fast, I'm losing my mind, so great! Wow, I just wanna keep looking at the back of it. This is so pretty. So the new iPad Air does come in five different colors, it comes in a space gray, a silver, a pink, a green, and a sky blue. Did I show you guys that I have the pink one? I'm just not sure if you guys remember that this is, I have the pink one. If somebody asked you guys what my favorite color is, I'm gonna give you just one guess, I wonder if you could figure it out. Okay, here we are! Use your fingerprint in place of a passcode or Apple ID for your purchases. Okay, we're setting this up right now. Man, do I wish this was on the new iPhone. This is hope for the future. Add another one. If I'm holding the iPad like this, then I probably would want my thumb. I never thought that registering my fingerprint would be so riveting. Oh my gosh, okay, added. Create a passcode, ssh. Shh! Look how freaking beautiful this is. The iPad Air does support the Apple Pencil, so let's open this up as well and then we also have some really fun accessories. We have the iPad Smart Folio Case and the Magic Keyboard. (gasps) (gasps) Touch ID, unlocked, pencil charging, I'm so happy! You want me to try Scribble? Okay. Scribble's one of my favorite features in the latest edition in iPad OS, so I'm gonna give it a little try here. Hello, I am writing. Okay, so there we go. Now let's go into delete. So to delete a word, you just scratch it out. And if you wanna select a word, you just draw a line or circle it. So you can tap and hold in the middle of the sentence to insert any new words, so try inserting a really new word to the sentence. Okay, oh god, I'm just deleting everything. Join characters or separate words by drawing a vertical line before or after any character. Look at this. So if you're using your iPad, and you wanna take a screenshot and then mark up that screenshot, you just go to the bottom corner, this will automatically take a screenshot and then this will let you start marking this up. Hello. It feels just like magic. Another cool features is if you're at the lock screen and you turn it on, and you press your Apple Pencil to the lock screen, this will instantly bring up a blank note so you can take a very quick note, an instant note. Instant note. Okay, now let's open up these accessories. This is the iPad Smart Folio and these come in all of the new colors to match the iPad. This was not planned, but I think I matched the cover. I mean, I could not have picked a more perfect matching shirt if I tried. Whoa, whoa! I love this color so much. Okay, look how nice this looks. I am ready for doing iPad things, look at me, ready. Ready, who's ready, me. So that's the Smart Folio, it's really nice and light, so I feel like this is a nice little edition if you're just kinda slipping this into your bag or something like that so that you can protect your iPad, both sides, looks great. So happy. So now let's open up the iPad Magic Keyboard. This is my favorite thing ever. I did a pretty in-depth review of this, I'll put links in the description if you wanna check that out, and also a follow-up video where you guys asked me questions about it and I answer them, so I'm not gonna be going too in depth about this thing, but just let me tell you this thing's amazing. The best thing about this is it has pass-through charging, so you don't have to plug it into the actual iPad, there is a little USB-C port right on the side that will let you charge it. Look at how small this is, wow. Nice quality, very nice type. And over here, this is the USB-C port that I was mentioning. This allows for pass-through charging, so you can plug your USB-C right into here and this will allow your iPad to charge without having to plug your iPad in directly. Let's put you in your new home. Oh, wow. This is really, really nice. So I have been using the 12.9 inch iPad Pro, which is a much, much larger display and a much larger Magic Keyboard Case. This is actually the first time that I'm seeing the smaller version of the Magic Keyboard, it's very, very nice because this, this is huge. Look at this size difference. The camera cutout is made for the iPad Pro, but it still fits and it works with this, so that is great news for anybody who's interested in checking out one of these Magic Keyboards. I also like, this does have a back lit keyboard which is really nice, and you can tell like the space bar looks a little bit smaller, the return key is a little smaller, shift keys, so they were able to pretty much still get the same full-size keyboard with just making some of the keys a little bit more compact. So this is definitely something that I'm very excited about. My babies. \"Justine, when are you gonna have kids?\" I got two right here. I've been wanting to test out this app, this is the DJ app. I haven't tried it yet, so we're about ready to go through the tutorial here to learn how to be a DJ. This is really cool because this is gonna be taking advantage of the A14 bionic chip which is incredibly fast. Tap here to play deck one. (calm music) (record scratches) (funky music) Oh my gosh. Yes, this is going well, this is going really well. (record scratches) How's that? I mean this is kinda crazy, like I'm real time getting rid of drums, getting rid of vocals. Right, this is pretty cool. I can't keep up I can't keep up Look at this. Hey Dylan Francis, you see this skill? This is really fun, and the fact that you can be doing all of this real time and live like completely just taking all of these songs, removing vocals, removing drum tracks, and basically becoming a DJ right here on your iPad, I think that I might need a little practice though, so stay tuned. Maybe I'll do a live show on Twitch. (children cheer) What else do we have here, what's this? Flower. Oh, this was originally released on PlayStation. Actually I remember this, this is really cool. (calm music) Go, go be free, be free. This is so relaxing. Okay, so that's running, amazing. Pixelmator Photo. \"ML Super Resolution, magically enlarge photos \"using state of the art machine learning.\" Okay, this is already a very large image. Okay, it's almost done, it's 100%, whoa, whoa! I don't think they're gonna be able to see it, it's definitely sharper. This was already a pretty sharp image so it didn't have that much, I think we need like a low-res image. This is definitely a photo that could use some touching up, what was I thinking about this makeup? I have eyeshadow, the same color eyeshadow all over my entire eye. I didn't know any better. Okay, let's do the super resolution. Really didn't help out this face much, still same face, although yeah, look at that. Do you guys see that, can you see that? Made it a much cleaner image around my face. It sharpens it but it also seems like it kinda takes it and sort of paints it in, so it's not necessarily just sharpening. Let's see what kind of goodness, look at that, okay, this is a good demonstration, look at this. Pixelated, cleaned up. Can you see it? Wow. Let's check out these jeans. Check out these jeans. Cleaned up right here around the edges. Nice little auto-color, look at this, look at this. Look at my skin tone, I got a nice tan back, took out a lot of the blue. Let's try Call of Duty Mobile. I'm not gonna use the controller, I'm just gonna basically use the iPad and see how this works. I'm getting my bearings, I've never played this on iPad before. (gun shoots) Hey, hey, come here! You think you're gonna hide from me, you think you're gonna hide from me? Oh, you guys are both here now, okay, well guess what, guess what? Uh-uh, absolutely not. This game honestly makes me just go crazy. (gun shoots) Guys, look how good I'm doing. Is it because everybody else is terrible? (gun shoots) - [Game] Friendly hunter killer drone deployed. - I just wanna say that our team won. First time I've ever played on iPad. My KD was incredible, look at this. Nine kills, zero deaths, six assists. Sign me up for the pro leagues. Already talked a little bit about Scribble but it's so fun because you can do all sorts of things. So we're gonna go in here. The first thing I wanted to show you is when I choose this, this little A pencil right here, this will automatically take the words that you're writing and turn them into text. So this is me writing something. I also like that I can use the pencil and I can write some text. I can then select that text and then paste it into a Word document, it'll take my handwritten text and turn it into actual text. Subscribe to me please. Tap it, copy as text, and paste into pages. You can also do Smart Shapes, so if you draw a shape and then hold, it'll automatically make you a circle, oops. (laughs) Thank you guys so much for watching, I'm looking forward to testing this out further. If there's anything you would like to see me test or try on the new iPad Air, please leave it in the comments below and I will see you guys in the next video, bye. My precious. It's funny, I always say it like, my precious, I've never even seen the movie. It means nothing to me. (calm piano music)",
    "transcript_keywords": [
        "iPad",
        "iPad Air",
        "Magic Keyboard",
        "iPad Smart Folio",
        "gen iPad Air",
        "fourth gen iPad",
        "iPad Magic Keyboard",
        "Apple Pencil",
        "Apple",
        "Keyboard",
        "Air",
        "Magic",
        "Smart Folio",
        "nice",
        "Smart Keyboard Folio",
        "guys",
        "iPad Smart",
        "power button",
        "Magic Keyboard Case",
        "Pencil"
    ],
    "transcript_entity_values": [
        "zero",
        "the iPad Pro",
        "these Magic Keyboards",
        "iPad",
        "one",
        "KD",
        "USB-C",
        "iPad Air",
        "Call of Duty Mobile",
        "Apple",
        "the Smart Folio",
        "the Smart Keyboard Folio",
        "Justine",
        "Two",
        "256",
        "10.9 inch",
        "iPhone",
        "100%",
        "PlayStation",
        "Magic Keyboard",
        "Nine",
        "the Apple Pencil",
        "Magic Keyboard Case",
        "ML Super Resolution",
        "Twitch",
        "five",
        "the Magic Keyboard",
        "A14",
        "Apple Pencil",
        "six",
        "iPad Air",
        "two",
        "12.9 inch",
        "Pixelmator Photo",
        "20-watt",
        "the Magic Keyboard",
        "Smart Shapes",
        "iPad Pro",
        "first",
        "fourth",
        "Dylan Francis",
        "USB",
        "First",
        "599"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "LAW",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "MONEY"
    ]
}