{
    "id": "rU0f4kmBpX8",
    "title": "TikTok’s Scandal Isn’t Over.",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-06-21T00:44:12Z",
    "video_url": "https://www.youtube.com/watch?v=rU0f4kmBpX8",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "TikTok",
        "ByteDance",
        "China",
        "social media",
        "algorithm",
        "tiktoks",
        "tiktok data",
        "tiktok china",
        "tiktok U.S.",
        "Oracle",
        "cloud",
        "For You",
        "for you page",
        "Meta",
        "facebook",
        "instagram",
        "tips",
        "scandal",
        "problems",
        "tiktok problems",
        "tiktok safe",
        "tiktok security",
        "hacking"
    ],
    "views": 508827,
    "likes": 30787,
    "comments_count": 841,
    "description": "Get the right tool for the job at    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 it is so so so important 0:07 TikTok data scandal is back 1:19 Meta VR headset prototypes 2:14 GPU prices + stock healing 3:12 iFixit 3:47 QUICK BITS 3:54 Ryzen 7000 Sept 15? 4:23 AI NPCs could have feelings 4:55 Ricochet anti-cheat still good 5:18 Pigment could reclaim gold 5:46 Doom on a LEGO brick  FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://iFixit.com/TechLinked",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/68awf",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- Tech news doesn't matter, is what a ding dong would say. (laughing) That is not me. It seemed like Americans were done freaking out about the fact that unreasonably popular social media app TikTok is owned by Chinese company ByteDance. But, just like Emperor Palpatine, somehow, \"the controversy returned.\" On Friday, TikTok announced that the data of users in the US is now being stored on Oracle's American cloud servers by default. But, on the same day, Buzzfeed News reported that, according to leaked audio from 80 internal meetings, ByteDance employees in China had repeatedly accessed US user data. The report conflicts with TikTok's claims, \"that sure, backups of US user data were stored outside the US, but they don't look at that data.\" And they certainly don't give it to the Chinese government. They wouldn't want it anyways. They're super chill. Responding to the report, TikTok admitted that yes, of course some high level admins sometimes have to access that data. But, the company's goal is limiting the number of employees who have access to user data and the scenarios in which data access is enabled. So, instead of picturing a bunch of scary CCP stooges reading your DMs. Picture like, ah, two or three guys. They're really good guys. You should all go for lunch sometime. Meta CEO, Mark Zuckerberg has shown off a cornucopia of prototype VR headsets as a demonstration of the advances in technology necessary for Metaverse tech to pass the visual touring test. Which I'm guessing is a test that makes it hard to distinguish virtual reality from reality, reality. Is Zuck talking about VR ever going to not be creepy? I feel like he wants to suck me into the virtual world for nefarious purposes, or just because he wants a friend. Ugh. Anyways, it is actually kinda cool to see the different avenues that the company formally known as Facebook is pursuing. Even if the goal is obviously to get people to spend too much money on purchasing digital versions of designer clothes by Balenciaga and Prada. Which they announced today. - [Camera Person] (Ugh) - Guys, they're even more overpriced than the real stuff. Burying your money in the ground would be more financially advisable. This is not financial advice, by the way, just Tech News. And more good news for PC builders as German enthusiast site 3DCenter has confirmed that prices of current gen gaming GPUs in Germany and Austria have on average come back down to MSRP after spiking as high as 318% back in May, 2021. Ugh, I remember that time. A lot of good people didn't have GPUs. Radeon RX 6000 cards have actually dipped around 8% lower than MSRP. GeForce RTX 30 series cards are sitting at around 2% above. And, the forecast actually is continuing to look rosy. With Crypto miners, continuing to sell off their GPUs and defunct system builder, Artesian Builds. Starting to auction off thousands of PC components, which had never had the right to in the first place. I'm just, I don't know. For those who worry they might never turn their graphic settings up again, lift your eyes to the horizon. It's Gandalf, and he's got a ton of GPUs. They're all riding horses. I don't know how he got them on there, but wow. Now it's time for quick bits brought to you by iFixit. Maker of compact toolkits with all the essential bits you need to fix your electronics. From mini kits, with 16 bits. To full repair toolkits to start your repair business, maybe, go getter. iFixit has you covered. And they've also got over 70,000 repair manuals with photos and step by step instruction. And they're making more of those through partnerships with device makers who are finally getting on board for the whole right to repair thing. It's great! You can work worry free with quality parts backed by iFixit lifetime warranty. So, fix your stuff today at iFixit.com/TechLinked. Quick bits are the key to knowledge and knowledge is the key to feeling super smart and better than other people. Leaked photos of an AMD presentation indicate that Team Red is planning to launch their first Ryzen 7000 processors and AM5 motherboards on September, 15th. They're supposedly pretty good compared to Intel's 12th gen chips, but rumors have also pointed to Intel releasing their 13th gen Raptor Lake processors in the second half of 2022. Which I'm pretty sure includes September. Fingers crossed for another global crisis to not hit before that happens. We've had quite enough of those, thank you very much. After a Google engineer sparked a debate over AI Sentis last week. A \"techno philosopher\" has told PC Gamer that he believes even video game NPCs could one day be conscious. In which case they would have real lives and deserve rights. Okay, counterpoint, what if we intentionally don't make NPCs conscious? Since they are currently being subjected to constant virtual genocide and shooter games. We'd just turned down the consciousness dial when we make those ones, right? If we could, it makes sense? Speaking of shooters. The developers of Call of Duty's anti-cheat software, Ricochet. Have unveiled the latest trick War Zone is playing on cheaters. Making their guns disappear. Oh, maybe they could get into some cheaty fist fights, nope. They take their fists away too. After all, if your hand causes you to sin, chop it off. A little excessive for real life, but just add \"in a video game\" to the end, and actually is pretty reasonable. Recycling electronics is notoriously difficult which is especially sad in a world, swimming in them. But Japanese researchers have discovered that Prussian blue, a synthetic pigment used by artists and scientists, because of its ability to trap metal ions. Can extract gold and platinum from e-waste much more efficiently than current methods. Meaning we could, maybe ease back on the digging so deep down into the earth thing. You know, there could be bowel rocks down there. We don't know. And humanity's great project of running Doom on literally everything has reached a new milestone. Modder James Brown, has created a LEGO brick with an embedded monitor on which he has managed to run a ridiculously blurry instance of the classic shooter game, at 72 by 40 resolution. But pixels don't matter. It's what's in here that matters. And in here, I know we're gonna be able to run Doom on the surface of the sun, one day. We'll get there. And we have gone to these end of this episode. So come back on Wednesday for more Tech News which you can watch on any dang screen you want. Come on, get creative. (Clapping) Pew, splash, some paint.",
    "transcript_keywords": [
        "ding dong",
        "user data",
        "data",
        "Oracle American cloud",
        "Chinese company ByteDance",
        "Oracle American",
        "TikTok",
        "Tech",
        "Emperor Palpatine",
        "user",
        "good",
        "GPUs",
        "bits",
        "repair",
        "back",
        "Chinese",
        "Chinese company",
        "data access",
        "guys",
        "media app TikTok"
    ],
    "transcript_entity_values": [
        "Buzzfeed News",
        "AI Sentis",
        "May, 2021",
        "Germany",
        "TikTok",
        "GeForce",
        "Intel",
        "September, 15th",
        "three",
        "Mark Zuckerberg",
        "Ricochet",
        "around 2%",
        "40",
        "Balenciaga",
        "US",
        "the same day",
        "Gandalf",
        "iFixit",
        "Gamer",
        "ByteDance",
        "Google",
        "Oracle",
        "Artesian Builds",
        "over 70,000",
        "last week",
        "Palpatine",
        "Prada",
        "13th",
        "War Zone",
        "Japanese",
        "American",
        "72",
        "around 8%",
        "Zuck",
        "80",
        "Prussian",
        "Friday",
        "Metaverse",
        "Austria",
        "China",
        "September",
        "Radeon RX 6000",
        "318%",
        "thousands",
        "Chinese",
        "first",
        "AMD",
        "Ryzen 7000",
        "16",
        "Facebook",
        "two",
        "Tech News",
        "the second half of 2022",
        "James Brown",
        "German",
        "Wednesday",
        "12th",
        "Call of Duty's",
        "30",
        "LEGO",
        "one day",
        "Crypto",
        "Team Red",
        "VR",
        "VR",
        "Americans",
        "CCP",
        "today",
        "Meta"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "GPE",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "EVENT",
        "NORP",
        "NORP",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "NORP",
        "DATE",
        "ORG",
        "GPE",
        "GPE",
        "DATE",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "NORP",
        "ORDINAL",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "NORP",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "NORP",
        "ORG",
        "DATE",
        "ORG"
    ]
}