{
    "id": "rvmnc9K1sQc",
    "title": "Does It Suck? - Strange Neck Speaker",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2015-07-23T21:11:33Z",
    "video_url": "https://www.youtube.com/watch?v=rvmnc9K1sQc",
    "category": "Science & Technology",
    "tags": [
        "does it suck",
        "unboxtherapy",
        "favi bluetooth",
        "bluetooth speaker",
        "bluetooth speakers",
        "wireless speaker",
        "speaker",
        "speakers",
        "unbox therapy",
        "tech",
        "technology",
        "review",
        "bluetooth",
        "portable",
        "unboxing",
        "bluetooth speaker review",
        "portable bluetooth",
        "android",
        "portable bluetooth speaker",
        "speaker review",
        "sound",
        "amazon",
        "wireless",
        "portable speaker",
        "portable bluetooth speakers",
        "best portable speaker",
        "Android (Operating System)",
        "Audio",
        "Mobile",
        "apple",
        "samsung",
        "iphone"
    ],
    "views": 1475650,
    "likes": 27695,
    "comments_count": 1397,
    "description": "FAVI Boomerang Bluetooth Speaker -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/1UCalhd",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Clappy McClapper 'So they say' What's up guys Lou here back with another episode of \"Does it Suck?\" this is the new show here on Unbox Therapy This is called the boomerang mini - I know nothing about it Crazy stuff shows up here sometimes And I just gotta.. Check it out and find out if its any good This one has me skeptical though If you look at the image on the front of the box it shows A speaker with a phone but then it also shows it around somebody's neck here Now that had me wondering Why would you put something like this around your neck When you could use a cool invention called...headphones You know That go right on your ears Who knows? I don't know. I'm going to be checking it out. I'm going to be testing it out That's the point of these videos So it's the Boomerang mini wireless surround sound for smartphones Featuring bluetooth and NFC Plays with iPhone...Plays with Android Not works with...Plays with Be careful who you play with... You can see the device fold up for easy storage But they do recommend that when you carry it around that you put it around your neck. So this is going to be really interesting. Now our Boomerang mini here is outfitted much like a fine sports car With the yellow and black coloring Now the first thing that I notice here is the weight It has fairly decent weight to it In audio can be a good thing You have some controls here: On/Off switch, auxiliary port Auxiliary port...Oh so you can put in an analog source And a USB connecter for charging it up It is NFC capable At least it has a little NFC sticker there... Then you have tiny, little, auxiliary cable and a charging cable It should have a little bit of a charge on it... Is there a light? Beep Okay Lets see if the NFC function works, lets do that first hello Anybody home? A.J? Jack... The NFC sticker is there, but does that mean... that the NFC is there? Like this? Wax on wax off NFC were are out OH! Got it! Okay works a lot better when ou hold the device up OU! Connected baby Okay! You just kind of strech this out Now that's kind of cool right? Like if you If your main media device is your phone It's like a stand too I don't know put this uh on the table when your eating lunch or something? That's usefull Does it sound good? Okay here we go I'm gonna point it at me because like that's the way I would be using it I mean it's not okay lissen I've heard better portable speakers And maby the most important thing your getting is the ability to put it around your neck Check I mean that's fashion forward Little thigh Haha Mabe my neck is a little thicker than most but it's a little thigh Oh that's very odd Feeling having the sound Neer my ears but not on it's like when you have your headphones on but there not on your ears The new age boom box Got the kids at school just doing this way instead No this is too thigh for my neck You know it's a little bigger than your average Bluetooth speakers I guess but It's a stand as well I mean it certainly got more low end than your phone speaker does Sitting in the cafeteria this is a cool way like... Setup a little YouTube playlist some Unbox Therapy video's of course And you and your friends sit around and all the sudden that becomes a social Kind of situation instead of just having your earbuds in How much this go for? 60 bucks Mmm... You can get a better speaker for 60 bucks Does it sucks? It doesn't suck Rechargable battery build in Auxilery port NFC a lot of them don't have NFC There's an iPad version as well (tablet version) Witch of course stretch larger. It's gonna be a little bit louder A bizzaro device Let's be honest Quite bizzare especially the around the neck part Tech fashion Taking it to the next level here on Unbox Therapy It dosent suck it's not the best. There you have it Your second episode of ''Does It Suck'' Stay tunned, stick around, leave a \"thumbs up\" if you enjoyed it thanks always for watching and I'll catch you on the next episode.",
    "transcript_keywords": [
        "Crazy stuff shows",
        "guys Lou",
        "Lou here back",
        "Crazy stuff",
        "NFC",
        "stuff shows",
        "Clappy McClapper",
        "boomerang mini",
        "Unbox Therapy",
        "neck",
        "shows",
        "NFC Plays",
        "Lou",
        "Crazy",
        "NFC sticker",
        "put",
        "Auxilery port NFC",
        "boomerang",
        "Plays",
        "Suck"
    ],
    "transcript_entity_values": [
        "Featuring bluetooth and",
        "Boomerang",
        "Neer",
        "Clappy",
        "Mabe",
        "A.J",
        "USB",
        "first",
        "OU",
        "strech",
        "NFC",
        "Jack",
        "Lou",
        "second",
        "Rechargable",
        "Auxilery",
        "iPad",
        "YouTube",
        "60 bucks",
        "Tech"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "GPE",
        "PERSON",
        "NORP",
        "PERSON",
        "PERSON",
        "ORG",
        "ORDINAL",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG"
    ]
}