{
    "id": "rxBCPglhJes",
    "title": "What is it *REALLY* like owning a Rivian? - Time to spill the dirt...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2024-06-22T13:41:00Z",
    "video_url": "https://www.youtube.com/watch?v=rxBCPglhJes",
    "category": "Howto & Style",
    "tags": [
        "Rivian review",
        "Rivian R1T",
        "New rivian",
        "Rivian Truck",
        "Electric Truck",
        "Cybertruck",
        "Tesla",
        "Ford lightning",
        "Best electric truck",
        "is Rivian Good?"
    ],
    "views": 1021434,
    "likes": 34949,
    "comments_count": 1635,
    "description": "Get a new Rivian and 6 months of free charging on the Rivian Adventure Network HERE:  What is it REALLY like owning a Rivian R1T? Built ready, go freely with the ultimate 3-in-1 portable mobile power solution: Anker 3-in-1 Power Bank (5,000mAh):  Anker 3-in-1 Power Bank (10,000mAh):  and Thanks to Anker for sponsoring this video. #Anker3in1powerbank  My truck is one of the first 2000 Vehicles that Rivian ever made. And its held up surprisingly well. I have some issues with dirt collecting under the bed. (It gets caught between the tailgate and the bed itself, as the tailgate opens and closes.) But other than that it is a beast of a machine. And super fun to drive.  Get tires shipped directly to your door with Trailbuilt OffRoad:",
    "description_links": [
        "https://www.rivian.com/configurations/list?reprCode=ZACK1594426",
        "https://shop.anker.com/Y33UHq",
        "https://shop.anker.com/Rczsc8",
        "http://team.trailbuiltoffroad.com/jerryrigeverything"
    ],
    "transcript": "It's time to answer the question of do I regret buying my Rivian after 2 years and 22,000 miles? There's also how long have my tires lasted, spoiler alert, not very long, how much money I've saved on gas, and what damage I've done to the truck myself. There's a lot to go over. This video is sponsored by Anker, but more on them later. When I bought my Rivian 2 years and 22,000 miles ago, I came with a Bunker's 175,000 mile warranty, which gives me a very solid worry-free cushion of time. Tires, however, aren't included in that warranty, and mine completely kicked the bucket after about 21,000 miles, which is about half the distance I was getting with my old Tacoma. They could have lasted a tad longer if I had rotated them correctly. Rivian suggests rotating them every 7,500 or so, but without the oil changes or other reasons to bring the truck into the shop, I just kind of didn't. My new tires are Wrangler Duratrac RTs that I had shipped directly to my house from Trail Built Off-Road. This video is not sponsored, but you can tell them I sent you. Street tires also would have lasted much longer if I was into that kind of life. The reason tires need to be rotated is that the front tires handle most of the braking or regen, and in conserve mode, the front tires also do all the driving, which means when you add in the road friction of steering a 7,000 pound truck, the front tires just take way more abuse than the rear tires, which is why you got to rotate them around. These Duratracks cost about $1,700, about the same as the Pirellis that shipped with the truck, but the Duratracks have slightly more tread and same load rating and also a slightly lower max top speed. So I'll just have to keep my time spent at 110 miles an hour to a minimum. Instead of going to the shop this time around, I had Rivian Service come to my house to mount and balance the tires to see how it all worked. Personally, I've had a suspicious feeling that the Pirellis, the same tires mounted to my wife's Tesla, just don't last all that long. They are great tires, super grippy, but I'm hoping these Duratracks last longer because tires are expensive. These are still 3peak, so I can continue my off-road snow covered lifestyle here in Utah, and the metal weights we are adding to the inside of the wheel help with balancing so the wheels don't vibrate at high speeds. Having Rivian Service come out to mount and balance my tires isn't included in the warranty and ended up costing about $100 a tire. $100 is pretty expensive compared to a normal shop, but it might be worth it depending on how much you don't want to sit in a waiting room or be without a truck for a day. And it's nice that Rivian even has a mobile service option with the capability. One thing that was covered under warranty was my bed cover, which if you remember, broke within the first thousand miles of owning my truck. About 6 months ago I got the replacement cover installed at the service center, which is about an hour from my house. And thankfully Rivian again acquiesced to my request to bring a camera and see how the repair was done. A little coil gun warms up the bolts to soften the Loctite, and then the whole rear seat comes out. You'll notice that behind the seat is one of the 17 different control modules around the truck. These are all being phased out in the new refreshed Rivians that are rolling off the manufacturing lines. Rivian has consolidated the 17 controllers down to 7 to save time and money. It's pretty wild that the whole truck has to come apart just to replace the tonneau cover. Hold on to that one so it doesn't drop into the abyss of the truck. The 4 bolts that are holding in the back of the cassette are one-time use bolts. And I didn't know these existed, but they have like a rubber built-in ring around the head of the bolt that keeps the water out. And once we remove those bolts, we have to use the new bolts with new waterproofing to secure the new cassette. We have the old tonneau cover next to the new tonneau cover, and the way it works is actually surprisingly simple. There's a series of slats inside of this box that are pressed upward with springs, and a little motor rotates some gears to spit them out horizontally over the truck bed. The problem though is that the springs on the old tonneau cover weren't strong enough to push the slats upwards so they would spit out evenly on either side. The gears would get misaligned, it would bind and stop working. The solution Rivian found is even more simple. They simply added another spring on the underside. You can see the old version has 2 springs, while the new version has 3, hopefully providing enough upward force on the slats to keep everything working efficiently. Now we got to get back in place. Tonneau cover's in place. Before we put the bed panels back on though, I thought this was interesting. So this is for the air compressor, and it's actually a muffler so that the air getting released and the air getting sucked in is quieter. The air compressor is down in this hole. And over here we have the 120 volt wiring for the outlet that's here in the bed. It's always fun to see how things work from the inside. Alright, we are going to run the tonneau cover for the first time calibrating it. These rails are still loose right now so we can make sure that everything's squared up after this extends itself. See if it works. That's awesome. Going back in. It's crazy that each one of these little slats goes into that little cassette and just gets like stacked on top of each other very nicely and very conveniently in that little box which is bolted in from the back side with 4 bolts on each corner. It's been about 6 months since the repair was completed and the cover hasn't broken yet so thumbs up for that. So if you remember, I personally accidentally broke the lip off of my tailgate, and apparently there's been some subtle redesigns of the back plastics. Namely this lip right here, which doesn't exist in the first version. But then also we have beefier clips here in the bottom with some adhesive along the curve. My truck is one of the first 2,000 Rivians ever made and I knew when I bought it that there would be some risk and some growing pains with the new company. But I'm glad that these little revisions are retroactive and I can still take advantage of them when I need new parts. And it's nice I can take advantage of the little improvements that happen along the way. Now that the tonneau cover is replaced, we can start on the windshield. A few days after buying my truck, my windshield cracked and like a month later it cracked again. I have a giant deeper groove running through the entirety of my windshield and it's been that way for about 2 years. This was cracked by two different rocks on two different occasions. Utah has quite a lot of construction going on and as we know, glass is glass. Cosmetic defects don't bother me a whole lot, but it is time to get it swapped out. In order to remove the windshield, we basically have to take the whole front end apart. These pieces of trim, which are apparently held in place with magnets. Turns out the windshield replacement is rather intense, but that's good news for us since again we get to see how all the internals are exposed. We don't have to remove that to take out the windshield, but it only took us a couple of minutes and we get to see everything inside. We have the rear drive unit way down there and I think this part is really cool. So you know you have the charge port right here on the side of the Rivian. The larger cables are for the DC fast charging and then the smaller cables for the regular, you know, wall outlet. We also have the two 12 volt batteries, the air filter, and then a giant radiator down here which helps cool the battery and the motors. Always fun seeing how things work, but let's get back to the windshield. The windshield wipers do need to come off along with the inner A pillar trim and the rear view mirror with all the driver assistance cameras. Up here underneath the windshield we have the rain sensor. We have the rear view mirror mount. We have two cameras here and here. And then we also, which I didn't know this had, a heater that heats the surface of the glass over top of the cameras so that no snow or ice accumulates. And there is a secondary heater right here that runs along the bottom of the windshield and heats up the glass to help with defrosting. And finally, a really thin wire is slipped between the glass and the truck to slice away all the watertight adhesive holding it in place. And with how thick and strong the adhesive is, a lot of brute force is required. With the glass removed, the extra adhesive is scraped from the frame and the electronics are transported over to the new piece of glass. Thick black new adhesive is applied in one continuous bead so there won't be any gaps in the waterproofing. These are alignment pins to make sure the windshield gets in the right spot. These are standoffs to make sure that the windshield sits a certain distance from the vehicle. And with some large suction cups, the new windshield gets dropped into place. The adhesive has to cure for about a day and the cameras need to be recalibrated, which is all part of why the glass is so expensive. This particular repair, which is unavoidable, costs about $1,800. The only thing that's broken in the past two years that's my fault and that I'm not going to fix is the tailgate. I accidentally left the ball on my hitch a tad too high one time after towing, and I lowered the tailgate right down on top of it. That is my bad, but I don't feel bad. I use my truck as a truck hauling horsepower, actual horses, horse poop, and mechanical horses. My wife let me buy the nice truck and it's only fair that I run her errands as strange as they might be. The interior has no wear issues. The exterior charge port doesn't latch quite right, but I'm sure I could get that adjusted if I ever brought it into a shop. You can see the paint chip around the upper edge as it comes into the closed position. But honestly, with about 150,000 miles still left on my battery and motor warranties, I'm not worried about much of anything. One thing Rivian has not fixed is that the wireless charger here still tries to juice up my tape measure. I'm not too worried about it though because I have an Anker 3-in-1 charger in my center console. Anker for good reason has been a channel sponsor for a while now. Nobody does mobile charging better. These 3-in-1 chargers have a built-in AC plug, power bank, and USB cable, so it's easy to carry around if nothing gets lost. The small ones have 5,000 milliamp hours and the larger one are 10,000 with 30 watt fast charging, giving an iPhone 15 Pro a 50% charge in just 25 minutes. As a fun fact, I would need about 3,000 of these to match the battery that's underneath this truck, but the battery underneath my truck wouldn't very well fit in my pocket. The USB-C cable doubles as a little handle and can withstand 10,000 bins, and the same cable can be used to recharge the power bank. If you have a friend who needs to juice up at the same time, there's an open USB-C port for charging multiple devices at once, or as a pass through to get your phone and power bank charged at the same time. So if you need a new portable charger, it just makes sense to get it from the number one mobile charging brand on the planet, Anker. I'll leave a link down in the description. When I first got the truck, I thought that the gear guard was a gimmick, but I actually used the built-in cable lock all the time to secure the off-road wheelchair we built, among with securing some other things we build that we'll have to chat about at a later date. As for the dirt collecting underneath the bed, I found it quite easy to remove. This is where the dirt was falling down and accumulating between the truck bed and the tailgate. Getting caught in the bumper and the carbon fiber armoring around the motor. Anytime I would haul gravel, dirt, or horse manure, small souvenirs would get caught underneath. All you see here is what's been accumulating over the past two years. And there is a lot. Rivian definitely designed the R1T as more of an adventure truck and less of a work truck, but here I am using it as a work truck. Cause it's collecting dirt. You and me both want to know the answer to that. It's definitely something to keep in mind if you plan on using your truck bed as a truck bed. How much money have I saved by driving an electric truck by not having to buy gas? And the answer is not a whole lot. With gas being as cheap as it is right now, if we were to assign a hypothetical 20 miles a gallon, similar to what a gas powered truck this size might achieve, I would have used about 1,100 gallons worth of fuel over that 22,000 miles, which would have cost 3,800. Now I have solar on my house, so my electric miles that I've driven have arguably been free. But it would take quite a long time to offset the price of this truck in just gas savings alone. Driving for free is pretty cool though. There's also no oil changes, which has saved me an additional few hundred bucks. That savings though is offset by electric vehicle registrations, costing more than gas powered vehicles. Uncle Sam needs to recoup the money they're losing by EVs not buying gas, which is totally fine with me. EV owners should help pay for the maintenance of the roads just like every other vehicle. And pretty much every state at this point has those special EV registration fees, not just Utah. If I had to pick just one word though to describe my experience over the last two years, it would be fantastic. The truck is better now than when I purchased it. The nice thing about so many features of the truck being software related, the truck I own now is completely different than the truck I bought two years ago. They've completely updated the information screens, giving me all the nerdy power graphs I wanted on day one. I do wish there was some numerical data, you know, watts and torque, to go alongside the visual animations, but I'll take what I can get. The exterior cameras now double as dash cams, recording everything that goes on around me. It does fit two car seats pretty well in the back seat, and I guess if we need three there's always the gear tunnel. Honestly, I was pretty impressed with this truck two years ago and it has just kept on getting better. Now we have the Rivian supercharging network, the software has improved exponentially, and I've had no major maintenance issues, which is very impressive for it being among the first 2,000 trucks ever made. And it is absolutely wild that this truck can hold its own in a drag race with a Lamborghini while looking like an unroasted marshmallow. Nobody can tell on the outside that there's a face melting amount worth of power underneath the hood, but there most definitely is. So to answer the question, do I regret my Rivian after two years and 22,000 miles now that every electric truck has basically been released? The answer is most definitely not. I have enjoyed every mile and I look forward to many more miles to come. Thank you Rivian for making an epic truck, and thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "truck",
        "Rivian",
        "tires",
        "truck bed",
        "windshield",
        "tonneau cover",
        "time",
        "miles",
        "Rivian Service",
        "cover",
        "years",
        "front tires",
        "bed",
        "back",
        "work truck",
        "glass",
        "tonneau",
        "electric truck",
        "gas",
        "bolts"
    ],
    "transcript_entity_values": [
        "about 1,100 gallons",
        "about 6 months",
        "a hypothetical 20 miles a gallon",
        "two",
        "an additional few hundred bucks",
        "Duratracks",
        "3peak",
        "a month later",
        "100",
        "another spring",
        "Trail Built Off-Road",
        "A few days",
        "3,800",
        "about $1,700",
        "Rivian 2 years",
        "first",
        "Wrangler Duratrac",
        "USB",
        "about a day",
        "secondary",
        "about 21,000 miles",
        "tonneau",
        "110 miles an hour",
        "About 6 months ago",
        "about 150,000 miles",
        "the last two years",
        "about half",
        "AC",
        "just 25 minutes",
        "7,500",
        "EV",
        "Tesla",
        "5,000 milliamp hours",
        "50%",
        "3",
        "10,000",
        "the air filter",
        "Utah",
        "one",
        "Pirellis",
        "two years ago",
        "Uncle Sam",
        "three",
        "about 2 years",
        "DC",
        "about $1,800",
        "30 watt",
        "about $100",
        "Rivian",
        "22,000 miles",
        "2 years",
        "One",
        "Bunker",
        "Tacoma",
        "7,000 pound",
        "Rivians",
        "2,000",
        "the past two years",
        "Anker",
        "day one",
        "Rivian",
        "17",
        "two years",
        "175,000 mile",
        "120 volt",
        "a couple of minutes",
        "Anker",
        "watts",
        "4",
        "about 3,000",
        "about an hour",
        "12 volt",
        "a day",
        "Tonneau",
        "the first thousand miles",
        "Loctite",
        "Rivian Service",
        "Lamborghini",
        "7",
        "2"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "FAC",
        "DATE",
        "CARDINAL",
        "MONEY",
        "LAW",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "LOC",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "GPE",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "QUANTITY",
        "NORP",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "NORP",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "PERSON",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ]
}