{
    "id": "rXyjAxMIulo",
    "title": "Microsoft Surface Duo Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-09-10T14:05:25Z",
    "video_url": "https://www.youtube.com/watch?v=rXyjAxMIulo",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "microsoft surface duo",
        "review"
    ],
    "views": 256732,
    "likes": 9856,
    "comments_count": 966,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Today, we are checking out the Microsoft Surface Duo. (inspiring music) (record scrubbing) And yes, we are turning the screen on today. This device has been so much fun to use over the past few weeks, and I am so excited to finally get a chance to show it to you. But first, let's dive into the specs. Starting price is 1399 with storage options of 128 and 256 gigs. Qualcomm Snapdragon 855 processor, six gigs of RAM. It has a single 11 megapixel camera capable of capturing 4K video. It also has a flash, USB-C charging, fingerprint sensor, dual batteries, giving you a total of 3,577 milliamps, USB-C charging with video output capabilities. I have this set as a Display Port in to USB-C, and guess what, it's working. The screens are what this device is mostly about. It has dual 5.6 inch OLED displays that each work separately to run both Android and Microsoft 365 apps. And it weighs about 250 grams. It's super thin at 4.8 millimeters and 9.6 millimeters when it's folded. The front and back are both Corning Gorilla Glass, making it have a really super-smooth feel. Especially with a lack of a camera bump, it's seamless. It also has a mono speaker and a dual mike with noise suppression and echo cancellation. This will help out with all those Microsoft Teams calls. The 360-degree hinge is what gives this device so many different options and possibilities of use. I like to call these postures. The one that I found myself using the most was book mode. There's also dual landscape, single screen, tech mode, compose, and peek mode. So things that really set this apart from some of the other foldable devices on the market, well yes, this is foldable. It's running two screens separately, allowing for multitasking. Having optimized Windows apps is a huge plus, because they are able to develop and take full advantage of all of those new postures and different modes and make it work very seamless with every app and every posture. It's also really easy to link your phone to Windows on your computer. You could do this before on some Samsung devices, but they've made it even easier now with the Duo. You'll be able to use the Your Phone app to sync photos, videos and messages. Obviously this is something that we're very used to in the Mac ecosystem, so being able to do this easily using the Your Phone app on Windows, I'm a fan. So let's remember, this is a first gen device, so there are some things that this is lacking. I feel like this was something that Microsoft was hoping that they would've had released a little bit earlier than they are now. There's no wireless charging, there's no 5G. It does have an older Qualcomm Snapdragon 855 processor. Many people were questioning why Microsoft didn't use the latest Snapdragon processor, and that's because Qualcomm requires the device to include a separate 5G chip to use the 865. Sadly, when the Surface Duo was finalized, there wasn't any room to install a 5G chip. Thus, the 855. Now I imagine on the next version, they would have a longer battery. But what they've done in such a slim form factor is pretty impressive. I haven't really noticed the battery life being too terrible. They do have it rated to get up to 15 and a half hours of local video playback, 10 hours of standby, and 27 hours of talk time. And I hope I never have to talk to anybody for that long. I do always hate talking about things that I don't like, especially about devices that I love, so let's focus on the things that are really incredible about this. The pluses on this thing really do outweigh some of the negatives, and this is something that I found myself using so much more for emails, doing work, browsing the web, and even hanging out on Twitter and Instagram at the same time because that's what everybody needs at a time like this. So for content curation, I have found myself going back to my iPhone just to take photos or videos, but this is such a slim and small device that I have been taking this with me in addition to my iPhone. And yes, it does fit in my yoga pants, so all is well on that front. Something that I found using this a lot for is email. And even on my iPhone, this is how I type. I normally will open up something, and this is how I type and everything thinks it's super weird. So what's great about this is I can do my super weird typing but actually have dual screens, so my keyboard will be on the bottom and my email or whatever it is that I'm working on is at the top. That's called compose mode. So let's get composing. Not only does it have a keyboard that you can type like this or like this, you can make the keyboard different sizes depending upon how you are holding this, which is cool because you can type one-handed. It also has slide to type, which I have found myself using that so much more since the latest version of iOS starting integrating that into their keyboards. So now I've gotten so used to the swipe to type. I'm not sure if any of you guys use that, but once you kinda master it, it's pretty great and super quick. This is something that you didn't even know that you would need. To be able to look at Instagram and Twitter at the same time, I could be scrolling. This is, this is not healthy but I love it. I could be looking at Instagrams. I could be composing my Tweets. - [Man] What other app groups would be fun? - Disney+ and Netflix. - [Man] Like Netflix and IMDB. - Oh yeah, I guess that would be good. - [Man] Or. - Yeah, but what if I wanna watch Disney+ and Netflix at the same time? - [Man] Okay well you're being silly. - Watch, this is cool. You just click on it and you do Groups, and then you pick whichever other app you want. So I'm gonna pick Disney+, and you'll have an app group. So when you click on this app group, it will open both of them at the same time on screen. Microsoft had some app groups already set up here like the plan. So this is convenient. You'll have your email popup on one side and your to-do list pop up on the other side. Yeah, but have you had Netflix and Disney+ open at the same time? Oh my gosh, what about Postmates and GrubHub at the same, this is great. - [Man] Postmates and. - My Fitness Pal. - [Man] Exactly. - So you get really comfortable using two screens and when you get so used to that, when I go back to my iPhone, it's kind of weird because I can't do the things that I was used to doing on here so quickly, because you do have these two screens, and you just kinda feel yourself going through these different postures. So if I'm on Instagram and Twitter, I could be scrolling and then I decide, oh hold on a second, I wanna make this full screen. So I just kinda fold it like this, do my scrolling, see what everyone's up to. Since this probably isn't the best demo to show you guys, but the fact that you can do this and it still looks really neat, I'm into it. So if I'm scrolling and I decide, hmm, let's go into single screen mode. I just fold it back and it will automatically switch back to single mode so you can just continue to scroll. Something that you'll notice is this dynamic taskbar. So this will move around depending upon if you have different apps open. So if I'm gonna open up my messages, that will slide over to the other screen and you'll still be able to have access to all of those just as you would if they were on both screens. So, here's my messages. Got a lot of friends that have been chatting with me. We have Jenna, and Tyler and then Jenna again. Watching YouTube is really cool. I've been watching this girl named Sophie Lloyd, she does really cool guitar covers, and now basically all of her videos have been recommended to me all the time. There's a Bon Jovi Shred version. Yes, her guitar's purple. (soft rock music) It's what we've got So you have a video up here and you can scroll, you can read comments. What if she needs a drummer? I'm not one yet, but I'm just saying in the future, in the future I'm here. Even if you're looking at it like this, yes, there is a crease down the middle, but you can still view the comments on the side. So speakers right here on the top. It is only on one side. Which, I mean it's not that big of a deal, but I do feel like in a future version, it will be really cool if they do have stereo speakers, but that is gonna be interesting to try to figure out how that's gonna work with all the different postures, because you will want it to be stereo no matter which way. I feel like that's gonna pose a challenge. Like I mentioned before, book mode is kinda the mode that I feel like I use the most because this does give you easy access to both sides of the screens. You can go into full screen mode very easily, and then you can quickly switch to the single screen mode. And it's cool because every time you do this, everything adapts to your actions. But as you can see, this is now on the front, whereas the back is turned off. And if I wanna switch it, it sensed that I flipped the screen over. It is giving you the option that now, oh guess what, it thinks that I wanna switch it. Now this motion is kind of interesting because this also will carry over into the camera, and this is super cool. This only has one camera, so a lot of people were saying, but it doesn't have a front-facing camera, it doesn't have a back-facing camera. It has one camera, and those can both be the same thing. Watch me now. So right now, I have a selfie camera, and it will automatically switch to the back camera and flip the screen, so now the camera is obviously on the back and the screen switched to the front screen so that I'd be able to see what it's taking a picture of. So let's take a picture of this mess over here, and now we're gonna flip it. And now it flipped to the front-facing. So you can do slow-mo, 240, 120. You can also do regular video. You can shoot 1080 30, 1080 60, 4K 30 and 4K 60. There's portrait mode and panorama. Oh I just got a notification from Starbucks that tomorrow is double star day. I lost all my stars because I haven't gone to Starbucks in six months. I mean what is this? I need to get my free birthday drink. Maybe let's go out and test out some photos and videos so you guys can see what this looks like. Oh man this background looks so good. (casual motivating music) So I know this isn't technically a phone, it's sort of a phone, but guess what? You can make phone calls on it, obviously because it has a SIM card. So it does have data, and I'm gonna call Jenna right now because I want to order some food, so I'm gonna call her to see if that's something that she's into. (phone rings) Let's use that speaker. I wonder if she's gonna answer. This is really disheartening. I'm receiving a phone call from Jenna. Hello? - [Jenna] Hello? - Hello. - [Jenna] This is cool. - I can send you. - [Jenna] A video call. - A video call? (Justine gasps) Hi! I see your camera, are you making a video too? - (indistinct) - That's cool, do you want some food? But here's the real question, do you want me to pick up food? Do you think maybe you wanna let me know what food you want? - If you click the three dots, you can go into Effects. - So it's getting dark, I was gonna take some photos out here, so I only got a chance to take a little bit. But, food? Do you wanna talk about food? How about this, I will go pick up food. - [Jenna] Okay bye. - Okay bye, cool, wait, you didn't tell me what you wanted. Text me it, okay great, she hung up. Does she not understand that I'm hungry? Once upon a time, there was a little doggie named Maddy. Smell that, learn about it. I took a few photos on the iPhone and the Surface Duo just so you guys can get a comparison to see what each one looks like. These first ones are in portrait mode. So you can tell that the Duo actually did a pretty good job around my hair. The iPhone obviously is pretty good most of the time in portrait mode. Look at me having a very nice sit. Portrait mode of me sitting on the bench in the Duo, it basically blurred out everything except for the top part of my body. This is non-portrait mode, so you can tell that everything sort of is in focus. I do feel like I don't think that I look very crisp. It's definitely a softer image. So when you zoom in to the iPhone, you can see that the photos are way more sharp. This is kind of a cool shot, I didn't take one on the iPhone, so I don't have one to compare, but I was facing this light strip and there was a lot of light, so it kind of helped illuminate my face a little. You can tell there is a lot more smoothing going on on the Duo. The iPhone still is much sharper. I mean, the photos are good. You're still able to take photos. You'll be able to capture things that are happening around you, just not the high quality that the iPhone or other premium smartphones. This is a video test, I would say it's front-facing, but it's the same camera, so it technically is front-facing right now, but when I flip it around, it'll then be back-facing. Back-facing, back-facing. Taking Maddy for a walk. Maddy, do you miss Jenna? My friend Jenna, do you know that Jenna loves you? And mommy? - [Group] Happy birthday dear Jenna. - [Woman] Happy birthday Jenna! - [Jenna] Thank you. - [Justice] Look at that COVID (indistinct). (group cheers) This will also work with the Surface Pens, which is kind of exciting. This is one of the slim versions. The back is also a little bit magnetic, so you can even keep your Surface Pen right there on the back. I don't think this was planned. I think it's just, this is magnetic so that they'll stay closed. But, a nice little added bonus. That's a hat. Let's add a little highlighter back here in the green. This is pure talent. It is kinda cool that this will work on here. That is something that I hope that Apple finally will let us do on the next version of the iPhone. Can we please use the Apple Pencil on the iPhone? Simple request. And can we also have a fingerprint scanner? (offbeat uplifting music) xCloud gaming is finally here, so you're able to play Xbox Game Pass games on your mobile devices. And it's exciting because it also launched for Samsung, which I did show you guys a little demo of that in the Z Fold, but now we're gonna be playing it here on the Duo. We're about to play some Halo. It's loading up right now and it's really hard to play a first person shooter game in such a small screen like this. If you're really trying to have a really good KD, this is probably not the route that you wanna go. There's so many other games that are probably better-suited for this type of gameplay, but the fact that I am connecting my Xbox controller is so cool. I also, can you see it? Okay, this is neat, it looks actually really good. I mean, you can tell the bezels, you can see them pretty prominently on the screen. The fact that I'm playing Halo on here still is shocking. - [Man] This area's clear. - Is it 'cause I'm getting shot, so you're a liar. I'm not saying that this is the best way to play Halo, but I am showing you that yeah, it does work. Most of the complaints that I do have after using this feels like they're all things that can be addressed with software updates. The hardware feels very premium. Carrying this thing around just feels really comfortable and natural. There were some times that the camera snapped photos a little slow. There is some lagging with scrolling. And some of the third party weren't behaving correctly when you're switching quickly between different modes, but I feel like again, those are all things that once this device actually out, they'll be able to address those very easily. Now my sister brought up this really great point. When I was yelling at her for not answering my Teams call, she's gonna get it. Hello? It was because she didn't even see the call. Hey, so what's goin' on, what are you doin', are you workin' on your video? - I am, I've just been editing all day. I took a break and I went for a walk. - Oh that's nice, it's weird out, the weather's weird. - Weird, so I was like, I wanna go back inside, so now I'm back inside, back on my computer. - Cool, well we did that. I'm chatting with Jenna. I do feel like this needs something on the front to be able to tell if you have some notifications. Because if not, you have to make sure that it's opened up. Now I'm not saying the entire front screen has to be like the new Z Fold, but the front of this display is pretty awesome. But having this front cover display like this does add to the thickness. I'm not saying that this is the answer, so maybe something a little more like the Z Flip. With this, you're able to see if you have notifications, you can tell the time. I think this would probably be the best option. All in all, I think that this has a really great future. This is the first generation, I don't think that this is perfect by any means. There's so many things they will need to do to make this better. Before first gen, I'm pretty excited about what the future of this Surface Duo can be. Let me know if you guys have any questions about this or anything that I've talked about in this video, leave it in the comments below and I will see you in my next video. But don't forget to subscribe and hit the bell so you'll be notified when I do post another video. (casual uplifting music) (beep) Maddy, we're gonna have a haircut. It's on the 23rd. So I was thinking that if your haircut was on the 23rd, maybe we could squeeze in a dog park visit. The dog park? After a walk maybe? I know, those are all your favorite things, huh?",
    "transcript_keywords": [
        "screen",
        "mode",
        "Surface Duo",
        "Jenna",
        "back",
        "cool",
        "video",
        "Duo",
        "camera",
        "time",
        "iPhone",
        "Microsoft Surface Duo",
        "things",
        "screen mode",
        "kind",
        "screens",
        "feel",
        "Microsoft",
        "app",
        "photos"
    ],
    "transcript_entity_values": [
        "Halo",
        "10 hours",
        "Windows",
        "11 megapixel",
        "a Display Port",
        "15 and a half hours",
        "second",
        "xCloud",
        "one",
        "KD",
        "USB-C",
        "1080 30",
        "27 hours",
        "3,577 milliamps",
        "the past few weeks",
        "Apple",
        "Justine",
        "Windows",
        "the Microsoft Surface Duo",
        "Maddy",
        "256",
        "Mac",
        "4",
        "Instagram",
        "iPhone",
        "4.8 millimeters",
        "three",
        "Groups",
        "Sophie Lloyd",
        "240",
        "Snapdragon",
        "Postmates",
        "GrubHub",
        "Duo",
        "9.6 millimeters",
        "the Apple Pencil",
        "Twitter",
        "5",
        "IMDB",
        "Xbox",
        "Corning Gorilla Glass",
        "Samsung",
        "Z Fold",
        "the 23rd",
        "5.6 inch",
        "Netflix",
        "865",
        "Starbucks",
        "RAM",
        "six months",
        "six",
        "today",
        "third",
        "128",
        "two",
        "YouTube",
        "Microsoft",
        "Instagrams",
        "the Surface Duo",
        "Tyler",
        "Android",
        "a Bon Jovi Shred",
        "the Z Fold",
        "first",
        "this Surface Duo",
        "tomorrow",
        "Qualcomm",
        "855",
        "Xbox Game Pass",
        "about 250 grams",
        "the Surface Pens",
        "Jenna",
        "120",
        "1399"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "TIME",
        "WORK_OF_ART",
        "QUANTITY",
        "FAC",
        "TIME",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "TIME",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "FAC",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "FAC",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE"
    ]
}