{
    "id": "RYf2ykaUlvc",
    "title": "We owe you an explanation... Our Ryzen 7950X3D Review is Late but Worth the Wait",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-03-28T21:21:19Z",
    "video_url": "https://www.youtube.com/watch?v=RYf2ykaUlvc",
    "category": "Science & Technology",
    "tags": [
        "amd",
        "ryzen",
        "7950X3D",
        "cpu review",
        "what's the best gaming cpu?",
        "is the 7950X3D good?",
        "should I get an X3d?",
        "is x3D worth it?",
        "ltt 7950x3d review",
        "why didn't ltt post a review?",
        "processor review",
        "best cpu 2023",
        "best amd cpu"
    ],
    "views": 1957363,
    "likes": 81763,
    "comments_count": 3693,
    "description": "Get a 15-day free trial for unlimited backup at   Experience fast and seamless remote access using AnyDesk:   CPUs, GPUs, laptops, Macs- everything has a failure rate. Our AMD Ryzen 7950X3D was the victim of the silicon lottery. But theres more to the story than mere benchmark numbers  Discuss on the forum:   Buy a AMD Ryzen 9 7950X3D:  Buy a AMD Ryzen 9 79550X:  Buy an Intel Core i9-13900K:  Buy a Gigabyte X670E AORUS Master Motherboard:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:25 Our original data 3:37 AMD's response 3:58 Did we get a bad chip? 7:05 We got a replacement CPU 9:47 Verifying the new chip is good 10:17 Was the New CPU better? 11:30 2 ways AMD screwed up 12:20 What this CPU is GREAT at 13:28 Why would AMD do this? 14:14 Why would LTT do this? 14:53 Who should buy it? 16:35 Outro",
    "description_links": [
        "https://www.backblaze.com/landing/podcast-ltt.html",
        "http://lmg.gg/AnyDesk",
        "https://linustechtips.com/topic/1497297-we-owe-you-an-explanation/",
        "https://geni.us/aeJ3Ava",
        "https://geni.us/sKLw",
        "https://geni.us/2nfAP",
        "https://geni.us/hnnP9hA",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- On February 27th, 2023, AMD's Ryzen 9 7950X3D was formally declared to be. - The best CPU at every price point in the desktop market. - At least by everyone else. Normally, gamers can count on us to confirm or refute manufacturers' claims, allowing them to get the most for their money. But we said nothing. Well, about that. First, our testing was plagued with so many crashes, (Windows chime rings) (heart rate monitor beeps) that our original script for this video had us speculating whether AMD had validated this chip at all. And once we worked that out, we're gonna touch on that later, our performance numbers were so far off what others were reporting that we went back and we retested everything. And what we found was that the deeper we dug, the more complex the story around this chip became. Fastest on the planet? Yes. But maybe only on roads that most people wouldn't drive it on. Fastest segue on the planet? No, but you're watching it anyway to learn about our sponsor. - AnyDesk. Experience seamless and top-notch remote access with AnyDesk. You can effortlessly connect to any device regardless of the operating system and enjoy low latency. Whether you need remote support or you're working from home, AnyDesk has you covered, don't miss out. Check out AnyDesk at the link below. - Here are the original graphs that we were going to publish for our Ryzen 7950X3D review. You can pause if you want to look closely here, but what matters is that at 1080p, while we did see performance improvements over the regular 7950X, no matter how many times we tested, our data never quite lined up with AMD's own. And if that wasn't strange enough, look at these \"Modern Warfare 2\" results. Lower than the 7950X? Then we turn up the resolution and I mean, how is that even possible? Normally, the performance differences between CPUs should shrink as we move to 1440p or especially 4k, because we're shifting more of the demand over to the GPU. Well, not here. Instead, our 7950X3D managed worse performance than its X-denoted cousin in multiple games at 1440p. We retested it, and retested it a lot. Same thing. And this flies in the face of the conventional wisdom that CPUs should be tested at a lower resolution to better reveal their relative strength. I mean, it's basically benchmarking gospel that if it's better for gaming at 1080p, it should be better or at the worst equal for gaming at any other resolution. I mean, outside of gaming, we expected performance to be underwhelming due to the 7950X3D's lower clock speeds and TDP. The last gen Ryzen 7 5800X3D behaved much the same way, because 3D V-Cache just doesn't help that much with most productivity tasks. But it was supposed to make up for this with its outstanding gaming performance, something we simply weren't seeing. The bottom line is that the review we never published was scathing. Performance was not in line with AMD's claims, especially when we increased the resolution. And from what we'd heard and what we're now seeing, supply was expected to be basically non-existent. This combined with our experience with the early drivers, our BIOS issues, and the crashes we saw, all pointed to a rushed, possibly even paper launch. AMD had every opportunity to contest our findings but when we showed them our results, they basically went, \"Yeah, seems okay.\" So with nothing else to go on, if we had launched that review, we would've been the only outlet with a broadly negative take on this chip. To their credit, AMD did eventually acknowledge that our chip was probably defective, saving us that embarrassment and giving us the time to get the story right. Now, we had some hints that our review sample was more yellow than golden. With the integrated GPU enabled, Windows would immediately crash once our GeForce GPU's drivers loaded. And across four different EXPO-certified memory kits, we experienced constant crashes in memory-intensive applications like Blender and 7-Zip. Both of these behaviors were absent with regular non-X3D chips, and this pattern was observed with multiple motherboards, meaning our X3D CPU was the only common denominator. So you might think, why is that only a hint at a bad chip? Well, the thing is, these kinds of teething pains are a lot more common than you'd probably think on brand new platforms. If you recall, we had very similar stability issues with first gen Ryzen and with 12th gen Core, especially at higher memory speeds. Usually though, they end up being footnotes in the review process, because everything is pre-release and we often see these things resolved by the time they're actually generally available. But they're important here, because all of this troubleshooting and reporting all of our findings to AMD, including the anomalous performance data, ate up two days out of the four that we had for testing. Wait, only four days to evaluate this thing? Ah, I'm glad you noticed that. The unusually crunched review window was another reason for us to believe, \"Hey, maybe our chip is perfectly normal and AMD is just trying to limit our time with it, so that we don't dig too deep.\" I know that's a pretty cynical take, but the truth is we have seen this strategy before. And aside from the crashing, our performance numbers were at least close enough to AMD's expectations, that even they initially told us, \"Yep, everything looks fine.\" But here's the thing, silicon is notoriously fickle, especially with these bleeding edge process nodes. And good or bad might not be as binary as you might think. For any given wafer fresh off the production line, there are going to be multiple unusable dies. It's just the way it is. As exact as the manufacturing process is, it is truly ridiculous how small each transistor is these days, smaller than even a virus. And when you're working at that level, you're at the mercy of literal quantum physics. Get the gate pitch off by a fraction of an animator and maybe that transistor doesn't flip as quickly as its neighbors, and you can't ramp up clock speed. Or maybe some of them are bridged together and entirely non-functional. Unlike our tech accessory holder from lttstore.com, it's got lots of compartments and it's very functional. Now these kinds of defects are normal and these flawed lower performing processor dies are often used in lower end products, which is fine, except that from time to time a chip can be so marginal that it barely passes those usual quality control checks and then ends up falling short in the field. This is what we call losing the silicon lottery. Winning the silicon lottery on the other hand isn't simply getting a working chip, it's having an exceptional one. One whose production had very few defects, giving it extra headroom compared to the average for a given design. In other words, a good overclocker. This is the part where I tell you that once we got our replacement chip all of our problems disappeared. Or at least it would be, if I were a big liar. The stability problems are gone, but the performance problems, the ones that led to our negative conclusion in the first place, are actually no better. These new numbers then that I'm showing you now are the culmination of what is now weeks of testing and troubleshooting, and they leave us with some really tough questions. Like, are AMD's yields bad? Are we so unlucky as to get two poor performers in a row? Or is our testing methodology out of whack somehow? When we ran our original tests, we made sure to use AMD's recommended settings with fresh Windows installs, and most importantly, fresh chipset driver installs. That last part is much more important than usual, because the pre-release chipset driver only installs the new performance optimizer and the awkwardly named PPM Provisioning File driver when it detects a dual die X3D processor like the 7950X3D or 7900X3D. The release driver might behave the same way by the way. So if you buy one of these as an upgrade, double check to be sure. We're gonna have purchase links down below. These two tools are essential for getting the best performance out of these chips, because only one of its two dies has 3D V-Cache and runs at a lower clock speed while the other is a standard cache die that's optimized for higher clock speeds. Performance optimizer then automatically promotes the appropriate die's cores as the preferred cores in Windows' scheduler. While the PPM Provisioning File driver parks or puts to sleep the cores on the unused die. Games will then, assuming everything's working properly, typically get sent to the 3D V-Cache die for best performance. And as far as we can tell, this is down to a simple integration with Windows game mode and Xbox Game Bar rather than any special sauce that's been cooked up by AMD themselves. An important thing to note though, the driver does not disable the other die entirely and if enough threads are needed, it will wake them up even if you're in game. So it's worth noting that a 7900 X3D would wake up more often, since each die has only six cores instead of eight. Unsurprisingly then, if these features aren't working properly, the Window scheduler is just flying blind unaware of the differences between the two processor dies, and it'll end up ranking the best cores based on the fastest available across the whole CPU. Something it can't rightly determine. This can lead to situations where an app might run across multiple dies at once, despite only needing one die's worth of CPU threads, which can incur a latency penalty since the dies will have to transfer data from cache to cache rather than accessing it directly. Now, we confirmed that ours is definitely working correctly by comparing our data running stock versus having only one die manually enabled in the BIOS. So you can see here that in games, our performance numbers are roughly the same between stock and forcing the V-Cache die, while forcing the frequency die often ran much slower. All of which sounds totally normal and fine, right? With the right drivers, X3D performs better for gaming. (bell rings) What's the problem? The problem is that it doesn't. Look at \"F1 22\" at 4k with ray tracing enabled. This is a really heavy GPU load, so our CPU should easily be able to hit Max Boost, but not the 7950X3D. I mean, we expect it to run at a lower clock speed than the 7950X, but we didn't expect is this inconsistency. I mean with adequate cooling, both the 13900K and the 7950X are rock solid at 5.5 gigahertz. But the X3D? It's all over the place. That ended up leading to lower GPU power and therefore, lower GPU performance. And when we looked at the CPU package power, we can see why. The 7950X3D in this gaming load is drawing less than half of its rated 120-watt TDP. Such low power draws certainly impressive, but on a chip that advertises pinnacle tier raw gaming performance, it's not a behavior that we wanted to see. And our replacement chip behaved like this across three motherboards from three different vendors with multiple EXPO-certified RAM kits, with fresh Windows installs, and even with different chipset drivers. So there were two things wrong with AMD's review kit to us, the defective chip and the bad product positioning. I mean, if you like to drag race your $700 CPU at 1080p high, hits the bee's knees. But I think it's fair to say that most people with this kind of money are running 1440p monitors at least, and probably don't mind turning on some in-game eye candy. And for them, our data simply doesn't support the conclusion that the Ryzen 9 7950X3D is unquestionably the gaming performance monarch. That isn't to say it's a bad chip. AMD in our mind just made the wrong call by calling out their less impressive and less defensible claims of performance leadership. And instead, we feel they should have put far more emphasis on their true strength, performance per watt. I mean if we step back, you are getting Core i9-13900K-ish performance for a substantial reduction in power consumption, even in a GPU-bound scenario like this one. That's astounding! Mind boggling even. Under a full Prime95 load, the 13900K consistently pulls over 320 watts, with the 7950X3D at less than half of that. AMD should be shouting this from the rooftops, but instead they were so focused on the gaming performance crowd that we followed them down that rabbit hole expecting to find the same thing. But as it turns out, the dual die X3D chips work differently from most other CPUs. And it looks like the cores will aggressively try to clock down or even sleep whenever possible when they're not fully loaded. And that would explain what we observed with our GPU-bound scenario and with our 1440p results. It would also explain where some of that lost TDP went. Our best guess here is that AMD is airing on the side of caution when it comes to their X3D chips in order to keep them from redlining, thanks to the 3D V-Cache being much more sensitive to voltage and to heat than a typical Ryzen die. This behavior of course means that there is some performance being left on the table, and we can actually see some of that being clawed back with Ryzen Master's curve tuner function. While it isn't the fully unlocked overclocking that we were promised for X3D going forward, it does do a decent job of undervolting the chip, allowing it to push higher frequencies more often. The performance difference isn't night and day, but you are more likely to see that performance leadership that AMD is after, assuming that your sample is more golden than yellow, if you enable this function. And in our GPU-bound \"F1\" run at 4k, we can see that where the stock performance is all over the place it is much flatter with curve tuner enabled, while also drawing even less power than it did before. It's actually scary how efficient this chip is. It's performance characteristics like these, which we first noticed to a lesser degree, with the 65-watt non-X Ryzen 7000 CPUs that pushed us to start testing at multiple resolutions. And that's the reason why we will continue to do so going forward. It's also why we insist on rerunning our tests with the latest drivers, latest BIOS revisions, and the same OS state as of the date that we start testing a new product. We've been doing that for years now, and while it means we need to rush more to make these deadlines, because we are retesting every time, we're committed to giving you guys a lesser quantity maybe of truly up-to-date data versus a greater amount of outdated data. The answer to the question then of whether the dual die X3D chips are worth the extra hundred dollars, two weeks and 2,300 words later, is probably not. If you need all of the strengths it brings to the table, good gaming performance, double digit core counts, and industry leading power efficiency, that's the big one, then maybe. But it comes at the cost of worse productivity performance, relying on chipset drivers to manage the dissimilar dies, and the inability to overclock in the traditional sense. So I suspect that most people would be better off with the regular or X variance of the 7950 and 7900, or better off waiting for the 7800X3D, which should be able to clock higher by putting more of its TDP towards its single die. We're gonna have a full review of that chip when it launches, but for now we have this message from our sponsor. Backblaze. World Backup Day is March 31st and Backblaze is here to help you back up your data with their easy-to-use cloud solution that starts at just $7 a month. They make it simple by allowing you to back up almost anything from your Mac or PC, and access it anywhere in the world with their web and mobile apps. Backblaze also lets you restore your data by mail. They will ship a hard drive with your data right to your door, and after you're done, you can return the hard drive for a refund. And if you're worried about accidentally deleting files, you can increase your data retention history to a year for an extra $2 a month. $2 a month! With over 55 billion files restored and two exabytes of data under their management, Backblaze has got you covered. So don't be that person who forgets to back up their important files. Sign up and get a 15-day free trial with no credit card required today at Backblaze.com/LTT. Thanks for watching, guys. This was a very different format from our usual CPU reviews, so maybe go check out our review of the Ryzen 7000 65-watt chips for a little bit more about the other options available to you on Socket AM5.",
    "transcript_keywords": [
        "performance",
        "AMD",
        "chip",
        "die",
        "gaming performance",
        "Ryzen",
        "CPU",
        "data",
        "dies",
        "gaming",
        "lower GPU performance",
        "review",
        "AMD Ryzen",
        "Lower",
        "chips",
        "GPU",
        "performance numbers",
        "cores",
        "drivers",
        "driver"
    ],
    "transcript_entity_values": [
        "two exabytes",
        "only four days",
        "weeks",
        "AnyDesk",
        "one",
        "F1 22",
        "1080p",
        "Ryzen Master's",
        "GeForce",
        "four",
        "two days",
        "Windows",
        "EXPO",
        "first",
        "TDP",
        "12th",
        "a year",
        "Xbox Game Bar",
        "7950X",
        "eight",
        "65-watt non-X Ryzen 7000",
        "One",
        "Max Boost",
        "65-watt",
        "7800X3D",
        "First",
        "less than half",
        "1080p",
        "GPU",
        "3D V-Cache",
        "March 31st",
        "today",
        "4k",
        "1440p",
        "$700 CPU",
        "7950X",
        "just $7",
        "Mac",
        "2",
        "Blender",
        "120-watt",
        "13900",
        "RAM",
        "pinnacle",
        "the extra hundred dollars",
        "only six",
        "AMD",
        "two weeks",
        "55 billion",
        "a fraction",
        "15-day",
        "7950",
        "5.5 gigahertz",
        "Modern Warfare 2",
        "AMD",
        "CPU",
        "Ryzen",
        "AnyDesk",
        "7",
        "three",
        "F1",
        "over 320 watts",
        "2,300",
        "the PPM Provisioning File",
        "February 27th, 2023",
        "only one",
        "two",
        "7900",
        "1440p",
        "these days",
        "World Backup Day",
        "years",
        "Windows"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "FAC",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "MONEY",
        "PERSON",
        "MONEY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "FAC",
        "QUANTITY",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "LAW",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "EVENT",
        "DATE",
        "ORG"
    ]
}