{
    "id": "RZoX7glIAS4",
    "title": "DIY Computer Case - The Ultimate Silent PC (CLOUD UNIT)",
    "channel": "DIY Perks",
    "channel_id": "UCUQo7nzH1sXVpzL92VesANw",
    "subscriber_count": 4640000,
    "upload_date": "2015-02-03T15:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=RZoX7glIAS4",
    "category": "Science & Technology",
    "tags": [
        "silent",
        "diy",
        "computer",
        "case",
        "gaming",
        "build",
        "quiet",
        "fan",
        "wooden pc",
        "scratch build",
        "mod",
        "case mod",
        "modding",
        "watercooling",
        "graphics",
        "laptop",
        "cloud unit",
        "diyperks",
        "0db",
        "db",
        "graphics card",
        "cpu cooler on gpu",
        "gpu",
        "gaming computer",
        "silent computer",
        "heatsink",
        "custom case",
        "ssd",
        "hdd",
        "ram",
        "homemade",
        "hardware",
        "external control unit",
        "passive"
    ],
    "views": 968763,
    "likes": 28776,
    "comments_count": 2296,
    "description": "In this video I give an overview of my latest scratch PC build project - the Ultimate Silent Gaming PC, Mark II. The greatest feature of the case, I think, is that the graphics card has a MASSIVE cpu cooler on it, which helps to plunge the case into practical silence even while gaming.  Build log:   Acoustic Performance:   OFFICIAL LINKS:  Support me on Patreon:   Official Website:   Discord:   Forums:   Twitter:",
    "description_links": [
        "http://www.youtube.com/watch?v=vHoqYBZMc_c",
        "https://www.youtube.com/watch?v=H3_sy3-c6LM",
        "https://www.patreon.com/DIYPerks/",
        "https://www.diyperks.com/",
        "https://diyperks.com/discord-server/",
        "https://diyperks.com/community/",
        "https://twitter.com/DIYPerks"
    ],
    "transcript": "Hello my name's Matt and welcome to this video about my homemade computer case mark 2! This is actually a sequel to a computer case I made a while ago out of wood, and the ideas I thought of there, well, some of them anyway, have been transferred to this but done a bit better. The main goal was again to make an almost inaudible computer. So no matter what the computer was doing, whether it was playing games, video editing, or even word processing... you know, that's really demanding task lol Well bascally the goal was for it to be completely inaudible no matter how quiet the room is. To do this I've actually reconfigured a standard layout and so it's quite a bit different than the standard case, and because that sort of like the main feature here, I think we'll have a look inside first. So if we just turn it around and take the side panel off, which is usually held in by three screws, you can see that it is indeed quite a bit different than standard case. Now this is more like function over form because this really isn't supposed to be seen, unless you need to upgrade it or something like that. There are a lot of cases out there that are way better in terms of internal looks, but as I said this is more function over form. So, the first thing you'll notice is that the motherboard is mounted vertically and this is to allow the case to have a vertical and flow design. So basically the air gets taken in at the bottom here through these dust filters and goes through the heatsinks vertically and then out to the top. This goes along with convection because obviously heat rises so what it means is that fans don't have to turn as fast to move the same amount of air. Now usually there a plastic barriers which direct air through the heatsinks but they were removed for most the shots in this video as to not be in the way. Also you may notice that this quite a large gap between fans and heatsinks. This was done so that the fans could remove not only the heat from the heat sinks but also the surrounding components as well. Now because the motherboard is mounted vertically, all the sports can be accessed through a hatch on the top the case, and all the cables can go through a hole at the back. This this is actually more practical than having the ports on the back because it means you don't have to pull the computer out if you want to plug something in. Another thing you may have noticed is that the graphics card has a colossal CPU cooler on it, rather than standard graphics card cooler. The reason why it's there is to allow the graphics card to be quieter even if its maxed out playing an intensive game. There are a few reasons why this makes it quieter, the first is that, obviously, because this is a much bigger cooler, it has a larger surface area, which means it can transfer heat to the air more effectively. Another thing is that because the air path is vertical, all the heat from the card gets vented immediately outside the case, rather than just being left inside like a normal graphics card cooler usually does. For example, this is the original cooler as you can see, not only is it smaller but it is designed just to basically below the heat off itself rather than exhausted out of the case like the new cooler does. The third reason this cooler helps with noise levels is that it allows a much bigger fan to be used with the graphics card. For example this is a 140mm fan which is same size what I've actually used in here, and it is significantly bigger than the original cooler's fan. This means that the bigger fan doesn't have to spin is fast to move the same amount of air, so it means that overall the whole thing is a lot quieter. So this thing's pretty much redundant now... oh my goodness! That nearly hit the mirror! Weren't you paying attention?! She caught it. That's good. Yay. Now, as the coolest sticks out a lot you might be thinking that it might stress the card's PCB but I'd just like to point out that it is mounted extremely securely and all of the RAM and voltage regulators have heat sinks on and they're obviously in the airflow path as well, so it's all kept within spec. I personally think there should be a new standard for computer cases, or at least gaming cases, to allow big coolers on graphics cards like this because most of the time graphics cards actually use twice as much power as processes do, but the heat sinks are restricted to only 2 PCI Express slots, and the airflow is obviously not exactly direct after the case, like as usual with processors. So I do hope that eventually there will be a nice new standard where graphics cards can have a better airflow path and can have bigger coolers because they are just so powerful and hot and noisy sometimes, and it would be quite good if that was all history, just like it was with processors when these big coolers became the norm. So... You might have noticed is that there is some weird green luminous stuff inside here, and you're probably thinking 'what on earth is that's doing inside a computer case?' Well, what it is is folded fabric, and the reason why it's there is to provide a soft mount for the 2 fans, so this means that the vibrations from the fans don't get transferred into the case getting amplified process. This is something I covered in my how to make a graphics card quieter video and it does have a significant effect on the overall noise levels. Now, another thing this fabric does is absorb any high-frequency sounds that might be omitted from the graphics card or power supply, like coil whine. It does really good job of this because just absorbs it and prevents it from being bounced elsewhere. These components actually don't have that much wine to them, but they do have a little, and that little coil whine is actually louder than the fan's, so it is important that this noise is absorbed so that you cann't hear it, because when it's not been masked by fan noise it can be quite annoying. The hard drives are here the back and again the data drive, which is a 2.5 inch laptop hard drive, is in a little pocket made out of the same fabric and that's for the exact same reason of absorbing its noise and vibrations. The power supply is mounted here beneath the motherboard, and as you can see it's been taken out of its case. The reason for that is to get rid of a fan, because now it's being cooled by the CPU's fan. So it's cooling both the processor and the power supply. This works really well because in this configuration the air can flow smoothly over the power supply without any obstruction really, whereas on a typical power supply the air has to go 90 degrees which does mean that the fan has to turn quite a bit faster to move the same amount or air. So it does mean thats it is quite a bit cooler this way. Before any of you say that having this fabric near power supply is a fire hazard, I'll just say that because of the way the power supply has been fitted, all of the high-voltage electronics are isolated and within their own little enclosures, you can't see it here but there is an enclosure around the power plug for example, and everything high-voltage has been kept well away from this fabric, so it is very safe even if there was a direct short the PSU would obviously just switch off and a fire is extremely unlikely. So please don't comment on how my computer is going to catch fire and burn my house down because it's not going to happen okay so I think we'll look back now. As you can see this is the input for the power supply and there are two more USB 2 ports, for something like a printer or whatever you want to plugin at the back, and and two DC sockets. These DC sockets are connected to the power supply's 12v and 5v rails and basically allow you to plug in some extra devices that you want to be powered by the computer. Here you can see that there is some more of that fabric, on the bottom and we've got same thing at the top as well. So you might be wondering why not go with water cooling instead of making a new case like this. Well essentially the key word for this case is experimentation: I just wanted to try out a few ideas I had. Another thing is that watercooling is actually quite expensive. For example, this whole case, excluding my time, was built for less than a basic water cooling kit so it was economical for me to do this as well. Watercooling isn't necessarily quieter than air, because you've got things like pumps to contend with, and essentially all it is is a better that way of taking heat away from components and cooling it down with better airflow path typically, whereas because I built this from scratch it by default has a better airflow path so it makes it necessary to go with water cooling, and it means that you don't have to maintain it either. You can't see it because it's covered by this white plastic but there is another hard drive inside here. It's a desktop drive and it's used for backup puproses, and I'l cover that in just a second. So, I think it's time to turn it on. So as you can see this plexiglass light on the front looks really cool, as does the power button, and the whole thing has been finished with a lovely carbon fiber wrap, which is why it has this nice texture to it despite the whole thing be made out of aluminium. It's actually this combination of lights and vinyl wrap that it's been called cloud unit as it looks sort of droidish when it's on. On the top we've got a vertical loading optical drive, which is essentially just a laptop optical drive, and we've got to usb2 ports one USB 3 port, a usb3 card reader, and a button. Now this button does something quite special in that when it's pressed, the front power light turns red, and inside that additional hard drive told you about behind the white plastic gets connected to the power supply so it turns on and then the system automatically begins backing up the data from the laptop drive, which is the data drive, to the backup hard drive. So it's basically like a really easy backup system, which means you're more likely to keep regular backups of your data, which is obviously usually the most valuable thing on a computer. So I think that's pretty much it. Thanks very much for watching this video, and if you've liked it don't forget to give it a thumbs up! In the next video I'll be doing a build log of this thing so I'll be showing you how I went about building it and things like that after the build log I'll be doing a performance test, so I'll be showing you basically how quiet this thing really is and what kind temperatures it gets as well. So I'm Matt and thanks again for watching and I hope to see you next time! Don't forget to subscribe if you liked this video!",
    "transcript_keywords": [
        "power supply",
        "case",
        "graphics card",
        "power",
        "thing",
        "graphics card cooler",
        "card",
        "fan",
        "air",
        "graphics",
        "computer",
        "cooler",
        "supply",
        "computer case mark",
        "drive",
        "computer case",
        "homemade computer case",
        "heat",
        "fans",
        "video"
    ],
    "transcript_entity_values": [
        "first",
        "12v",
        "three",
        "usb2 ports",
        "USB",
        "140mm",
        "third",
        "two",
        "CPU",
        "2",
        "2.5 inch",
        "second",
        "DC",
        "PCB",
        "5v",
        "PSU",
        "USB 2",
        "one",
        "usb3",
        "RAM",
        "Matt",
        "PCI Express",
        "90 degrees"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY"
    ]
}