{
    "id": "s1C2cNdAzI0",
    "title": "Aero 15 - RTX Laptop for Creators",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2019-01-30T21:04:39Z",
    "video_url": "https://www.youtube.com/watch?v=s1C2cNdAzI0",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "aero 15",
        "gigabyte",
        "best gaming laptop",
        "best rtx laptop",
        "best laptop for creatives",
        "best laptop for video editing",
        "best laptop for adobe premiere",
        "best laptop",
        "xps 15",
        "macbook pro",
        "best macbook",
        "4k screen",
        "sRGB",
        "razer blade",
        "msi gs65",
        "msi gs75"
    ],
    "views": 607670,
    "likes": 15146,
    "comments_count": 1000,
    "description": "Dave2D Review of Aero 15 Y9 with RTX 2080 Max-Q - The best gaming laptop for content creators.  Available Here -   With the new RTX 20 series GPUs from Nvidia, the new Aero 15 X9 and Y9 bring awesome performance to the laptop market. This is one of the best laptops for 3d work, video/photo editing while being a strong gaming laptop.  Background Music Fili - H2)  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2TiwQfY",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "So, last year's Aero 15X was one of the best laptops you could get for content creators. It was a very powerful system, in a very small package, and it's been updated by Gigabyte this year, so it's now running RTX hardware. It's got the RTX 2070, or the 2080 Max-Q, the 2080, the one I have here, is a solid 25-30% better in graphical power, compared to last year's 1070 Max-Q. So if you're playing games, you're gonna get incredible performance out of the 2080 Max-Q. Now, last year, I was very lucky to have access to a lot of the thin and light gaming laptops including the Aero 15. And the thing I liked the most about this system, was the fact that it had excellent thermals. There's something about the way they've built the Aero 15, that allows a ton of air to go through it, the fans are loud, but I don't think that's the only thing. You can crank the fans up on a lot of systems, these ones do get quite loud when you max it out. But the thermal performance on this chassis is excellent, and that's actually the main reason why I used this device more than a lot of the other ones last year. Because it was just such a good performer. So, having used this for several months straight last year, uh, I just have slightly more experience with this device than some other people that are doing reviews on this thing, I will say though that as much as I liked the Aero 15, there are few things that I disliked about it. The first one being the keyboard. This is a keyboard that I mentioned in the review as being quite difficult to get used to, and it is, but even after using this thing for several months, I never got really comfortable on it. There's always something about it that just felt kind of off to me. The layout is fine, but mechanically, the keys feel a little stiff, and kind of flat to me, and it's also got this cramped feel to the keyboard, I don't know what it is, like visually, it looks fine, but I can never type super fast on it. Another thing I didn't love about it were the fans. So I just mentioned how I loved how the thermal performance was excellent, but the fans to get to that excellent thermal performance were super loud. And this is just, you know, manual control to bring it up to that speed, but I just wish that somehow it was quieter at the top end, but it is quite loud. And another thing that bothered me were the speakers. So, these speakers are quite poor. They package it with software to tweak around with the sound, but it's a very flat sounding speaker and relatively quiet. In fact, of all the thin and light performance gaming laptops that I used last year, I would say that the Aero 15X had the worst speakers of the bunch. And obviously this is something that's not gonna affect everybody, some people don't care about the speakers at all, but if you do, these aren't great. Okay, the thing that bugs me the most about the Aero 15X though, was actually its design aesthetic. It's thin, and light, but it's not a particularly good looking laptop to me. and it's not that it's super ugly, it's just that there are devices out there that have this kind of price point, and this kind of performance, they just look so much better. And when you're spending this kind of money, for some people, like myself, you just want it to look a particular way, you want it to look good. And we have devices out there that look like the Razer Blade, this just looks less attractive to me. And again, this is only for people that care about the design aesthetic of their laptop. Because not everyone does, I get it. Okay, so there's other things that I really like about this device, and I'm gonna go through those. The first one is the screen. The panel on this particular unit is a 4K panel, and it's awesome. The one I had last year was the 1080p screen, that looks really good already, the 4K panel looks amazing. Like if you're doing video or photo work regularly, I would highly recommend this screen if you can afford it. If you're playing game, though, I don't like the look of the 4K panel. Compared to 144 Hz screen, stuffs just looks a little bit choppier, so depending on what you do, you're gonna have to choose between the screens. Another thing I really like about this device is the SD card reader. So, this one on here is a UHS-II compliant one, it's super fast. So, a regular SD card reader will cap at like 85, maybe 90 MB/s, this things triple the speed, if you frequently offload footage from an SD card, for like video work or photo work, this thing's nice. There's also a good selection of the other ports, there's 3 USB-A's, and 2 USB-C's, there's one on each side, and you also have an ethernet jack on the left, which is nice. The AC adapter's on the right, and it's a 230 W AC adapter, it's a standard looking unit. The trackpad's been improved, it used to run Elan driver, it's now a Microsoft certified Windows Precision touchpad, which I like. And the internals of this laptop are also still easy to get into, it's a bunch of screws on the bottom, and this is still one of the very few thin and light gaming laptops that supports 2 NVMe drives. It also has a huge battery still, 94 Wh, and on this unit with the 4K panel, screen at 250 nits, I'm not getting amazing battery life, it's 5 hours, but that's with a 4K panel. I think with the 1080p, like 144 Hz screen, you're gonna get significantly better battery life. Last year, I got around 7-7 hours, I believe, on the regular 1080p screen. Now, this device, the Aero 15, is running this new feature that they're calling AI integration with Microsoft Azure. And the way that they explain it is that this laptop can supposedly speak to Microsoft Azure's database, to kind of figure out what applications you're using, and then it'll adjust your CPU and GPU usage, depending on that application. And I tested this with what I'm assuming is a relatively early version of the software, and when it came to gaming, regardless of the title, like super light titles or very demanding titles, I was getting the same framerate. But when it came to Premiere, like Adobe Premiere, there is a noticeable difference, but it's slight. So I guess my take on this whole AI integration thing, I don't like the name of it, I feel like by using the 'AI' in the title, like it's almost disrespectful to people that are actually doing work in Artificial Intelligence fields, like that's some serious stuff. This, to me, is not AI. I do feel like there is a little bit of a benefit, like it's not making my render slower, it's not making my games run slower. But I don't know how beneficial it is for most people. Pricing on the Aero 15 isn't cheap. I've been told it's going to start at 2,400 bucks for the 2070 Max-Q model, it's expensive, but that's kind of price you get to pay for top-of-the-line tools and professional content creation. Okay, so the Aero 15 this year, fantastic hardware. Awesome hardware for gamers, awesome hardware for creators. The 4K panel in particular is something special, I will say though that the thermal performance on this thing, just... It surprises me. This thing's running an i9, 2080 Max-Q, and still just rock solid performance with great temperatures. Okay, hope you guys enjoyed this video. Thumbs if you liked it, subs if you loved it, see you guys next time.",
    "transcript_keywords": [
        "Aero",
        "thing",
        "year",
        "performance",
        "thermal performance",
        "kind",
        "screen",
        "panel",
        "year Aero",
        "people",
        "device",
        "light",
        "gaming laptops",
        "things",
        "RTX",
        "super",
        "good",
        "MaxQ",
        "light gaming laptops",
        "laptops"
    ],
    "transcript_entity_values": [
        "2",
        "Microsoft",
        "Max-Q.",
        "25-30%",
        "2080",
        "Windows Precision",
        "Premiere",
        "4",
        "Microsoft Azure's",
        "5 hours",
        "230",
        "Artificial Intelligence",
        "1070",
        "CPU",
        "the Razer Blade",
        "2070",
        "Microsoft Azure",
        "GPU",
        "MB/s",
        "AC",
        "this year",
        "144 Hz",
        "94",
        "Aero",
        "144 Hz",
        "SD",
        "Elan",
        "Adobe Premiere",
        "a ton",
        "2080",
        "K",
        "3",
        "several months",
        "first",
        "Gigabyte",
        "Last year",
        "7-7 hours",
        "2,400 bucks",
        "W AC",
        "90",
        "last year's",
        "250",
        "Max",
        "last year",
        "max"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERCENT",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "DATE",
        "TIME",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON"
    ]
}