{
    "id": "s2xrarUWVRQ",
    "title": "What *Really* happens to used Electric Car Batteries? - (you might be surprised)",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-08-16T14:05:00Z",
    "video_url": "https://www.youtube.com/watch?v=s2xrarUWVRQ",
    "category": "Howto & Style",
    "tags": [
        "Battery Recycling",
        "Electric Car battery",
        "Smartphone battery recycling",
        "Lithium battery recycling",
        "how to recycle lithium",
        "how to recycle cobalt",
        "how to recycle tesla battery",
        "tesla",
        "EV Battery",
        "EV Battery Mining",
        "Cobalt",
        "Lithium",
        "how to recycle phone battery",
        "reciclar la batería",
        "reciclar bateria"
    ],
    "views": 4386782,
    "likes": 97638,
    "comments_count": 5855,
    "description": "How are Lithium Batteries Recycled? Today we find out. Whether its Electric Car batteries, cell phone batteries, or tool batteries the process is all the same. HUGE thanks to Li-Cycle for giving us a tour:  if you're looking to recycle your old cell phone or battery, you can find a drop off location here:  and Call2Recycle will handle the rest. Lets get those old electronics and batteries turned into NEW technology!   Get my JerryRig Razor knife HERE:   Follow me for updates!  Instagram:   Facebook:   Twitter:    LARGE tool kit:   Travel Tool Kit:   Mega Tool Kit:   Plastic Pry tools:   Metal phone opening tool:   The camera I used to film this video:  (GH6   The Lens I used for this video:   Wide angle lens:   And this Metabones adapter:   This is the drone I use:    TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video. JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video. Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result. Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.li-cycle.com/",
        "https://www.call2recycle.org/locator/",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://amzn.to/3JEuTXs",
        "https://www.youtube.com/@JerryRigEverything/about"
    ],
    "transcript": "So I have some questions...what happens to the lithium batteries inside of your cell phone at the end of its life? What happens to the lithium batteries inside of your tools? And most importantly, what happens to the lithium batteries inside of electric vehicles? Are they thrown in landfills? Are they recycled? A lot of questions to be answered. Let's get started. [Intro] Today I'm in Gilbert Arizona with a company called Li-Cycle, North America's leading lithium ion battery recycler. They can do the small batteries, but they specialize in the super large EV battery packs, and the process is fascinating. A lot of the batteries you see here on the conveyor belt are intact, but Li-Cycle does take burned, damaged, and recalled batteries. Basically batteries in any state can be recycled using this process. Among our selection of batteries today it looks like we have cell phone batteries, laptop batteries, tool batteries, even some power banks. The biggest battery of all, of course, though is the electric car battery sitting right here on the conveyor. Electric car batteries weigh thousands of pounds. Getting them up and onto the conveyor is a job all by itself. So to prep you for what's happening here, we have the EV battery pack going up the conveyor belt to this funnel right here. The entire funnel, you know, the whole tower, is full of a proprietary liquid with a massive submerged industrial shredder at the bottom. I even found an old Nokia battery...a relic from times gone by. See ya later, buddy. Hope you end up in an electric vehicle. There are a lot of materials inside the modules. We have the metal casing, we have the plastic interiors that hold all the modules steady, and of course, we have the lithium cobalt and nickel inside of the batteries themselves. There's a lot to collect. One of the benefits of having a whole battery pack go into the shredder is that no one is required to disassemble the pack. Keeping the human operator safe is probably the most important part. After the batteries are ground up they go from a charge state into a completely inert state. There is no electricity in the materials after the blender. It's getting kind of loud but you can see it flowing through here down to a stream where the plastic is vibrated up to this shoot here where they are dropped down into a recycling bag for further processing. But you're probably not here to see how the plastic is separate from the battery, we're here to see what happens to the lithium, the cobalt, and the other precious metals. After the electric vehicle battery is dropped into the shredder, it gets ground up into small metal flakes which sink to the bottom of the tank and get conveyered up and out of the liquid like you're seeing here. Coming out of the vibrator we have aluminum, steel, and copper, and sometimes even some sweet metals that come off the circuit boards, like gold, platinum, and palladium, all collected in bags to be recycled later. With how valuable and useful these internal materials are, no one should be throwing them in a landfill. The way the cobalt and lithium are extracted from that proprietary liquid inside the shredder machine is with something called a filter press. The metal-rich liquid is pumped into the large blue press, and that proprietary liquid is hydraulically squeezed out leaving behind something called black mass on each of the individual filters. The black mass is what's falling down the chute as each of the filters are shaken, and is what contains all of our coveted elements. The black mass has been valuable enough to be called the new gold. It really is the most valuable part of this entire process and what Li-Cycle is after. It's a vital ingredient in making new batteries. One of the coolest parts about this system is while they are using a ton of water inside, it is a closed loop system and none of that water ever leaves. It's not used up in any of the reactions. There's also no air pollutants in a traditional sense since nothing's being burned. After the batteries have been shredded, sorted, filtered, and pressed, we're left with these three commodities here. We have the middle bag which is full of plastics that came from floating off the top of the liquid. Then over here we have the aluminum and copper shred which sank down to the bottom. And lastly we have our coveted black mass. And this is where we find the cobalt, the lithium, and the nickel. It feels a lot like black mud. The elemental metals can be infinitely recycled and 95% of the batteries that go through this system are collected in one of these three bags. Lithium batteries are extremely recyclable and Li-Cycle's doing it right here in Arizona. It's like a bunch of forbidden chocolate. The batteries are collected here in the United States, recycled here in the United States, and probably made into brand new batteries using this, right here in the United States. Super fun seeing this process. I do have to fly home though so I'm not taking this with me. Right here in Arizona is an above ground lithium mine that's processing batteries instead of earth. It generates 70% less emissions recycling and reusing the battery than it would be if we were mining it straight from the earth the first time around. This Li-Cycle Spoke in Arizona has the ability to process up to 18,000 tons worth of lithium ion battery material every single year. The black mass will go onto Li-Cycle's Rochester Hub facility in New York, which is currently under construction. The black mass gets processed right back into valuable battery grade materials, like lithium carbonate, lithium sulfate, and cobalt sulfate. Hit that subscribe button if you want to see how that happens. The Rochester Hub is expected to be the largest source of recycled lithium carbonate in North America. At this point in the video you're probably asking yourself, 'Hey Jerry, but what am I supposed to do with my drawer full of old cell phones and batteries I haven't recycled yet?' And I have the answer for you. 89% of the population here in the United States lives within 10 miles of a Call2Recycle drop of location, most often found in Home Depot, Lowes, Staples, or Office Max. Old batteries and cell phones go in and they're shipped to a recycling place just like this so they can be turned into your next cell phone or next EV. So now if you see someone online suggesting that lithium batteries are thrown into landfills or not recycled, this would be a good video you can share with them. It's a pretty fascinating process. Huge thanks to Li-Cycle for letting us come tour their massive facility. I learned a lot today and I hope you did as well. Hit that subscribe button if you haven't already. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "batteries",
        "lithium batteries inside",
        "lithium batteries",
        "lithium",
        "battery",
        "United States",
        "batteries inside",
        "black mass",
        "recycled",
        "inside",
        "black",
        "LiCycle",
        "lithium ion battery",
        "lot",
        "liquid",
        "States",
        "mass",
        "process",
        "United",
        "Arizona"
    ],
    "transcript_entity_values": [
        "Arizona",
        "10 miles",
        "95%",
        "The Rochester Hub",
        "Lowes",
        "three",
        "Rochester Hub",
        "North America",
        "Jerry",
        "every single year",
        "Li-Cycle's",
        "Home Depot",
        "thousands of pounds",
        "This Li-Cycle Spoke",
        "a ton",
        "Li-Cycle",
        "89%",
        "Staples",
        "North America's",
        "Max",
        "EV",
        "the United States",
        "Gilbert Arizona",
        "first",
        "up to 18,000 tons",
        "today",
        "70%",
        "One",
        "Nokia",
        "one",
        "New York"
    ],
    "transcript_entity_types": [
        "GPE",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "LOC",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "ORG",
        "LOC",
        "PERSON",
        "ORG",
        "GPE",
        "PERSON",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE"
    ]
}