{
    "id": "s3-3sMVynm0",
    "title": "Why Does an Android Flip Phone Exist?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-02-22T15:57:11Z",
    "video_url": "https://www.youtube.com/watch?v=s3-3sMVynm0",
    "category": "Science & Technology",
    "tags": [
        "android",
        "smartphone",
        "flip phone",
        "unboxing",
        "tech",
        "phone",
        "budget smartphone",
        "gadgets",
        "technology",
        "review",
        "2018",
        "austin evans",
        "why does this exist"
    ],
    "views": 632535,
    "likes": 17201,
    "comments_count": 1906,
    "description": "For $50 does a flip phone that runs Android make any sense? This amazing (smart?) phone on Amazon:  Why Does The Apple Homepod Exist?   Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "http://austin.tech/androidflip",
        "https://www.youtube.com/watch?v=cRIMXst9u9o",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey, guys, this is Austin. This is a flip phone that runs Android, and my only question, as always, is why does it exist? So this is a Target clearance special. I was walking around the corner, I saw this for a whopping $50, it's hard to say no. The first thing I noticed is that this looks enormous, so actually do we have a flip phone around here? So for some context, this is the size of a normal flip phone, you open it up, you hold it up to your face, very normal looking. However, when you look at it compared to this, it's like (laughs) twice as big. Hey, we are activated, alright. Let's enjoy the wonders of our ZTE CYMBAL-T. Okay, okay, so actually you do have a keyboard on the display. Man, this is gonna be (laughs), this is very bizarre. I don't think I've ever typed like this before. I feel like the way to actually do this is to hold it in one hand and just do a single hand for typing, this actually doesn't feel like the worst thing I've ever done. It's up there. So we are set up with our Android flip phone. And at first glance, you're actually getting the full Android experience. We have the play store, we have Google Chrome, Gmail, even YouTube. One thing this does have is actual hard buttons for your Android keys. For example, I have my back button, I have home, I even have multitasking. Once you get going, it's not like the slowest thing I've ever tried. There is a decent quad core processor inside. It's just a slightly un-ergonomic experience. So the first thing to do when you're putting a flip phone to the test is trying to make a phone call. Jimmy? - [Jimmy] Yeah. - How do I sound? - [Jimmy] Uhhh, bad. - What do you mean bad? - [Jimmy] It's just like, it's grainy and it's soft. And it's not very clear. - Okay, so maybe calls not the strong suit of the phone. However, let's try texting. Hi, Jimmy. So one of the best parts is when you have the keyboard up, it literally takes up the entire screen. I cannot even see the message he just sent me. (laughs) It also does have a secondary display, which only actually turns on sometimes. So you can see your battery life and time. So with blisteringly sharp three and a half inch, 320 by 480 display, I really expect that this is going to reset my expectations for what to expect with a high end device. Let's just start by playing this 4K HDR video. That seems reasonable. - iPhone ever, it has the biggest screen, smallest bezels, and is the first iPhone to drop the home button, but the question is. - Man. - Is it worth it? It all starts with the design. - (laughing) It's um, you know this is one way of watching videos. It's really crispy. I think 360p is really the sweet spot that everyone should watch all of our videos in. As long as you crank the brightness all the way up, you can see most of the colors, at least six or seven of them. I think it might be time to take this thing outside and really put it through its paces. Really kinda fully explore the outer capabilities of this performance monster. So, there's no way around it. A flip phone is never going to be as comfortable to use as a standard smart phone. When it comes to actually scrolling on the screen, you kinda have to hold it in this sort of weird way. But, if you can look past that, it actually does work pretty well as an Android phone. Take Chrome for example. Once you get into a web page, you'll find that it's pretty much the same as any other budget Android phone. So, loading the page is fine, scrolling is no problem. Really the only way that you actually notice that this is a flip phone is when you have to hold it by the screen. Especially because it has not only LTE as well as wifi, the experience really isn't that bad as long as you're fine looking like this all the time. Now, you're definitely not going to wanna play a ton of games on this thing, but you can play some simple titles such as 2048. One of the main issues here is that a lot of games you're going to run into issues because the screen resolution is very low, and the fact that obviously the internals aren't going to be incredibly powerful. But, for simple stuff, it actually does kind of work. I will say that there are some things about flip phones that I did kind of miss. Number one of course, is that flip. It just sounds so nice to be able to close it up. You can toss it in your pocket, set it down. It's not really something you have to worry about getting like something like a screen scratched or whatever. There are other advantages. You do have that removable battery. You're gonna get the headphone jack, the micro SD card slot. There are things that are actually kind of nice. However, the size of this. Once you close it up it's not that bad, but I mean even when you compare it to something like an iPhone 10, it is really chunky. You can carry it around, but definitely not as small as the old school flip phones. Even though it might look like a flip phone, we are dealing with a legitimate Android smart phone here. So, of course, one of the most important tests is the camera. The first thing I notice is that with the camera around back here, it is super easy to cover, but if I line it up here. I mean, that's actually not terrible. It's not exactly a super crispy picture, but it works. Supposedly this is 720p video. Um, it actually looks okay I guess. I'm gonna walk around here a little bit. Get a nice close up. Ken looking really professional here. I mean, you know, it exists. Hopefully that's not too bad. Woah, okay well this is an unexpected benefit. Because the phone is so big, it actually looks like I've got a selfie stick. Huh, alright, so if I press the center button, not my finest selfie, but it's actually reasonably wide especially considering just how far away you can get the phone. I'm actually mildly impressed. For $50, this is not the worst camera I've ever tried. I mean, mind you it's not the best by any stretch, but it works. I know I made a lot of fun of this phone throughout this video, but I'm gonna say that it is a kinda cool throwback. And, especially if you're someone who's coming from a current flip phone, it might not be the worst upgrade in the world. For most of us though, probably time to, you know, stick with the normal smart phone and not this monstrosity. But, I'm curious, what do you guys think about this smart phone/flip phone, whatever it's called? Let me know in the comments below, and I will catch you guys in the next one.",
    "transcript_keywords": [
        "flip phone",
        "phone",
        "flip",
        "Android flip phone",
        "Android",
        "Android phone",
        "thing",
        "smart phone",
        "Android smart phone",
        "Austin",
        "kind",
        "screen",
        "Android flip",
        "budget Android phone",
        "bad",
        "normal flip phone",
        "hold",
        "time",
        "smart",
        "phones"
    ],
    "transcript_entity_values": [
        "2048",
        "iPhone",
        "the next one",
        "320",
        "first",
        "three and a",
        "un",
        "Ken",
        "Gmail",
        "Austin",
        "50",
        "Jimmy",
        "4",
        "480",
        "one",
        "YouTube",
        "SD",
        "Target",
        "Android",
        "ZTE CYMBAL-T. Okay",
        "at least six",
        "One",
        "Jimmy",
        "seven",
        "LTE",
        "Google Chrome",
        "Android"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG"
    ]
}