{
    "id": "S3RQTIydUis",
    "title": "OnePlus 5 Teardown – Screen Repair, Battery Replacement Fix video",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-06-29T14:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=S3RQTIydUis",
    "category": "Howto & Style",
    "tags": [
        "OnePlus 5",
        "OnePlus",
        "One Plus 5",
        "OnePlus 5 teardown",
        "OnePlus 5 Disassembly",
        "How to fix oneplus",
        "OnePlus Repair Guide",
        "Screen Repair OnePlus 5",
        "Charging port fix",
        "Battery Replacement",
        "Android",
        "Smartphone",
        "Tech",
        "Review",
        "Unboxing",
        "teardown",
        "repair",
        "replacement",
        "battery",
        "screen",
        "how to",
        "fix",
        "screen replacement",
        "disassembly",
        "digitizer"
    ],
    "views": 901577,
    "likes": 16863,
    "comments_count": 986,
    "description": "The OnePlus 5 is OnePlus's most recent flagship released in 2017:  OnePlus 5 Screen:  OnePlus 5 battery:  Its dual camera setup makes it look similar to the iPhone 7 plus on the outside... but does it look the same on the inside? Only one way to find out and thats with a Teardown video. Come watch the disassembly video of the OnePlus 5 as I see how to replace the charging port, or a cracked display on my OnePlus five. If your battery starts to die in a year or two, after your warranty is not valid anymore, this video will help you see how it is done.   Check out the OnePlus 5 Durability video:   Awesome Smart Phone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad",
    "description_links": [
        "http://amzn.to/2sjBJfq",
        "http://bit.ly/2wk7Ywp",
        "http://bit.ly/2vO7wp3",
        "https://youtu.be/oUdYRw6DV38",
        "http://amzn.to/2s4rCa2",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "The OnePlus 5, the Android phone named after a first grade math problem, is on my desk and ready to be taken apart. Lets get started. [Intro] OnePlus is still using the rare T2 bit that is not normally included with most cellphone repair kits. Ill link a kit that includes the bit in the video description. The build of the OnePlus 5 is pretty similar to the iPhone which has 2 little screws at the bottom. Then I can slip my metal pry tool between the plastic rim of the screen and the metal edge of the phone. Its still very securely snapped into place so this takes a little bit of aggressive persuasion. I switched to a plastic tool in the middle of the process to avoid scratching the metal because I would hate to do any damage to this phone. And definitely take out the SIM card tray before you attempt any of this. Once we get that last clasp undone we get our first glimpse at the non-red battery. OnePlus used to include a brilliant red battery inside the OnePlus One and the OnePlus 2, but stopped with the red battery after the OnePlus X. The OnePlus 3 didnt have it either. I guess OnePlus didnt get the memo that internal beauty is just as important as external beauty. I have nothing against yellow, but red is definitely more cool. One interesting thing is that the charging port and the headphone jack are still attached to the back panel. Removing one Phillips head screw allows me to pull off the silver metal bracket on the motherboard and unclip the charging port. There are 4 screws holding the two components onto the back panel and once those are gone the ribbons can pull free. This is extremely convenient because the charging port and the headphone jack are some of the first things that stop working on a cellphone a couple years down the road, so its nice that they have easy replaceable access. Theres a little rubber ring around the charging port, but I would assume this is to protect the port from stress of plugging and unplugging and nothing to do with water resistance. Theres no adhesive around the port or around the lip of the screen, so I would not trust this phone anywhere near water. We still have no access to remove the battery yet but we can unplug it. Eight normal Phillips head screws need to be removed from the motherboard. Ill unsnap two more ribbon cables; they just unclip like little Legos. And one black wire cable. Finally the board can lift away from the frame, giving us access to unsnap the one remaining extension ribbon hidden on the back. Im using my plastic pry tool for all of this so I dont hurt any of the fragile electronics. The dual camera set up comes with two individual ribbons. The regular 16 megapixel camera is on the left and the 20 megapixel telephoto camera is on the right. Neither of which have the optical stabilization. All of the shake reduction is done internally - electronically, which isnt always my favorite. The front facing camera also has that same electronic image stabilization, no OIS, but it does come with 16 megapixels of its own. Ill snap the rear cameras back in like little Legos and then move back to the body of the phone. The little silver circular guy is the vibration motor. And now we have access to the extremely average looking, yellow and silver colored battery. I dont read Chinese real good, but Im going to assume this tab means pull. Luckily no heat is required for the removal of this battery. There are no magical pull tabs but its still pretty user-friendly. Ill give OnePlus a thumbs up for that. Making our way down to the bottom of the phone, there are 6 screws holding in the loudspeaker. Its a thin little guy with two golden contact pads on the back to receive the signal. The extension ribbon can come loose and then the larger ribbon on the left. The last little connection is probably for the capacitive buttons on the front of the screen. In the past, OnePlus replacement screens came without the frame installed, so to complete a screen repair youd have to heat up the old display, remove it from the frame of the phone, and reuse the same frame with your new display. You can check the video description for replacement screens. Im going to leave my display intact because the old screen will not survive the removal process and mine still works just fine. Now that the new screen is on Ill clip the 3 ribbon cables down into place including the extension ribbon for the motherboard. And Ill screw in the loudspeaker. This loudspeaker does not have the waterproofing mesh that weve seen in water resistant phones like the iPhone 7, Samsung or even the HTC U11. So once again, I would not trust this phone around water. There has been some false speculation floating around out there that this is a water-resistant phone, and thats just not true. The boring battery is back in place though. Before I can set the motherboard down I do have to attach the extension ribbon cable to the underside of the board. After thats clipped in I can drop the board down into the frame. Ill connect a few more ribbon cables and then the one wire cable, and make sure all those screws get back into place. Over here on the back metal panel, we have the charging port and the headphone jack that need to be screwed with their 4 screws. And I can plug it back into the motherboard right next to the battery connection. Both of those connectors get covered by the metal bracket and that last motherboard screw. Getting the screen to pop back in the frame was easiest for me by lining up the top first, getting those clips in place and then pressing down along the sides very carefully. Overall it was very nice opening up a phone that didnt require a heat gun. I might not approve of the battery color or the lack of optical image stabilization, and it is kind of nice to have water resistance on a phone, but I am a fan of this phone in general. If you havent seen the durability test, go check that out. And subscribe for more videos like this in the future. Its free and I have plenty more videos coming. Thanks a ton for watching. Ill see you around.",
    "transcript_keywords": [
        "Android phone named",
        "grade math problem",
        "Android phone",
        "OnePlus",
        "phone",
        "back",
        "charging port",
        "battery",
        "ribbon",
        "Ill",
        "port",
        "screen",
        "extension ribbon",
        "screws",
        "math problem",
        "ribbon cables",
        "grade math",
        "desk and ready",
        "Android",
        "metal"
    ],
    "transcript_entity_values": [
        "HTC",
        "OnePlus",
        "iPhone",
        "6",
        "OnePlus 2",
        "the OnePlus 5",
        "two",
        "Eight",
        "Chinese",
        "Legos",
        "4",
        "Phillips",
        "SIM",
        "a cellphone a couple years",
        "OnePlus One",
        "T2",
        "first",
        "Samsung",
        "Android",
        "16 megapixels",
        "3",
        "One",
        "16 megapixel",
        "20 megapixel",
        "the OnePlus X.",
        "one",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "EVENT",
        "CARDINAL",
        "CARDINAL"
    ]
}