{
    "id": "S9lsMVu3i1k",
    "title": "Samsung Galaxy Note 20 Ultra Unboxing!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-08-08T21:40:40Z",
    "video_url": "https://www.youtube.com/watch?v=S9lsMVu3i1k",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 465375,
    "likes": 16207,
    "comments_count": 1260,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today we're actually shooting a podcast right now and I decided that in the middle of the podcast I was going to do an unboxing so that we could just do the podcast and I could also unbox my Note20 Ultra 5G. - I'm excited for you. - [Justine] Me too, check this thing out. - [Jenna] I'm also here, hi everyone. - Jenna's here, and Jenna what do you have? - Well I already unboxed mine. - She already did. - I want you to be. - Okay yes, I don't want to see it. - Experience it for yourself. - Okay, this is really exciting. So if you guys are watching again on YouTube, this is apart of our podcast so you can go check that. I'll put links in the description. Anchor.fm/samebrain. And if you're wondering why it's called Same Brain, this is my sister Jenna. - Hello. - We tend to have a lot of the same thoughts, but sometimes we have different ones too, but for the most part. - [Both] Same Brain. - For the most part. - For the most part. - I was actually thinking about this the other day 'cause you're a left handed which probably utilize more of your right brain and I'm right handed which means I probably utilize more of my left brain. - I've learned a lot about myself trying to learn to solve a Rubik's cube, which I can. It's weird because some of the teaching styles of people that I've seen on YouTube, I absolutely cannot comprehend what they're saying. When they're telling me left and rights, clockwise and counterclockwise, that does not compute in my brain whatsoever. When they tell me to go left, I will instinctively not. It just takes me so long to think about which way left is, and that's really not normal, right? - Is it right or is it left? - What is the question? - Because you said right. - Right. - Oh, okay anyway. So yeah, that's what I was thinking. Also before, I couldn't fall asleep I was like, wait a minute, same brain? We both probably use different. - I see what you're saying. So the brain side that you're not using, I'm using. - Yeah. - Oh wow! - Fun, it's fun. - I just got that. - Oh, okay. - Because I was still processing. - That's totally fine. There's a loose wire connecting it. - No, there's a little bit of looseness. - You hit your head. - I did hit my head. - Anyway. - Ready, should we do like a. No. - No. (audience cheering) How about this? (magical chiming) - [Justine] Have you seen? I don't even know if it's in focus, because Tyler's not here so. - [Jenna] It'll focus eventually, we're relying on auto focus. - We love auto focus. - All you have to say is, f-f. - [Both] Focus on me. - [Justine] I'm lifting up the top of the box now for our audio listeners, and here it is, I'm looking at a very very very shiny screen. - Well you're gonna have to do it by the mic if you want to have a full audio effect. - Oh no no, I'm just taking it out now. I just wanna make sure they know exactly what I'm doing if they're listening. Jenna's opening up a bottle of water, she's taking a drink. Here it is. Okay I'm gonna flip it over. Wow, it that a sim card? Oh, they've conveniently. What is that? No that's a serial number. - It's just a sticker. I did the same thing. - Okay, let me take off the sticker. Now I'm gonna give you guys some real, real nice close up sounds. I'm peeling off the back sticker now, ready? Here we go. Oh, did you hear it? - Yeah, I mean yeah. - It sounded okay. Is there something on the front? There is one on the front. Okay get ready. Oh, I mean I'm hyped. - There's also stickies on the top but not really as important. - What I love is that the back of it has more of like a matte sort of texture, so it feels like it's not gonna slip out of your hand like a slippery seal. - Yeah, and I'm always real smudgy. I said in mine that I'm super smudgy, but I love also that the camera notch has like a kinda shiny. - Wow! - Like a shinier look to it. - Yeah. - It's very pretty. - [Justine] It's interesting because the camera bump, even in videos like I didn't realize how big that is. - [Jenna] It's big boy. - But the camera bump is essentially about the same size as the S20, but the body of the Note is actually slimmer, so that's kinda interesting. And obviously you wouldn't be a Note if it didn't have the S Pen. - I took out. (phone beeping) - Oh wow. - [Jenna] I took out the S Pen. - So the little pen has its nice little home. They also switched the side because I think on the Note10, I think it was on this side actually, so that's kind of interesting. I love the color. So the Galaxy Note20 comes in three colors, Mystic Bronze, Mystic Green, Mystic Gray. I like that green, that green looks really nice too. - It's pretty cool, yeah, it's a nice color. - The only thing with the Galaxy Note20 is it's more of a plastic phone. - [Justine] I've been watching a bunch of people's videos, I'm sure you guys have seen a ton of them as well, but I don't know which color I like the best. I mean I think the gold. - So with this you can now do shortcuts where you hold in this button and you do like a little like. - The latency has also been decreased, because before on previous Note devices whenever you would write you would be able to see the pen trail. Well now they've been able to eliminate a lot of that so it's almost like real time. - So I know I'm jumping the gun here, but if you do these little motions, it'll like go back or go home, so it's like really cool. So you just click the button on the S Pen, you do these motions, and they're like the little air shortcuts. - That's pretty cool. Let's see what else we have in this box. - Not much. - Okay, well we gotta look. - You have a USB-C. - Fast charger. Oh no no no no no, this is the super fast charger. Matthew! (Matty barking) - Matthew! - I'm upset. - He's upset. - I love. - He's growling. Listen to his little voice. - He's been speaking. Listen to his voice When he's calling for you - So it has USB charger, as always, anything else in here? No, okay. - Mean to be fair, I did tell you that. - What? - There's nothing else in there. - There's nothing else in there. - Note20 Ultra has the 6.9 inch display. - Where as the Note 20 has the 6.7 inch display. Man, I'm hyped to try this out. Hey, turn on. Let's go. - Mine's already on and I'm already drawing. - So I guess now we just go to yours because yours is already set up. - Yeah, come on over. - Man, this camera looks amazing. I haven't got to take any photos yet. On the Note20 Ultra, it does have a 12 megapixel ultra wide camera, 108 megapixel wide-angle, 12 megapixel telephoto, and a laser AF sensor. Now the Note20 not Ultra, it doesn't have the laser sensor. It just feels very top heavy. - Yeah, a little bit. I mean, it's got a big boy camera notch. - It does, but man, I'm so excited to test this out. This is cool. What are you doing, you taking some photos over there? - So what I was doing the other day was, it's like this, you can draw, you can use the AR on your front facing camera, and you can hit record. Okay, so I'm gonna hit record and I can do a little drawing. Also if you don't put the S Pen back in, it will give you a very aggressive alert. - Really? - Yeah, I'm like, what do you want? And I look down and I'm like, ooh. It's like put me back, I'm like okay sorry. - Just tried to connect to your wifi network, so it has her wifi network, and then under it it says very fast. - (gasp) Thank you. That is the best compliment I think I've ever received. - Do you remember your password? - Well yeah, I'm not crazy. - Well I mean some people have like super long whatever. - You know what? I'm excited that you're here because I can send you your video file with their file sharing transfer system. Well I wanted to try this yesterday when I was doing my unboxing, but I was like there's nobody here. - I'm here! - Okay, so nearby share. Right now it's popping up, it says that share instantly with people nearby. - Oh wow, the screen look amazing! It's 120Hz refresh rate. - 25% brighter. - What's the battery on this one? - Already said it, 4500mAh. - Really? - I'm excited! - Look look look look look! - Oh this is exciting! - It's happening. It's happening. To share devices turn by, you have to. Do I have to turn on Bluetooth, location, and wifi? - Yeah, turn it on. Come on, nearby share. - It's on, it's on, it's on. Oops I closed it, sorry. (Jenna gasps) Accept accept accept! Okay it's sending, it's sending! - [Jenna] It sent. - [Justine] Oh my god, there it is! Show them that you sent it! - [Jenna] I can't. - [Justine] I have the same thing. Oh my god this is incredible. That was actually very quick. That's cool. - Wow! - I also like that they did away with the, what was it? Like the 100x zoom? - [Jenna] Oh the 100 times zoom, yeah. - [Justine] A little aggressive. I think now it's 50, which is a little bit more reasonable. I just feel like the 100, it just looked really not good. - [Jenna] It was a lot, I mean. - The fact that you could do that on a smartphone I think was really cool. It was kinda showing like the possibilities, like this is something that you could potentially do in the future and make this look really cool. Props to Samsung for like going all out. - They went for it, they went for it. - They definitely went for it. - I mean, I definitely tried to use it but it's like if you're trying to do it handheld and you're not stable, it's gonna be a blurry mess. - Yeah. - I was not stable. - Dude, this screen look amazing. It's telling me. - Wait until you do a little drawing. - That it needs to connect to a charger. Oh geez, oh gosh, I'm. - Here, use me as a charger! - (gasp) I can charge myself off of you. - Oh wait, do I have to turn it on? - Yeah. This is cool. - Okay, all right. - I love that it has wireless charging. I'm definitely looking forward to doing a full review on this so that will be coming out, let's see, in a few weeks I think. As soon as I can get some time to spend with this. Wireless power share. You just hit that. - [Jenna] Okay. - So now I am going to charge me on you. - Okay, just don't put your camera on my camera 'cause it might scratch. Okay you put your camera directly on my camera. - No I didn't. You're camera, they're separate. My camera's not touching your camera. See, they're opposite. - Oh okay, I got worried. So now you're charging your phone on my phone. - So some other stuff that they announced, called the UNPACKED event so they unpacked a lot. I mean they freaking unpacked so much stuff. So they came out with an update to the Samsung watch. You guys know I'm a huge fan of smartwatches, so they have now integrated blood pressure, oxygen levels, ECG, and of course just regular heart rate, and they also have Samsung Fitness. Did you see that? - [Jenna] No I didn't. - The event was very long. - It was kinda long. - It was very, very long. - I had to do some other stuff but I watched some of it. - And every single Youtuber had posted their videos already so I was like, I kinda wanna watch like my friends and support them. The Samsung Fitness was actually really, really cool. So they did this demo where the girl had her Samsung Watch on. It integrated with the fitness app that they have, like Samsung has all these workout activities, like I had no idea this was a thing. - Yeah, I didn't either. - No, and she was watching that on the television and doing the workouts on her watch and then you're able to pause the workout on your watch, but it all syncs up to like the Samsung Health which was really cool. - You been talking about the blood oxygen for quite some time now, like something that you've wanted in a device. - Like for years. - A long time. - Here's the problem, is a lot of that stuff takes a lot to get through like the FDA and like health clearances because you don't want to be like freaking people out wearing these devices and then you start getting a high blood pressure when it's not entirely accurate, especially like those wrist wearing blood pressure monitors. - Oh gosh, those are not accurate. - They're not, so I think that's really hard for a device to be able to be that one said device that is gonna be able to do it all. - For sure, for sure. - So let me see, I'm just gonna look it up here real quick. - You're gonna have to do it right if you're gonna do it. Also you're still recording on that if you're interested in that, that's cool. - [Justine] I'll stop that. - I will say though with my Apple Watch like, there was a time I fell down on purpose and it's like, did you fall? I was, I did. Another time I feel down running up the steps. I tripped, I actually hit my arm really, really hard. It looks like you're taking a tumble. I was like, I did but I'm okay. The fall accuracy of the Apple Watch is pretty impressive. - There was something that I was reading today talking about the update to the Apple Watch and the fall detect because obviously they're talking about if Samsung came out with this, what's Apple gonna do. Using the Apple Health, like if you were to fall and you don't respond, it would be able to call. - Your emergency contacts? - Emergency contacts, but it would also call for like 911 or whatever, and then it will read off what has happened. So it will say so-and-so may have fallen, they're not responsive, this is their current heart rate, this was their heart rate before the fall, this is. - This is Apple or Samsung? - No this is Apple. - This is Apple, okay. - And it would be able to tell them like what medication you're on and it would be able to pull from your health data that is already integrated into your phone. And obviously this is something that you would have to give access to and allow to happen, but if this is like a life or death situation like I don't care if my watch is telling the authorities my heart rate, my weight, my height, like all of this information, like that needs to be known ahead of time. - No, for sure. - Especially like blood types and stuff like that. - Yeah, very important. - Still don't known mine. So now it's the end of the podcast. Jenna, let's see what the charging is at. So this is wireless charging, it says three hours, 22 minutes until full. - Not bad. - I basically be sucking the life out of your phone to give me life. - I like it. - So cool, the wireless charging works. I am definitely looking forward to checking this out. I absolutely love the color. Guys, thank you for watching. If you guys want to check out the full podcast where we talked about a lot of stuff but also a lot of nothing. - A lot of nothing. - I will put a link in the description. Anchor.fm/samebrain. If you guys want to check out Jenna, she also did an unboxing slash jennaezarik. And there goes the dump truck. - We had to open the door because Matty wanted to go outside to sunbathe. - He did. - This is a silky little machine. I'm excited for you to test it out. - Me too. - Silky. - I have to set it all up. I'm gonna go draw some pictures. - The S Pen feels real good, it's nice and responsive and super smooth, so I'm excited. - Cool, I'm hyped. All right, I'll see you guys later. Thanks for watching. - [Both] Bye. (upbeat music)",
    "transcript_keywords": [
        "yeah",
        "camera",
        "cool",
        "Samsung",
        "Apple",
        "Apple Watch",
        "watch",
        "lot",
        "Pen",
        "Brain",
        "guys",
        "Samsung watch",
        "Jenna",
        "love",
        "Justine",
        "time",
        "Ultra",
        "left",
        "Samsung Fitness",
        "wow"
    ],
    "transcript_entity_values": [
        "a minute",
        "Matty",
        "6.9 inch",
        "108 megapixel",
        "Ultra",
        "Justine",
        "Apple",
        "50",
        "the Galaxy Note20",
        "the Apple Health",
        "three hours",
        "ECG",
        "years",
        "three",
        "a ton",
        "Mystic Bronze",
        "Samsung Fitness",
        "Bluetooth",
        "the fall",
        "AF",
        "YouTube",
        "100",
        "120Hz",
        "Samsung",
        "Matthew",
        "Mystic Gray",
        "the Samsung Health",
        "4500mAh",
        "22 minutes",
        "12 megapixel",
        "today",
        "a few weeks",
        "The Samsung Fitness",
        "6.7 inch",
        "Jenna",
        "911",
        "YouTube",
        "25%",
        "Tyler",
        "FDA",
        "Same Brain",
        "the S Pen",
        "Samsung Watch",
        "Apple Watch",
        "Rubik",
        "USB",
        "Anchor.fm/samebrain",
        "Justine] Me",
        "S20",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "TIME",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "EVENT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG"
    ]
}