{
    "id": "S_W73ouKtjU",
    "title": "How much 'Titanium' does iPhone 15 Pro *actually* have? -  NO SECRETS HERE!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-09-24T12:06:00Z",
    "video_url": "https://www.youtube.com/watch?v=S_W73ouKtjU",
    "category": "Howto & Style",
    "tags": [
        "iPhone 15 pro max teardown",
        "iphone 15 pro teardown",
        "iPhone",
        "apple",
        "titanium iphone",
        "new iphone",
        "ios",
        "iphone 15 pro max",
        "smartphone",
        "iPhone 15 pro",
        "titanium"
    ],
    "views": 8096599,
    "likes": 224478,
    "comments_count": 8913,
    "description": "Today we completely dismantle a new iPhone 15 Pro Max to see how much titanium Apple has overlayed onto their aluminum frame. Anker Nano USB-C Fast Charging Lineup for iPhone 15 on Amazon:  and on Anker.com:  According to lab tests, the 5,000mAh Anker Nano Power Bank can charge an iPhone 15 to 79%. Power loss from internal components may prevent a full charge.  Titanium is a really expensive material. Titanium is also EXTREMELY difficult to work with. But its really cool to see how Apple has assembled their new iPhone 15 Pro Max from the inside. We also take apart Apple's Tetra-Prism camera to see how the 5x Telephoto lens functions.   Get my Teardown Skin for your phone HERE:  Get my JerryRig Razor knife HERE:   Follow me for updates!  Instagram:   Facebook:   Twitter:    LARGE tool kit:   Travel Tool Kit:   Mega Tool Kit:   Plastic Pry tools:   Metal phone opening tool:   The camera I used to film this video:  (GH6   The Lens I used for this video:   Wide angle lens:   And this Metabones adapter:   This is the drone I use:    TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video. JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video. Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result. Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://ankerfast.club/HNUBgh",
        "https://shop.anker.com/21iTX8",
        "https://www.dbrand.com/teardown",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://amzn.to/3JEuTXs",
        "https://www.youtube.com/@JerryRigEverything/about"
    ],
    "transcript": "My titanium iPhone 15 Pro Max has had a very long, tired day, and it's not over yet. If we're going to get the lowdown on Apple's newest titanium smartphone, this first day of my iPhone's life will also need to be his last day. And it's only fair we give him one last sip of electrons before he goes. My channel sponsor, Anker, just released a brand new 10 ,000 milliamp hour nano power bank with a built-in USB-C cable capable of charging up an iPhone 15 from 0-50 % in just 30 minutes. It can charge up 3 devices simultaneously and has a little countdown timer display with a percentage so we know just how much juice is left. Didn't know I wanted that until I saw it. If you're looking for an even smaller nano bank, this guy's got a bi-directional charger that both recharges itself and charges other devices with the same little flippy port that's long enough to reach up through a protective case. And it still has enough capacity inside to fully charge up even the biggest iPhone. And finally, the trippiest charger of the bunch, the Anker Nano 6-in-1 charging station. Check this out. Not only does it store super flat on a desk or something so you can use the USB ports, but when you go to plug it into a normal prong device, it rises up to meet the occasion. I almost want to take this thing apart instead of the iPhone. The Anker Nano 6-in-1 is great for traveling since it's small when you don't need it, and big when you do. Anker's been charging up all of my personal phones for the last 3 years, and you can check out all the chargers and their colors with the link in the description. Now it's officially time to say goodbye to our iPhone 15 Pro Max. Farewell my friend. The goal of this teardown is to accomplish a few things. One, see if we can find that unholy junction of titanium and aluminum inside the frame. And two, I've got to see the inside of this new 5x tetraprism telephoto lens. With the two pentalobe screws removed near our new USB-C port, we are well on our way to getting answers. With some heat and a powerful suction cup, and my handy dandy jerry rig razor knife, I can slice between the plastic bezel of the screen and the titanium edge of the phone. Titanium is just fun to say. This removal process is much harder than it looks by the way. The first time screen repairs are usually never successful. With the IP68 glue cut away and the brackets lifted up and out of the frame, we get our first look inside the iPhone 15 Pro Max. It's clean, organized, and an absolute nightmare from here on out. A new cute little addition though is this springy foil tape stuff on top of the camera unit, loudspeaker, and taptic engine. What is this for you ask? I have no idea. The battery has a warning, trained technician, serviceable only. And good news for us, I took a karate class once when I was 10, so I'm definitely a trained technician. Ka-chow. Was that Lightning McQueen? To unplug the battery we use our first of four different screwdriver bits, a tri-point. There's 6 screws around the large main plate. And even though the 15 Pro Max is IP68 water resistant, Apple still stuck a little water damage indicator sticker in here next to the circuit boards, which will tattle on you if liquid ever gets inside. Apple doesn't trust nobody. The red bleeds through the sticker to make it pink when it gets wet. The battery plug is a convenient positive and negative icon on the Lego style ribbon connector. And then we can pop off the two screen ribbons. Not too shabby. With the very thin screen taken off and set to the side, we can use a plastic pry tool to pop off 11 more Lego style ribbon connectors from the motherboard. There are three standoff screws and a fourth tucked way up under the loudspeaker in the left corner, which is held in place by a few screws of its own. The upper loudspeaker doesn't have any foam balls inside, but that's okay. Now here's where things start to get interesting. There appears to be a ribbon leading over to the 5G antenna that's soldered to the back of the motherboard. Not super normal. And peeling it off the motherboard reveals that I was most definitely not supposed to peel it off the motherboard. There is a secondary ribbon that's probably for the rear wireless charger and stuff. We'll find out more when we take off the back glass. It's crazy that this little guy, this tiny little singular stacked motherboard, is the entirety of the iPhone 15 Pro experience. Every blue bubble, every message, every like, heart, thumbs up, emoji, smiley face, gif, picture taken, and video watched all happen right here inside a space no bigger than a human thumb. Apple says that 100 % of the copper and tin used in this motherboard has been recycled, which is pretty cool. The 12 megapixel front facing camera and sensor array come out next without any qualms. No OIS yet. The absolutely massive triple camera setup comes out next. These units probably take up more real estate than the entire motherboard. Apple says all the gold inside of these units has also been previously recycled. We have a 48 megapixel main camera at the bottom. Then the ultra cool 5x tetraprism camera in the middle, with the 12 megapixel wide angle camera up top. The side two units are the ones that do the spatial video thing for the goggle thing. I'm pumped to take apart the tetraprism later. Whoever came up with that name needs a raise. Sounds kind of like an old school Street Fighter move... tetraprism. With a bunch more screws taken out of the bottom of the phone, we get access to the Taptic engine, also using recycled tungsten, and our lower loudspeaker with it's waterproofing mesh over the opening. No visible balls on this speaker either, so that might just be an Android thing. Or Apple will invent it in a couple years. Check this out though, a bright neon orange gasket for the loudspeaker opening. Orange is the coolest. If this ain't a sign from Tim Cook to go buy an orange jerry rig knife, then I don't know what it is. Thanks, Tim. Now, another significant upgrade this year is the USB-C port. But just like with every iPhone released in the last decade, there are 17 trillion different sized screws holding it in place. So many in fact, that we're just not going to deal with it right now, and I'll deal with it after we get the back glass and battery off. The back glass I assumed would normally come off in one piece, however, mine shattered during the durability test and now wants to come off in lots of pieces. I also committed an ultimate blunder and accidentally had my camera off for most of the removal process. But don't worry, I saved the good bits for you. Like this wireless charging pad which is also made from 100 % recycled copper, and surprisingly the little magnets that surround the outside are also 100 % recycled. I have no idea how magnets get recycled, nor do I understand how magnets even work in the first place. If my back glass was in one piece, it probably would have been a whole lot easier to remove. The metal frame below the glass does appear to have a silver gleam of aluminum and not the tannish hue of titanium. I think we're getting close to finding out where the aluminum stops and the titanium starts. Looks like the large L-shaped battery does have magic pull tabs holding it in place, but I also have a full circle of access from the back that I can use to push it out and away from the frame. Apple's pull tabs are great and all, but they also scrunched them down so tiny next to the battery, making it pretty hard to grip them and use them. The Apple 15 Pro Max has a 4 , 441 milliamp hour battery that's made with 100 % recycled cobalt. I feel that's actually like a really big deal that nobody's talking about. I can remove a few more screws that are holding the 5G antenna to the frame of the phone. It looks like this is indeed what was soldered to the back of the motherboard. Super strange. I wonder if a Lego style ribbon connector on a cable this long just doesn't have the bandwidth needed to handle 5G. The whole phone design is kind of whack. It's like someone's friend owns a tiny screw factory and Apple is single handedly trying to keep them in business. With another 5 trillion screws removed from the charging port antenna, we can pull the USB-C 3.0 up and out of the phone. From C to shining USB-C, the world has finally come together for one gloriously symmetrical oval data port. Now when a phone gets anodized or PVD coated, this coating happens to the metal all at once. So when I see shiny bare metal inside of the phone, I know it's aluminum and a completely separate piece from our blue titanium that's on the outside. You can peek around the inner edge and see the blue titanium everywhere around the border. Even a little window through the aluminum into the titanium. Apple says they bond the aluminum chassis architecture to the titanium with solid state diffusion, an industry first, using a thermomechanical process that joins the metals with incredibly high strength. Personally, I think that extravagantly vague corporate speak means that Apple used an epoxy or thermoset of some kind to permanently fuse the inner aluminum with the outer titanium. Either way though, a very solid permanent bond has been formed.. .unless you have an angle grinder, which I do. No bond survives an angle grinder. To get an adequate cross section though, we need to cut the frame completely in half. I'm starting to think this phone isn't going to be put back together again. If we look really closely at the cross section of the iPhone 15 Pro Max frame, we can see the two different shades of metals. The silver aluminum on the inside, and the goldish hue of titanium on the outside. The thickness of titanium equates to exactly one millimeter, which by my estimate, based on the single sheet of grade 5 from our previous durability test video, is that there's about $30 worth of grade 5 titanium by weight in each of the iPhone 15 Pro Max's. It's definitely not a full titanium frame of course, more of a titanium adornment, but I by no means want to downplay the extreme skill and expertise it takes to work with titanium in the first place. It is not an easy thing to do, and the frame of this phone is still just as exquisite as every in-turn generated buzzword at the event said it would be. 10 thumbs up to Apple for doing something new. Speaking of something new, let's spend our last few minutes together finding the 5x Tetra Prism. None of the camera units have external optical image stabilization. Apple's using sensor shift stabilization on both the main camera and the Tetra Prism. I don't care about the other cameras though, I mostly just want to see how this 120 millimeter focal length equivalent gets its light rays reflected 4 times inside a glass structure. The cameras are all situated in one solid metal housing so they can transition seamlessly between themselves without one of them being squampus. With the back metal broken off and the camera torn into, we get our first look at the 3D sensor shift module. The camera sensor itself does the shifting just below the lens. The itty bitty copper coils on either side create energy fields to attract or repulse the center floating unit 10 , 000 times per second in true Street Fighter fashion. With the sensor removed we can check out the lens and Tetra Prism that are still in the housing. As my orange jerry rig knife, you know, the one that Tim Cook likes, passes over the lens we see it appear in the far side of the Tetra Prism which isn't aligned with the front of the camera lens. Kind of cool. And the same thing works in reverse. Prisms are nifty. Let's go deeper. The lens and the prism should be two separate units. Although still very much solidly connected in the same block of plastic, it's rather difficult to get them separated. But finally we have the round circular lens and the rectangular Tetra Prism in two separate pieces. The prism acts as a long telephoto lens in a pretty similar way that the periscope camera works inside of a Samsung phone. The coolest part of this iPhone 15 Pro Max though, is still the titanium. It's natural hue is so fine. I'm going to take this frame to an x-ray fluorescence lab to get a final verdict on what grade of titanium it is. It might take me a few days to find out though. And speaking of natural titanium, I had a lot of people asking how the natural colored iPhone holds up to scratches. The natural titanium does look phenomenal with my teardown skin on the back. The brush finish is super clean, but like any metal, it can be scratched and scuffs do appear. It'll probably just be ever so slightly less noticeable than the colored version since the PVD coating isn't accentuating the scuff. The titanium body is still something worth keeping protected. Buying a protective case, and of course the ultra portable Anker Nano charger, are always good ideas. Links are down in the description. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Pro Max",
        "titanium",
        "Apple",
        "iPhone",
        "Tetra Prism",
        "Pro",
        "camera",
        "Pro Max frame",
        "Anker Nano",
        "inside",
        "Max",
        "phone",
        "back",
        "frame",
        "Prism",
        "Anker Nano charger",
        "Apple newest titanium",
        "screws",
        "motherboard",
        "Anker"
    ],
    "transcript_entity_values": [
        "Anker",
        "000",
        "Tim Cook",
        "the last decade",
        "iPhone",
        "about $30",
        "Tetra",
        "Street Fighter",
        "just 30 minutes",
        "441 milliamp hour",
        "6",
        "the Anker Nano 6-in-1",
        "15",
        "Lego",
        "four",
        "a few days",
        "two",
        "the last 3 years",
        "Pro Max",
        "three",
        "3D",
        "0-50 %",
        "5 trillion",
        "12 megapixel",
        "half",
        "Tetra Prism",
        "nano bank",
        "4",
        "last day",
        "100 %",
        "11",
        "10",
        "nano power bank",
        "this year",
        "Tetra Prism",
        "5",
        "PVD",
        "Apple",
        "USB-C",
        "first",
        "second",
        "5x",
        "Tim",
        "Samsung",
        "120 millimeter",
        "10",
        "Taptic",
        "Android",
        "PVD",
        "3",
        "fourth",
        "our last few minutes",
        "this first day",
        "48 megapixel",
        "USB",
        "17 trillion",
        "Pro Max",
        "Anker Nano",
        "one",
        "Pro Max's",
        "a couple years"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "MONEY",
        "NORP",
        "PRODUCT",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE"
    ]
}