{
    "id": "sAbhPeTp51s",
    "title": "The Compact Disc: An Introduction",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2018-08-26T13:33:26Z",
    "video_url": "https://www.youtube.com/watch?v=sAbhPeTp51s",
    "category": "Science & Technology",
    "tags": [
        "CD",
        "compact disc",
        "digital sound",
        "technology",
        "laser",
        "laser diode",
        "CD-DA",
        "red book",
        "compact disc digital audio",
        "CD player",
        "laserdisc"
    ],
    "views": 760086,
    "likes": 21900,
    "comments_count": 1595,
    "description": "You can support this channel on Patreon!  Link below. The Compact Disc.  Just, like, radical man.  Lasers making the music?  What will the technology wizards think of next?  In this video we take a first look at the compact disc and its underlying encoding.  Soon well be looking more into CD players and their laser pickup systems, so be sure to subscribe if you havent already!  Links!  The How Its Made episode on CDs.  Really good, but why they skipped the mastering step is beyond me!   The Laserdisc Playlist:   The really great source material on CIRC:   Technology Connections on Twitter:   The Subreddit:    You can support this channel on Patreon!  With the support of individuals like you, this channel has transformed from my weird hobby into my job.  Its my goal to keep this channel completely independent from outside sponsorship, and thanks to Patreon supporters thats more than possible!  If youd like to pledge some support of your own to keep the channel free of outside influence, as well as to help it grow, please check out my Patreon page.  Thanks for your consideration!   And thank you to the following Patrons! Hank Eskin, Brady Brown, Giacomo Scaparrotti, Winfield Trail, Luke Biddle, Marc Ethier, Joseph Hill, John Semander, Bill Basch, Robert Toth, Magnus Tranum, blouerat, PK, Richard Lindsey, Lars JJ, Patrick Musson, Matt Taylor, Johan Schoeman, Thomas Jew, Josef Citrine, Marcus Schwartz, Ryan Cozzubbo, Christopher Bassett, Julian Rapoport, Ed Hall, Jason Portwood, Jesse Cardone, Michael Snowden, Drew McClain, Boh00711, Jon-Andr Haraldstad, The8TrackKid, Daniel J Schless, Sebi Jecklin, Casey Kikendall, Craig Leverenz, Charlie Hankin, Andres Plaza, Revenge, Matthew Baron, Andr, Gerald Monaco, Tab Patterson, Jason Weathered, h.drew foy, Roger Beal, Gantradies, Chris Hartl, Steve Stone, Brian G. Shacklett, Colton Aubrey Hooke, Paul Mills, Christopher Luna, Kotanu, Brendan Terrett, Techmoan, Mike Mason, Elijah Reeds, Christopher Jett, Justin Talbot, Steven Metcalf, Verysofisticated, Lolucoca, John McLusky, Ashleigh R, Stephen Bell, Logan Beenken, Eric Wood, Stephen Pick, BlancoGrande, Matthew Giraitis, James Ryan, Robert Joscelyne, Francis Fisher, Kedar Deshpande, Lukas Komischke, Dave Anderson, Felix Freiberger, Dane Peterson, Brent LaRowe, Aerospyke, Kieran Cox, Hunter Schwisow, Logan Kriete, Rafa Wiosna, Adam D. Ruppe, Audin Malmin, Eric Hansen, Noah McCann, Jason R Scheuren, Rufo Sanchez, The War Academy, Yaniv, neko, Daniel Ch, Lee Wallbank, Grayson Lang, Neil Bronner, Carl Yazbek, Jeffrey Grajkowski, Christopher Splinter, Eric Merrill, Stefan Berndtsson, Michael Sims, Seth Kneller, Clint Eisinger, Jesse G. Donat, Christopher Leidich, Mike Friedman, Svante, Andr Waage Srensen, Ed McCloskey, Philip Daniel, Jasper Thun, Camilo Rodrigues, Dusan Dzelebdzic, Sam Douglas, Sam Redfern, MagicMatteo Dont see your name?  Dont worry!  To keep this little perk alive, the $5 patron shoutout is now on a rotating basis!  If youre not here, you should be here in one of the next two videos.  If youve slipped through the cracks, dont hesitate to send me a message via Patreon and Ill fix it!",
    "description_links": [
        "https://www.youtube.com/watch?v=ut_40U0t9pU",
        "https://www.youtube.com/playlist?list=PLv0jwu7G_DFUoByWSHHoSTlUIxY7VkJLi",
        "https://books.google.com/books?id=yws55Rx1orEC",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections/",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Lasers! Rainbows! The eighties! Drum Machines! Digital! Big hair! This is some righteous stuff! No kidding, the compact disc was a radical departure from how, well really how a lot of stuff worked. You could argue that the CD, with its vast data capacity, relatively robust nature, and with the further developments it spurred along, changed how the world did virtually all media. That is at least until physical media became the seemingly undesirable thing it is today, a time when streaming services and libraries on hard drives are all the rage. Unless of course its vinyl, then by all means please build your collections. Wow the snarks coming early today. Well, this is the third video in a series on digital sound. You can find a playlist to the previous two videos, in which we covered how digital sound works (as well as the Nyquist-Shannon sampling theorem), but for now, sit back and relax as you feast your eyes on the silver platter that is the compact disc. No discussion of the Compact Disc is a good discussion unless it pays homage to its predecessor, the LaserDisc. Now, Ive done a series on Laserdisc if youd like to learn more, but in brief, this was the very first commercial optical storage format. First released in test markets in 1978, Laserdiscs were usually 12 inch or 30 centimeter discs, and they were an analog video format, holding up to one hour of video per side. Competing in a world where the videocassette recorder which could record from live TV already existed, the Laserdisc failed to capture the hearts and minds of many individuals even though it had steller video quality. Throughout its life, it stayed a videophile-only format in most markets. But, the development of the Laserdisc, which was done in large part by Philips, presented an obvious solution to the problem of digital sound storage. See, although Laserdisc is an analog format, the signals encoded on it are as a series of pits and lands. OK, optical disc fundamentals time! You might already be aware of this, but optical discs are read by shining a laser up at a reflective disc that is covered with little pits. These pits are roughly one quarter as deep as the wavelength of laser light that will hit them. I ran into some inconsistencies regarding the exact depth of the pits, because the only source I found which specifies it has the wrong wavelength of light listed for the CD, but all you need to know is that when the focused laser hits a pit, the increased depth causes the reflected light to destructively interfere with the projected light, which reduces the overall intensity of the light reflected back. Thats actually a pretty neat part that often gets overlooked. Endless articles talk about the fact that the pits change how the light is reflected, but very few mention the destructive interference aspect of it. Ive shown this diagram before, and it perfectly demonstrates what happens. When the laser hits a not-pit, the light gets reflected right back down to the laser, and a prism reflects some of this into the photocell. But when it hits a pit, the destructive interference greatly reduces the intensity of the reflected light, so very little light hits the photocell. This is how a laser pickup system can tell the difference between a pit and a land. In the LaserDisc system, these pits and lands were used to encode analog video and audio signals via a weird hybrid of pulse-width modulation and frequency modulation-- Don't ask, its complicated --and the result is a usable analog video signal from a shiny plastic disc. So, having already invented a thing that used lasers to read information on a disc, when it came time for a digital music format to hit the scene, Philips was poised to knock it out of the park with a new disc, this one no less lasery, but quite a bit more compact. They named the format along the lines of their previous compact invention, the compact cassette, and in a non-coincidence, the diameter of the CD is roughly the same as the diagonal length of the Compact Cassette. Ah, but lets not forget Sonys role. Sony, the people who seem to only make either runaway successes or disastrous failures, had been working on digital audio for some time. They were the ones that developed a PCM adapter for use with U-Matic videocassette recorders as discussed in the previous video, and in fact they were working on an digital optical audio disc before Philips released the Laserdisc. One of their early prototypes from 1977 was the same size as one of these honkers and held only an hour of digital audio, though at the same exact quality of the soon-to-be Compact Disc-Digital Audio standard. Philips and Sony were sort of working on the same thing at the same time, though Philips had the notable advantage of having already developed and manufactured the Laserdisc by the time things really heated up. Still, Sony contributed a lot. I dont want to get too into the weeds of who did what, so lets just jump to 1979, the year that Sony and Philips first decided to for realsies collaborate on the project. By this time, optical disc fundamentals had been established. An optical disc seemed the perfect format for digital data, because you could just easily call a pit a one and a land a zero. But thats not how it works! No, the pits and lands are important, but it is the change between a pit and a land that encodes a 1, and no change encodes a zero. This is time-based, so a four-bit span of time which is comprised of either all pits or all lands will produce 4 zero bits. Start the sequence with a change and then continue as is, and you get 1000. No change, change, no change, no change, and you get 0100. And you get the idea. This is called Non-Return-To-Zero inverted encoding. Now, this has limitations because a long span of zeros requires an outside clock to keep track of how many dead spaces have passed. The longer you have between ones, or changes, the more ambiguous the number of zeroes becomes. I know what youre thinking. Was that six zeros or only five? Well, to tell you the truth in all this excitement I kinda lost track myself. Which is why you need an outside timing source keeping track of how many shots, I mean bits, have passed. This isnt somewhere you should just feel lucky. But thats not a problem. What is a problem is the nature of everything. How likely do you think it is that a pressed CD is absolutely perfect, has no scratches at all, and that the CD player reading the disc will perfectly, without any errors, reproduce the correct sequence of ones and zeros? If you answered not likely at all youre a winner! To help make the data less susceptible to stupid little things, two robust error-fighting mechanisms are built into the data stream. The Red-Book standard, the first of the Rainbow Books that defines the physical, digital, and other various standards surrounding each type of Compact Disc, not only specifies the sample rate and bit depth of the Compact Disc Digital Audio format, which as previously discussed is 44.1 kilohertz, 16 bit, but it also defines how the data is encoded on the disc. Now this is rather technical but I think interesting, so bear with me. So, each audio sample is a signed, which means it can be positive or negative, 16 bit twos complement, which is a mathematical operation on binary numbers that were just gonna not worry about right now because it hurts my brain, integer. I mean, we knew were dealing with 16 bit audio so each sample is gonna be 16 bits. Now, on the disc, 12 samples, 6 each for the left and right channels, are stored together in a frame of 192 bits (thats 24 bytes, for those playing along at home). These frames are then encoded using an error correction scheme called CIRC, which stands for Cross-interleaved Reed-Solomon coding. In addition to adding one data parity byte to every three raw data bytes, the effect of CIRC is basically to spread the data out over a longer distance. Thats where the interleaving part of the name comes from. By jumbling up multiple frames and adding parity bytes, CIRC can correct up to 3,500 bits of error-filled or even missing data, and can compensate for up to 12,000 bits by masking errors via interpolation. This translates to up to 2.4mm gaps in data being completely corrected for, and up to an 8.5mm scrambling of data, either through a scratch or some other damage, being reasonably interpolated and masked. The end result is that the error is either completely corrected, or its fudged well enough that you wont hear it. Now were gonna go on a minor tangent here. I apologize. Ive linked in the description the source material from the Wikipedia article on CIRC. This source material is from a book written by Kees Schouhamer Immink, one of the central engineers involved in the development of the Compact Disc. He even won an Emmy for his work on coding technology for optical recording formats. Im bringing this up because for every person that tells you Wikipedia is a worthless starting point for research, I want you to show them the references section at the bottom of articles. Yes, you would be very unwise to cite Wikipedia in any research, but let me tell you, you may be amazed at the quality of the source material, and youd be a fool to not at least look at these references when doing any preliminary research of your own. Rant over. In addition to CIRC, the use of eight-to-fourteen modulation limits the total number of possible combinations of ones and zeros. EFM translates each 8 bit word into a 14 bit word. These 14 bit words are translated back into their original 8 bit words using a lookup table. The point of doing this is to reduce the possibility of errors. The use of EFM makes it such that binary ones are always separated by at least two zeros, and a maximum of 10 zeros. This means that every pit and land is at least 3 clock cycles long. It also means that if the CD player reads one, zero, one, it knows it must have made an error because thats not a possible sequence. Plus, with a maximum of 10 zeroes, it reduces the accuracy required in the clock of the CD player for worst-case clock recovery, as there must be a one after every eleventh bit, and this will in effect synchronize and restart the zero-counting clock. Keep in mind that with simple 8 bit encoding, in theory you could have 14 zeros in a row. When you realize all of the processing that has to be done by the CD player before it can even extract the data it needs to send to the DAC and play the dang music, you gain a newfound respect for its achievements of the time. Granted, using a look-up table and performing some basic arithmetic is easy for a computer, but the fact that this was being done at a consumer hardware level in 1982, with a data throughput faster than what any contemporary microcomputer would reasonably be expected to process, impresses me. To help provide logical access to the contents of the disc, the discs data stream is divided into three parts. The lead-in, the program area, and lead-out. The lead-in contains the discs Table of Contents, which is basically an announcement to the player of how long it is, how many tracks it contains, and what the timecode is for each of the tracks. The CD player can, through reading the table of contents, determine where each track is for accessing it nearly instantly. A CD can have up to 99 tracks, which themselves can be divided further into 100 indexes, though this feature was rarely ever used and few CD players could access the index information. One thing that computers have made a little confusing about the Compact Disc-Digital Audio standard is that audio CDs do not contain files. If you pop one into a PC, its gonna show you each track as its own object. But the computer is interpreting that for you. In raw form, the data on a CD is just one continuous stream, and the table-of-contents in the lead-in simply defines where along the stream each track is. The concept of using a CD for computer data storage just wasnt really in the cards yet. I mean, a single audio track would easily fill up entire hard drives of the time, so the idea of creating files to contain the audio data was just absurd. The later CD-ROM, following the Yellow-book standard, would allow for file structures on discs like a computer is used to accessing. But well get to that later. OK, so lets look a little bit closer at the disc itself. First, I want you to see if you can spot a big difference between a Laserdisc and a CD. Looking at the edge of a Laserdisc, can you see that seam in the middle? Laserdiscs are obviously double sided, so that seam is the join between the two halves of the disc, and the data is sandwiched between two sides. But if you look at the CD, there is no seam. One of the weirder things about the CD is that the data layer is actually at the top of the disc, just beneath the label. Ive linked to a How Its Made episode on the Compact Disc that does a pretty good job of demonstrating how mass-produced discs are made. Their manufacture is surprisingly similar to that of conventional vinyl records, as they are stamped (or rather molded) from a master disc. The video does a great job of showing this process, but it skips over the actual etching of the data onto the glass master. In short, the master is covered in a solution that will either evaporate or harden when exposed to laser light, depending on the mastering process used. By using the laser to etch pits into the coating, which is then hardened with a development process, the glass master is now covered in bumps that will represent the lands in the molded discs. The master disc is metallized to harden these bumps, and now polycarbonate discs are molded from it. And thats something that I find really neat about the Compact Disc. The data in stamped discs is actually in the plastic itself. When the disc comes out of the mold, its completely transparent. But it has all of the data on its surface. To make the disc readable, its then covered in a thin film of aluminum via a vapor metallization process, and now the disc could theoretically be read by a CD player. But remember, those pits and lands are on the top of the disc, exposed. If they could be touched, the data would be destroyed. So before the disc can be handled, it needs a thin coat of varnish to be spread along the top, and now the data is protected from damage. Putting the data layer on the top of the disc meant that the disc was even more tolerant of scratches, as these scratches are out of focus to the laser reading the disc from below. This was a pretty smart move. The laser would read through almost the entire 1.2mm thickness of the CD. As a consequence, double-sided CDs were never a legitimate thing. But there were some weird shenanigans tried with making double sided hybrid discs. One of these I have somewhere in my collection but I couldnt find it because Im disorganized, (sorry) is the DualDisc. Weird Al Yankovics twelfth studio album, Straight Outta Lynwood, was released in 2006 as a DualDisc, with one side being a fully compliant DVD containing music videos and other goodies, and the other side being a almost CD. DualDiscs were .3mm thicker than a standard CD or DVD, comprising a total thickness of 1.5mm rather than the standard 1.2. The CD layer was placed .9 mm into the disc, with the DVD layer .6 into the disc from the other side, which is correct for a DVD. But its off by at least .2mm according to the Red Book standard. Because of this, DualDiscs did not contain the Compact Disc Digital Audio logo on them because they technically werent CDs. They featured language saying that they were intended to work in standard CD players, and almost certainly they would given the tolerances a standard CD player is designed to deal with, but they could not actually be officially referred to as a Compact Disc. So theres some fun trivia for you. AAAND, thats where well hit pause. Theres a lot of neat stuff to uncover about the CD, even though its teetering on the edge of obsolete and insignificant. OK, it is pretty much obsolete. This dime-sized SD card holds more data than this entire column of CDs. Thats kinda sad, but also amazing. In my next video on this subject, well explore more of the innards of the compact disc, such as the optical pickups mechanisms and the rather major difference between how Philips designed its laser pickup compared to most others. If you take a look at the disc tray on this Magnavox unit, you might get a hint. Of course well also touch on the other various uses of the CD, such as CD-ROM, CD-R and CD-RW, and other stuff. And then, well relish in the fact that everything is on the Internet now. Thanks for watching, I hope you enjoyed the video! If this is your first time coming across the channel and you liked what you saw, please consider subscribing! As always, thank you to everyone who supports this channel on Patreon, especially the fine folks that have been scrolling up your screen. If youre interested in making a contribution to the channel to help it grow, please check out my Patreon page. Thanks for your consideration! Dont forget theres a Technology Connections subreddit now, so if youre a redditer you can go over there and watch me not know how to use it, and Im getting better a Twitter so if thats something you do, you can follow me @TechConnectify. Anyway, thats it for now. Ill see you next time! Cue obnoxious music! uncomfortably smooth jazz This line read better before With its vast data capacity, relatively lobrust this line. This line is going to kill me! When it came time for digital music formats to hit the scene, Philips was poised to knock it out of the par--poised? (stares into camera doubting himself) No, thats what I wrote. Thats what I wrote! Im regretting it now The Red Book Standard, the first of the rainbow books that define the physical, dizhidal, and other dizhidal dizidal diblelr. (clears throat) ...reduces the accuracy required in the clock of the CD player for weush [exasperated sigh] The master disc is metAL. Metalized.",
    "transcript_keywords": [
        "compact disc",
        "disc",
        "Compact Disc Digital",
        "Disc Digital Audio",
        "data",
        "compact",
        "discs",
        "LaserDisc",
        "audio",
        "Digital",
        "Disc Digital",
        "digital audio",
        "optical disc",
        "optical audio disc",
        "bit",
        "time",
        "pits",
        "laser",
        "master disc",
        "Philips"
    ],
    "transcript_entity_values": [
        "the Compact Disc",
        "roughly one quarter",
        "two",
        "Laserdisc",
        "up to one hour",
        "2006",
        "14",
        "only an hour",
        "Laserdisc",
        "1.2",
        "1979",
        "four",
        "Cross-interleaved Reed-Solomon",
        "one",
        "Wikipedia",
        "The Red Book Standard",
        "Twitter",
        "only five",
        "Philips",
        "Emmy",
        "Sonys",
        "44.1 kilohertz",
        "Sony",
        "8",
        "192",
        "Laserdiscs",
        "the Compact Cassette",
        ".9 mm",
        "Digital",
        "14 zeros",
        "up to 12,000",
        "Straight Outta Lynwood",
        "Non-Return-To-Zero",
        "first",
        "Compact Disc",
        "Compact Disc Digital Audio",
        "1.5mm",
        "100",
        "16",
        "early today",
        "0100",
        "10 zeroes",
        "Table of Contents",
        "three",
        "the year",
        "zero",
        "EFM",
        "1",
        "12 inch or",
        "24",
        "8.5mm",
        "eight-to-fourteen",
        "the Compact Disc",
        "PCM",
        "zeros",
        "Patreon",
        "today",
        "up to 99",
        "Kees Schouhamer Immink",
        "DAC",
        "Laserdisc",
        "between two",
        "eleventh",
        "Wikipedia",
        "Nyquist",
        "Philips first",
        "3,500",
        "six zeros",
        "1982",
        "2.4mm",
        "4 zero",
        "DualDiscs",
        "at least .2mm",
        "1978",
        "CIRC",
        "third",
        "at least 3",
        "1.2mm",
        "1000",
        "U-Matic",
        "1977",
        "6",
        "12",
        "SD",
        "Magnavox",
        "Technology Connections",
        "One",
        "30 centimeter",
        "First",
        "at least two zeros",
        "10 zeros",
        "Al Yankovics"
    ],
    "transcript_entity_types": [
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "TIME",
        "DATE",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON"
    ]
}