{
    "id": "SAzANepFscc",
    "title": "Samsung Galaxy Mystic White Z-Flip 5G and Mystic Red Note 20! ❤️",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-11-30T17:17:56Z",
    "video_url": "https://www.youtube.com/watch?v=SAzANepFscc",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 139698,
    "likes": 6295,
    "comments_count": 614,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- What do we have here? We have two new colors. We've got the new Mystic Red, and Mystic White. The Samsung Galaxy Z Flip was... Is my favorite phone of 2020. That's not to say that I didn't love the Fold too, but there's just something about this phone that just felt incredible, being able to flip that thing open, it was just really cool. Look at that box, oh, so cool. I was actually just reminiscing about when I got the original Z Flip. We went to the mall. We went all the way to Glendale, which is not actually that far, but when you live in the west side of Los Angeles, you might as well just charter a helicopter at that point. But I went and met John at the Samsung store because he had ordered two of these. So then I went and bought it off of him, and went to the mall. That was a really fun video. That was right before lockdown. (gasps) I'm so excited to see this, I'm so excited. It's so freaking fresh. I don't even know what to say. This is the perfect color. It's a matte finish as well. Look at that. Holy crap, this is beautiful. Oh my goodness. I'm smudging it up already. (ethereal music) Oh my god. Look at this! Just beautiful, iridescent, mystic white! Let's see what else is in here. Charger, cable. I mean, this is gonna kinda be a really quick video because you've already seen reviews of both of these phones on mine and everyone's channels. There's really not much else to say about it. Do you wanna get a closer look? Yeah, get in there. (upbeat hip-hop music) Even the little hinge has sort of an iridescent color. I guess a little shade of purple and a pink. Just enough to give it sort of that opal, kind of iridescent look. So now let's check out the red Note 25G. Take a look at this. Wow. I'm not a huge fan of the color red, but when it is on these types of devices with this kind of matte frosted glass back, it just really gives these phones a whole other look. It gives it sort of a dimensional type look. Look at that, wow, get closer, get closer, get closer. (upbeat hip-hop music) Okay, let's look at both of these together. Yeah, don't those look great? So I know this is kind of a short video, but I really wanted to show these to you guys because I really do love when they bring out different colors and different variations, and I feel like the more videos and more content that you see these in actual people's hands, the better that you're able to judge what the color would actually look like when you get it in person. So this is it, this is what they look like. I really, really... I really love this red. I'm wondering from you guys, though, what is your favorite phone that was released in 2020? Also, what is your favorite color phone that was released in 2020? Even if that's not your favorite phone from this year, you can still say that you like the color. Also, what do you guys think about these? Do you like the red, do you like the mystic white? Because clearly we all know I'm obsessed. I'll see you guys in my next video. Bye! (upbeat hip-hop music)",
    "transcript_keywords": [
        "Mystic White",
        "color",
        "phone",
        "Red",
        "Mystic",
        "Flip",
        "Samsung Galaxy",
        "favorite",
        "favorite phone",
        "kind",
        "closer",
        "video",
        "guys",
        "White",
        "Samsung",
        "Galaxy Z Flip",
        "sort",
        "iridescent",
        "Los Angeles",
        "love"
    ],
    "transcript_entity_values": [
        "The Samsung Galaxy Z Flip",
        "John",
        "Fold",
        "2020",
        "Glendale",
        "Mystic White",
        "Mystic Red",
        "Los Angeles",
        "this year",
        "two",
        "Samsung"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "GPE",
        "PERSON",
        "LOC",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG"
    ]
}