{
    "id": "scoCVAk7_JI",
    "title": "Beats X Wireless vs Apple AirPods!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-02-09T16:13:54Z",
    "video_url": "https://www.youtube.com/watch?v=scoCVAk7_JI",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "Beats",
        "Beats by Dre",
        "AirPods",
        "BeatsX",
        "Beats X",
        "Beats X Wireless",
        "BeatsX Wireless",
        "BeatsX Wireless vs AirPods",
        "BeatsX vs AirPods",
        "Beats Wireless vs AirPods",
        "BeatsX Wireless vs Apple AirPods",
        "2017",
        "vs",
        "tech",
        "unboxing",
        "review",
        "setup",
        "ultimate setup",
        "Best",
        "best wireless headphones",
        "AirPods Review",
        "BeatsX Review",
        "BeatsX Unboxing",
        "BeatsX Wireless Review",
        "BeatsX Wireless Unboxing",
        "Worth it",
        "BeatsX Worth it",
        "Austin Evans",
        "tld",
        "jonathan morrison",
        "beats",
        "headphones",
        "wireless headphones"
    ],
    "views": 1245615,
    "likes": 33148,
    "comments_count": 1740,
    "description": "Are the $150 Beats X Wireless Worth it?  Beats X Wireless vs Apple AirPods. Enjoy! Ultimate 2017 Office & Setup Tour!   The AirPods might be the best truly wireless earbuds out right now but how do they stack up vs the brand new Beats X Wireless? A complete comparison of the unboxing, setup, fit and sound quality!     Beats X Wireless -  Apple AirPods -   AirPods - 1 Month Later Review:   S/O to Ralphy for the blower action!    Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/ZvnZGLe1U3Y",
        "https://www.youtube.com/watch?v=jFHWfwPFP1E",
        "http://apple.co/2kXgACP",
        "http://apple.co/2htZc50",
        "https://www.youtube.com/watch?v=w7bk1L6XMeU",
        "http://www.youtube.com/ralphy",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo, guys, Jonathan here, and these are the brand new Beats X Wireless. Before we hop in, let's talk AirPods. Those have been out for a couple months now. I really enjoy them, but now that the Beat X Wireless is here, let's see how they stack up side-by-side. Without question, the first thing we gotta compare is price. Apple's AirPods come in at $159, whereas the Beats X Wireless are 10 bucks cheaper, so, as far as cash goes, they are pretty spot on. As far as what you get in the box: on the AirPod side of things you get the case, which also charges the AirPods, the AirPods themselves, some literature. You might not see it at first glance, but deep inside the packaging is a lightning cable. As far at the Beats go, you get the Beats X Wireless, a carrying case, which does not provide any kind of charge. You do, however, get customizable ear tips, so just in case these don't fit, you can swap 'em out and, in turn, get a better fit in your ear. Just like the AirPods, you also get a lightning cable. Unlike the AirPods, though, when you pick up a pair of Beats X Wireless, you get a code for three months of free Apple music, which I'm gonna flash in three, two, one. Now, just like the AirPods, the Beats X Wireless feature Apple's W1 chip, so pairing is stupid simple. For the Beats, you simply hold the power button with them next to your iPhone, an icon's gonna pop up, you hit Connect, and that is it. Also, like the AirPods, Beats X Wireless also feature iCloud connectivity, and what that means is you can instantly switch back and forth from, say, your iPhone to your Mac. Now, with the AirPods, one of my favorite features was the Apple Watch integrations, which is hands down my favorite way to control them, With the Beats X Wireless you also get that functionality, so the fact that you don't have to sacrifice that is really cool. One of the advantages I will say the Beats X Wireless have over the AirPods, no question, are inline controls. With the AirPods you have control through your phone, the aforementioned Apple Watch, which you have to buy separately or already own, or what most people will use, or potentially may not use is Siri, because I don't think many people wanna talk to their earphones to change the volume or change a song. With the Beats X Wireless you have all that functionality plus the ability to change a song, raise the volume, activate Siri right through the inline controls. While functionality between these two is very, very similar, the giant difference between these is design. AirPods, on one hand, are completely and truly wire free, whereas, with the Beats X Wireless, you do have a cable that, in turn, will run behind your head. Personally I will say I love the freedom of not having any wires whatsoever, but, on the other side, with the Beats X Wireless, having that cable almost adds a layer of security for some people, simply due to the fact that, because your ear pods are connected, you're gonna reduce your chances of losing half of your headphones. What I think it comes down to is the question of do you want the freedom of the wire free AirPods, or will you sacrifice that for that extra security and the inline controls on the Beats X Wireless? From there the question that comes next is how do these fit in your ears? With the AirPods, Apple kinda went with the one size fits most approach, so, if they don't fit in your ears, you're kinda screwed, but, in my case, because they do they're really locked in. With the Beats X Wireless, those also fit really Well] in my ears, and, again, on the plus side, if they don't fit out of the box, you do have those customizable tips, which is a definite plus. As far as pure looks go, I think it's safe to say the Beats X Wireless look better than the AirPods which always still look a little funny to me, but, looks aside, as far as my ears go, both of these fit really well. With the AirPods, surprisingly, those are not coming out of my ears no matter what I do, so, with that, I wanted to test out the Beats X Wireless. Starting with something as simple as shaking my head back and forth, the Beats X Wireless stayed in perfectly and did not fall out. Upping the ante, though, and playing a little basketball, schooling my buddy, Rich, once again the Beats X Wireless stayed in perfectly and did not fall out. (hip hop music) Finally, the only way I was able to get the Beats X Wireless to fall out of my ears was with a poorly-attempted front flip off a trampoline into some sand, so I apologize for what you just had to witness, but, if you appreciate the front flip attempt, go ahead and drop a like down below. As far as sound quality goes, I'm pretty familiar with the AirPods, so now it's time to give the Beats X Wireless a shot. Right ear in. Left ear. Immediately what I notice with the Beats X Wireless compared to the AirPods was, surprise, surprise, more bass. I think that has to do with how they actually sit and fit in your ears, where they're actually jam packed in there, but, conversely, going back to the AirPods after listening to the Beats X Wireless, those actually sounded a little bit thin. If we were talking solely sound quality and that was it I'm gonna throw it out there that most people out there I think would prefer the Beats X Wireless. I personally do think the AirPods sound a little more balanced overall, but, if you like that bass, definitely go with the Beats X Wireless. The other thing that I noticed immediately with the Beats X Wireless was that sound isolation seemed night and day better. With the AirPods, if you're not in a loud environment, they do the job great, but, once you get into a noisier situation like the gym, I often find myself battling the volume, trying to turn it up to battle the outside noise, but with the Beats X Wireless, though, those do a much better job of blocking that sound out, but to be sure I wanted to put it to the test. Right now, at about 50% volume I'm gonna pop this in my ear and let Ralphie hit it. (loud vacuuming) Hopping over to the AirPods, once again I had the volume set to around 50%. One advantage I do wanna point out with the AirPods, though, is the play/plause feature, so, because this isn't in my ear right now, right now the song is paused. Once I pop it back in there, the song will resume. That is something not available on the Beats X Wireless. With that said, though, sound isolation may be a completely different story, so let's check this out. (loud vacuuming) One leaf blower later, I can definitely confirm that the Beats X Wireless do a much better job at sound isolation over the AirPods, so, if that is something important to you, the Beats definitely take the cake. Besides that, breaking down smaller things like how you charge them, both the Beats X Wireless and the AirPods have really stellar options. With the Beats X Wireless you can get two hours of battery life with only five minutes of charge time, which is crazy. The AirPods, on the other hand, also hold their own really well where 15 minutes of charge time equates to three hours of battery life. One advantage you do get with the AirPods is, because you charge through the case, that is gonna give you multiple charges. With the AirPods by themselves, those are gonna last around four to five hours, but with the case fully charged, that's gonna get you nearly a full day. The Beats X Wireless will last longer on a single charge, around eight hours, but overall you're definitely getting more with the AirPods, not to say that the Beats X Wireless battery life is bad by any means, 'cause it's actually really solid, but it's just something to consider when you're comparing these side-by-side. Another really awesome thing with the Beats X Wireless is the fact that they actually clip together magnetically. If the AirPods had that, it would be game over. Overall, I think these are both fantastic options, especially if you own an iPhone. They will, of course, also both work with Android, but, if you wanna get the most out of these, you definitely wanna use iOS. With that said, though, if you are using Android, I would definitely grab the Beats X Wireless over the AirPods, because you're gonna get way more functionality, but, at the end of the day, it really comes down to whether you want the freedom and flexibility of the AirPods or the security of the cable with the Beats X Wireless and that extra layer of bass that you're not getting with Apple. Regardless, though, hopefully this helped ease your buying decision, but, if you're wondering how do these stack up against Jaybirds, my good buddy Austin Bolt Evans just dropped a video where I may or may not have raced and/or tackled him, which you can check out here, and subscribe if you haven't yet. This is Jonathan, and I will catch you guys later. Kobe!",
    "transcript_keywords": [
        "Beats X Wireless",
        "Beats",
        "Wireless",
        "AirPods",
        "Wireless feature Apple",
        "Apple",
        "Wireless stayed",
        "ear",
        "ears",
        "fit",
        "Apple Watch",
        "Wireless feature",
        "Apple AirPods",
        "sound",
        "Wireless battery",
        "Beat",
        "charge",
        "case",
        "prefer the Beats",
        "grab the Beats"
    ],
    "transcript_entity_values": [
        "two",
        "Siri",
        "a couple months",
        "Rich",
        "four to five hours",
        "iPhone",
        "Apple Watch",
        "Connect",
        "One",
        "around 50%",
        "three months",
        "15 minutes",
        "W1",
        "Apple",
        "only five minutes",
        "Mac",
        "AirPods",
        "Jaybirds",
        "AirPod",
        "two hours",
        "the Beat X Wireless",
        "about 50%",
        "The Beats X Wireless",
        "10 bucks",
        "three",
        "first",
        "half",
        "the end of the day",
        "one",
        "around eight hours",
        "three hours",
        "Beats X Wireless",
        "Kobe",
        "159",
        "Android",
        "iCloud",
        "Austin Bolt Evans",
        "Ralphie",
        "Jonathan",
        "the Beats X Wireless"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "NORP",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "TIME",
        "GPE",
        "ORG",
        "TIME",
        "PERSON",
        "PRODUCT",
        "GPE",
        "ORG",
        "TIME",
        "ORG",
        "PERCENT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "TIME",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG"
    ]
}