{
    "id": "sd8UfamDJOg",
    "title": "The IMPOSSIBLE Apple Challenge ft. @iJustine",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-07-24T16:29:20Z",
    "video_url": "https://www.youtube.com/watch?v=sd8UfamDJOg",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "ijustine",
        "Justine ezarik",
        "apple",
        "macintosh",
        "Steve jobs",
        "apple lisa",
        "Lisa ii",
        "Macintosh mouse",
        "airport",
        "time capsule",
        "pippin",
        "newton",
        "newton message pad 2000",
        "Macintosh tv",
        "QuickTake 100",
        "emac",
        "apple iic",
        "apple tv",
        "apple mouse",
        "Steve wozniak",
        "powerbook",
        "pismo",
        "g3",
        "g4",
        "imac",
        "game",
        "trivia",
        "challenge",
        "tech",
        "technology",
        "vintage tech",
        "gaming",
        "apple tam",
        "20th anniversary mac",
        "mac",
        "macOS",
        "newtonos",
        "osx",
        "ios",
        "ipad",
        "iphone",
        "ipadOS",
        "siri"
    ],
    "views": 215926,
    "likes": 8826,
    "comments_count": 635,
    "description": "Does @iJustine ACTUALLY know Apple?! EXPOSING Dave2Ds Tech  Can you TRUST Gameranx?! ft. Jake Baldino:  The IMPOSSIBLE Tech Challenge ft. Mrwhosetheboss:  Does MrMobile Know Phones?!  Does Sara Dietschy Know Tech?   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/53RBwdzW6fs",
        "https://youtu.be/e15q1y6cxtw",
        "https://youtu.be/wArC69nUF4I",
        "https://youtu.be/SPF8HXytAFs",
        "https://youtu.be/jNl04x5rmxo",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to This Is, where I have a very special guest on the show today. The one and only iJustine. How's it going? - It's going well. I'm very nervous about a trivia. I'm so scared. - The thing is, we have tailored this game specifically for you. Because you are out of everyone I know, by far the biggest Apple nerd. I feel like looking through these questions, you've got a good shot. - Alright, I'm ready. I'm gonna do my best, but sometimes my best might not be good enough, but that's okay. (laughs) - Well, the good thing is, all you do is hit 50% success rate. So we're going to ask you two questions per product. First of all, the product name, there's a little bit of wiggle room. So if you're very close, we'll give you the point, but get as close as possible, as well as the year that these device came out, and we were giving you a plus or minus one year handicap. So let's say something came out in 2005, it looks up 2004 or 2006 as a correct answer. - Okay. Beyond that, of course we have our classic This Is wager. If you can get that 50%, then we will tweet whatever it is, that you want, from our Twitter account. Rather than that, are you ready to begin the \"Who wants to be a Mac smarty pants?\" I think we need a better title for this. - You could've done who wants to be a Mac millionaire? Like, are you kidding me? That was handed to you. (laughs) - [Matt] We already did that one. We're in a pending lawsuit. - Yeah, we've been told We can't say who wants to be a rich person or whatever that show is called. We were not allowed to say no. - That's true. Okay, who wants to be a, I'll think about it. - Okay, all right. Let's begin with question number one. Oh, Oh. - Is this the. - While you're thinking about it, keep in mind there's no time limit. Think about it as long as you want, walk us through your thought process, and, just keeping in mind that you have 10 questions. You do have one lifeline available, which is Phone-a-Ken. - At first I wanted to say it was the Lisa, but it definitely isn't because I feel like the Lisa only had like one little, like drive on it. So it's not that. Well maybe they're, I don't know if there was like, two different versions because this, this basic setup kind of looks like the Apple Lisa, without that, whatever is on top of it. I'm not, I'm actually not sure what that is. And then the Lisa, I feel like only had one drive. Now I'm just gonna say the Lisa in 1983. I don't think it is, but it looks like it. - iJustine, you have dazzled audiences for many, many years with your wonderful Apple knowledge. And on question number one, your gut was 100% right. This is, in fact the very first, 1983 Lisa, congratulations! - Wait, really? Oh my God. (laughs) - You almost talked yourself out of that one. So, I think what you're thinking about the Lisa 2 only had one disc drive, but the original Lisa actually did ship like this. - Okay, so because I was doing research because all of the ones that I was trying to find, I guess were the Lisa 2s then, on eBay. So those were, I like this one. I don't even like, this was not even showing up. - Officially, Lisa stood for the Locally Integrated Software Architecture. Certainly not anyone's daughter or anything. - Okay, sure Steve, come on now. - All right, well, you're doing good so far, so let's move on to question number two. - Okay, well that's, obviously the Apple mouse. I mean it looks exactly like the same mouse that was on, the Apple Lisa, but I do feel like they might've had something before that. But I'm just gonna say that life without being able to google something sucks. (laughs) I'll just say, maybe 82 just to kinda, you know, cause maybe it's earlier. Okay, I don't know, it's a freaking mouse. Okay, It's a mouse, it's a clicker, a clicker. But, I don't, cause, I'm just gonna say, I'm gonna say a mouse 1982. (laughs) - All right, the Apple clicker mouse. (laughs) You get 50% points on this. It is in fact, just the Macintosh mouse. That was the official name of this mouse. But it was birthed in 1983, which means you still get 50% points. - Oh my goodness. - I was specifically told I cannot accept anything like just the Apple mouse, since obviously that is what it is. But, you're still doing good. You're still at 75% points right now. - I will never forget that, if I'm ever on jeopardy or something, I'll say, what is the Macintosh mouse? (laughs) - Let's move on to item number three. - I mean, it looks like one of the first Mac minis, but it also, I'm gonna need a higher res image please. (laughs) - We need you more pixels. - This to me looks like, like the packaging for, like an iPod shuffle. But it also kind of looks like a Mac mini. Like one of the first Mac minis. And this would have been back around the time that I was on MySpace, if this is a Mac mini. - Okay, tell me more about MySpace. I think most of the people watching this have never even heard of it. (laughs) - I ran it, a scam on MySpace, it was actually not a scam. It was kinda like one of those pyramid things where, okay, you get like 10, 15 people to sign up under this affiliate link, and then you get something. So I got iPods, and then I also got a Mac mini from this little scam. So it wasn't actually, it wasn't actually a scam 'cause people were actually getting stuff. - Hey, we all did weird stuff on the internet. (laughs) - It's true, that's true. I'm gonna say 2003. - All right, so for question number three, is this the 2003 Mac mini, or, is it the 2008 AirPort Time Capsule, which is the correct answer? - Stop it, I never heard that. This is, now everybody knows how old I am. - This is apples very first wireless router. So if you actually look at a photo of it, it actually is similar to the Mac mini, but it is a little different. That first Mac mini was actually aluminum where I believe this was plastic. And it also the Mac mini didn't have that little sort of line around the front. - That's great, I've actually never used time capsule. I never use time machine. I never used that at all. - I've only owned, I think I owned an AirPort Extreme, for a few years there, and that's pretty much it. I never used really into these, and I've never opened a time capsule once. All right, let's move on to question number four. - Oh, we're in trouble, cause I actually don't know what this is. I mean, it's obviously some sort of a gaming console and I feel like this is something that I should know. I'm embarrassed, and ,I've seen it, but I don't, I am actually, I don't know what it's called. I have no idea. - Well, before we get too far into it, if you think you're gonna be wildly off, you could take advantage of your Phone-a-Ken. He's a little bit early in the game, but I'm just saying like, that is a possibility, especially if you don't think you have a good shot at it now I would probably be a good time, unless you want to save it for one of the later ones. - Yeah, yeah, okay. Let's phone, let's phone, let's do it. This is iJustine, hello. I'm phoning you, and I need help. I'm desperate. - [Ken] I kinda know what this thing is, kind of. - You kind of know what it is? - [Ken] It's the Apple Pippin. - Apple Pippin, oh my gosh. Yes, okay. Do you- - But I don't know the year. - No, no, times up! So I'm gonna say, Apple Pippin, 1992. - 1992, Apple Pippin. iJustine, on question number four, you are 50% correct? It is in fact the Apple Pippin, but it is from 1994. So just outside the window. - I was trying to think in terms of, okay, when, what was the original Nintendo out, and okay, all right. Okay, all right, that's fair. - It actually was basically just a Mac, with obviously a game controller. So the idea was, it was sort of part PC, part console, and this actually was licensed out. So, a lot of these actually were built by Bandai. So essentially it was sort of like a joint collaboration back when Apple were in the wilderness, and they were trying anything and everything they could to recapture their former glory. And, surprising exactly, no one, this didn't sell at all, and very few people ever bought one. So, a not successful. Let's move on, to question number five. - Oh, this looks like one of the first, the first sort of laptops, which they were calling them PowerBooks back in the day. It is so small, that's crazy. It is a PowerBook. I mean, cause I feel like that's what they called them up until, my God, like until like, I guess they did switch it to High Book, at some point. Oh God, this sucks. Okay, PowerBook G3, 1999. I'm not sure. - iJustine, you have an impeccable level of knowledge and specifically very impressive memory to place yourself in these positions. And you know what? I'm gonna give you full points for this one. So, this actually came out in 2000, and it is the PowerBook Pismo G3, the very last of the G3 PowerBooks. Congratulations. - God, I just though you're just patronizing me. - No, no, no, that was done. So, this was named after Pismo Beach, California. And it was of course the last of the G3 line, but it was the very first PowerBook to have the AirPort card built in, as well as those ugly, clear keys, I think called them like glass keys or something, even though they were definitely plastic. You are now above the threshold. So you were at six of 10. So, you're starting to claw your way back up there. So, why don't we immediately remove all hope of winning with question number six. - Oh, wait, okay. This is, this is the Newton. Well, I'm gonna say this is the Newton, because I feel like they did have some other sort of palm type thing, but I don't know, I don't know. Okay, so, I'm gonna say the Newton, was definitely something in the nineties. This is a super nineties. I'm gonna have like 95. - Okay, so the 1995 Apple Newton? - Ish give or take a year. - Okay you literally get, give or take one year. Okay, so I actually cannot accept the Apple Newton because there were multiple Newton models. Again, like with question five, there are a couple of addendums to the Newton name. If you can get either of them, correct, I will give you points. - I'm gonna say, the Newton Pro Max, (laughs) at 96. - For question number six, I'm sad to say you have zero points. This is in fact from 1993, and it was the Newton pad, MessagePad. No, sorry. Newton MessagePad 2000, what a terrible name? - 93? - So essentially, the Newton was a product, a sort of name, and the MessagePad 2000 was the actual model. So, ran on Newton OS, obviously had actually really advanced handwriting recognition for its time. And in fact, the Newton was actually popular, actually a decade Newton stores, there are a few of them back in the early nineties. So, this was actually a major success for Apple for just a little while, in the pre Steve jobs posts, like Apple being weird era. - Men! - You were correct about the Newton part, but unfortunately there were quite a few Newton models to choose from. The good news is, if I'm doing my math correctly, you were still at 50%. So you were right now, at six of 12. So you're still in the game. And, we're gonna move on to question number seven now. - Oh my God, it's a freaking projector. Well, maybe it's a camera. It's a camera, it looks like your camera. That looks like a camera. I was like this, okay, well, it's like full screen on my thing, so it looks massive. I'm gonna say the Macintosh PowerShot, portrait mode 1990. Okay, final answer. Macintosh QuickShot, 95. Freaking, I don't know. - Well, I know, that you are actually 50% correct. This is from 1994. This was the Apple QuickTake 100. One of the very first consumer digital cameras. - Oh my God. (laughs) Quick take. - QuickTake, I believe is what the feature is called. If you're trying to take a photo while recording video, if I remember correctly, but they definitely still do use the QuickTake name in the iPhone today. Seven questions in and you actually still exactly at 50%. - Well that's, you know, that's pretty subpar average. I that's what I strive for. - No, all you need is 50%. There's no extra. You don't get any bonus, if you get a hundred percent. All you do is hit that 50%. Let's move on to question number eight. - Oh, okay. I just don't, I'm not quite sure though. Okay, so, I mean, I'm gonna say, like a power PC just because that was probably around. Let's see, okay. I would have been in. - When I was in kindergarten, I think that I used this actually, no, you had Macs in the house growing up, didn't you? - We did, it's all we ever had. Okay, so I'm gonna say, 92 Mac PowerPC. I have absolutely no idea. - Well, I have an idea. And you were 50% correct? This is the 1993 Macintosh TV. - What? I was like, what is this freaking remote thing? - You actually, yeah, you were dead on with that. So essentially, it was actually just this sort of weird hybrid. It was basically just one of their Performa 520 PCs, but had a built in 14 inch Sony CRT TV. The problem with that was that, it pretty much just did input switching. So you could either run it as a TV, or you can run it for the PC. The actual fact of it being a quote unquote TV had nothing to do with it. - Wow, yeah, it definitely doesn't seem like it's a very user friendly interface. - No, but fun fact, this was the very first black Macintosh. So, if you get 50% of the next two questions, For sure exactly even on points right now. You will win the tweet, and nothing at that point, can take away from the fact that you would be a, This Is winner. However, there is, if you choose to accept, a final bonus question, where you can go double or nothing. So, I will say nothing more beyond that, but just kinda keep that in the back of your head, as we move on to question number nine. - The eMac. Yeah, 2003. We, like my family, we had this, like we had this. - Okay, well that was not very dramatic. You have successfully just won the This Is game. Congratulations. (laughs) - Yeah! - So this is the fact that the 2002 eMac, but that's absolutely inside the margin of error. So I'm curious, you guys actually had these because as far as I know, they were for the education market. - My mom is a teacher, so yes. So that's why we've had Macs in our house, pretty much from the beginning, cause she always had the, the education discount. So yeah, oh my God, this is great. - That was a very well played. So, you now are without a doubt, a This Is winner. But, if you would like, you can take our double or nothing bonus question at the end. If you can get it 100%, right, no handicap, you will trail your, This Is tweet, for a full 30 second Ad spot, on This Is, where we will say literally whatever you want. However, if you do not get that final question 100% correct, you walk away with nothing, besides the honorary title of being a, This Is winner. You don't have to decide right now, you still have one more question, but that are, those are the stakes. So, why don't we move on to question number 10 and potentially, the final one. - It looks like Wally. Like it kinda has like a real Wally look to it. Which kind of makes sense, cause it was Pixar. Oh God, I think this might actually be the IIc because I have, I also have one of these. I mean it's 84, 85, I'm not sure. So I'm gonna say, cause it's definitely not 83. So if I say 85, it could potentially be 86, but I'm gonna say 85, just to be sure. - iJustine, I'm not even gonna mess with you. You got that 100% correct. It is in fact in the 1984 Apple Iic, which means that you obviously just completely nailed that sort of bonus question. So, essentially this was Apple's first attempt, at a quote unquote portable computer, that could be quote unquote, easily moved from place to place. You definitely turned that one around in a big way. So, now that you are very clearly a This Is winner The real question is this. Are you ready to risk it all, and go double or nothing for our bonus round where you have zero handicap, to get this final item, correct? Or do you wanna walk away with your, This Is tweet, your glorious fake, This Is winter trophy, and call it a day. - I mean I'm gonna walk away. You think I'm crazy? Why would I risk it all, when I've already just proven my subpar knowledge, of these, of the Apple genre. - Fair enough, so you were absolutely, This Is winner, congratulations. - Thank you, could I see what the question is anyway? Just like, just to see? - Absolutely can take the question anyway. So just for fun, why don't we take a look at the final bonus question? - Oh, thank God. I didn't risk it all, cause I'm actually not sure. - Okay, do you wanna take a guess at what this is? - Oh my God, its like a Bose speaker. That's cool, nice little integration there. I'm not, I have really, I'm not sure. I'm not sure what this is. - I'm glad you took your victory, cause this is actually the Twentieth Anniversary Macintosh from 1997. - Oh. - So, this is a really rare Mac They only made 12,000 of them and they cost $7,500 each, which is about $12,000 in today's money. - I mean, clearly that integration with Bose immediate. This probably sounded great. - Yeah, and you can see like the sides were pretty much all speakers. It was that sort of weird sort of Brown color, but they were so rare. They literally only had three service locations in the entire world. And fun fact cause Matt made me say this, the only way, the only place where you could get them serviced in the U S was in Rochester where he's from. He made me say that, I don't care. I don't care about that. - Oh my gosh, wow. Well I'm glad I didn't risk it all. - You have shown not only impeccable knowledge of Apple products, but also an excellent sense of when to stop. So, really the big question we have now, do you have a tweet for us? We will tweet whatever it is that you want. Matt is very helpful, he handed me the phone. You don't have to decide right now, by the way, you can decide to give us the tweet later. But if you have something ready, we'll tweet it literally this second, if you want. - Well its probably gonna be something about what an incredible editor I am, and how you guys are hiring me, and maybe a little dig to Linus here, you know, the Linus true and Terrence. So let me, I need to craft it, but it's definitely. - Craft away, do you wanna do it right now? (mumbles) wanna send it to me. - No, I'm gonna have to send it to you. Cause I might have to edit a little video to go along with this. I don't know if that's like a part of it, but you know, it's a tweet. - Absolutely, tweet a video and text, whatever it is, whatever it is that you want. (laughs) iJustine, thank you very much for being on. Where can people find you on the internet besides MySpace - iJustine, everywhere. And now I stream on Twitch and we started a podcast. A lot of stuff has happened during the pandemic. I've just really exploring all avenues. (laughs) - Very, very exciting. Well, congratulations. And if you enjoyed, make sure to subscribe not only to Justine, but also here on This Is, for lots more exciting game shows where we barely actually make it to the end, without spoiling the answers. I'm gonna put the cards done now.",
    "transcript_keywords": [
        "Apple",
        "question number",
        "question",
        "Apple Pippin",
        "Newton",
        "Mac",
        "Mac mini",
        "Apple Newton",
        "Apple Lisa",
        "Lisa",
        "God",
        "number",
        "sort",
        "Apple mouse",
        "fact",
        "mouse",
        "kind",
        "Macintosh",
        "tweet",
        "correct"
    ],
    "transcript_entity_values": [
        "zero",
        "Twitch",
        "Bandai",
        "the nineties",
        "Apple Newton",
        "PowerBooks",
        "three",
        "the day",
        "one year",
        "a few years",
        "PowerBook G3",
        "85",
        "Pixar",
        "MySpace",
        "50%",
        "Nintendo",
        "Newton OS",
        "75%",
        "One",
        "Wally",
        "MySpace - iJustine",
        "High Book",
        "Newton",
        "about $12,000",
        "1994",
        "93",
        "Rochester",
        "Twitter",
        "7,500",
        "Pismo Beach",
        "2000",
        "Sony CRT TV",
        "the Newton Pro Max",
        "a super nineties",
        "Matt",
        "number eight",
        "83",
        "1982",
        "2008",
        "Seven",
        "Apple Pippin",
        "12",
        "Performa 520",
        "first",
        "1995",
        "2004",
        "1992",
        "1984",
        "10",
        "iJustine",
        "eBay",
        "the U S",
        "1983",
        "G3",
        "MessagePad",
        "nine",
        "PowerBook",
        "California",
        "92",
        "1999",
        "1993",
        "the Apple Newton",
        "100%",
        "2006",
        "PowerShot",
        "Brown",
        "Lisa",
        "2003",
        "the Twentieth Anniversary",
        "96",
        "winter",
        "Macs",
        "Linus",
        "Bose",
        "second",
        "eMac",
        "five",
        "AirPort",
        "the year",
        "the early nineties",
        "First",
        "12,000",
        "one",
        "Mac",
        "QuickTake",
        "Apple",
        "four",
        "2002",
        "Steve",
        "86",
        "MySpace",
        "Macintosh",
        "the very first, 1983",
        "a hundred percent",
        "84",
        "today",
        "2005",
        "iPods",
        "six",
        "85",
        "95",
        "a year",
        "15",
        "an AirPort Extreme",
        "two",
        "Justine",
        "82",
        "14 inch",
        "iPod",
        "1997",
        "the Locally Integrated Software Architecture",
        "Apple Pippin",
        "Macintosh TV",
        "Ken",
        "Mac",
        "the Apple Pippin",
        "100",
        "iPhone",
        "Terrence",
        "the Apple Lisa",
        "1990",
        "seven",
        "Apple Iic"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORG",
        "MONEY",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PERCENT",
        "DATE",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "DATE",
        "EVENT",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG"
    ]
}