{
    "id": "sDcHY_x8Yc0",
    "title": "The Mac Mini Killer - Minisforum UM773",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-03-30T19:15:35Z",
    "video_url": "https://www.youtube.com/watch?v=sDcHY_x8Yc0",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "minisforum",
        "UM773",
        "mini PC",
        "PC",
        "desktop",
        "computer",
        "small",
        "smol",
        "mini",
        "home theatre"
    ],
    "views": 900312,
    "likes": 25960,
    "comments_count": 1432,
    "description": "Purchase your own Devil Skin Backplate for your PowerColor Red Devil 7900 GPU today at    Jake was impressed with the price-to-performance ratio of the Mac Mini, but Minisforum is here to strike back with their new UM773. With an accessible price point, solid specs/IO, and a tiny form factor, is this the mini PC to beat, or should you stick with Apple's M2-powered computer?  Check out the Minisforum UM773: US:  EU:    Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 The Mac Mini USED to look good... 0:20 Unboxing 3:17 IO walkthrough 5:03 Sponsor - PowerColor 5:28 Powering it on and checking specs 7:22 Fan noise, TDP, and SSD/CPU tests 11:03 Gaming - Apex Legends and CS:GO 12:38 Comparison to the Pico PC and potential use cases 13:31 Teardown 16:18 Overall thoughts 16:41 Outro",
    "description_links": [
        "https://www.powercolor.com/new?id=1679904586",
        "https://shop.powercolor.com/",
        "http://bit.ly/3lwRj4d",
        "http://bit.ly/40yztN8",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- When I unboxed the Mac Mini M2 on ShortCircuit recently I was pretty stoked that you could get a Mac computer with that much performance for that little money. Well this is the Mac Mini M2 killer. When configured with twice the amount of RAM and twice the amount of storage, it's still currently cheaper with more performance. And of course double the other things I said earlier. It's called the Minisforum UM773 and it's really small. It might even be smaller than the Mac Mini even. Wow, look at that. Oh it totally is. It totally is smaller. Wow. This thing is tiny! Sweet. Okay, cool, cool, cool. It's got some bounce on there. It's so small. Okay, we'll put it over there. There's some more box to unbox here. Got our usual propaganda. \"A slow boot time may be caused by\" yeah, yeah, yeah. \"Do not remove the CPU cooler themselves.\" That's not a bad idea. Foam. Power cable. What is this? Oh! It's a little stand. That's cute. Yeah, look at that. That's so cute! It sits in there nice. Well maybe not. (laughs) Maybe I am supposed to leave this in there. I don't know. Whatever, we'll worry about that later. We've got the power brick of course because of the size. No power brick. Yeah, that's something the Mac Mini has though. Hey look! Mac Mini. Holy crap, this thing's bigger than I remember. (laughs) Okay. There you go. That's a lot smaller. So if I put the power brick here. Still smaller. And you know what the funny thing is? Inside this Mac Mini there's about this much empty space. So yeah, the components in here and in here, it's kind of the same size. It's definitely thicker. Not by a huge amount, but definitely a little bit. Got an HTMI cable. That's always a nice inclusion. VESA mount. Cool. What the (censor) is that? Oh, AF5 SATA cable. This thing has a SATA drive slot too. Yeah, there we go. Okay, cool. It's just like the world's cutest SATA cable. It's so little! (laughs) Should be very careful with this though. Don't want to lose it. These must be rubber feet. They're just like little rubber doodads. It has rubber feet already. Oh maybe I'll read the manual. It's probably in there. Okay. \"Improper disassembly may cause damage \"to the motherboard and CPU. \"It could also reduce the liquid metal sealing tightness.\" It doesn't say for disassembly, just improper. So maybe if you properly disassemble it you still get your warranty. But I didn't know it had liquid metal. That's cool. Oh yeah, okay. Ooh, we got disassembly instructions. That's cool. You have to remove these bottom rubber pads. And they tell you to do that if you have to take it apart because you could buy this as a bare bones kit without any SSD or RAM. So you might actually have to take this thing apart right when you get it. And the fact that they include the extra feet is definitely a nice touch. You've got the RAM slot and the SSD right there. Accessible. We will take this apart later. Don't worry about that. They kinda made it sound like in the documentation that there was gonna be a slot you could slide an SSD into. You do have to to take the bottom cover off to do so. But the fact that you can fit that in there, as well as being able to modify the storage, as well as being able to modify the RAM. (chuckles) There's a lot of flexibility in this thing. Machine base. Okay, you are supposed to leave this little rubber thing on the base. Okay, cool. I think we've gotten everything out of that that we can. Holy crap! Look at all that IO. Oh my god. Because it's got an external power brick. There's gonna be a power jack 19 volt. It's got 2.5 gig LAN which is awesome to see on a device of this size and just devices nowadays in general. We've got it looks like four or five gig USB type A ports, two HDMI 2.0 ports, so you're not gonna be able to do like 4K 120. Not that the GPU in this could run games at that anyways. 4K 60, you could do high refresh rate 1440p or 1080p. There's a Kensington lock. We've got lots of venting. And then on the other side, USB4. Which means in theory you could use some Thunderbolt devices with this. You might be able to get high refresh rate 4K out of Thunderbolt. It would depend on if the GPU supports it. I'm not 100% sure. Got a combo jack for audio. Just a 3.5 mil standard. We've got 10 gig USB type C. Not Thunderbolt or USB4. It looks like there's two reset button holes. One of these is a clear CMOS. It's not labeled, so I'm not gonna stick anything in it. (laughs) But it is there. This is a lot of IO for a machine this small. Don't get me wrong, the Mac Mini also has a ton of IO especially if you spec the pro model which has four thunderbolt ports. But it doesn't have 2.5 gig LAN by default. You have to pay to upgrade to 10 gig. It does have a headphone jack still. That's good. All right, power cable, power brick. I like that they include the short HDMII cables with this thing because it's kind of \"designed\" to go on the back of your monitor. And so you just, you know, you kinda. Like that. But if you have to do anything more than that. This is kind of inconvenient. I guess most people have an HDMI cable and like most computers don't come with them. (clears throat) Apple. Let's turn it on! But not before this message from our sponsor. - Thanks to PowerColor for sponsoring today's video. Add a little personality to your 7900 Red Devil card with PowerColor's new devil skins. Choose between two designs for your 7,900 Red Devil. There's a mesh pattern generative devil skin, or the sleek and smooth intrusive devil skin. Thanks to the hassle-free magnetic design these bad boys are ready to install and they're available worldwide. To learn more about PowerColor's devil skins check them out at the link below. - Usually the crappy thing with small computers is like it's got two USB ports, you have to run a USB hub. Like this you plug a keyboard and mouse in. You still have two more type A ports. And two type C ports on the front. Okay, it does have a wifi card in it. That's good. On the specs page it just says M.2 2230 wifi card slot, but it doesn't specify what type of wifi card or if it even comes with one. Clearly it does. Oh, it's wifi 6E, look at that. Would they ship this with, one stick for the 16 gig config? On one hand that gives you the ability to upgrade easily by just adding another stick, but on the other hand you don't have dual channel memory which kinda sucks for performance. Well anyways, the CPU inside this thing is a Ryzen 7 7... Holy numbers, that's a lot of sevens. Ryzen 7 7735HS with Radeon graphics so it's got an RDNA 2 GPU with 12 compute units. It's an eight core, 16 threads so it's pretty powerful, configurable TDP from 35 to 54 watts. It's based on the TSMC six nanometer process. It's got a 3.2 gigahertz base clock and I think it clocks up to like 4.75. There's a lot of performance in this very very small package. The configuration they sent us must be the 16 gig 512 version which you can get on pre-order right now for $560. The bare bones version with no storage and no RAM is 410. If you go to a 32 gig one terabyte, 660. And then the max spec 64 gig one terabyte is 790. In comparison to an M2 Mac, if you were gonna go 16 gigs of RAM, 512 like this one, it's a thousand US dollars. That's without 10 gig networking and this thing is looking pretty compelling if you don't need Mac OS. I'm curious to see what sort of TDP this thing runs at. Because it's a configurable TDP, I suspect usually Minisforum likes to max them out. All right, so I started installing a game. Apex Legends 'cause that seems like a game somebody could maybe play on this thing. The CPU's of course gonna ramp up to decompress those files as they come in from Steam. Right now we're downloading at like 70 megabytes a second over wifi which is pretty great. 40% CPU usage? It's a little noticeable. Like noise wise. It's not something I would say is loud. It sounds like a \"reasonable\" gaming laptop. Which I guess it's kind of like the CPU of a reasonable gaming laptop. That doesn't have a GPU. It's not crazy loud. Like if it was sitting on my desk next to me like this I would probably find it a little bit annoying. But if it was on the back of my monitor. The noise goes away. You can't hear it at all when it's behind the monitor. I guess that's what they designed it for, so mission success for that. If it was under your TV like as a home theater PC which I definitely could see this being used for, I don't think you would have any problems at all. But right next to me, it's definitely audible. It looks like this thing is configured to use a max of 45 watts. This chip can go up to 54. I don't know if there's a BIOS option. We'll have to check for that. But I mean in this 45 watt state it's reasonably not too loud. It's only at, you know, 75, 76 degrees on the hottest core. It's very managed, it's not thermal throttling. Oh yeah, I forgot to mention. The RAM is DDR5 which is great. Let's try a speed test on the SSD. It is 300 gigs of 480 used. Maybe not the \"best case scenario\" for testing the drive, but it is a more realistic scenario to test a drive in when it's, you know, got some usage than when it's empty 'cause it's gonna be faster when it's empty. But this is fast. It's gen four, so I'm glad that they actually put a gen four SSD in the gen four slot. That's great. Speed test is done. We're getting around five gigabytes a second read. Three and a half gig write. The random IOPS on this drive. 400, 500,000 read, 700,000 write. This is a very good drive that they've put in here. I'm not sure what it is. We'll see when we take it apart. But very good. Let's try PassMark. I saw for a second the CPU package power went up to 57 watts. Holy (censor). It's not doing that anymore. It's probably 'cause it was doing a floating point test. And that can really push the CPU. 64 watts, holy (censor). I thought the max was 53, AMD. What the hell? (laughs) Almost 120 watt power brick. I guess there's other things you could plug into this thing that would use power. Like if you plugged in... You're charging your phone at 10 watts. That's another 10 watts of power. You know, you got some LEDs on there, there's a fan in there, that's gonna draw some power. But it definitely has head room. 24,000 in PassMark. The single-threaded score is worse than an M2. You have 3,500 in PassMark on this thing and M2 is around 4,000 single-threaded. Not a huge difference, but definitely something you would notice. However, even though they're both eight cores, the Mac Mini does not have hyper-threading and it also has kind of like performance cores and efficiency cores whereas this is all the same cores. We're getting 25,000 multi-threaded score. A Mac Mini is around 15,000. So there's a lot more CPU horsepower in this thing especially if you're doing anything multi-threaded. Just for (censor) let's run Cinebench. Almost 13,000. Which puts it close to a first gen 16 core Threadripper. A 7700 K is less than half the overall speed. It's only a four core, so that makes sense. Per core, it's about as fast as a 7700 K. Seriously impressive chip. We're gonna game at 1080p 60. This monitor's only HDMI 1.4 and despite 1.4 technically being able to do 1080p 120 hertz it's not giving me that option. So I think we're just stuck at gaming at 60 hertz. There's probably a way to make it work. But this is Shortcircuit, not Longcircuit, so I need to just, we must just tread on! I'm getting like 60. We're at absolute lowest settings. I do have texture streaming on. But this game still looks pretty good at low settings. So if I stare at the ground, 120. Yeah, let's go! If there's anything on screen it's 60 to 70 which is totally, totally playable. At 1080p, but again, it's like an APU. It's not dedicated graphics. I wasn't expecting this to knock my performance socks off. But it's enough to play a game like this. This probably looks better than it does on Xbox, okay? (laughs) Don't at me, Xbox people. PS5, probably looks better. Whoa, this is in Russian. Holy (censor). Okay, anyways. Low settings. I do have FXAA on still. I'm getting stuttering 'cause the ping is so high. I'm connected to a community server, but I'm getting between 100, 120 to 150 FPS. Like this is... Come here, come here, get knifed. I don't know why I didn't buy. He got me. Totally can play CS:GO on this thing. It's a pretty capable eSports gaming machine. If you just had it at your TV, can totally do that. I'm sure it's enough even to do some like basic video editing. It just feels snappy. When we were using that PicoPC that Linus did an LTT on. - I'm a computer! - Obviously way less powerful than this thing and a lot smaller, but it was, you know, you could say man, you can use this for web browsing, you can use this for Word processing. Trying to play a 4K YouTube video, it did work, but it was stuttery. This system has so much power that you could use this for pretty much anything. Anything basic and it doesn't feel slow. It's got a gen four SSD that makes it boot fast. It makes programs launch fast. It's got enough GPU power, it's got lots of CPU power. I mean 4K video is nothing, who cares? It's kinda sad to have Crab Rave with no music. No audio. This would be a sick home theater PC. Especially because you can put a bigger drive in it. It's got that 2.5 inch drive slot which let's check out now. So we have their instructions for doing this. This should be pretty easy. Oddly enough, they included extra these feet. In case you need to take it apart, but they don't give you extra of these little ones. They're both stick on, so. Oh Jesus, that thing just got destroyed. All of the sticky came off. Oh no. You could position feet in a manner where you don't have to take them off to take it apart. Especially as a product that does sell as a bare bones kit it seems like nobody really thought about wow, you know, if people are gonna take this apart why don't we just make it so they can take it apart and not have to peel off one time use sticky things? There's also clips on the bottom here. Anyone that takes this thing apart at their house is gonna have a small screwdriver. They probably have something they could pry in there to unclip the little clips. It's just when it's such an easily serviceable thing, you got your SSD, you got your RAM there, it seems like they could have just put a tiny bit more effort into making it just a little bit easier to open. It's not hard, but well I mean you could break these clips pretty easily. They're tiny. And once it's broken it never really goes back together properly which kinda sucks. There's the SSD. It has a heat sink on it or like a heat spreader. It's very hot in my hands. Kingston. Gen 4. 512 gig. It's like an OEM drive. It's probably not something you could super easily buy, but it's probably pretty similar to their other SSDs. It doesn't look like it has a DRAM cache. Just has a bunch of NAND on there. And as suspected, just a single stick of RAM. Would be cool to see dual channel memory. If you buy a 32 gig or a 64 gig I suspect it will be dual channel memory. DDR5 eight gig DIMMs are kinda hard to come by so I kinda can see it. It also does give you that easy upgrade ability to just add one more stick in rather than having to buy two new sticks if you were to go from 16 to 32 gigs. But you are leaving a little bit of performance on the table for sure. It's got like a metal frame. And I think the whole metal frame will come out of the plastic. Oh man, they probably have a special tool in the factory for this. Look, it's nothing worse than the Purolator guy would do, okay? (gasps) There we go. (gasps) Nice! We did it, Reddit! Wow, look at that cooler. Holy (censor). It's got two giant heat pipes. There's a set of fins over there and a set of fins over there. Where does the air come from? This must suck air through a heat sink, like the intake is a heat sink, and then blow the air back out through another heat sink. It's kinda cool. It's not sexy like the inside of a Mac Mini, but it is very, very dense. Sweet little piece of kit. Overall I think it's not gonna be a crazy gaming rig, you know, whatever, but if you're just playing eSports titles or you want to run a Plex Media Server or something like that off of this home theater PC, it's a serious amount of CPU horsepower. Serious amount of IO and it's reasonably upgradable. I really like this thing. So if you liked this video maybe check out that Mac Mini unboxing. That thing is also super cool. Kinda in a bit of a different way, but it is still affordable compared to other Macs. Get subscribed. Bye.",
    "transcript_keywords": [
        "Mac Mini",
        "thing",
        "Mac",
        "Mini",
        "CPU",
        "Power",
        "gig",
        "kind",
        "RAM",
        "SSD",
        "cool",
        "yeah",
        "power brick",
        "pretty",
        "Mac Mini unboxing",
        "drive",
        "lot",
        "gig USB type",
        "GPU",
        "Holy"
    ],
    "transcript_entity_values": [
        "eSports",
        "Kingston",
        "60 hertz",
        "1.4",
        "4",
        "Thunderbolt",
        "USB",
        "700,000",
        "Shortcircuit",
        "K YouTube",
        "790",
        "560",
        "up to 57 watts",
        "3,500",
        "Plex Media",
        "LAN",
        "25,000",
        "45 watt",
        "10",
        "AMD",
        "2.5",
        "60 to 70",
        "NAND",
        "500,000",
        "Almost 13,000",
        "Linus",
        "VESA",
        "2",
        "480",
        "a thousand US dollars",
        "today",
        "Three and a half",
        "40%",
        "Russian",
        "3.5 mil",
        "54",
        "a ton",
        "PowerColor",
        "around five gigabytes",
        "Apex Legends",
        "IOPS",
        "PassMark",
        "LTT",
        "19 volt",
        "max",
        "35",
        "first",
        "Minisforum",
        "64 watts",
        "two",
        "between two",
        "GPU",
        "between 100",
        "Cinebench",
        "Xbox",
        "CPU",
        "eight",
        "SSD",
        "Mac Mini",
        "32",
        "1080p 120",
        "the Mac Mini",
        "53",
        "24,000",
        "RAM",
        "Kensington",
        "one",
        "10 watts",
        "less than half",
        "Crab Rave",
        "2230",
        "second",
        "around 15,000",
        "Mac Mini M2",
        "45 watts",
        "Jesus",
        "75",
        "300",
        "FXAA",
        "Macs",
        "PS5",
        "4.75",
        "Mac Mini",
        "HDMI",
        "the Mac Mini",
        "120",
        "Radeon",
        "512",
        "six nanometer",
        "12",
        "ShortCircuit",
        "five",
        "jack",
        "6E",
        "Almost 120 watt",
        "Apple",
        "CMOS",
        "C. Not Thunderbolt",
        "100%",
        "one terabyte",
        "One",
        "60",
        "APU",
        "660",
        "4,000",
        "1080p 60",
        "Purolator",
        "7,900",
        "TSMC",
        "Gen 4",
        "64",
        "TDP",
        "Reddit",
        "IO",
        "Mac Mini",
        "410",
        "the Minisforum UM773",
        "DDR5",
        "3.2 gigahertz",
        "76 degrees",
        "2.5 inch",
        "Longcircuit",
        "16",
        "HDMII",
        "four",
        "400",
        "Mac",
        "SATA"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "LANGUAGE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "FAC",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "GPE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}