{
    "id": "SEQhfPihTF8",
    "title": "The CHEAPSKATE PC Build",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2023-05-12T20:59:08Z",
    "video_url": "https://www.youtube.com/watch?v=SEQhfPihTF8",
    "category": "Science & Technology",
    "tags": [
        "cheap",
        "cheap pc",
        "affordable",
        "$300 gaming pc",
        "cheapskate",
        "cheapskate pc",
        "gaming pc",
        "pc",
        "computer",
        "budget",
        "budget pc",
        "greg salazar",
        "how to build a gaming pc",
        "gaming pc under 500",
        "gaming pc under 1000",
        "gaming pc prebuilt",
        "optiplex pc",
        "Optiplex gaming pc",
        "the cheapskate pc build",
        "pc build",
        "pc build guide",
        "used pc",
        "$200 gaming pc",
        "$250 gaming pc",
        "budget gaming pc"
    ],
    "views": 95365,
    "likes": 5355,
    "comments_count": 544,
    "description": "SPONSOR: Use code 'GSVIP' on VIP-SCDKey for 30% off - only during their May sale! Windows 10 ($15):  Windows 11 ($21):  Office 2021 ($53):   Let's build a gaming PC on a super small budget! What can we do with under $300?! Meet the Cheapskate PC! It might be a bit cringe, but this can be a great way to break into the gaming PC space on the cheap!    Consider supporting us on Patreon!   Shop gaming PCs on eBay:  Used graphics cards:  Cheap 500GB SSDs:    My studio gear on Amazon: Sony A7C (Primary):  Sony a6600 (Secondary):  Sony a6400 (Webcam):  2x Pixio PX277 Prime 165Hz IPS Monitors:  Neewer LED Lighting Kit:  Audio-Technica AT2035:  Yamaha MG10XU Mixer:  Neewer Microphone Arms:  Arrowzoom Sound-Damping Foam Panels:    Follow me on social media: TWITCH:  FACEBOOK:  TWITTER:  INSTAGRAM:    Join our public Discord server:    Channel music provided by Monstercat:   DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our Rakuten account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.",
    "description_links": [
        "https://bit.ly/GSVIPWIN10pro",
        "https://bit.ly/GSVIPWIN11pro",
        "https://bit.ly/GSVIPOFFICE2021",
        "https://www.patreon.com/gregsalazar",
        "https://ebay.us/p2IuUc",
        "https://ebay.us/bZuS5J",
        "https://geni.us/Jv2QdpD",
        "https://geni.us/lOeoIA9",
        "https://geni.us/k8VBToq",
        "https://geni.us/24nqw",
        "https://geni.us/bCg4nD",
        "http://geni.us/9VTXr0",
        "http://geni.us/xvQc",
        "http://geni.us/d4VvGM",
        "http://geni.us/1w5Sx2Y",
        "http://geni.us/EKFxZc",
        "http://www.twitch.tv/GregSalazar",
        "http://www.facebook.com/GregSalazarYT",
        "http://www.twitter.com/GregSalazarYT",
        "http://www.instagram.com/GregSalazarYT",
        "https://discord.gg/jYA9Xvp",
        "https://youtube.com/c/monstercat"
    ],
    "transcript": "Let's cut right to the chase, shall we? This might be a bit cringy for some of you to watch. This assumes that you have a bottom of the barrel budget, maybe 200 bucks, $250, and you don't have contacts networking on your side, you don't have friends that can donate parts and maybe get a free PC from your local school or something like that. This assumes none of that is in play. I'm going to make some concessions here that I'm sure will spark some debates in the comments, so I just wanted to throw that out there. Okay, welcome to the Cheapskate PC Build. First things first, uh, a Dell Optiplex. You guys know where this is headed. Look, I get it, she's a bit rough around the edges, and she certainly wasn't cleaned all the way, but for 100 USD or thereabouts, I think this was a heck of a purchase. I think I might have just broken something. So this whole thing swings out, it's actually kind of cool. I think this was a pretty sweet buy because while it's not the best looking, it does come with a Core i7-7700, it comes with a cooler, it obviously comes with a motherboard, it comes with a power supply, and it comes with 16 gigs of DDR4. I mean, that's pretty much a whole build. The only thing we're missing here is storage, which you can add, I mean, a 500 gig SSD, which we have, for 20 bucks. SSDs are so cheap nowadays, the storage has come down a lot in price, which is great. But you know, you throw that in here, and then you've got a working rig, and then all you need to add on top of that is a graphics card. And if you pick the right graphics card, you don't even need to upgrade your power supply. Which I know, yes, is pretty cringy, because these power supplies are absolute dog sh**, but this is the cheapskate PC build. So yeah, this should make for an interesting one. I'm not even entirely sure the rig turns on. So that's the first thing we'll take care of. Are you ready? Stay with me. If you're looking for a way to rid yourself of that pesky Windows activation watermark, head over to VIPSCDKEY. Their May sale has Windows 10 Pro OEM keys at a special discount, meaning you'll pay only around $15 to fully activate your OS. So give you access to Windows 11 upgrades as well, custom wallpapers, and a few other benefits. Simply click the link in this video's description and select the version of Windows you're currently running. Then pay with a secure payment method like PayPal. When the promo code pops up, enter GSVIP and watch that price fall by 30% down to around $15. And if you don't want to fiddle with upgrading from Windows 10 to 11 at the start, you can always buy a Windows 11 OEM key for around $20 with our code. Again, that's GSVIP. By the way, we'll discuss later how to activate in the video, but don't worry, the process is super easy. Find more great deals at VIPSCDKEY by clicking the links below. A couple of interesting things about this rig I found out while off camera. The first is that this power supply is actually 80 plus bronze certified. So it's still a trash unit. It's just not all trash. It's just, it's mostly trash. Also, you'll see this skinny little drive right here. That is not a two and a half inch SSD, my friends. That is an optical drive. That's right. We get an optical drive baked into this thing, which I think is pretty cool. Now the drive I bought for this rig is an AX2. This is just a 512 gig team group SSD. It was like 20 bucks, like dirt cheap, common sense for a rig like this. Just spend $20 in storage. You're already on a tight budget. We can throw it into this tray down here. By the way, I found the piece that broke earlier. I have no idea where this goes. The thing about old Optiplexes is that a lot of them require some sort of manipulation to make them gaming worthy. This one obviously doesn't ship with a discrete card from the factory, which is why we're going to be adding one. But you also want to make sure that the discrete card you add fits into an Optiplex. And many of them are too skinny. They don't have full size PCI slots, or maybe they don't have power supplies that are beefy enough to withstand the additional power draw of a discrete card. And then by the time you start adding up all these additional parts, maybe you spend three or four times the price of the Optiplex just for the upgrades or just for the modifications. And at that point, you might as well start with something that's not an Optiplex, because let's be honest, a lot of corners have been cut to make this work. Now I'm going to leave this rig open when we power it on just to make sure that all the fans are spinning. We shouldn't get into Windows. This did ship with Windows 10, I believe, from the factory. But obviously we don't have a drive in here currently. And that's pretty typical of most resold Optiplexes. I'll take the drives out just to, you know, save face, keep the data secure. It turned on automatically. So there's that. Okay, fan curves have calmed down. Yep, there we go. All right. So that's the Dell splash page so far. So good. And of course, this notification here is to be expected. Now let's add our SSD and our graphics card. This being a brand new drive means we will obviously need to install Windows. I'll have a video link below that'll show you step by step how to do that if you are interested. For now, we'll get it in this tray and then connected conveniently. We have a SATA cable already here along with SATA power. Go on then, don't be shy. And connection one, you guys are just staring at the back of my hand right now, but I promise I'm getting work done. There we go. Also went ahead and added a three and a half inch drive, but this just has my Steam library on it. This can be for benchmarking purposes, not going to be added to the budget. It is nice so that we can very easily include it in this little rig of ours. Now this is not a modem. It's actually a graphics card. This is how it was shipped. And look, we were limited a bit in terms of power. All right. Our power supply doesn't have supplemental PCI power cables, which meant that I could only shop for graphics cards that didn't have supplemental power connectors. And there's really only one card that sort of kind of fits the bill. That is this thing right here. This is a GTX 1650. In particular, the Gigabyte 1650 does not include a supplemental PCI power cable. There's no six pin here where you'd otherwise see one. And while this was obviously very intentional because I didn't want to replace the power supply, that was going to bump our budget up quite a bit. Power supplies are a bit more expensive nowadays than they were around a year ago from what it seems. So yeah, this is just another piece of the cheapskate PC build. Me cutting some corners to justify a 1650 that, well, should do fairly well in 720p and even some 1080p. Now to the seller's credit, it does look pretty clean on this side of the shroud. The fans look good. The heat sink underneath looks good as well. There is quite a bit of debris on the inside though underneath the shroud. It looks like sand in here or something. I would normally repaste around this time. This would improve temps, which could improve performance. But because we just bought this card and it's secondhand, I don't want to do anything to it. I want to plug it straight into our rig and make sure that it works. Slot it into that uppermost PCIe slot. We don't have to worry about supplemental power we just talked about. And now we can tighten everything right back down. It somehow all fits here. It's awfully tight, but again, kudos to Dell for at least leaving space for your average small discrete card. We can totally fold this in. No cable snagging of any kind. We'll put the left side panel on and I suppose we'll power it up for the first time with everything in here. Gotta make sure we connect our HDMI cable to our 1650 this time around. And here we go. Look, if it at least posts, I mean, that's all I'm really asking for here. I don't know why it always automatically turns on when I connect power. I don't know if you hear that. It sounds a bit angry. It's power cycled a couple times. We should be getting a picture. Come on. There. Yes, there we go. Set a post. All right. So it looks like so far at least our graphics card is also working. Graphics card is also fine. I take that back. Maybe it's not so fine. That is a weird. Is that the Dell? Is that the corner of the Dell logo? That was a weird artifact. Now, while Windows is installing on our two and a half inch drive, I want to bring up the point that while Windows can be run totally for free, unless Microsoft changes something in the future, you could install Windows and never activate it. So if you're on the tightest of budgets and you can deal with a watermark and a few other limitations in the software, you don't have to pay anything to use the operating system. That said, if you insist on getting rid of the watermark, you don't want to spend a hundred plus dollars on a retail key, which would be absolutely stupid, by the way, to do in a two or $300 rig. Don't spend a fourth of your budget on the freaking software activation key. That's ridiculous. Consider an OEM key or a volume key. Yes, they will lock to the hardware in question in the rig. So if you change something like a motherboard or CPU in there, it might throw up another activation requirement. But again, 10 or 15 bucks for these keys is a pretty, pretty, pretty cheap. So there's that. Now, after a few minutes of starting up Windows for the first time, and you're interested in activating your OS, pull up your product key from earlier. Swing down to the Windows start tab, type activation and click enter. Select change or add product key and paste your activation code. If you're entering it manually, triple check that you've typed it correctly. This tends to throw people off. Sometimes O's and zeros look alike. Just be diligent. Then click activate. From here, Windows will work its magic and you should notice your watermark disappear. And that's it. You have a fully activated copy of Windows 10. You can even upgrade to Windows 11 down the line if you'd like. This sale in May from VIP SED key is going on for a limited time. So be sure to snag your key before it's too late. You can even find other useful software at solid discounts for productivity and the like. Just click the links below in our video description. Remember to use our offer code GSVIP for that sweet discount. All right. And here we are. I'm setting up Steam. Currently, I've got all the drivers you're going to want installed, including obviously the display drivers from NVIDIA for this, the latest stable drivers for the 1650. I am super excited to see what this thing can do. The first thing I'm going to test is a 3DMark Time Spy. I want to see just where this system stacks up against the rest. Now, this synthetic benchmark runs in 1440p by default, which is why our frame rate is pretty trash at around 20 or 21 on average. I will say, however, our graphics cards looking pretty chill in the low to mid 60s here under what is essentially a full load. This is pretty good considering we didn't repaste. And let's be honest, while it's not the worst I've ever seen, airflow in this Optiplex case is not particularly good. Oh, yeah. With all that physics going on down to about 15 FPS, the good stuff. And well, this score is a bit underwhelming. 10% better than all submitted results, meaning we're definitely far down the food chain. Again, this is Time Spy. Let's move to Fire Strike, which is a 1080p older synthetic. I think we'll do a bit better here. Remember, this rig only cost just north of $200. It's not doing that bad. Right. So, yes, this is looking much better already. A score of 8000 in Fire Strike, again, 1080p. Let me just swing on down here to the Compare Results Online button. And OK. All right. We're getting there. I mean, better than 34% of all submitted results is I mean, I'll take that any day of the week for a mid $200 rig. This is not bad at all for the cheapskate PC. Now, this is a real game. Dirt 5 is actually pretty cool, pretty fun to play. You give it a shot if you haven't already. It tends to favor AMD titles. It was an AMD title for a good while. You can see here we're hovering well over 100 FPS and the low preset in 1080p, which, again, I wouldn't try to push any higher for a rig this cheap. You've already made tons of concessions building the rig. You should not have these crazy expectations of the sink and game in 1440p and 4K smoothly. The fact that we're getting nearly 120 FPS in a modern racing title, granted at low settings and in 1080p in a $200, $250 rig is pretty darn good. I'll take it any day of the week. Now, our CPU temps, they are getting a bit toasty. This is what I would consider toasty for a 7700. Non-K, not overclocked. That's because we have the stock Dell Optiplex CPU running right now. We didn't repace that either just because we wanted to make sure everything works. We don't want to tinker with it. I mean, whatever. Again, in a cheapskate build, I'm not going to bother trying to correct this. It's just going to cost money to put a cooler on there. It might not even fit unless we go with some ultra low profile option. So I'm fine. It's not overheating. That's a win in my book. And actually, no joke, this is still running that DIRT 5 benchmark right now. I don't know if you can hear anything. I'd be surprised if you could. The rig is actually really quiet and there's like hardly any sound coming from the sim. You can tell there's a little bit of wind from the back. It is putting out a decent amount of heat. This is not a large case by any means, but I've got to say, I expected things to be a bit worse in the sound department here. And would you look at that? Getting around 60 FPS in Shadow of the Tomb Raider. This is 1080p, medium preset, no anti-aliasing. I mean, it's not too bad here. I'd say for a game like this, 60 FPS is perfectly fine. Again, I wouldn't expect much more in a $200 to $300 rig, but in these multiple scenes, if we're able to stay in the 50s and 60s, I think this is pretty much on par with what you'll see in last gen consoles. Not going to complain. And here we are to round things out then with GTA 5, an older title, but I think it suits this rig given it does consist of older components, the 7700 especially. We're in the high preset in 1080p. Well, it's not really a preset, but high settings across the board, 1080p, no anti-aliasing of any kind. You can see while we're flying over the desert side of Los Santos now, we're achieving well over 120 FPS, actually closer to 165, which will cap out on some higher end gaming panels. This is pretty darn impressive. I expect as we get closer to the road here, the second half of this benchmarking session, you'll see that frame rate drop to around 100 FPS, which is still pretty darn good, mind you. We're again in high settings in 1080p. It's an older title, but it's still a very popular one. And in light of the fact that we're expecting GTA 6 to come out, well, hopefully within the next year or two, this game is going to get one final hoorah, I imagine, in the gaming community. Whoa, whoa, whoa. Okay, hold up just a sec. So I was recording all the footage you were seeing there through my capture card. So that's how you could see like the on-screen stuff without it being taxing on the system we're actually trying to stress here. I noticed though, when I disconnected the HDMI cable, that I could still hear sound from the game, but it wasn't coming from my capture card, though. It was coming from the system. I thought it was this, but this is totally disconnected from the system. So there's no way it could be sending sound there. Is there a speaker in here? You guys hear that? That's the in-game music from GTA 5. What? There's a speaker in here, and for some reason, it's defaulting to inside this. I don't know why, but I think that is super cool. I've never seen that before. That is something else. I've got to say, this has turned out quite well. I expected this to go a lot worse than it did. I mean, the cheapskate PC build has really thrown us no hurdles. We haven't run into software issues. Installing Windows was a breeze. Activating was a breeze. Running games, we had no artifacting, no like severe lag. We had no random crashing. This is a really solid system for the mid-200s. I mean, if you can find an Optiplex like this for around 100 bucks, I wanted a Core i7. I really did. It didn't really matter what generation, as long as it wasn't too old. I think maybe Skylake was about as old as I was willing to go there. I wanted to stick with DDR4. I wanted it to have 16 gigs of RAM, which I think is the minimum now for gaming, and I wanted it to have a power supply and space, you know, that was welcoming enough for a card like a 1650. This met all those requirements. Again, cosmetically a bit questionable, but all in all has given us no issues. Literally zero issues. I might be jinxing it now. Maybe we'll get a blue screen of death or something here in a second, but it's gone rather smoothly, and that's one of the joys, I think, of buying an Optiplex or an HP pre-built, something along those lines that's maybe quite old, but that has been running for a very long time and it just has no issues. These OEMs really try to make things smooth for the end user, and it might cut corners when it comes to hardware, but they usually are just plug and play. This one was certainly that way, and again, we could add additional stuff to it, graphics card, storage, and it didn't cause any issues at all. So rather than maybe buying individual very old components and just kind of pairing them all together and crossing your fingers hoping things work, I mean an Optiplex like this is a viable alternative that probably will have 70-80% of the parts you already need in it in a very, very tight budget. I will have links below for those who are interested. I understand that this is not everyone's cup of tea, but I think at the very least it's entertaining to see what a two or three hundred dollar rig can do when it has clearly cut corners, and this power supply included. I'm actually surprised this power supply held up and really didn't cause any issues at all. It does, again, appear 80 plus bronze certified, which is not usually something you see in cheap old Optiplexes like this. Temperatures across the board were fine. The graphics card was actually very cool, but I mean these are pretty low power cards to begin with. CPUs were a bit more toasty, but again, the rig was pretty quiet as well, so we could have maybe been a bit more aggressive with our fan curves if that was a concern of ours. It's got, I mean, storage expandability built in. I actually really like this swivel design. I'd like to see maybe like a, you know, NZXT or Corsair kind of company do something like this with a case. Just keep it super compact, mid-tower-ish, but have this swivel out thing. I don't know, I just think it's clever. Clever use of otherwise unused space. So again, yeah, check out those links below. Let me know what you think about the Cheapskate PC build. I think it is pretty darn good. Again, barring like finding these in dumpsters or maybe just maybe get one from a friend for free, I mean that's obviously, those are ways you could really drop the cost of this, but you know, I'm just assuming you have no connections, you're going on eBay, you're finding what you can use. This is a pretty, a pretty sweet combination, and it doesn't require heavy modification either. If you like this video, give it a thumbs up, consider subscribing if you have not already. If you want to join our public Discord server, that's linked below. Consider supporting us on Patreon, and I will catch you in the next one. My name is Greg, thanks for learning with me.",
    "transcript_keywords": [
        "Windows",
        "power",
        "pretty",
        "rig",
        "card",
        "graphics card",
        "power supply",
        "bit",
        "Optiplex",
        "thing",
        "make",
        "time",
        "graphics",
        "FPS",
        "good",
        "key",
        "Dell Optiplex",
        "Dell",
        "drive",
        "Dell Optiplex CPU"
    ],
    "transcript_entity_values": [
        "Microsoft",
        "Corsair",
        "21",
        "80",
        "PCI",
        "Fire Strike",
        "around 100 bucks",
        "two",
        "second",
        "the next year",
        "better than",
        "GTA 5",
        "1650",
        "50s and 60s",
        "Optiplex",
        "Optiplex CPU",
        "NVIDIA",
        "only around $15",
        "Non-K",
        "10%",
        "GSVIP",
        "AX2",
        "4",
        "Optiplex",
        "100 USD or",
        "512",
        "Dell",
        "three or four",
        "the Compare Results Online",
        "15 bucks",
        "30%",
        "two and a half inch",
        "a few minutes",
        "HP",
        "three hundred dollar",
        "one",
        "around $15",
        "about 15",
        "RAM",
        "around $20",
        "200",
        "60 FPS",
        "Windows",
        "200 bucks",
        "first",
        "500",
        "7700",
        "three and a half inch",
        "6",
        "SSD",
        "HDMI",
        "Fire Strike",
        "250",
        "the Cheapskate PC Build",
        "Core",
        "SATA",
        "sec",
        "Shadow of the Tomb Raider",
        "Discord",
        "Windows",
        "8000",
        "Optiplexes",
        "mid-tower-ish",
        "34%",
        "Windows 10 to 11",
        "a fourth",
        "Windows 10",
        "First",
        "AMD",
        "a hundred plus dollars",
        "5",
        "16",
        "10",
        "VIPSCDKEY",
        "NZXT",
        "1080p",
        "VIPSCDKEY",
        "six",
        "zeros",
        "FPS",
        "70-80%",
        "half",
        "Skylake",
        "165",
        "May",
        "PayPal",
        "mid 60s",
        "Patreon",
        "CPU",
        "zero",
        "around a year ago",
        "1080p",
        "Windows 10 Pro",
        "20",
        "two or $300",
        "1440p",
        "eBay",
        "Windows 11",
        "Los Santos",
        "Greg",
        "20 bucks",
        "$200 to $300"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERCENT",
        "QUANTITY",
        "TIME",
        "ORG",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "ORG",
        "CARDINAL",
        "LAW",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "GPE",
        "PERSON",
        "MONEY",
        "MONEY"
    ]
}