{
    "id": "sfwkl3Qegtg",
    "title": "Samsung Note 9 Durability Test! - Bixby is not Secure...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-08-20T13:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=sfwkl3Qegtg",
    "category": "Howto & Style",
    "tags": [
        "Note 9 Durability Test",
        "Note 9",
        "samsung",
        "galaxy note",
        "Note 9 scratch test",
        "Note 9 bend test",
        "how durable note 9",
        "buttons fall off",
        "remove buttons samsung",
        "Note 9 button",
        "Note 9 bixby",
        "Android",
        "mobile phone",
        "smartphone",
        "tech",
        "technology",
        "iPhone",
        "New iphone",
        "Apple",
        "Galaxy Note 9",
        "explode",
        "bixby"
    ],
    "views": 4200445,
    "likes": 84501,
    "comments_count": 11554,
    "description": "Protect your phone with dbrand!:  The Samsung Galaxy Note 9 is HERE and its time for a durability test. Will the Note 9 survive the scratch burn and bend test? Will all the buttons remain intact during this video? Is that question super oddly specific? The Samsung Galaxy Note 9 is on my desk and about to be scratched, burned and bend tested to the max. Before spending a thousand dollars on samsungs newest flagship, its important to know if the Note 9 is fragile or if the Note 9 will survive the test of time.   How durable is the S Pen? Glad you asked, in this video we also test the durability of the Note 9 S-Pen. Most of the time it will be hidden inside your phone, and protected by Samsungs iconic ridged durability... but theres always something new we can learn.   Would you buy a phone where someone could prank you? Are you surprised at how secure Bixby is?  Galaxy Note 9 Teardown:   Fix your Note with parts and guides from iFixit!:   Current Galaxy Note 9 Pricing on Amazon:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://dbrand.com/bananas",
        "https://youtu.be/L5eSaFIIUpM",
        "https://ifix.gd/2zNeWuJ",
        "https://amzn.to/2XU0zm1",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Galaxy Note 9 arguably one of the most powerful and professional phones on the planet. Built for businessmen, hardcore gamers, and smartphone power users. But...is it durable? There's only one way to find out. Let's get started. [Intro] One of the unique features of the Note series is the s-pen. We'll break more into that in just a second. It's just one of the many things that allow this phone to take productivity to the next level. Samsung has never failed one of my durability tests before, and I have high hopes that this phone will continue the trend of solid build quality. Let's start with the scratch test. These little Mohs picks with different tips tell us what the screen is made from. Plastic would scratch at a level 3, tempered glass at a level 6, and sapphire would be a level 8 or 9. Samsung is using tempered Gorilla Glass 5 this time around, so there's no surprise when we see scratches at a level 6, with deeper grooves at a level 7. Perfectly on par with other major manufacturers like Apple or LG. Razor blades or keys won't hurt the glass, but there are still plenty of other particulates out there that can damage glass and cause micro scratches in your pocket. So a screen protector or skins might be something worth looking into. The top of the phone is protected with the same front glass, so no scratches will happen to the 8 megapixel front facing camera or the iris scanner. The earpiece is made from metal and sits totally flush with the glass screen. And even with some aggressive persuasion, it won't come out. So solid design so far. It looks like Samsung has again stuck with the same glass and metal sandwich they've been using for the past 4 years. And...it's definitely still metal. The volume buttons are also made of metal as well as the dedicated Bixby button, who even after much ridicule is disappointingly still....oh...I did not see that coming. Bixby has exited the premises It looks like every single one of the buttons on the Note 9 are removable, which is incredibly interesting. They are tight, so I doubt they would ever come out on their own or during a drop. But we just managed to update Bixby right on out of the frame. It kind of takes remapping buttons to a whole new level. The sketchy part is someone could steal your power button or volume button in about 2 seconds, rendering your $1,000 phone inoperable. But, I mean, it's a professional phone, which means you probably have professional friends, and they wouldn't just steal your buttons and walk off....right? When the buttons are replaced back into the frame, they do continue to function just like normal, it just seems like a super annoying prank just waiting to happen. The top of the phone is made from metal. One of my favorite parts of this phone is the expandable memory. This phone with it's docking ability and powerful hardware, combined with the massive storage space, makes it more like a water-resistant laptop in your pocket than anything else. The bottom of of the phone is also made from metal. And it has more features on this one side of the phone than Apple has in their entire ecosystem. We have a headphone jack, the quick charge USB-C dock, and the integrated s-pen. Samsung is over here able to cram entire writing utensils inside of their cell phone, while Apple is eating crayons, watching their whole pencil poke out the bottom of an iPad. [Dan] Look how dumb that looks. [Zack] I know which design I prefer. The s-pen does have some new features this year, which we'll check out. The entire thing is made from plastic, including the chrome section up at the top near the clicky bit. The button on the side of the s-pen is also plastic. It still has the removable tips, which come included in the box, so you can swap them out for softer or harder rubber depending on your note taking preference. One of the coolest things about the new s-pen is that this time it includes low energy Bluetooth and a super capacitor inside, which makes this the most advanced s-pen yet. It still has the copper induction ring around the tip so the screen can sense where the s-pen is pointing, even when hovering over the glass and not touching. But on the circuit board itself is where we find the super capacitor which fully charges after only 40 seconds inside the phone, and lasts about 30 minutes as a trigger for your camera, or to change tracks on your music remotely. The difference between capacitors like the one inside the s-pen and batteries, is that capacitors charge almost instantly and keep that charge contained in an electrical field, while batteries store their energy in chemical form like lithium, and have a much longer lifespan. It's pretty cool technology. We'll reject Bixby's update and move onto the back of the phone. The camera lens is made from glass protecting the dual optically stabilized regular and telephoto lenses and that built-in heart rate monitor. Samsung has stuck their variable aperture lens in here again, which will be fun to see during the teardown. The fingerprint scanner is still scratchable. The camera lens and fingerprint scanner sit pretty flush with the back glass. The camera it protruding every so slightly, while the fingerprint scanner is barely recessed. Even with the scratches on the fingerprint scanner though, it was still incredibly fast to recognize my fingerprint, and was still responsive every time I unlocked the phone. Thumbs up for that. I talk about protection a lot here on my channel. One way to protect against damage and fingerprints is with a skin. Huge thanks to dbrand for supporting my channel and sponsoring this video. Dbrand has protective skins in all colors and designs, but this yellow carbon fiber is perfect if you're always losing your phone or just really have a thing for bullet proof bananas. Skins are surprisingly inexpensive, and I'll leave a link for you in the video description. If you like seeing yellow things on phones, you'll love my burn test. This 6.4 inch, super AMOLED screen on the Samsung Note 9 lasted an impressive 15 seconds under my yellow flame before the screen turned white, and then surprisingly recovered...minus the evaporation of the oleophobic coating on the glass of course. The screen is totally back to normal. And now for the ultimate test of structural integrity the bend test. Samsung has pretty much always been a leader in the well-built rigid smartphone department ever since the very first phone I tested back with the Galaxy S6 in 2015. Samsung's newest flagship is no different, with zero flex in any direction, front or back. This phone construction is worthy of the massive price tag, except for the part where people can walk off with your buttons. Like I always say, keep your friends close and your buttons even closer. Would you buy this phone? I'm still currently using my year and a half old Galaxy S8 Plus as my daily driver and I'm still super happy with it. So I think I'll hold out on upgrading for just a little while longer. Customize your phone with the dbrand link in the description. Hit that subscribe button if you haven't already. And in the next video, we'll be tearing down the Note 9 to check out that massive fortnight ready heat dissipation system. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "phone",
        "glass",
        "Samsung",
        "buttons",
        "Note",
        "spen",
        "level",
        "made",
        "screen",
        "button",
        "metal",
        "fingerprint scanner",
        "back",
        "Bixby",
        "fingerprint",
        "scanner",
        "camera",
        "super",
        "Samsung Note",
        "phones"
    ],
    "transcript_entity_values": [
        "only 40 seconds",
        "3",
        "Razor",
        "Samsung Note",
        "8 megapixel",
        "6.4 inch",
        "15 seconds",
        "9",
        "Bixby",
        "1,000",
        "8",
        "2015",
        "Dbrand",
        "Mohs",
        "6",
        "fortnight",
        "Bixby",
        "only one",
        "Galaxy S8",
        "the past 4 years",
        "about 30 minutes",
        "zero",
        "iPad",
        "this year",
        "5",
        "Apple",
        "Dan]",
        "the Galaxy S6",
        "second",
        "Samsung",
        "Zack",
        "One",
        "Bixby",
        "about 2 seconds",
        "USB",
        "one",
        "LG"
    ],
    "transcript_entity_types": [
        "TIME",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "GPE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}