{
    "id": "SH88jkuzICU",
    "title": "Google Pixel 3A review: a $399 phone with a great camera",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-05-07T18:27:25Z",
    "video_url": "https://www.youtube.com/watch?v=SH88jkuzICU",
    "category": "Science & Technology",
    "tags": [
        "pixel 3a",
        "google pixel",
        "google pixel 3a",
        "pixel",
        "pixel 3",
        "google pixel 3",
        "google",
        "google io",
        "google I/o",
        "new phone",
        "phone",
        "rumors",
        "leaks",
        "smartphone",
        "io",
        "I/o",
        "io 2019",
        "developer update",
        "android",
        "android q",
        "developers",
        "google developers",
        "2019",
        "2018",
        "google assistant",
        "google keynote",
        "keynote",
        "event",
        "google io 2019",
        "chrome",
        "google chrome",
        "i o",
        "sundar pichai",
        "technology",
        "tech",
        "gadgets",
        "latest updates",
        "tech news",
        "apple",
        "hands-on",
        "review",
        "verge",
        "the verge"
    ],
    "views": 1152889,
    "likes": 19902,
    "comments_count": 2034,
    "description": "Googles Pixel 3A or Pixel 3A XL is the best phone under $500, and its actually competitive with more expensive phones in one very important way. The Pixel 3A has a great camera. While it has many of the same compromises you usually make when you buy a cheap phone, the photos it takes are nearly indistinguishable from what comes out of a Pixel 3.   Learn more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Why'd You Push That Button Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2YbzYfB",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "https://pod.link/1295289748",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- There's new Google phones! This is the Pixel 3a, and then there is a slightly bigger Pixel 3a XL. And, here's what you need to know right at the top of this review. This is a solid phone that costs 400 bucks, and it has a great camera. That combination of those three things never happens. To start, I just want to lay out the basics of why I think this phone is so remarkable and why a lot of people are going to be really happy if they go out and buy it because there's really nothing else like it on the market right now. If you want to go out and buy a smartphone with a great camera, you've got a couple of options. You can get something in the top tier of what's good and what you can trust, but to do that, you have to spend a minimum of like six or seven hundred bucks, and sometimes you end up spending well over a thousand. Your other option is to scrabble around for a deal or to look for a slightly older phone. If the camera's less important to you, you can get a lot of surprisingly decent Android phones for less than 500 bucks, and, lately, they don't even have the compromises that you might expect. A lot of them are fast and nice looking and even have recent software. But, none of those cheap Android phones have great cameras. The Pixel 3a, though, it has a great camera. For the most part, I can't tell the difference between photos shot with this phone and photos shot with a regular Pixel 3, which costs about 300 dollars more. I'm not even going to tell you which of these photos is which because they're so close to each other that it doesn't matter. They might as well be identical. And, you get the same camera features as a regular Pixel 3, including Night Sight for low light shots and a new time lapse feature that's coming to all Pixel phones. On top of all of that, it has good design, a nice OLED screen, reasonably load speakers, and a guarantee to get the most up to date versions of Android first. And, hey, what, look at that! It's an honest to god, regular old headphone jack, right on the top. The small one costs 399, and the one with the big screen, and also no notch, costs 479. They're available on Verizon, Sprint, T-Mobile, Google Fi, and U.S. Cellular. And, it'll also work on pretty much any other carrier that you have. That carrier support actually matters because it means you can go to your local store instead of dealing with mailing stuff back and forth to Google if you have a problem with the phone. So, what's the catch? There's always a catch right, there has to be a catch. Well, yeah, there are a few. There's two big things, and then a dozen little things that you're going to be giving up by not buying a phone that costs 750 dollars or more. First, and probably most importantly, it's not super fast, it's kind of slow. Here, look at this, I just reset both of these phones, so they're fresh, and were going to launch apps on both of these at the same time so that you can see that there is a delay. Mostly when you open apps, you're going to find that they take a second or two longer to open up than you'd want. You see it, right? That slow down is because the chip inside the Pixel 3a is the Qualcomm Snapdragon 670, which isn't as fast as the 845s and 855s you get on more expensive phones, like the Pixel 3 or the Galaxy S10. And, it's definitely not as fast as the processor on an iPhone XR. The weird thing though is, once I get into just using the phone, it didn't feel slow and it didn't stop me from doing anything at all, even playing intense games, like PUBG on high graphic settings. The camera doesn't process photos as quickly as it could either because it doesn't have a separate image processing chip, but, again, that didn't change the quality of the pictures that I took. Is the faster speed that you get on a premium phone worth spending an extra 300 dollars? Maybe not. But one thing to consider is that overtime we know that all phones tend to slow down, and that's been a particular issue with the Pixel 3 and that phone isn't even a year old yet. So, if you're not in a hurry to buy, it might be worth taking a wait and see approach with the Pixel 3a. The second thing that you lose by not buying a more expensive phone is just overall build quality things. The things that make a phone just look and feel really good, that make you feel like you have a nice thing in your hands. Now, don't get me wrong, I don't think that the Pixel 3a feels cheap, but it's definitely not premium, whatever that means. Actually, we know what premium means and why this phone doesn't fit into that category. First, it has a plastic, sorry, polycarbonate body. It has these big bezels, especially the top and the bottom. It doesn't have two cameras on the front. It doesn't have wireless charging. It doesn't have an in-screen fingerprint sensor or facial recognition. Losing all that stuff isn't too painful, as long as the overall experience is well designed and pretty good, and the Pixel 3a is those things. You can get it in white or black or this color right here, which Google calls purple-ish. It looks good. The only build quality thing I really have to complain about is that its not water resistant, and that one kind of hurts. The other thing that makes an expensive phone premium is a killer screen. Something that not only goes edge to edge, but is also tack-sharp and color accurate and maybe has some techno features, like fast refresh rates or whatever. The Pixel 3a does not go in for all of that, but it does have a nice OLED screen. It's maybe not the highest resolution and the color temperature on the small one runs a little bit yellow-ish for my taste, but, then again, it's better than the Pixel 2XL from a couple of years ago. It's also a glass screen, not plastic, but it's not technically Corning Gorilla Glass, it's something called Dragontrail, but whatever. I think the screen is totally fine. When a phone costs 750 or 1200 dollars, you should knit-pick the hell out of the screen. That doesn't mean it's okay for a cheaper phone to have a crap screen, but, luckily, this is not a crap screen. I think it's all right. So those are the two major things you lose out on compared to a flagship phone: the overall speed and the premium feel of the body and the screen. But there are a bunch of other little things that most people probably won't lose sleep over, so let's see. It doesn't have stereo front facing speakers because the bottom one fires downward instead. It doesn't have the fastest networking, so you won't get ultra broadband speeds on WiFi or LTE. It doesn't support Daydream VR, and you can't do wide angle selfies which, honestly, I am kind of sad about, but also I'm kind of over it, but I don't know. Oh, one annoying thing I should mention, Google Photos will only give you the regular high quality backups for free here. To get the full resolution, original quality for free, you have to step up to a full Pixel 3 which I think is a cheap move, but whatever. Anyway, the important thing that Google managed here is nailing the basics. So, for example, battery life is great. If you're an Android person, you'll want to hear that I'm getting about four to four and a half hours of screen time on the small one and even better on the big one. For everybody else, you should know that it'll last a full day, unless you do something really battery killing, like sit in an hours long video conference or play a really graphically intense game. And, again, the camera is great. It's on par or better than the iPhone XR, XS, and Galaxy S10. Video quality could be better, and phones like the Huawei P30 Pro are beating it on low light photos, but, still, this thing costs 400 dollars. I don't know if I have ever said a 400 dollar phone had a great camera before. Also, I'm going to repeat myself again here, headphone jack. (upbeat music) Am I recommending this phone? Yes, if you want a phone for less than 500 bucks. You get Google's version of Android which is clean, and easy to use, and always updated. You get that camera, and you won't have anything that annoys you day to day. Like I said, even the speed thing hasn't bothered me that much. Do I think this thing will sell like hotcakes? I honestly don't know. People aren't upgrading phones as often now, maybe that means that, when they do, they're going to want get nicer, more expensive models that they hang onto for longer. But, I do know this. I have been waiting for Google to make this exact phone for something like five years. Google used to make phones that were ridiculously good for the price, shout out to the Nexus 5, and I'm glad that it's getting back to it. This is the kind of phone that Google should be making, something really good and really affordable. Hey everybody, thank you so much for watching! Let me know what you think of the Pixel 3a down in the comments. Does it seem like it's the phone for you? And also, obviously, keep it locked to The Verge. We have a ton more Google I/O content coming for you.",
    "transcript_keywords": [
        "Pixel",
        "phone",
        "Google",
        "phones",
        "thing",
        "screen",
        "camera",
        "things",
        "Android phones",
        "great camera",
        "Android",
        "great",
        "Pixel phones",
        "regular Pixel",
        "costs",
        "good",
        "photos",
        "Google phones",
        "cheap Android phones",
        "quality"
    ],
    "transcript_entity_values": [
        "Daydream VR",
        "hours",
        "Night Sight",
        "Android",
        "Dragontrail",
        "one",
        "last a full day",
        "five years",
        "400 dollars",
        "Verizon",
        "Sprint",
        "a thousand",
        "Google Fi",
        "three",
        "T-Mobile",
        "Corning Gorilla Glass",
        "LTE",
        "750",
        "seven hundred bucks",
        "Google",
        "about four to four",
        "Huawei P30 Pro",
        "about 300 dollars",
        "six",
        "479",
        "XS",
        "Pixel 3",
        "U.S. Cellular",
        "an extra 300 dollars",
        "Pixel 3",
        "1200 dollars",
        "Qualcomm",
        "3",
        "less than 500 bucks",
        "a couple of years ago",
        "399",
        "XR",
        "two",
        "jack",
        "the Galaxy S10",
        "Galaxy S10",
        "Google Photos",
        "second",
        "first",
        "iPhone",
        "400 dollar",
        "400 bucks",
        "750 dollars",
        "a dozen",
        "a ton",
        "First"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "LAW",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL"
    ]
}