{
    "id": "shumN3hM198",
    "title": "Passkeys might really kill passwords | The Vergecast",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-02-13T14:00:43Z",
    "video_url": "https://www.youtube.com/watch?v=shumN3hM198",
    "category": "Science & Technology",
    "tags": [
        "vergecast",
        "podcast",
        "the vergecast",
        "the verge",
        "gadgets",
        "technology",
        "tech",
        "1Password",
        "Fossil",
        "passkeys",
        "passkey",
        "nilay patel",
        "david pierce",
        "alex cranz",
        "google",
        "vision pro",
        "tech news",
        "tech podcast",
        "tech events",
        "the vergecast podcast",
        "vergecast podcast"
    ],
    "views": 32444,
    "likes": 571,
    "comments_count": 74,
    "description": "Today on the flagship podcast of video podcasts: The Verge's David Pierce chats with 1Password's Anna Pobletts about good password hygiene, passkeys, and the upsides of a third-party password manager. Victoria Song joins the show to discuss the state of wearables and why this may be the year for the smart ring. Later, David answers a question from The Vergecast Hotline. #Podcast #Technology   Read more:   0:00 - Intro 01:54 - Passkeys w/ 1Password's Anna Pobletts 30:57 - Wearables w/Victoria Song 56:47 - Vergecast Hotline  Further reading:  1Password rolls out public passkey support to its mobile apps and web extensions:  Fossil is quitting smartwatches:  This might be the year of the smart ring:  Apple Vision Pro review: magic, until its not:  Heres how much the Vision Pros accessories cost:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "https://trib.al/HtBK3Nm",
        "https://trib.al/MHF6jQ8",
        "https://trib.al/dtkxNbi",
        "https://trib.al/R7mqdno",
        "https://trib.al/c4DwQwp",
        "https://trib.al/L2yBANk",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3P4bJgz"
    ],
    "transcript": "- Welcome to \"The Vergecast,\" the flagship podcast of video podcasts. I'm your friend, David Pierce, and if you're watching this on YouTube, there's a decent chance you're noticing something slightly different for one of our Tuesday episodes, which is my face. So we just finished moving the show from \"The Vergecast\" channel to The Verge's channel, and you should stay subscribed on \"The Vergecast\" channel by the way, we're gonna do clips there and some extras and maybe even some live stuff over time. We have big plans for that channel. But for the main episodes, Tuesdays and Fridays, stay tuned to The Verge's channel. You can subscribe to the channel, you can subscribe in YouTube Music, you can subscribe to the podcast playlist specifically. The world is your oyster, it should be very easy. I know we hit some migration issues the last few days, but I think those are solved now. And if they're not, send us an email, vergecast@theverge.com. We'll get it fixed. Oh, and by the way, if you're like, \"What are you talking about? I listen to podcasts because people listen to podcasts and I have a podcast app and I've never seen David's face and I don't ever wanna see David's face.\" Totally fine, I get that all the time. Nothing should change. Everything will be as normal, so don't worry. All right, that's enough housekeeping for now. Let's just get into the show. We're gonna do two things on today's episode. First, we're gonna talk about passkeys, which are this supposedly revolutionary technology that is going to make being online easier and simpler and more secure all at the same time. It's very cool, it's growing really fast, and I have realized I don't understand passkeys like at all. So we found somebody who does, and we're gonna figure it out together. Then we're gonna talk about wearables, and the idea that wearables are just smartwatches, feels wrong to me, like I wear an Apple Watch, I love my Apple Watch, but we were promised this big revolution in wearable technology and I don't think we ever really got it. So we're gonna try to figure out why. All that is coming up in just a second. But first, I have to go home and make my face and hair look better before I have to do this again. This is \"The Vergecast,\" let's go. (upbeat music) Welcome back. All right, let's talk about how to have good password hygiene on the internet, which is the least interesting thing I could possibly imagine saying to begin this, but that's actually part of why I wanna talk about this. I feel like I've spent most of my life scolding people to have better passwords and use a password manager and get two-factor authentication, but not SMS two-factor authentication. And it turns out most people just don't care. And even I still use the same password across way too many services. It's a real problem. But there's this one new technology called passkeys that in theory might be the solution to all of our problems. It's designed to be more secure than passwords and also simpler than passwords and basically, just better in every imaginable way. And it's growing really fast. Google supports passkey now, so does Amazon, iOS and Android both do. You can passkey login to TikTok and WhatsApp and Uber and PayPal and a whole bunch of other services. This tech is very much catching on in a way a lot of the supposed replacements to the password haven't in the past. But I have to confess, I don't really understand passkeys. I mean, I understand the theory. They use an encrypted token on your device to authenticate you rather than a password that you type into a text box. That's about all I understand about it. So I invited onto the show somebody who knows much better, - [Anna] Anna Pobletts, head of Passwordless at 1Password. - [David] Anna has been working on Passwordless Tech for a long time, so I asked her to come on the show and explain to me how passkeys work, why everyone is convinced they're the future, and most of all, how we as normal humans, are supposed to use them in our lives. One note before we get into it, she talks a bunch about 1Password specifically, which makes sense, I mean, that's where she works, but a lot of what she's talking about is true for most password managers and most platforms. That's part of the point of passkeys is that they are the same everywhere. She also makes a point later on in the interview about the upsides of a third party cross-platform password manager rather than using the ones built into your device. And I actually think that argument is pretty compelling, but again, there are a lot of good options there and you kinda can't go wrong. Anyway, let's get into it. The first thing I asked Anna about is basically, why haven't we killed passwords yet? It's been the death of password for forever. Passkeys are supposedly the end of passwords, but I've heard that so, so, so many times before. So what is it about passwords that means they just won't go away? - [Anna] We've been talking about how passwords are bad for like 20, 25 years, right? - [David] Like since passwords. - [Anna] Yes, exactly. Like over and over again. So why now seems like a very reasonable question and I think the truth is that this is the first time where security and user experience aren't mutually exclusive. If you think about previous attempts to either like improve the security of passwords or replace passwords, they always come at the expense of user experience. So for example, multi-factor authentication, add security to passwords by, you know, requiring a TOTP code or an email or something like that, but that's an extra thing that a user has to do to log in. If you think about certain types of biometrics like proprietary biometrics, that's some sort of hardware that you need to add into the mix. And so there's always this extra step or extra thing that a user has to think about. But with passkey, the idea is that you don't have to compromise on those things. You're gonna get better security and you'll also get a really smooth, frictionless sign-in process. - [David] So from a pure user experience perspective, I think it's right to say people will do the simplest thing, right? - Yes. - And even when we know it's bad, even when it's terrible hygiene that everybody agrees is bad, I think most people intellectually know don't use the same crappy password for every single thing and yet most people do because it is just the easiest thing to do and it's very annoying to remember all of your different passwords. In a funny way, it seems like the bar is both very low in that you have to replace people's crummy passwords with something more secure, but also very high because actually remembering one password that is just one, two, three, four, and then typing that in everywhere, is actually a pretty good user experience. - [Anna] Certainly, a good user experience, yes, but the bar is so low on the security side. - [David] It leads to bad things I suppose. - [Anna] Yeah, exactly. So when I think about like all the things that are wrong with passwords, for me, it really comes down to the fact that passwords put all of the burden on a user to be secure, right? It's on you as a person to think up good passwords, remember them, not use the same one everywhere, not fall for a phishing attack, all of these things. But with passkeys, the goal is we can actually remove the human error completely from logging into apps. And so if we give you something that's easy and frictionless and the security is actually built into the technology, then there's nothing for you to do wrong, right? Like it just works. So in the case of passkeys, when you're logging in, all it does, it looks and feels to you like you're just unlocking your device, usually something like face ID, touch ID, Windows Hello. And so it looks and feels like something that is familiar to you, something you know how to do and there's nothing, there's no thought you have to put into it of, did I pick my most secure passkey, right? It's just kind of all happening behind the scenes. - [David] That's really smart because I think so much of this stuff, and we talk about this with sort of security and privacy in all forms on the internet, it all ends in scolding, right? You kinda have to make people feel bad and scare them in certain ways in order to just like beat them into having good behavior. And what it actually is, if you give people a better product that is also safer, they'll do it. And if you make them feel bad, they still won't change their ways. And I think what this whole industry seems to be coming around to in a cool way is like, what if we just built better products? And I think that's very exciting. - Exactly. Yeah, totally, like it's not that people don't wanna be secure, I think that's not where this is coming from, that's not why passwords have stayed around. It's sort of just like an inertia, like it is what people know how to do and it's there and there's never really been an option that feels a lot better. Like I used to do security consulting for a number of years and we would work with these companies and they, we'd tell them like, \"Hey, you have a weak password policy\" or \"You need to add two-factor,\" all these like controls around your account security and especially, for consumer-facing applications, they'd be like, \"I mean, I could, but that's gonna hurt my user conversions. People aren't gonna sign up for my application.\" And so that trade off was never worth it to them, right? But with passkeys you can actually, like we can say, \"This is actually gonna help your conversions. Users will sign up faster for your application.\" And so all of a sudden there's also a business reason to use passkeys, not just a security reason. - [David] Yeah. Where did passkeys come from? I feel like in the time I've been covering the space, there was a minute where it was like, everybody's gonna have a YubiKey and that's the solution. And then we got into two-factor in all of its many different forms and I think we went from bad two-factor over SMS to like pretty good two-factor inside of apps like 1Password and Authy and some of the other stuff around. And passkeys kind of crept up on me a little bit over the last couple of years, but my sense is they've been around longer than most people realize as kind of a possibility and an idea like where did this come from? - [Anna] Yeah, so there's a technology that kind of underlies passkeys called WebAuthn, that's been around for probably about 10 years, I think. And there's a group called the FIDO Alliance that's like an industry organization. A lot of big companies are a part of it and they're all focused on, you know, bringing passwordless authentication to the world. And so this protocol was invented, it's the same thing that YubiKeys use that's used to provide this sort of public key cryptography-based authentication. - Okay. - So it's been around for a really long time, but you usually had to have some sort of hardware key, like a YubiKey. And so, it might work really well in a workforce or a corporate environment, but could be really challenging for the everyday people who don't just have a YubiKey, right? - [David] I got a YubiKey. I set up everything on my YubiKey and then I realized the place I leave my keys is several rooms away from where I sit. - [Anna] Right, it's not near your computer. - [David] Like my keys are upstairs right now with my YubiKey on them and there is no chance I'm gonna use it ever. - Exactly, like the fact that you even have one is really rare. And so, a couple years ago, there's this big announcement from the major platform saying, we're now supporting what we're calling passkeys, which is essentially WebAuthn credentials that can be synced between your platform account. So now, instead of being tied to hardware, those passkeys are stored in your iCloud account or your Google or your Microsoft account and more recently, maybe your 1Password account, which we'll obviously get into at some point. But the idea is that now, these credentials are a little bit more accessible, you don't need special hardware, they'll sync between your different devices a little bit better to make it a little bit easier for you to access them. And that's been like the big push that you're hearing about in the last couple years. - [David] Got it. Okay. And was there a technical development that made that possible? Like what happened between a decade ago and maybe two years ago when this really started to become a thing that kind of tipped it into this is a thing we can do in a real mainstream way now? - [Anna] Yeah, it was really this syncing concept. And so Apple, Google, Microsoft saying like, yes, instead of storing these credentials in like a secure enclave on a device, we can store them securely in your cloud account. - I see. - And we can sync them between these different devices. So you know, in some really, really high assurance environments that might be a little bit of a security trade off, right? Because you don't have as much hardware security there. But for most consumer use cases, if you're logging into Home Depot or Netflix or things like that, that's actually still a really good security story and it's way, way better than password. So you're still getting all of those sort of unfishable security benefits of passkeys, but with a little bit more user friendliness. - [David] Got it. Okay. Yeah, so talk to me about the unfishable part of this because I think I was reading through in preparing for this a bunch of the criticisms people have of kind of all of the password replacing technology. And there are two I wanna talk about. One is now everything is on my one device. What happens if I lose my device? We'll get to that in a second because I think that's very interesting and also just happened to me recently. So we'll talk about that. But the other one is people saying, well, actually, secure passwords are part of the problem, but the bigger problem is phishing and it's people social engineering their way into my accounts and actually what we have to solve is that problem and not people having bad passwords because if somebody can convince me to type in my password on a fake webpage, we've solved nothing. But the belief with passkey is that they actually solve most if not all of that problem too, right? How does that work? - [Anna] Yeah, so there's a few really big security benefits with passkey. So there's kind of the obvious of like, you know, there is no user generated secret type of thing that someone could guess that they could just, you know, reuse across a bunch of websites and guess. - [David] I can't leak you a password if I don't have a password, I guess is something. - [Anna] Exactly, if I don't know what it is, you can't guess it. So that's really big, right? There's a lot of attacks that can happen remotely and at scale that things like credential stuffing are really common against websites. So those things kind of all go away because there just isn't a credential in the traditional sense. Now, the other big thing is, of course, resistance to phishing attacks. So passkeys are tied to a specific website or domain and so, if an attacker were to make a lookalike site, you know, Facebook.com with zeros instead of O's, your passkey for Facebook.com like will not be used on Facebook, the lookalike site, right? Like those passkeys simply aren't transferrable, they're not the same thing- - [David] Because the key on your phone and the key on fake Facebook just will, literally will not understand each other. - [Anna] Exactly, like, that key won't be used on that site at sort of at the device level, at the browser levels, like all, there's a lot of protections in place to sort of tie these passkeys to a specific domain. And so, at least for that specific type of phishing attack, where, which is really common, you know, you have a lookalike site, they ask you for your password and then they reuse it on the real site, that just kind of totally goes away. And I think that's really big, especially right now, there's so many news articles around like AI and how AI is making it even easier to make really realistic phishing attacks. This type of prevention of that whole swath of attacks is really, really big and just gives people a little bit more confidence, I think, when using the internet that you don't have to constantly wonder, is this the real site? Is this a real email? Like, do I need to double check? Like I think just giving people a little more confidence in that way is helpful. - [David] Well, and there's a weird tension in that even that it feels too easy, honestly, using passkeys sometimes where it's like, this can't actually be solving my problem. All I did was tap the thing, the pop-up on my phone that said, \"We cool?\" And I said, \"Yeah, we cool.\" And then I, and now I'm logged in like, at least with a password, you kind of understand I am delivering something that is a secret in order to allow me in. And there is something to the fact that this is so simple that it almost feels less secure even though it's not, I don't know, part of me wants you to like, make it seem scarier every time I do it because it'll make it feel more secure. - [Anna] This is actually a very real thing that I think I've seen that people in the FIDO Alliance have seen when you do research with end users that they're kind of like, \"Oh, okay, I guess I logged in.\" Like they maybe don't even recognize that they actually like, registered for or logged into an application and they're like, \"Okay, I guess that was okay, how am I gonna do that next time?\" Or they don't totally understand. And so there's been a ton of research done on the best ways to communicate to users what's going on, which I think is so important as websites start to roll out passkeys that the user experience there is just so important to make sure users are like, \"Oh, okay, like this looks and feels like my touch ID, like, I understand what I'm doing here,\" and kind of giving them that experience. But it's really hard, which is, it's silly, kind of silly that, you know, security has to look hard. Like people are used to security being hard for it to work. - Right. - [Anna] And so it's kind of breaking that stereotype. - [David] And that kind of goes to the other piece of feedback I've seen a bunch about passkeys, which is that we've all been trained now that you have to have two factors, right? There's the thing, you know, and the thing you have and the thing I know is my password and the thing I have is my phone. Great. That is better than just a password. And there's something to kind of compressing all of that back down into a passkey that like I just, I don't even remember I like, tweeted, or something about passkey in 1Password being like, \"This is cool, I can now have all of my stuff in both apps.\" And I got a bunch of responses from people being like, that's not two-factor security, that's one-factor security because it all just lives inside of 1Password. And I was like, I don't think that's true, but I'm not. But I sort of see the point right where it's now as long as I'm holding my phone, there's no other jobs to do and I wonder if part of that is again, you're sort of obfuscating the steps in the name of simplicity that actually makes it feel like I'm not doing the hard work of being secure anymore. - [Anna] Yeah, I think that's really fair. And I think, you know, we've talked about these traditional authentication factors, something you know, something you have, something you are, or whatever and talking about passkey in that sense is like, a little bit confusing, but I think we, I kind of do it anyway to help explain to people. I think the easiest way to think about is it's something that you have, it's whatever device you're currently logged onto, say your Google device or your 1Password ever, your 1Password, you know, your browser extension or your desktop app and then it's also something you either have or are or know or something like that depending on, you know, it's either your touch ID, face ID, your pin, your 1Password password and secret key. It can be like whatever that other factor is that you're actually using to log into the account where your passkey is stored. But there's always a little bit of a like device ownership aspect to that which kind of gives you that second factor. And so it's a little bit like square peg, round hole, but I think you can kind of roughly put passkeys into that bucket to help people feel a little bit better about that. - [David] Okay, yeah, so the two factors then if you were to sort of boil it all the way down, would basically be my phone and the information required to log into my phone. - Exactly. Yep. - Which is two things and I think, ironically, back to the like, this is almost too easy thing. I think if you were forced to type in your passcode every time, it would make more sense. Whereas with the face ID or the Windows Hello, it kind of, it almost happened so fast that you lose track of it and it's like, well, I didn't have to authenticate anything and it's like, no, you did it, it just happened really quickly and automatically, which is a great thing but kind of an alarming one to get used to at first. - Yeah. - Like, it certainly took me a few tries to realize, oh, it's doing face ID every single time my passkey comes up because that's part of the authentication process. - [Anna] Exactly, and I don't think people think about that when they're just unlocking their phone to use it. Like they don't necessarily think too hard about it, it's just become sort of second nature. But maybe it was like that at the beginning and it was like, \"Oh my gosh, my password, my phone's not locked.\" But yeah, I think it's like you almost don't notice because you're so used to using your face ID, or your touch ID for all sorts of things, right? Like a lot of apps use that technology just to unlock an app and so the idea is we are using the thing that's familiar to people, it's just getting people comfortable with that technology in a new context like a website or an app. - [David] What do you make of the idea of tying a lot of this stuff to a device? I think on the one hand, phones are sort of inextricable parts of us at this point. Like my phone's right here or my YubiKey is upstairs. Like that is a telling fact, right? But at the same time, I had this moment the other week where I woke up one morning and my phone had updated overnight and was bricked, the touchscreen didn't work, I couldn't do anything, and I had this moment of realizing like, oh, I can't do two-factor because I can't get SMSs, I can't see them anymore, I can't get into my 1Password account because it's living, it's just sitting here on my phone, I can't text my wife. And like I had this crazy moment of being like, oh, I am way too reliant on my phone to work and have a charge and be sitting here nearby me all the time, and otherwise, my life kind of falls apart. And I think there is a reflexive worry that people have about that. That it's like the nice thing about having a bunch of insecure passwords stored in my head is the battery doesn't die. - [Anna] Yeah. They're always there. - [David] Right, and so like is it the right path to go down you think to tie it to these devices in that way? - [Anna] I think it's better to think about it less as tying it to a device and more of tying it to your like platform account. So if you're an Apple user primarily, you know, you have an iPhone and a MacBook, and all that, you probably use your iCloud account to store your contacts and to store a lot of stuff. And so when you get a new phone for example, you log into iCloud and like you recover all of your data in that way, right? - Right. - [Anna] And so I think, thinking about it that way is a little bit more realistic to be honest of sort of the current state of passkeys where it's challenging, it's the same way like you lose your phone, it's really annoying to recover all of that data but passkeys will get recovered. If you think back to like the old WebAuthn days, your passkeys were like impossible to recover in that situation. And so that's one of the big problems we were trying to solve is to make account recovery a little bit more possible. I think that's also a really big benefit to using something like 1Password. So I use a MacBook laptop, but I have an Android phone, and so I have this like cross platform situation in my life that isn't really ideal for passkeys to be honest because a passkey on my Android phone doesn't really naturally translate to my MacBook. It's this really kind of weird QR code experience. But instead, I use 1Password for everything. - [David] Okay, and then the idea is that then because 1Password works across platforms, my passkeys live in my 1Password account, they don't live on my phone, they don't live on my laptop, they live in my 1Password account. And as long as I can get into my 1Password account, which ironically soon you might do through a passkey which we should talk about, then I kind of have it wherever I am. - [Anna] Exactly. - [David] That structure makes sense to me because then you're on, as long as you can log into something, which I think in the year 2024 is a pretty reasonable assumption to make. But that brings me to the question of logging into all of my passkeys with a passkey (Anna laughs) and I just think part of what's really interesting about that is like 1Password is very much starting to try to own like the whole security stack, right? Like I now have two-factor codes in my 1Password, I have my passkeys in my 1Password and I would think that raises the stakes pretty dramatically for 1Password that now if something bad happens to my 1Password stuff, not only is something gonna get a control of my passwords, they're gonna get control of everything. And like one piece of security advice that I've heard from people over and over and over is don't store everything in one place because you should assume everything is insecure and essentially like don't let the two sides of the coin talk to each other. And you're kind of saying the opposite, which is like put everything in this one place because it's simpler and better. And I certainly agree that it's simpler, but like does it change the way you have to think about even the security of 1Password itself? - [Anna] That's a really interesting question. I actually don't think it does because our whole thing from the beginning has been that we take your security and privacy really seriously. Everything is end-to-end encrypted. Like 1Password has no access to anyone's actual credentials and I don't necessarily see a password as being any different from a passkey from like the 1Password perspective. It's ultimately, just a credential material of some sort that we're storing and we're gonna protect the same way that we would credit card data or social security numbers or like whatever data you wanna store with us, right? I try my best instead of saying password manager to say credential manager or something along those lines because it is so much more than passwords and has been for a really long time. And so, I actually don't think it changes our security model that much. We're always looking to like upgrade that and like what can we do to improve, which is where you know obviously, using a passkey to sign into 1Password comes in. Right now we have that password and secret key sort of model. We have like SSO support if you're a business customer, but for the most part it's kind of that two-factor, the secret key is sort of a device key and so we're always looking for ways to upgrade that, which is why we've been exploring passkey login which would be really incredible to add to 1Password. - [David] Yeah, why does that feel like the right way to do the sort of master login? I think part of what I'm getting at here is I think what we're boiling down to is there being one sort of crucial login, right? Whether it's the passcode on my phone or my master password for 1Password, like there is going to be one thing I have to know and that is the thing that opens up everything else. And I think with phones, one reason people are nervous is like, the Wall Street Journal did a bunch of really good reporting about people having their phones stolen and their passcodes read. And that becomes even scarier in this world where my passkeys also live on my phone because now all you need to know is the four digits I use to log into my phone and you can have everything. And with something like 1Password now it's like, I literally don't know any of my passwords except my 1Password password anymore. Which I think in a lot of ways is the intended behavior and that makes sense to me. I don't reuse that password anywhere. I don't even have that password written down anywhere. It's just, it's the 1Password I have memorized but now you're trying to even replace that, why? - [Anna] Yeah, so the good news is like in 1Password's case in particular, so I'll speak really just about that, but you have this password and you have this secret key and so even in just the state of the world right now with 1Password, if someone were to get your master password that really long one, the one that you have to remember, they actually still can't get into your 1Password account unless they also steal a device that you have 1Password on already, which is really great, right? That's a good starting point. But now what if we also make it even harder for someone to steal that password because it's not a password, right? It's not even something you know. Now, yes, that passkey does have to then live somewhere, right? So it has to live in your platform account or in a YubiKey or something along those lines. So there is kind of this like vicious cycle of where does the final passkey live and I don't know that that's like a perfectly solved problem right now but still a way better experience than right now. So we're working through it. (laughs) - [David] Yeah, I agree with that. I mean, it is just really interesting. I think you're exactly right that, yeah, at some point there is the one thing and the question of what the one thing should be, I don't know that we know yet. I don't know that we've answered it and I think the idea of it being a hardware thing that lives on my key ring makes a lot of sense but has downsides. There's like the perfect version of it would be like it lives in a safe somewhere far away where no one can get to it, but that obviously is a disastrous user experience. - [Anna] But also somehow you can get to it. - Right, exactly. - Yeah. - [David] I can teleport into it when necessary but that's it. Yeah, I don't, do you have any sense of what the best available version of that is? Is it your phone at the moment? Like the device you have? - [Anna] Yeah, I think the current state of that is, you know, we recommend that your passkey for 1Password lives in whatever your platform account is or YubiKey, right, in your iCloud, your Google. We typically recommend that you have a backup because, obviously, if you lose it, it's just kind of a pain to be honest to recover if you kinda lose that master one. So we recommend you have some backups and so that's kind of the state of the world right now. I think in an ideal world, it's something much more about your real life identity like your human identity that can identify you to a computer, right? And like none of that stuff is real yet, but there's a lot of really exciting things that people think about in the future and are working on of ways to kind of like, tie those things together but in a way that also still is, like, privacy preserving in some way, right? It still protects your identity online but it makes it a stronger sense of who you actually are on the internet. - [David] And how broad can passkey be in that sense? I mean, you mentioned wanting to log people in quicker and making the case that they're more likely to complete transactions that way, right? I just think about the number of carts I have left on purchased because typing in my address and credit card number is really annoying. Like much less setting up an account even though like guest flow is a giant pan, can passkey be a store of information beyond passwords in that sense? Is that even a thing people are thinking about? - [Anna] It definitely is. It's not really inherent in passkeys themselves, but there's a lot of sort of like additional like wallet-type of technology or other types of technology that people are talking about and working on that is kind of like that where it's more about other information that's being stored. It's almost like that password manager experience, right? Where you can store your address and your credit card information to autofill because no one likes that. I don't wanna have to make an account, I wanna be able to check out as a guest but I don't wanna type all that information. So there is a lot of work to be done on like doing that in a more like cryptographic secure way, like passkeys. But the technology as it exists today doesn't really support that just yet, it's really exciting though. - [David] It is really exciting. I mean, and that's the kind of thing if it goes from I have to type in all of this information about me on the internet over and over ad nauseum to I have a secure version of all the relevant information about me and I can just dole it out in secure ways whenever I need it. Like that's just a better internet. That's how this should all work. - [Anna] Yes, that's the dream, yes. - [David] And it does seem like increasingly the companies who are storing things like my home address and my credit card information and my password don't want that anymore because it's a security risk. Like I can't imagine if I'm Best Buy or Home Depot, I want any of the risk that comes with that anymore. So I would think most of these businesses would be psyched to figure out how to make this stuff work, right? - [Anna] Yeah, I think that's the same way that companies would wanna get rid of passwords or any really like PII they're storing, right? If they can offload any of that risk and not have a giant database table full of something that people are looking for, you know, I think that's obviously a win, right? And so I think passkey solve that security benefit, the sort of compliance regulations around like, there's a lot of good reasons and I think it's the companies who are excited to make a like user and security improvement, like those are the companies that I'm seeing like most excited about passkeys. - [David] So if you fast forward, I don't know, 2, 5, 10 years, however long it takes for passkeys to become like truly mainstream, is there any case left for either having a password that I type into a website or the flip side having like the login with Google login with Apple stuff? Like as passkeys get really good, does everything else disappear or do those things kind of have their place too? - [Anna] Yeah, I think passwords are never really gonna fully go away, but I would hope that maybe like 90% of passwords can go away, especially for the types of apps that we as people just like use every day, right? Our banks, our Netflix, our online shopping, like those types of things I think are kind of perfect use cases for passkeys. I think there's a lot of good uses for more like social login, like a login with Google or something like that because maybe they need access to your email, you're sharing other types of information that you get from having that connection. And then, there'll probably always be some apps that just use passwords and maybe it's a password and a passkey as a second factor of authentication or something like that. But I would hope that, you know, for most of the things you're using every day, we could get to a point where passkeys are working for those types of apps. (upbeat music) - [David] All right, we gotta take a break and then we're gonna talk about wearables. We'll be right back. (upbeat music) (playful music) Welcome back. Over the last couple of years, it feels like the wearable industry has boomed. You have the Apple Watch and the Pixel Watch and the Galaxy Watch, all getting pretty popular and pretty good, but it also feels like the wearable industry has kind of died. I don't know, it just feels like a few years ago, there was all this energy to bring tech to our bodies and give us stuff to hold and wear and clip on that would do all kinds of computery things on our bodies in simpler ways. And now they're just smartwatches and they're basically all just health devices and that's just what there is now. So is this just the way it goes from now on? Is this what the wearables industry has become and will be forever? To help me figure it out, I grabbed Vee Song who is The Verge's wearables reviewer and the person wearing the most gadgets at any given time that I have ever met in my entire life. Vee Song, welcome back. - [Vee] Hi. - [David] How many wearables do you have on you right now? - [Vee] Four. - [David] What are they? Are you allowed to talk about all four of them? - [Vee] Yes. - Okay. - I have Withings ScanWatch Light. - Okay. - I have the Apple Watch Ultra 2 the Oura Ring Gen 3 and the Evie Ring. - Okay. - Two smartwatches, two smart rings, - [David] Pure redundancy. (laughs) So many things counting your step and giving you dubious information about your sleep. - Yeah, yeah, it's what we like to call a control device. (laughs) So I actually use the Oura Ring to test all like sleep tracking. - Okay. - Just because they're like, oh, we're a sleep tracker, they're pretty accurate for certain metrics. So I have that and my bed also tracks sleeping. So, there's just a lot of control devices to control for accuracy, there you go. - So do you wake up in the morning and get like six different scores on how you slept? - Yes, I do. - That sounds awful. - It- - One score stresses me out. - [Vee] I get like six different scores and then, while I'm brushing my teeth I compare all of them and I go, \"Huh, you're not accurate,\" or that sort of stuff. (David and Vee laughing) So yeah, so that's the behind the scenes of wearables testing. - That's good stuff. I gave up on sleep tracking like the third day that I woke up feeling like crap and it was like, \"Congratulations on hitting your sleep goal.\" I was like, I don't know if I did or didn't, but screw you. Leave me alone. - To be fair, like a lot of sleep tracking is kind of dubious in terms of accuracy. - Yeah. - It's not, you know, when you usually take a grain of salt, take two with sleep tracking. - Fair. - So that's just how it is. - [David] Yeah, okay, but I wanna talk about like the state of wearables, 'cause I feel like, there's been a bunch of news about wearables in the last few weeks. There was a bunch of stuff at CES, we're in kind of a weird place right now and I have a bunch of theories about this, but let's start with Fossil. - Yes. - 'Cause I feel like Fossil, as a company was trying to do something different and interesting and had a really sort of cool idea about what smartwatches could be. - [Vee] So you know, it's really sad that Fossil is now a fossil, but them, but like, (laughs) I didn't- - Well, that's Vergecast everybody. - [Vee] I didn't make that joke in the actual headline so I had to do it elsewhere because everyone else was making that joke at me. But, so Fossil basically kept Wear OS afloat like almost by itself 'cause Fossil is not just Fossil, it's Diesel, it's Skagen, it's all these other sub-brands. And for the longest time, if you bought a Wear OS watch, it was a Fossil. So they kind of kept Google going through all of that time. And so for them to actually just like call it quits to completely exit the smartwatch industry, that's really big. It's kind of just, wow. It says a lot about where smartwatches are at this point in time in that it's like, you know, there used to be this notion that Apple was, its closed garden and Apple was the main smartwatch of choice for iOS users. But it's sort of happening in the Wear OS space now too for Android because it used to be that, you know, Android was the Wild West of smartwatches, kind of like phones. - Right. - But now it's Google and Samsung also kind of like phones. So that's just kind of where we are. And Fossil leaving, it kind of cements that. And I'm actually pretty sad about it. - [David] I am too 'cause it seems like, and I'm realizing now how long ago this was, but if you go back to like 2017, maybe, 2016, '17, there was this idea that all watches, or at least many watches of many different styles, many different price points, whatever, were going to become some kind of smart, right? - Yeah. - There was gonna be this whole interesting spectrum where I remember I went to, I think it's called BASELWORLD, this like very fancy watch show in Switzerland- - Yes, yes, BASELWORLD, yeah. - [David] And it was like, the year everybody was into smartwatches. So I was at Wired at the time and I'm sitting down with all these people as they're explaining like the beautiful history behind this $12,000 watch. And then they'd be like, and also Bluetooth wired. I was like, all right, cool. But I liked that idea and it was like Withings was doing cool stuff with that, this kind of like hybrid smartwatch idea where it looked like a watch, it looked like a piece of jewelry, but also still had some tech in it. And it feels like everything on that spectrum that isn't an Apple Watch or something that looks like an Apple Watch is just gone. Like we've just given up on that idea almost entirely. - [Vee] It is really weird because for right now, in the last couple of years actually, smartwatches have just like slowly consumed everything. Like where has the budget fitness tracker gone? China, that's it. - Right. - [Vee] Like that's where most of them are at the moment. And it used to be that Fitbit had its own, Fitbit was the word that everyone used, even though it was a brand, they used it to mean fitness tracker. - It was Kleenex. Like in a really real way, it was Kleenex. - Yes. - That's what Fitbit was. - Yeah. - [Vee] And now where's Fitbit? James Park has left. - Right. - Very suddenly during CES. I like woke up and I was like, \"Are you kidding me? I'm at CES, please. Are you kidding me right now?\" But yeah, so that's kind of where Fitbit is and it is really just the Apple Watch, the Galaxy Watch, or the Pixel Watch at this moment in time. And that's really sad. But to your point, Fossil really embodied that idea of we're gonna have so many different smartwatches and so many different form factors and so many different like styles. There was the Kate Spade watch, there was the, they bought Misfit for a while. It used to be- - Oh, Misfit. - Right, right? - They had so many cool ideas. - [Vee] They did. And like the touch bezel that Samsung basically managed to actually execute and all of that stuff. But there used to be a joke I would tell my editors and it's like, it's a trade show. I'm gonna go to Fossil but, and I did this at Gizmodo a few times where I was like, I'm not gonna cover every single watch that they release because there's gonna be 20 of them. I'm just going to take a picture and say, \"Look at all the freaking smartwatches that Fossil has brought.\" And they would come to each trade show with I wanna say like 20 to 30 different watches. And I'd be in a room and I'd be like, okay, what's new about this watch? This watch is that watch but Armani. - Right. - Or this watch is that watch but Diesel. And you know, that kind of gets to the problem of the Fossil watches as well- - Well, yeah. - So- - Diagnose that for me, 'cause I think you could make the case that that is actually like an awesome outcome, right? Like nobody's mad that there are lots of different brands of T-shirt that are all T-shirts. Like that's how it should work, it's fashion. It lets you make choices and we were in this moment where technology was just gonna be sort of integrated into that. And I liked the idea of having a watch that seemed like a watch, but would also buzz when I got a phone call and count my steps. Like that to me was almost like everything I wanted from a smartwatch and that has died. And what I can't tell is which of the many things that went wrong are the real problem. Like I think there's a thing where Google neglected Wear OS for a really long time and sort of hung Fossil and a bunch of other companies out to dry. There's a thing where maybe people just didn't want those things and maybe I'm wrong, and the people who wanted any kind of technology on their wrist wanted all the technology on their wrist. So the Apple Watch and the Pixel Watch became the thing, I don't know, what's your read of like why that all fell apart? - [Vee] It's a lot of those things in small increments. - Okay. - So it is like a fact that Fossil invested so much into the Google system and then, you know, a couple years back, Google took about $40 million worth of Fossil R&D and brought it over into Google. - Right? - [Vee] So that was kind of one of the first big signals that Google was gonna start taking wearable seriously again. But you know, it kind of gutted Fossil a little bit. And then another problem with Fossil is that the price for the price that you were getting their watches, you got a software that was kind of not so great. - Yeah. - Is what, it was very like jittery, things would work and then they wouldn't, and more often they wouldn't, the battery life was eh, so you were just getting a better experience on other smartwatches but paying a similar price. So what you really were paying for was the style and the fashion and the fact that it didn't look, you know, like this giant slab of phone on your wrist, right? You were paying for a watch that looked like a watch. And then I think another aspect of it is that the people who are gonna go for something like Withings and the hybrids is that they are people who are not going to be buying on an upgrade cycle very frequently. - True. - These things- - [David] You don't buy a nice watch intending to replace it in two years. - Exactly. - Yeah. - [Vee] And the battery lasts a long time. Like this has been lasting me for I wanna say two weeks. - Yeah, that's awesome. - Like I haven't charged it. - That's I want. - 'Cause I needed it up. And that is what a lot of people want, but those people aren't the ones going out buying and upgrading every single year. - Right. - So that's not making the company a lot of money. So it's one of those paradoxes where planned obsolescence is a shittier product but it makes, but it makes the company a lot more money. - Yeah. - So that's kind of the conflict that you have there. And I just think the other issue with Wear OS 3 and that transition is that Google clearly puts Samsung first 'cause everything comes to a Samsung Watch first. - Right. - And then, it'll come to Google and then everybody who isn't Samsung or Google, kind of gets the short end of the stick. Mobvoi was the other really well-known Wear OS watch alternative and they didn't get Wear OS 3 upgrade until, I wanna say December. - Oh wow. - This, like this past December. - Yes. - [Vee] It was a thing where Mobvoi users were like, \"Hey, you told us that if we were gonna buy this particular TicWatch with the 4100 chip, we were going to get Wear OS 3.\" And basically, they waited until December, that's when the rollout happened and Wear OS 4 is already here. - Right. - So now they're just like a generation behind, they're barely catching up and they don't even have Google Assistant on their wrist. - Oof. - And Fossil did have Google Assistant, but they also had to wait a really long time to get that roll out. So I can understand where from Fossil's perspective, they were just like, \"Okay, we didn't even know Wear OS 3 was happening until you announced it.\" - Right. - What the hell. - Yeah. - So you know, I had a sense something was, something was not kosher because Fossil had a very, very regular update cadence and they missed it. Like 2023 was when the Gen 7, if it was gonna come out, was gonna come out nothing. I reached- - And they really were the one company you could rely on to keep caring about this for a long time. - Every single year. So CES is up and down with wearables, but every single year it would be, I would reach out to Fossil and be like, \"Hey guys, what you got going?\" And they're like, \"Hey, here's what we got going.\" And this year I reached out and they're like, \"We're not gonna be at CES.\" And I was like, \"Excuse me, hold up.\" (David laughs) The who he what, like, so many just alarm bells were going off. And I think I reached out to them end of November, early December and we were talking for a while and it wasn't until after CES even that they got back to me and they're like, \"Hey, we out,\" so. (laughs) - Yeah. - Yeah. - [David] So that makes me sad, I have to say. And the other part that makes me sad is I think we like, skipped past the fitness band thing way too quickly. This is a thing you and I have talked about before and I still believe this very strongly, that like the original Jawbone UP was a perfect gadget and there should be more of them. And I don't want a watch, but I want something on my wrist that tracks basic things. What it seems to be is that instead of bands, rings are gonna be that thing. Like it seems like the big bet now is that if we're gonna do a non-screen, long lasting, simple kind of wearable, everybody seems to think rings are the thing. - [Vee] I mean, rings are big this year at CES there were more rings than I could count. I would be like, \"Do, do, do I've seen all the rings\" and then I'd turn and I'd be like, \"Nope, there's more rings\" and like from names that I had never heard of before. So I was like, oh- - Is this just because Oura worked, like Oura's been in this for a few years, the product seems to do really well. I feel like, the viral marketing for Oura is very good, 'cause you, you watch a podcast or you see somebody on TV and it's like a tech CEO in a vest and there's like a one in two chance they have an Oura Ring on. - [Vee] And it's not just the tech people, it's the celebrities. - Yeah, that's true. - Jennifer Aniston has an Oura Ring, a bunch of sports stars have it. There was a period of time where I think Kim Kardashian and Gwyneth Paltrow maybe. - Okay. - Were having a sleep competition with their Ouras and these people have millions of followers on Instagram. And they were just like, \"Haha, beat you in my Instagram stories.\" So Oura really had this, like Prince Harry has an Oura Ring. So they had a lot of buzz in that respect, but they weren't the only smart ring around. They just kind of RIP, Motiv. That was a smart ring. - Right, yeah. - [Vee] Had two, there was the Motiv and the Motive Ring 2 and they just kind of like killed them, so to speak. And it was actually really quiet in the smart ring space for several years. And that's because smart rings compared to fitness bands have a lot of technological challenges because they're so small. - Right. - They're just so entirely small. But I think we're starting to figure that out. And then there are some health advantages to a smart ring compared to a fitness band that really make them good for sleep tracking and sleep tracking- - And part of that is just like literally where it's placed on your body, right? - Yeah, so, actually, your wrist is terrible for most metrics. - [David] I know I just learned this recently that they're like, oh, let's put all this stuff on your wrist even though your wrist is the worst, worst- - Yeah. So like the way these sensors work is that they're shining light into your skin and it's reflecting off of your blood. And so that's how they read your heart rate. It's a proxy for your pulse, yada, yada, yada. I've written about it a ton, just read my stuff. (laughs) But the problem is, is that you have so many tendons, there's so much movement in your wrist that there's so much signal to noise that it's very difficult to get an accurate read. Which is why if you have a wrist-based wearable and you're like, hmm, this sounds wrong, that plays into it, but the underside of your finger is a lot more ideal. There's a lot less noise. The skin on your palm no matter what, no matter how much melanin you have, the skin on your palm is a lot lighter. - True. - So it kind of removes your skin color a little bit as a barrier to accuracy. So there's just a lot of reasons. It's a lot more comfortable to wear. You wear rings anyway. And when you're going to bed, you're not, I have had a lot of watches that are gigantic from Carmen but, (David and Vee laughing) you know, in the middle of the night, I'll wake up and I'll rip it off 'cause it's uncomfortable. - Sure. - So sleep tracking has gotten a lot of popularity in the last few years. This is the ideal form factor for it. So that's kind of why. - [David] I agree with that. I will say the thing that I've had trouble with rings and the Oura in particular is one that I would say like every three months I'm like, I'm gonna become an Oura person again. And I pull the one out of my drawer, I charge it, I put it on, I like it for the step tracking. I like it because the battery doesn't die all the time. I'm like forever being driven crazy 'cause my Apple Watch battery seems to always be dying no matter what is happening, it's always dying. And the Oura Ring is like a sort of light tracker in a way that I really like. I cannot type with that thing on comfortably. - Really? - And part of that is probably just that I'm not used to it yet. In the same way that like when I started wearing a wedding ring, it took me a while to get used to it. Now I don't even notice it on my finger, but like it's a pretty chunky thing. - I mean- - And it bangs around on the palm rest of my computer. Like I grant that I'm not used to wearing chunky rings and lots of people are used to wearing chunky rings. But it was harder for me to get used to having on my body than I expected it to be actually. - [Vee] Well yeah, like if you're in fashion, you definitely have a statement ring, right? This is not statement ring size. - Totally. - [Vee] But it is chunky. Like I have several rings on my finger right now and like the normal not smart rings are much thinner. - [David] Right. - [Vee] It actually kind of looks funny when you, 'cause it was like guess what the smart ring is? - [David] I mean, it's like you're wearing four rings and two of them look like brass knuckles. - Yeah, that's basically- - That one's look like rings. - [Vee] That's basically what it is. And a lot of that is the tech. - Yeah. - There's just like what, it's a miracle that they can make it this small, it's actually a miracle that this particular version of the Oura Ring is completely round. That was a huge engineering challenge- - Right, it had a little flat tire for a long time, right? - [Vee] Yeah, the flat tire is where they put the battery because when you have a flexible battery it's very difficult to make it round. So there's just all these like technical challenges that come with smart rings that make them big, 'cause I'm like this is pretty good if you think about what a smart ring is and I always get our readers and some people in my DMs just like, \"I'm not getting it until it's as thin as a regular ring.\" It's like, \"Okay, you'll be waiting for a while.\" - Yeah, see you in 2050- - Like you'll be waiting for a very long time. - Yeah. So, but then in that case, I understand why these things would exist, right? Like the size of Oura's market makes sense to me. There are people who want the things that it offers. What I can't figure out is why somebody like Samsung would make this, because especially the thing we've learned over the last bunch of years is that like, A, you're right, ecosystem is important, but B, the market even for a smartwatch is significantly smaller than the market for a smartphone at least right now. And then to take away all the computer stuff, even on a smartwatch and say, okay, this thing is just basically a lightweight tracker. It just feels like that, that just seems like a thing that cannot possibly apply to as many people as a company like Samsung is trying to reach. But maybe I'm underestimating how many people want that thing. - [Vee] So what I will say, and I think a lot of our readers who have Oura Rings will kind of back me up is that it's not a good primary tracker, it's a very good secondary tracker. - Okay. - But having a very good secondary tracker necessitates that you have a primary tracker, which is- - Right, you've already like we're way down the funnel of people who care about this stuff at that point. - Yeah. But it is a thing where it's like if I care about sleep tracking, which an increasing number of people do, and especially if you're an athlete and you care about recovery tracking. - Fair, yeah. - Like this is a very small subsect of people, but it is a very passionate subsect of people. - Right. - [Vee] Then a ring that is something that you can have on all the time is not like, held to the same battery constraints as a smartwatch. Then it kind of becomes like a nice secondary and like I know I'm crazy because I have four wearables on right now. - [David] No, I think you're the average user. - [Vee] Yeah, yeah, yeah, I'm totally the average user. But basically, you know, I will say that, I definitely am like, oh yeah, if I have an Oura Ring and an Apple Watch, that is the perfect health tracking kind of combo. But you have to care about health tracking, which I think the thing that makes wearables the, like this subset of wearables the hardest is that fitness and health is a very, very hard habit to develop. Like- - Well, and this is kind of where I've landed with smartwatches, right? I think it's definitely true that the most useful thing the Apple Watch does for the most people is the health and fitness stuff. I totally buy that. I still think that's only one slice of the pie of like reasons to buy an Apple Watch. And there are lots of them, right, and I think Apple used to think the like, get notifications on your wrist slice was the biggest, it's not, the health and fitness one is clearly the biggest, but it's still, I mean, I'm making up the numbers, but like that's 40% of the thing, that leaves 50 other things that comprise the other 60%. And as we get to these other things, we're just pulling all of that away. And so what I keep trying to figure out is like, is Samsung gonna try and figure out how to put like a microphone and speaker into the Galaxy Ring too so that I can talk to my assistant through it? Or are we just gonna get to the point where this stuff matters enough to enough people that it's a real business? - [Vee] I think it's gonna be probably the latter just because you know, my grandpa, my family's full of doctors and my grandpa was like Mr. Doctor in our family, he was the most esteemed one and he would always tell us that your health is the most valuable thing you have. - Sure. - If you don't have health your life kind of is, it's not what it could be. It's one of those things that I think the longer that we live, the more technology advances, the more that we know about our health, like I think that's going to kind of impress upon people that I wanna live longer, I wanna see my kids, I wanna be able to, you know, do things with them that's gonna become more important to people. And the thing that really stymie is that health is not built in spurts. It's not in New Year's resolutions, it's in tiny things that you do every day. And that's very, very, very difficult for most people to make that behavioral change. - For sure. - It's the number one thing that I think stands in the way of wearable adoption and battery life, (laughs) those two things. So you know, it's just, I really do think the health aspect is big there, but I don't think that Samsung would be smart to put microphones into the Galaxy Ring. I really don't. I think the smartest thing it could do is to bundle it with the Galaxy Watch so that you're not buying it separately, you're buying it for a discounted price. - Interesting. - And then you have the whole picture of the Samsung Health experience and then you're just in their ecosystem. I really think it's an ecosystem play where you get an accessory for your accessory to your phone and I think if they're smart, they'll do it that way where you're just like, \"Oh, are you gonna upgrade to the Samsung Galaxy 7? Free Galaxy Ring for you.\" - Right. - [Vee] And then you know, you do that at first and then people get on different upgrade cycles and then they buy in and that's my insidious capitalism plan for better fix on something- - It tracks, no, it does kind of make sense. And it also gets you to the point where now you're literally wearing something from that company 24 hours a day - [Vee] And I think it should be really scary for Oura. Oura, unprompted sent me a statement when the Galaxy Ring was unveiled- - Oh, that's never a good sign- - And they we're like, They we're like- - Did it say we're not scared? - Yes. - Everything's fine? - [Vee] And they said, \"We're not scared, we have hundreds of patents. We are the leader, this is validation in the space.\" And I'm like, \"Yes, but also you should be scared because you charge a $6 monthly subscription on top of a $300 ring.\" Samsung can go, \"Oh, we don't need a subscription for you.\" - [David] Right, yeah, here have some rings. - We don't need it. - Have some rings. - Here you go. - [Vee] Have it with our watch that also doesn't come with rings. We have also spent two years beefing up our sleep tracking like features. So, hmm, yeah. - Yeah. - [Vee] So I think Oura's, I don't think they have to worry now, but they should be a little concerned is what what I think, yeah. - Yeah, that seems right. It has a lot of the vibes of like when Slack took out that full page ad when Microsoft Teams came out being like, \"Everything's fine, we think our product is terrific,\" and that went super great for Slack. Last thing then we gotta go. Should I just give up on my idea and dream of the like wearable computer as a thing? Like ever since the beginning of the Apple Watch, I have loved the thesis of the Apple Watch originally, which was basically, like we want to build a new, simpler, lower touch, more personal device for you to use instead of pulling out your phone all the time. And I think like if I were to get real Galaxy brand about all of this, right? It's like you come back to all this AI stuff that's happening and the stuff we're doing with voice and with transcription and you can get to the point where like, okay, maybe actually talking to my wrist is going to quickly become a thing I can do and it will be good. And at the same time all of these products are running away from that stuff and toward health and fitness. And so one of two things is either gonna happen, it's either gonna come back around or it's just, these are just going to be health and fitness devices and we're either gonna have to invent something new or the phone is gonna continue to be the computer. Which one do you think it is? - [Vee] I think in the short-term, the latter, but in the long-term the former. - [David] So you think we might come back around eventually? - I think we are gonna come back around and you can see it with AR glasses. They are real, I just don't necessarily think it's gonna be your wrist. I think it's gonna be your eyes. That's, yeah, - So like it's just, - Yeah, Ray-Ban Meta glasses are like- - That is pretty wild. - [David] You put them on and it's like, oh, I kind of get it now. - Yeah. Yeah. Like I get it. - Yeah. - [Vee] Once they figure out how to do actual AR and not mixed reality, that's gonna be, it's gonna be a lot. But the thing is, is like when you wear something on your body, that's health. - Right. - [Vee] That requires the FDA to get involved. Like we've been talking about smart contacts for a long time, there's various prototypes in that. But when you are shining light into your eye that way that's a, hmm, are you gonna burn your retinas off? - It's the whole thing. Yeah. - We don't know, right? We don't know, that's why, that's my theory is that why in the last versions of iOS and Watch OS, they included vision health for children. Because children's vision health, if you mess up your health as a child, you can't really get into a Vision Pro can you? - [David] Man, speaking of ruthless capitalism, like we're gonna save children's eyesight so they can use our headset. (laughs) - [Vee] I, but actually I really do think that's it. - You're probably right. - Yeah. - I really do think that's part of the thing because you know, smart glasses leave out a lot of people who don't have like, you know, normal vision, including myself with my terrible astigmatism. But I really do think that we're gonna go all way around. It's just that we're in the very baby ages of wearables. It might feel like we've gone really advanced, but we are super early on it. The tech is not there yet. It's not miniature enough yet, as we saw with the Vision Pro, it's here to sell you on a future. And that's what smartwatches are here. The RayBan Meta glasses, that's what they're here, like the Oura Ring. These are all selling you on a future that hasn't arrived yet 'cause technologically, it's not possible yet. And like, are we going to get non-invasive blood glucose monitoring? Someday, but they've been working on it since 1975. - Right. - Like I should you not. They've been working on it since 1975. It's gonna take a long time. There's a lot of advances that have happened in the background and I talk to all these vendors and it's really cool what they're doing. They gotta deal with the FDA clearance process and that will take anywhere between two to four years depending on how much money and testing capabilities they have and the mountain of paperwork that they wanna do. They have to do it in a medical facility, they have to have the security protocols in place. It's a lot of work. So yeah, now wellness, future health, that's kind of the trade off that they're making. - [David] Okay, and then long future, David gets his wrist computer. - [Vee] Long future, David gets his face computer, his wrist computer, his finger computer, every, all the computer, you will be a computer. - [David] This is all I've ever wanted, thank you. (Vee laughing) All right, we gotta go. Vee, thank you as always. - All right. (upbeat music) - [David] All right, we gotta take one more break and then we're gonna get to The Vergecast Hotline. We'll be right back. (upbeat music) (playful music) All right, we're back. Let's get to the hotline. As always, the number is 866-VERGE11, and the email is vergecast@theverge.com. We love all your questions. We try to answer at least one on the show every week. Please keep calling, keep emailing. I love hearing from you. This week we have a question about the Vision Pro. If you're tired of hearing about the Vision Pro and Apple and headsets and the whole thing, I'm really sorry, but it's what everyone keeps asking about. This question comes from John, (computer beeps) - [John] Hello, Vergecast Team. I'm John in West Lafayette, Indiana, Apple priced the first Vision Pro at $3,500 for getting Apple's high profit margins for the moment, what would the price need to be for your review to say, \"We don't yet know how much consumers will use this, but the price is attractive.\" $1,500, $2,000? Optional follow-up question. Today, Apple sells iPad models from 329 to 1,099. In two or three years, what will be the right price range for two or three Apple Vision models? Thanks everyone, love the show. - [David] Okay, I picked this question not because I have a crystal clear answer, but largely because I really wanna know what you all think. As you've heard on this show, I have spent a lot of time yelling about how expensive the Vision Pro is. I think the phrase all caps $3,500 is like going to be written at the top of my obituary at this point. But I think this is a really interesting and complicated question and I, before I give my answer, I do wanna know what you think. So call 866-VERGE11, vergecast@theverge.com. Tell me what price feels like the tipping point where this goes from sort of neat thing that exists, but doesn't make sense for most people to thing you would consider buying for real and telling other people to buy. And if you already bought a Vision Pro, I'm curious how much more you would pay. So think about that in both directions and let me know. I have two answers. I think the consumer price to make regular people buy this thing in huge numbers is $999. I think we're a long way away from that, but I think when you can get $1,000 version of this, that is basically a very good iPad, it's a good entertainment device, it's a thing you don't have to use all the time to feel like you've got your money's worth. That's a nice price for that. It's right in that high-end iPad range. It's what you'd pay for a really good computer monitor. It's about the price of a MacBook Air. It just feels like that is kind of the top line, buy this device, it'll be cool and fun, you'll love it. In my dreams, we're more in like the 599, 699, kind of game console price, but I think Apple is Apple and at 999, this thing would do just as well. But also at 1,999, $1,999. I think the Vision Pro as it exists now becomes an order of magnitude more compelling. At that point, you're in nice MacBook Pro range and it's very much still a pro device for pro people who want to use it for pro things, but even still it becomes hugely more palatable. I mean, think of all the people who spent $1,600 on a Studio Display or are happy to upgrade their own PC for $1,000 just to get a little more performance and a little more memory and all that kind of stuff. Those are the sorts of people who I think a $2,000 price tag feels right. This is a great television, like you could honestly at $2,000 say this is the best TV, it's cool to wear, you'll love it, but it's a television and it'll still be compelling to a lot of people at $2,000. $3,500, you're just out of that range, at least for me. And I would guess that long term, based on what I've seen so far and the way people are talking about it and the way even Apple talks about the Vision Pro, I think this thing will end up covering that gamut. I think this lands kind of in MacBook Range where you can spend $1,000 for the cheapest one and I think the cheapest one ends up basically just being a screen with apps. It's an iPad on your face in a very real way. And I think for $1,000 that's gonna be compelling to a lot of people. Over and over, the thing that I'm hearing is that people like this most as an entertainment device, it's a way to sit on the couch or lie in bed and watch something. That's what people buy an iPad for. And I think you can get to a point where if you're Apple and you can sell basically an iPad, but it's cooler to use, you don't have to hold it in your hands, which is actually valuable for a lot of things, and it has all this kind of gaming and productivity upside, I think you can sell the base thing for $1,000 and then for more stuff, more power, more productivity tools, more ability to like do cool stuff, I don't know what they would add into these other things other than just better specs, that's how you get up to two grand. So that's my theory is that this thing wants to land basically on the whole spectrum between one and $2,000 and when it gets there, that becomes pretty powerful. I think it's gonna take a while to get there. I don't think Apple is charging $3,500 for this because it is like a massively greedy company. I think this is a very, very, very, very expensive thing to make and it's gonna take a long time before they can sell it to you for one or even $2,000. But when they do, I will stop yelling about how expensive it is and I'm very much looking forward to that day. But again, tell me what you think. Email us vergecast@theverge.com, call the hotline, 866-VERGE11. I wanna know how you feel about the Vision Pro price. Would you have paid more than you did? Are you waiting for it to be a certain price? Are you like, \"David, you're insane. I'm only buying this thing if it's 99 bucks.\" Tell me everything. I'm desperately wanna know, hit us up. All right, that is it for \"The Vergecast\" today. Thank you to everybody who was on the show and as always, thank you so much for listening. There's lots more from our conversation at theverge.com. We have now posts on the site with all of our show notes for every episode, so if you wanna know more about everything that we did, go check it out. Also, like I mentioned at the top, we are now on The Verge's YouTube channel with all of our full episodes. So go, like, subscribe, smash all the buttons, say mean things about us in the comments. Hit us up, we love hearing from you. This show is produced by Andrew Marino, Liam James, and Will Poor. \"The Vergecast\" is The Verge Production and part of the Vox Media Podcast Network. Nilay, Alex and I will be back on Friday to talk about all of the Super Bowl streaming mishaps, more headsets, trillion dollar AI ideas and lots more. We'll see you then. Rock and roll. (playful music)",
    "transcript_keywords": [
        "Apple Watch",
        "thing",
        "kind",
        "people",
        "Yeah",
        "Watch",
        "things",
        "Oura Ring",
        "Apple",
        "passkeys",
        "password",
        "lot",
        "ring",
        "passwords",
        "Fossil",
        "time",
        "rings",
        "passkey",
        "make",
        "Vision Pro"
    ],
    "transcript_entity_values": [
        "John] Hello",
        "iCloud",
        "the FIDO Alliance",
        "Android",
        "Withings ScanWatch Light",
        "West Lafayette",
        "Kate Spade",
        "Prince Harry",
        "BASELWORLD",
        "Andrew Marino",
        "Vox Media Podcast Network",
        "three",
        "millions",
        "699",
        "the last few years",
        "Tuesdays",
        "Indiana",
        "Oura",
        "2",
        "the Vision Pro",
        "a few years",
        "300",
        "anywhere between two to four years",
        "1,999",
        "20 to 30",
        "20",
        "the third day",
        "3,500",
        "Oura Ring",
        "1,600",
        "Kim Kardashian",
        "Fossil",
        "Fitbit",
        "2,000",
        "December",
        "2023",
        "MacBook Pro",
        "Two",
        "One",
        "early December",
        "1,000",
        "50",
        "Alex",
        "Fridays",
        "Samsung Health",
        "TikTok",
        "12,000",
        "This week",
        "YouTube",
        "Android",
        "Microsoft",
        "the Wall Street Journal",
        "20, 25 years",
        "PayPal",
        "Oura",
        "Wear OS 3",
        "David Pierce",
        "24 hours",
        "99 bucks",
        "the Vision Pro and Apple",
        "hundreds",
        "third",
        "the Gen 7",
        "WebAuthn",
        "about 10 years",
        "the Pixel Watch",
        "the Wild West",
        "two weeks",
        "60%",
        "a number of years",
        "Slack",
        "The Verge Production",
        "trillion dollar",
        "Verge",
        "overnight",
        "John",
        "Google",
        "Anna",
        "2017",
        "Oura Rings",
        "999",
        "YouTube Music",
        "iPad",
        "Vee Song",
        "Wear OS",
        "the last few days",
        "every week",
        "the Galaxy Watch",
        "James Park",
        "Samsung",
        "MacBook Air",
        "iCloud",
        "Carmen",
        "Galaxy",
        "Motiv",
        "40%",
        "Vee",
        "the Super Bowl",
        "the Galaxy Ring",
        "iOS",
        "MacBook",
        "this year",
        "YubiKey",
        "China",
        "WhatsApp",
        "this past December",
        "1Password",
        "Netflix",
        "10 years",
        "Four",
        "a couple years back",
        "first",
        "Liam James",
        "Friday",
        "Instagram",
        "Home Depot",
        "a ton",
        "Slack",
        "The Verge's",
        "Today",
        "only one",
        "Fossil R&D",
        "between one and $2,000",
        "two or three years",
        "1,999",
        "Facebook.com",
        "AI",
        "Oura",
        "Armani",
        "a couple years ago",
        "Passwordless",
        "the year 2024",
        "'17",
        "1,099",
        "the last couple years",
        "Gizmodo",
        "6",
        "SSO",
        "Vision Pro",
        "2016",
        "Wear OS 4",
        "Tuesday",
        "Passwordless Tech",
        "every single year",
        "MacBook Range",
        "the last few weeks",
        "Facebook",
        "The Vergecast",
        "Fitbit",
        "The Verge's",
        "second",
        "the Apple Watch",
        "Bluetooth",
        "Samsung Watch",
        "FDA",
        "Wear OS 3",
        "the other week",
        "smartwatches",
        "New Year's",
        "866-VERGE11",
        "329",
        "the year",
        "Jennifer Aniston",
        "the Pixel Watch",
        "1,500",
        "First",
        "Mobvoi",
        "CES",
        "Withings",
        "Skagen",
        "one",
        "one morning",
        "Apple",
        "Kleenex",
        "four",
        "999",
        "today",
        "Anna Pobletts",
        "5",
        "Wear",
        "about $40 million",
        "six",
        "599",
        "SMS",
        "Diesel",
        "a few years ago",
        "two years",
        "several years",
        "the Galaxy Ring",
        "two or",
        "between a decade ago",
        "zeros",
        "the Oura Ring",
        "an Apple Watch",
        "monthly",
        "the last bunch of years",
        "at least one",
        "the last couple of years",
        "the Vision Pro",
        "4100",
        "two",
        "Oura",
        "Watch OS",
        "Apple Vision",
        "Amazon",
        "David",
        "Windows Hello",
        "Apple Watch",
        "David] Anna",
        "the Galaxy Watch",
        "iOS and",
        "David] Man",
        "Gwyneth Paltrow",
        "Authy",
        "iPhone",
        "TicWatch",
        "1975",
        "two years ago",
        "Ouras",
        "the Motive Ring 2"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "LOC",
        "ORG",
        "PERSON",
        "TIME",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "FAC",
        "ORG",
        "DATE",
        "FAC",
        "LOC",
        "DATE",
        "PERCENT",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "PERCENT",
        "PERSON",
        "EVENT",
        "FAC",
        "ORG",
        "FAC",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "GPE",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "LOC",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "EVENT",
        "DATE",
        "ORG",
        "EVENT",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "MONEY",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "LOC",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "FAC",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG"
    ]
}