{
    "id": "SHW7qTBPPyA",
    "title": "iMac G4 Exploration Sensation - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2019-02-07T21:00:10Z",
    "video_url": "https://www.youtube.com/watch?v=SHW7qTBPPyA",
    "category": "Science & Technology",
    "tags": [
        "iMac G4 Exploration Sensation - Krazy Ken's Tech Misadventures",
        "iMac G4",
        "iMac",
        "Apple",
        "Mac",
        "Mac OS X",
        "Mac OS 9",
        "Mac OS X Jaguar",
        "iLife",
        "iPhoto",
        "iMovie",
        "iDVD",
        "Old Mac",
        "Old Apple Computer",
        "Old Software",
        "Vintage",
        "Demo",
        "Tech",
        "Computer",
        "Macintosh",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Comedy",
        "Humor",
        "Funny"
    ],
    "views": 204709,
    "likes": 3602,
    "comments_count": 658,
    "description": "Someone gave Krazy Ken an iMac G4, and it is the SLOWEST COMPUTER he's ever used. Watch him explore the Mac, the accessories, the software, and everything else at the speed of molasses.  Support the show and get in the credits   Want more videos like this?   Subscribe for more tech videos!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures #88 - iMac G4 Exploration Sensation  Krazy Ken is now on Patreon! Pledge now to help support the show and get an opportunity to be in the show's credits!   Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?   Amazon links are powered by the Amazon Associates Program.  #KrazyKen",
    "description_links": [
        "http://patreon.com/krazyken",
        "http://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://patreon.com/krazyken",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- [Krazy Ken] Fine you don't want to balance. I don't care anymore. Oh my gosh, look at this. Most of this episode is just gonna be, watching the beach ball spin. Holy shit. Op. Almost fell off my chair. Right, so here's the situation. I want you to see this. So I guess I just know enough people, where they will just give me computers. (chuckles jovially) So I just met a friend. Yeah Krazy Ken has friends. In a parking lot. And they just, they just, were givin' away this iMac G4. (sonar beeping) (keyboard clicking) (upbeat music) Hey guys, how you all doin. Really? That's just great you know I'm doin' pretty great today too. Because as you saw earlier, someone just gave me this iMac G4 out of the blue. Which was super generous. Oh pardon the whispers. The guards are asleep right now, so I thought I would take this time, to do a personal project. Let's listen. Yeah I think they're down. Okay, we're good. We're good guys. Okay, so. I have no idea what's on this iMac G4. I never booted it up. We're gonna explore together. And there's a bunch of software, and manuals and accessories that the owner gave me. With this computer. I haven't looked at any of it yet. I wanted to save it for, well, our bonding time. So, let's have a look at what we have. Item number one from the hall, is obviously the iMac itself. And judging by the Garamond typeface, this is an older iMac G4. Probably from 2001. We'll take a look at the specs in a bit. Peripheral wise we have been blessed, with a beautiful Apple mouse, which used to be called a Mm Mouse, but I can't say it because trademark disputes. So that's lovely. The world just runs on greedy money. This part I was excited about. This iMac came with Pro Speakers. That was actually one of the main reasons, I took this off the original owners hands, because they were giving me, just free Pro Speakers with the iMac, so. That's pretty cool. I have the USB version of these, that I use with my G4 Cube. But I have not had the actual Pro Speakers. Until today. We also have, this is probably the most disgusting part, (laughs jovially) this, this keyboard. Look at how F(beep) yellow it is. Like what environment was this thing in? Space bar totally destroyed. It's, it's yellow. What I think is interesting is, there's like a sticker here that says, hold the eject key to open disk drive. Was that like an official sticker, that came on the packaging and they just never took it off? I don't know. But that is just, that's just gross. (chuckles softly) Oh! (laughs jovially) Like look at, the back is beautiful and white. Yeah, we're gonna probably not use that. Oh gosh, it feels like, ick. Alright moving right along. They also gave me this just bag, of accoutrements. So let's go through it. Looks like we have some kind of modem cable. I can't say I've seen one of these, with this computer before. But yeah it looks like a, something for the modem port. We have an Apple jewel case sort of thing. The old Chrome Logo, and again more Garamond, iMac Media. This one says copyright 2002, so that might be when this computer, this particular computer came out. So we have the Apple Hardware Test, Software restore disk one through five. That's that. Well good, just in case we need to nuke this hard drive. Bon appetite. I'm gonna actually. I'm gonna put you right there 'cause you look pretty. Yeah like, you don't wanna, fine you don't wanna balance. I don't care anymore. Okay this is interesting. An Apple DVD-R 4.7 Gigabyte Media. Certified for use with Apple DVD-R Drives. This was probably back when DVD's were like $5 a piece, and Apple was pushing the digital lifestyle, so they probably sold blank DVD's you could use, to burn with your iLife Applications. I've not seen one of these in person before, that's very different. There's nothing written on it. So let's actually. Let's look at the back. It doesn't look like there's anything burned on this, whoa! Disk, so. Yeah that might be a blank disk. I do like that design though. That's pretty cool, I've never seen that before. Alright, well we'll save that. Oh there's more. The haul is huge. Mac OS X install disk. Let's see this is version, 10.2 this is Jaguar! I have not used Jaguar in forever. I don't think I even have a disk of Jaguar, until, well, now. Mac OS X install disk two, so. If we ever need to do a re-installation sensation. We have our lovely software restore disks. Now this is the AppleCare Protection Plan. And this is when you used to get TechTool Deluxe with it. I don't think they do that anymore. But I remember that back in the day. (plastic bag rustling) What else do they got. They have a Verbatim CD. This was probably something, that the owner burned data to at one time. I'm looking at the back of this disk, it does not look like, anything is actually burned on there. So good we got a free CD. The whole thing is worth it! The iMac user guide. Oh with colored pictures. Apple always does like to go all out. Oh yes, the old Aqua user interface. I'm sure we'll have a lot of fun exploring that. So, yeah I'm guessing Jaguar is on here. Pretty sweet. We'll just ah. You'll sit there. (bag rustles) Greeting Card Factory for Macintosh. That dog is pretty cute. Yeah I don't know what this is at all. User guide. I don't know if, I don't know if this was like, a piece of software Apple included back in the day, or if this was something the owner just happened to have. But okay. There's more, oh there's more. Here's the AppleCare and Support literature I suppose. Wow they kept everything. This is awesome. Oh there's some handwriting on the back. Maybe it was serviced at one time. Wait, what? Floppy Drive. For more information on your SmartDisk USB Floppy Drive, consult the user guide on the included CD. What! That's not something Apple sold right, they didn't, or maybe they did actually sell SandDisk ones. I don't know, in case you needed a floppy drive. Yeah, AppleCare, alright. Software license agreement from macOS X, single use license. You wanna read this? Let's have a read. This looks like it was just printed, and stapled together. Oh. This, I, I, I. Aye, aye, aye, aye. Oh there's handwriting on here. Yeah, they must have printed out some manuals from online. Oh my gosh. Oh look at this. Yeah this was printed right from Apple's website, you can tell how dated that is, because of the Garamond Serif Typeface, and the old Aqua tabs on the website. .mac doesn't even exist anymore. Yeah they just printed this right from the website, this is like a little time capsule. This is pretty cool. Okay well. I mean if the literature and the printed stuff is this cool, just wait till we boot up the computer. I wonder what's on this hard disk. Click'N Design. (chuckles softly) 3D! Oh create and print amazing CD labels on your desktop. Okay, yeah. Oh my gosh, look at that. iPhoto 1.0 frequently asked questions. This must be, yeah this says modified August 2002. I was thinking, yup, 2002. I cannot wait to do and exploration sensation, of this hard disk. So now that we got that out of the way. What do you say we connect these pro speakers, which Brent has showed me they sound pretty bad ass. But I've never actually had them for myself. Let's connect those, hook up a mouse. Not that disgusting keyboard. And boot this sucker up! Let's do it. So a big difference compared to the USB speakers, is that the Pro Speakers you use this special 2.5mm, yes not 3.5mm, 2.5mm jack. This provides power and sound. And you also don't have a giant amplifier, dangling on the wires. With the USB speakers you had an amplifier on there. With this, not necessary. Let's just put those babies right there. Had a little trouble getting it in. Don't make that dirty. C'mon this is a somewhat family friendly show. We have our mm Mouse. And that about does it. I don't think we'll need to, hook this thing up. I don't even know if I could even use it with anything. Now, don't know if there's an airport card in here, but we're gonna take a look at the specs in a bit, once we boot it up. We'll look at the System Profiler. Let's go. I'm super stoked to boot up a Mac that has a startup chime. Because Apple's killing that off. Let's hear what it sounds like through these Pro Speakers. Power buttons way over here. Three, two, one. (startup tone chimes loudly) Holy Shit! Op. Almost fell off my chair. Wow that was loud. Oh I love it. (sighs heavily relieved) ooh. That was bass-ey Alright so the fans running, hard drives running. Not too noisy. Relatively quiet. We are currently like day five in the booting process. This doesn't surprise me. Like every iMac G4 I booted up, with Jaguar just takes forever. I remember back when I was not in this asylum lair. There was this computer lab at school, that had a whole bunch of iMac G4's, and I think they were running Jaguar. They just took forever to turn on. Okay. So, what do we do while we wait for it to load? For real now, all jokes aside, we're like three minutes into this boot-up. I don't know, maybe the hard drive is just full of garbage. Like maybe we'll have to clean this baby up. Maybe there's a lot of treasures on it, like we're gonna be doing some treasure hunting, some like hard drive treasure hunting. Or an exploration sensations as I like to call it. I'm growing gray hairs. I have gray hairs now. It's official, this is, this is insane. We'll you know, maybe this would be a good time, to read the Single Use License Agreement. I mean what else are we going to do, right? (loudly clears voice) English, Apple computer incinerated. Software License Agreement for Mac OS X. Single use license. Please read this software license agreement (\"license\"), carefully before using this software. Da at da. We'll skip some of that stuff. Number one, general. The software including Boot ROM code. Documentation any finds. (mutters gibberish) Oh then it's in different languages. It's actually not that long. It's a multi-lingual document. Which I suppose we could have deciphered, from the fact that it's multi-lingual on the cover page. We'll that was fun. And look at that. Now it's boot, oh man. Oh that start-up screen, the pin stripes. That takes me back. Oh shit these abstract wallpapers! You remember those? Yeah perfect timing, it looks like it's loading the desktop now. (slaps legs quickly) 20 years later. (whistles loudly) Yeah this hard drive must just be really, full. Or it's got like a lot of cache on it, and it's all gunk-ed up barnacles and crust. I don't know. But that is a ridiculous, this is ridiculous. Like it's a long boot time, and we're not even at the desktop yet. We have the wallpaper. Or the desktop picture. We have the mouse cursor. Oh here comes the doc. Here comes the doc all dressed in socks Oh they have the slide show mode on. Yup menu bars still loading there. Op we got the beach ball. We got beach ball. Okay, we're at the desktop, we made it. 10.28. That is indeed Jaguar. The old roman numeral ten. The Aqua buttons the pin stripes, ooh it's all comin' back. We have the doc down here, the menu bar up here. Let's turn up the mouse tracking speed. Because it is just painfully low right now. I like a fast mouse. Oh that animation. Yeah this thing is definitely struggling to keep up here. Okay, well it looks like we have, Mac OS 9 on here too. Really? That's interesting. Oh that beach ball of death. I think we're gonna be seeing this guy a lot today. Yup. Hunker down boys. Alright take a shot every time the beach ball shows up. Don't actually do that you're gonna die. But that'd be a fun game. That would actually be a really fun game. Oh my gosh. All I did was open the applications folder. Shit. Well speaking of applications, while that's loading. Down here we have the finder, looks like Acrobat, something else. Let's see what's this here. Oh the labels on the doc aren't even loading. iClean, oh okay. Well, either iClean really sucks, or the person who owned this computer never used iClean. Because the computer is performing like shit. I have computers from the 80's that boot up faster. So, let's just keep that in mind. This looks like the old iChat. We have iMovie, iTunes preview, iPhoto. Something, something, Quicken, QuickTime, Stickies, Sherlock, System Preferences. Something from Kodak, Kodak easy share. The calculator, Netscape Navigator. Wow this is really being slow. Yup Netscape Navigator, HP ImageZone, and Text Edit. Let's see, this was Print Explosion, and this was Outlook Express. Alright. Wow, this, the performance. It's too much. Save me. Alright, so after like three minutes of beach balling, I busted into the Applications Folder, hurray. Yeah we have a couple different things on here. Now here's what's weird. There's 42 gig's free, so it's not like the hard drive is really stuffed. There must be something else wrong with this. I know there's Mac OS 9 on here, there's OS X on here, I also saw a previous systems folder. So there was that one time like a reinstall done. I don't know why there was a reinstall done, but there's probably a lot of stuff, we could delete off of this computer too. But any-hoo-zel. Let's try going through applications. America online iDVD, we talked about that earlier. May have to experiment with that. Op my scroll bar, scroll bar is freaking beach balling the finder. Are we serious right now. Is this what we're going to be doing today. Good heavens I can't scroll, without the computer hanging on me. (pretend cries softly) Why? (pretend cries softly) What have I ever done to you? Stuffit standard, Spring Cleaning, Norton Systemworks, yes it's certainly does. (upbeat music) iOmega, Netscape Navigator, Click'n Design 3D. As we saw the book for. Okay, we're scrolling along. Op we got iMovie, iPhoto. Some old iLife Applications that's cool. PixelEnhance, very clever. I guess. AppleWorks ooh. The old productivity applications before iWork existed. Ah, that's fun. Just moving my cursor, we got a beach ball. 'Kay how many shots do we have to take now, like 27, this is really insane. If any like trouble-shooting people worked on this computer, like they must me rolling in the dough. Like this would all be bill-able hours right here. Oh, your iMac, yah the one that hangs all the time, I will absolutely fix it for you. Remember I get paid by the hour. If that thing takes an hour to boot up, boom that's an hour of pay for me. Nothing really interesting in My Stuff. We have the City of New Falls, and Untitled three. What kind of document is this? I'm just curious. I'm gonna snoop around a little bit. It is a NSRTF P-Board type, okay. So NS is usually a prefix in like the developer environment. RTF Rich Text Format. P-Board type I have no clue. But man, like if this system, is having performance issues right now. Like that doc sometimes even lags, man I don't want to boot up classic with an OS X. It's probably just gonna bring the whole thing down. Now if I can boot into OS 9 separately, maybe that lighter weight operating system will work better. We can try that. So we have 760 megabytes of RAM, and 800 MHz Power PC G4 processor. Which that in and of itself, should be fast enough to run this system. I just feel like something is really, bogging this thing down. Maybe the Finder has the answers. Nothing in the Kodak pictures. iPhoto library. iDVD. Doesn't look like there's much in there. See, let's see if these are really big or not. 2.3 gigs, that's not too much. Ah, let's just open up iPhoto. Let's have some fun, see if an application performs well. Yeah right. (bell tone chimes) Oh shit, that actually loaded up, way faster than I thought it would. Loading library. Ah the old barber pole animation. Awe I miss that. Okay, of all the things I could find on this computer, there is a picture of Cloud Gate, which is a huge freaking coincidence. Because we were just looking at that, on some past episodes. With some photo's that I shot. Stuff seems to be performing decent now. The finder was going really slow at first, but stuff seems to be loading okay. So I see that we have an ethernet, gigibit, not gigibit ethernet, a probably 100 megabyte ethernet connection, that was once used on here. We have a menu bar item for it. We also have a modem menu bar item. Which is currently idle, yeah I'm guessing there's no Airport card in this thing. Yup. Yeah, there's no Airport card in here. We can hook this up to wifi, by like internet sharing it, but I don't think that's really necessary right now. What might have to also happen with this computer, is we'll just have to do some re-installations, to maybe make it work better. We may just have to wipe the whole hard disk out, and then reinstall everything. With all of those CD's that we have. Because we have a shit ton of CD's. So that maybe in a future episode. But I want to be careful with how much I wipe out, because there's probably some programs on here, that I don't have the CD's for. Plus if I wipe it out, that kinda ruins the whole time capsule-ness of it. Oh, let's see if there's any music on here. (giggles excitedly) Well let's see, what did this owner listen to. Like um. I was gonna make a joke about like a pop star. But like all this music is probably way older than, like any of those modern stars careers are. (chuckles amused) I mean. Well it worked this computer, probably hasn't been used, since like 2009, 2008, I don't know. This is it. This is all the music that's in here. I don't really want to play it, you know copyright reasons, but. Let's just test the speakers I guess. (brief guitar music) Alright it sounds like shit. But that's because this is turned up way to high. (brief guitar music) Wow these speakers sound freaking good! Ah, yeah I believe Apple made them, in cooperation with Harman Kardon. Holy balls they sound great. (brief guitar music) These things are just pumping. You gotta see this shit. Well the system seems to be performing better now. .mac, oh yes that is, that is a screensaver I hope everybody can have. Oh yeah. Your life, on the internet. Alright. Yeah, let's just go to Apple Background Images, and throw our default Jaguar on there. And there we go. Aqua blue. I'm cool with that. Start up disk let's see if OS 9 is an option. Oh yeah. OS 9.22. Alright I'm gonna set that as the default. Next time we reboot we're going to go into OS 9. See what's up. Let's poke around in some of the software a little bit. Let's see what version. Let's see I think they had iDVD and iDVD 2 on here. I don't think I've ever used the original iDVD. That goes way back. I remember that was a big deal, cause there was like you can just burn your own movies, your own home movies unto a DVD on your own computer. Oh I dig this old design. Oh the nice pulsating Aqua buttons. Again, another nice thing we don't get anymore. (sniffles quietly) Sad. - We're using the fact, that you know we have, a gigaflop sitting here. (audience laughs loudly) Maybe we can do something with it. And so very gently we just dim and brighten the buttons. Say hey this is the one, that's gonna get activated if you hit return. - [Krazy Ken] My great DVD. We'll throw that on the desktop. You know, once it loads. Oh the iDisk, remember that thing? (chuckles lightly) mobile me, does anybody remember mobile me? We could actually use this as a DVD player. It has a DVD drive in it. (very loud music) Holy F(beep)k! Holy Shit! What the F(beep)k! Get! What! Ho my gosh! Okay the guards are gonna be awake now. Oh! Holy Shit. (laughs loudly) That was really fu(beep)n loud! (laughs loudly) That's kinda coincidental, cause I was just about to say, we could use this as a DVD player. Because one it has a DVD drive built in, two it has a decently sized LCD screen, and three the speakers are really loud. And that just proved my point right there. Oh my gosh. (chuckles softly) Is my heart still working? It is! Okay, good. Oh yes, the old animated themes. Yeah. We have a theme chooser. That was Global. Or this is Global. Oh yeah inactive windows had that transparent look. Pretty cool, kinda like Windows Arrow, but before Windows Arrow. Wedding, Family, Sky. I remember seeing some of these when I started using iDVD. Let's make a wedding. Oh yes. (snare drum music) (saxophone music) This was cool stuff man. You could just do this right on your computer. iDVD 2, nice. Actually I think I have one my own DVD's nearby. One that I tested on the Macintosh TV with the DVD player. I should throw that into here, so that we can test the speakers with my own content. And so we can also test the DVD, playback capabilities of the computer. Most of this episode is just gonna be, watching the beach ball spin. I found my, coincidentally also a Verbatim disk. Video's for Mac TV demo. Which was also another beautiful episode. So let's bust open the DVD player. Oh yeah, the nice wire frame animation. Begin DVD insertion process. Oh shit. I guess I can't use the eject button in the software, yeah without a keyboard hooked up, I also can't really use the terminal to open up the thing. So yeah I guess I got to hook up, this disgusting keyboard to press the eject button. Ew so gross. Located in the back for your convenience. Ah, this keyboard is so gross. Alright, there's our disk drive, and in you go. Okay. It sounds like a cow with a really long moo. Or a very sick airplane. That disk drive does not sound like it should. I'm pretty sure they weren't that buzz-y back then. Oh, yeah, that doesn't sound right. This DVD should work. It's a single layer DVD-R. Not permitted, okay well. I literally have no idea what the frick is going on. Let's quit the DVD player. And eject this thing. Alright take two on that. Let's see if it even mounts on the desktop. (low whirring) Whir Wow that does not sound normal. Okay now it's making some different noises. And we have an icon and the DVD player opened automatically. That took about five minutes. Hardware, And you, Oh! can be a part of it. Your still gonna love what we have That sounds pretty, to share with you. awesome. And that subject is, vintage Apple products. (upbeat music) Okay so. Your going to see. So just a little preface. I just put together like a compilation of videos on here. So this for example is the Vintage Apple Volume One trailer. But yeah, wow. These speakers sound good. (popping loudly) And all the old, popping sound, yeah. (popping loudly) Yeah! It clips a little bit when I go, like to the second highest notch. But right there it's about fine, yeah. Wow that sounds good. Preserved Apple Products in a all new light. The timeless designs, the blunders, the successes, the failures. You're going to see details you've. La la la la I love these speakers! Can Ken I to keep his sanity With the help of his robot friends It's Ken's cinema of shenanigans. Awesome okay, well, (blows air lightly) I guess it does work as a DVD player. Just takes forever to load. The question is, does it take forever to load, because the hardware is failing? Or because something is really screwed up, in the operating system? To be honest I'm willing to bet it's the system, something is wrong with the software, and stuff just takes forever to load. So stuff takes forever to communicate with the hardware. Opening up the system profiler. I just wanted to check to make sure, this drive was compatible with these DVD's. I mean I was assuming it would be, because there's iDVD on here. Yeah, right here. CD-RW, DVD-R. Discerning fully supported. And this fricking like finder window with the applications, like that just hangs a lot. So I do want to boot into OS 9. I'm gonna do that still, but, man this one 3D thing keeps grabbing my attention. Click'n Design Okay. We're just gonna fricking open it up. (paper rustles) I have no idea what it is. I think I. (whistles softly) I think I had a manual for it somewhere. I think I showed it. Yeah, okay. It was a printed one from the inter-webs. Yeah. We have to open this thing up. That looks like a goldmine of like, early 2000's, consumer (laughs heartily) graphic design. Here we go. You guys ready for this? Click'n Design 3D. I'm gonna make my next hot album cover, with this dope software. Oh it's oh. Coincidentally that's right. I was making a joke about the CD thing, but yeah it's actually for designing I guess, CD labels. Oh it is. Video Tape Labels, Audio Cassette labels, son-of-a-bitch I was just joking about the album art thing. But I guess eh I have to go through with it now. This is for CD's. I used to use a program by BeLight Software. I should actually check and see if they're still around. But it was called Disc Cover. That was pretty cool, I used that program a lot. I don't really make discs anymore. But yeah Disc Cover was a pretty cool program. Quick start wizard Dun dun dun dun dun dun dun Over the top, name, purpose, description, date information. Shareware. Alright. Your company.com Guessing you can change the text here. Alright well this will be my Krazy Ken mix tape. So we'll call this. Wait a minute. Whoa. I just had an epiphany, I think, I think the previous owner, of this thing can see into the future. They knew who was going to be owning this computer one day. Do you know what I'm gettin' at? Hang on a second. This hard drive is labeled KK. Krazy Ken. I didn't label it that way. You saw it. It came up that way when, I turned on the computer for the first time. I think someone is watching. And it's not just the curse, or the guards, or the people, running the experiment on me here in the Asylum. No, I think someone else outside of all that, is also watching me. That is not a coincidence. I can't believe in coincidences anymore. Krazy Ken, KK, wow. Okay, that's one letter away from something really bad. So we'll be careful with that. But yeah, anyway. I was gonna call this like my Krazy Ken mix tape. It was gonna be like KK mix tape. And I just had an epiphany about the initials. That's how I got down that rabbit hole, in case you're wondering. Contents. We gotta make some songs on here. Let's see. Don't go bacon my heart I couldn't if I fried Yeah that's enough of that. So you can make CD labels in here. Do they have Clipart? No program is complete without Clipart. Let's see what the tip of the day is. Oh my gosh that icon, that fricking icon was like, the Window's '95 did you know thing. Did they hijack this from Microsoft, or is that like a general use icon? 'Cause that looks just like Windows '95. Let's click the 3D button. There we go that's what I'm talking about. Oh shit we can zoom in and out of this. It looks like we have an extrusion on here, with like some kind of bevel. Oh yeah, we're gonna call this Krazy Ken. Oh yeah. Ooh this, this is, this is nice. Geneva, no. We're cooler than that. Chicago though. Bringing us back to the original Macintosh, right. Should we render this in low quality, or high quality? I think we should go all out. Effects. Oh you can arc it, okay. Materials. Texture, Lights, Background. Lights, so we can turn off some lights? Oh yeah, give it like a spotlight. Can I like move this around? Oh check it out man. Working in 3D. Look at that, we can transfer that. There we go. Kinda like the good-ole-days of Word Art, and Microsoft Office. You know the stuff you probably used way too much of. I mean I'm guilty of it too. I'm totally guilty of it. I did that all the time like in middle school. Here we go Krazy Ken, the KK mix tape. Don't go bacon my heart. I couldn't if I fried. Well that was fan fluffing-tastic. Let's close out of that. Don't save those changes. Graphics, I'm curious about this. So do you get like Clipart in here? Okay so my conclusion is, it seems like the finder is the thing that, is running slow and slowing everything down. 'Cause like when I use other things, the software, like that program we were just using, seems to respond just fine. It's anytime I try to do something in the Finder, everything slows down. I don't know if that's just a common issue with Jaguar, or if something is on this computer, that's causing problems or what. Here we are. We have, we have our, oh there's even a Clipart folder. Oh this is exciting. I didn't see a browser for Clipart inside the program, but I see all the assets in the finder here. So we're just gonna poke around. What the shit, seriously. Who like designed these templates, and thought this was smart? These are kinda freaky. Let's just open this up here. Yeah. Yeah, I want that on my CD cover, absolutely. I want the illuminati on my CD cover. This stuff has a kind of a Vaporwave aesthetic, it's a little more higher quality though. It's like a slightly higher quality vaporwave. That definitely is not vaporwave. Ah, getting a little close again. This is wacky, this is really wacky stuff. I feel like I'm watching old 90's, like computer animation or something. Which I know stuff was probably close to that. Oh, whoa hey, is this a appropriate. I don't think we should have dancing ladies, in a spherical cages on our CD cover. I don't know why. We've made some discovery progress people. I have infiltrated the backgrounds folder. I am now in the business photo's directory. Yeah there's a lot of little like picture stuff, in the backgrounds folder. that you can just put in your projects. Oh check this baby out, eh. Oh yeah. That's high resolution. That'll print very well. Oh we got some dogs, we have dogs ladies and gentleman. Oh that's a cute one. Ooh husky. Yes. I'm gonna put a husky on my CD. There we go, that's my CD dogs 2012. Oh there's actually a folder called Dogs Sledding. Huh, alright. Specifically, oh more Husky. Sled dogs are awesome. I actually photographed them before. They are fun. We got a lot of fricking, random pictures open now. Should probably close those bad boys. Oh the close all command I guess wasn't a thing back then. What if I hold down option and press the red button? There we go, okay. And I broke the finder again. Welp, I think that's enough of Jaguar. Let's try booting into OS 9 and seeing what we can do. Maybe it will preform better. (bell tones loudly) Ooh yeah. Love that sound. There we go we got the happy Mac. Mac OS 9.2 welcome to Mac OS. So this is working. So far so good. Let's see how fast it boots, hopefully faster than OS X. Oh your computer did not shut down properly. Ooh someone set this to like italic something here. Alright. Verifying Krazy Ken. Disk First Aid is unable to read the Startup Disk. What the shit. Okay something is really wrong with this hard drive. Either it's like failing, like there's bad sectors on it, or there's just something configured, very wrong on the software level. Now hardware might be fine. The softwares just really screwed up. I have no idea, it could be either I guess. I mean the disk in here is probably very old. But I've had older disks, still work just fine. But who knows this thing could have been dropped. Put in an incinerator. You know, thrown off a cliff, a whole bunch of things could have happened to it. Okay this is really freaky I'm just like, randomly scrolling through Instagram, waiting for this thing to load, and there's another photo about Cloud Gate. Is Cloud Gate just following us everywhere? And this is interesting it's actually, from an Instagram account called RealLocations, where they go and visit locations, that were used in motion pictures. And they show a picture of the scene, in front of an actual photo of the environment, so you can see like the before and after kinda look. And yeah it's Cloud Gate, like wow, they're just following us everywhere. (beeps loudly) Network time error, yes 1973 whatever. But yeah the interesting thing is, this post was about Source Code, which is a movie I actually really liked. I rarely like live action movies, but that was a live action movie I really liked. And yeah now that I think about it, yeah that took place in Chicago. Okay so I was trying to kill some time, and I just killed everything. Oh, what the f. Oh what! Okay. We just got greeted by the OS 9 welcome video. That means OS 9 was installed on this computer, but was never actually used, fascinating. I've never actually used this old wizard before. Oh it has sound effects, did you hear that? Oh yeah. Nope. Nope. No please. No. (popping loudly) Okay. Do I really have to register? No. I don't want to do that. (beeping loudly) (mutters irritated) Can I like force quit you? Yes. Woo. I win. I just did a regular quit actually. Oh, do you see what I see? iMovie. Is this the original? Before I continue doing this stuff, I need to turn the sound effects on. Because this is not the same without the sound effects. There we go. (clicking softly) Oh gosh that's like sex. (clicking softly) (spring bounces loudly) Oh I've never heard these, on the Pro Speakers before either. (spring bounces loudly) Oh, oh. (spring bounces loudly) I could do that all day. (clicking loudly) Everything's, gonna have a sound effect. I hope you like it, cause you're gonna be hearing them, so sorry suck it up. Was it charcoal? I don't remember what the default font was for OS 9 was. Lollipop, lollipop Gray space or space gray, you decide. Okay, now let's have some fun. I of course cannot go without opening the Finder Easter egg. The about this finder, or about the finder, screen right here showing, the Apple campus from the courtyard view. Created by all the folks here at Apple. Yeah that's just a cheap way, to not have to put everyone's name in there, but that works for me. There's probably a lot of names. I was actually just at One Infinite Loop. I'm having a hard time orienting what building that is, I think it's this one, not really good at that. (chuckles softly) Let's see, about this computer Mac OS 9.2 And then if you want hold down the option key, and go to about the Finder. See the Finder is way more responsive than in OS X, so something is really f(beep)ed up on this thing. But I think I see something really awesome. I see an old Mac OS 9 version of iMovie. What version is this? Yup this is iMovie 2. Okay so it's not the original, like first one. But this is still pretty cool. Let's open her up. There we go. Do we get a little welcome video? There it is. (upbeat music) Da da da da La Yes. Oh my gosh this is great. Krazy Ken's movie. But it was like a full screen app, like you couldn't run it in a window back in the day. But fun fact this was the, well not this particular version. iMovie HD was the first software, ever did digital and LE editing. Yeah it wasn't this old version, but it was iMovie, that's where I got my start. Oh yeah here's our title generator, yup. This is it, this is it guys. Effects. We probably have some, like some video effects, that I'm sure we have some sound effects built in. (cat meows loudly) (crickets chirp happily) (pigs oinking loudly) (crickets chirp happily) Yup that's the reaction, to most of my episodes, right there. Sounds about right. Well this computer does have FireWire on it. So I suppose I could like, actually capture video off of that into the system. I'd have to borrow a DV Camera. Because the one I have has a bad VTR, as I demonstrated in these other episodes. (chuckles softly) (audience laughs loudly) Stop laughing. But yeah I guess I could make a movie in this, once I capture stuff off tape. I mean if I can edit video in fricking Adobe Premier One, I'm sure I can use iMovie 2 with FireWire. Okay so there's a built in microphone, like right there, that little hole right there. Let's record our own voice. Hello I am Macintosh, it sure is great to get out of that bag. Scrubber back on the time, look at that scrubbing. Look at that smooth performance there. Hello I am Macintosh, it sure is great to get out of that bag. Doesn't sound to bad considering, like how old this computer is. So that's pretty awesome. I think that deserves a round of applause. (audience applauds loudly) Over, Transitions, Fade, Overlaps, Scale Down. Yeah I don't have any footage I can use with this right now, but I may revisit this some other time. Oh yeah, I accidentally. I dragged the app switcher into the thing. Alright let's close that out. So yeah this system seems to be performing, way way more snappy, than fricking OS X. I don't know if the software, is configured wrong with OS X or what. But this thing seems to be working way better. I haven't used iDVD in OS 9 either. In fact I didn't even know that was a thing. Shit that's cool. Let's open it up. So I'm guessing the, (upbeat music) Oh! Oh yeah this is the 90's, the late 90's. I love it. So I'm guessing the version we were using, on Mac OS X was a carbonized version of this. Because it wasn't running in the classic environment, and I'm guessing they didn't rewrite it in Cocoa. My great DVD, hell yeah it is. Let's see, what version is this. This is probably the original. (upbeat music plays) Yes thank you. Oh I didn't mean to do that. Oh yeah, brushed metal, that was another thing that was there a lot. Okay let's sit through it. (upbeat music) Yeah version 1.0. Shit this is the original ID Video, I have not used this ever. Let's take a look at our themes. Chalkboard. Yeah. I don't have any assets I can actually put into this, but. The old iMovie and old ID Video are really cool. I may have to experiment with those in future episode. Then if you have any suggestions, for me to try anything out on this computer. Do let me know. This was a lot of fun. Thanks for tagging along (insistent knocking) (insistent knocking) (angry yelling through door) Sounds like the guards want me now, I'm gonna take care of those guys. Thanks for tagging along with me, catch the crazy and pass it on. (upbeat music)",
    "transcript_keywords": [
        "Yeah",
        "thing",
        "DVD",
        "Krazy Ken",
        "computer",
        "Pro Speakers",
        "Apple",
        "Speakers",
        "shit",
        "time",
        "mac",
        "sound",
        "DVD player",
        "drive",
        "software",
        "Ken",
        "finder",
        "Yeah Krazy Ken",
        "stuff",
        "alright"
    ],
    "transcript_entity_values": [
        "10.2",
        "Greeting Card Factory",
        "one day",
        "roman numeral ten",
        "spring",
        "Da at da",
        "KK",
        "Lollipop",
        "3D",
        "a minute",
        "HP ImageZone",
        "VTR",
        "two",
        "5",
        "gigaflop",
        "Global",
        "three minutes",
        "2.3",
        "Cloud Gate",
        "Dogs Sledding",
        "2",
        "the Apple Hardware Test, Software",
        "90",
        "Kodak",
        "Mac OS 9",
        "iClean",
        "Krazy Ken's",
        "Disc Cover",
        "one",
        "the AppleCare Protection Plan",
        "SmartDisk",
        "Aqua blue",
        "early 2000's",
        "Apple Background Images",
        "Chrome Logo",
        "iPhoto",
        "f(beep)ed",
        "La la la la",
        "Cocoa",
        "NS",
        "Audio Cassette",
        "August 2002",
        "100 megabyte",
        "the late 90's",
        "Garamond",
        "the System Profiler",
        "TechTool Deluxe",
        "Three",
        "Kay",
        "SandDisk",
        "Windows Arrow",
        "Apple",
        "iMac G4",
        "Instagram",
        "1973",
        "all day",
        "Mac OS X",
        "Brent",
        "Geneva",
        "3.5mm",
        "Outlook Express",
        "Mac",
        "Disc Cover",
        "iChat",
        "OS 9",
        "the Pro Speakers",
        "first",
        "Pro Speakers",
        "Mac TV",
        "Microsoft",
        "iMac",
        "the City of New Falls",
        "Stickies,",
        "Finder",
        "I. Aye",
        "Mac OS 9.2",
        "DV Camera",
        "X. Single",
        "three",
        "AppleCare",
        "a Mm Mouse",
        "9.22",
        "USB",
        "Ken",
        "Boot ROM",
        "MHz",
        "2009",
        "Word Art",
        "FireWire",
        "Stuffit",
        "Aqua",
        "Vaporwave",
        "Adobe",
        "9",
        "KK",
        "LE",
        "Chicago",
        "macOS X",
        "Acrobat",
        "80",
        "20 years later",
        "Airport",
        "iDVD 2",
        "Finder",
        "the day",
        "today",
        "Krazy Ken",
        "Welp",
        "the Vintage Apple",
        "Holy Shit! Op",
        "Netscape Navigator",
        "42 gig's",
        "Clipart",
        "Windows",
        "9.2",
        "Spring Cleaning",
        "iDisk",
        "Garamond",
        "Jaguar",
        "BeLight Software",
        "about five minutes",
        "Disk",
        "27",
        "the hour",
        "illuminati",
        "2.5mm",
        "Scale Down",
        "800",
        "Everything's",
        "Aqua",
        "Aqua tabs",
        "Mac OS",
        "this Krazy Ken",
        "P-Board",
        "iMac G4's",
        "from 2001",
        "Clipart",
        "iMac Media",
        "Dun dun dun dun dun dun dun Over",
        "RealLocations",
        "10.28",
        "Mac",
        "Macintosh",
        "Print Explosion",
        "the Applications Folder",
        "LCD",
        "English",
        "2002",
        "America",
        "RAM",
        "G4",
        "the Garamond Serif Typeface",
        "One Infinite Loop",
        "Da da da da La",
        "the Finder Easter egg",
        "Harman Kardon",
        "One",
        "760 megabytes",
        "Microsoft Office",
        "five",
        "an hour",
        "second",
        "iWork",
        "95",
        "1.0",
        "2012",
        "the Single Use License Agreement",
        "Norton Systemworks"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "NORP",
        "PERSON",
        "ORG",
        "CARDINAL",
        "LAW",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "FAC",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "FAC",
        "EVENT",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "NORP",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "GPE",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "DATE",
        "TIME",
        "NORP",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "EVENT",
        "ORG",
        "ORG",
        "LANGUAGE",
        "DATE",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORG",
        "FAC",
        "PERSON",
        "EVENT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON"
    ]
}