{
    "id": "SiFGa7ZKEB0",
    "title": "Time for payback, Apple...",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-03-23T02:07:24Z",
    "video_url": "https://www.youtube.com/watch?v=SiFGa7ZKEB0",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "Apple",
        "iphone",
        "iphone 12",
        "iphone charger",
        "box",
        "charger in the box",
        "iphone box",
        "charger included",
        "USB C",
        "USB A",
        "Brazil",
        "Sao Paulo",
        "fine"
    ],
    "views": 593682,
    "likes": 37377,
    "comments_count": 1510,
    "description": "Head over to  to get your starter set for only $5 with razor refills shipping at regular price after that  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      Timestamps: 0:00 Linus fishin for compliments 0:10 RTX 3060 limiter hacked EVEN MORE 1:09 Brazil hits Apple with $2M fine 2:05 Cherry low-profile mechanical switches 3:15 Dollar Shave Club 3:54 QUICK BITS 4:01 Dolby Vision for Xbox Series X/S 4:30 Acer hit with ransomware 4:56 Apple discontinues two iMac models 5:37 Windows 10 printer problems fixed 6:04 Cyberpunk patch to fix cops  NEWS SOURCES  A DUMMY FOOLS NVIDIA     NO CARNIVAL FOR APPLE     LAPTOP WITH A CHERRY ON TOP     HDRX    A PREDATOR AFTER ACER    APPLE SQUEEZES IMAC    BROKEN WINDOWS    PLEASE GET IT RIGHT THIS TIME   ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "http://DollarShaveClub.com/techlinked",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://www.tomshardware.com/news/cryptominers-fool-nvidia-anti-mining-limited-hdmi-dummy-plug",
        "https://www.techpowerup.com/280017/nvidia-geforce-rtx-3060-anti-mining-feature-bypassed-by-hdmi-dummy-plug",
        "https://hothardware.com/news/geforce-3060-eth-crypto-limiter-bypass-multi-gpu-mining-rigs",
        "https://www.engadget.com/apple-brazil-fine-over-iphone-12-charger-171754262.html",
        "https://www.macrumors.com/2021/03/20/apple-brazil-fine-iphone-charger/",
        "https://9to5mac.com/2021/03/20/brazil-agency-fines-apple-iphone-12-charger/",
        "https://hexus.net/tech/news/peripherals/147575-cherry-wants-set-new-standard-laptop-keyswitches/",
        "https://www.youtube.com/watch?v=VHKA6v_ztAc",
        "https://www.rockpapershotgun.com/alienwares-new-gaming-laptops-now-have-cherry-mx-keyboards",
        "https://www.flatpanelshd.com/news.php?subaction=showfull",
        "https://www.xda-developers.com/xbox-series-x-series-s-dolby-vision-testing/",
        "https://www.zdnet.com/article/acer-reportedly-targeted-with-50-million-ransomware-attack/",
        "https://www.pcmag.com/news/acer-falls-victim-to-50-million-ransomware-attack",
        "https://mashable.com/article/apple-imac-storage-sizes-removed/",
        "https://www.techradar.com/news/apple-discontinues-more-imac-models-ahead-of-rumored-m1-refresh",
        "https://www.bleepingcomputer.com/news/microsoft/new-windows-10-emergency-updates-fix-remaining-printing-issues/",
        "https://betanews.com/2021/03/22/microsoft-re-releases-kb5001649-windows-10-update-printing-patch/",
        "https://www.ign.com/articles/cyberpunk-2077-patch-12-set-to-fix-police-response-times-and-driving-issues",
        "https://www.pcgamer.com/cyberpunk-2077s-next-patch-will-slow-police-response-let-you-remap-dodge/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "(panting) - [Man] Are you okay? - Sorry I'm late, you guys. I was busy making myself pretty before I hosted TechLinked. - [Man] Okay. You know you look good. - You probably can't tell though. So you know how we recently reported on how miners were already finding workarounds for the RTX 3060 hash rate limiter? Well, it looks like another one has been uncovered and it is ludicrously simple. An HDMI dummy plug that costs six bucks. Although miners were already aware that there's a beta driver floating around that enables Ethereum mining on one graphics card, this dummy plug actually allows a multi-GPU setup. You see, part of how the limiter works is by requiring a monitor to be connected to each graphics card. But these cheap little dummies can fool the card into thinking there's a monitor connected. - [Man] It's unhackable. - In fact, I have one right here. There, that's the one. They're also useful for virtualization. So that's why we've got a bunch of them lying around. One user was able to mine Ethereum at a total of 192 mega hashes per second, on a four-way 3060 setup. So, it shouldn't take him too long to make back the $24 he spent on those four little plugs. - [Man] Could've spend more on (indistinct). - You know how Apple has been selling iPhone 12s without a charger, ostensively to reduce the E-waste? Well, one State in Brazil is not buying it, as the state of Sao Paulo has nailed Apple with a fine of nearly 2 million US dollars. That's right. US dollars. The State's consumer protection agency was concerned that Apple's environmentally friendly explanation was just a cover to screw over consumers and was also upset about Apple's claims about the iPhones water resistance. Now, 2 million bucks is chump change to a company like Apple but the bigger deal here is that they might end up being forced to include chargers when selling iPhones in Brazil, which is a huge market. Samsung, actually ended up having to do this with their phones. So maybe Brazil's fight against Apple will go a little better than that time they had to play Germany. Hey, got them. If you're into mechanical keyboards, there's a good chance that Cherry switches lie underneath your key caps but so far only on desktops. Well, with one exception but we won't talk about that. It looks like that whole thing is about to change though as Cherry has released information on its upcoming Ultra Low Profile switches for laptops, also known as ALP switches. Wait, no. Not that. As you might expect, the switches are tactile and give acoustic feedback. So, they'll probably appeal to fans of Cherry MX Blues and importantly, they'll support RGB backlighting. As far as when you'll be able to get your hands on some, it looks like Alienware will be one of the first companies to feature the new switches. Though you will have to dig pretty deep into your pockets for the money to get one because the cheapest laptop they offer with the Cherry switches, starts at $1,800. And then, guess what? You get to pay another $150 for the switches themselves. But is any price too much for tactile satisfaction? - [Man] You might as well buy a magic keyboard. - Yeah, r/MechanicalKeyboards would say, \"No.\" - [Man] And an iPad. - And you know who else would say no? No, bad segway. - Now, it's time for Quick Bits brought to you by Dollar Shave Club. The easy and affordable way to look, smell and feel your best. They've got all your grooming needs covered. Skincare, oral care, deodorant and of course shaving because it's in the name. To prove it, Dollar Shave Club send over their ultimate shave starter set, which includes a sleek matte black razor handle and either the four blade all-terrain or six blade extra-closed blades. As well as a one ounce tube of Dr. Carver's Preps Scrub, Shave Butter, and Post Shave Dew. Wow! Visit dollarshaveclub.com/techlinked to get the ultimate shave starter set for only $5 with razor refills shipping at regular price after that. - Now for the Quack Bots. You remember how Microsoft promised Dolby Vision HDR support for the Xbox Series X and S? Well, guess what? It looks like it's finally starting to arrive for a few games such as Gears 5 and Borderlands 3, and only for Xbox Insiders. But, it should be released to the general public before the end of the year. Hopefully we'll see more titles supporting it soon as I can't wait to play Tackling Simulator 2021 in glorious HDR. - [Man] You can only play three times a week. - On PlayStation 5. Just kidding. Acer has reportedly been hit with a major ransomware attack with a group of criminals demanding 50 million US dollars. As for how Acer got hacked in the first place, it looks like a security flaw in Microsoft Exchange left their network exposed. Acer has so far been tight lipped on the situation. So, let's just hope that Predator monitor you've been eyeballing won't suddenly shoot up in price. - [Man] Hopefully, they don't release the source code. - And if you're in the market for an iMac, you should know that your buying options are continuing to shrink. Apple has already said, \"No more iMac Pros.\" That's exactly how they said it. And now, there are no more 21.5 inch models with a 512 gigabyte or one terabyte SSD. That leaves your storage options for 21.5 inch iMacs, quite limited, indeed. The move comes ahead of the transition to M1 Processors, but it would be nice if people who need an iMac now, could actually store things in it, instead of in a Ness where everyone should be storing their data instead of on their computers internal drive. It's been well-publicized that Microsoft's latest Windows updates have given users major problems when trying to print, including blue screens and graphical glitches. Microsoft has since released a fix, but now users are reporting problems getting it through Windows Update. The good news, is that you can download and install the patch manually, but hey, feel free to continue being dumbfounded at how printers still always seem to find a way to mess with us. Just die already. - [Man] (indistinct) it's for the movie. - And CD Projekt Red has given us details on what it's upcoming 1.2 Patch for Cyberpunk 2077 will address. Does anyone care anymore? One big fix will be how police behave. They should no longer be instantly appearing out of thin air right behind you. - [Man] Just like in real life. - And the other reported fixes involve being able to unstick cars that get stuck on obstacles and having more flexibility when it comes to assigning keys. Hopefully, when it comes out this patch won't cause more problems, again. And that's our show. Come back on Wednesday for another episode that we hopefully won't have to issue a correction for. Did we do that? - [Man] I don't think we've ever had to do that. It was right every time- - Maybe we should have sometimes. - [Man] I don't think so. - Remember when we said no one's buying iPhones and it turns out that one was like the best selling whenever? - [Man] I haven't seen an iPhone since.",
    "transcript_keywords": [
        "Dollar Shave Club",
        "Apple",
        "Shave",
        "switches",
        "Dollar Shave",
        "Cherry switches",
        "Shave Club",
        "Cherry",
        "Microsoft",
        "Brazil",
        "dollars",
        "shave starter",
        "ultimate shave",
        "State",
        "Post Shave Dew",
        "shave starter set",
        "ultimate shave starter",
        "iPhones",
        "card",
        "monitor"
    ],
    "transcript_entity_values": [
        "Cherry MX Blues",
        "Ultra Low Profile",
        "ALP",
        "iPad",
        "Dollar Shave Club",
        "Germany",
        "PlayStation 5",
        "Microsoft Exchange",
        "Windows",
        "Ethereum",
        "three",
        "One",
        "50 million US dollars",
        "one",
        "US",
        "only $5",
        "Windows Update",
        "21.5 inch",
        "Borderlands 3",
        "iPhone",
        "Sao Paulo",
        "192",
        "24",
        "the Xbox Series X and",
        "iMac",
        "Brazil",
        "Projekt Red",
        "Shave Butter",
        "2 million bucks",
        "12s",
        "second",
        "six bucks",
        "Skincare",
        "Acer",
        "Cherry",
        "Dolby Vision",
        "Ethereum",
        "Samsung",
        "Microsoft",
        "Quick Bits",
        "the end of the year",
        "512 gigabyte",
        "iPhones",
        "another $150",
        "Alienware",
        "State",
        "first",
        "Gears 5",
        "iPhones",
        "Wednesday",
        "1,800",
        "TechLinked",
        "four",
        "nearly 2 million US dollars",
        "Carver",
        "Preps Scrub",
        "Tackling Simulator 2021",
        "1.2 Patch for Cyberpunk 2077",
        "iMacs",
        "3060",
        "RGB",
        "MechanicalKeyboards",
        "Xbox",
        "six",
        "Apple"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "GPE",
        "MONEY",
        "WORK_OF_ART",
        "QUANTITY",
        "EVENT",
        "ORG",
        "GPE",
        "CARDINAL",
        "MONEY",
        "EVENT",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "NORP",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}