{
    "id": "sIIK1asyFds",
    "title": "Dell XPS 13 Review: The Windows Workhorse",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-12-31T21:45:13Z",
    "video_url": "https://www.youtube.com/watch?v=sIIK1asyFds",
    "category": "Science & Technology",
    "tags": [
        "dell xps 13 review",
        "dell xps 13 2017",
        "dell xps 13 2017 review",
        "dell xps 13 8th gen",
        "dell xps 13 i7",
        "mrmobile",
        "michael fisher",
        "windows central"
    ],
    "views": 232067,
    "likes": 7018,
    "comments_count": 416,
    "description": "People have been asking me to review the Dell XPS 13 for as long as I've been looking at laptops. So when Dell offered to loan me the latest version of its nearly bezel-less notebook, equipped with the newest 8th-generation Intel Core i7, I jumped at the chance. What I found was a laptop with a surprisingly conservative design  but enough power (in the processor and the battery) to see me through the longest of workdays. The Dell XPS 13 is a workhorse in the truest sense, and because of that I can't help but respect it. Join me for MrMobile's Dell XPS 13 Review, and be sure to check out Windows Central's take as well in the links below!    [SPONSOR]  This video brought to you by Thrifter, a new way to save money by shopping based on value (and not hype). Visit Thrifter for great deals on everything from gadgets to home goods, at     [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  Dell XPS 13 [Dell]:   Dell XPS 13 [Amazon]:    [ABOUT MRMOBILE'S DELL XPS 13 REVIEW]  MrMobile's Dell XPS 13 Review for 2017 was produced following two months with a Dell XPS 13 review device provided by Dell. The review device was running Windows 10, powered by an Intel 8th-generation Core i7 and equipped per the spec sheet found in the video.   [FURTHER READING]  Dell XPS 13 Review [Windows Central]:   TechRadar Dell XPS 13 [2018] Preview:    [MUSIC]  A New Departure by Vincent Tone, available at Premium Beat:    No Major Delays by Julian Bell, available at Premium Beat:     [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "http://thrifter.com",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/4hk",
        "http://mrmobile.tech/4hl",
        "https://www.windowscentral.com/dell-xps-13-late-2017",
        "http://www.techradar.com/news/the-next-dell-xps-13-gets-teased-way-ahead-of-ces-2018",
        "https://www.premiumbeat.com/royalty_free_music/songs/a-new-departure",
        "https://www.premiumbeat.com/royalty_free_music/songs/no-major-delays",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Narrator] There's nothing really sexy about the term \"workhorse\" but it's definitely a compliment. A workhorse gets you through, does the job with no complaining and hopefully a little bit of class. The Dell XPS 13 is just such a workhorse, and this is the MrMobile review. (upbeat electronic music) I'm old enough to remember when Dell first became a household name. I was a Compaq man, myself, but when I went off to college, most of my friends carried Dell laptops. And thanks in part to machines like this, the company still has an enthusiastic following. As great as a legacy can be, though, my first impression of this hardware was that it felt ... old. I think most people associate the XPS 13 with these incredibly slim bezels, which is how Dell manages to cram a 13-inch screen into what feels more like and 11-inch chassis. That's still amazing, but the rest of the casing is very predictable. After a year of Surface laptops and Pixelbooks, this black and gray wedge of metal feels almost stolid. And that's bound to be compounded when Dell drops its next generation XPS line at CES in just a couple weeks. TechRadar got an early look back in October, and the new machines coming look substantially sleeker. Still, like Geordi La Forge says ... - Just because something's old doesn't mean you throw it away. - [Narrator] Because it's made for an established user base, this thing is crammed with conveniences for anyone who moves a lot of media. I'm talking about the full-size SD card reader and USB Standard-A ports, augmented by a USB-C connector and a headphone jack. This is still the most versatile array of ports, in my opinion, and the fact that Dell is trading it in next year for all USB-C and micro SD means this laptop is still the one to look at if you use professional cameras or legacy peripherals. Another nice thing about older designs is that they often come with proven quality. This is a remarkably comfortable notebook to use. Remember how I cooed over the soft silicone palm rests on the Pixelbook? Well, the carbon fiber composite Dell uses is almost as silky, and it covers the entirety of the keyboard. The keys have great spacing and a lot of travel, and they're springy, while the deck stays rigid. Some might find the keys a bit mushy, but to me it's a relief after too much time spent on the new MacBook Pro. I have no complaints about the precision trackpad either. It just works. And same for the embedded fingerprint sensor. This'll run you an extra $25 at checkout, but it's well worth it. Up on the top half of the machine, Dell keeps delivering. The display is big and bright, and the hinge is stiff enough that there's only a little wiggle when you use the touch screen. Unfortunately, that tight hinge means it fails the one-handed opening test. You can't get something for nothing. Oh, and \"Fumble Fingers\" Fisher is relieved to report that the aluminum casing takes a fall well. I dropped it about four feet onto linoleum by accident, and functionality isn't affected at all. On the downside, I did scuff it up a bunch and loosened a seam in the casing that I hope is as simple to fix as tightening a screw. Sorry, Dell. Inside that case are some impressive specs. My model is the top-end refresh for late 2017, with an 8th-generation Core i7, faster RAM, and an optional one terabyte SSD. Obviously, this configuration is the most expensive available. There are alternatives with i3, i5, and older i7 CPUs. My software experience has been largely good, echoing what Daniel Rubino reported from his time with the machine in November. I'll like to his review in the description for all those of who in search of the nitty gritty CPU, GPU performance benchmarks and all that. As Daniel says, this isn't gonna bring the power of a gaming laptop, and it's not designed to. It does keep up with the MrMobile stress test, which is nothing more than me using it as I regularly use every machine, with way too many programs open at once, and far too many tabs active in Google Chrome. Even under this kind of load, the XPS 13 performed as it should, and to my great surprise, it lasted a while too. Spending my whole day writing in Chrome, with between six and 12 tabs open and screen brightness at 75%, I got seven and a half hours of work done before the 15% warning. That's without a lunch break. Considering how little I was doing to conserve power, that's pretty great! My complaints you've probably heard before. The webcam is located in a very nasty place if you don't want to look ridiculous on Skype calls. So buy an external webcam if you do a lot of those. Also, Dell ships this thing with a fair amount of branded software that's frequently bothering you to do Dell updates in addition to the Windows updates, which are already the worst part of any windows machine. And while the speakers are loud, they do start rattling at even half volume, depending of course on what you're listening to. And yes, this was before I dropped it. (sentimental music) Those quibbles aside, there are two main things that would give me pause about buying this notebook: the price to get the top-shelf modeled here, which is $1,499; and the looming arrival of its replacement I mentioned earlier. But that replacement isn't gonna have the ports this one does, and the price comes down quickly once you come closer to the middle of the pack. I don't think I'd buy the XPS 13, as I tend to like something a little less conservative in design. But for someone who needs a workhorse, I agree with Windows Central, it's hard not to like this thing. This video was brought to you by Thrifter, a new way to save money by shopping based on value and not hype. For deals on everything from technology to home goods to gadgets to fashion, visit thrifter.com and tell them MrMobile sent you. Folks, I'll be in Las Vegas soon to see those new Dell laptops and everything else at CES 2018, and I'll be covering it all on Instagram. Be sure to follow me there @theMrMobile so you don't miss it. And please subscribe on YouTube as well. Until next time, thanks for watching, happy New Year, and stay mobile, my friends.",
    "transcript_keywords": [
        "Dell",
        "Dell laptops",
        "Dell XPS",
        "XPS",
        "workhorse",
        "carried Dell laptops",
        "machine",
        "friends carried Dell",
        "thing",
        "carried Dell",
        "great",
        "Dell updates",
        "Dell manages",
        "laptops",
        "Dell drops",
        "year",
        "Windows",
        "composite Dell",
        "Dell ships",
        "ports"
    ],
    "transcript_entity_values": [
        "25",
        "GPU",
        "Daniel Rubino",
        "Instagram",
        "Dell",
        "half",
        "13-inch",
        "SSD",
        "seven and a half hours",
        "15%",
        "USB-C",
        "11-inch",
        "Pixelbooks",
        "October",
        "MacBook Pro",
        "2018",
        "Skype",
        "USB Standard-A",
        "between six and 12",
        "YouTube",
        "a year",
        "75%",
        "XPS",
        "New Year",
        "Fumble Fingers\" Fisher",
        "8th-generation Core",
        "13",
        "Windows Central",
        "RAM",
        "first",
        "XPS",
        "Compaq",
        "jack",
        "1,499",
        "two",
        "CPU",
        "next year",
        "late 2017",
        "Google Chrome",
        "Geordi La Forge",
        "Las Vegas",
        "Surface",
        "just a couple weeks",
        "XPS 13",
        "CES",
        "Windows",
        "TechRadar",
        "Chrome",
        "MrMobile",
        "Thrifter",
        "November",
        "Daniel",
        "SD",
        "one",
        "about four feet",
        "Pixelbook"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "TIME",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "GPE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERCENT",
        "ORG",
        "EVENT",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON"
    ]
}