{
    "id": "siTDA-n1hFg",
    "title": "iPhone 6S Battery Case - Design Failure?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2015-12-09T03:59:10Z",
    "video_url": "https://www.youtube.com/watch?v=siTDA-n1hFg",
    "category": "Science & Technology",
    "tags": [
        "iphone 6s battery",
        "iphone 6s battery case",
        "iphone 6s",
        "battery case",
        "smart",
        "smart battery case",
        "apple",
        "iphone 6",
        "iphone 6 battery case",
        "case",
        "battery",
        "IPhone (Video Game Platform)",
        "Smartphone (Video Game Platform)",
        "Battery (Invention)",
        "Review",
        "unboxing",
        "unboxtherapy",
        "unbox therapy",
        "apple inc. (publisher)",
        "iphone",
        "mophie",
        "holiday gift guide",
        "mophie juice pack air",
        "iphone case",
        "iphone 6 battery life",
        "iphone 6s battery life",
        "stocking stuffers",
        "incipio offgrid express"
    ],
    "views": 2457888,
    "likes": 56833,
    "comments_count": 7157,
    "description": "iPhone 6S Smart Battery Case - One of the strangest designs I've ever seen from Apple.  TYLT battery backups -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/1HTZc9a",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "(slurping inhale) - Bam! What's up guys? Lou here back with another video. And as you can tell in front of me I have Apple's latest creation, the iPhone 6s Smart Battery Case. I saw pictures of this thing this morning, and I was like, \"Jack, you know what? \"We're makin' a video. \"I got a few words to say. \"Just a couple.\" All right, more than a couple. These things look weird. I'm sorry. Apple was sitting in the factory, and they were like, \"Hey, we gotta bunch of leftover rectangular batteries. \"What are we gonna do with them? \"Idea. Battery Case!\" Not only the iPhone battery in the case of the 6s is pretty small to begin with for a phone that size, but then it's like when you come up with a solution, it's such an awkward approach, it looks like an afterthought. There's this big giant lump on the back, OK. There's no other way to describe it. And I'm not sure why that is done the way that it is but this is what we have. This is what we're dealing with. I believe right now it's only available for the 6s. I have the two colors in front of me, Black and White. Let's open 'em up. These babies are a hundred bucks each. Hundred bucks. So there's a little bit of weight there. Some soft. Some soft inside. A lightning connector. Little cut-out for the speaker, microphone, headphone. A lightning connector on the bottom to charge this guy up. It's got like a rubberish feel to it, and it's not too hard. It's kinda bendy actually. I mean I'm thinkin' that thing's gonna get dirty. You put that baby in blue jeans or somethin', or you give somethin' like this to Jack, forget it. Spaghetti sauce, gravy. And now you can really appreciate (laughing) that plateau. Super weird. Let's insert an iPhone 6s, so you just sort of fold the top a little bit, and slide it in. OK, so you can see here, iPhone battery status, 53 percent and charging. Case status, 73 percent. So this is really the only benefit over other iPhone battery cases is that we can see the status right here. I much prefer to carry around a separate battery back-up, like a little, could be a little rectangular box. I much prefer to have something dedicated that I can stick in my pocket, and then get some juice, and then put it away. Let's try the white one out. It's such a weird thing that's happening in smart phones right now, where everybody battles to get the thinnest phone, works out all these weirdo hacks to get more battery for that phone that really is lasting for nobody. This phone doesn't last a day for me. Doesn't last a day for Jack. Me and you. A wide variety of users and a wide variety of usages, things people do on their phones, and everybody's ending up in the same place, halfway through the day and needing to plug in. I'm getting a phone call right now. Hello, how do you feel about the battery life on you iPhone? Horrible! Does it make it through a day? Yeah, OK evening, dinner time, you're already ready to recharge. You're proving my point right now in this video. Real world scenario happening for you in real time. Would completely be fine with a slightly thicker device, but this is what we get instead. We get Mount Rushmore over here. My recommendation. Just go for one of those battery back-ups. Let me get mine real quick. Just before I go. This one is cool because it has built-in cables. So you got a built-in lightning cable, built-in micro USB. Another option is one like this, even smaller. (exhaling breaths) Mount Kilimanjaro. Kilimanjaro or Kilimanjaro? (laughing) That's table mountain. Nobody could've called this. If you asked a million designers to draw up what an Apple Battery Case would look like, an iPhone 6s Battery Case would look like, I don't know that anybody could have predicted this. This is shocking stuff right here guys. Little fired up. And then you gotta put it in your pocket? I'm gonna do a pocket test. Pocket test real quick. Like these are not super skinny or anything. Jack, stay away from my junk, OK? Eeewww! Look at all that lint and stuff. Are you seeing that right now? It just picked up like all the fabric on it. OK, this white material, forget it. That's a nightmare already. I just put, that's one time in. Yeah but this one's not gonna get as dirty. I mean it still picks stuff up. I just don't see how spending a hundred dollars on this makes sense. I just, I don't know. I personally would not recommend it. Al right. There you have it. Apple's take on the phone battery case. Today is a weird day my friends, but I'm happy to share it with you. Thanks very much for watching. If you guys enjoyed this video, make sure to leave a thumbs up down below, and I will catch you very shortly on the next episode. Later guys.",
    "transcript_keywords": [
        "Battery Case",
        "Battery",
        "Case",
        "iPhone",
        "iPhone battery",
        "phone",
        "Apple Battery Case",
        "Jack",
        "iPhone battery cases",
        "phone battery case",
        "Smart Battery Case",
        "day",
        "Apple",
        "video",
        "weird",
        "guys",
        "pocket",
        "put",
        "Real",
        "Kilimanjaro"
    ],
    "transcript_entity_values": [
        "6s",
        "iPhone",
        "73 percent",
        "Hundred bucks",
        "the day",
        "53 percent",
        "USB",
        "Mount Rushmore",
        "Today",
        "Apple",
        "Lou",
        "Jack",
        "Black and White",
        "a hundred bucks",
        "two",
        "this morning",
        "Mount Kilimanjaro",
        "Kilimanjaro",
        "evening",
        "one",
        "a hundred dollars"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PERCENT",
        "MONEY",
        "DATE",
        "PERCENT",
        "ORG",
        "LOC",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "TIME",
        "LOC",
        "LOC",
        "TIME",
        "CARDINAL",
        "MONEY"
    ]
}