{
    "id": "SKX0G4tBtCE",
    "title": "Grand Opening Apple Store Tower Theater with Tim Cook! 📍 Los Angeles, CA",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-06-25T02:19:52Z",
    "video_url": "https://www.youtube.com/watch?v=SKX0G4tBtCE",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 741986,
    "likes": 32010,
    "comments_count": 1808,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(calm ambient music) - I was first in line, I got here at 6 a.m - You were first in line? - Yeah, yeah. I've been going every once since 2001 I've always had a huge respect for Apple retail. I'm from New Jersey. So I've been in all once, in like Manhattan. Being first in line for an Apple Store opening is sort of like being in the first roll of the rollercoaster. You know what's coming, this guy know what's coming, that guy knows what's coming, but I get to see it first. - 5... 4... 3... 2... 1! (Apple Store employees cheering) - Tim is here and he's greeting everybody at the front of the store. This is incredible. (calm ambient music) Hi, Tim! It's so great to see you - How are you? - Congratulations! The store is beautiful - Thank you. - It's amazing, thank you so much. (upbeat electronic music) (crowd cheering ad clapping) I'm crying. I can't even handle it. Oh, my God. I'm shaking. The Tower Theater is such a special location and it's such a huge part of Los Angeles history. And this is also one of the largest restoration projects that Apple has ever done to date for one of their iconic storefronts. This theater was originally designed in 1928 by theater architect S. Charles Lee. It was one of the first theaters in Los Angeles wired for film with sound, and it was also the first theater with air conditioning. It was officially closed as a theater in 1988, and it was used very rarely for concerts or film shoots. And now its history has been brought back to life by Apple. I was able to see the store the day before the grand opening and being able to just really admire the attention to detail in this restoration. It was incredible. (calm ambient music) (calm ambient music continues) One of the cool things to know is they really did try to keep as much original pieces in this place as possible, so all of this obviously has been restored, but there are new hand railings and things that they had to put in place. So you can tell that they kind of tried to keep the same look, but not try to mimic the old style too much. (calm ambient music) Tyler just asked me if I have anything to say. I am actually speechless. I know, it's surprising. I've been to a lot of Apple stores, but this doesn't feel like something that's real. Like everything just looks absolutely beautiful. This feels like just some sort of European vacation in Los Angeles. I guess I did have something to say (laughs) (cheerful electronic music) The attention to detail, like everything has been completely restored, like I was watching some of the videos that they have of the restoration process. It is unbelievable the amount of things that they have done to this place to make it what it is today. (cheerful electronic music) Have you ever seen somebody unbox all seven colors of these iMacs? - (Apple Store employee faintly speaking) - Um... Here's two historic theater seats, this are actual seats that were in the theater. They... I think had been cleaned. The crazy thing is everything looks so old, but yet it's also clean and new, so it's really confusing in my mind. They've added a lot of accessibility features, so on lot of these displays they have braille under old art pieces. So this place previously was all steps. There were no elevators, so they did install some elevators so it's easy to get into the store for accessibility. And over here, they have some nice areas. That'll take you right from the elevator and you wait for your Genius Bar appointment. I thought there was going to be cup holders here just because that's the type of person I am, but even better: there's outlets. (happy ambient music) - I'm leaving, but like, I'll be back. Oh, oh... Oh, gosh. I'm here forever! (laughs) - (guard laughs) - Thank you! [guard] You're very welcome (upbeat electronic music) - Oh, my God! Today is the day that the Apple Store Tower Theater is opening. This is the grand opening, like this is it. There are people waiting in lines. There are some really fun surprises. I saw Brian this year and also Crystal, let's go say hi! So the last time I saw you was on CES, - It's been a while - In January - That's right - We were all masked up, not vacced yet and we had to stay very far away. - I know! Not anymore. Are we allowed to do this? - We're hugging - Yeah! - This is amazing. - Okay, you know what's crazy about this? Being in an Apple Store, working there ten years and now being here at a grand opening. And we've been at other kinds of launches, I think like Meet at the iPad launch before. - Yes, it was the original iPad! - Yes, yes! - I mean, I have that clip! - So it's just kinda fun that like we're here. - I know! We met on MySpace. - Okay. - Okay. - Okay. - I just wanna say... - I honestly didn't know if you ever remembered that. - No, of course! Yes! I grew up in the middle of nowhere, nobody liked the things that I liked, so I literally was on MySpace trying to find other people that liked Apple. - And this was before YouTube, this was before anything - Yeah. - So we were like e-pen pals. - I was like \"Oh, my gosh, this dude, he's so cool. He works at an Apple store\". - Yeah, that was so crazy. - And then... Here we are like, that's kind of crazy if you think about it. - Here we are - I mean, that was 2000. - Oh, I don't know... That had to be like 15 years ago. (calm ambient music) - Okay. So crystal is here as well. - Hi! - This is so weird. I haven't seen you in so long. - I know, it's been a while! Like probably one of the WWDC's a couple of years ago now. - Yeah, that's a... wow. So now we're here, how's it going? Are you excited about this? - I'm excited. I feel like this is so different and new right now. Like just seeing people in general is exciting. - Yeah. And were celebrating an Apple store launch. I mean, this place is beautiful. It's... - Oh, my gosh! - I'm so excited. - I haven't seen any of the inside yet, so I was very, very excited. I know it's a lot of history behind it, a lot of culture in it too, so... - We're going in. - Let's do it! - Very soon. Are you excited? - Yes! Hell, yeah! - Dude, Tim is up there! - I heard we're gonna get gift bags. - Okay. I didn't hear that. I'm in tears, no joke. Like this is so emotional, like actually seeing people for the first time at the Apple store. I love all of your classes! I'm so excited to meet you all. Could we get a picture? - Yeah! - Okay, yey! - Get in the middle - Yeah! (cheerful ambient music) Apple Fitness has basically changed the way that I'm able to work out, and I'm so glad it's so accessible to everyone. (cheerful ambient music) (cheerful ambient music continues) - So I just got off the store It was honestly so emotional, I started crying because it was just, not only is the store incredible, but just seeing so many people happy and after not seeing people for so long, just being able to see people happy and enjoying something again was honestly so overwhelming. The store's amazing and I hope that you guys get a chance to check it out. I'm overwhelmed. I'm so happy. Oh, what a great time. (cheerful ambient music)",
    "transcript_keywords": [
        "Apple Store",
        "Apple",
        "Store",
        "Yeah",
        "Apple Store Tower",
        "Theater",
        "Los Angeles",
        "Apple Store opening",
        "Store Tower Theater",
        "people",
        "Apple store launch",
        "excited",
        "Tower Theater",
        "lot",
        "place",
        "opening",
        "Los",
        "Angeles",
        "Tim",
        "things"
    ],
    "transcript_entity_values": [
        "a couple of years ago",
        "one",
        "iPad",
        "6 a.m -",
        "2",
        "1988",
        "S. Charles Lee",
        "The Tower Theater",
        "Apple",
        "European",
        "2001",
        "CES",
        "Crystal",
        "Tim",
        "MySpace",
        "Today",
        "2000",
        "1928",
        "the day",
        "MySpace",
        "Los Angeles",
        "Brian",
        "4... 3",
        "Manhattan",
        "Genius Bar",
        "Apple Store",
        "Apple Fitness",
        "today",
        "iMacs",
        "this year",
        "two",
        "seven",
        "YouTube",
        "ten years",
        "Tyler",
        "first",
        "15 years ago",
        "the Apple Store Tower Theater",
        "January - That's",
        "New Jersey",
        "1",
        "One"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "NORP",
        "DATE",
        "ORG",
        "EVENT",
        "PERSON",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "CARDINAL",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "ORDINAL",
        "DATE",
        "FAC",
        "DATE",
        "GPE",
        "CARDINAL",
        "CARDINAL"
    ]
}