{
    "id": "SLqx8m6KOxg",
    "title": "Apple just killed M1 - WWDC 2022",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-06-07T08:17:57Z",
    "video_url": "https://www.youtube.com/watch?v=SLqx8m6KOxg",
    "category": "Science & Technology",
    "tags": [
        "apple",
        "wwdc",
        "2022",
        "apple silicon",
        "m1",
        "m2",
        "mac",
        "macbook air",
        "macbook pro",
        "stage manager",
        "ipados",
        "ios",
        "ipad",
        "macos",
        "iphone",
        "facetime",
        "carplay",
        "DDR5",
        "bandwidth",
        "GPU",
        "CPU",
        "SoC",
        "processor",
        "developer",
        "maps",
        "notch",
        "webcam",
        "watch",
        "watchos",
        "ventura",
        "live text",
        "cache",
        "prores",
        "h.264",
        "h.265",
        "8k",
        "fast charge",
        "magsafe",
        "center stage",
        "passkey",
        "collaboration",
        "freeform"
    ],
    "views": 2002773,
    "likes": 64147,
    "comments_count": 3357,
    "description": "Get $25 off all pairs of Vessi Footwear with offer code LinusTechTips at   Get 15% off your order and get dad something nice at   Apple Silicon Mac Announcement - Slow Motion Dumpster Fire  Discuss on the forum:     GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:53 M1, meet M2 3:37 New MacBook Air 5:48 macOS 13, iPadOS 16, and iOS 16 6:05 Stage Manager (macOS, iPadOS) 7:10 iPad Desktop-class apps 7:45 Collaboration, Freeform, and creativity features 8:49 Gaming...? Metal 3 now with upscaling 9:46 Passkeys - No more passwords 10:35 New iOS lock screen and live objects 11:19 Spatial audio tuning, Continuity Camera, and FaceTime handoff 12:31 Next-gen Carplay + Rapid-fire 13:55 Conclusion",
    "description_links": [
        "https://www.Vessi.com/LinusTechTips",
        "https://www.ridge.com/LINUS",
        "https://linustechtips.com/topic/1435708-apple-just-killed-m1-wwdc-2022/",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- If I'm Intel right now, I am scrambling. Apple doesn't usually announce hardware at WWDC, but they famously announced the transition to Apple silicon in 2020. And today, before they've even completed their transition, they announced the next-generation M2. And it might just impact the industry like Linus impacts hard drives. Of course that's not even all they announced. So let's get into it, shall we? Right after I announce this video's sponsor. - Ridge. Time to ditch that bulky wallet. A Ridge wallet can hold up to 12 cards, comes with your choice of cash strap or money clip, and makes a great gift for dad. Get 50% off until June 8th at Ridge.com/Linus. Someone get me one, I'm a dad. (techno music) (techno music intensifies) - The most exciting news for the computer industry to come from WWDC has to be M2. Arriving in new MacBooks due out next month, M2 puts a one-and-a-half year cap on M1's extraordinary debut. Love it or hate it, M1 was, is impressive. And while there are still teething pains, this next-gen hardware looks even better. Built on what Apple calls second-gen 5-nanometer technology, Apple is boasting a CPU with 33% larger cache for its performance cores. This, along with significant enhancements to the efficiency cores works out to roughly 18% more raw CPU performance than M1, according to Apple's \"select industry-standard benchmarks.\" I'd recommend only looking at the M1 versus M2 performance graphs here, because, well, Apple's efficiency and power curve graphs are basically worthless without knowing how they're drawing those curves, 'cause they do not look that way. There is a new Media Engine that Apple says handles even faster ProRes decoding support, which is just bonkers. And they're claiming that it's now capable of handling 8K H.264 and H.265, something that I recently found lacking with the M1. In terms of GPU performance, the M2 gets access to an extra two cores, that, along with an updated memory controller with half again more bandwidth, works out to a 35% performance improvement over M1, again in \"select industry-standard benchmarks.\" That beefed-up memory controller lets the M2 SoC address up to 24 gigs of memory, which sounds like they're using an odd channel arrangement, like Intel did back in the first-gen Core i7-900 series. In fact with a 50%, yeah, yeah, that sounds about right. It's tough to put this in perspective, because quite frankly, Intel, and AMD for that matter, don't have anything that we know of that can really come to blows with this. Both their platforms are geared towards a more modular approach, but as we've seen, even the best APUs don't hold a candle to the M1, thanks in large part to how tightly integrated it is. It's tough to see a future where the industry fails to follow Apple's lead here. What's more, if we assume M2 will follow the same pattern as M1, then M2 Pro should get access to 48 gigs of system memory. M2 Max, 96 gigs. And M2 Ultra, a massive 192 gigs of total system memory available to both the CPU and GPU cores. PCs do still have the high-end workstation and server market. Those theoretical M2s aren't quite Mac Pro territory yet. And Apple's still mum on when the new Mac Pro will be coming. They weren't shy about introducing new M2 hardware, though. Interestingly, none of the listings that were put up early on B & H ended up making the cut. The first up is a redesigned MacBook Air that takes after the 14-inch MacBook Pro here, doing away with the wedge shape, but maintaining a thinner profile than the thickest parts of the old Air, and coming in a hair lighter. At 1,199, it's a little more expensive than we'd like, but the M1 Air is still available for 999. For the extra spend, you're not only getting M2, but a 500-nit Liquid Retina display, complete with a notch housing a 1080p FaceTime camera, MagSafe, and a new four-speaker sound system that somehow supports spatial audio despite firing from the rear. If you buy the more expensive model with the 10-core GPU and 512 gigs of storage, your choice of a handy dual-port 35-watt or a single-port fast-charging 65-watt power adapter that can do 50% in 30 minutes, is on the house. Otherwise it's a $20 upgrade for either of them from the basic 30-watt. I guess they just couldn't get the costs down enough on the base model. Either way, it looks like you'll be getting a color-matched MagSafe charging cable to go with the four available finishes, so that's kind of neat. What's a little strange is that Apple is also adding M2 to the 13-inch MacBook Pro with Touch Bar. I guess they either still have more of those chassis lying around that they need to get rid of, or people just really like the design. I know there are some that are religious about it. Either way, Apple claims that the Pro's integrated cooling allows for the M2 to reach its full potential, a claim that we'll have to put to the test once we get our hands on them. Like the new Air, the refreshed Pro is supposed to launch next month, starting at 1,299 for 8 gigs of RAM and 256 gigs of storage. Interestingly, the up-model version is the same price and specs as the up-model Air, which pushes me towards the Air being the better buy in that case. But again, we'll have to see. We'll have them linked below in case you want to check them out. Since it's just a refresher of an existing SKU, there's really not a whole lot else to say about it for now. Which isn't something I can say about the macOS/iOS/iPadOS ecosystem. The newest macOS, named Ventura, contains some interesting new features that are mostly shared throughout the entire lineup. In fact, pretty much none of it is exclusive to macOS. Stage Manager is an interesting window management feature that creates a second vertical dock of open apps on the left-hand side of the screen, where only the open windows in the current app are shown. You can drag windows from one stack onto the screen, and then add it to the current stack, and like Windows 11's window groups feature, their size and layouts are remembered as you switch between them. The difference here is that they're not tiling. But what's fascinating about this is that it's also coming to the iPad, allowing, for the first time for an iPad, full window management, including windows over windows, resizing, the whole nine yards. It goes even deeper for iPadOS, because now you have full external display support. No longer are you limited to a clone of the current non-standard display resolution, but you get a fully-extended desktop at the display's native resolution that you can drag windows into. It's not quite macOS yet, but this is the kind of quality-of-life feature that has been sorely missing from iPadOS, and something that I have been asking for for a long, long time. What's gonna make this even better are system-wide enhancements Apple's referring to as desktop-class apps, which includes things like a system-wide undo and redo system, enhancements to the Files app like changing file extensions and getting folder sizes, inline find-and-replace, and even customizable toolbars, with an API that makes all of this accessible to third-party developers. In fact, pretty much all of the new features Apple talked about are available to third parties, including some features that were previously Apple-only, like the new enhanced Maps views for cities, the Weather app, and the new Collaboration feature. Collaboration is what it sounds like. It turns any compatible app into a live workspace, with its own message threads and realtime activity updates, kind of like a shared Google Docs file. Collaboration can be accessed directly via the Share Sheet. And if shared to a group, it automatically pulls everyone in. Alongside Collaboration is a new concept called Freeform, which is basically a giant whiteboard that supports multimedia, as well as what Apple calls a full complement of drawing tools, including Apple Pencil support. I can see this being used a lot by artists looking to do group art. I mean, it used to be a thing back with old versions of openCanvas, and more recently with Drawpile. And those artists with Apple Pencils can now be assured that they're in a color-accurate environment, thanks to a new Reference Mode for iPad. And they can give themselves more room to work with by adjusting the iPad's display scaling. These improvements might sound like little things, and it's surprising it's taken this long, but make no mistake. These are huge, and turn iPad into an even more viable tool for a lot of people. And when they're done with work, gaming is getting an overhaul across the ecosystem, with the Metal 3 API. Now, granted that I'd prefer that they went with something a little bit open, and just picked up Vulkan, but they did show off two major new components: MetalFX Upscaling and a Fast Resource Loading API. Both do what they sound like, with MetalFX Upscaling performing a temporal and spatial upscale of the rendered scene, like DLSS and FSR do, and Fast Resource Loading pulling assets from the SSD directly into video memory, a la DirectStorage. The first title to support Metal 3 that was shown off is Resident Evil Village, which is due out later this year. It's tough to make a call on how effective it is over stream, but upscaling makes a lot of sense on small displays, like those on the iPad and especially the iPhone. You can trade visual fidelity that you probably didn't even notice to begin with into better performance, better battery life, or both. It's about time. I'd be here all day if I talk about every new feature Apple brought up, but there are some big ones. And first in my mind is Passkeys, a way of accessing websites and services without using a password or even sending the key itself over the internet, effectively negating password phishing attacks. For Linux gurus and advanced Mac folks, private-key authentication instead of using a password is nothing new. But what Apple's doing with Passkeys is making it accessible to the masses. And they're working with the FIDO Alliance to make it an open standard. Passkeys are going to be integrated directly into apps, and sync to the iCloud Keychain on Apple's platforms. And they'll be backed by the Secure Enclave, built into Apple silicon, and presumably T2-enabled Intel Macs with Touch ID. iDevices can use Face ID instead. Speaking of which, the new lock screen. Apple's clearly taking a few notes from Google's Material You here, with the ability to customize the lock screen with widgets and typefaces, and multiple lock screens that function almost like Apple Watch faces that can be tied to specific focuses. These widgets can interact with depth information from photos, to appear behind foreground objects, which can then be moved around at will. Part of another really cool feature that detects objects in photos and lets you select them. It'll be interesting to see how Apple handles this, because cutting stuff out like that is a difficult effect to get just right. Kind like how it's tough to get your body temperature just right. But the Swacket is both a sweater and a jacket. It's not too heavy, not too light, LTTstore.com. Which is also true of spatial audio, where the effect really works best if the software knows the geometry of the old melon. Apple didn't really go too deep into it, but iPhones can now take measurements for AirPods that allows them to tailor the effect to the shape of your head, which should make binaural listening significantly more enjoyable for everyone. A curious new feature you might also enjoy is the ability to use your iPhone as a webcam. At first, this seems both obvious and ridiculous. Yes, iPhones have excellent cameras, but clipping one to your display is a bizarre concept. What it gives you, however, is a wirelessly connected webcam that not only has features like Center Stage and portrait modes, but can also do simultaneous multi-cam, and not the one you might think. The demo they did on stage looks a little too good to be true to me, but basically you can get both the normal angle and a desk angle simultaneously, thanks to the ultra-wide lens on newer iPhones, and some undistort software trickery. Thankfully, if you don't want to bother with that, you can now hand off FaceTime calls between your devices, which is a more common thing to want to do than you might think. Speaking of software trickery though, Apple's putting Tesla on notice with next-gen CarPlay, which is basically a preview for that Apple Car we keep hearing about. Not content with just the media console, now the iPhone is going to take over your entire vehicle, including the instrument cluster, which can then be themed in a way that's similar again to Apple Watch faces. CarPlay takes over every screen and communicates directly with the vehicle to display speed, tachometer, and even maps or widgets on the dash, provide climate controls and media controls on the center and passenger displays. And probably more. Like, oh, there's just so much. This event was two hours long, you guys. They talked about privacy features like Safety Check that can help people escape abusive situations by unsharing everything and logging out of all their devices. Live sports updates and play highlights and Apple News. Easier child account management for parents, with quick setup of new iDevices. Being able to edit and unsend messages and mail. The Fitness app is on iPhone now too. Spotlight can search Live Text in images, with full-window rich results. Oh, and Live Text from video, which means you can finally get code snippets or recipes or whatever, without leaving to take a screenshot. That doesn't even cover everything. Like, here's a list of all the other stuff that I can think of, off the top of my head. It's probably not even exhaustive. Ultimately, WWDC is for developers first, and while a lot of it felt like it was directed at consumers, virtually every major feature has an open API. While I would say that the ecosystem enhancements overall represent more of an iterative approach than a revolutionary one, things like Stage Director could completely change the game for productivity, especially with single-display workflows and even more, especially on the iPad. Now, M2 is a little more up in the air for me. If Apple's claims are accurate, then it represents a solid improvement over M1. I appreciate that almost as much as I appreciated the snark about Apple's marketing department coming up with the name. What, you expected a sponsor segue? Well, if you insist. Like I insist on our sponsor. - Vessi. Vessi footwear is known for being lightweight, easy to pack, comfortable, and most importantly, waterproof. Vessi's Everyday Move shoes are here, and they're designed to keep you moving. With enhanced breathability and added support, this style is perfect for the adventurous, or those looking for something sportier, like me. Featuring a pull tab to take them on and off with ease, vegan suede lace cages, extra midsole cushioning, and the same waterproof Dyma-Tex technology, you'll wanna wear them everywhere. Maybe even in your house, like Jerry Seinfeld. The Dual Climate material will keep your feet warm during the winter and cool during the summer. So stay dry, and get your Vessi shoes today at Vessi.com/LinusTechTips, and get $25 off using code LinusTechTips at checkout. - Thanks for watching, guys. Go check out our reaction to the WWDC in 2020, where Apple announced M1, where we called it a \"slow-motion dumpster fire.\" (laughs) Oh, we of little faith. Enjoy.",
    "transcript_keywords": [
        "Apple",
        "Apple Watch faces",
        "Apple Watch",
        "Pro",
        "Apple Pencil support",
        "Air",
        "feature",
        "Apple calls",
        "Mac Pro",
        "features Apple talked",
        "features Apple",
        "Apple claims",
        "Apple announced",
        "including Apple Pencil",
        "Apple silicon",
        "gigs",
        "display",
        "feature Apple brought",
        "windows",
        "iPad"
    ],
    "transcript_entity_values": [
        "Jerry Seinfeld",
        "Apple Pencils",
        "one",
        "1,199",
        "MacBooks",
        "500",
        "Vessi",
        "SSD",
        "Center Stage",
        "1,299",
        "next month",
        "the Share Sheet",
        "iPhones",
        "iPad",
        "GPU",
        "iPhone",
        "Apple News",
        "WWDC",
        "Mac",
        "AMD",
        "Weather",
        "Dyma-Tex",
        "20",
        "96",
        "Linus",
        "MacBook Pro",
        "256",
        "the summer",
        "24",
        "half",
        "the Secure Enclave",
        "Passkeys",
        "512",
        "Freeform",
        "MacBook Pro with Touch Bar",
        "an extra two",
        "Apple",
        "first",
        "25",
        "M2",
        "M1",
        "SoC",
        "T2",
        "33%",
        "Fitness",
        "M2",
        "Swacket",
        "M2",
        "Metal 3",
        "CPU",
        "Windows 11's",
        "roughly 18%",
        "Intel Macs",
        "third",
        "50%",
        "Intel",
        "192",
        "LinusTechTips",
        "Apple Pencil",
        "the FIDO Alliance",
        "1080p",
        "four",
        "Ridge",
        "macOS",
        "Google",
        "iPhones",
        "Apple Watch",
        "M2s",
        "nine yards",
        "Vessi",
        "SKU",
        "FaceTime",
        "all day",
        "AirPods",
        "Alongside Collaboration",
        "the macOS/iOS",
        "35-watt",
        "Vulkan",
        "Touch ID",
        "up to 12",
        "M2",
        "B & H",
        "FSR",
        "10",
        "DLSS",
        "13-inch",
        "The Dual Climate",
        "5-nanometer",
        "WWDC",
        "30 minutes",
        "48",
        "Mac Pro",
        "14-inch",
        "M1 Air",
        "iDevices",
        "two",
        "API",
        "M2 Pro",
        "M2 Max",
        "MagSafe",
        "2020",
        "999",
        "35%",
        "second",
        "two hours",
        "MacBook Air",
        "Fast Resource Loading",
        "65-watt",
        "Resident Evil Village",
        "Ventura",
        "30-watt",
        "Drawpile",
        "today",
        "June 8th",
        "Live Text",
        "RAM",
        "Google Docs",
        "8",
        "Tesla",
        "Media Engine",
        "ProRes",
        "later this year",
        "Linux",
        "Air"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "LAW",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "NORP",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "FAC",
        "PERSON",
        "PRODUCT",
        "LAW",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "ORDINAL",
        "TIME",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "GPE",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "ORG"
    ]
}