{
    "id": "sMTs5bvAsGA",
    "title": "$100 vs $1200 Headphones - 7hz x Crinacle Salnotes Dioko & Audeze Euclid Review",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-02-20T18:39:29Z",
    "video_url": "https://www.youtube.com/watch?v=sMTs5bvAsGA",
    "category": "Science & Technology",
    "tags": [
        "headphones",
        "ltt",
        "linustechtip",
        "audese",
        "audizy heaphones",
        "dioko",
        "crincale",
        "crinacle",
        "apple airpods",
        "cheap vs expensive headphones",
        "earbuds",
        "best earbuds",
        "planar magnetic earbuds",
        "DubbedWithAloud"
    ],
    "views": 1726435,
    "likes": 61240,
    "comments_count": 4364,
    "description": "Check out Thorum using the link below and get 20% off by using the code LTT at checkout:    Airpods are expensive and will only last you a few years. Well, that's true of all wireless earbuds. So why do we keep buying them? Convenience probably. But when you are spending tons of money on something, you want it to last right? Well that's a big reason why WIRED headphones are making a comeback. We take a look at some entry-level planar magnetic earbuds, the 7hz x Crinacle Salnotes Dioko and compare them against the flagship Audeze Euclids. Just how good can $100 dollar headphones be?  Discuss on the forum:   Buy Audeze Euclid IEMs:   7Hz x Crinacle Salnotes Diokos IEMs:   Buy Sennheiser IE 600 IEMs:   Buy Sennheiser HD 600 Open-Back Headphones:   Buy a Pelican 101 Micro Case:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:13 What is Planar Magnetic? 3:39 Unboxing Audeze Euclid 5:17 Unboxing 7hz Salnotes Dioko 7:38 Objective Sound Analysis 9:01 Subjective Sound Analysis 10:35 Some Complaints 11:25 Why $1200? 12:33 Wireless problems 16:02 Outro",
    "description_links": [
        "https://www.thorum.com",
        "https://linustechtips.com/topic/1489461-100-vs-1200-headphones/",
        "https://geni.us/8JcXF",
        "https://geni.us/8DFk8G",
        "https://geni.us/LaT4wY2",
        "https://geni.us/MnQhff",
        "https://geni.us/jG1k",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- When this happened, earphones with wires went out of style, practically overnight, but Bluetooth headphones aren't perfect. There's the connection issues, the poor repairability the lackluster audio quality, the limited battery life, the list goes on, which is why the wire has been making a big comeback lately. But what to buy? The best selling wired earphones on Amazon, are these. They're certainly affordable, but they sound like crap. These, meanwhile, use premium planer magnetic drivers, for audiophile grade sound, but they cost a month's rent. Where's the middle ground, right? Right here. Now, I was skeptical that a $100 pair of headphones, could possibly offer similar performance to a pair that costs over a thousand, but then I heard they were tuned by the one and only Crinacle, and that you can turn these wireless, for a total cost that is less than a pair of AirPods, which made me think, \"what's the catch, and where's the message from our sponsor?\" Thorum, Thorum makes elegant rings out of unique materials, from meteorite to dinosaur fossils. Use code \"LTT\" to get 20% off today, and stay tuned to learn more. This isn't the first time we've covered planar magnetic driver technology on this channel, but it's likely the smallest. Now, hold on, Linus, you keep saying those words, \"planar magnetic,\" but what do they mean? Let me explain. Most headphones, well, really, most audio products at all, use dynamic drivers. A dynamic driver consists of a coil of wire, that is attached to a flexible diaphragm. Typically a cone, like in this woofer, or a dome, like this tweeter. (words tweet) The coil is surrounded by magnets, and is suspended in the magnetic field. When an electrical signal is applied to the coil, it moves back and forth, translating its vibrations to the diaphragm, which then moves the air around it, creating sound Planer magnetic drivers, on the other hand, use a flat diaphragm, made of lightweight plastic, typically, with thin conductive wire, etched along the surface. The diaphragm is positioned between two magnets, on either side of the driver, and these magnets move the entire diaphragm at once. Why is this beneficial? Well, in a nutshell, it offers more precise control over the diaphragms movement, reducing distortion, and contributing to the planer magnetic driver's unique sound signature, which is often described as \"clean\" and \"punchy.\" Planer magnetic drivers also tend to be larger, contributing to superior base response. Does this make planer magnetic headphones automatically better? Not really. Dynamic drivers benefit from a 50 year head start over planer magnetics. So, a lot of engineering and manufacturing expertise has gone into overcoming their weaknesses. Plus, compared to planer magnetics, they're more compact, and they require less power to operate. There's always trade-offs, right? But, anyway, we're not talking about headphones today. We're talking about earphones. Thanks to some recent manufacturing advances, great sounding planer magnetics, can be so small now, that they will fit inside your ear canals. And, over the past couple of years, an explosion of planer magnetic, in-ear monitors, or IEMs, has flooded the market. How does an explosion flood anything? How great do they sound? Well, $1,200 great. According to Audeze, one of the best known innovators in the planer magnetic space. But, how could something so small be so gosh darn expensive, when the competing product is less than a 10th of the price? Let's take a look. The outer box of the Audeze Euclids leaves a fair bit to be desired, but the inside is simple foam-in. Is that a gosh darn pelican case? Like, Pelican brand? IP67 water and dust resistant case? Yes. And, inside that is plenty of goodies, like eight different pairs of ear tips, a cleaning brush, a little pouch to hold all your accessories, and a pair of swapable MMCX cables, that terminate in either a 3.5 millimeter, or 6.35 millimeter TLS connector. \"What's the difference?\" you might ask. Well, for you, the end user, pretty much nothing, in terms of audio quality, other than that one is bigger. Yeah! They also include some pretentious nonsense. Why would you have the user guide on a piece of paper, when you could have it on a card that you can use to spread thermal compound? Very handy, thank you. But, this is not nonsense. Look at these. These gorgeous specimens, consist of a milled aluminum housing with the caps adorned with carbon fiber. These are bound to be a conversation starter when they're in your ear, but they are kind of monstrous. Maybe they won't stand out that much compared to some wireless earphones, but the thing to remember is, guys, these don't have any antennas in them, no batteries. What they do have, though, is an 18 millimeter driver, that is nearly three quarters of an inch. For context, the Sennheiser IE 600s that I liked so much when I covered them on short circuit, used dynamic drivers that are less than half the diameter, which sounds smaller, but in terms of actual area, is less than one sixth the size. But wait, what's that? Is it the sound of an incredible deal from a Chinese audio manufacturer? It is. Let's talk about the 7Hz x Crinacle Salnotes Dioko, an IEM with a long name, and a short price. The much, much lower price doesn't stop them from including six sets of ear tips, and a surprisingly nice carrying case. I mean, it's no Pelican or anything, but it still feels like the sort of thing that could easily be sold for 10, maybe 15 bucks standalone, which is an impressive value. But, are the headphones themselves impressive too? Well, from a design perspective, they sure are definitely something. The outer shell is sapphire coated tempered glass, making them kind of reminiscent of jewelry. It looks kind of like you're plugging your ears with precious amethyst baubles. The body is made of CNC aluminum, and houses a pair of 14.6 millimeter planer magnetic drivers. That is significantly smaller than the Audeze Euclids, but still much larger than the IE600s. Like the Euclids, they come with a nice braided cable, though perhaps not quite as nice, due to the lack of rotation at the earbud, and the less common 2-pin connector. What makes these notable though, is not just the fact that they offer planer magnetic tech at a price that people can actually afford, but the fact that they were tuned by audiophile extraordinaire, Crinacle. He worked with 7Hz, the manufacturer, to create a product that both met his quality standards, and aligned with his sound preferences. (smack sound) - Slap on some of that base. - And, tuning a headphone is no small task. It involves many, many different variables. The dimensions of the driver, the electrical signal processing, the amount of air on either side of the driver, and so much more, and with his reputation as a taste maker I've gotta say, having Crinacle's name attached to a product does give me a lot more confidence that these things won't be crap. Like, this isn't some, you know, athlete celebrity endorsement or something, but, still, confidence isn't enough. Let's send them away to be measured. (earphones hit floor) (funky rhythmic instrumentals) (mic crashes) Oh my. (crew laughs) He had one job. Starting at the low end, We can see that the Diokos have a prominent bump in the subbase, that will provide plenty of rumble and power. Audeze opted to forgo this, which is not inherently bad, but it does show us, right out of the gate, that these two companies have taken a very different approach to their tuning. In the base regions, both headphones look largely the same, meaning that you can expect a similar intensity in the base notes that you hear, rather than the ones that you feel. Then making our way into the upper-mids, our specimens start to diverge again. The Diokos have more presence in the mids, with some peaks near 2 and 3000 hertz, which could make them sound shouty, but could also accentuate upper female vocals. Then there's these peaks at 8,000 hertz, and 10,000 hertz, that could be caused for concern, especially if you're sensitive to sibilance. It means, sounds like \"S\" and \"T\" in speech, could be loud, and instruments like symbols, and crunchy distortion on guitars, could come across as sharp or fatiguing. The Euclids, meanwhile, offer a much milder treble experience. That, to my ears, sounds great. I mean, there is no question that these are audiophile grade. I mean they bloody well better be for $1,200, but really they will impress your snobby friend that only listens to Hotel California, and Steely Dan, and will definitely show you the benefit of the higher audio quality on our videos over at floatplane.com. The Euclids manage excellent detail and smooth response in the upper treble that some might call laid back, but for my ears, felt just right. I'd call them pleasantly warm. I did find the bass a little lacking, making my preferred pop tunes, sound a bit dead, though ballads really shine, and the reality of it is, that's nothing that can't be fixed with all a little bit of EQ tuning. As for Crinacle's offering, well the Diokos have the subbase that I was missing with the Euclids for sure, but I found that the upper base was lacking, like, they rumble but they could use a bit more punch, and those high peaks in the treble range made things detailed, but I found them to be a bit much in some tracks. As for the dipped low-mids, they made even fine male vocalists sound a little boring. The rest of the treble region, though, was detailed and quite delightful. As for the Soundstage, it was fine, and comparable to my ears, to the Euclids. Overall, I actually ended up liking these a bit more, but most of the reason for that came down to comfort, not audio quality. Both of them are massive and heavy, but the Diokos ended up fitting my ear shape significantly better. Although your mileage will almost certainly vary, because they don't even offer any rotation, as I mentioned before, so (nervous groan) they might not work great for you. A nice thing about both of them though, is that they're gonna sound fine whether you're listening from your phone, or a more powerful amp and deck. So, if either of them tickles your fancy, we're gonna have links to them down below, but don't go there before you hear our complaints. compared to Bluetooth headphones, of almost any kind, both of these are feature bare. neither has any kind of active noise cancellation, a button to summon your digital assistant of choice, or even an inline microphone. And, this one's a personal gripe, but neither of them has the little chin cinch cable thingy, that makes you look like a big idiot, but is great for cable managing your body. Also, the Audeze connectors came loose, really easily, making the product feel unnecessarily cheap. I also prefer, by the way, the carrying case of the Diokos. I mean, it's no Pelican brand, and it isn't IP rated, but I mean, I'm the sort of person who would just wrap up my headphones and throw 'em in my bag anyway, so maybe you should just ignore what I have to say about that. Now, at this point, you might be wondering how Audeze has the audacity to charge 10 times the amount for a product that is better, but only marginally so. Well, they've certainly earned the brand reputation for it but there's also the small matter of manufacturing. Audeze builds all of their products, in Costa Mesa, California, which means that they're not only paying US wages, they're paying California wages, meaning that if a pair of headphones were to take just a couple of hours to build and quality control, their labor cost on them would already be beyond the entire sticker price, all in, of the Diokos. I'm not saying that all of Audeze's components are made in America, they almost certainly aren't, or that that would even account for such a large discrepancy in price if they were. But, it's at least something for your consideration, especially compared to the relative opacity of 7Hz's company. Who are these guys? What is Linsoul? Is it a store, a manufacturer, who knows? Something I know for sure, that I haven't addressed, is the earlier claim that I can turn either of these solutions wireless, and I haven't addressed why I would do that either. Story time, my workhorse wireless earbuds are starting to lose battery life, and the idea that I will have to just toss them in a year or two, is pretty disappointing to me. Now, this could be easily remedied by making the batteries replaceable, but Apple, who currently makes up about 40% of the market for wireless earphones, likes it when you buy a whole new set instead of fixing your old ones, and they're just not gonna do anything to fix the situation, unless they're forced by the government. And, as for their competitors, well they have little incentive to do anything differently from Apple. What that means, is that we're about to see a lot of people throwing away their old AirPods, only to replace them with something that will last them, again, anywhere from two to five years, max, before they will be thrown away again. That sucks. Even ignoring the ecological impact, like, let's say you don't care about that, spending hundreds of dollars over, and over, and over, and over again, will add up in the long run. I mean, I've already spent as much on AirPods, as I did on my, now, 10 year old Sennheiser HD 600 headphones. Like my AirPods, I use my HD 600s every day, but unlike my AirPods, they are still in excellent condition and will likely last for 20 or even 30 more years. I mean, it sounds crazy to say that, but it's true. In an industry that is so focused on the next shiny gadget, audio remains one of the few domains where you can buy once, cry once. A good pair of headphones, or earphones for that matter, can and should last you a lifetime, unless they're tied to batteries. Though I do, of course, understand the convenience of wireless earphones. And, I actually wish that both of these came with microphones, and volume controls on the cables, and creature comforts like that. Luckily, you can just unplug them from their cables, and swap in (vocalizes fanfare horns) any cable you like, even one with a Bluetooth adapter and a little battery on it, like this one from Audeze that costs $130. Okay, that's pretty expensive, but you could also buy a cheaper one, that wasn't made in America, and that's how we reached that, \"hey, you can get these and wireless, for less than the price of AirPods\" claim that I made at the beginning of the video. Now, is this an exact analog to modern true wireless earbuds? No, there's no active noise cancellation, there's no handy charging case, and there's still a wire hanging off you to get caught on things, but the Diokos, plus an inexpensive Bluetooth cable, are less than a pair of AirPods and sound markedly better. I'd like to see more options for wireless accessories, by the way, that have replaceable batteries in them. But hey, at least this way, we never have to ditch the earphones, themselves, like I would never ditch our sponsor. Thorum, thanks to Thorum for sponsoring this video. Thor has been in business for over a decade, handcrafting elegant bands and rings out of rare materials. They've got rings made out of titanium, ironwood, meteorite, and even real dinosaur fossils. They've got a ring for every taste. The Meteorsaur, is made out of black tungsten carbide, meteor, and real T-Rex bone. These rings are as unique as the person wearing them, and they simplify the process of finding a ring that fits you, by offering ring sizer kits on their website. Each ring ships within one business day, and comes with a free Thorum silicone activity band, and a beautiful wooden ring box. They have over 5,000 satisfied customers and counting. So what are you waiting for? Head over to the link in the description, and get 20% off today with code LTT. If you guys enjoyed this video, why don't you check out our video about an audiophile network switch, that ended up being complete and total snake oil. I guess I spoiled a lot of it just there, but it's hilarious, and it's worth watching.",
    "transcript_keywords": [
        "planer magnetic drivers",
        "planer magnetic",
        "magnetic drivers",
        "magnetic",
        "planer",
        "sound",
        "sound Planer magnetic",
        "headphones",
        "planer magnetic headphones",
        "Audeze",
        "Diokos",
        "drivers",
        "driver",
        "Euclids",
        "made",
        "Audeze Euclids",
        "wireless",
        "make planer magnetic",
        "pair",
        "offer planer magnetic"
    ],
    "transcript_entity_values": [
        "Steely Dan",
        "one",
        "hundreds of dollars",
        "20",
        "18 millimeter",
        "every day",
        "eight",
        "less than a 10th",
        "Thor",
        "one business day",
        "the Audeze Euclids",
        "a 50 year",
        "Thorum",
        "7Hz",
        "Euclids",
        "CNC",
        "the past couple of years",
        "LTT",
        "14.6 millimeter",
        "Linus",
        "Meteorsaur",
        "nearly three quarters",
        "Apple",
        "first",
        "Sennheiser HD 600",
        "Pelican",
        "10 year old",
        "15 bucks",
        "3000",
        "about 40%",
        "two to five years",
        "ironwood",
        "Amazon",
        "Audeze",
        "30 more years",
        "max",
        "six",
        "between two",
        "600s",
        "California",
        "less than half",
        "less than one sixth",
        "Crinacle",
        "AirPods",
        "8,000 hertz",
        "10,000",
        "a thousand",
        "10",
        "Salnotes Dioko",
        "Costa Mesa",
        "20%",
        "3.5 millimeter",
        "just a couple of hours",
        "Diokos",
        "two",
        "month",
        "7Hz",
        "a year",
        "America",
        "Linsoul",
        "Crinacle",
        "Chinese",
        "today",
        "Hotel California",
        "IE600s",
        "Audeze",
        "US",
        "Thorum",
        "6.35 millimeter",
        "Audeze Euclids",
        "Euclids",
        "over 5,000",
        "2",
        "100",
        "130",
        "1,200",
        "EQ"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "NORP",
        "DATE",
        "MONEY",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "GPE",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "GPE",
        "PERCENT",
        "QUANTITY",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "PERSON",
        "NORP",
        "DATE",
        "LOC",
        "PRODUCT",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "MONEY",
        "ORG"
    ]
}