{
    "id": "SPF8HXytAFs",
    "title": "Does MrMobile Know Phones?!",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-06-26T16:28:26Z",
    "video_url": "https://www.youtube.com/watch?v=SPF8HXytAFs",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "mrmobile",
        "Michael fischer",
        "cellphones",
        "smartphones",
        "phones",
        "nokia",
        "samsung",
        "motorla",
        "htc",
        "oppo",
        "siemens",
        "danger",
        "danger hiptop",
        "mobile sidekick",
        "tmobile",
        "xelibri 6",
        "xelibri",
        "nokia 7070",
        "nokia prism",
        "Motorola vbox",
        "oppo n1",
        "matrix phone",
        "samsung matrix",
        "nokia matrix",
        "nokia 8110 4g",
        "evo 3d",
        "startac 70",
        "startac rainbow",
        "nokia 6108",
        "weird phones",
        "cool phones",
        "weird tech",
        "tech",
        "technology",
        "quiz",
        "game",
        "trivia",
        "continuum"
    ],
    "views": 317048,
    "likes": 9350,
    "comments_count": 540,
    "description": "MrMobile signed up for hard mode when he launched his 'When Phones Were Fun' seriesMrMobile Go subscribe to @TheMrMobile  Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Does Vsauce3's Jake Roper Know Movies?  Does Sara Dietschy Know Tech?  Does JerryRigEverything Know Phones?  Does MKBHD Know Tech?  Does Snazzy Labs ACTUALLY Know Phones?   Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "https://youtu.be/3phaEPn6fJU",
        "https://youtu.be/jNl04x5rmxo",
        "https://youtu.be/cXFmqapcP8Y",
        "https://youtu.be/cXFmqapcP8Y",
        "https://youtu.be/O8ri-QIP1eE",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome to This Is where we have a very special guest on Who Wants To Be A Phone Millionaire. The one and only, Seor Mobile. How's it going my friend? - It's going very well and allow me to be the first to say I'm very glad you guys haven't been sued out of existence by ABC yet. Just keep on going with that title I think it's gonna work out. - Look, we're just gonna keep making videos and they can play Whack-a-mole as much as they want. But as long as we fit into, what is it, YouTube? Oh, fair use. There's a bunch of other excuses YouTubers use to blatantly rip things off. We'll be fine. I have no problems. - Amen to that. - The game today is very simple. We have a list of 10 phones from various different areas that we are going to show you. And you have to answer two questions about each. First of all, the name of the phone. Second of all, the year that phone came out. However, we are going to give you a handicap of plus or minus one year. So say a phone came out in 2005, you can get 2004 or six and that will be counted as a correct answer. As soon as you hit 50%, so you get 10 questions aka you could get the year on every single one right and the name of every single one wrong, you would technically be the winner of the game. If you would like, we've done this with a few of our other guests, we have a wager to offer you. If you're able to hit that 50% threshold, and successfully guess our game correctly, then you will get to Tweet whatever it is that you want from the This Is Twitter account. However, if you are not able to reach the 50% and we will consider hitting 50% being a tie to go in your favor, then you must Tweet out a subscribe to This Is link. Does that seem like a fair gentleman's wager to you? - You know, I'm dubious about it but as long as I'm allowed to include profanity and obscene gestures in my Tweet from your account then, yeah we're golden. Let's go. - Excellent. Then let's play, Who Wants To Be A Phone Millionaire. See I changed it up. They can't sue me for Phone Millionaire. That's just dumb. Let's begin with phone number one. - [Michael] Oh man. (laughter) How dare you sir. How dare you start off immediately in hard mode. We have the off-access D-pad here. We have a touch pad with a stylus that's under a flip. This is a phone, this is the first phone I would've showcased when phones were fun if I had ever known it existed. I have no idea what this is. Can I guess? You do have one lifeline available which is phone a Ken where you can phone our wonderful friend, Ken Bolito who may be helpful or may lead you astray depending on his mood and whether or not he knows what this bizarre phone is. So, you have the lifeline. You can use it any point throughout the game. But just so you know, you got that in the back pocket. - Copy that. Well I've got nine phones to go. So I don't want to burn my phone a Ken yet. And I think I can at least pin down a rough approximation of the year and then makeup a product name. So, I think I'm ready to do that. I'm ready to say that this debuted in 2004 and that it was called the Nokia 7150. - Michael Fisher, from MrMobile you have 50% score so far. Yes, so this is the Nokia 6108. So, props you got very close to the actual real name. And it is from 2003 which is inside the handicap. So you get 50% points. This is a tough one, right? - That was a really tough one. I'm demoralized, I'm going to walk if you do that to me again. No I'm kidding. That was great, I've never seen that phone before. I can't wait to look it up. All right. So far so good. Let's move one to phone number two. - [Michael] Oh, I believe I recognize this phone. I don't want to get overconfident. I believe I recognize it and that's what I'm saying but I don't wanna get too cocky here. Now that's running Android. I think it's running like right before ICS whatever that version of Android was. And I think my friend owned this phone on my recommendation. The side mounted USB port is throwing me a little bit, but- Oh man, I hope I'm right because it looks like is that the Nexus S from the year 2010? - MrMobile, you are once again 50% correct. It is in fact the Samsung Continuum but it is from 2010. - Man, okay well that's why All right, okay. All right, all right. 50% I'll take, okay. - So, what made this phone bizarre, and ultimately kind of silly, is the fact that it actually has a secondary 1.8\" display below the button so that top part is the real screen and the bottom part is pretty much specifically for notifications which is silly because they could've just made the phone 1.8\" taller or half a inch or whatever the actual height of that screen is. - Austin, you know that had to be fun. Come on. Look how- I didn't notice the display division. Of course that's the Continuum. I forgot about that entirely. Ah, what a great phone. - All right, well so far you were doing actually quite well. You were at 50% points so far so it means you're well within the- you keep this up, you're on the path to victory. So let's move on to phone number three - Oh wow, you're throwing me off with the distinct color way on this one. There is another trap here because this could be one of two very distinctive Motorola phones. I know this is a Motorola phone. And I'm fairly certain it's the Motorola StarTAC and not the Motorola Timeport because of the LCD that I'm seeing instead of whatever the organic color display was. I think this is a Motorola StarTAC and I'm gonna say the year on this is gonna be 2000. - All right. So I'm hearing word from the producer, you are close to the name but when we need a little bit more specificity. Do you have anything more than Motorola StarTAC. - There were multiple models of the StarTAC. So you want like a model number? You sadist. - There are two subheadings for the phone. If you get either of them correct, I will give you points on this one. You're very close but there were quite a few StarTACs. - But, looking at this, in its strange mustard and green livery and its key layout. Nothing is setting it off for me. And it can't be a Timeport. I can't say. The Motorola StarTAC Turtle Comm edition. That's what it is. - I'm sorry to say I can't give you points on this one. This is the StarTAC 70 Rainbow. So this was available in 1997. - '97, you are kidding me. '97, so the StarTAC actually was the first fully flip phone well, I guess fully flip phone in the traditional sense back in '96. And this was the Rainbow limited edition or I guess it was limited. It was the Rainbow edition that came out a year later. All right. Let's move on to phone number four. - [Micheal] This is a phone that gives you Jordy vision. This is a phone that allows you to see in three dimensions. I think the name includes a reference to that. I think the manufacture's HTC and I think Sprint carried it and I think it was under the Evo brand. So I think if you put all that together, it's probably HTC Evo 3D from the year 2011. - MrMobile you are 100% correct. It is in fact the 2011 HTC Evo 3D. So this one was special because not only did it have a 3D screen, but of course it could record 3D video with those weird cameras on the back. Now this was a phone that I remember thinking was really cool. 'Cause this was around the time of, what was it, the 3D S, right? Where like people were really getting excited about 3D. - But it was also super confusing Because the immediate predecessor to this phone was the Evo 4G. So they'd have the next year an Evo 3D. It was a- And I just remember reading like headlines of reviews at the time where it's like, \"Yeah, this phone's cool but it gives me a headache if I look at it too much.\" So I'm like, well that's kind of a negative. - So Mr. Fisher, I'm very happy to say You are back up to 50% with that question. So, how are you feeling right now? - Feel good. Feel good. Perspiring less. Breathing a little bit easier but I think you're lulling me into a trap. - All right, let's move on to phone number five. - [Michael] Oh yeah. Yeah, yeah, yeah. I loved this one. I wanted to cover it and I couldn't because reasons. I don't think we had a relationship with the manufacturer which I think was OPPO. Ad this is tricky because I think there was more than one model made with this rotating camera array which, by the way, is a really good idea that I wish more manufactures had adopted. - [Michael] And I think, though, this is maybe the first one they did. I hope it is even though it looks a little more refined. I'm gonna guess this is the OPPO N1 from 2012. - I've gotta say, you had me there for a second and then you really had me because you are 100% correct. Yes, it is the OPPO N1 from 2013. That absolutely is close enough to get full points on this one. - Okay, good. I was really worried. 'Cause I didn't remember the mint ones. So I'm like, \"Was that a weird sequel that I'm not remembering? Like what?\" Okay. I've never touched one. I really want to. - [Austin] Neither have I but yeah of course this was famous for being one of the first phones with the rotating camera. I don't remember, was this one motorized or was it the one I think you had to flip this one, right? - I thought it was motorized but again I'm very confused about whether there was this sequel or not. So, it's possible it could have been the manual turnaround. But even if it was, what a great idea right? - Yeah, absolutely. And of course something like the ZenFone many years later would kind of take that design to the next level. But yeah. So, absolutely. You were doing very, very well my friend. - Thanks, man. Ah, that feels good. (laughter) - All right. Time to move on to phone number six. (laughter) - [Michael] You're a very kind person. I appreciate that. Thank you. Thank you for throwing me this bone in what I presume will continue to be a difficult game. But I think I can do this one. I think this is made by Samsung even though you blotted out the branding. This is from 2003 because it was released in conjunction with the second Matrix film. And, as a result, it is called the Samsung Matrix phone aka the N270. - That is incredibly impressive. Yes, you are 100% correct and yes we did pull this from a recent wonderfully titled MrMobile video. But, yeah you are 100% right. Not only was this released alongside the movie it was used, for like what, two seconds in the actual it was Matrix- - In the intro. - No, it's in like five shots of the movie. And it's probably totaled screen dwell time is like four seconds across the whole movie, yeah. (laughter) - Oh what a pleasure it was to finally get a hold on one of these. - I've gotta say man you were really turning around right now. You've gotten the last three questions 100% correct which means you are getting very close to clenching the game if you could hold it together for just a little bit longer. - Is this when you start rolling out all the alphabet soup Nokias? 'Cause I know you've got 'em. I know you're gonna punch me in the face. - Well, you never know. You never know. We have many more phones available starting with phone number seven. - [Michael] Speaking of the Matrix even though this is not the original edition of it. This was the resurrected one for, I believe, 2018. Excuse me, I was gonna say 2017 I think. 2018. And, they carried the same model number over but they added a 4G to it I think. So I believe we're looking at the Nokia 8110 4G. - You're 100% correct. It is in fact the Nokia 8110 4G, 2018 edition. And, like some other recent Nokia phones, they've straight reused the name and just added like 3G or 4G to it which is very confusing when you're researching these phones and you find like, wait, that doesn't look quite right. So MrMobile, I'm very happy to report that you are currently at 10 points which means, at this point you actually have clinched the victory. You can get the next three phones completely wrong and still win the game. However, we do have one level farther. If you would like, you can go double or nothing on a potential eleventh question. - [Austin] But we do have double or nothing available which is, if you get the eleventh phone correct, you will be able to earn a free ad spot on This Is and we will plug whatever it is that you want for 30 seconds in a future This Is video. However, if you do not get this mystery phone correct, then you will leave with nothing. No Tweet, absolutely nothing. And it is if this game has never happened. You don't have to decide right now. Gonna float the idea out there. But you are doing very well right now my friend. Very, very well. - You really know how to you know just the moment someone starts relaxing a little bit, you really know how to rachet the skrews back to. And I appreciate that Austin. Thank you. Back to tense. Back to tense and scared. Okay. - Exactly. All right. Let's move on to phone number eight. - [Michael] Oh yes, indeed. I have very little idea who made this. You know what's weird though? I think I may have said this brand name earlier. Maybe I'll get partial credit. I think, so this is a two-way messaging device. This is like a pager sort of thing from the year 2001. It's made by Motorola and it's called the, they reused the Timeport brand, it's the Motorola Timeport 2-Way from 2000. - MrMobile, you are 50% correct. It is in fact the Motorola V100 or the V.box from 2000. - Hey, from- well I got the year right. Okay, and it was Motorola who made it. Wow. - Well, yeah. This is back in the weird days. I just look at the color scheme of this. I just, I can't help but think it's like for kids or something. It just looks so fun and it looks so playful. Let's move on to phone number nine. - [Michael] I should have, you know I doubled down on studying the weird Nokias before this but I should have gone across the aisle to my friends at Seaman's 'cause I think that's who's responsible for this thing. Sadly, I don't know the model number at all Or what it even might've been called. So, I'm gonna say it was the Seaman's Compact Deluxe Pro X from, I still think this was from the golden age of like experimentation though. So, I wanna say this is like a this is a 2003 phone. - Mr. Fisher, You've made it very far in this game so far. And you're going to continue because you are 50% correct. It is in fact from 2003 and it is a Seaman's. However, it is the Celebry Six. This was a very bizarre device. And then it was part of the fashion oriented Celebry line where it actually had mirrors. So essentially it had the flat mirror where it had the tiny little screen in the middle of it. And then it also had a magnifying mirror if you wanted to, \"Adjust your mascara or eyeliner on the go.\" - I can't wait to go get one. I'm going to go get one of those too. I'm so excited. - I bet it's not gonna be particularly expensive if you can find one that's not been relegated to the scrap heap of time. (laughter) - Oh, I'm sure they're out there. We'll call up the mobile phone museums, see if they wanna lend me something. - Cool, cool. All right. Let's move on to potentially the final question, phone number 10. - [Michael] Great Odin's raven. (laughter) - This fell off like a Power Rangers' belt clip in the middle of a shoot and somebody stole it. I'm gonna go with 2006 for the year. And I'm going to call this the Bad Admiral's Communicator from manufacturer Nokia. - You know what, it is in fact a Nokia. But unfortunately, you talked yourself out of the correct answer. It is from 2008. This is the Nokia 7070 Prism. - Of course it's a 7,000 line. The weirdo warehouse. Tell me about it. Tell me things. - So, I'm sad to say it's actually pretty unremarkable. So it was part of the Prism lineups. So there were a couple of other more expensive options including the 7500 and 7900 Prisms. That actually had like an RGB accent. But this was the more basic, simple model that didn't have a camera but it did look cool or evil, depending on your perspective. - I can't believe that's so bizarre. Thank you again for introducing me to another strange artifact. I gotta get me one of those too. - I feel like we're about to see some very exciting MrMobile videos in the coming months. - As long as this quarantine keeps going man. I'ma keep showing you old phones so, yeah. Hey. - MrMobile, for double or nothing, do you want to take the challenge of our eleventh question? Or do you wanna go home with your nice, safe Twitter prize and the happy victory that you have acquired here today? - I watched a few games shows as a kid, Austin. And the number of times I've shouted at the screen, \"Do the true Daily Double!\" Or, \"Go for the million!\" is innumerable. So, as ill advised and stupid as it is, I'm hoping Ken can pull me out. I'm gonna stick around. Let's do this. Let's make it a true Daily Double, super millionaire, Wheel of Fortune, Who Wants To Be. - All right, the next phone please. For the win. - [Michael] This is a phone manufactured by Sharp. It was dreamed up by Danger and it's called the Danger Hiptop which was rebranded as the T-Mobile sidekick and a number of other things depending on what regional carrier it was. So there's that. The question is the year. Danger sort of started working on something called The Peanut in 1999, 2000. And then there was a color version of this device that came out in 2002. But this appears to be a black and white screen which would mean, I think, God, I think that it came out in 2001. I'm gonna say that. I'm gonna say Danger Hiptop/T-Mobile Sidekick depending on where you bought it. And the year, this is the first one, and the year is 2001. - Before you lock your final answer in, would you like to take advantage of your phone to Ken? - I'm already calling my man. It's important to me that I get as much of this as possible, so. Ken, I'm looking at a- Do you remember when the first T-Mobile Sidekick/Danger Hiptop launched? '00 or '01, which one? Terminated. - That didn't seem super helpful. Did you hear what he said at the end? I think he got cut off, right? - The only question in my mind was it '00, '01 or '02? And I really think with this black and white screen, I think 2000 would have been too early. I think 2002, they already had the color one out, dude. Unless the black and white one and the color one were released concurrently in '02. I gotta stick with the, I'm saying 2001. - So you're final answer is the 2001 Danger Hiptop? - Correct. - MrMobile, this is in fact the Danger Hiptop from 2002. - Oh, come one! (laughter) - Are you kidding? They released the black and white one in 2002? - [Austin] Yes, so the first edition did have the monochrome screen. - [Michael] And I know. And I know. And they gave it a color display in the same casing in almost the same year. - Mm, I feel bad about this one man. I feel bad about this one. You killed this game so like you did such a good job all the way to the very end. And then we shamelessy ripped it away from you with a trick question. - It's a great trick question. Like it is one of the best trick questions ever because it lulls you into a false sense of security first and then makes you double question yourself. And then you know until you end up on the phone with Ken and, you know, as much of a giant help as that was, you just go down in flames. Thanks Ken. No, I'm kidding. What a wonderful question. And what a great game. I have no regrets whatsoever. - Well, what a wonderful guest. Thank you very much, MrMobile for being on Who Wants To Be a Phone Millionaire. So while sadly, you're walking away with nothing, hopefully you've learned a new appreciation even though I feel like you're the last person on Earth who need a new appreciation for this, of weird old phones. Anyway, thank you very much for watching. Of course, feel free to go subscribe to the one and only MrMobile who has many, many weird phones he's reviewed on his channel. Ultimately, you're the one that we had to save the hard mode for. I feel like no one else had a chance of making it through this one besides you. - I am honored to have been considered even for hard mode and I will tell ya this, you have not finished hearing about the T-Mobile Sidekick/Danger Hiptop this week. - Ooh. Ooh, wait are you tryna say this is an exclusive? Are you about to drop a Hiptop video on us? - A little bit of episode three of When Phones Were Fun, baby. Coming sooner than you think. - Excellent.",
    "transcript_keywords": [
        "Phone",
        "phone number",
        "phones",
        "Phone Millionaire",
        "Danger Hiptop",
        "Motorola",
        "year",
        "number",
        "correct",
        "yeah",
        "Nokia",
        "Motorola StarTAC",
        "Danger",
        "Ken",
        "game",
        "MrMobile",
        "phone correct",
        "question",
        "Motorola phones",
        "Hiptop"
    ],
    "transcript_entity_values": [
        "2013",
        "Android",
        "the Danger Hiptop",
        "three",
        "the T-Mobile",
        "the next year",
        "Sidekick/Danger Hiptop",
        "three questions 100%",
        "Timeport",
        "Turtle Comm",
        "Nokias",
        "Ken Bolito",
        "the 50%",
        "Danger Hiptop/T-Mobile",
        "ABC",
        "the coming months",
        "Matrix",
        "50%",
        "HTC",
        "Compact Deluxe Pro X",
        "the year 2011",
        "Evo",
        "OPPO",
        "Seor Mobile",
        "half a inch",
        "Michael",
        "this week",
        "Second",
        "2010",
        "2001",
        "Twitter",
        "MrMobile",
        "USB",
        "2000",
        "Fisher",
        "the year is 2001",
        "2017",
        "the Motorola Timeport 2-Way",
        "Michael Fisher",
        "RGB",
        "the year 2010",
        "Austin",
        "Samsung",
        "Samsung Matrix",
        "YouTube",
        "2008",
        "up to 50%",
        "Hiptop",
        "N270",
        "70",
        "2011",
        "first",
        "2004",
        "'01",
        "'96",
        "two seconds",
        "10",
        "2012",
        "1.8",
        "LCD",
        "Wheel of Fortune",
        "the Motorola Timeport",
        "nine",
        "Michael] Great Odin's",
        "'97",
        "1999",
        "100%",
        "2006",
        "YouTubers",
        "the year 2001",
        "2003",
        "Six",
        "4",
        "like four seconds",
        "'00, '01 or '02",
        "the Samsung Continuum",
        "second",
        "2018",
        "five",
        "7500",
        "Sharp",
        "the weird days",
        "Continuum",
        "almost the same year",
        "the year",
        "First",
        "30 seconds",
        "Rainbow",
        "one",
        "four",
        "2002",
        "7,000",
        "Earth",
        "today",
        "Nokia",
        "Daily Double",
        "a Power Rangers'",
        "2005",
        "eight",
        "six",
        "Prism",
        "'02",
        "V100",
        "3",
        "Seaman",
        "Celebry",
        "two",
        "Nokias",
        "Motorola",
        "eleventh",
        "ICS",
        "MrMobile",
        "a year later",
        "G",
        "1997",
        "Ken",
        "more than one",
        "seven",
        "Jordy",
        "HTC Evo 3D"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "FAC",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "DATE",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "LAW",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "DATE",
        "DATE",
        "DATE",
        "TIME",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "PERCENT",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "ORDINAL",
        "TIME",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "LOC",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG"
    ]
}