{
    "id": "SqB0lUcqFbA",
    "title": "Hating Apple is Getting REALLY Hard - WWDC 2023",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-06-06T08:59:14Z",
    "video_url": "https://www.youtube.com/watch?v=SqB0lUcqFbA",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "Vision Pro",
        "MacBook Air 15",
        "Mac Pro",
        "Mac Studio",
        "Sonoma",
        "Apple Silicon",
        "WWDC",
        "Chief Vision Officer",
        "Health App",
        "Siri"
    ],
    "views": 3089935,
    "likes": 102185,
    "comments_count": 9226,
    "description": "Its no secret their chairs are great! Check out Secretlab at   Check out The Ridges Fathers Day sale using the link below and Save up to 40% through June 15th!   It's that time of year again, and Apple is launching some pretty cool tech! Vision Pro, 15\" MacBook Air, and an impressive new Mac Pro are all coming to an Apple store near you for a hefty price.   Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:06 Vision Pro 4:15 Mac Pro 6:20 Metal 3 7:08 MacBook Air 8:00 OS Updates 9:43 Outro",
    "description_links": [
        "https://lmg.gg/secretlab",
        "https://www.ridge.com/LINUS",
        "https://linustechtips.com/topic/1511391-hating-apple-is-getting-really-hard-wwdc-2023/",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Apple just demolished (whistling) (glass shattering) the competition, at least if you ignore the price. Not only is the Vision Pro looking basically revolutionary when it comes to headsets, but the new M2 Ultra chip in the New Mac could be equally promising, at least if its raw size as any indication. 24 Core CPU, 76 core GPU, not to mention a 32 core neural engine. I mean, how on Earth are they accomplishing all of this in a single chip? How have they managed to do this without the price for the Mac Pro skyrocketing? (cash register chimes) And how are they justifying the apparent lack of support for add-in GPUs and confirmed lack of support for memory upgrades? Oh, yeah, did I mention that it's not all good news? Naturally, we've ordered one of each anyway, so we're gonna be giving you guys the full rundown once they arrive, which is why I need this segue to our sponsor. The Ridge. Father's Day is coming up and Ridge has you covered with one of their biggest sales of the year. Don't miss out on this opportunity to gift a unique and functional Ridge wallet or key case. Check them out at the link in the description and make dad proud. We're starting with the obvious eye catcher, the Vision Pro. Is this the most tech technologically advanced piece of consumer tech ever? Maybe. It's basically a wearable computer, and while Apple has been vague about a lot of things, they never mentioned Meta or the metaverse once and they didn't really show off any VR games, so we don't know if we can call it a VR headset, what we do know is that it's Apple's first product capable of what they're calling spatial computing. Wait, isn't that just a fancy way to say augmented reality or AR? Yes. Yes it is. And with the utterly mind blowing price of 3,500 US dollars, Apple has got an uphill battle ahead of them justifying this thing. But then again, maybe you'd be a fool not to buy one. According to Apple, it can replace your TV, your monitors, and even your sound system. That is quite the claim. But hold onto your keyboards, haters, because they might not be that far off the mark, at least if you live alone. First up, it contains Apple's first 3D camera for capturing spatial photos and videos, dual driver audio pods that can use audio ray tracing for spatial audio, an outward display that reveals your eyes through the already impressive internal display, which is a micro-OLED with 23 million pixels. What? It also contains a ton of sensors to keep track of not only your eyes, you can supposedly select icons and objects just by looking at them, but your head, your hands, and your environment with precise tracking and real-time 3D mapping. Plus, did I mention that you can look into the headset and have it scan your face into a digital persona. It looks like Meta's cartoony avatars are even more DOA than they were already. To do all of this, Apple needed both an onboard M2 processor that's running computing-related tasks through visionOS. That's Apple's new AR operating system. And they needed their new R1 chip, which is dedicated to all the cameras, sensors, and microphones that make the headset work in virtually real-time. Apple's claiming that you're going to experience only 12 milliseconds of latency when using the device, which if true would mean that the experience should feel basically instantaneous. Wen they're boasting the ability to recreate the world around you in real time using LiDAR scanning and TrueDepth cameras from the headset you're wearing while it supposedly runs cool and quiet, man, even at that price point and with the fact that you have to have a tether running to a pack, I'm pretty blown away. And while I still think it's worth noting that you can get a great computer and a monitor and even a basic VR headset for less than $3,000, considering the cost of Apple's other devices with M2 family chips, it's actually kind of compelling to enthusiasts who might have bought an XDR Pro display anyway. And it's doing all of this wirelessly with about two hours of battery life, with support for hundreds of thousands of apps on day one. Insane. Almost as insane is the fact that we might be losing GPU support on the Mac desktop for good. I mean, \"Don't worry,\" they say. The shiny new M2 Ultra chip \"has the power of seven Afterburner cards,\" so who would want an RTX 4090 anyway? And besides, you know, you've got so many other things that you wanna put in those seven PCIe gen 4 slots, why a GUP? (Linus sighs) I mean, should we just be grateful that unlike the new Mac Studio, it at least has PCIe expansion? Maybe. It also has a 24 core CPU that they claim runs nearly twice as fast as the previous gen 28-core Intel chip, and support for up to eight displays, all of which can stream 8K ProRes video. Now, they haven't outright stated that there will be zero support for dedicated graphics cards, but based on the lack of reference to them when directly talking about the versatility of PCIe expansion and the fact that they acknowledged in the keynote very technical stuff, like the fact that you are locked in to the up to 192 gigs of memory that you configure right from the get-go, no memory upgrades, it's not looking great, just like the price. Per usual, the top spec machine is gonna cost you an arm and a leg. With all the bells and whistles, so the better chip, max memory, and eight terabytes of storage, you're looking at just under $12,000, which, oh, wait, only a $1,000 bucks per month for a year? Huh, well that's much better. But then you tack on a display, your add-in cards, maybe wheels for the case and you're looking at even more than that. Even the base unit, which does at least have respectable hardware this time around, starts at 7,000 bucks. With that said, the old Mac Pro started closer to $6,000 and could skyrocket even higher if you kept adding memory, so considering all the inflation we've seen over the past few years, maybe it sounds pretty reasonable. We're not gonna know for sure just how much better or worse it's gonna be than having a few dedicated 4090s, but you can bet your butts that we're gonna figure that out once ours arrive, so stay tuned. And I guess we're gonna have to have some gaming comparisons too. They pushed Metal 3 support pretty heavily, and even brought out Hideo Kojima to help influence developers to please jump on board and start porting games to Mac. (breathes heavily) They showed off their new game porting toolkit, and, you know what? I gotta give 'em credit. I am all for this and hope that everyone using an Apple product can benefit from it. I mean, just 'cause I'm a PC guy doesn't mean that I wanna sit on my computer and laugh at the Apple plebs for not being able to run many games outside of \"Minecraft\" and \"The Sims\". This is a really good thing overall. I'm glad to see Apple treating gaming more seriously and I hope to see developers porting more and more games in the years to come, especially if this new M2 Ultra GPU can push real FPS and it's not just Apple hyperbole. Now, if you're not interested in a desktop that costs as much as a car or a house down payment, they also announced the 15-inch MacBook Air. And at just 11.5 millimeters thick with a no-wedge design, they're claiming it's not only the world's thinnest 15-inch laptop, but also the world's best 15-inch laptop, despite it not actually being available for another week. It starts at $1,300, which is a lot of money, but only $200 more than the 13-inch, has a display with support for a billion colors that reaches 500 nits of brightness, supports a 1080P webcam and offers up to 18 hours of battery life. Huh, that last point. Quite a few folks here at LTT have actually switched to MacBooks just for their objectively superior battery life, and this seems like it's gonna be, well, just more of a good thing. And Apple kept things rolling with a few OS updates for both macOS and iPadOS. We were all waiting for the big announcement at the end, and then they just kind of glossed over the usual iPad OS updates, like lock screen customizability, a new Notes app, supposedly great for PDFs, a new health app, and last but not least, the ability to set multiple timers at once. - We truly live in an age of wonders. - That's right, Apple's finally giving the people what they want. It just took three, five, maybe 10 years. No big deal. As for macOS, it looks like the new update, Sonoma, is getting a bunch of features that were already present on iOS and iPadOS, like screen savers and widgets. You'll also no longer have to say \"Hey\" first. You can just say her name, which feels a little rude considering that our future AI overlords may remember the way we treated them. They talked a little bit about how Safari is the world's fastest browser and will be getting profiles like we've already had with Google Chrome for a while now. It's kind of weird how Apple refuses to admit when someone else comes up with a good idea. Then they just wait a few years, implement it, and then don't mention the competition at all, kind of like how I've gone through this whole video without mentioning our sponsor. - Secretlab. Secretlab chairs are sleek, ergonomic, and most importantly, built to withstand the rigors of gaming or office work for long hours, equally important activities. Their Titan Evo 2022 series chair offers four-way lumbar support, a magnetic memory foam head pillow, and is offered in several upholsteries, like Hybrid Leatherette, SoftWeave fabric, and NAPA leather. They also have a range of gaming chairs designed in collaboration with popular games, like \"League of Legends\", \"Valorant\" and \"Overwatch\". Best of all, a five-year extended warranty is included, along with a 49-day return policy so you're covered if anything goes wrong. Head to the link in the description and check out Secretlab today. - If you enjoyed this video, maybe check out last year's WWDC coverage to see just how far we've come in only a year.",
    "transcript_keywords": [
        "Apple",
        "Mac Pro",
        "support",
        "Vision Pro",
        "Mac",
        "Pro",
        "Mac Pro skyrocketing",
        "chip",
        "memory",
        "Mac Pro started",
        "XDR Pro display",
        "headset",
        "Ultra chip",
        "price",
        "display",
        "games",
        "Ridge",
        "good",
        "Core CPU",
        "year"
    ],
    "transcript_entity_values": [
        "the years",
        "one",
        "MacBooks",
        "500",
        "zero",
        "eight terabytes",
        "iPad",
        "6,000",
        "GPU",
        "seven",
        "M2",
        "the New Mac",
        "the past few years",
        "49-day",
        "WWDC",
        "23 million",
        "just 11.5 millimeters",
        "long hours",
        "Mac",
        "FPS",
        "LTT",
        "Overwatch",
        "three",
        "The Sims",
        "another week",
        "up to 18 hours",
        "Linus",
        "24",
        "4090s",
        "Earth",
        "the year",
        "only a year",
        "Apple",
        "first",
        "Valorant",
        "only $200",
        "M2",
        "last year's",
        "Sonoma",
        "First",
        "32",
        "XDR Pro",
        "Google Chrome",
        "hundreds of thousands",
        "Mac",
        "Hybrid Leatherette",
        "Meta",
        "Notes",
        "M2",
        "4",
        "up to eight",
        "1080P webcam",
        "Metal 3",
        "five-year",
        "CPU",
        "Mac Studio",
        "max",
        "a few years",
        "28",
        "Intel",
        "K ProRes",
        "192",
        "Hideo Kojima",
        "only 12 milliseconds",
        "M2 Ultra",
        "day one",
        "four",
        "Ridge",
        "76",
        "Afterburner",
        "TrueDepth",
        "five",
        "Secretlab",
        "13-inch",
        "just under $12,000",
        "10 years",
        "Minecraft",
        "DOA",
        "Safari",
        "less than $3,000",
        "NAPA",
        "Mac Pro",
        "1,300",
        "$1,000 bucks",
        "the Vision Pro",
        "3,500 US dollars",
        "a year",
        "MacBook Air",
        "SoftWeave",
        "Wen",
        "LiDAR",
        "about two hours",
        "today",
        "8",
        "7,000 bucks",
        "15-inch"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "DATE",
        "DATE",
        "EVENT",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "TIME",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "DATE",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "LAW",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "DATE",
        "WORK_OF_ART",
        "GPE",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "TIME",
        "DATE",
        "CARDINAL",
        "MONEY",
        "QUANTITY"
    ]
}