{
    "id": "ssgIXMIX2hc",
    "title": "Galaxy S20 Ultra review: something to prove",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-02-27T14:55:33Z",
    "video_url": "https://www.youtube.com/watch?v=ssgIXMIX2hc",
    "category": "Science & Technology",
    "tags": [
        "galaxy s20 ultra",
        "samsung galaxy s20 ultra",
        "s20 ultra",
        "galaxy s20 review",
        "samsung galaxy",
        "galaxy s20 ultra review",
        "samsung galaxy s20 ultra review",
        "samsung",
        "galaxy",
        "camera",
        "samsung camera",
        "samsung review",
        "samsung phone",
        "samsung hands-on",
        "hardware",
        "software",
        "dieter bohn",
        "specs",
        "display",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google pixel 4",
        "iphone 11 pro",
        "verge",
        "the verge",
        "galaxy s20 ultra camera",
        "samsung galaxy camera",
        "iphone 11",
        "ultra wide"
    ],
    "views": 710997,
    "likes": 13823,
    "comments_count": 1140,
    "description": "Samsung's new Galaxy S20 Ultra is a lot of phone: a lot of megapixels, a huge screen, a high refresh rate, the big battery, and something to prove. Can it beat OnePlus for screen, the Pixel 4 for camera, or the iPhone 11 Pro for video? In this review, Dieter Bohn answers all of those questions.  Read more here:   Vox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. For more information, see our ethics policy here:   Order at Samsung:   Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "http://bit.ly/2uwC14K",
        "http://bit.ly/2TQsqjB",
        "http://bit.ly/2T7Fpgd",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- What you are looking at here, is the Samsung Galaxy S20 Ultra. And, there's a lot going on. It is big, it has 5G, 108 megapixel camera, four other cameras, a massive screen, a high refresh rate, a 1399 dollar starting price. It's just a lot. (drum beat) If there's a spec that you can think of for a phone, this phone is trying to beat that spec. The S20 Ultra goes big, I mean you know, literally big, look at the phone. And looking at it I think one thing is blindingly obvious. Samsung feels like it has something to prove. Let's see if it can. The best word that I can come up with to describe the S20 Ultra is, imposing. It has this giant, giant camera bump on the back which sometimes can be a problem on a table. But look, the thing looks like a Galaxy phone overall. Just kind of taken to the limit. It is as large and nearly as heavy as pretty much any phone that I've ever used. It's a monolith. It sees your puny attempts at using a phone one handed and it laughs at you. Now the main reason this phone is as big as it is is so that you can have this screen which is 6.9 inches diagonally. And because this screen doesn't have a face unlock sensor on it, it can cover nearly the entire front of the phone. Now I figured that I'd be annoyed at having to go back to an in-screen fingerprint sensor instead of face unlock, but I really wasn't. The sensor is fast and accurate enough for me, so I've got no complaints. But the real reason I think that this screen shows that Samsung has something to prove with the S20 Ultra, is they finally added the option to switch it to 120 hertz refresh rate. Now, it comes outta the box at 60 hertz to save battery but I hopped into settings and turned it on right away and never looked back because I think it has enough battery life to handle it. And 120 hertz really does make scrolling and screen animations look better and smoother. Samsung even says that it stopped bothering with any variable refresh rate based on the content of the screen nonsense. It's just locked to 120. Oh, by the way, you can't have both 120 hertz and the phone's maximum 3200 by 1440 resolution. But, I think the trade for 1080 by 2300 to get 120 hertz is totally worth it. And of course, the screen looks great. Looks great indoors, outdoors, at different angles, with HDR content. Samsung knows how to do this by now, it's very good at it. And again, because it's nearly seven inches diagonally, it looks good 'cause it's just huge. But, look. Samsung has already done the make the phone bigger than everybody else thing. That's not actually what the S20 Ultra is about. It's about being bigger in every way, not just size. And there is no better place to start talking about what that means, than to just jump right into the biggest number of all, the 108 megapixel camera. (relaxing music) So let's just get into it. If you count the depth sensor, there are five cameras on this phone. And three of them have just silly megapixel counts. The selfie camera is 40 megapixels. The telephoto is 48, the regular wide angle is 108 megapixels. The only camera that isn't out of bounds megapixel wise is the ultra wide which is 12 megapixels. But the S20 goes further than that. So similar to what Huawei did on it's phones, the telephoto lens here actually hits a prism and a mirror and redirects the light across the body of the phone into the sensor, like a periscope. It means that the phone can get real optical zoom all the way up to 4x, and something really good up to 10x. Then there's this thing that Samsung calls Space Zoom, which pushes the zoom all the way out to 100x. That's one of the reasons that Samsung went with a 48 megapixel camera on the telephoto, so that it has more pixels to choose from when it starts cropping in. It also does this thing where it takes multiple photos to help get data from all the sensors to help. So how does all that tech work? Well I tested this zoom against the iPhone 11 Pro, and the Pixel 4 XL, both which have telephoto lenses. And for fun, I threw in the Sony RX100 VII. The Pixel 4 XL maxes at 8x zoom, so I just compared it at that level and I used a tripod for all of these photos that you're looking at. I think the RX100 wins, but you know, it's a stand alone camera so of course it's gonna. When you just look at the phones, the S20 Ultra embarrasses the iPhone, and I think it edges out the Pixel 4 too. So far so good, but what about this Space Zoom thing? Well, you can impress your friends with little whoa moments by zooming all the way into 100x, but truthfully, I think they look like splotchy messes at that zoom level. I was able to get some fairly nice stuff at 30x, usually by propping the phone on something stable. But, it still looks like a phone photo to me. Okay, but what about just regular, plain old, non-zoom photos? Well, Samsung is doing some weird tech stuff here too. So, by default the 108 megapixel sensor makes 12 megapixel images because the hardware automatically combines nine pixels into one big pixel. It's a process called binning. And combined, those binned pixels are about as big as what they would've been on a lower megapixel sensor. Which does help this camera avoid some of the usual problems that you get with high megapixel sensors. Like bad low light, and noise. It mostly works. See, in order to make all of this pixel binning stuff happen, Samsung still has to do a lot in the software. Now, generally I think the S20 wants to smooth out lighting especially on faces, it wants to keep things bright, and it wants to shift towards less red tones. And those are often really good instincts for photos. So, for example, I think the shot of Alex looks great. And this purple plant thing, it's intense in just the right way. But then, Samsung sometimes steers the S20's tuning just a little too far. So, compared to the iPhone, or the Pixel, this photo of me is just plain over smoothed and over brightened. It is actually super weird. As soon as the S20 camera sees a face, it brings up the shadows too much it smooths skin too much, and it tries way too hard to adjust the white balance and often gets it wrong. Turn your head 45 degrees where it doesn't see a face, and it's fine. Turn on pro mode, and it's fine again. Turn on Bixby Scene Optimizer, and well, okay Bixby makes it worse, but still. In a lot of lighting conditions I got good photos of faces but in challenging conditions it got rough. Samsung tells me that it's looking into it, but there's no setting that you can change to change the default behavior of what this thing does with faces. The weirdest part though, none of this applies to the selfie camera. Which is great. Now Samsung also let's you take full on, 108 megapixel photos, and there's yet more camera tech involved in this like re mosaicing but the bottom line is you need a lot of light to get a decent photo at that resolution. And even then, my 108 megapixel photos were noisy enough in the fine details when I cropped in, that I never really saw the point. Now, when it comes to low light photos, Samsung is doing better than it ever has, partly because the sensors are so big here. But it still has a lot of work to do to catch up to the Pixel 4. And on portrait, again, better than it ever has, but it still has a lot of work to do to catch up to the iPhone. The selfie camera though, which is 40 megapixels, is my favorite camera on this entire phone. It doesn't do the same bad over smoothing on faces, I just really like it. Finally, I hate to tell you this, but as usual with every phone that we try, the ultra wide camera is the worst of the three cameras in terms of quality. Things kinda just get over sharpened as a result of a meh sensor. I guess the iPhone kind of beats the S20 here, but nothing is really good. Now as for video, the headline feature is that you can shoot and edit in 8K, and I dunno, I think that's kinda gimmicky but I do like that you can pull a still photo out. More important to me is the slightly improved video stabilization 'cause I have pretty shaky hands, but you should know that that still doesn't work in 4K and definitely not in 8K. Last and you know what, definitely not least, is I saw this thing hunting for focus a lot. Especially when I was shooting video. I also really like this new feature called single take which does as many of Samsung's weirdo camera modes as possible in one long shot. It's fun, but I wouldn't depend on it for anything important 'cause the quality is like, not that good. So, that's a lot. It's a lot of camera which makes sense 'cause this camera bump is so huge right? I mean, okay. Where do I think it all lands? Well, I think Samsung has a little bit more work to do on it's photo algorithms. I think it's gonna take a minute for them to learn how to take all of these huge megapixel counts and turn them into something that really works in every single context. Especially with faces. (relaxing music) Now the S20 phones are the very first main stream 5G phones. There have been a few before, but they've never been the default and with the S20 line they are. Now you should know that only the S20 Ultra and the S20 Plus support the super high speed millimeter wave-5G that you can really only get at like a few street corners. But, all of them support the slightly slower, but much more widespread mid band 5G. So, okay, here's the state of 5G in New York City. On T-Mobile's mid band, I was able to pull anywhere from like 45 down, which is not much faster than LTE, up to 120 megs per second in a pretty good spot. That's real fast. But it's not as fast as what I could get on Verizon's millimeter wave, where I saw download speeds hit over 1300 Mbps. Which is incredible. I got that on one street corner, if I held my phone right, and I didn't turn my body around. And I didn't walk half a block away. And if I was lucky because sometimes it would drop down to LTE anyway in that spot. Yeah, that's 5G for ya. It's just not fully ready yet. Don't buy this phone just because it's a 5G phone. In fact, don't buy any phone just because it's a 5G phone. (upbeat music) Samsung always boasts the best possible specs for an Android phone on the Galaxy S line, and this year is no different. But what is different this year, is that I think a couple of those specs could actually matter for people. I'm not talking about the Snapdragon 865 processor, which obviously is fast but it's not in a way that I think people are really gonna notice over the 855. What I mean are things like the battery. It's 5000 milliamps here, which is huge and has let me run a full day with very heavy use. I've done it several times now. 5G might bring that battery life down a tick, but I was clearing six hours of screen time with 120 hertz refresh rate turned on. The RAM matters too, you get 12 or 16 gigs of RAM depending on which model you buy and that means that apps close less often in the background and you can even pin apps to memory which means that Android won't be able to close them in the background. This might seem like a weird power user feature, but let's be honest this is a weird power user phone. Samsung is also sticking to it's guns by offering expandable storage and it's not keeping the headphone jack. And it is okay to be sad about that, don't let anybody tell you different. The other side of performance is software, and for the most part Samsung is doing a solid job with One UI on top of Android 10. I still like it, but Samsung is starting to Samsung it up a little bit with feature creep. Everything that it's ever made is still here, and too much of it is sitting in the settings tray and it's ready to confuse you. There's Quick Share, which is like Air Drop but only for Galaxy phones. There's Link Share, which let's you throw stuff online for a private link for people to download for a day or two. There's Music Share, which let's other people with Galaxy phones play their music on the Bluetooth device that's paired to your Galaxy phone. But it's not as weird as Samsung Daily which sits next to the home screen and just doesn't really offer useful cards for anything. Or, as weird as Bixby which sits under a long press of the power button and it's still just Bixby. Overall, the experience on the S20 Ultra is quite good, but it takes a day or two of dismissing prompts and turning off stuff that you don't want. Which is super annoying. So, Galaxy S20 Ultra. Did Samsung prove that it could make the best screen on a smart phone? Yes it did. Did Samsung prove that it could make 5G a mainstream feature for phones? Well, yes it did but that doesn't mean that your city or your carrier has it. Did Samsung prove that it could throw every single performance spec possible into a single phone? I mean, obviously it did. This is Samsung. It also proved though that it's starting to lose it's restraint a little bit on software. But the biggest thing that Samsung had to prove is that it could stay in the camera fight and do so with big megapixel sensors and zoom. And I think on zoom, Samsung has proved that it's hardware can beat Google and Apple at around 8x, but it's not magic enough to get something great beyond that. I'm more worried about how the camera treats faces though, because I think Samsung is still Samsungin' up a little bit too much there. Mostly though, Samsung proved that when it wants to it can still go all out with the phone. I mean, they did call this the Ultra, which is another way of saying a lot. And yeah, this phone is a lot. (evil laugh) That was dumb. A lot of phone, lots of phone, so many phone. Phones on phones. Mega phone. Mega phone, it's loud right. Huh? Thanks for watching. Like and subscribe.",
    "transcript_keywords": [
        "Samsung",
        "phone",
        "camera",
        "Ultra",
        "megapixel",
        "lot",
        "phones",
        "Samsung prove",
        "screen",
        "thing",
        "zoom",
        "Galaxy",
        "Pixel",
        "good",
        "Galaxy phone",
        "megapixel camera",
        "photos",
        "sensor",
        "Samsung Galaxy",
        "big"
    ],
    "transcript_entity_values": [
        "3200",
        "Android",
        "108",
        "three",
        "120 hertz",
        "2300",
        "S20 Plus",
        "5",
        "45",
        "Air Drop",
        "T-Mobile's",
        "Bixby",
        "UI",
        "jack",
        "1300 Mbps",
        "One",
        "12 megapixel",
        "Alex",
        "RAM",
        "Huawei",
        "millimeter",
        "Ultra",
        "RX100 VII",
        "4x",
        "a full day",
        "Snapdragon",
        "Pixel",
        "Bixby",
        "Space Zoom",
        "1399 dollar",
        "Google",
        "1440",
        "Pixel 4 XL",
        "Link Share",
        "Samsung",
        "Galaxy",
        "12",
        "New York City",
        "this year",
        "S20",
        "first",
        "Samsungin",
        "6.9 inches",
        "nearly seven inches",
        "Galaxy S20 Ultra",
        "Samsung Galaxy S20 Ultra",
        "120 megs",
        "Verizon",
        "48",
        "LTE",
        "nine",
        "60 hertz",
        "Music Share",
        "Quick Share",
        "Samsung Daily",
        "12 megapixels",
        "8",
        "RX100",
        "Android 10",
        "8x",
        "Galaxy S",
        "4",
        "45 degrees",
        "second",
        "five",
        "a minute",
        "one",
        "5000 milliamps",
        "Apple",
        "four",
        "Bixby",
        "day",
        "1080",
        "Bixby Scene Optimizer",
        "120",
        "six hours",
        "108 megapixels",
        "half",
        "40 megapixels",
        "two",
        "855",
        "iPhone",
        "30x",
        "48 megapixel",
        "16",
        "108 megapixel"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "LOC",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY"
    ]
}