{
    "id": "sUdV3fB3L8k",
    "title": "Microsoft Surface Earbuds hands-on",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-10-02T17:44:58Z",
    "video_url": "https://www.youtube.com/watch?v=sUdV3fB3L8k",
    "category": "Science & Technology",
    "tags": [
        "surface earbuds",
        "surface buds",
        "microsoft surface earbuds. microsoft surface buds",
        "microsoft surface",
        "wireless buds",
        "wireless earbuds",
        "wireless headphones",
        "headphones",
        "earbuds",
        "ear buds",
        "buds",
        "wireless",
        "bluetooth",
        "microsoft",
        "ms office",
        "microsoft office",
        "microsoft event",
        "event",
        "keynote",
        "microsoft keynote",
        "hands on",
        "first look",
        "review",
        "tablet",
        "best laptop",
        "new laptop",
        "microsoft surface pro 6",
        "surface pen",
        "2019",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "google",
        "verge",
        "the verge"
    ],
    "views": 466080,
    "likes": 6584,
    "comments_count": 751,
    "description": "Microsoft announced the new $249 Surface Earbuds, which are the second product in its portfolio of headphones after last years Surface Headphones. The Earbuds are similar to the many other wireless earbuds available already, but Microsoft has included some productivity specific features with them that you wont find anywhere else. Theyll be available later this year.  Read more:  Microsoft Surface Neo first look:  Surface Laptop 3 hands-on:  Surface Pro X and Surface Pro 7 hands-on:  Top announcements from Microsofts Surface event:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2n4Dpbi",
        "http://bit.ly/2owUIC3",
        "http://bit.ly/2ovb5za",
        "http://bit.ly/2owDKnv",
        "http://bit.ly/2n1n9I0",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- [Dan] Hey this is Dan with The Verge, and this is Microsoft's new Surface Earbuds. This is the companies first truly wireless earbuds and they follow along the Surface Headphones that were announced last year in the companies new audio line-up of products. As you can see they're pretty similar to other wireless earbuds we've seen before. You wear them in your ears, you've got a little case that you put them in to charge, and it's got a USB-C port to charge it back up, and Microsoft says these will last about eight hours on a charge, and in the case you get a full 24 hours. So it's pretty standard stuff that we've seen from other companies before. Now if you look at the design of these, you can tell that they do look a little bit different. They're quite a bit bigger than maybe you're used to from say Samsung's Galaxy Buds, or even Apple's AirPods. But they're so big because there is this touchpad on the outside that you can use to control a bunch of functions, you can skip tracks, you can raise volume, you can launch applications if you've got it connected to an Android phone, play Spotify automatically, things like that. And they like are typical sounding earbuds, these do not seal out sound, they are designed to allow ambient sound in, and here we are in the demo area. It's super loud, there's some bumping music like a club at I don't know, it's at noon right now. So it's kind of hard to tell how these things actually sound in here. But if I were playing music, I would be able to hear it through my ears and also be able to hear the ambient sound. There's no noise cancellation, or anything else like that. Now because this is Microsoft, they don't just play music. They actually do some other things, then there's some microphones on here and some technology Microsoft has developed with PowerPoint and its AI processing to allow you to speak into the headphones while you're presenting say a PowerPoint slide show, and it will live transcribe what you're saying on the screen. So I can say, \"Hey this is Dan with The Verge, \"and these are Microsoft's new Surface Earbuds. \"This is the companies first truly wireless earbuds \"and they accompany the Surface Headphones \"that were announced last year \"as part of Microsoft's new audio product line-up.\" Pretty wild. The design on the inside is a little bit different than other earbuds, this ear tip does not actually go inside your ear canal like I said before, it's not designed to block out sounds. It's supposed to let sounds in, so it kind of just rests in there and then there's a little hook on the back side of it that when you rotate the earbud into your ear it kind of locks in place. Microsoft's including a few different sizes with this so you can customize it to fit your ears and find whichever size is most comfortable and fits you best without falling out of your ear. And Microsoft says these will be available before the holidays this year, so real soon. They're gonna sell for about $250 which is a bit more expensive than what we're used to seeing from say like AirPods which start at 160, or Samsung's Galaxy Buds which are about 130. So Microsoft is really counting on the added productivity features that are coming with these to justify that price. Obviously we're gonna have a review coming for them when these are released and we'll have lost more time to test out their audio quality and see what they're like in the real world. But that's a real quick first look at Microsoft's Surface Earbuds. Hey thanks for watching. There's a ton of other stuff that Microsoft announced today, there's new Surface Pro laptops, there's new Surface laptop laptops, and then the company actually announced a new foldable thing that's not coming for another year we've got it, all of it on theverge.com and also youtube.com/theverge so please go check it out.",
    "transcript_keywords": [
        "Microsoft",
        "Microsoft Surface Earbuds",
        "Surface Earbuds",
        "Surface",
        "Earbuds",
        "Samsung Galaxy Buds",
        "wireless earbuds",
        "Surface Headphones",
        "Microsoft Surface",
        "Samsung Galaxy",
        "Galaxy Buds",
        "companies",
        "sound",
        "Microsoft new Surface",
        "ear",
        "wireless",
        "bit",
        "Headphones",
        "announced",
        "Surface Pro laptops"
    ],
    "transcript_entity_values": [
        "Surface",
        "last year",
        "24 hours",
        "Android",
        "about $250",
        "Apple",
        "Galaxy Buds",
        "USB",
        "today",
        "Galaxy Buds",
        "Spotify",
        "the holidays this year",
        "Samsung",
        "about 130",
        "AirPods",
        "about eight hours",
        "Surface Pro",
        "another year",
        "noon",
        "Microsoft",
        "first",
        "PowerPoint",
        "160",
        "Dan",
        "a ton",
        "the Surface Headphones"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG"
    ]
}