{
    "id": "SuTwCBVgfms",
    "title": "Virtual Reality for iPhone or Android!",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-07-15T15:59:01Z",
    "video_url": "https://www.youtube.com/watch?v=SuTwCBVgfms",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "vr",
        "vr headset",
        "best",
        "virtual",
        "reality",
        "virtual reality",
        "gaming",
        "video games",
        "vr gaming",
        "scary",
        "nightmares",
        "nightmare",
        "cool",
        "merge",
        "merge vr",
        "best vr",
        "htc vive",
        "vive",
        "iphone",
        "android",
        "apple",
        "samsung",
        "vs",
        "test",
        "smartphone",
        "iphone 6s",
        "iphone 7",
        "phone",
        "galaxy",
        "iphone 6",
        "6s",
        "apple iphone",
        "s7",
        "video",
        "android (operating system)",
        "iphone 6s plus",
        "galaxy s7",
        "s7 edge",
        "2016",
        "top",
        "nexus"
    ],
    "views": 2109946,
    "likes": 37012,
    "comments_count": 2791,
    "description": "(   ) --- Today's Mystery Video -   MERGE VR -   Had some fun using this MERGE VR headset. It's meant to work with a number of common smartphones and will likely fit the one you're using.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/PQEP-2KGTWc",
        "http://amzn.to/29yEz6X",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys, Lew here back with another video and today we're gonna talk about virtual reality. Probably heard about it, you've seen these big elaborate setups You know... There's things that might have been holding you back from experiencing both VR or even spherical 360 video The Oculus is expensive, requires a PC. The HTC Vive is also expensive And you might not have a Galaxy S7 or otherwise So... How do you do it? Where is the like, universal approach for this thing? and that's where this product, Merge Virtual-Reality, comes in This guy is gonna be able to accommodate most phones on the market. capable of viewing spherical 360 video and doing some of the cool VR functionality that you can now get on iOS and Android. So you see on the side here games, 3D movies, spherical or 360 videos, augmented reality Supposedly quite comfortable Plus it's this cool- like look at that it's purple! so Donatello! Ooo It is soft! I am guessing this is the head strap I am right Slide your phone in Find a couch Remain seated! Look how happy she is! Now, you can see the slot for the phone is... huge! and kinda flexible So.. I've got a Nexus 6P here Let's see if this guy goes in This is a big phone. It fits perfectly! Now on the front here there is a little pop-out section. See that? So that's gonna be so your camera can see around, for augmented reality purposes Where's my lenses here? These guys? Oooh. Nice! You can really line-up these lenses to better suit your face. I'm looking at this little wolf here Now obviously I could have headphone- ooh! Hello there young seagull I'm flying! I'm just flying with these birds Couple of birds Alright roller coaster Oh yea... whoo...hoo...ahh! whoa! No! The roller coaster thing is not... for... me on VR Full dive Yes! I can navigate from in here. This is what we need Jack This is our new VR-specific app that we always use So if you've got a universal headset like this, like not the Gear which doesn't set you up with an app in the first place, where everything is laid out This is what you need! Full dive! This looks real, real creepy... Nightmare 360 Why am I doing this right now? oh man oh man! no no no no no oh... I'm in a dark room... What am I in bed right? I'm just in bed right now... oh good good! good! oh ho ho good! Yeah! You're shining lights in my window? Aren't you? THANKS FOR THAT! ohh god Who does this for fun? and the thing is you don't even know where to look! Like you don't even What?! oh Christ! What the fff- OHHHHH! Somebody is on the computer over there OH Good! YEAH! just Why don't you just... WALK OVER HERE! WHOA! HAA! just black right now GOOD! GOOD! What the f- WHOAAA! I'm out I'm out I'm out I'm out Get this app though. What is this thing I'm messing in right now? There's so much to do in there full dive... pick that up Jack! That one! Get that one! Get that one! Right there... While we are waiting for like the full-on VR os full dive Ok so anyway... that's what the interface looks like Videos! Photos! 360 photos! There is 360 videos! and I know when I've published videos before The vast majority of people just say I am looking around on my phone That's because people don't have these things! There you have it, Merge VR... Universal VR, we are getting closer We are almost there The Matrix is waiting for you! Nightmare in 360... Don't do it!",
    "transcript_keywords": [
        "talk about virtual",
        "Lew here back",
        "good",
        "Lew",
        "videos",
        "Full dive",
        "HTC Vive",
        "video",
        "phone",
        "virtual reality",
        "Full",
        "thing",
        "dive",
        "Oculus is expensive",
        "spherical",
        "reality",
        "back",
        "universal",
        "app",
        "good good"
    ],
    "transcript_entity_values": [
        "360",
        "Android",
        "Couple",
        "Matrix",
        "Nexus",
        "HAA",
        "Lew",
        "today",
        "first",
        "Videos",
        "Gear",
        "ho ho",
        "Donatello",
        "Merge Virtual-Reality",
        "HTC",
        "Jack",
        "Universal VR",
        "Oculus"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG"
    ]
}