{
    "id": "svRDkmmjvuM",
    "title": "Intel at CES 2022 in 4 minutes: 12th Gen Alder Lake chips!",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-01-04T18:57:17Z",
    "video_url": "https://www.youtube.com/watch?v=svRDkmmjvuM",
    "category": "Science & Technology",
    "tags": [
        "intel",
        "ces",
        "ces 2022",
        "best of ces",
        "best of ces 2022",
        "intel alder lake",
        "intel 12th gen",
        "intel vs amd",
        "intel chip",
        "12th gen",
        "gen alder lake chips",
        "evo laptop",
        "foldable laptops",
        "foldable",
        "foldable tech",
        "12th gen CPUs",
        "OEM",
        "OEM update",
        "HP",
        "desktops",
        "best desktops",
        "supercut",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 220839,
    "likes": 3910,
    "comments_count": 420,
    "description": "During Intels CES 2022 keynote it announced the rest of its 12th Gen Alder Lake desktop lineup, expansion of the Evo certification program with larger, more powerful, and foldable laptops. Plus, Intels 12th Gen Alder Lake chips are making their way to laptops, promising its most powerful hardware thats capable of taking on Apples new M1 Pro and M1 Max-powered MacBook Pros. Intel also announced it started shipping its first-generation Alchemist (Arc) GPUs to OEM customers for desktop and laptop systems.  Read more here:  Nvidias new $249 RTX 3050 GPU offers ray tracing and DLSS on a budget:   Nvidias new G-Sync monitors let you switch between 1440p and 1080pL:   AT&T is giving away six months of Nvidia GeForce Now cloud gaming service:   Nvidia announces 3080 Ti and 3070 Ti laptop GPUs, says they can control your CPU, too:   Nvidia announces RTX 3090 Ti with faster memory and performance:   Nvidias GeForce Now will be limited to 1080p on Samsung and LG TVs  for now:    Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/32HZwJt",
        "https://bit.ly/3mXAdK5",
        "https://bit.ly/32SLzbo",
        "https://bit.ly/3t2rbQ5",
        "https://bit.ly/3mQEpvh",
        "https://bit.ly/3eNDEP5",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Welcome to Intel CES press conference. And today we're going to expand, the 12th Gen family further. Starting with the announcement, that we're in production of our brand new 12th Gen Intel Core KS-series processor. It has a whopping 5.5 gigahertz, single core turbo, right out of the box. And with optimizations for performance cores, we can get above five gigahertz on multi-core performance and we'll ship this new enthusiast desktop part to OEM customers by the end of this quarter. I'm thrilled to announce that starting today, we're bringing our new hybrid architecture, to performance its laptops with the launch of eight brand new 12th Gen H-series mobile processors. With up to 14 cores and clock speeds up to five gigahertz, our 12th Gen H-series delivers up to 40% higher performance than our prior generation. - You can see here, we are running the popular game, Hitman three against the best Compasso offer in the market today. When we tested it in our lab, we saw that our system's got 49% higher frame rates. And we have Riftbreaker at 27% higher FPS. Mount & Blade two, Banner Lord at 23% and Total War, Three Kingdoms at 47%. - We designed the processor family to conquer multiple high intensity workloads at the same time. Now today, I'm pleased to introduce more than 20 new designs powered by the H-series processors. From partners including, Dell, Gigabyte, HP, Lenovo, MSI, Razer, Republic of Gamers, and more. We're not only bringing this architecture performance to the enthusiast and gaming space, we're also bringing it to thinner and lighter laptops. And with that, I'm very excited to announce we're in production and shipping a new product line called the 12th Gen Intel Core P-series. This family includes six brand new processors delivering up to twice the performance above our 11th gen new series systems in market today. In total, we're delivering 28 new 12th generation Intel core mobile processors across our HP and traditional U-series product lines. Now the innovation we're driving with our CPU's is just part of the story. As you know, we've been on a mission to deliver the best PC experience with our Intel Evo Platform. And today I'm pleased to announced the third generation of our Intel Evo spec. I'm pleased to announce that we've acquired Screenovate, a pioneer and leader in delivering technology for advanced interaction between multiple devices based on different operating environments. We intend to enable new interactions with full flexibility across ecosystems, operating systems and form factors. - This new Intel technology will break through the communication barriers, no matter what your devices are, or no matter what OS you're running. So let me give you some examples. The first thing we have is we have my iPhone here, but you can see my iMessages and SMS text are showing up on my Evo laptop. Not only can I see them, I can easily reply. Now, many people also love second displays when they travel. So let me show you I can take my Android tablet and turn it into a second display. We're gonna click on our tablet, we're going to hit extend screen, and you can see how my workflow is already moving across both screens. - I'm excited to announce that we are now shipping our Intel Arc discrete GPU's for 12th Gen Core H-series mobile designs to our leading OEM customers. We will launch more than 50 mobile and desktop designs, all using Arc. One of the advantages we can offer our customers and gamers is the enhanced experiences that come with combining Intel Arc GPU's and Intel Core Platforms. Which brings me to Deep Link, a collection of technologies where our CPU and GPU architects have collaborated on the platform level, deliver better experiences with Intel art graphics and Intel core platforms. Shipping into Arc to leading mobile OEMs and broad adoption of our new technologies like XCSS and Hyperincode marks an important milestone on our discreet graphics journey. So stay tuned, more excitement is ahead.",
    "transcript_keywords": [
        "CES press conference",
        "Intel CES press",
        "Gen Intel Core",
        "Intel Core",
        "CES press",
        "Intel CES",
        "Intel",
        "Gen Core Hseries",
        "Intel Core Platforms",
        "Gen Intel",
        "Gen",
        "Gen Hseries",
        "Core",
        "Gen Hseries mobile",
        "Intel Core Pseries",
        "Intel Arc GPU",
        "Intel Arc",
        "Intel Evo",
        "Gen Hseries delivers",
        "press conference"
    ],
    "transcript_entity_values": [
        "up to five gigahertz",
        "Mount & Blade",
        "28",
        "23%",
        "Dell",
        "third",
        "12th Gen Core H-series",
        "more than 20",
        "Compasso",
        "GPU",
        "three",
        "Deep Link",
        "Hyperincode",
        "14",
        "the end of this quarter",
        "today",
        "five gigahertz",
        "FPS",
        "Evo",
        "more than 50",
        "eight",
        "5.5 gigahertz",
        "49%",
        "six",
        "Intel Arc",
        "SMS",
        "CPU",
        "27%",
        "12th Gen Intel Core",
        "Gen Intel Core P-series",
        "up to 40%",
        "two",
        "Screenovate",
        "One",
        "Intel Arc GPU's",
        "HP",
        "MSI",
        "Three Kingdoms",
        "Banner",
        "Razer",
        "second",
        "Riftbreaker",
        "Intel Core Platforms",
        "Gigabyte",
        "Lenovo",
        "first",
        "47%",
        "Intel",
        "12th",
        "XCSS",
        "Arc",
        "11th"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORDINAL"
    ]
}