{
    "id": "SwcqhZHB4To",
    "title": "Do You NEED Google?",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-06-10T02:16:54Z",
    "video_url": "https://www.youtube.com/watch?v=SwcqhZHB4To",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Google",
        "Ohio",
        "utility",
        "Ohio sues Google",
        "lawsuit",
        "common carrier",
        "Search",
        "Google Search",
        "antitrust",
        "railroad",
        "Alphabet",
        "SEO",
        "anti-competitive",
        "Duck Duck GO"
    ],
    "views": 407302,
    "likes": 27305,
    "comments_count": 998,
    "description": "Learn through Problem Solving and the first 200 people can save 20% off today on Brilliant at    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      Timestamps: 0:00 Need nutritional information 0:06 RTX 3070 Ti  1:02 Ohio sues Google  1:37 El Salvador adopts Bitcoin 2:26 Brilliant 3:08 QUICK BITS 3:15 Facebook smartwatch 3:48 Fastly internet outage 4:13 RockYou2021 password leak 4:36 ANOM FBI sting 5:01 Battlefield 2042  NEWS SOURCES  TIS THAT BIND  RTX 3070 Ti reviews        DUCK DUCK GO-OOGLE? Ohio sues Google seeking to classify it as a utility        GETTIN CRYPTIC IN HERE El Salvador does the thing           QUICK BITS  OK FACEBOOK. WATCH ME. Facebook Watch in 2022 will feature detachable cameras     KILLING ME FASTLY Fastly goes down, taking internet with it   caused by one person     ROCK SOMEONE ELSE PLEASE RockYou2021 password breach is actually.. not that bad        HOW TO CATCH A WALLABY Australian and American police catch criminals with fake encrypted chat app       ZOOKED IN A HURRICANE Battlefield 2042   rENDEzOOK    ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://brilliant.org/TechLinked/",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://youtu.be/zC0TbZq_oIU",
        "https://www.eurogamer.net/articles/digitalfoundry-2021-nvidia-geforce-rtx-3070-ti-review",
        "https://www.pcworld.com/article/3621007/nvidia-geforce-rtx-3070-ti-review.html",
        "https://www.pcgamer.com/best-buy-nvidia-rtx-3070-ti-online-only/",
        "https://arstechnica.com/tech-policy/2021/06/spurred-by-clarence-thomas-ohio-ag-wants-google-declared-a-public-utility/",
        "https://www.ohioattorneygeneral.gov/Media/News-Releases/June-2021/AG-Yost-Files-Landmark-Lawsuit-to-Declare-Google-a",
        "https://www.ohioattorneygeneral.gov/Files/Briefing-Room/News-Releases/Filed-Complaint-(Time-Stamped).aspx",
        "https://www.axios.com/el-salvador-first-country-adopt-bitcoin-legal-tender-vote-2bdd819b-620b-4385-af6b-261676883628.html",
        "https://finance.yahoo.com/news/el-salvador-bitcoin-legal-tender-120440725.html",
        "https://twitter.com/nayibbukele/status/1402507224916836352",
        "https://www.reuters.com/world/americas/el-salvador-approves-first-law-bitcoin-legal-tender-2021-06-09/",
        "https://www.marketwatch.com/story/bitcoin-is-legal-tender-in-el-salvador-what-does-it-mean-for-the-broader-crypto-market-some-bulls-think-it-could-be-huge-11623267931",
        "https://www.theverge.com/2021/6/9/22526266/facebook-smartwatch-two-cameras-heart-rate-monitor",
        "https://9to5mac.com/2021/06/09/facebook-apple-watch-competitor-2/",
        "https://apnews.com/article/internet-outage-down-fastly-7c607c931faba19584975da74c8fa633",
        "https://www.theguardian.com/technology/2021/jun/09/fastly-says-single-customer-triggered-bug-that-caused-mass-outage",
        "https://gizmodo.com/how-one-fastly-customer-broke-the-internet-1847061755",
        "https://linustechtips.com/topic/1345688-rockyou2021-largest-password-compilation-of-all-time-leaked-online-with-84-billion-entries/",
        "https://www.techradar.com/news/largest-collection-of-passwords-ever-has-been-leaked-online",
        "https://www.laptopmag.com/news/hackers-expose-84-billion-passwords-online-your-security-is-at-risk",
        "https://twitter.com/troyhunt/status/1402358364445679621",
        "https://linustechtips.com/topic/1345704-australian-federal-police-and-fbi-create-anonymous-messaging-app-to-catch-over-800-criminals-in-18-countries/",
        "https://edition.cnn.com/2021/06/08/australia/afp-fbi-anom-app-operation-ironside/index.html",
        "https://www.bbc.com/news/world-57394831",
        "https://kotaku.com/next-battlefield-game-is-battlefield-2042-1847061388",
        "https://www.youtube.com/watch?v=ASzOzrB-a9E",
        "https://youtu.be/aHr7DKGh2ww?t=39",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Man. If there was only one thing I could eat for the rest of my life, it would be tech news. - [Riley] Oh. - I'd get so fat. After cutting the cord on the RTX 3080 Ti last week. This morning, Nvidia birthed it's younger sibling, the RTX 3070 Ti. Everything went great and she's doing fine. - [Riley] Oh, that's great! - [James] So far the doctor's reviews say that at an MSRP of 600 US dollars, a 20% higher suggested price than the 3070. The 3070 Ti, isn't really worth the around 10% performance increase. Of course, as Linus pointed out in the LTT review, talking about price to performance using MSRP in this economy is kind of pointless, anyway. - [Riley] In any economy? - If you can get your hands on this card at MSRP, it's as good an option as any but please don't trample anyone in the process. Please. - [Riley] But I like it. - Looks like Best Buy is taking steps to avoid that happening again by making their RTX 3070 TI stock only available online. To GPU starved gamers, I recommend finding a different excuse to go touch grass. - [Riley] There's lots of great grass out there. - I don't get it. The state of Ohio is suing Google in an attempt to have the government declare their search engine a public utility. In this announcement of the lawsuit the state's attorney general, Dave Yost, compared Google Search to a railroad, electric company, or a cell phone tower arguing that Google's dominance and anti-competitive behavior make it necessary to force its classification as a common carrier. - [Riley] Yas! - Google said the lawsuit has no basis, in fact, or a law, that Google searches free to the consumer and that this lawsuit would make search results worse. Do you want to search for memes and get served images of meats? No. And El Salvador's Congress has officially approved the president's bill to make Bitcoin legal tender. Once he signs the bill into law, El Salvador will become the first country in the world to recognize Bitcoin as an official national currency. While this is undoubtedly a huge step forward for cryptocurrency, there are concerns that Bitcoins wild fluctuations in value could cause problems with more serious consequences than user moonman69, losing some expendable income. - [Riley] No. - Come on, moonman69 is leveraged. (Riley laughs) - Finance jokes. - Yeah, I don't get it. - But it might also give a huge portion of the population access to financial services for the first time and facilitate the transfer of money from Salvadorans. Okay. Outside the country back to their families, remittances. You go El Salvador, experiment with things while I remain largely unaffected. We're all hodling out for you. Now, its time for the quick bits brought to you by a calmer Riley. - Now it's time for quick bits brought to you by brilliant the website and app that lets you have fun while learning things. I know, I'm just having trouble with that concept but it's actually simple, brilliant uses active learning where solving problems means playing around with visual concepts and interacting with pieces of a story that you put together. There's no harsh grading, long lectures or strict time limits, and you can learn about anything. There's over 60 different courses you can master. From quantum computing to math fundamentals. The first 200 people to click our link, get 20% off. So join brilliant and it's community of 8 million learners and educators at brilliant.org/tech linked - Quick bits. You could survive on these longterm. No problem. Insider sources, have told multiple news outlets that Facebook smartwatch rumor to launch next year will include a heart rate monitor two cameras and a detachable design so that you can remove it from your wrist and film things with it. I'm sure glad it comes off. Surprising move from Facebook. I don't know why Facebook keeps trying to build a hardware with cameras in it, as people are not going to buy that stuff, but whatever. The Facebook phone exists, remember the Facebook phone that exists. That was before Cambridge Analytica? - [Riley] Yeah. - Wow, but Mark can't help himself, He has a data problem. - [Riley] Seek help! - Large swaths of the internet were out of commission briefly on Tuesday due to an outage. At the cloud infrastructure company, Fastly. Fastly was able to fix things pretty quickly and discovered the cause of the outage was a sngle customer who triggered a software bug when he reconfigured his internet connection, ah, technology. We are standing at tougher precarious, complex pillar. We do not understand built on bones. - [Riley] Everything is gonna be fine. - Many residents of the internet panicked this week when a massive trove of passwords called RockYou2021 which is my password, was supposedly leaked but it turns out it's actually just a massive dump of words with some already leaked passwords in there. The file apparently contains the entirety of Wikipedia which is definitely cool, but not dangerous. Unless you think knowledge is dangerous, which it is. Watch yourself. Australian and American federal authorities have revealed a criminal busting scheme that they've been running for nearly three years, which involves tricking members of the mafia and drug trafficking rings into using an encrypted chat app built by the feds. - [Riley] Ah! - Ah, that's funny. Over 800 criminals have been arrested. And so they're letting us know about this now because they think It's probably a good place to stop. - [Riley] 800? - That's enough. - [Riley] Oh nice job. - And then Riley only included this because he's personally excited by it. News, EA and Dice have officially released the title and trailer for the next battlefield game battlefield 2042. - [Riley] Oh Yeah! - I feel like those numbers have all been in battlefield title before. The game maps the player count to 128 and other details are probably also cool. But the important thing is it's got choppers. Choppas, wingsuits, sweet. And hurricanes not the hockey team, put those together And what do you get? - [Linus] Battlefield! Flying uncontrollably. That's probably probably enough for this so come back on Friday for more tech news and don't try eating any tech news in the meantime. - [Riley] It causes indigestion. it's not great. - 20 minutes before swimming. - [Riley] you will die.",
    "transcript_keywords": [
        "Google",
        "Facebook",
        "RTX",
        "Facebook phone",
        "quick bits",
        "MSRP",
        "search",
        "great",
        "things",
        "Salvador",
        "time",
        "tech",
        "Google Search",
        "quick bits brought",
        "battlefield",
        "compared Google Search",
        "quick",
        "Yeah",
        "Facebook phone exists",
        "Man"
    ],
    "transcript_entity_values": [
        "over 60",
        "Fastly",
        "El Salvador's",
        "nearly three years",
        "Choppas",
        "Cambridge",
        "Facebook",
        "20 minutes",
        "Riley",
        "Analytica",
        "20%",
        "Tuesday",
        "Over 800",
        "Google",
        "Mark",
        "Google Search",
        "EA",
        "600 US dollars",
        "Riley] Yas! -",
        "Congress",
        "last week",
        "LTT",
        "Ohio",
        "moonman69",
        "200",
        "3070",
        "3070 TI",
        "next year",
        "American",
        "Friday",
        "128",
        "Dave Yost",
        "Australian",
        "This morning",
        "first",
        "Wikipedia",
        "Linus] Battlefield!",
        "Nvidia",
        "Salvadorans",
        "8 million",
        "Facebook",
        "two",
        "10%",
        "El Salvador",
        "GPU",
        "Bitcoins",
        "2042",
        "this week",
        "quantum",
        "Bitcoin",
        "only one",
        "MSRP",
        "Linus",
        "MSRP",
        "Dice",
        "James",
        "3080 Ti"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "GPE",
        "DATE",
        "PERSON",
        "GPE",
        "PERSON",
        "TIME",
        "PERSON",
        "PERSON",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "NORP",
        "DATE",
        "CARDINAL",
        "PERSON",
        "NORP",
        "TIME",
        "ORDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "NORP",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "GPE",
        "ORG",
        "NORP",
        "DATE",
        "DATE",
        "ORG",
        "NORP",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT"
    ]
}