{
    "id": "SWCZWqCNB5k",
    "title": "Will Dynamips and VPCS be removed from GNS3?",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2019-08-23T14:49:20Z",
    "video_url": "https://www.youtube.com/watch?v=SWCZWqCNB5k",
    "category": "Science & Technology",
    "tags": [
        "gns3",
        "ccna",
        "gns3 vm",
        "ccnp security",
        "ccnp",
        "david bombal",
        "ine",
        "virl",
        "mcsa",
        "ccie",
        "network bulls",
        "data communication",
        "mcse",
        "ccent",
        "comptia a+",
        "gns3 mikrotik",
        "network automation",
        "packet tracer",
        "gns",
        "wireshark",
        "cisco virl",
        "icnd1",
        "gns3 tutorial",
        "virtualbox",
        "gns3 tutorial for beginners",
        "gns3 installation and configuration",
        "linux",
        "cbt nuggets",
        "gns3 vmware workstation",
        "gns3 ios",
        "qemu",
        "how to use gns3",
        "gns3 virl",
        "virl image download",
        "download cisco ios images",
        "switching gns3",
        "gns3 switching"
    ],
    "views": 8663,
    "likes": 223,
    "comments_count": 41,
    "description": "David Bombal talks to Jeremy Grossmann (creator of GNS3) about the future of GNS3. Here we discuss Dynamips and VPCS and their future in GNS3. Will they be removed from GNS3? Are they recommended? What do they actually do? What should be used instead of them?  Does Dynamips support switching?  In future videos we will discuss additional options in gns3 such as Cisco VIRL and IOU.  Menu: 0:12 - Devices in GNS3. It can be confusing. What is Dynamips 0:57 - Does GNS3 support switching? 1:17 - Are they real IOS images? 1:47 - Issue 1: Where do I get Cisco images? Cisco restrictions. 2:07 - Issues 2: Only older versions of Cisco IOS are supported on a lot of platforms 2:11 - Is it stable? Issue 3: More memory and processor intensive 2:25 - What is Idle PC Value 4:23 - Advantage 1: Supports serial interfaces 4:50 - Dynamips is a dying product 5:00 - You can run Dynamips locally 5:40 - What does Jeremy recommend we use? 5:50 - Switching in Dynamips? 7:18 - Will Dynamips be removed from GNS3? 7:48 - What is VPCS? 8:28 - What is the advantage of VPCS? 8:55 - Should we be using VPCS? 9:58 - Will VPCS be removed from GNS3?  #gns3 #dynamips #virl",
    "description_links": [],
    "transcript": "(electronic music) - Jeremy, there's a lot of devices in GNS3. So we have a lot of devices like Dynamips, we have Qumu, we have VPCS, IOSv, there's a lot of devices. It gets confusing. - Yes, its - To know what's what yeah? - Yes, it's actually the emulators. - Yup. So we have a Dynamips - So, let's go with Dynamips, 'cause that's the one that's been around for many, many years. - Yes, that's the first one we integrated in GNS3. - So that, in the old days, we used to run 20, 30, 2600, 3600, - 3725 - 7200 that kind of stuff. Yeah? - Yeah. All those legacy platforms from Cisco. - So these were only, in the old, old days - Yes - the only supported Cisco routers. - Yeah - in GNS3. A lot of people have thought that GNS3 only supports switching (*Routing), that's not true. I mean GNS3 has been able to support switching for a long time. But we'll come to that in a moment. But Dynamips is originally where it started. Yeah? - Yeah. - So, if they want to run legacy Cisco devices, like a 7200 image. This is real Cisco IOS images? - This is real IOS Cisco images. You have to download them from Cisco. - Yeah, so you get them from Cisco.com. - Or you can even really extract them from a real router. - So from a physical device. - Yes. - If you've got something like that, yeah? And when you import it into GNS3, you have to select the router type don't you? So you would select 7200? - Yes, you have to, yup. - And in the background it knows it's a Dynamips device? - Yes. - Okay, so let's look at some of the problems here. The first problem is getting images. - Yes. - Cisco have removed all of these images. - Yeah, I think you, actually you can not download those anymore from the Cisco. - Yeah, you can only get 7200's at the moment. - Yeah, at the moment and it's only IOS version 15.2. - Okay, so that's another problem. So first thing, you can only get this. Other problem is it's only 15.2, so you don't get the later releases? - No, no, no. - And is it stable or? - For the latest images it's fairly stable. But it will use more resources then with IOSv. Like, especially if you don't have Idle-PC value. - So, let's talk about Idle-PC value, what is that? - So, the Idle-PC value is like a number that you tell Dynamips. Like, how can I say it? - So, if you don't enable this, yeah. - Yes. - So if your CPU goes to 100%. - Exactly, yes, the Dynamips does not know when the IOS does not do anything. - Yep. - So that basically that value tells Dynamips, \"Oh my other Cisco IOS does not do any iterations.\" It's not like running - BJP and 100 other things? - Yes. - So, it's like a hexidecimal value, isn't it? - Yes, that's what it is. - Like, 0 x 1234, whatever it is. - Yeah, I don't want to be too technical but it's iterations that tells IOS does not run something. - And in the old days you had to go and run a process. - Yeah, you had to do it yourself. You had to, I want my Idle-PC value. You had to wait, like, 30 seconds. - Yeah. - For Dynamips to propose different values and you will pick that value and see if your CPU goes down to a few percent. - But today you don't do that. - No, today you can still do it. But usually GNS3 will propose you a Idle-PC value, a default Idle-PC value. And usually that's the one you, that works. - Okay, so basically when you do the import, like of the template - Yeah. - In GNS3, like the appliance or whatever, it will suggest a Idle-PC value which generally is good. - Yes. - And you just click next and then your CPU doesn't run at 100%. - Yes. - So basically, Idle-PC for normal, like, layman user. It's just something that if you don't set your CPU gets destroyed. - Exactly. - Anything else you want to say about Dynamips? - So Dynamips was useful so far because it supports serial connections. - Okay, yep, that's a good point. So, let's talk about all of the advantages. So, there's problems to using Dynamips. But, one of the advantages is it supports serial interfaces. But I'll say, Cisco removed serial interfaces from the CCNA exam from 2020, so. - There is no real reasons to run Dynamips anymore. - Yeah, so this is like kind of a dying - It's a dying product, basically. - And the other advantage is, you can run this on the GNS3 VM, but you can also run it locally, can't you? - Yes, you can run it locally on Windows or Mac or in Linux or in the VM. - So, just from an architecture point of view, you've got the GNS3 GUI running on your PC, let's say that's in Windows. You could run this without the GNS3 VM. Just without the GUI is that right? - Yes, yeah you could, you're on Windows, you're running the GUI, or you run Dynamips directly on Windows. - Yeah, so that was kinda like an advantage, I suppose. - Yeah. - But, you'd recommend people don't use this, you'd recommend they go to VIRL, yeah? - Yes. - And QEMU. - Yes, now we recommend the VIRL images, so VIO-- IOSv, IOSv Layer-2, ASAv, NX-Osv, Xrv, all the virtual IP addresses from Cisco. - Okay, and another advantage, but I would actually say it's a bad thing. Is that, in VIRL, sorry, in Dynamips I should say, you can use this EtherSwitch module. So, like, in the old days, like we've been doing this for a long time. You could have a 3660 router and you could insert a module here that would allow it to become a switch. - Yes. - So, you could do that in GNS3 couldn't you? - You could do that. One downside is that EtherSwitch module did not support all the layer 2 features. - It's rubbish. - It was carrying a very limited. Also, the commands were a bit different then on a regular switch. So, it was, it was okay, but it was not perfect. - Yeah, I mean I would strongly suggest that, I mean like Jeremy said, use something else if you want to do switching. - Yeah. - Don't do this, you're going to cause yourself a lot of frustration. So again, what would you use, would it be IOSv layer-2 or something? - That's one, this branch has almost all the layer-2 features you need. - Yeah so I mean that appliance can support Ether channel, layer-2, layer-3, today. It can support SPAN, it can support a whole bunch of features, it's almost, almost anything can be done here these days. Where as this, not a good thing to use. - No, no, no it's obsolete. - Yeah, so I think the bottom line is, well lemme ask you this. Will Dynamips stay in GNS3? - Maybe it will stay. We would like to remove it, but we know that some users still like it. So, we will, like, hide it from GNS3 or put, like a warning, please don't use this anymore. But it's still there if you want to use it at your own risk. - Yeah I like the way you said that, use it at your own risk. - Exactly. - So, in other words, you could use it, but it's not recommended. - Yes. - Okay, great. So Jeremy, another device available in GNS3 is VPCS, yeah? - Yes. - What is that? - So, VPCS stands for virtual PC and it's a very simple program that will emulate a PC or simulate a PC to be more accurate. And that's small program actually supports only, like, simple things like ping, trace route, you can configure an IP address. It supports DHCP and the main advantage of VPCS, it's very light weight. So, you can run hundred of VPCS nodes. That's the main advantage and it's very simple. Ping, trace route, a few other commands, it's mainly used to test your connectivity in your projects. - So, you basically configure an IP address on the PCs, yeah? - Yeah. - And then you can do like a ping between those 2 PCs across a switch. - Yeah. - Okay, but, is it something that people should still be using, what do you think? - No, the better alternative is to use a Docker, - Yup. - So you can use a Docker, it's also very light weight. And you have all the Linux commands. - Yeah. - So same as VPCS route you have ping, trace route, but you can also install - Python or - Python or any of, I don't know like - Any application - Any application that runs on Linux. You can install in a Docker container and it's very simple to use in GNS3. - So, I think it's the same thing, like with Dynamips, technologies change and technologies improve. In the old days, like quite a few years ago, this was the only way to do a light weight PC. - Yeah. - But now we've got Linux, Docker containers, and I mean the advantage of Linux is you could install anything really, DNS, DHCP - Exactly - Python - You're not limited like you will be with VPCS. So do - you also think this will go, will perhaps go away or? - That will probably be the same as with Dynamips, where we will keep it but, like, hide it a bit out of the way. But if someone still wants to use it, we'll have a warning. Or okay it's deprecated, but please use at your own risk. - Great, anything else you want to say about VPCS? - No. - Very basic. - Yeah, very basic program. - Basic PC - Basic PC. There are a few, few bugs in this program. We don't update it anymore. - Yeah, so the, use Docker. - Yes. Yup, use Docker if you can. - Great. (electronic music)",
    "transcript_keywords": [
        "Dynamips",
        "yeah",
        "Cisco",
        "run",
        "VPCS",
        "Cisco IOS",
        "IOS",
        "Docker",
        "run Dynamips",
        "Cisco IOS images",
        "IOS Cisco images",
        "IdlePC",
        "real Cisco IOS",
        "real IOS Cisco",
        "Linux",
        "IOS Cisco",
        "advantage",
        "images",
        "CPU",
        "lot"
    ],
    "transcript_entity_values": [
        "first",
        "these days",
        "Linux",
        "7200",
        "Mac",
        "Docker",
        "IOS",
        "a few years ago",
        "Cisco",
        "GNS3",
        "3600",
        "VPCS",
        "One",
        "CCNA",
        "3660",
        "GNS3 VM",
        "CPU",
        "2",
        "GNS3 GUI",
        "2020",
        "today",
        "100%",
        "EtherSwitch",
        "NX-Osv",
        "1234",
        "IP",
        "Windows",
        "a few percent",
        "Docker",
        "Dynamips",
        "Qumu",
        "Linux",
        "15.2",
        "the old days",
        "Windows or",
        "GNS3",
        "Dynamips",
        "2600",
        "hundred",
        "20",
        "GUI",
        "Cisco",
        "100",
        "BJP",
        "DNS",
        "30 seconds",
        "SPAN",
        "Windows",
        "Cisco.com",
        "VM",
        "Jeremy",
        "Will Dynamips",
        "30",
        "DHCP",
        "only 15.2",
        "Cisco IOS"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "PERCENT",
        "PERSON",
        "PERSON",
        "PERSON",
        "GPE",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "GPE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}