{
    "id": "T-UhbAcZd3I",
    "title": "iPad Mini 2021 Review: Pocketable Power!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2021-09-22T13:00:51Z",
    "video_url": "https://www.youtube.com/watch?v=T-UhbAcZd3I",
    "category": "Science & Technology",
    "tags": [
        "iPad mini",
        "iPad mini review",
        "MKBHD",
        "iPad mini 2021"
    ],
    "views": 6176594,
    "likes": 170212,
    "comments_count": 8842,
    "description": "iPad mini 2021 is the refresh this form factor deserved.  MKBHD Merch:   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   Tablet provided by Apple for review.  ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat electronic music) All right no time for the gossip No time for the gossip, gossip. - [Marques] It's like an iPad Air, but smaller. Hey, what's up, MKBHD here and the iPad Mini has always been so fascinating to me just because I always wonder who buys them and who uses them and what they use them for and why they chose it over other options. Like I know my dad uses one, but it, my sister and I got it for him as a gift so he didn't really choose it, it kind of chose him. But then I see the pilot with an iPad Mini example constantly. Like, I feel like that's in every iPad Mini keynote, but it turns out that's fairly common for hobby pilots, which is awesome. I've already realized that as a huge fan of the iPad Pro, this isn't for me, but this refresh for 2021 makes it a real option again for a lot of people. So this is my mini review of the new 2021 iPad Mini. So most of what's new here is the design refresh, which is pretty simple. The unibody aluminum, there's four new colors, and it gets all the beauty of those squared off sides, which I also think make it easier to hold. And like the iPad Air, you dropped the home button, you keep the touch ID in the form of a power button, fingerprint reader combo up top, it adds USB type C at the bottom, thank you very much. And this is actually the first iPad Mini with a camera bump that now has that new 12 megapixel camera on the back. The only real quirk though is the volume buttons, which are now also at the top. Seemed questionable at first but then you realize this new iPad Mini has second generation Apple pencil support, and that slaps right onto the side magnetically. And the pencil is literally the size of the entire side of the tablet so there's no room for volume buttons over there where they usually are, so they put them on the top. And I got used to that pretty fast anyway, mostly because I find myself using it at landscape all the time. All that being said, it's the smaller form factor to give you an 8.3 inch display that you can hold in one hand, that you can fit in smaller bags, put in smaller places, and take with you more easily. These bezels look kind of big at first, but then as soon as you start using it, you quickly realize this is about as small as bezels on a tablet can be to give yourself something to hold with your fingers before you start touching the screen. So this is the same size bezels as iPad Air and iPad Pro, just with a smaller screen. And that screen is fine. It's fine, it's an okay screen. It's 8.3 inches like I said, which is bigger than the last generation, which I think was 7.9. And it's also bigger than the Galaxy Z Fold3 unfolded, but it's a much better aspect ratio, it's closer to widescreen. But it's not an amazing quality display. So it's an LCD again, still 60 Hertz, same pixel density as last year, same not that great 500 nits max brightness as the last generation. I mean it's nice that it has full P3 color support and has true tone, but generally speaking, this is still a pretty basic display. It's fine indoors for sure, for reading, watching videos, all that stuff, no problem. I just wouldn't expect to be able to use this comfortably outside in the sun. This one's got cellular antenna lines as you can see, so it is a cellular model that now supports 5G, but just so you know, no millimeter wave 5G on the iPad Mini, which honestly is not a big deal, it's useless for most people in most places, but if you were trying to use it on one of those hotspots, Mini won't support it, but honestly, that's probably kind of a good thing considering the battery life. Probably the worst thing about the iPad Mini as tested is the mini battery. Granted, I was testing it pretty hard, using it full brightness all the time, about as much as my phone and on cellular on the go, but I felt like I needed to charge it at the end of every full day. So I could get seven, eight hours of screen on time out of it, which is good, it's a tablet and it has great standby time, but that's something to keep in mind. It might not last like a week like my iPad Pro sometimes does with light use. My use of the iPad Mini though is very generalist. Like, you know, I'm scrolling through social media, lots of emails, I'm watching videos, things like that. But that's the thing about the iPad Mini is I feel like so many people who are intending to get one already have some specific thing in mind that they want to do with it. Like I bet there's someone out there who's gonna get one of these iPad Minis and they're gonna make it the home kit, smart hub, light switch that they're gonna put in the wall in their house. Then of course you want the smallest iPad possible to do that. You know there's probably a student who's about to go back to school right now who's gonna get this and an Apple pencil, and they're gonna use this just for note taking all day. They're on this thing with the Apple pencil sketching, taking notes, writing things down all the time. And you already know, actually I do already know that there's gonna be hobbyist pilots out there that are gonna get these iPad Minis because apparently they're very popular as the small iPad you'd use to plot out your flight map and it's the one that fits comfortably in the cockpit of a smaller airplane. This is the tablet they want to use. So for me, this iPad is also fine as a super fast, $500, tiny tablet and it happens to have decent features across the board to make it versatile. The stereo speakers on either side for listening to music or watching videos like I do are really good. The new 12 megapixel camera on the back, it's plenty good for a tablet. It's basically the equivalent of what's in the iPad Air and the new ultra wide front facing camera with center stage works exactly as well as it does in the iPad Air, which is to say a little bit shaky, but perfectly fine for video calls and FaceTime or Zoom. And then of course that Apple pencil 2.0 support, which is top of the line in this price range, ties right into iOS 15 and the swipe up from the corner for quick notes and all the benefits of having a dedicated stylist that's so good. Matter of fact, it's literally running essentially the exact same software experience as all the other iPads out there, same exact software as the $800 iPad Pros, the multitasking, the slide over windows, the app library over to the side of the home screen, it's all here. And of course many people are already very familiar with it and it's all running on Apple's absolute latest chip, the A15 with the five core GPU, which is actually better than what's in the iPad Air right now. So not only will this iPad be running very smooth, pretty much locked right at 60 Hertz out of the box, but also virtually guarantees you many years of software support and iOS updates being the latest chip. The one thing that's kind of annoying in this software here seems to be all this padding around the home screen icons. So the whole UI is like a little more compressed than I remember inside of even those bezels. It just made the iPad Mini feel really mini sometimes with all that small text in the widgets, especially when that weather widget is literally bigger on the iPhone than it is on the iPad Mini's home screen. But as soon as you jump into an app though, then of course you take advantage of the bigger screen. I'm just not sure what that padding is about. So I don't personally have a use case that really fits this iPad Mini, so that's why I won't be getting one but I think those who are thinking about getting it already know, you probably already have a thing that you're imagining getting it for, something that you want it to do. And so for that, I would encourage you to think about whether or not the new 9th Gen Baseline iPad might actually be better for that because it's 170 bucks cheaper and has a bigger screen, but of course it's a different type of tablet and if you're after the Mini, then yeah, it's pretty good. Oh, but it does, actually it starts at 64 gigs, so maybe you could consider that a weakness of this. If you want to upgrade, there's only one other spec, it's the 256 gig, which is 150 bucks more. So at that point, you're playing in a different price range, but the baseline, 64 gigs, $499, if that's all the storage you need, this one's a go. But yeah, you know what would speak to me, just selfishly and maybe a little off topic. I was imagining like an iPad Mini Pro, or maybe it would be an iPad Pro Mini, but you know what I mean, like a tablet this size with a nice 120 Hertz display and of course you get face ID and then you get the Pro camera system on the back and probably a bigger battery, but then you're probably looking at like two, $300 extra, so that's probably why that doesn't exist. But yeah, at this price, what are you cross shopping it with? Like a Galaxy Tab that's out there? You could be looking at a Surface Go, or maybe you're looking at like the new Kindle that just came out with wireless charging, something like that. All of these have different specific use cases in mind. This being the most versatile of the bunch. Definitely worth a look. It's the iPad Mini, so yeah, know your use case. That's the advice I got for you today. That's been it. Thanks for watching. Catch you guys in the next one, peace. (upbeat electronic music)",
    "transcript_keywords": [
        "iPad Mini",
        "iPad",
        "Mini",
        "iPad Air",
        "iPad Mini Pro",
        "iPad Pro Mini",
        "iPad Pro",
        "iPad Minis",
        "iPad Mini home",
        "iPad Mini feel",
        "iPad Mini keynote",
        "Mini Pro",
        "Pro Mini",
        "Air",
        "screen",
        "gossip",
        "Pro",
        "Mini home screen",
        "Apple pencil",
        "tablet"
    ],
    "transcript_entity_values": [
        "FaceTime",
        "P3",
        "5",
        "iPad Pro",
        "today",
        "Apple",
        "499",
        "8.3 inch",
        "the iPad Mini's",
        "one",
        "iPad",
        "LCD",
        "Hertz",
        "Kindle",
        "four",
        "150 bucks",
        "64",
        "iPad Pro",
        "seven, eight hours",
        "8.3 inches",
        "500",
        "256",
        "iPad Mini",
        "iPad",
        "the iPad Mini",
        "UI",
        "a Galaxy Tab",
        "7.9",
        "five",
        "170 bucks",
        "first",
        "last year",
        "Mini",
        "2021",
        "A15",
        "the iPad Mini",
        "iPhone",
        "iPad Minis",
        "GPU",
        "iPad Air",
        "iPad Air",
        "all day",
        "second",
        "the iPad Pro",
        "max",
        "9th",
        "only one",
        "iPad Pro Mini",
        "12 megapixel",
        "2021",
        "60",
        "2.0",
        "iPad Mini Pro",
        "500",
        "300",
        "iOS 15",
        "iPad Pros",
        "the iPad Air",
        "USB",
        "120",
        "iPads"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "MONEY",
        "EVENT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT"
    ]
}