{
    "id": "T1QB_EkeX9Y",
    "title": "Google Pixel Fold CAN'T handle the heat! - (or anything else)",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-07-05T13:35:01Z",
    "video_url": "https://www.youtube.com/watch?v=T1QB_EkeX9Y",
    "category": "Howto & Style",
    "tags": [
        "Google Pixel fold",
        "pixel fold",
        "folding phone",
        "galaxy fold 5",
        "galaxy flip 5",
        "samsung fold",
        "pixel fold fail",
        "pixel fold durability test",
        "mkbhd",
        "pixel fold review",
        "pixel fold scratch test"
    ],
    "views": 1553744,
    "likes": 49303,
    "comments_count": 2849,
    "description": "The Pixel Fold folds more ways than one. Grab protection for your device HERE:  Today we are durability testing the Google Pixel Fold. A brand new folding device from Google. And... well... it does not do so great. The Google pixel fold is first scratched, burned,  and bent and ultimately fails the JerryRigEverything Durability test. Hopefully Google can strengthen the phone up a bit for next year. Hit that subscribe button so you dont miss the autopsy. I mean teardown.   Get my Razor Knife here!    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://www.dbrand.com/shop/pixel-fold",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://amzn.to/3JEuTXs",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Pixel Fold. Google claims that this smartphone has the most durable hinge ever on a foldable. And at $1800 dollars I would hope they're right. A phone this expensive should never just, you know, snap in half. Let's get started. [Intro] Inside the box we do get a USB-C cable and an adapter, but no charger. Foldables have been surprisingly durable up to this point. None of the 8 folding phones Samsung has ever made have failed my tests. So Google has some big shoes to fill with this first attempt. At first glance I really like the Pixel Fold form factor. But like MKBHD mentioned in his video, I noticed that the fold doesn't naturally want to fold flat. Google says on their website that their custom engineered fluid friction hinge can securely support different postures over a full 180 degrees. And that's true. With a little persuasion, it can even go slightly beyond the 180, and we'll go farther later, but naturally right out of the box it wants to sit right at around 178 or 179 degrees. Not quite 180, and that's fine. Any 5'11'' dude on Tender knows rounding up is fair game. This might bother a few people but I imagine that if you're buying a phone that costs as much as my first car, these little details are worth knowing. The hinge design looks pretty similar to what we saw in the dual screen Windows folding phone, with what looks like the hinge pivot components located in both the upper and lower bezels of the phone. Google hasn't gone into much detail about how these work, so we'll just have to tear it down ourselves to find out. The folding motion does feel very good, but as far as most durable ever...that still remains to be seen. Let's see what the exterior and interior screens are made from. The Pixel Fold is rocking a very plump 5.8 inch display on the front. We normally see plastic screens start scratching at level 2 or 3, and sapphire screens scratching at an 8 or 9. And here, with Google's latest flagship, we start seeing scratches at a level 6, with deeper grooves at a level 7. It's got Gorilla Glass Victus with no included screen protection. The interior screen is where things get a bit more interesting. This guy is a 7.9 inch display, with a normal folding phone crease down the middle. Even though Google says they are using UTG, or ultra thin glass, we can instantly tell that the surface is made from plastic, with scratches at a level 2 and deeper grooves at a level 3. Fingernails and basically anything harder than a cotton swab will leave a mark on this center screen. Nothing to complain about yet though, if a screen can flex, plastic is what we expect. The Pixel Fold does collapse flat with no visible gap. This could be a pro to help keep dirt out, or it could be a con since it also can trap dirt in. With no gap though, adding a screen protector to the inner display is out of the question. The outer screen, however, is still fair game. Like these exquisitely precise real glass screen protectors from my channel sponsor dbrand. Link in the description. There are 5 cameras on the Pixel Fold, starting with the hole punch 9 megapixel camera on the front screen which is protected by the glass. Making our way around the frame of the phone, we check two sides simultaneously, both of which appear to be made from aluminum, including the volume rocker. Now in the few minutes my phone has been alive, I've noticed that while trying to open it, the buttons are kind of positioned right where my thumbs naturally want to pry. And with the power and volume button being so close together, and both about the same shape, it's hard to differentiate between the two. So in order to tell them apart easier, you can always add your own texture to the button with a JerryRig Knife. Instant improvement. The power button also doubles as a fingerprint scanner. So we'll have to see if that part still works here in a second. At the top of the phone we have our loudspeaker grille, along with what looks like a SIM card tray, which strangely enough is made out of plastic. If I jam my SIM card removal tool into the hole real good, and I mean real good, we discovered this is in fact not a SIM card tray but actually the 5G antenna location and a microphone hole. Embarrassing. Moving on. Down at the bottom we have our 30 watt USB-C charging port, another loudspeaker grill, and of course the real SIM card tray which is made of metal. It does have a rubber ring, and interestingly enough, Google included their full mailing address for which I only assume is here for people who wish to write Google a letter asking for the return of the SD card slot. It would be a real shame if their mailbox got filled up with snail mail. Making our way around to the spine of the phone, we find that this is where we get a material change. In place of soft aluminum, Google is now using a mirror polished, multi-alloy chunk of steel. No official word on if there are gears or bristles or anything else in here. Google is a software company and doesn't really talk about the hardware that much. But you know, that's why I'm here. Hit that subscribe button, it's free, and we'll get to see the inside soon enough. The real panel is also made from unscratching Gorilla Glass Victus. The raised camera bump is also polished metal and is definitely going to get scratched up over time no matter what you do. Inside the camera visor we have our single color dual LED flash, a 10 megapixel ultra wide camera on the left, 48 megapixel main camera in the center, and a 10 megapixel 5x telephoto zoom camera on the right. And of course, we can't forget about the 5th camera, the little 8 megapixel guy mounted in the top bezel of the middle folding screen. The circular camera itself is protected with glass, but the entire metal bezel of that center screen is made from plastic. During the burn test something weird happened. Touching our flame to the exterior 1080p, 120 hertz, HDR display, we got about 16 seconds before the screen started to go white and not recover. It is an OLED. It's when we flip the Pixel Fold open to the center screen to start our burn test again on the plastic. After about 8 seconds the 120 hertz OLED decided it had enough and turned the whole phone off. And I was like, hey wait, come back, I'm not done yet. And first I thought it was maybe my finger that was resting up against the power button and that I was the one that turned if off, but the Pixel Fold didn't turn back on for about a minute and was all, 'hey, don't do that again' with a warning message on the screen when it finally did. In the 10 years we've been durability testing phones, we've never had one turn off due to heat before. Very interesting. Google says this new phone is IPX8 water resistant, meaning that it can withstand water immersion, but the X in the IP rating means that it's not rated to withstand any amount of dust. Unfortunately for humans on this planet, dust is rather prevalent. As we fixatingly fill the Fold with a fist full of filthy fossils, my famous and functional fact finding fling to see if a few fine fragments can force the fluid hinge to falter. As we focus on the fine farm fragments filtering through the flaps forward, aft, frontward, and back, frankly fear is Freudian, for the form factor of the Fold is on fleek. Functionally foiling the facinorous fight to filter into the facilities. The Fold firmly and flawlessly fights speculant foes. You feel me, Fam? Long story short, dust doesn't seem to be an issue. That was fun. So far, so good. The Pixel Fold has a fingerprint scanner built right into the power button, exactly where fingerprint scanners should all be, and it works very well. Even pre-strached with my razor it still sets my fingerprint. And after being heavily scratched up again, far more than the average scanner would ever see in real life, the phone is still able to read and unlock very quickly every single time. Thumbs up for that. The final frontier for our Folding Phone is the bend test. The vast majority of phones do survive this test, even the vast majority of Folding Phones survive. Folding shut normally, even after everything we've done, the phone is still very functional. However, one simple fold in the wrong direction and the Pixel Fold folds right on over backwards, annihilating the center screen right along the crease. A small portion of the left side is still attempting to function, but there's no lockout or stoppage of that backward motion like we see on Samsung's Fold and Flip series. With the inner flexible screen pulled out of alignment, it will now not fold shut anymore either. Now you might think that this would be embarrassing for Google who broadcast to the world that this is the most durable hinge ever. But in their defence, if you look very close, it's not the hinge that failed, it's actually the rest of the phone. The hinge itself is still in one piece and it's the antenna line near the SIM card tray, and another antenna line on the longer side of the phone that did the buckling. Which then allowed the center screen to stretch and break open. So definitely nice work to the Google hinge design team, it's just the rest of the phone that's not pulling its own weight. Even the internal battery is kink, which makes me actually kind of nervous. Google's first folding phone fails my durability test. The awkward part of this situation is that I told dbrand I would show off their new Grip Case for the Pixel Fold. However, their Grip Case isn't designed to fit the Fold in its current shape. You get the gist. Not only does the Grip Case offer protection, it also has a kickstand so you can now fold in all directions. It's also customizable with any of dbrand's Skins, like my Teardown Skin, or the all new Robot City Line, like Crime Square, or my favorite, Amusement Park. With the current state of AI, a robot uprising is now less of a fantasy and more of a prophecy at this point. So if you'd like a coloring book with an exclusive glimpse of the robot's plans for world domination, dbrand has a whole line of Robot City collectibles. And you can grab a Robot City Skin for your own device with a link in the description. We'll have to see how that 'world's most durable hinge' looks and works from the inside during the teardown video. Since it's the only thing on this phone that is still in one piece, it should be interesting to see. Subscribe if you haven't already. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Pixel Fold",
        "Pixel Fold folds",
        "Fold",
        "phone",
        "screen",
        "Google",
        "Pixel",
        "folding phone",
        "center screen",
        "Fold folds",
        "Pixel Fold open",
        "Pixel Fold form",
        "SIM card",
        "SIM card tray",
        "folding",
        "hinge",
        "camera",
        "made",
        "folding phones Samsung",
        "Windows folding phone"
    ],
    "transcript_entity_values": [
        "Google",
        "Windows",
        "8 megapixel",
        "Flip",
        "9",
        "about 8 seconds",
        "8",
        "5.8 inch",
        "MKBHD",
        "SD",
        "Tender",
        "Folding Phone",
        "two",
        "AI",
        "120",
        "IPX8",
        "$1800 dollars",
        "Folding Phones",
        "5th",
        "6",
        "the few minutes",
        "10 megapixel 5x",
        "Pixel Fold",
        "Freudian",
        "half",
        "Skins",
        "178",
        "SIM",
        "the Pixel Fold",
        "Robot City Line",
        "9 megapixel",
        "Gorilla Glass Victus",
        "Crime Square",
        "about a minute",
        "30 watt",
        "about 16 seconds",
        "5",
        "The Pixel Fold",
        "USB-C",
        "the 10 years",
        "Fold",
        "the Pixel Fold",
        "first",
        "second",
        "Fold",
        "Samsung",
        "179 degrees",
        "Fam",
        "Grip Case",
        "Amusement Park",
        "5'11",
        "Robot City",
        "3",
        "Grip Case",
        "48 megapixel",
        "180",
        "JerryRig Knife",
        "10 megapixel",
        "one",
        "180 degrees",
        "7.9 inch",
        "IP",
        "UTG",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORDINAL",
        "DATE",
        "TIME",
        "QUANTITY",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "QUANTITY",
        "ORG",
        "FAC",
        "TIME",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "FAC",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}