{
    "id": "T1wkbDxCa6o",
    "title": "They Call It The Fourza...",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-09-23T17:36:45Z",
    "video_url": "https://www.youtube.com/watch?v=T1wkbDxCa6o",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "fourza",
        "charging station",
        "charging",
        "cool gadget",
        "cool gadgets",
        "iphone",
        "android",
        "ipad",
        "best",
        "apple",
        "2016",
        "iphone 7",
        "smartphone",
        "video",
        "cool",
        "invention",
        "inventions",
        "things",
        "innovation",
        "galaxy",
        "samsung",
        "s7",
        "apple inc. (publisher)",
        "amazing inventions",
        "new gadgets",
        "awesome inventions",
        "s7 edge",
        "iphone 7 plus",
        "amazing",
        "smartphone (video game platform)",
        "new inventions",
        "iphone7",
        "apple iphone 7"
    ],
    "views": 1390326,
    "likes": 32645,
    "comments_count": 1917,
    "description": "My Episode of Uploaded (Starbucks Doubleshot channel)   This video features a cool gadget called Fourza. It's a multi device charging station for phone and tablets. It's the perfect home for your iPhone, iPad, Android device etc.  From the manufacturer -  Fourza provides a contemporary designed docking surface which supports 4 mobile devices of different kinds and sizes. Weve specifically tested Apple smartphone and tablet devices, varying different Android mobile phones and tablets all wearing standard protective cases or bumpers to fit well in the designated device slots.  Fourza features the soft rubber insert in each slot which protects your mobiles from bumps and scratches. It also secures your smartphones and tablets to prevent slip-off. You can dock and charge your mobiles equipped with a standard protective case type, military grade rugged case or extended battery case up to a maximum thickness of 15 mm.  Fourza provides 48W total power output and can charge up to 4 smartphone or tablet devices simultaneously, such as Apple iPhone 6S Plus or iPad Mini 4.The Smart IC, a core part of Fourza Charger Unit, automatically detects proper current for your mobiles and manages efficient charging cycles to ensure safe charging and to extend battery life. It also supports power cut-off for compatible devices.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://www.youtube.com/watch?v=OAKPKPd2Rl0",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys? Lew here back with another video, but before we get into today's episode I wanna give a shoutout to a cool show I got to take part in, it's called \"Uploaded\". It's on the \"Starbucks Doubleshot\" channel. They came into the studio; went behind the scenes; asked me the hard hitting questions; and came out with something cool. So I'll drop a link in the description, so you can check out that video after you're done watching this one. Charging...stuff! It's a part of your life. You do it everyday. You plug, you unplug, you re-plug, you de-plug. It's a lot of of pluggin'! And to be honest with you: I'm not happy with the way that most of the world is doing it. That includes you! Now granted, there's this magical thing called: \"Wireless Charging\" But you know, and I know we are not there yet. So until that day; We need some cool contraptions to make our charging lifestyle just a liiiiiiittle bit better, a little bit more refined. This thing came in, they've got a little mini system, for charging up multiple devices. Now if you're like me, you've got a spot in you house where you've got a bunch of things lined up. Maybe iPads, and so on... This thing aims to be, your \"charging hub\", so you can plug, and unplug in one place. Two point four amps per port; a total of a 48 watt output; so you could charge a bunch of stuff at once. Apparently, it can do some kind of standby mode when it has fully charged a device. It's also called \"Fourza\". Which is kinda like \"Forza,\" the racing game. It might not be as cool as a race car, but let's try to fool people into thinking it's just as fast. You know any time they do letters, it's for speed. It's so fast the le- the letters are leaning over. CAN WE GET INSIDE THE BOX PLEASE?!?! Thank you, Jack. Woah!... I like the- You know what? It does look fast. That is cool looking. This gonna be useful in the office! That's what it looks like. On the side here, you have 1...2...3...4 different USB ports. So no external brick; this just goes into here... Oooh! Nice little short, flat cables! I love the right cable, for the right job. So these are micro USB, and as you can see: They kinda just go into the ports here, and then up into whatever gadget it is that you wanna have charging on here. If you did wanna charge up some other device like: an iPhone, or something that uses lightning, USB-C, and so on... You would just... swap this out. Also, inside this package here are: some 3M strips. Place those in here... That makes sense! So the devices kind of have a soft footing in there. Let me go ahead and install one real quick... Lay it down... There ya' go. *Lew grunting* Agh! If you take: a phone, or somethin'. Yeah, it's gonna be a little bit more- It's gonna stick a little bit better. Did you ever watch a movie back in the day, called \"The Commitments\"? *singing \"Mustang Sally\"* *thump* Moment of truth, here! Let's-uh-get some juice, for these thirsty gadgets! No silica gel for Jack today. Unfortunately, the man's going to starve. Instead, I'll give him a twist tie. Equally appetizing... *more amazing singing from Lew* So what did I do? I used 3 of the included micro flat cables, and then I also got, a short, lightning cable as well for an iOS device. Actually, I'm going to put this one at the back, for the iPad Mini, and we are going to juice up! What is this, an S6? We can do the dance. S6 on the front. What do we have here? S7 edge, even nicer. That's gonna go second, follow it up with the LGV 10. We got two lightning bolts now, and then lastly: the biggest one of the bunch, an iPad Mini. Look at that! You could be proud of that! All your gadgets, with a nice little home. I need my iPad right now... BOOM! Today it's all about the S7 edge, boom! To be quite honest with you guys: In an environment like this; where we have gadgets galore; it is so hard to keep them all charged. So we need, an abundance of places, that they go. And even in your life, if you're the kind of person who has a lot of gadgets, or maybe a family with a bunch of different gadgets in the household; this could be a place where everybody could \"drink some juice when they're thirsty\". If you know what I'm sayin'. *plays \"Mustang Sally\" while singing along with his luscious, creamy voice of his*",
    "transcript_keywords": [
        "Charging",
        "Starbucks Doubleshot",
        "cool",
        "kind",
        "gadgets",
        "called",
        "Mustang Sally",
        "bit",
        "bunch",
        "Lew",
        "mini",
        "thing",
        "iPad Mini",
        "device",
        "Uploaded",
        "iPad",
        "place",
        "fast",
        "Wireless Charging",
        "juice"
    ],
    "transcript_entity_values": [
        "iPad Mini",
        "Mustang Sally",
        "some 3M",
        "Lew",
        "Two",
        "USB-C",
        "iPhone",
        "the day",
        "that day",
        "48 watt",
        "today",
        "USB",
        "Today",
        "Jack",
        "the iPad Mini",
        "S6",
        "S7",
        "1",
        "two",
        "second",
        "Starbucks Doubleshot",
        "2...",
        "iPads",
        "3",
        "3...4",
        "iPad",
        "Forza",
        "one"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "FAC",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL"
    ]
}