{
    "id": "T2fiQ9DSOH0",
    "title": "These MYSTERY TECH Gadgets are WILD",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2024-09-26T16:01:43Z",
    "video_url": "https://www.youtube.com/watch?v=T2fiQ9DSOH0",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "mystery",
        "tech",
        "gadgets",
        "austin",
        "evans"
    ],
    "views": 254547,
    "likes": 8298,
    "comments_count": 238,
    "description": "Check out the Reolink Altas PT Ultra:  Amazon Store:   Bond Touch on Amazon:  Tiny TV on Amazon:  MW75 Neuro Headphones by Neurable:  Scruffy Glove 3000 on Amazon:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   Chapter Titles: 0:00 Bond Touch 2:25 Reolink Altas PT Ultra 4:08 Tiny TV 6:25 MW75 Neurable Headphones 9:54 Scruffy Glove 12:09 Hummer EV",
    "description_links": [
        "https://reolink.com/us/product/altas-pt-ultra/?aff=586",
        "https://amzn.to/3XEMW7p",
        "https://austin.tech/bondtouch",
        "https://austin.tech/tinytv",
        "https://www.neurable.com/products?variant=45976725881078",
        "https://austin.tech/scruffyglove",
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- This video is sponsored by Reolink. Whoo! Hoo-hoo-hoo-hoo! Hi. This is a delightfully little box. All right, inside we've got... (chill music) Bond Touch. Uh-oh, I don't like that. And we've also got another... (spring wobbles) This looks a little sus. - [Ken] Yeah? In what way? - Bond Touch works in pairs. One for you, one for me. Do I have to do this with Ken? - Wait, what? With me? You have a wife. - [Alex] All right, all right. Before we get demonetized, it is wholesome- - Is it though? - Yes. - Where does the bracelet go? (TV beeps) This doesn't look like a bracelet. Oh, there's a bracelet underneath. Okay, okay, okay. We're better, we're better, we're better. - [Alex] All right, get your mind out of the gutter. - Yeah. - You have to, like, download the app and everything. We'll be right back after we download apps. So it took a little longer than I thought to charge, but we are now partners, Ken. - Oh boy. Yeah. - So, hello, this is us. There's a heart in between us. And now I think if we double tap on our Bond Touch's... If I double tap and start touching- - Touch me, Austin. - Okay, here we go. - Oh my God. - Ready? - Ooh. (Austin laughs) That's the touch I've haven't felt in a long time. - All right. Touch me back, touch me back. Let's go, let's go. (blaster bursts) Whoa. Oh! What a complicated rhythm of love, Ken. (Ken laughs) So if I swipe left I can add a meaning. So add a meaning. (Ken laughs) So the meaning could be \"I miss you,\" I love you,\" \"Check your phone,\" \"I'm safe\"- Whatever. - [Ken] Where's SOS? - Wait, now I'm playing it back for myself. What? (Ken laughs) - I'm touching- - I'm touching myself. This is unfortunate. - [Alex] So the Bond Touch bracelet- - Yeah. - Remember you have to buy two of them to work 'cause- - Yeah, of course. Matt makes a- - They come in a pair. - [Alex] They do not come in pair. You have- - What? - To buy them individually. Each one individually costs a hilarious $69. - Nice. - Hey. I see what they're doing here. I see what they're doing here. Ah, yeah, it is bad. Don't buy this at all. This makes no sense. There's about anything that you could do would be better than this. You could send a letter, perhaps. A phone call, a telegram. - A ring pop. - A mail- - A WhatsApp. Yeah. - [Alex] No, this is perfect because next time I go to a dinner party and I wanna leave, and I don't want it to be really obvious and send a text message, I'll be like, \"No, I gotta leave.\" - Or you could just get up and leave like a normal person. (Austin laughs) - You sure? Okay, all right, I caught it. I caught it. This, my friends, is a kind gift from our sponsors today, Reolink, and their brand-new Altas PT camera. We got ourselves the 4K camera. Look at this. You have the ability to not only tilt, but also rotate. So I can be watching you. Imagine just going like, \"Bzz, bzz.\" Is that really what the solar panel... Oh no, I guess that is what the solar panel looks like. Oh. So lemme take this outside, install it, and I will report back on how the 4K image quality has revolutionized my viewing of the outside world. I recently had to install a security camera. So this came at a perfect time. The night vision footage is especially nice, but after using the Altas PT Ultra, there are a few things that immediately set itself apart. The big headline is the humongous battery, the 20,000 mAh cell is about twice as big as similar cameras. On a full charge, you can get 96 hours of continuous recording, or up to 16 months under certain modes. Just imagine that battery combined with some solar charging. The other huge pain point for me that Reolink solved is the pre-recording mode. Traditionally, motion triggered cameras have a bit of delay. That's the difference between capturing the moment and only getting the last few seconds and trying to figure out who hit my garbage cans. I mean, it could be anything. But the prerecording means that the Altas PT Ultra enters a standby and decoding mode, so it is constantly caching footage. When motion triggers the camera, the cached footage is included with the actual footage, so you'll have the event and even the footage leading up to the event. You can even set guard points in the app so it can automatically watch everything for you. Now if you excuse me, I've got some inconsiderate neighbors to catch. A big thanks to Reolink though, for sponsoring this video. Use the link in the description to get yourself up to 20% off. Oh, hi Matt. Thanks. Ah, I did catch it, technically. This is a DIY Tiny TV? What? It's an actual 3D-printed TV with a preloaded micro SD card. So we got ourselves our little baby 3D printed TV. We have a delightfully-tiny channel remote. You see how little that is? - [Matt] It looks pretty big in your hands. - You know, I have average-sized hands, just so you know. Says that you can assemble it in less than five minutes with no soldering or special tools. - [Alex] There is a tutorial and the tutorial's four minutes. - How about I just figure it out? - Well, that's- - No! - [Ken] That's where you die. (Ken laughs) - Okay, we're at 2:30 right now, on the clock. So- - I'm shifting up. You're about to be amazed at how- - He has until 7:30, seven minutes and 30 seconds, to have this finished. (clock ticking) - All right, I don't think it's... I don't need your instructions. Look at how little that screen is. It's so cute. Much like me. - Mm, no, debatable- - I've noticed a little, I'm cute. You know that? - No. - [Ken] I knew about the little part. - Ah, you're funny. I'm gonna do a test fit to make sure everything is actually correct. And then you're all gonna have to eat your words, that I know what I'm talking about. - [Ken] Bro, 15 minutes have went by. - How long has it been? I'm well within it, see? - Well- - There's a one... There's a 1-0 there, my dude. - All right. Then we're ready- - Taught you that in school if you went to it. (TV beeps) - I just made 545,000 a (indistinct). - Built it by myself. - [Matt] Sounds super good. - I don't know that you can really blame me for that. So, for context, as we all know, the Z Flip is small, but that's a Z Flip compared to the TV. It is absolutely tiny. How much was the Tiny DIY TV? - [Alex] Okay. So, you know, it's not exactly cheap. - Okay. - But it is a DIY thing. - Yeah. - They had to make it for custom, so- - Sure. - [Alex] It was, you know, $75. (Ken laughs) - Okay. I mean- - Anytime you start with, \"So, you know...\" - Yeah, yeah, yeah. You know what? Thumbs up. Little expensive, but that was delightful. Unfortunately Ken ate it. So, uh... So much for any closeup to that one. It's pretty good! - Why do we let him do this? - Behold, my friends: The cure to all your ills in life. (soft chill music) Neurable! Does this shock me? - I hope so. - No! - Why don't you just open the box! - Inside we have... Oh, good lord. \"The Mind. Unlocked. Meet the MW75 Neuro.\" Oh, there's a letter. There's a letter! \"Austin, we are thrilled to introduce you to a groundbreaking advancement in audio and neural technology.\" They're headphones! Wait. - Oh. - Neurable AI headphones? \"We can't wait to see how our headphones help you achieve more with the power of Neuro technology. Welcome to a new dawn of human-tech interaction.\" Oh, this is \"Black Mirror.\" I don't like this. I don't like this! So this is actually a collab product, because it's with Master & Dynamic, who I know are a pretty well-respected audio company, from my understanding. But it's powered by Neurable AI. So my first question is, how is this going to interface with my brain? Because, sure it's not just like a regular pair of headphones, right? - Let me read this line to you. - Please, describe to me what I'm looking at here. - \"The MW75 Neuros' EEG sensors- - Oh! - Track your focus while you work and study to reduce burnout. - So it actually is EEG scanning my brain? - Mm-hmm. - This seems like something I need to spend some time with. Because as much as it's all fun and games... I guess the idea, the pitch, is that if this can actually work in determining your stress levels, or whatever fidelity, the data they can pull out of an EEG, it could maybe tell you like, \"Hey, you know what? You're burning out, time to take a break,\" or something. I struggle a little bit with, like, how useful that could be, because I feel like, at least for me, when I'm tired, I know it, 'cause I feel tired. - [Ken] So, like, the reason why they gave you the games there is, for example, like, you play- - Aw- - You play the games, like, just to get, like, a sense of how your brain operates. - Yeah. - And whether or not it'll get distracted in certain places. - Sure. - And it'll help you min/max- - So basically- - Force you- - I put the headphones on and I'm listening to you talk, and I start to zone out, the headphones will tell me that what you're saying is boring, I should pay more attention. - Yeah. - All right, so I have now spent a few days with these Neurable headphones, the Master & Dynamic MW75s, and I have some thoughts. So first and foremost, I learned a lot more about these headphones. And they're pricey. So these are (laughs) $700 headphones. Now, before you scoff, they are based on the existing Master & Dynamic design, which are $600. So really, you're paying an additional hundred dollars for the Neurable AI tech. Now, the way these work is, inside the app, you can do a few different things. So, essentially, it is supposed to measure your brain activity to determine focus. It works okay. So my downsides here are that the information doesn't feel enormously useful to me, if I'm being entirely honest with you. It's nice to know, \"Hey, guess what? My headphones are telling me that I had five minutes of really high focus and a few minutes of low focus,\" and you know, it can give you a notification like, \"Hey, you know what? Maybe it's time to take a break. You're not paying as much attention.\" But as much as I think it's cool, I cannot say that this is worth $700, right? The headphones are decent. But... I feel like it maybe needs a little bit more time in the oven. (wind whooshes) Okay, I'm glad- - The \"Mystery Tech\" budget was a little low today, so... Whoa! Is that birch? Is it? No, wait, wait, is it pine? Oh, perhaps it's... I don't even- - It's pine. That one's pine! - It's pine! - What do you notice about that that... - [Alex] Yeah, like what's the texture? - The texture is wood. The smell is wood. - [Matt] Would you say it's coarse? - You would say something like that. I think that's fair to say- - Well, we can solve that. - Okay. The Scruffy Glove 3000. Is this sandpaper gloves? - Yes. - Yo! - It's definitely not recommended that you use this for... Nevermind, nevermind. - Okay, all right, all right. So, the Scruffy Glove 2000 and 3000 are designed for color sanding. \"They work great to prepare surfaces for polishing and buffing.\" So I guess the idea is that if you need to sand and buff your vehicle before a little bit of paint action, or perhaps you want to gently caress something with a fine paper equivalent of 400 to 600 grit, then you could do it. - Grip it and rip it, boy. (Alex laughs) There you go. - Okay, so I'm just gonna gently sand it. - [Matt] You wanna be going up and down to give a nice, even- - I like to say- - [Alex] You want a long stroke, not- - Yeah. - I played this game before. - I will say- - \"Splinter Cell.\" (Matt and Alex laugh) - You know what? Though, actually... Here, does anyone wanna evaluate my wood? (Alex laughs) - Wow, it's so much smoother. - Yeah. - A lot thinner than I thought it'd be. - Took me away. - It did work. - I missed a spot here. (poignant music) - Yeah. - You see all the wood shavings that are just falling off right now? - Austin- - Oh God. - Austin looking like he found the Sears catalog for the first time. - Anyone will tell you- - Good Housekeeping. - Good sanding, long strokes. - \"Housekeeping.\" - That might be the most polished piece of wood I've ever seen. Hmm. (silly music) Wait, was this \"Mystery Tech\"? - Yeah- - Where was the tech part? - Dude, we've been shooting \"Mystery Tech\" for like 20 minutes. I don't know why you decided to do that. (wind whooshes) - Hello. - Hello. - Oh no, it's something he wants. Yeah, he's being gentle with it again. He's being... Look at the look on this man's face. Look, he's smiling- - Anytime it's something he wants to take home- - He's like, \"Oh look, here is\"- - Walking gently over and place it down- - My AirPods 5. Oh, ho, ho! - AirPods 4- - AirPods 4- - And you're getting some. - Okay, is that... But the... (crickets chirping) So this says \"Hummer\" on it. - [Ken] Yes. I've had it on pre-order for the past, like, two years. - This would be a lot funnier if Ken had not actually purchased a car for \"Mystery Tech\" a few years ago. But that car was like five grand or something. The Hummer's like a hundred. Did you borrow this car, perhaps? - I mean, like, does a lease count? (all laugh) - That is a... It's just a loan. It's a 36-month loan. I mean... Let's go outside and see what the hell Ken has done this time. - All right- - Oh my God. - Here we are. - It's so big! - [Ken] I know. - So- - Okay. - This is one Austin for scale. It's... It big. - The reason why I really wanted it. - Uh-huh. You really wanted it. - I really... Yeah. I mean, we wanted it. - Uh-huh. Oh God, what do you... Oh, are you doing crab walk? - [Ken] It's sick, right? - Oh, that's actually really cool. - [Ken] It's kinda cool! - So this is the standard SUV. So they also make a truck version of this. I'll say, as much as Ken's joking, this was a loaner from GM, who let us borrow this truck- - For 36 monthly payments. - No, not true. - Of $1,500. - Not true. Definitely not true. Let me spend some time with this Hummer EV and we'll find out what it can really do. So I've been living with the Hummer for almost a week now and I have a lot of thoughts This is a ridiculous vehicle. But in a good way. If you own a Hummer EV, whether it be the SUV, which is what we've got here, or the truck, you gotta have a sense of humor. You can't take something like this seriously. This is a nearly 9,000-pound vehicle. To put that into perspective, the battery alone, inside of this Hummer, weighs as much as a Honda Civic. We're talking about 3,000 pounds of battery. So this will do fast charging, right? So you could do, I think something like 200 kilowatts on the SUV. If you go to a fast charger or for a home charger, obviously it'll run at like, you know, seven, eight kilowatts, which is what I usually do at home. The problem is, because the battery is so big, I plugged this in at 40%, it took 15 hours to get to 95%, right? Any other vehicle would've been fully charged at that point. So you just kinda have to think about it just like how a gas tank that's double the size takes twice as long to fill. Well, think about that when it comes to the battery. It's clear that, like, they have definitely put a lot of emphasis in trying to make this a fun, interesting, different kind of thing. And it does accomplish that. I really do like the Hummer. But you gotta have that sense of humor 'cause otherwise this thing makes absolutely no sense. It's huge, it's impractical. It is going to double your electricity bill 'cause you gotta charge it all the time. And you definitely get a lot of looks. It is though, fairly livable. If you can get past the idea that it's a really wide vehicle and it's kinda hard to park and whatnot. The four-wheel steer works wonders in helping you. I mean, I could make a U-turn in this better than I can in my Lexus IS 500, right? Those rear wheels turn it like, some... I don't know what the degrees are, but like, they really, really crank. And there's a lot that's delightful about this. You know, like, it makes me laugh every time I punch the throttle and feel 800 pounds sending this 9,000-pound SUV fricking sitting up on its rear wheels, right? It just... I gave my mom a ride in this, I punched it, and she goes, \"Are the front wheels even on the ground?\" (laughs) Like, it's such a silly, ridiculous thing. And after having spent some time with the Cybertruck, I'll be honest with you, I don't like the Cybertruck. Like, it feels like a regular Tesla. The Hummer, it is more impractical. It is a little bit bigger when it comes to the width, and trying to fit things. And like, it's obviously not an apples-to-apples comparison. But the difference is the Hummer feels like it's not taking itself so seriously. In the infotainment system, you can see your high scores on the max drift angle you've ever had, in an almost 9,000 pound SUV. You can see your max pitch, your max roll. It is a completely absurd thing to try to do any of this stuff in this huge SUV. If you own one of these, the real downsides are just that it is enormous and somewhat difficult to park and work with. It is a little bit loud, given how huge the tires are, and how unaerodynamic it is with wind noise. And the stereo is bad. This stereo is, like, fine on like a $25,000 car. This thing costs over a hundred grand. Bose or not, sounds bad. But this is not for luxury. This is for someone who wants to have fun in a giant, ridiculous lifted Hummer. And all I can say is, \"Hell yeah, America! Brother.\"",
    "transcript_keywords": [
        "Yeah",
        "Hummer",
        "time",
        "Bond Touch",
        "Touch",
        "headphones",
        "Mystery Tech",
        "Ken",
        "SUV",
        "Touch bracelet Yeah",
        "work",
        "tech",
        "Bond Touch works",
        "minutes",
        "big",
        "Wait",
        "lot",
        "thing",
        "good",
        "Neurable"
    ],
    "transcript_entity_values": [
        "a few years ago",
        "America",
        "36-month",
        "Hoo-hoo-hoo-hoo",
        "first",
        "two years",
        "The Mind",
        "WhatsApp",
        "Altas PT Ultra",
        "Meet the MW75 Neuro",
        "1",
        "two",
        "Matt",
        "four",
        "eight kilowatts",
        "one",
        "9,000-pound",
        "Sears",
        "36",
        "800 pounds",
        "7:30",
        "69",
        "40%",
        "buff",
        "200 kilowatts",
        "Mystery Tech",
        "600",
        "night",
        "96 hours",
        "a few days",
        "four minutes",
        "15 hours",
        "nearly 9,000-pound",
        "almost a week",
        "Ken",
        "Neurable",
        "Austin",
        "almost 9,000 pound",
        "20 minutes",
        "Hummer",
        "SOS",
        "a few minutes",
        "ho",
        "Bzz",
        "Neuro",
        "Black Mirror",
        "this Hummer EV",
        "500",
        "Reolink",
        "DIY",
        "1,500",
        "seven",
        "today",
        "an additional hundred dollars",
        "15 minutes",
        "545,000",
        "a hundred",
        "2000",
        "20,000",
        "600",
        "seven minutes and 30 seconds",
        "95%",
        "the Master & Dynamic MW75s",
        "Honda",
        "Cybertruck",
        "Tesla",
        "700",
        "SD",
        "3000",
        "max",
        "One",
        "less than five minutes",
        "Ken] Bro",
        "Bond Touch's",
        "Lexus",
        "25,000",
        "Alex",
        "monthly",
        "about 3,000 pounds",
        "The MW75 Neuros' EEG",
        "up to 16 months",
        "GM",
        "Master & Dynamic",
        "Housekeeping",
        "Altas",
        "bzz",
        "the last few seconds",
        "Altas PT",
        "Neurable AI",
        "400",
        "4",
        "Austin",
        "a Hummer EV",
        "five",
        "up to 20%",
        "2:30",
        "Civic",
        "Bose",
        "75",
        "five minutes",
        "Reolink"
    ],
    "transcript_entity_types": [
        "DATE",
        "GPE",
        "DATE",
        "PERSON",
        "ORDINAL",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "MONEY",
        "PERCENT",
        "PERSON",
        "QUANTITY",
        "WORK_OF_ART",
        "MONEY",
        "TIME",
        "TIME",
        "DATE",
        "TIME",
        "TIME",
        "QUANTITY",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "TIME",
        "PERSON",
        "PRODUCT",
        "TIME",
        "PERSON",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "MONEY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERCENT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "TIME",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "TIME",
        "GPE"
    ]
}