{
    "id": "t2gDnUFT43M",
    "title": "Buy a MacBook, Stupid.",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2021-03-20T22:17:17Z",
    "video_url": "https://www.youtube.com/watch?v=t2gDnUFT43M",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "apple",
        "macbook",
        "MacBook air",
        "MacBook pro",
        "mbp",
        "mba",
        "m1",
        "apple silicone",
        "apple silicon",
        "m1x",
        "windows",
        "microsoft",
        "dell",
        "xps",
        "lg",
        "gram",
        "Lenovo",
        "x1",
        "hp",
        "best laptop",
        "best thin and light",
        "tech",
        "technology"
    ],
    "views": 88737,
    "likes": 4091,
    "comments_count": 577,
    "description": "The MacBook is what MOST people should buy right now.   Check out Dave2D's video:  This Is NOT a Gaming PC   The Future of Xbox:  It's Time To Switch to Edge:  Why the PS5 is LOSING Money:  The USB Lie Detector:   Get Austin's super awesome shirt here:   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/ztTY788z9NE",
        "https://youtu.be/29RFioXelK4",
        "https://youtu.be/xYnlmhbZgxI",
        "https://youtu.be/E_Hx6yaBowM",
        "https://youtu.be/zjv0RHRfqvE",
        "https://youtu.be/apt0ciQyyuY",
        "https://matt-ansini.creator-spring.com/?",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to This Is Austin. Why is everyone else a big old dumb dumb. - Well I mean, there's lots of reasons, but my friend Dave2D did an excellent video recently that I feel like I really wanted to do a response to. And he did an excellent video explaining why, you know what? You should really consider switching to a MacBook. Now, not to completely cred Dave's video but I couldn't agree more. I actually think there is a real reason, more so than I think has ever really been there before for you to switch to a MacBook at this very second. OK - Yeah. - Let me pitch you. Let me pitch, a person who has a MacBook in front of them right now. So if you have a flexible sort of workflow, right If you're not using your laptop for gaming, if you don't need something which is huge and has like dedicated GPU for like 3D rendering or something. If you're looking for a quote, unquote normal laptop, there are a lot of reasons why the MacBook is a pretty clear winner, okay. - Yes. - First of all, performance, we talked about it we've talked about, we've talked about it. The M1 inside the MacBook is straight up more powerful than pretty much any laptop you can buy on the PC side, right? Maybe there's some gaming laptops that have a little bit more performance-- - Which are? - on the graphics side. - Which are six, seven, eight times the thickness - And have one third of the battery life. Look, it's a completely different category. - Yeah - Even then on the CPU side, the M1 still looks very very good against a lot of these laptops, right? So performance is certainly there even on something like the MacBook Air which I think is probably the best laptop for most people. completely fan less, totally silent. The battery life is solid. So I actually use the Pro usually but I mean the Air still get like 12 hours of battery life right? - Oh, I do game on this. Great at playing World of Warcraft. WoW is not a demanding game in any way shape or form. - But still though, - Yeah, like, so to say like, I get it. The gaming is not really something you can do on here but that's just because software doesn't really support it. But the software that does support it it runs really, really well. - So on top of performance, you also have battery life. That's I think a really big one, right?. Windows laptops have had good battery life for years, right? But the thing is the battery life. Like they get around it by brute forcing it by having a laptop which still has the fan that still gets a little bit warm. And you know, you have this huge battery inside which adds to the weight. The nice thing about the MacBook Air and the Pro is that they don't have these massive batteries but because they're so efficient you're still getting ridiculous hours of battery life. So for reference, right? So I use the 13 inch MacBook Pro as my main daily system. The other night I was editing a video in bed, right. Completely quiet even though it has a fan, it wasn't even kicking on. So I was rendering out a 4K video. And even after I had spent a solid hour editing it still estimated that I have about five and a half hours of battery life left. If I'm not doing something as intensive as 4K video editing I can routinely get 12, 13 hours. So there are certainly some of these major things but you probably know all this, right. You've probably already seen the videos talking about M1 and the performance, but then if you put it in context, right, I think there's some real reasons why if you're able to switch to a MacBook (indistinct chatter) it makes a lot of sense. First of all, the hardware. These laptops are actually reasonably priced. - This model right here is the absolute basic MacBook Air no upgrades to it, whatever. Eight gigs of RAM. - Nine ninety nine, - Nine, nine, nine. A thousand bucks. - Yeah. You can get cheaper Windows laptops. They're nowhere, nowhere near this build quality. This hardware to me is I don't think there's competition - There is certainly like manufacturers such as I'll give a shout out to Dell Their XPS 13. They do a good job. - They're really good. I do think this is still better - And cheaper - at a thousand bucks. This is cheaper. - The base XPS 13 is barely in this kind of price range. And even then I would say the MacBook air has a better overall build because they better, right Now that you have that nice build you have a great screen. It might not be touch which is one of the things you lose, but not a deal breaker for most people would be my thought - The Trackpad is, I think, perfect. I've talked about this a lot. I'm at the point in my life tech wise where I care way more about how something feels how it like, how it feels to hold, to touch. That's what I care about in a PC, because I'm doing mostly I'm browsing Internet, I'm doing email. I'm using Google Docs for anything, you know, doc related. So really the only thing I'm doing intensive on here is WoW , but then Photoshop. - Yeah. Which is not updated yet on M1. - No, it's not. So Photoshop is still (indistinct chatter) but it's not terrible. - But Photoshop is one of the outliers of software that has not been updated. Right? So one of the other things specifically when you look at the ARM on Windows transition has been that most apps don't really support it. It has to run ARMulation, which is very slow. On these, not only have the vast majority of the apps I can only think of a couple apps that I use and they're not intensive at all that have not been updated. And even so-- - I don't think I have any, besides Photoshop - The performance is still not bad, right? The performance is still really, really solid, like they've done such a good job with this transition that you're not losing. If you're going from Mac to Mac you're losing almost nothing. And if you're going from something like a Windows PC running After Effects, then yes ,you're probably gonna lose some performance but that's something that they are working on also. It's still not even that bad. - We're so like, where I was going with the feel of things for a cheaper laptop than a thousand bucks, you're getting way less performance but often it doesn't feel good to use those laptops. - Yeah. - All the things that make this comfortable to use on a daily basis. Because like, yeah, you say like, Oh, I'm an engineering student who needs blank. Okay. Then maybe we're not talking to you about this one. - If you want a game on pretty much anything besides WoW. Or some randomness from the App Store, a Mac is not for you. But I would argue for me and for a lot of people , if that's not a huge issue on a 13 inch thousand dollar laptop - If you're just browsing Reddit all day or doing schoolwork I think this is the one you should be getting. And I'm completely in agreement with Dave on that. - On the Mac side, That is one thing I will say, long-term right. When you think like eight, 10 years from now Generally speaking Macs are supported for like seven to eight years before they stop getting updates. Whereas on the Windows side, you're probably gonna get a Windows update forever at this point, right? I mean, you can run systems that came with Vista. They can run Windows 10 pretty well, actually. But on the flip side, the longevity of something that this specific with the MacBook Air I think is something that is easy to overlook, right. Now I do max with a lot of resale value but they do that because they hold together well. How many people use a ten-year-old MacBook or something? And it is still 100% functional. And though especially with the MacBook Air - Yeah. I know one friend who still uses the 17 inch MacBook Pro. - That's what? Eight years old, nine, 10 years old, - Something like that because he pulled out the optical drive, put in SSD, like it's Frankenstein - And the Air is actually probably the most sort of long terminable laptop because there are no moving parts. It is fanless. It is essentially sealed up. There's not a lot of room for dust or anything to get inside. It's a very straightforward design but it has been (mumbles) perfected but they've done a really good job. Even something like the ports, right? How much did everyone complain when the MacBook the 15, the 2015 MacBook with the one port came out, everyone complained about it. It was a brand new port. It didn't work well, blah, blah, blah, blah, blah. Pretty much all Windows laptops, not all but a lot of Windows laptops in this kind of thing like category only have USB-C or maybe have one USB-A. Yes. I would like to have more than two ports but that went from being like, Oh, this is a major downside to like pretty much normal and fine. - Which is always kind of the case with Apple. They always do it. They get the flag and then everyone else just follows. And does the same? - Yeah. - I like, I will say that I have not really felt the need for extra ports. I mean - I do. So I use a YubiKey, so that pretty much eats up. One of my USB-C's 24/7 , which is annoying. - I normally, I don't have it on here right now, but I would be fine with the two ports if it was just on either side (mumbles) the only thing that I really have felt. Because I dock my system a lot. It's just, I have to do a weird docking with it because it's all on the side. - Sure, sure - It's picky. But like whatever. - The thing is like this, right? The MacBook at this moment is farther ahead of a PC that Mac's pretty much ever been. Now who knows what the future holds. My prediction is that Apple Silicon they're really far ahead of Intel and AMD right now. And I think they will continue to be far ahead over the next several years. But the downside to something like that is that while yes you were locked into choice, it's hard to know what the future holds, right? There could be incredible new Intel, AMD processors. There's all these new form factors. So I actually don't know what the future will hold for a Mac in two, three years versus Windows. All I know is this. If you were purchasing a laptop and the category of you know, a thousand-ish dollars and something which is sort of portable, you basically need a good reason why you don't want a Mac. That's the way that I would do it. It's either software either you don't have software that will run well on the Mac, or are you looking for something like that ZenBook Duo that we recently took a look at which has two screens. It's a different kind of use case. If you need one of those things, if something like that appeals to you by all means, go for it. But I would say for 80% of people who are buying these sort of premium laptops, the MacBook Air is affordably priced Super, super powerful really well-built ,excellent battery life. It is so rare to have a single product check so many boxes. And this might be a rare moment in time where the MacBook is not only the most powerful but also just the best overall system and is not that expensive. Like - Because you can see like, all right - Let's, we'll use the XPS 13. Cause that's what 1400 bucks. - It depends on how you spec it. You can get it cheaper, but if you want to get it a reasonable spec, it gets up there. - But like, all right, let's say the base spec. Sure. Are you gaming on the base spec XPS 13? - You can do a little bit of gaming especially with 11th gen Intel stuff. The GPs are actually pretty decent, but it's still limited. Now of course you have this side use case you can plug in a spendable dock like right. - But then that jacks up the price like suddenly it's, you know, three, $400 more to do that. It's then at that point, a lot of people will say, well why not just get a desktop PC at that point? - There's you can go down that rabbit hole for a while. But I agree the game performance of an equivalent Intel, AMD system in the same kind of form factor is gonna be better. - We have all these things like Nvidia GeForce now. So you still like , I've played my Steam games on this, just fine. - Sure. Yeah. - Like it's - And there is actually still Steam on the MacBook. - Yeah. - You can still stream your own games as well. Right? - So like, like the other game, I play Civ , Civilization. I liked that. I mean, again, not a crazy demanding game but it looks great and it runs just fine. And there is a child screaming out in the hall. - There is a child screaming outside the door, but that's fine. That's the screaming child known as Intel and AMD because Apple is here to eat their lunch. Thank you very much for watching this episode of This Is. Make sure to subscribe and Ringling the ding-a-ling bell for other hot takes like your PC is garbage, bro, buy a Mac hashtag not an ad. People use hashtags anymore. I feel like I'm out of touch with the kids. - Yeah, you are.",
    "transcript_keywords": [
        "MacBook Air",
        "MacBook",
        "battery life",
        "Windows laptops",
        "Windows",
        "Air",
        "Mac",
        "Yeah",
        "laptop",
        "laptops",
        "battery",
        "MacBook Air Yeah",
        "life",
        "lot",
        "performance",
        "side",
        "pretty",
        "thing",
        "things",
        "MacBook Pro"
    ],
    "transcript_entity_values": [
        "hours",
        "the App Store",
        "Windows",
        "AMD",
        "three",
        "Reddit",
        "Air",
        "three years",
        "CPU",
        "Eight",
        "17 inch",
        "12 hours",
        "One",
        "Super",
        "80%",
        "RAM",
        "1400 bucks",
        "11th",
        "2015",
        "M1",
        "Windows 10",
        "GPU",
        "13 hours",
        "nine",
        "two,",
        "MacBook Pro",
        "daily",
        "Austin",
        "USB-C's",
        "12",
        "MacBook",
        "YubiKey",
        "seven to eight years",
        "ten-year-old",
        "a solid hour",
        "Mac to Mac",
        "Dell",
        "13 inch thousand dollar",
        "Ringling",
        "Eight years old",
        "Windows",
        "AMD",
        "nine",
        "eight, 10 years from",
        "thousand-ish dollars",
        "100%",
        "World of Warcraft",
        "a thousand bucks",
        "Apple Silicon",
        "Vista",
        "4",
        "400",
        "XPS",
        "Macs",
        "USB-C",
        "second",
        "Intel",
        "nine, 10 years old",
        "First",
        "Frankenstein",
        "thousand bucks",
        "Google Docs",
        "one",
        "Mac",
        "Apple",
        "ZenBook Duo",
        "more than two",
        "about five and a half hours",
        "13 inch",
        "XPS 13",
        "eight",
        "six",
        "Nine ninety nine",
        "years",
        "MacBook",
        "15",
        "two",
        "Dave",
        "the next several years",
        "all day",
        "MacBook Air",
        "SSD",
        "Mac",
        "one third",
        "the MacBook Air",
        "seven",
        "max",
        "Nvidia GeForce"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "MONEY",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "DATE",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PERCENT",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "PERSON",
        "MONEY",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG"
    ]
}