{
    "id": "t4TbEqKmdPc",
    "title": "The RTX 3060 can STILL MINE!",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-03-11T02:29:43Z",
    "video_url": "https://www.youtube.com/watch?v=t4TbEqKmdPc",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "rtx 3060",
        "ETHEREUM",
        "mining",
        "limiter",
        "unhackable",
        "hacked",
        "3060 limiter",
        "rtx 3060 mining",
        "cryptocurrency",
        "octopus",
        "rtx 3060 hacked",
        "hack",
        "hash rate"
    ],
    "views": 511445,
    "likes": 32955,
    "comments_count": 1153,
    "description": "Learn through Problem Solving and the first 200 people can save 20% off today on Brilliant at   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      Timestamps: 0:00 Oh look! tech news 0:11 RTX 3060 actually NOT hacked 1:09 Apple gets tracking complaint 2:21 Bethesda is Xbox now 3:16 Brilliant 4:00 Shadow is bankrupt 4:33 ASUS ROG Phone 5 5:07 Russia breaks its own internet 5:37 ArtStation cancels NFT plans 6:14 HTC Vive Facial Tracker  NEWS SOURCES  YOU HAVE MY PERMISSION TO MINE RTX 3060 mining limiter hacked but not actually     ABT: ALWAYS BE TRACKIN Antitrust complaint over Apples anti-tracking iOS 14 feature     Google   T-Mobile selling data to advertisers    TRANSACTION COMPLETED Microsoft acquisition of Zenimax (Bethesda) approved          QUICK BITS  INCOME STREAMS DECLINING Shadow game streaming company goes bankrupt      RAMMED IT IN ROG Phone 5 launches with 18GB RAM, two USB ports  The new norm   IN SOVIET RUSSIA, INTERNET THROTTLES YOU Russia tries to throttle Twitter, throttles whole Internet instead   Russia + China plan their OWN Moon Base     NO, EFF THAT NFTs dont belong on ArtStation apparently      READ MY (AVATARS) LIPS HTC Vive Lip reader, VR body tracking       Or just get StonX      ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://brilliant.org/TechLinked/",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://wccftech.com/chinese-cryptocurrency-miners-allegedly-bypass-nvidias-geforce-rtx-3060-hash-rate-limiter-delivers-up-to-50-mh-s-in-ethereum/",
        "https://twitter.com/LinusTech/status/1369677979123523584",
        "https://www.pcgamer.com/nvidia-geforce-rtx-3060-hash-rate-limiter-cracked/",
        "https://linustechtips.com/topic/1313686-french-antitrust-complaint-alleges-that-apple-serves-targeted-ads-without-consent-while-preventing-other-services-from-doing-so/",
        "https://9to5mac.com/2021/03/09/french-antitrust-complaint-alleges-apple-allows-itself-to-run-personalized-ads-on-ios-without-getting-user-consent/",
        "https://theconversation.com/googles-scrapping-third-party-cookies-but-invasive-targeted-advertising-will-live-on-156530",
        "https://www.engadget.com/t-mobile-ad-targeting-program-205736695.html",
        "https://linustechtips.com/topic/1313605-updatethe-final-hurdle-for-the-ms-zenimax-buyout-has-been-removed-eu-approves-the-buyout-unconditionally-sale-has-been-officially-confirmed/",
        "https://www.youtube.com/watch?v=xy2930hAXnc",
        "https://www.eurogamer.net/articles/2021-03-09-microsoft-confirms-some-bethesda-games-will-be-full-xbox-and-pc-exclusive",
        "https://twitter.com/aarongreenberg/status/1369294480675762177",
        "https://linustechtips.com/topic/1313768-blade-the-firm-that-operates-cloud-gaming-platform-shadow-filed-for-bankruptcy/",
        "https://www.gamesindustry.biz/articles/2021-03-08-cloud-gaming-firm-blade-seeking-investment-after-filing-for-bankruptcy",
        "https://www.kitguru.net/lifestyle/mobile/matthew-wilson/asus-launches-rog-phone-5-with-up-to-18gb-of-lpddr5-memory/",
        "https://www.pcmag.com/news/sk-hynix-is-mass-producing-18gb-lpddr5-memory-modules-for-phones",
        "https://arstechnica.com/information-technology/2021/03/russian-attempt-to-throttle-twitter-appears-to-backfire/",
        "https://www.axios.com/russia-china-moon-research-station-plans-f3504927-e9ed-4921-b7f9-7f430cb93aa7.html",
        "https://linustechtips.com/topic/1313576-artstation-goes-nftand-give-up-by-the-end-of-the-day/",
        "https://www.makeuseof.com/artstation-nft-platform/",
        "https://amp.artstation.com/magazine/36821?__twitter_impression=true",
        "https://www.pocket-lint.com/ar-vr/news/htc/156074-htc-vive-facial-tracker-official-joined-by-next-gen-tracker-3-0",
        "https://twitter.com/kentbye/status/1369673347932377088",
        "https://twitter.com/htc/status/1369661105564389377",
        "https://linustechtips.com/topic/1313774-modern-affordable-vr-body-tracking-may-be-coming-soon/",
        "https://uploadvr.com/stonx-steamvr-body-tracking/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Oh, look at that. There's, oh, there's tech news on the prompter. Is someone gonna do that with, something with that James? We can't just leave it on there. It's just sitting there. - [James] Permission to take. Someone has to, can I take these? When Nvidia announced the RTX 3060 graphics card comes with a limiter that cuts it's Ethereum mining efficiency in half and then called that limiter unhackable. That was a mistake because crypto miners immediately started trying to hack it. And this week it appeared that some had succeeded, an imagery posted from a tie Facebook group appeared to show a system with RTX 3060's mining away at the cards full hash rate. Really, what did Nvidia expect? That people would hear it's unhackable? and then be like, Oh, okay. I'll just pack up my things and go mine some, I'm just gonna go mine some gold for my X-Box controller. Be right back. Okay. Well actually hold on, some savvy netizens quickly noted that the currency being mined on these RTX 3060s was the alt's coin Conflux using the Octopus algorithm? - [James] Huh. - You know the one. So it looks like the card's limiter hasn't been hacked yet but at the same time, I haven't had a shot at it yet, so just you wait I'm just gonna go ahead and keep my head up A complaint has been lodged with French regulators over Apple's new app tracking transparency feature in iOS 14.5. - [James] That's the blue. No, which requires apps to obtain user consent before sharing their data with third party advertisers because French people apparently don't like to be tracked by anyone. - [James] Adios amigo. - Stay away, no. This is the same policy, Facebook has been attacking Apple over and while it could protect users from third-party tracking it doesn't protect them from Apple which collects user data. In order to serve targeted ads Google's taking a similar tack they'll soon be blocking third party cookies in Chrome while still selling your data to advertisers themselves. (foreign language) How many languages do you know? Interestingly T-Mobile announced yesterday that they're going the opposite way. If users don't opt out by April 26th, the carrier will automatically share their information with advertisers. Okay, cool. But where's the option where I don't get tracked by Apple or Google or T-Mobile because I think that involves moving into a cave in Vermont, or living with Bernie Sanders out there, I hear his got some warm mittens - [James] No, he hasn't. - No, it ain't here get out. And Microsoft was waiting on the approval of European regulators to complete their acquisition of ZeniMax parent company of Bethesda. And Europe has just said, \"There it's okay, go ahead.\" That's my, that's the pan European accent. That's the one they all have. Microsoft in Bethesda. Both immediately started the celebrations releasing what is I guess, intended to be a touching video about the developer's history and how far they've come look at us. We went from a little studio in someone's basement to being sucked into one of the biggest conglomerates ever - [James] The sky runs, the sky wins. - Well, hail father Gates. - Of course, Microsoft also took the opportunity to finally divulge that. Yes, of course, some Bethesda titles will now be Xbox exclusive. Are you dumb? But it also means more Bethesda games on Xbox game pass which is good. I guess, I'd rather a game pass than a game stop. Huh, what a different Riley, Brilliant. doesn't have you memorize lists of facts. They use active learning. You're getting in there doing stuff, solving problems. And, huh, I just learned a thing Feels great. There's over 60 different courses in subjects like quantum computing or math fundamentals with no harsh grading, long lectures or strict time limits. You're here to find out how our world works and master subjects, not impress the teacher. But I'll tell you what would impress me if you use the link in the description to join Brilliant and it's community of eight million learners and educators today the first 200 people to do that can save 20% off. So click it or go to Brilliant.org/TechLinked yes, smarty pants. All right, I can give you the bits, but we have to be quick. Blade, the company behind one of the OG good gaming streaming services Shadow. - [James] Am I getting fired? The company they're made of half vampires. Anyways, they've filed for bankruptcy. The company's French server provider came calling for money owed to them, again with the French, you know. Now Blade is seeking outside investment to stay afloat Blade says the Shadow streaming service shouldn't be affected by these events and that they were a victim of their own success, as well as the French. Asus launched the ROG phone five today complete with not one but two USB ports and a whopping 18 gigabytes of LPDDR5 RAM. - [James] It has more than MacBook. - Yeah, actually. More phones with chunky RAM might be on the way too as SK Hynix is mass producing those 18 gigabyte modules which you're gonna need to attend those Fortnite concerts on mobile with the 30 store high, 30 story high character models of the current most popular rapper that's, DaBaby. - Seek a mic and move. - Russia, didn't like the way that Twitter was allowing people to post horrible things like spreading the word about opposition protests. So the country tried to throttle the social platform. It appears they kind of bungled the operation and ended up slowing down their entire internet instead. - [James] That's our Russia. - See if Twitter would just listen, and censor things the way Russia wants. They wouldn't have to skip out on NASA's moon base and work with China on making their own moon base with space blackjack and moon hookahs. Actually it sounds great. NFTs or non fungible tokens are all the rage right now because they allow artists to sell digital art, as if it's a physical object, sort of. Well users of the digital platform ArtStation, don't want in on the action. As the platform was forced to backpedal on its plan to implement an NFTs after user backlash. Maybe because the whole idea of them doesn't make any sense. - [James] Shut your mouth. - But neither does paying eight million for a... would you pay eight million for a frigging painting? - [James] I'll go for Painting? - Oh, Linus is a big fan. - [James] I will sell the original Linus face mean picture. - Okay. Now they make sense. They make a lot of sense. - [James] I don't even know if Linus has the rights to that. - Yeah, What? And HTC has announced the new facial tracker for its Vive VR headset which will allow users to map their mouth movements onto digital avatars in VR. So V tubers can seem a little more like they're a real life anime girl. And this is a timeline we all want to live in. - [James] I'm a real fate girl. - HTC has also announced smaller and lighter Vive trackers for $129. But if that's too much you can also check out the open source Stonx Body Trackers made by a Swedish team for about 80 bucks. That's where I'm putting my money. I think it's a good investment. Time to start putting more tech news in this video, because it's over. Come back on Friday for more tech news. I'm sure there will be more on the prompter by then. It just appears. And we just do what it says. - [James] We just read it. - Please, let me go.",
    "transcript_keywords": [
        "French",
        "Apple",
        "Bethesda",
        "RTX",
        "users",
        "people",
        "company",
        "announced",
        "Linus",
        "Microsoft",
        "user",
        "XBox",
        "Blade",
        "Russia",
        "French people",
        "company French",
        "limiter",
        "game",
        "Nvidia",
        "Huh"
    ],
    "transcript_entity_values": [
        "14.5",
        "half",
        "over 60",
        "DaBaby",
        "yesterday",
        "netizens",
        "Bernie Sanders",
        "French",
        "James]",
        "RAM",
        "Riley",
        "one",
        "20%",
        "USB",
        "18 gigabytes",
        "Bethesda",
        "3060s",
        "VR",
        "Google",
        "T-Mobile",
        "Blade",
        "James] Huh",
        "200",
        "18 gigabyte",
        "OG",
        "Stonx Body Trackers",
        "Vermont",
        "five today",
        "today",
        "ArtStation",
        "Twitter",
        "Ethereum",
        "Microsoft",
        "Chrome",
        "Friday",
        "ROG",
        "James] Permission",
        "Conflux",
        "European",
        "third",
        "April 26th",
        "China",
        "James] No",
        "first",
        "Shadow",
        "Nvidia",
        "Asus",
        "Facebook",
        "Gates",
        "two",
        "about 80 bucks",
        "HTC",
        "ZeniMax",
        "Swedish",
        "30",
        "Fortnite",
        "Vive",
        "this week",
        "Russia",
        "James] Shut",
        "James] Am",
        "Octopus",
        "3060",
        "NASA",
        "Linus",
        "eight million",
        "Xbox",
        "Vive VR",
        "129",
        "James",
        "MacBook",
        "SK Hynix",
        "Twitter",
        "Apple",
        "Europe"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "NORP",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "GPE",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "GPE",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "NORP",
        "ORDINAL",
        "DATE",
        "GPE",
        "PERSON",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "FAC",
        "PERSON",
        "PERSON",
        "ORG",
        "LOC"
    ]
}