{
    "id": "t5r3r__noNU",
    "title": "Galaxy Note 8 Durability Test!! - Scratch Burn BEND TEST!!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-09-07T15:00:10Z",
    "video_url": "https://www.youtube.com/watch?v=t5r3r__noNU",
    "category": "Howto & Style",
    "tags": [
        "Galaxy Note 8",
        "Note 8",
        "Samsung Note 8",
        "New Note",
        "Note 8 Durability test",
        "Bend test note 8",
        "scratch test note 8",
        "mohs scale",
        "mobile phone",
        "android",
        "iphone",
        "new iphone",
        "best smartphone",
        "tech",
        "technoligy",
        "mobile industry",
        "spen",
        "Samsung stylus"
    ],
    "views": 2532366,
    "likes": 45826,
    "comments_count": 3919,
    "description": "Show dbrand some love for sponsoring this video:   Its time to test the new Samsung Galaxy Note 8. After many generations either getting skipped or recalled, We might FINALLY have a Note phone that will stick around for awhile. The Samsung Note 8 is the latest and greatest phone to hit the market in 2017, BUT is it worth the price point? Will the Note 8 last longer than the Note 7? or at least last long enough for it to be worth the cost?   Well.. You can either wait 2 years and find out on your own. Or you can watch JerryRigEverything's durability test and find out in five minutes.   Fix your Note with parts and guides from iFixit!:   Current Galaxy Note 8 Pricing on Amazon:   Galaxy Note 8 Teardown:  How does the S-Pen Work?:  Note 8 protective case:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://dbrand.com/jerryrig",
        "https://ifix.gd/2zNeWuJ",
        "https://amzn.to/2XPJI3B",
        "https://youtu.be/Me76mxespME",
        "https://youtu.be/7Ix0mN8agzo",
        "http://amzn.to/2wIItUy",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "The Galaxy Note 8 is finally here. After skipping the Note 6 and having the Note 7 recalled, I think it's high time that the Note 5 users get a solid upgrade. Inside the box we have the micro USB to USB-C adapter. That's the kind of dongle I like seeing in the box. And then up here at the top we have a charging cable. And the box includes some headphones. Talk about a box packed with essentials. Let's see how well this Note 8 holds up under my durability tests. [Intro] Samsung has been among the most solid phones I've ever tested. I see no reason why the Note 8 should be any different, but there's only one way to find out for sure and that's by starting with the scratch test. My buddy, Moh, came up with this test back in 1812 to differentiate between different minerals like ceramic, sapphire, glass and plastic. Even titanium on the Essential phone I tested yesterday. The Note 8 has Gorilla Glass 5 on the front and scratches at a level 6, with a deeper groove at a level 7. That's the solid standard these days for smartphones, and pretty normal. The iPhone 7 scored the same. Up at the top of the phone we have a plethora of sensors: the iris scanner, the front facing 8 megapixel camera, and the proximity sensor, all protected by the same Gorilla Glass 5. So no worries about damage there. The earpiece is also solid metal and looks like it will never fall out on it's own. Down at the bottom of the phone we find the same huge slab of glass with no physical buttons. There's one button at the bottom of the phone, though, for the S-pen. I made a whole video about taking apart this Samsung stylus and showing how it electromagnetically communicates with the phone. You can check that out if you want. The important thing for this video, though, is that the S-pen is made out of plastic on all surfaces. The thin rubber tips are replaceable by the way. There are some thicker and softer tips included in the box if you're into that kind of thing. Also the S-pen won't get stuck if you put it in backwards, which was a problem with the old Note 5's. This one seems to be more idiot-proof. The back of the phone has the same solid slab of Gorilla Glass 5 that the front has on it, so my razor blade will leave no mark on the surface. Up here by the dual cameras, there is a small metal ring between the lens and the back panel that sticks up just barely enough to protect the camera lens when you set it down on a table. It's still a good idea to be gentle though. One small rock or a speck of dust, and a scratch on your camera lens could happen. The dual lens itself is glass though -even over the flash. Samsung plopped a telephoto camera into their phone next to the regular wide angle lens, which I'm actually pretty excited about. It's much more useful than any black and white monochrome sensors that I've seen. Both lenses supposedly have OIS, that optical image stabilization, so I have to check on that during my tear down video. Right next to the two lenses, the fingerprint scanner is the first thing that my razor could damage. Stuck all the way up here at the top of the phone, it's not like anything will ever be able to reach it, including your own fingers, but I'll still check and see if it works. Even with the major damage, it can still read and sense my fingerprint. Only the same finger I scanned could access the phone. The glass and ceramic phones keep disrupting my Art Class with Jerry, but one thing that can scratch is the solid metal sides of the Note 8. In typical Samsung fashion, the metal wraps all around the phone and includes the quality metal buttons. Up here at the top we have the SIM and SD card tray. And over on the other side, the permanent best buddy Bixby button is still here. Awesome. The bottom of the Note 8 has the fast charging USB-C port, as well as the ever convenient headphone jack. When you need one, you need one, and it's definitely nice to have it. The bottom edge of the stylus has metal on it as well, keeping that same premium feeling all around the edge of the phone. One thing that has accumulated during this test that might bother some people, is a plethora of fingerprints. If you prefer a naked feeling phone, but hate the look of fingerprints, a skin is not a bad idea. Plus glass only breaks after a defect or impurity like a scratch, is introduced into the glass. A skin keeps those small nicks and scratches from happening in the first place. Laminated glass is stronger than unlaminated glass. If you're not into dragons, wood or concrete, though, there's always the fiery yellow color in memory of our previous Note 7. And I'll toss a dbrand link in the video description, so show them some love for helping make this video possible. This Note 8 is IP68 water-resistant. One whole level above the IP 67 iPhone 7. I do enjoy bringing that up every time. Fire is quite the opposite of water, but this 6.3 super AMOLED 1440p display is HDR 10 compliant, just like the LG G6. Basically that means it displays colors real good and lasts about 10 seconds under direct flame before getting permanently damaged and not recovering. Bixby is all up in our business about it, but I'll disable him later. Like always, we finish off with the bend test. This gives us an overall idea on the build quality of cell phones. I've tested about 75 different phones now, it's a pretty expensive hobby, and Samsung has always been one of the strongest, and this Note 8 is no different. Flex from the front or the back and it remains unfazed and fully functional between the S-pen, wireless charging, dual cameras, SD card slot, headphone jack, and solid water-resistance, this is definitely daily driver material. I'll be impressed if the next iPhone has half as many features as the Note 8. Speaking of which, I will be testing the iPhone 8 when it gets announced in a few weeks. So make sure you're subscribed and ready for that. I'll keep Twitter updated on the exact time that the video will be posted. Check the description to see what dbrand has for your phone. And thanks for watching. I'll see you around.",
    "transcript_keywords": [
        "Galaxy Note",
        "Note",
        "phone",
        "glass",
        "Gorilla Glass",
        "solid",
        "phones",
        "Galaxy",
        "Samsung",
        "box",
        "video",
        "Spen",
        "metal",
        "lens",
        "thing",
        "test",
        "Gorilla",
        "solid metal",
        "camera",
        "solid phones"
    ],
    "transcript_entity_values": [
        "8 megapixel",
        "iPhone",
        "about 75",
        "8",
        "a few weeks",
        "Twitter",
        "SD",
        "Note 7",
        "two",
        "jack",
        "Jerry",
        "6",
        "6.3",
        "Moh",
        "only one",
        "half",
        "yesterday",
        "SIM",
        "5",
        "USB-C",
        "daily",
        "first",
        "Samsung",
        "these days",
        "One",
        "Bixby",
        "G6",
        "USB",
        "iPhone 7",
        "one",
        "about 10 seconds",
        "1812",
        "LG"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "LAW",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG"
    ]
}