{
    "id": "t_Mejd13Q70",
    "title": "Fortnite is BANNED",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-08-13T22:16:14Z",
    "video_url": "https://www.youtube.com/watch?v=t_Mejd13Q70",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "fortnite",
        "fortnite iphone",
        "fortnite ios",
        "fortnite ban",
        "fortnite removed",
        "fortnite app store",
        "epic games",
        "fortnight",
        "apple",
        "ios",
        "iphone",
        "ipad",
        "app store",
        "apple app store",
        "gaming"
    ],
    "views": 153465,
    "likes": 10694,
    "comments_count": 1818,
    "description": "Apple just removed Fortnite from the iPhone App Store.  What's the worst PlayStation ever?  The Best vs Worst Apple Products:   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/OkBdZoqLqdA",
        "https://youtu.be/pQWqbZ1raE0",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to a breaking news edition of This Is. Fortnite has been banned, the end of Fortnite as we know it. How could they possibly take away the world's most popular game? Well, it's not quite that simple. - I'm okay with Fortnite-- - No, no, no, that can't be the end of our video. Okay, so what's happened right now, is that basically Epic and Apple are playing chicken. So as of right now, as we're recording, Fortnite has just been banned and removed from the iOS App Store, that means there's no Fortnite on iPhone, no Fortnite on iPad. I guess they can't take it off of the Mac since you can just download that directly, but they have pretty much completely been banned from the platforms. And the reason why, well, okay, Epic we're kind of asking for it. - Yeah, so basically they have been doing direct transactions within the app, bypassing the App Store. If you don't know what any of that means, basically Apple takes, what, a 30% cut off of all the transactions that happen off apps that you get from the App Store. So that they take their own cut. And with Epic Games bypassing that and making 100% of the money and not giving any of it to Apple, of course, Apple wasn't particularly happy about that. - So what they did was they hid inside the most recent Fortnite update for iOS, a little thing that they enabled remotely, where essentially when you went to go buy V-Bucks, which was of course the currency of Fortnite, instead of just seeing the normal thing, in-app purchase, blah blah blah, buy it through the App Store. Instead it gave you an option to get more V-Bucks for the same money if you go direct through Epic and then a little popup would show up, you put in your credit card, you sign in all that kind of stuff. Now, as I probably don't need to say, that is not allowed whatsoever in the iOS App Store, they want you to use the in-app purchase screen, which I'm sure there are valid reasons for that for like payments and stuff, but the most important thing is, is it that means that Apple, and of course Google at that same token, get 30% of whatever purchases that you make on the App Store. Now, a lot of developers have been very unhappy about this for a long time, but Epic has straight up just baited it Apple into this. And sure enough, a few hours after they did that, they have been removed from the App Store. In fact, actually you have an iPhone, can you actually look to see what happens when you try to search Fortnite right now? - Nope. - Nothing, it's gone. - There's an app here called dances from Fortnite. No, but this is a very important the thing though, because as you said, a lot of people are not happy with the way that Apple has been doing things with the cuts that they've been taking. And because of that, I think Epic Games, maybe this is just a stance that they're taking. I mean, it could just be a petty thing, but in the grander story, Epic Games is kind of a linchpin. - Yes. - They have a very important position on the App Store, they've been using it for years. In fact, Apple has been so kind as to point that out in their argument for why they removed. - How many times have we seen like Infinity Blade and other Epic games at the actual like App Store, like the launch of phones. So this is not the first time Fornite and Apple and Google have fought head to head. I don't know if you remember, but when Fortnite first came to Android, you couldn't download it off of the Play Store, you had to go side load the app, Google weren't really a big fan of that. And they did that for a while but eventually Fortnite caved, Epic brought Fortnite into the Google Play Store directly, which meant that they of course had to pay 30% of all of that money, which is tough. So like, okay, I'm curious, so we have a huge, huge, different legal document. So as soon as they banned-- - That's the actual thing. - 65 pages. So essentially Epic knew exactly what they were doing. So the second that they got banned, they hit Apple with a 65 page document, basically suing them for, I mean, I can read some of this. So they're suing them for the Apple monopoly of the iOS app distribution market, competition in the sale of mobile devices, cannot discipline Apple's conduct to the iOS app distribution, I mean, there's literally nine, 10 counts of California Cartwright Act, California unfair competition law. Look, there's zero doubt. Epic knew exactly what they were doing. They got banned from the App Store on purpose. They push this update secretly, they flipped the switch, of course, everyone started talking about, of course Apple saw it and Apple following their own rules, rightfully or wrongfully were like, yo, no, nuke, delete, remove Fortnite. Which is funny to think that Apple is one of the very few companies in the world that have the nuke Fortnite button at their fingertips. - Look, I don't exactly agree with the way that Apple's doing things. But look, I'm not a fan of Fortnite. I find Fortnite kind of annoying. Apple, you're kind of making me feel like I'm a bad person for wishing this, but at the same time, pretty dick move. - So they've actually, they were so far prepared that they have a little teaser in the, is it the party mode I believe? - Yeah. - Essentially explaining this. I haven't actually seen it, you want to watch it? It's 198Fortnite. - Today we celebrate the anniversary-- - Oh, that looks familiar. Oh, this looks very familiar. - [Apple] For years they have given us their-- - Oh my god. (laughing) - It's a straight rip of the 1984 ad. - Those sly dogs, man, those sly dogs. - Our control. This power is ours and ours alone. - Oh my God. - This is shot for shot the 84 ad. - I actually really wants someone to play it side by side. - Look at this, Epic Games has defied the App Store Monopoly. In retaliation Apple's blocking Fortnite from a billion devices. Joined the fight to stop 2020 from becoming 1984. Free Fortnite, #FreeFortnite. Dude, okay, look. Epic 100% knows what they're doing with this. And really as gamers, we all have to kind of make a decision on what side we come down on, right? Because there's absolutely going to be a long legal battle. And if you're Apple, you're gonna fight this hard because think about it, if Epic do this, if Epic are allowed to just sell their own stuff and not give them a cut, you can make the argument that why is Apple paying to host the games and for the updates and all that kind of stuff if they can't get anything. I mean, if they're arguing that Epic wants like a 10% split instead of 30%, I think that may be more reasonable but what's the end game here? - Look beyond the Epic Games thing though. Again, as I mentioned before, this is not just for Epic Games. There are a lot of people that are annoyed at how much of a cut Apple takes. In fact, something that's a little more relatable to what I've been doing recently. I've been getting into virtual YouTubers and YouTube Super Chat. - We all know. - But here here's something that I found out though. So it's not just games and apps that you buy on the App Store, right? Every transaction that you do through iTunes and the App Store counts toward that 30%. So if you say, use the YouTube app on your phone and do a Super Chat, say you want to help your favorite creator out, right, you wanna donate to their tip jar in the chat. The big problem there is that you're not giving them that full 100% cut or that a 100% transaction, you're giving them minus 30% of whatever you donated, which is kind of scummy. - I'm really curious to see how this plays for us as, I was about to say, avid Fortnite gamers. I'm not going to count myself in that. - Speak for yourself, Mr. Austin Evans. - For us who are interested in mobile gaming, what this means is for the foreseeable future, there is no more Fortnite on iOS. If you still have the game, I assume it will work for some amount of time. I don't think they can remove it from your phone if you already have it or your iPad or whatever, but essentially if you are a Fortnite gamer or your little cousin Timmy is, then iOS is no longer an option. We'll see how it plays out with the Google Play Store. It's a little weird that they're completely targeting Apple here because the Google store has basically the exact same rules. Although I guess to be fair on Android, it's a more open platform, you can side load it at the very least. This is gonna be very interesting to see what happens with this emergency breaking news of Fortnite being banned. You know, 2020's been a weird year. I don't think the thing that gets us to do an emergency This Is episode is Fortnite being banned is like toward the top of my list here. - This doesn't affect me at all. - Well, you know what does affect you? When people subscribed to This Is for lots more exciting content like this, including, I can exclusively confirm, a This Is game show featuring the one and only Linus Tech Tips, Sebastian. So make sure to subscribe here on This Is for not only news updates like this, which are hastily put together by Ken and myself, but more importantly, actually good content, like not Fortnite gameplay. - This also doesn't affect me.",
    "transcript_keywords": [
        "App Store",
        "Fortnite",
        "Apple",
        "App",
        "Epic Games",
        "iOS App Store",
        "Store",
        "Epic",
        "Google Play Store",
        "App Store Monopoly",
        "iOS App",
        "Play Store",
        "App Store counts",
        "Games",
        "Epic Games thing",
        "Apple blocking Fortnite",
        "Epic brought Fortnite",
        "Google",
        "kind",
        "thing"
    ],
    "transcript_entity_values": [
        "zero",
        "Epic",
        "Fortnite on iOS",
        "Android",
        "the App Store",
        "one",
        "Mac",
        "Austin Evans",
        "Apple",
        "Fornite and Apple",
        "the Play Store",
        "Epic Games",
        "a few hours",
        "84",
        "10%",
        "Epic",
        "nine",
        "Fortnite",
        "Google",
        "30%",
        "the App Store",
        "Epic Games",
        "California",
        "Infinity Blade",
        "2020",
        "years",
        "iPad",
        "Fortnite",
        "Super Chat",
        "100%",
        "minus 30%",
        "Linus Tech Tips",
        "Epic",
        "YouTubers",
        "YouTube Super Chat",
        "a weird year",
        "FreeFortnite",
        "the App Store",
        "the Google Play Store",
        "second",
        "65",
        "Sebastian",
        "YouTube",
        "Timmy",
        "first",
        "iPhone",
        "iTunes",
        "Ken",
        "App Store",
        "the App Store Monopoly",
        "198Fortnite",
        "the Google Play Store",
        "1984",
        "Free Fortnite",
        "10"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "EVENT",
        "TIME",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERCENT",
        "FAC",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "PERCENT",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "EVENT",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "NORP",
        "PERSON",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL"
    ]
}