{
    "id": "tALastsLz0w",
    "title": "Tech You Shouldn't Buy - True Wireless EarBuds",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2016-05-18T14:12:29Z",
    "video_url": "https://www.youtube.com/watch?v=tALastsLz0w",
    "category": "Science & Technology",
    "tags": [
        "Worst Tech",
        "Worst Tech Products",
        "Worst Tech Ever",
        "Worst Tech Demo",
        "Worst Tech 2016",
        "Tech You shouldn't buy",
        "Wireless Earbuds",
        "Earin Wireless Earbuds",
        "Does it Suck",
        "Unbox Therapy",
        "Overpriced Tech",
        "WTF Tech",
        "Horrible Tech",
        "True Wireless Earbuds",
        "Weirdest Tech",
        "Tech Fail",
        "Tech Fail 2016",
        "Tech Fails",
        "Tech Fails 2016",
        "jonathan morrison",
        "tld",
        "best headphones 2016",
        "worst headphones",
        "earin",
        "earin review",
        "kanoa review",
        "kanoa",
        "ripplebuds review"
    ],
    "views": 849052,
    "likes": 17856,
    "comments_count": 823,
    "description": "Sometimes, there's just tech you shouldn't buy. Tech you should buy -  UnboxTherapy + Apple Pencil Romance:   The Best Desk + Setup Tech:  Weird Tech:   Free Slickwraps Skins:  W833DL64 - Expired  2DJP6WCE - Expired  D8CE64 97BTV0  Earin True Wireless EarBuds Amazon Reviews:   Awesome Wireless Headphones:    Awesome Wireless Earbuds:     Snapchat: tldtoday New Food Project:  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/EZgT4yezKnQ",
        "https://www.youtube.com/watch?v=O-YFQBrouV8",
        "https://youtu.be/wcP088X-b4E",
        "https://youtu.be/W-DsH1krW38",
        "https://www.slickwraps.com/devices/helmetica-series.html",
        "http://amzn.to/204AeHV",
        "http://amzn.to/24YWbvz",
        "http://amzn.to/24YX07H",
        "http://amzn.to/1rTdekt",
        "http://amzn.to/1WDGSqp",
        "http://www.instagram.com/nomcityofficial",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Word on the street is, you've dabbled with some wireless earbuds. - That's true, actually, I've probably done more than dabble in fact. - [Jonathan] Hey guys, Jonathan here. Sometimes in life there are things that no matter how much you tell yourself you shouldn't buy, you still kinda want to. This happened to me when I was walking through Best Buy and saw these truly wireless earbuds. I knew they probably weren't gonna be that good, but that didn't stop me, I ignored the responsible part of my brain and got them anyways. Honestly I think the packaging played a little part in luring me in. It was simple but clean, and so much in fact that it even impressed a certain someone who's unboxed a thing or two. - Oh, you know what though, there's something there. Hey, let me just, one second. If you're out there, you're watching this, and you're some kind of company, take note. Look at this. Mag- Oh god... The potential to lose it, look how tiny that is. It's not connected to anything. Beautiful look, they put the instructions right on the other side. Actually you know, I can kinda get with that. - That's high tech, it's like the Men in Black. - Erases my memory, yeah. - [Jonathan] So what that Men in Black looking thing actually is, is the capsule that not only houses but also charges the earbuds as well. It's made out of solid aluminum, looks futuristic and fancy, and the idea of how this is supposed to work in theory is cool but execution is poor. Because of the capsule there aren't any power controls on the earbuds whatsoever. So the idea with that is when the earbuds are outside of the capsule they're on, and when they're tucked away and closed they are then turned off. This is a little annoying because you're not ever quite sure how charging is going, paired with the thought of, \"Did I insert these into the capsule correctly?\" And on top of that with all of these little parts that are screaming to be lost, the margin of error is minimal. - So, no joke, shooting a video on this guy talking about how small it was, how you could potentially lose one of them very easily; I dropped one in the rocks, and I spent the last 10 minutes digging rocks around and you can see, thank goodness, I found it but you can see what I'm talking about. - Oh my god, I might have to take back what I said about this experience. Jon likes to go to the gym, you know he gets on the treadmill, he's got his outfit on, better for his knees. Don't bring up knees again, man. My knees are damaged alright. - Hockey's dangerous. - The smaller ones are rubber, and the larger ones are foam. I'm gonna put the rubber ones on, my feeling is these are kinda the standard, the stock ones. See how that fits on there. You might not know why he brought this here, but he's paying homage to a very special moment in both of our lives. Kind of love that lasts forever - This thing's been on a charger for three weeks. Okay listen, I might have exaggerated on the three weeks thing; okay one hour. - They're lightweight for sure. That's max? - Max. - Okay, I'm gonna be respectful because of the fact that they're so small, you want me to react right now right? (static) - Okay I'm gonna be respectful because of the fact that they're tiny little, little things. And you have to kinda limit your expectations based on that. I'm not blown away, I'm not like I can't wait to put those back on and listen some more. There's not quite as much thump as I'm looking for. Maybe the convenience for you outweighs that fact, but at $250 I'm like... - [Jonathan] So as a whole it is really hard to recommend these, and even though I would strongly advise against picking these up, what I would recommend is heading over and checking out the Amazon reviews for some entertainment. For the price of these you can grab not only a really good pair of wireless earbuds, but also a really good pair of wireless headphones. Oxy posted a few different combinations and models down below that are a much better buy than these. So with that hopefully you guys enjoyed the video and if you wanna see more tech you shouldn't buy drop a like, this is Jonathan and I will catch you guys later. - That's a hell of a way to end a video. (beep) - Austin just informed me before we started shooting this video that he's put on like 28 pounds of pure muscle. Don't look at him sideways. Don't get in his way, for your own good.",
    "transcript_keywords": [
        "wireless earbuds",
        "kind",
        "earbuds",
        "wireless",
        "Men in Black",
        "fact",
        "buy",
        "thing",
        "capsule",
        "good",
        "put",
        "video",
        "guys",
        "Word",
        "knees",
        "Men",
        "Black",
        "street",
        "dabbled",
        "Jonathan"
    ],
    "transcript_entity_values": [
        "three weeks",
        "two",
        "the three weeks",
        "Amazon",
        "one hour",
        "Oxy",
        "Austin",
        "one second",
        "Jon",
        "250",
        "Max",
        "28 pounds",
        "the last 10 minutes",
        "one",
        "the Men in Black",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "TIME",
        "PERSON",
        "MONEY",
        "PERSON",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERSON"
    ]
}