{
    "id": "TAt2EMsszuk",
    "title": "The OnePlus 6T is Looking Awesome",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-09-05T17:03:35Z",
    "video_url": "https://www.youtube.com/watch?v=TAt2EMsszuk",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "OnePlus 6T",
        "OP6T",
        "iphone XS",
        "iphone X",
        "samsung galaxy",
        "s9",
        "s10",
        "vivo",
        "oneplus",
        "oppo",
        "one plus 7",
        "OP7",
        "next one plus",
        "next oneplus",
        "next iphone",
        "new oneplus",
        "fingerprint reader",
        "display fingerprint",
        "screen fingerprint",
        "fingerprint screen",
        "smallest notch",
        "small notch",
        "phone without notch",
        "headphone jack"
    ],
    "views": 925350,
    "likes": 21192,
    "comments_count": 1496,
    "description": "The OP6T looks to have a couple nice upgrades. The notch looks like itll be reduced in size to a cleaner waterdrop shape and a in-screen fingerprint sensor could make a debut in a OnePlus Phone.  Its hard to find a phone in 2018 without a notch but the OnePlus 6T might have one of the smallest notches in the market right now. Coupled with a new fingerprint sensor built into the screen, the OP6T should have all the usual trimmings like a headphone jack and the notificiation switch.  Music: Fili - Closure  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going, Dave 2D here. There have been a lot of rumours and leaks about the OnePlus 6T. But this morning a particularly telling photo was leaked. Now this is a photo of what is supposedly the packaging of the upcoming OnePlus 6T and there is no way for us to tell if this is a real photo or some kind of faked box that someone has made for it. But my gut feeling is that this is actually the OnePlus 6T packaging. There's just too many details that kind of line up with previous rumours plus that thing actually looks pretty well made to me. Now I want to draw attention to two features of this phone that is indicated on this packaging. The first thing is that tear drop notch. So over the course of 2017 and 2018 we saw a huge influx of phones with notches on them and the Pixel 3XL is looking to have an incredibly large notch - if we're not being trolled by Google. But this phone has a very, very small notch and I love the way this looks. This is actually very similar in design aesthetic to two Oppo phones - the Oppo R17 and the Oppo F9. Both of them with that kind of water drop notch shape and it kind of makes sense because Oppo and OnePlus have that tie through BBK, the kind of parent company - and it's a really small change right, it's not like they've removed the notch completely - it's just reduced significantly in size. but just visually this phone looks so much cleaner than the original OnePlus 6 that we have on the market right now. So instead of the 83/84% screen to body ratio on the OnePlus 6 this is moving closer to ~90%. The speaker gets pushed up so instead of the traditional kinda speaker grill in the notch they have to remove it and put it and put a slit up above that water drop and just have audio coming out from there. The same thing with the ambience sensors, these water drop notches don't have them in the traditional spot. The other interesting feature shown in this packaging photo is the inclusion of an in display, or under display fingerprint sensor. So this is technology that we have seen from a couple of the Chinese phones like Oppo and Vivo had phones with in display fingerprint sensors. But we've never seen one that was readily available to the North American market. Now the in display or in-screen fingerprint sensors that I have seen, haven't been super fast. Like the fingerprint sensor on the OnePlus 6 or any of the OnePlus phones are really snappy. The in display fingerprint sensors that we have seen so far haven't been as fast so I am a little bit concerned but we will have to see when the final product comes out. Now the other thing that's kinda neat and this is something that we have known before is that OnePlus is likely going to have a carrier deal with T-Mobile for the OnePlus 6T launch and that's just gunna bring a tonne of of brand awareness and just kind of market awareness for OnePlus as a brand in North America. But what do you think? I feel like this is... this is big. If that packaging is legit, and my gut feeling is that it is, those two features, like the water drop notch and the fingerprint sensor are going to be something that really shapes the...not just OnePlus but the direction of the smart phone industry right now. I think that's going to be pretty big. Let me know in the comments below. I'm actually curious to see what you guys think about it. There is some talk about OnePlus upgrading their dash charging to something like super dash charging because Oppo has some faster charging technology right now. I don't think that's going to trickle into the OnePlus world yet. Maybe in the 7 or future generations, but for the 6T that's coming out in October/November I would say that they're just going to stick with their regular dash charging Okay, hope you guys enjoyed this video. Thumbs is you liked it, subs if you loved it. See you guys next time.",
    "transcript_keywords": [
        "OnePlus",
        "Oppo",
        "kind",
        "notch",
        "Dave",
        "fingerprint",
        "phones",
        "fingerprint sensor",
        "drop notch",
        "display fingerprint sensors",
        "water drop",
        "packaging",
        "water drop notch",
        "display fingerprint",
        "drop",
        "phone",
        "display",
        "photo",
        "sensors",
        "Oppo phones"
    ],
    "transcript_entity_values": [
        "North American",
        "7",
        "Dave",
        "OnePlus 6",
        "Oppo",
        "BBK",
        "this morning",
        "OnePlus",
        "North America",
        "Google",
        "2018",
        "T-Mobile",
        "83/84%",
        "the OnePlus 6",
        "two",
        "October/November",
        "first",
        "2017",
        "Chinese",
        "Oppo",
        "6",
        "OnePlus",
        "the Pixel 3XL",
        "Thumbs",
        "a tonne"
    ],
    "transcript_entity_types": [
        "NORP",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG",
        "TIME",
        "NORP",
        "LOC",
        "ORG",
        "DATE",
        "ORG",
        "PERCENT",
        "EVENT",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "DATE",
        "NORP",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "QUANTITY"
    ]
}