{
    "id": "TBPVJtGBf8Y",
    "title": "The Clapper: Yes, that one.",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2023-11-18T17:58:43Z",
    "video_url": "https://www.youtube.com/watch?v=TBPVJtGBf8Y",
    "category": "Science & Technology",
    "tags": [],
    "views": 1070576,
    "likes": 61683,
    "comments_count": 3656,
    "description": "Oh boy! You should give Tedium a look, by the way. Lots of cool stuff there:   Technology Connextras (the second channel where I put stuff sometimes)   Technology Connections on Mastodon:   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!",
    "description_links": [
        "https://tedium.co/",
        "https://www.youtube.com/@TechnologyConnextras",
        "https://mas.to/@TechConnectify",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Hello and welcome to No hold on a second. [clap clap] Hello and welcome to No Effort November, a series of videos for the month of November where I try my best to not try so hard. These days, its pretty trendy to turn on the lights by yelling out howdy goolexa, turn on the lights! and after a few data packets bounce back and forth between your house and the servers of who knows how many tech companies, yet more data packets eventually find their way to a light switch that has a Wi-Fi radio in it because why not and if youre lucky and the stars align and youre still in the good graces of Daddy it will turn on some lights. Or you could just do this. [clap clap] That not enough for you? How bout this? [clap clap clap] Ooh! A different thing! Thats right, were talking about The Clapper Perhaps the original smart switch (so long as you dont count X10 which, for the record, Im not), this classic gadget was brought to you by Joseph Enterprises, who also brought such classics to market as The Ove Glove, the Chia Pet, and lets not forget The Creosote Sweeping Log. I am not - I am not- Im not kidding, by the way, these are all products made by the same company and in hindsight that probably should have been obvious. Sadly, the Joseph behind Joseph Enterprises, Joseph Pedott, passed away earlier this year but his legacy will surely live on. And Ill help with that a tiny bit by expressing my honest opinion that the Ove Glove is actually a great product (despite its rather ridiculous name) and gets my vote as the one of the best as-seen-on-TV things ever. But were not talking about the Ove Glove today, were talking about The Clapper . If somehow thats not ringing a bell, and the gist of the intro escaped you, the Clapper is a little plug-in device with a couple of switched electrical outlets. A microphone onboard listens for sharp bursts of sound energy, like someone clapping, and if it detects two claps in a row within a short timespan, it will switch one of its electrical outlets on (or off if it was already on). The second outlet will respond to three claps, allowing you to control two different things with one clapper. But wait! Theres more! The device features three different operating modes: two different sensitivities can be chosen for the clap on clap off function, and well get to why thats needed in a minute, and theres also an away function which will turn on the lights for a brief duration whenever it detects any noise. This can be useful for, say, turning on a lamp as you enter your home or perhaps possibly deterring theft if the would-be burglar is fooled into thinking someone just so happened to turn on a light at the exact moment they broke a window or opened a door. The clappers history is somewhat convoluted as covered by my friend Ernie Smith over on Tedium. Joseph Pedott wasnt so much of an inventor but a marketer who found interesting products and was really good at se se se selling them. In the case of the Clapper, its original inventors approached him with the product (which, according to this archived interview they may have called the Great American Turnoff which wow) and his company would go on to help get it patented. And also rename it something less weird. However, the original design was not super good. Built using very rudimentary logic circuitry, the original Clapper was way too sensitive and prone to being triggered accidentally. This would simply be an annoying behavior, but it was marketed as though it could be used for anything, including a television set. [Just plug in The Clapper and a television, lamp, stereo, almost anything you want to clap on and off.] And since television sets are famous for making noises, not just through their loudspeakers but perhaps clicky and clunky sounds as they power down, well the original Clapper could get stuck in a loop where it repeatedly switched it on and off. Electronic devices generally dont like having their power repeatedly applied then taken away and the upshot was that it broke stuff. Not good! That, combined with a dispute between Joseph Enterprises and the original inventors, led to the hiring of Carlile R Stevens. His task was to make the clapper actually work somewhat goodly. Which he promptly accomplished with circuitry that was a little smarter. The Smart Clapper was released in 1987 and its pretty much what this thing is. The idea was exactly the same, but with a control chip that could actually discern different durations of noise as well as recognize the pacing of two discrete pulses. Or three for controlling a second device. This later version added LEDs to show when it detects a noise it thinks is a clap - and also when it rules out something as a non-clap. [Naah! Nuuhh? Eh-ehhh! Ehhhhehh!] This is useful for learning how best to use it - which, indeed, theres a learning curve here. You wouldnt think so, but there is. Its finicky. Lets just put it that way. And thats part of why it has two sensitivity settings. The LEDs help to show the threshold of noise with which it will react, and you might want more or less sensitivity depending on where you place this thing and how tolerant you are to false triggers and/or hand pain. Inside we find a few surprises. Firstly, would you look at that, the contacts that engage with the plugs actually have bumps on them to mate with the holes found on most US plugs. The first time Ive ever actually seen this in use and its in the friggin Clapper of all things. But, I suppose that extra bit of plug grabbiness is useful since the plugs you plug into this will hang straight down. The second surprise is that what I thought were amber LEDs to show the status of the switch are in fact the glass tips of neon indicators! I dont think Ive ever seen them used like this before and thats a fascinating hack. But perhaps the biggest surprise in here is the switching component they elected to use. These are triacs, the same solid-state switching devices that gets used in dimmer switches to chop up the AC waveform and reduce the power available to light bulbs. In this case theyre being used as simple on/off switches and arent chopping up the waveform, but to me theyre a very odd choice. They continued to market this thing as useful for switching radios and television sets, and using a semiconductor component in-line with the power supplies of those things feels risky both to the thing its controlling and the triac. They did protect the outlets with a fuse but Im still puzzled by this, and purportedly some devices (like compact fluorescent light bulbs) wouldnt work with this Clapper or could be damaged by it. The rest of this, though, is pretty unremarkable. The control chip is hiding under this blob, although it is interesting that its on a little daughterboard. Ill bet this was a cost-cutting revision and that the original chip was in some sort of square component package. Then we have some support components to create a power supply for the chip and the triacs, and of course we have the microphone to detect sound. Some versions of the Clapper also came with a wireless remote control allowing you to use it without clapping. And if youre thinking, doesnt that defeat the point? Well see heres the problem. As clever as this idea is and as useful as it can be, its still far from perfect. It doesnt know what a clap actually is, it just responds to quick bursts of sound energy. [thump thump] So lots of things can trigger this accidentally - like, for instance, pets or children making noise as they play. Even things outside your home can trigger it. If you reduce the sensitivity, that can help alleviate false triggers but it means you gotta CLAP. The most effective thing, in my experience, is to only use the three-clap side. But that reduces the functionality of the device and goes against the jingle which is devastating. Adding a remote control functionality to the device was a pretty big admission that it doesnt work all that well. Now, in fairness, a different read would be that perhaps some folks want to control the lights with The Clapper when others are asleep and two loud claps [clap clap] might wake somebody up. Adding a remote gives the best of both worlds depending on need and situation. But it still doesnt fix the problems with false triggers, sore hands, and product incompatibility. Its just a value add. Not necessarily a bad one, mind you, but it does feel kind of antithetical to the point, at least to me. But, through the magic of fifteen years passing, I have a more modern version of the Clapper which fixes one of its problems. Rather than use triacs as the switching components, this fella uses relays. That means its safe [asterisk] to control practically anything with this (so long as its within the rated current) without worrying about it being damaged. The only downside is that now youll hear a click with each activation. But thats not much of a downside. [click] [Asterisk] all the other weird quirks of this fella are still there, though, so while you can plug most anything into this without worrying about that thing getting damaged by it, you could also plug in, like, a small space heater or a coffee maker or something that really should not be used unattended and since false triggers are a continuing problem, that would be very bad and unwise. To be fair, they warn explicitly against this on the device itself and theyve left the rated wattage at 200 watts for each outlet. The relays they used are rated to handle 15 amps but this little fuse here, which I think is 4 amp but the labels kinda hard to see, will put a stop to any funny business should you try it. Honestly I think the clapper is pretty much only useful for controlling lights and the other use cases are pretty contrived. And apparently the makers now agree: the modern version no longer suggests a television would be a good fit (plus of course we dont use TVs like we used to) and instead sticks to lights and Christmas lights. But at least now you can control any kind of light like LEDs driven by a power supply without worrying about damage being caused by triacs letting noisy power through. And thats The Clapper. Is it useful? Maybe. Is it a gimmick? Maybe. Does it work well? Maybe. Is it iconic? You betcha. That much I know for sure. They are still for sale should you decide to get your hands on one, but to be honest this one has been sitting in a box for years. Theyre fun for a while but the novelty tends to wear off. But hey, maybe if you get one and buy a nice lamp for it, youll finally be convinced of the value of switched electrical outlets. But not, like, the British or Australian kind where theres a switch on the outlet itself to make sure the electrons dont leak out or whatever the heck. Those are silly and redundant. Fight me. Kay bye! aggressively smooth jazz by Joseph Enterprises, who also brought such classics to market - I forgot to get all the stuff ready! [a sing-songy throat clear] and who knows how many servers. Ep- nope! which will turn on the lights for a brief durATion whenever it detects any noise. I said duration pretty weirdly there. Too bad! That can be useful for, say, turning on a lamp as you enter your home. Or perhaps possibly deterring theft if the would-be burglar is fooled into thinking someone just so happened to hern haa, well, two flubs in a row. And apparently the makers agree. The ma-- I forgot the box. [inhales] What a fakeout. I still can't quite get over that new logo. Like, I think it's supposed to be an artist's palette, which I could get behind, but they need the little grabby hole there to make it more obvious. Plus then it would look more like a P! What a missed opportunity.",
    "transcript_keywords": [
        "Clapper",
        "Joseph Enterprises",
        "original Clapper",
        "Ove Glove",
        "Joseph",
        "Effort November",
        "lights",
        "thing",
        "Joseph Pedott",
        "control",
        "things",
        "original",
        "power",
        "pretty",
        "device",
        "turn",
        "noise",
        "Enterprises",
        "clap",
        "November"
    ],
    "transcript_entity_values": [
        "Firstly",
        "Carlile R Stevens",
        "Ernie Smith",
        "the Ove Glove",
        "Clapper",
        "se se se",
        "Joseph",
        "the Great American Turnoff",
        "The Smart Clapper",
        "years",
        "1987",
        "British",
        "Kay",
        "two",
        "Clapper",
        "Ehhhhehh",
        "the month of November",
        "November",
        "Australian",
        "These days",
        "Nuuhh",
        "today",
        "AC",
        "earlier this year",
        "US",
        "The Ove Glove",
        "Joseph Enterprises",
        "one",
        "first",
        "4",
        "fifteen years",
        "200 watts",
        "Joseph Pedott",
        "15",
        "The Creosote Sweeping Log",
        "Clapper",
        "second",
        "a short timespan",
        "the Chia Pet",
        "three"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "FAC",
        "PERSON",
        "DATE",
        "DATE",
        "NORP",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "NORP",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "GPE",
        "ORDINAL",
        "TIME",
        "PERSON",
        "CARDINAL"
    ]
}