{
    "id": "tBvG1AXS5CY",
    "title": "DoorDash, Uber Eats... and Tony | The Vergecast",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-03-19T13:00:49Z",
    "video_url": "https://www.youtube.com/watch?v=tBvG1AXS5CY",
    "category": "Science & Technology",
    "tags": [
        "The Vergecast",
        "Vergecast",
        "The Verge",
        "Tech",
        "Technology",
        "podcast",
        "doordash",
        "uber eats",
        "seamless",
        "grubhub",
        "seattle",
        "delivery apps",
        "rivian",
        "r2",
        "r3",
        "electric",
        "EV",
        "trucks",
        "foldables",
        "galaxy",
        "samsung",
        "google",
        "tablet",
        "ipad",
        "gadgets",
        "cars",
        "gig economy",
        "vehicles",
        "tesla",
        "interview"
    ],
    "views": 13886,
    "likes": 199,
    "comments_count": 33,
    "description": "Today on the flagship podcast of scaled EV production:  Verge producer Will Poor tags along with a former Uber Eats driver who ditched the delivery apps and is trying to start a one-man gig work revolution.  The Verge's David Pierce and Andrew Hawkins discuss Rivian's new vehicles they announced last week, and what it will take for the company to compete with Tesla.  David and Allison Johnson answer a question from The Vergecast Hotline about foldable phones.  Links:  This Seattle Delivery Person Is Breaking Free of the Apps:   Rivian R2, R3, and R3X launch event: the EV companys more affordable SUVs are here:    Rivians CEO talks R2 and R3 launch, and why he has complete certainty EVs will win:   Google Pixel Fold review: closing the gap:   Samsung Galaxy Z Fold 5 review: a little better is just good enough:   00:00 - Intro 02:06 - Tony vs the delivery apps 16:19 - State of Rivian w/Andy Hawkins 30:41 - Rivian vs Tesla 40:40  - Rivians financial challenges 46:07  - The future of EVs 49:29 - Vergecast Hotline w/Allison Johnson  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://seattle.eater.com/2024/2/21/24079162/tony-delivers-seattle-delivery-app-fees-downtown",
        "https://www.theverge.com/2024/3/5/24091079/rivian-r2-ev-launch-suv-price-live",
        "https://www.theverge.com/24094259/rivian-r2-r3-r3x-ceo-interview-price-production-future",
        "https://www.theverge.com/23773594/google-pixel-fold-review-screen-battery-hinge-camera",
        "https://www.theverge.com/23826325/samsung-galaxy-z-fold-5-review-screen-hinge-battery-camera",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "- Welcome to the Vergecast, the flagship podcast of Scaled EV Production. I'm your friend, David Pierce, and I am in the park walking my dog, but also doing some headphone testing. So I discovered a month or so ago that I was wearing headphones too often and it was actually making my ears itch, and I had switched from like the AirPods Pro, Sony Link Buds style that actually shove into your ear to just a normal pair of AirPods that just kind of hangs there. But even that wasn't solving my whole problem. So now I'm on this weird quest for what I guess I would call non headphone, headphones. I'm trying to find something that doesn't go in my ear but will still play music and won't annoy everyone around me. So I've been testing smart glasses, like this stuff you get from Meta or Amazon. I've been testing things like these, the Shokz headphones, their bone conduction headphones. They just like send sound through your cheekbone instead of your ear. It's all sort of fascinating. I'm not sure any of it is as good as what I left behind, but at least my ears don't itch anymore. So we're making progress. Anyway, we have an awesome show coming up for you today. We are gonna do two things. First, we're gonna tell a delivery story. Will Poor went out on the streets of Seattle and met a guy who is taking on Uber Eats and DoorDash and this whole crazy delivery industry all by himself. Super fun. You're gonna like it. Then we're gonna talk about Rivian, which just launched two new cars that people are very excited about. But in the process of that, I discovered I don't really understand anything about this company or why we think it might win, because there's really no evidence to suggest that it's going to. So we're gonna get into that. We're gonna answer a question from the hotline, all kinds of fun stuff. But first I just got the notification that these batteries are about to die, which means it's the end of the dog walk. This is the Vergecast. We'll see you in a sec. Welcome back. All right, I made it home. Everything's charging. I have to say I like the bone conduction headphones so far, although the Shokz ones that I was wearing were pretty expensive, and I also bought another pair from a brand I can't pronounce, that is just a bunch of consonants in a row on Amazon for a sixth of the price, and they look basically identical. So we'll have to see if you really get what you pay for there. Anyway, let's get into the show. For years now, I've been conflicted about these delivery apps, like DoorDash and Uber Eats. They are super convenient and they're helpful, and sometimes I don't want to cook or go out and most of us don't live within walking distance of a million good restaurants. I get it. I get why they're helpful and good, but I also can't shake this idea that actually these services are bad and they're bad for everyone involved. They make your meals more expensive, often more than you know through sneaky price increases, like the menu on Uber Eats is sometimes just more expensive than the menu at the restaurant. They also don't pay delivery people enough or offer them the protections or benefits that the people who work there should get. And for the most part, historically speaking, they're not even a very good business for the companies running them. It's hard to make money for anybody, including the restaurants, the drivers, everybody, it just seems bad, so what are we doing here? Anyway, a couple of weeks ago, there was this guy who went viral online because of some posters he had put up around Seattle saying basically, skip the apps, call me instead, I'll deliver your food. He became kind of a folk hero online. So we sent our producer, Will Poor, to go see what's going on. - [Will] This is one of those stories that exists because of a perfect storm type situation. Here's what happened, for years gig workers here in Seattle, notably delivery drivers, have been pissed at the lousy pay they've been earning in this very expensive city. So in 2022, the city council stepped in and mandated a higher pay rate for app-based delivery workers. - [Reporter 1] It's a good day for gig workers as the city of Seattle's new ordinance takes effect, - [Will] The new pay scale went into effect this past January and the apps didn't take the change graciously - [Reporter 2] In reaction, apps like Uber Eats and DoorDash began charging customers $5 in what they're calling a local operating fee. - [Will] That's on top of the service fees and delivery fees that apps routinely charged, to say nothing of tips. And customers are finding their limits. Fewer people are ordering from the apps, gig workers are feeling even more squeezed and everyone is pointing fingers at everyone else. - [Reporter 3] Food delivery orders plummeting since Seattle implemented new minimum wage requirements for delivery workers a month ago. - [Will] This kind of battle is playing out in other markets too. New York City enacted similar rules last year, which the apps have also been fighting tooth and nail. But there's one thing Seattle has that no one else does. A guy named Tony Isles, who I am trying to literally chase down right now. - [Tony] I always carry a tennis ball in my pocket for the round fluidity of a ball. I just like the idea of... When I was in San Francisco, I had a conversation with my buddy and I was like, \"Do you think shapes have thoughts?\" And I think they do. I think they do. I think that they influence the way that you think. I always carry that tennis ball, so I always feel like I have a fluid mind. - [Will] Tony is telling me this, while flying across downtown Seattle on a rented E-bike in the pouring rain. I'm on my own rental trying to listen and keep up at the same time. We're weaving in and out of bike lanes, dodging construction and crashing through puddles that could be potholes. It's chaos, which is partly the setting and partly Tony's fluid mind. In the first 30 minutes or so of pedaling, we have talked about Maslow's hierarchy of needs, China's social credit score and the Stanford Prison experiment. And I haven't asked any of the questions I came to ask. - [Tony] There's this idea called the method of Loki. I don't know if you know what that is. - [Will] I don't. - [Tony] It's like this way of remembering things verbatim historically in these ancient societies. It was asked this, this book that I read, it was called \"Moonwalking with Einstein\". Take a left. - [Will] Hey, if we get separated for any reason, just go finish your delivery and text me when you're done. I'll find you again, all right? - [Tony] Okay. Oh, 'cause I'm hustling. - [Will] Well, I just realized that I signed up to do a story about a delivery guy. - [Tony] You're all right man. - [Will] I don't know how I expected this to go. - [Tony] But it's a pleasure meeting you. - [Will] I gotta up my game here. Tony's backstory is pretty simple. He was driving for Uber Eats when those new fees suddenly killed demand. So at the beginning of February, he decided to go it alone. He put up some very DIY flyers downtown with an offer, text him a food order from any restaurant within a couple square miles and he'll get it to you for five bucks. No taking a cut from restaurants, no service fee, no delivery fee, no local operating fee, just a tip if you're feeling generous. He went viral pretty much instantly. - [Reporter 1] Right now on KIRO 7 tonight, growing frustrations for Seattle's new food delivery rules, - [Reporter 2] One driver becomes his boss's competitor. - Now just a few weeks later, Tony is a full on local celebrity. He's all over the news, Reddit, Twitter/X, and he says the orders have followed. The biggest challenge is cadence. He might get five texts all at once and then nothing for a while. So he's trying to figure that out along with the fame. Has this amount of attention been weird? - [Tony] Oh, it's crazy. I mean, it's just like all of a sudden my opinion matters. And a lot of people are asking me, they're just like, \"How much money are you making?\" - [Will] Right, right. - [Tony] I'm like, well, I'm not a monetary guy, I'm not a business oriented person. But what's interesting is I feel like I've introduced a solution for a social thing. - [Will] Tony's social solution goes something like this because of apps like Uber Eats and DoorDash, yes, delivery has gotten expensive, but more than that, it's gotten rushed and sloppy and impersonal. It's just bad vibes all the way down and it's ruining takeout for everyone. - [Tony] It's such a hard position to be in. - [Will] For who? - [Tony] For everybody. Everybody that's involved, the restaurants, the city, the people that are working as a deliverer, they're in this terrible toxic relationship with somebody. - [Will] The restaurant owners and the apps and the drivers and just like that whole thing. - [Tony] Well just like think about it, when's the last time you went into a restaurant and some driver goes in and cuts in front of you and you're just like, \"What in the world?\" Like, \"Hey man, I've been standing here for five minutes. What's your problem?\" You know that person is, they're hustling, right? So they're going in. And they're not thinking about that at all because that's not their psychology. - [Will] No, they gotta keep moving, And from where Tony's standing, the apps are moving in precisely the wrong direction. - [Tony] I think that the apps have this misaligned misdirection of where they think the market is and what they're planning for. I think that their whole goal is to like send robots to the buildings and send automated cars and it's like, okay, well if that's your solution then you might bleed for a while. And so, I'm not a monetary guy, but I could tell you how to make it work a little bit better. - [Will] Tony's whole thing is to strip all the tech and anonymity outta the process and be your friendly neighborhood delivery guy. And he thinks people will actively prefer a more social alternative, even if that care and attention limits him. - [Tony] I'm almost at a certain... Once I get to a certain number of people that order from me, I almost want to cap it to ensure the law of of Dunbar. - [Will] Dunbar's number is another favorite Tony topic. It's a theoretical limit to the number of social relationships any one person can maintain. You wanna cap the number of people that order from you so that you can stop and chat for a couple of minutes so you can get to know repeat customers. - [Tony] I Wouldn't even call them customers, I'll just call them my friends, the homies, you know? They're literally like, \"Yo, Tony, can you get this for me?\" And I think that's the thing, is when you try to turn it into a business to customer relationship versus a person to person relationship, they're not gonna be as understanding. If I forget your drink right now, someone will be like, \"Tony, it's fine. You don't have to go back to Chipotle.\" - [Will] Totally. - [Tony] But if I forget on Uber Eats, they're gonna be like, \"Yo man, what's going on here?\" - [Will] In short, Tony thinks that there is a whole lot more to delivery than speed and cost. But yes, he is cheaper than the competition and often faster too. - [Tony] I've never seen anybody run through a Target. I picked up somebody's Target stuff and I was running through the Target. (upbeat music) I'm gonna run here real quick. - [Will] I follow Tony as he makes two, maybe three deliveries, back-to-back, some chicken and a shake from Dave's Hot Chicken. (indistinct) does it come with a drink or anything? A salad from a healthy bowl place called Evergreens. I'm honestly not 100% sure it was such a blur, but at each pickup and drop off, Tony lives up to his own pitch. He's courteous, warm, casual, and chatty. - [Tony] So man, how are you doing today? - [Will] We pull up to our next destination, a big apartment building, and while we wait in the lobby for Tony's customer, sorry, his homie, to come down, he's recognized by a stranger. - [Stranger] You're the guy. - [Tony] Yeah, I am. Nice to meet you. - [Will] I stop and chat with Tony's homie for a few minutes. He says that he and his roommates have ordered from Tony maybe 10 times in the past month. - [Customer] I was just scrolling through Reddit one day and then I saw someone posting a... They posted a picture of one of his flyers that were posted in the city, and I was like, \"Oh, that's pretty interesting. It's cheaper than DoorDash.\" So I was like, \"Let me give it a try.\" And then ever since it's been me and my roommates go to. - [Will] Oh, nice. So you guys are like serious regulars at this point? - [Customer] Like I'm saying, between the three of us type thing. - [Will] And were you Uber Eats, DoorDash people before that? - Yeah, exactly, DoorDash mainly. And then it just got expensive, so we were like, \"Let's see what else there is.\" - [Will] What's the Tony experience like and how is it different from the apps? - [Customer] I think it's a lot nicer because first of all, all you have to do is just text him. So that's already a lot easier. He's much faster and it's always nice having a quick conversation with him in the lobby. He always waits. He's fun to talk to. He is a very chill guy. We've had some nice conversations, it's cool. (upbeat music) - [Will] At the end of the lunch rush, Tony and I sat down at a cafe to talk some more. I went into the story wanting to know whether a guy like Tony can make it. Seattle's minimum wage is almost $20 an hour. So to match that, he'd need four deliveries an hour, not accounting for tips, which after seeing him in action definitely feels doable, but it is a hustle. In other words, it's still gig work and Tony's only working the lunch and dinner rushes right now. So after this whole adventure, my question remains, can he make it? It turns out that is Tony's least favorite question. - [Tony] I'm looking at it as like, I just understand people, they all have their perspectives and all I'm trying to be is the glue that glues you in that connective tissue so that way you can get off Reddit and stop arguing about how much money I'm making. Get off Reddit and stop arguing whether it's gonna be financially responsible. I can figure that out on my own. - [Will] I get the sense that Tony has become a kind of avatar. Everyone's putting all their thoughts and feelings about the gig economy onto him. I think that's why his story blew up online. If you're frustrated by big, powerful companies making life more annoying, he is the folk hero to root for, which is just way too much for Tony to take on. - [Tony] All of a sudden, people are texting me and they're like, \"You got a great business mind.\" And I'm like, \"What are you talking about?\" And I think that what people are trying to do, they're trying to box me. They're trying to say, \"Tony fits here.\" And I think what they're lacking of understanding is, is like, I actually don't fit anywhere. I'm this round ball that's just rolling down the street. - [Will] Like the one in your pocket. - [Tony] That's exactly, exactly. (gentle music) - [Will] Tony has no idea whether Tony Delivers will make it or what will happen to food delivery more broadly. He just knows that something needs to change. - [Tony] Like what they tried to do is they tried to put food on a conveyor belt and deliver it like an Amazon package. And it's not gonna work. They're winning right now, but at the end of the day, it's not gonna work. It's too expensive. They're waiting for things to be solved and they're hoping, they're hoping that somebody down the line, intelligence is gonna hit that S-curve. They're gonna be able to plug in the robots and they're gonna be able to do it. And I'm here to tell you it's not gonna work. - [Will] As cagey as Tony is about his own future, he will say that he's been fielding calls from all over the country, people who have heard his story and wanna do what he does. - [Tony] So it's like, all right, well how can I then be the Energizer Bunny for some things that we do like and that we do think about and maybe that I can more positively impact in a different sense, just giving people the right direction, energizing their bunny, so to speak. Giving them the battery to the right mindset. - [Will] So what does this all reveal about the gig economy? Well, Tony has clearly tapped into something and in spite of his grander pronouncements, what he's saying is pretty straightforward. - [Tony] I think that what it represents, I think personally is this idea that we don't need the apps. - [Will] We're so used to apps mediating all of our activities that at this point, what if not apps actually feels revelatory, but it's telling that Tony's customers are more than happy to ditch Uber Eats and DoorDash at the drop of a hat or the drop of a new fee. And if big tech companies really do double down on automation and robots, more people might actively seek out more humanity, more idiosyncrasy, more Tony. Tony himself wants to experiment and meet people and hopefully pay the bills. And if he accidentally starts a revolution along the way, all the better. - [Tony] It would be nice to be known as the guy that was trying to connect us back together. That'd be kind of cool. But not in like the sense of like, \"This was the guy\", it was just more like, \"Oh, this Tony Isles mentioned this and we thought it was a good idea and it worked. And then eventually we reconnected.\" (upbeat music) - [David] Thanks again, Will. We gotta take a quick break and we'll be right back to talk about cars. (upbeat music) All right, we're back. So a couple of weeks ago the EV maker, Rivian, launched some new cars. - [RJ] I'm so excited to have all of you here. Let me introduce you to R2. - [David] The cars look great actually, and people got particularly excited about the R3. - [RJ] About R2's sibling, which we call R3. - [David] Which is a little crossover style EV coming someday. but I couldn't stop thinking during this event, who even is Rivian? Over the last few years, this company has been set up as one of the most exciting companies in the car industry and a real genuine Tesla rival. But from everything I hear and read, it is very much still a startup. It doesn't make that many cars, it's bleeding money and it's not lighting up the sales charts. So what gives here? Is Rivian really the golden child we sometimes make it out to be. I asked The Verge's Andy Hawkins to come on and help us understand where Rivian came from, why it's so well liked, and whether it really has a shot to win, like Tesla-level win. Andy Hawkins, welcome back to the Vergecast. - [Andy] Hey, how's it going? - [David] I'm confused. Where did this company come from and how did it become the one that we talked to next to Tesla? - [Andy] Yeah, so I think the most interesting thing about Rivian was that it was a secret for a very long time. The company was actually, I think, founded in like 2008, but it didn't come out of stealth, as they say, until around 2017, 2018. - [David] That's a long time. - [Andy] Yeah, which is I think a much longer time to be secretive than I think your average company that's in the stealth mode. So that was kind of interesting right out of the gate. And then secondly, they had a very compelling proposition right away, which was that we're gonna make electric vehicles, only electric vehicles. They're going to be adventure themed, they're gonna be for off-roading, for camping, for exploring nature, and it's gonna have a very distinctive design language. And so if you look at the first couple products that the company introduced several years ago, the R1T truck and the R1S SUV, they're both very similar looking to each other and they have this design that is very friendly. It has a cute face with big oval headlights that look like eyes with a light bar that runs across the middle of the grill. It just has like kind of a very friendly, approachable design to it. And also I think the products themselves were very clearly meant to slot into those segments in the auto industry today that are the most popular. Pickup trucks and large three row SUVs. So I think a lot of people saw this company as a very serious contender that they weren't some vanity play. They were gonna try to actually compete with some of the legacy automakers as well as Tesla. And I think a lot of people were very compelled by the image, by the optimism and the friendliness that the company was trying to put out there. And so I think that those are the couple reasons why a lot of people are very interested in Rivian and you hear a lot of people talking about them today. - [David] Okay, so part of why I've always thought this company was odd is that some of what you just described is the playbook in this space, right? This is what a bunch of these companies have tried to do is go for the most obvious segments of this thing, but also to sell you this beautiful vision of a better electric future of cars, which I think all of these companies have spent a decade doing is like making grand promises about how everything's gonna be electrified so you might as well go along for the ride. But I feel like from the jump when Rivian came out, we put Rivian up in the stratosphere of one of the serious players in a way that I feel like we don't talk about Polestar that way, we don't talk about Lucid that way, we don't talk about this other handful of companies that are actually out there producing cars in some volume. But Rivian from the beginning was held up next to Tesla as one of the great promises of the electric car. Why? - [Andy] I don't know if that's true, exactly. If I could just push back a little bit. - [David] Please. - [Andy] I do think that they generated a lot of excitement and a lot of people were very interested in them. And I think that the company's founder and CEO, RJ Scaringe, presents a very interesting figure in contrast to Elon Musk. He was a lot more polished, not so prone to any racist rants on social media platforms or what have you. And just seemed like a very trustworthy, serious business guy who had a definite vision for the company. Which is not to say that the company I think was immediately elevated to the same status as Tesla because I think the fact remains, they're a low volume company. They only sell several 10s of 1,000s of vehicles every year as compared to Tesla, which sells over a million cars every year. Or even the legacy automakers which sell millions upon millions of cars. And so I think there was a lot of excitement and I think through that haze of excitement, I think that people could make the assumption that this was a company that was on par at the same level as the rest of the industry or even some of the upstarts like Tesla. But I think that the reality of the situation was they only make a few vehicles every year. They only had two models that were available to consumers plus an electric delivery van, which was only available to Amazon exclusively for a while, but it's now supposedly gonna be sold to some other companies as well. - [David] That was a big deal, right? Amazon made a lot of noise about buying a lot of trucks from Rivian. That was gonna be a big thing. - [Andy] It was a huge deal. And I think that that was one of the things, Amazon's backing, their investment in the company, their commitment to buying a 100,000 electric delivery vans from Rivian, plus an investment from Ford as well, gave a lot of people the impression that this was going to be the next big electric car company, when in reality they were going to confront a lot of the same challenges as Tesla and even as the legacy automakers are really confronting at the moment too. And if anything, it was gonna be a lot tougher for Rivian because as a new player, as what they call pure play EV, a company that only makes EV, electric vehicles, and not any hybrids or internal combustion vehicles. So they have no other revenue to fall back on if the market dips, which it is now and I assume we're gonna talk about, they're gonna take it square in the chin. And I think that that's playing out. There's a lot of excitement still about the company. There's a lot of promise, but a lot of questions in the future is a little cloudy, I would say. - [David] Okay. Yeah, I am curious how the message from Rivian has changed over the years because like you're talking about, I think if you rewind to even 2017, there was this sense that we are going to have EVs, they're going to be everywhere and they're gonna be everywhere soon. And everybody was talking about self-driving was gonna be the thing, we were gonna have the Uber fleets of self-driving cars. And by now the whole world was gonna be different. And obviously that is extremely not what happened. - [Andy] Yeah, I'm getting PTSD just from you saying all of this. - [David] Do you remember when 2020 was gonna be the year of the fleet of Uber robot taxis? Like that was the year they all gave us, it's insane in retrospect, but I think if I am Rivian, you've built up this story over time about what you're doing and why it's important. But I know we recently talked to RJ, the CEO, after the most recent launch, which I wanna talk about. There's a sense that they're just trying to still beat that same drum, that they're like, \"This is coming, it's gonna work, everything's gonna be fine.\" And I feel like we haven't that yet. So should we keep believing this guy that this is gonna come true? - [Andy] Great question, answer, hmm, I don't know. So two things I think that obviously electric vehicles are not poised to take over all personal transportation in the next week or so. - [David] But by 2020 they will. - [Andy] Exactly. I still have hopes for 2020. No, but it's not coming quite as quickly as we thought it was. Which is not to say that it won't come eventually. And I think a lot of the serious people that are operating this business, a lot of the automakers, the people whose jobs that it is who get paid lots of money to make these types of predictions are saying that electric vehicles are still the future, despite a slowdown in sales growth and a lot of investment pullback from some of the major companies, factories are getting stalled. Even Rivian is putting a pause on its plan to build a $5 billion factory in Georgia as a reflection of the reality that we're facing today. And that's because of a lot of different reasons. I think first and foremost, the industry put all its eggs in one basket and rushed maybe a little bit too quickly towards this goal, not realizing that both the charging infrastructure was not going to keep a pace with their own desires to sell electric vehicles, but also that consumers were not going to be as eager to make the switch as they thought they would be. And that's because of a lot of reasons. The the charging is not that great. The prices are still really too high for a lot of people. Politics have reared their ugly head and have complicated a lot of this for some folks. So it's just looking a lot messier and it's maybe going to take a little bit longer than people thought it was. But that's not to say that eventually the majority of cars that are sold in this country and other countries will be electric. We're already seeing it in some countries in the world. China has been making a lot of progress in pushing up the volume of EVs. Europe is, I think a little bit further behind, but they're making a lot of progress as well. Norway. Norway is this country where you would think because of how cold it is that nobody wants to buy EVs because EVs don't run well in the cold. But yet I think over half the vehicles sold in that country are electric. Tesla does very well there. - [David] Good for Norway. - [Andy] Yeah, that's right. They're showing us the way, the Norway. So I think it's just... it's gonna take a little bit longer. Customers are showing a lot of preferences for hybrids for example, they wanna be eased in to this hot bath that's being drawn for them by the auto industry. They don't wanna just jump right in. That's a terrible image. So you can feel free to edit that out. I don't know why I said that. - [David] It's good. It's a little gross in the way that all of these should be. I think that feels right. - [Andy] So anyway, so amidst all of this, you have Rivian a small company with a lot of buzz, trying to do its best and it's struggling. I mentioned the factory, they're losing a lot of money. Their cash pile is dwindling. So they're have to make what's called a volume play. They need to say, \"We need to start selling a lot of cars.\" The cars that they have right now, the truck and the SUV are very expensive. They're over $75,000. You can get up to $80,000 with options. That's just too expensive for most people to afford. So they need to make a play for that middle segment, which is why we got the R2 reveal, a $45,000 mid-size SUV that can go over 300 miles on a single charge and accelerate from zero to 60 in under 3 seconds, allegedly. So I think that's why the R2 is a very important car for Rivian. It's their play at the mass market. They're saying, \"We need to start selling more cars to more people and here is the product that's going to be the one to do it.\" - Yeah, the R2 strikes me as maybe more than just an important car for Rivian, like an important car for this whole industry right now. Because correct me if I'm wrong, but there's really not a ton out there in this price range and this sort of specific level of coolness. We were talking before we started recording about Hyundai and Kia. And I actually think what those companies are doing in this space is really interesting. But I also think fundamentally, the people who want a car like this, are maybe more likely than most to be looking at these cool new brands. I notice Rivian on the road, the amount of Rivian that I'm aware of relative to the amount of Rivian that exist is so much higher than any other car on the road right now. Do you know what I mean? - [Andy] It's very distinctive. It really, it draws attention to itself for sure. - [David] Right and I think that's really powerful and important. And if you can do that with a car that many people can actually afford, that seems like a potentially huge deal. But then there are two questions where one, is this actually something lots of those people want? And then two, can Rivian actually get around to making enough of them to make a difference? And I do feel like those are both still pretty open questions, right? - [Andy] Absolutely. The fact that the car is not gonna go into production until early 2026, I think is also gonna be an issue. I mean that might as well be 2,000 years from now... - [David] We might have self-driving by then, who knows. - Exactly, so whether or not like the R2 is still generating excitement then is, I think, very much an open question. But that's not to say that people were very excited, at least the people in my very narrow view of social media, very excited about this car. Lots of people that were tripping over themselves to praise it. They loved how it looked. They liked the specs, they liked the price. But like I said, it's gonna be up to the consumers as to whether or not it actually turns out to be a popular one and whether or not Rivian can survive long enough to actually put it into production, which is gonna be a huge challenge for the company. - What's been the, the read on the R1T and the R1S so far? Are they generally... They're very cool, when I see them I like them, but what is the broad consensus on whether these are actually good cars? - Yeah, no, people really love them. They have a very dedicated fan base. It's very different than the Tesla fan base. It's very interesting. If you go on to Reddit and some of the message boards and listen to what people talk about, they talk about the cars a lot differently. There's obviously less focus on RJ Scaringe, the CEO as some sort of lord and savior, which contrasts very much with what Tesla does, - [David] Which I'm assuming RJ is pretty happy with. - [Andy] I'm sure he is. But yeah, these are well loved cars. The people who own them love them. I think the software experience leaves a little bit a lacking, but that's typical across the industry right now. The car industry as a whole is fumbling the ball when it comes to software. The cars do not have Apple CarPlay or Android Auto, which is not a very popular decision. And a lot of the owners would love to see phone projection brought into their cars. But that said, the cars themselves are very delightful, but they're expensive as I mentioned before. And so the segment of the population that actually owns these vehicles is still very small. You notice them, they're very noticeable, but still, I mean like, your eyes glaze over the Toyota Highlanders and the the RAV 4s and the Honda Pilots because there are just so many of them. Whereas the Rivian stand out, which I think is a good selling point. But I think it obscures how actually small the population of people who own these vehicles actually is. - [David] Oh for sure. I'm pretty sure there's just one in my neighborhood, but I just notice it every single time I see it. So I'm, \"My God, there's a lot of Rivians out there.\" It does seem like, to your point about Tesla, I think there's a thing that Rivian did accidentally really well it seems like, which is it grew right as Tesla was peaking in people's minds as a cool company that was gonna save the world and be good for it. And every time I hear RJ talk, you get the sense that he is trying to still be optimistic and happy and tell you about a better world in increasing distance from what people perceive about Elon Musk in particular. And Tesla, for better and for worse, has always been super attached to Elon Musk. So it feels like if I'm Rivian or frankly any of these other companies, all the people who believe in the mission but are falling out of love with Elon Musk, for one reason or another, are looking for somewhere to go and care about and put their money in and put their fandom in. - [Andy] Those people are gettable. - [David] Do you think they are? The other thing that I wondered is like, are we just gonna get past that and these are just gonna go back to being cars? - [Andy] Well, yeah, I mean something interesting that RJ said in our interview with Abigail Bassett, the writer who who interviewed him for us was that, he was very impressed with what Tesla has been able to do, but that new cars that are electric sold each year has just reached about eight to nine percent and what he was interested in was going after that 90% that are still not buying electric vehicles. I mean that's that's the obvious line that he's gonna deliver of course. Which helps sell the prospect of the R2 as this mass market volume play that they are hoping it will be. But yeah, I think that he needs a model three and Rivian is looking for a Tesla model three moment, I think with the R2 here because Tesla, for a long time, there was no guarantee that company was going to succeed. In fact, they very nearly failed many times, especially during the model three ramp up. - [David] Yeah, Tesla was just as precarious as Rivian is now. - [Andy] If not more so, absolutely. And it was only because of the car's popularity and the company's ability to get it out in the numbers that it did, which started slow and then eventually ramped up to a pretty steady clip that people are starting to actually get their vehicles most likely at the expense of Tesla's employees who have, numerous of them have sued the company for many problems that they've had. But yeah, that prospect I think is still up there on top of the hill and I think Rivian sees it up there and it needs to get up to that moment where they're starting to produce cars at a steady clip and people are loving them and buying them, which is, I think given the current situation around EV sales and the sales growth slow down, is why things are as complicated for the company. So yeah, I think he wants to get to that Tesla moment. What's most interesting to me about the image that he's projecting and how RJ talks about the company, especially just in the words that he uses during these events, is they may aspire to be like Tesla, but I think they would rather be more like Apple. The way that they talk and the way that they present their products and the way that people talk about their products feels more like Apple than Tesla, which is optimism and the design is very friendly and RJ is out there literally talking about one more thing in revealing the R3 and the R3X, which is the classic Steve Jobs line, although Elon stole it as well I think a couple times. But that's all Apple. So there's been lots of talk, should Apple buy Rivian? Apple's own car project ended. - [David] I was gonna say, being Apple in cars might not be the thing to shoot for here. - [Andy] Right? So I think a lot of people see like a possible synergistic moment here. Like, \"Oh, you need a car, Apple, here's a struggling car company that would slot perfectly in with your line of products.\" I don't know if RJ or Tim Cook are talking or whether or not that would be appealing to them at all. But that certainly doesn't stop the talk that's out there. - [David] Yeah, it's an interesting way of thinking about it and it does make me wonder if somewhere RJ is sitting around being like, \"Do I need a little more of a God complex if I'm gonna make any of this work?\" Like, you get the sense that too much God complex bad, but maybe you need a little bit. If you don't believe it, how is anybody else going to, you know what I mean? - [Andy] Right, exactly. Just a little bit of confidence, that's all it takes. - [David] That's what I tell you all the time. Just a little bit of God complex, Andy, and everything will be fine. But so I think this moment is so interesting to me for exactly the reason you're describing. There's the R2 and I think I also want to know what you think about the R3 because it was the one more thing, the sneaky little thing that got everybody really excited. Like my favorite thing about the R3 reveal was everybody posting pictures of SUVs from the nineties that look exactly like the R3, but then everybody being like, \"Yeah, I don't care. I still want it.\" And like there is something about this space that people still like, feel real feelings about, even though they're becoming these increasingly mainstream family cars. - [Andy] Well, yeah, and especially because if you look at some of the design that's out there today and just the vast majority of cars that people buy, there's very little that distinguishes one car from the next. They've all... I think it's like the industry has all just settled on this shape of a car, this SUV crossover shape that is the most popular amongst all the cars. And it has scrubbed out a lot of the things that made cars unique and interesting to people. There's just very little to differentiate one brand from the other. I mean, yes, you can probably notice a BMW grill is different from a Ford and the shape of a Mercedes is a little bit different than maybe an Audi. But in the end of it, I think if you did a blind taste test with a bunch of people, I think that they would have some difficulty distinguishing one car from the next, which is I think a lot of why you see some excitement around Rivian because there is something that's distinctive about it. There is something that's kind of... Especially with the R3 that's very retro futuristic. It has like this hatchback shape that is very reminiscent of 70s era VW Golfs or I saw some people talking about the Lada Niva, which I was not overly familiar with. I'm not like a huge car guy, so I don't really go too deep into the lore. But the La Neva, I've been reading lots of articles because I'm fascinated now by this little legendary Russian offroad hatchback that is fascinating and it does look a lot like the R3X especially, but I think that was appealing to people, especially if you sort of look at all of our products, our phones look the same, our cars look the same, our laptops all generally look the same, our TVs all look the same. So you just want something that's out there that gives you a sense that I'm attaching myself, I'm making this consumer choice that gives me a little bit of an elevate... It distinguishes me from my neighbor or somebody else. And I think the Rivian kind of offers that to people, which is why they get so worked up about it. - [David] Totally and I'm just looking at a picture of the R3 right now and you're right, and I hadn't really thought about this, that it walks that middle really well. Where like some of the electric cars we've seen, really for a decade now, are all trying to look like they're from 1,000 years in the future. And even there's a Hyundai dealership just down the street from me and literally every time an Ionic 5 comes by, it's like, oh look a spaceship. Like you built a spaceship that now just sits in my neighbor's garage. Cool, fine. Some people want that, lots of people want a car and it turns out it's okay that it can look like a car, but also like it's five years from the future, not 5,000. And I think like what you're talking about with Rivian, where they're just like, we took a thing people are familiar with and jazzed it up a little bit, is maybe exactly what people want. - [Andy] Yeah, I think people were especially eager to see some angles brought back in to the EV design because a common critique that you'll hear is that all the EVs look like jelly beans. - [David] That's so true. - [Andy] Is very much what the Teslas look like. And I think you're now, just now, starting to see some pushback against that. I think you're seeing it from Rivian. There's another company called Scout Motors that's gonna be coming on the scene pretty soon. They're owned by Volkswagen. It's also an old 70s, 80s era, off-Road brand that's being revived and brought back and made into an all electric brand. An Ford has talked about maybe electrifying the Bronco. So I think you're gonna start to see some differentiation in what these cars look like and Rivian needs to get out there before everyone else because pretty soon that space is gonna get super crowded. Especially the midsize SUV space. I think we've got our fair share of crossovers. We've seen them all the Mustang Mach E and the Model Y, the Volkswagen ID 4, the Ionic, the Kia, and now we need to start seeing something that's a little bit roomier but also just something different that looks different that gives somebody the idea that like, \"Okay, this is not just the same jelly bean that I've become used to in the EVs.\" - [David] I will never unsee the jelly bean now and I feel like I hate you for that. Like I can't stop thinking about jelly beans, I can picture them in my head now. But it does seem like what that puts Rivian up for is a very consequential next three years. Because also, like you were saying a minute ago, every other car company has been promising to do this kind of stuff over the next few years. So this idea that Rivian was early and had some good ideas and made a cool car that a lot of people like and now it needs to figure out how to make lots of them. Like I think to me at least one of the lessons we've really learned over the last couple years is just how far ahead Tesla was. Rivian strikes me as not nearly that far ahead. And in fact is kind of at a moment where it needs the R2 to work in a pretty big way or else it's gonna have a pretty big hole to dig out of. Am I being too pessimistic about its chances there? - [Andy] Not at all. I mean the stat that jumped out to me the most was that I think in its most recent earnings filing, the company said that it loses $47,000 for every vehicle that it sells. - [David] Good lord. - [Andy] So to give you a sense of how unprofitable things are for Rivian right now, that's the price of the R2. That's basically how much they're planning on charging for this new vehicle. Which just goes to show how crucial it's going to be for them. Their cash pile is dwindling, they're running outta money, this factory plan is on pause. They did not sell as many vehicles as they thought they were going to. I think it was around 57,000 last year. And this year they're saying that it's gonna stay pretty flat. They're gonna sell basically the same that they did last year, which is not something that investors see a lot of confidence in. Obviously they wanna see growth. This company and a company that sells the same number of vehicles that it sold last year is not really exhibiting growth in the way that I think a lot of people would like to see. - [David] Is that because Rivian can't make enough to satisfy demand? Or is it because maybe everybody who wants the stuff that Rivian is already making has one? - [Andy] So for a while they were supply constrained. They were not able to make as many as people wanted. And now they are demand constrained because not as many people can afford the vehicles as they would like, because they are expensive. The ones that they sell now. The R1S and the R1T. So yeah, it's been flipped on them and they're running into these problems and it's not just Rivian. All the companies are in this weird, liminal space right now where they need to make more vehicles, they wanna sell more vehicles, but people all don't wanna buy as many as they thought they were because the prices are still too high. The used market still is mostly Tesla. The vast majority of the EVs that are for sale that are used are Teslas. And those are on the used Tesla, that's 21,000, 22,000. That's pretty attractive. And Tesla keeps cutting its own prices, which is also driving other companies to cut prices as well, which reduces margins and makes things more difficult in terms of trying to eke out a profit. But the company does say that it will be profitable in the fourth quarter of this year. Whether that's EBITDA profitable or operationally, whether they have free cash flow. It's not exactly clear quite yet. But they say that by pausing this plan to build a factory, which was going to obviously expand their ability to make more cars, they're gonna be able to get the R2 out the door faster because they're gonna make it at their factory in Illinois. And that's going to be able to reach customers faster, which they say was going to increase their chances of kicking that revenue stream up and getting it flowing a lot faster and improving their financial situation. So yeah, we'll have to see. - So they know they need to be in the game here if they do a Tesla and like promise a thing in two years that ships in five years, they're probably dead in the water. - Yeah and they've already confronted a lot of issues around wait times and software issues. I mean you can set your clock to it in terms of these companies and the same problems that they're running into. You would think seeing the Tesla playbook, you would also see the trade-offs and the pitfalls that were along the way. But it's the same thing there. I mean they had a problem with... Their software was bricking the cars for a little while. They had to push a software update. I do think that the R2 in particular, this is gonna be their model three. This is the one that they think is gonna be the high volume seller. The R3 is gonna be the icing on the cake. that's gonna be the fun little cousin to the R2. But that's gonna be the real play that they hope is gonna be the one that takes over the streets and transforms them from a small company to hopefully one that's successful and a future ahead of it. - [David] Okay, fair enough. Does it seem like there's any other company of Rivian's size and prestige that might just totally eat its lunch? - [Andy] Yeah. Polestar, they're a performance brand. People who like to go vroom-vroom really fast like the Polestar. Which is cool. They're cool cars. They're really cool. They're also kind of Apple-ish in a way. They're all white and they have, even though it's Google's Android software native, there's just something that's very Apple about Polestar. - But Polestar seems to your point, have no particular interest in like, they're not trying to be Toyota. - No, I don't think so. They're trying to be Mercedes, they're trying to be Audi and that's fine. There's a lot of money to be made in that segment as well. I think what they have to be worried about is Ford and Jeep. And I mentioned Scout as well, but I don't think Scout really has... We don't really know what they're gonna be yet. But I do think Jeep in particular, given the similarities and the overlap in the customers that are interested in these cars, in Rivian vehicles, has the potential to eat Rivian lunch, as you put it. And Jeep has said that they are coming out with all electric. There's gonna be an all electric Wrangler. There's going to be an all electric Grand Cherokee. They're coming. Also, I think if Subaru got off its ass and actually made some good EVs, that could hurt as well, 'cause I see some overlap in customers there. But Subaru is in the same campus Toyota, they're kind of dragging a little bit on the EV rollout. So Rivian still has a possibility here. And I do think that they could have a first mover advantage if they can get the R2 out in the timeframe that they said that they will. - [David] Yeah, and as we've learned, there's nothing like an existential threat to your company to get you to actually shift your car. - [Andy] It's very motivating, I've heard, I've not experienced it myself, but yes. And then, yeah, but then the China question looms over all of this. Will China eventually be able to sell its cheap electric vehicles in the United States? Is a huge question. Elon Musk has said himself that would be a devastating blow to the EV industry in in the United States. And BYD in particular, China's biggest automaker has said that they're gonna start building a factory in Mexico, which is right on our doorstep. So the tariff situation is still very unfriendly to Chinese made EVs. Obviously the policy situation is very bad for them. It would be very expensive for them to try to sell, but it's still an open possibility. - [David] Fair enough. So it's gonna be in a big couple of years, I feel like we've been saying for 10 years it's gonna be a big couple of years, but this one feels real. - [Andy] Yes, it does feel... I mean like, I think like we're starting to see a lot of pieces fall into play. All the automakers are jumping on the Tesla charging bandwagon. They're all gonna start using superchargers. They're giving out adapters to their customers. They're gonna have the Tesla port built in natively on the vehicle themselves. The R2 for example, is gonna be the first Rivian vehicle to have the Tesla NACS charging port in the vehicle. So those vehicles will be able to charge at Tesla supercharger stations. That's gonna be huge as we start to see that get adopted widespread. And then you've got the incentive that are available, the federal EV tax credit can now be taken at the dealership. You go into a dealership, you're like, \"I wanna buy an electric vehicle. Does it meet these criteria? Do I meet the criteria?\" If so, yes, great. You get a $7,500 discount right at the point of sale. That's gonna be huge. Big incentive, I think for a lot of people to buy electric cars. And I think more of these mass market cars, more of these volume players like the R2, I think the Chevy Blazer went through a bit of a software issue, but now is back and available for sale, as well as the Chevy Equinox EV is gonna be coming out. These are common, normal, everyday vehicles that most people can afford. And if they are sold at a price point that car buyers think is right for them, I think you're gonna really start to see things shoot up in terms of sales growth. - [David] Fair enough. So yeah, we're gonna get a real answer on Rivian here one way or another pretty quickly. Whether this company is like a neat brand that has sold a good story about itself or is a real power player. And it makes me feel better to know that's coming because I've come into this being like, \"Do we know anything about whether Rivian is actually gonna work?\" And I feel like the answer is we don't, but we're about to. - [Andy] Yeah. And I think that they have a lot of smart people that work for them, and it seems like they have a lot of interesting partnerships. But yeah, there's a lot that's still up in the air. I think that it'll be a really interesting year for them and for, for the rest of the industry. - [David] Totally. I do love the headlights. I am normally a gigantic antagonist to all weird ideas about headlights because they're just all the worst. And the Mustang thing where the turn signal goes in... Awful. I hate it all. Rivian did a good job. So for that reason alone, I hope it works. - [Andy] The oval speaks to your need for rounded symmetry. - [David] It just feels right. It just feels nice. It's like it's smiling at me. - [Andy] Happy little face, smiling at you. - [David] All right, Andy, thank you as always. Appreciate it. - [Andy] Oh, my pleasure, thanks David. (upbeat music) - All right, we gotta take one more break and then we'll be back with the Vergecast hotline. (upbeat music) (electronic bleeping) We're back. Let's get to the hotline as always, the number is 866VERGE11. The email is vergecast@theverge.com. We love all your questions and we try to answer at least one on the show every week. Before we get into this one, first of all, thank you to everybody who called and emailed about TikTok. You had awesome feedback. It was great to hear from you. I promise Nilay, Alex and I are all still friends. We're gonna get to a bunch of your feedback on Friday. I think I wanna give all that stuff a few more days to play out just because there's a lot happening really fast. And one of the things we talked about last week was the huge lack of information that we have and we're starting to get more information, so we're gonna get to all of that on Friday. So stay tuned. For now we have a question from Terry. - [Terry] Hi, this is Terry in Philadelphia, and I'm preparing for a professional exam. And every time I do, I become obsessed about a particular piece of technology thinking that if I buy one more gadget that will make the stress of this thing, that will define the arc of my life, or at least what my salary raises this year, just kind of go away. That current obsession are folding phones. I'm a massive man with hands that can just hold an entire country ham. So it feels like a folding phone would be perfect for the fact that I seemingly have the hands of a steel worker despite being an actuary. And one of the thing that gets me is whenever I read a review and one of the dings is this expense, is how to interpret the fact that I'm now like a year out from the Fold 5 and the Pixel Fold and I can get them all used for like $800 off. Do I just effectively add one point to the Verge review score? How, how do you factor in the fact that stuff gets cheaper when you're interpreting the review on a review site? Any insight would be great. Love the show, stay classy. - [David] All right, this is one of my favorite and one of the most relatable questions we've gotten on the Vergecast in a long time. Allison Johnson's here to help me answer it. Hi Allison. - [Allison] Hello. - [David] Do we love Terry? I feel like we love Terry. - [Allison] Yes. - [David] I feel like the thing where I'm like I have a big project to do, let me buy a gadget that will solve all of my problems, is extremely relatable. - [Allison] I feel seen, yeah. Like this planner is gonna do everything for me. - [David] I have brought you here 'cause I think there are two questions inside of this question, both of which I want to talk about. One is for our massive man friend Terry with huge country ham hands, is a foldable phone the right call? That's question number one. And then question number two is, which I want to get to is how do you think about price in a review like that and how should we think about price of these things over time as they inevitably come down? But let's just start with the beginning thing. The foldable phone question. Is a foldable phone gonna solve all of Terry's problems forever for the rest of his life? - [Allison] Yes, Terry, I have great news. All you need to do is spend upwards of $800 on a gadget. No, I think there's something there. I think that's fair to think that you have a phone that's normal size when you wanna do something fiddly or you just want more screen space, open it up and you have almost a tablet. So I think that's real. I think Terry is on the right track. - [David] I'm curious what your experience has been with foldable phones in terms of the productivity they enable. 'Cause for me, I've used most of my foldable experiences with the Pixel Fold at this point. And what I have found is that as a thing for just more screen real estate, whether it's I have a PDF that isn't scaling well to my phone or whatever or a thing I want to actually mark up with a pen, foldable phones, awesome. The thing that has not worked for me that I have found very frustrating is I hoped that typing would be better on a foldable phone. 'Cause you can do the split keyboard thing and sort of type with two thumbs on a bigger screen and it would be better. I have not found that to be the case at all, but I'm curious what your experience has been like, what do you get from the bigger screen that way? - [Allison] Yeah, for me it is the productivity stuff and like the scenario I keep coming back to is like, I just hate tabbing around between apps and you just always end up doing it where I'm like planning dinner with friends and you're in a little chat app, you gotta switch to Google Maps, you gotta look at a PDF of the restaurant's menu, the foldable phones let you put two things on the screen at once and hold two thoughts in your head at one time. I so appreciate them for that. I will occasionally indulge in a game that's fun on a bigger screen, but for me it's definitely the like, \"Oh I can just breathe and put all these things out\" or I have a little Spotify in a little window and Duolingo. It's just a little bit more of a computer experience than a phone experience. I agree, typing is weird. It feels strange. - [David] Yeah, I keep thinking I'm gonna get used to it, but I haven't. But you're totally right. The two apps side by side thing, especially for something like research and note taking is really useful. Just for me, being able to have the browser on one side and a Google Doc or my notes app or whatever on the other, is amazing. And I never noticed how annoying it is to constantly switch between apps on my iPhone as I have after using the Pixel Fold a bunch. So I'm with you. So, okay Terry, you should buy it. It's gonna be amazing. Let's talk about prices because I think you were on this show when all this stuff first came out and I think we more or less agree $1,800 is a ludicrous amount of money to pay for a phone. If you want to and you have the money, go with God, right? But $1,800 is a tremendous amount of money, but these things are now a year or in the Galaxy Fold's case sometimes a couple of years old, the prices are coming way down. Does that make you think differently about them? - [Allison] This is the question I ask myself every day. Just even when you consider when one of these phones comes out, especially Samsung, they'll throw a new phone at you if you trade something in or if you sign up on your carriers', you promise to pay them 1,000s of dollars over the next three years, they'll throw a phone at you. So what does a phone really cost is a question. I think there is a calculus as when you get to like a year out, the prices will come down sometimes. I think foldables have been a little more stubborn, but the thing to balance that with is always like, \"What do we think is coming out next? Is it gonna be a big leap forward this year?\" I would argue that the Galaxy Z Fold 4 to 5 like not much changed there. And if you were looking at a Z Fold 4 and skip the 5, that probably would've been a good call. I think there's some interesting things coming up this year where the Pixel Fold looks like it might get a little thinner and a less rectangular shape where it's like real squat and wide, maybe something like the 1 Plus Open, which I think has the best format of when it's closed and when it's open. So all that's to say, I don't know, I don't know how you think about the price. You do wanna factor in the years of security updates and the OS updates that you're promised. Like if you're buying a model that's a year out of date, you have to minus one year on all those things. You wanna keep that in mind. But I would kind of keep an an ear to the ground on like what's coming up and then see what the deals are now and just don't forget that when the new phone comes out you can usually do pretty well. - [David] Yeah, it's a tricky one because I think my go-to advice on all technology for a long time has been buy the most expensive, best newest thing you can afford and then keep it as long as humanly possible. And that advice I mostly stand by except that I obviously recognize that many people can't for whatever reason, afford the best and biggest and newest thing. And I think particularly with foldable phones, that's really complicated because there isn't, like you're saying that graceful scaling that happens where like if you wanna buy an iPhone 13 in this, the year 2024, I think that's a perfectly valid thing to do. It's not what I would do because of my aforementioned belief in buying the new thing and then keeping it forever. But the iPhone 13 is a really good phone. There is no version of that three years ago in foldable phones and they're getting better so much faster and they're so not yet mature. And as soon as you brought up the Pixel Fold, I'm like, I just think about how much better, like the Pixel watch got from one to two, like the Fold, Google has a long history of making meh first things and then pretty good second things. And so even at $1,000, are you gonna buy that phone and then in six months be like, \"I should have just bought the $1,800 one because it's dramatically better\"? Or should you have waited six more months after that? But then at that point you're waiting for the full three. It's just a forever, - [Allison] It's like a hamster wheel. - [David] It really is. But I'm curious for you as a reviewer, this is something I've struggled with over the years in reviewing products, is how much to think about what they cost. And I think sometimes it's really obvious. Like I made a big show of yelling $3,500 a lot when we talked about the Vision Pro, but in terms of like as you're reviewing a phone, a foldable phone or even just the most other $1,000-ish phones, do you spend a lot of time thinking about the price as you're reviewing it? - [Allison] I do. Kind of trying to bear in mind the way that most people buy phones, especially in this country looks very different... Nobody's walking into Verizon and just putting $1,000 on the table. So that figures in, but even when that's the case, you have a whole lot of capital with... If you're ready to switch to a new wireless carrier, you can easily get $1,000 phone out of that. So just keeping in mind the weight of that, that anybody's potentially putting down on one of these devices. And I do think of them as they're occurring of a moment in time, the review. So I bear in mind the prices of the other things out there and they may be discounted, they may have some special deal going, but I think I come back to the MSRP a lot as an apples to apples gut check of this costs this amount of money for real and this one costs this, is that a good deal? And there there's just a lot of like 4D chess going on in my mind somewhere. But it all has to kind of come out in a way that hopefully makes sense to people. - [David] Yeah, I was used to try to think about like, okay, \"If you gave this to me as a gift and it was free, would I like it?\" And that's one version of the question. And then the other one is, is it worth the cost? And the problem with phones is, is they exist literally on every single part of the spectrum between books two. It's so complicated. In a way that like I pretty much know what an iPad costs. You just have no idea what your next phone is gonna cost, in the strangest way. But okay, let's answer a couple of quick questions here for Terry and then we're gonna get outta here. Question number one is, should Terry just buy an iPad? Is that the better idea? - [Allison] There's something to that. I'm coming around to this idea of wouldn't it be nice to have more gadgets that are just good at doing the thing that you want them to do? Like we've just... - [David] Cool concept, - [Allison] I know. We've spent a lot of time cramming as many things as we can into a phone and that's fun, but sometimes... We were both looking at this standalone voice recorder today, which is like, \"What a novel idea. Your phone can do that.\" But anyway, that's a long way to say that's an option. And if the kinds of things he wants to do with it are just better on a tablet, then think about a tablet. - [David] Yeah, I've been debating this ever since I first heard Terry's question and I think the thing I've come around to is the question is, do you need to have it in your pocket? Because Terry is like, \"I'm a big guy, I have big hands.\" If the answer is like, \"I want to carry this thing around with me all the time\", foldable phone because like you can tell yourself you're gonna carry an iPad with you all the time. I have told myself that many times. It's just never true. The idea that I'm just gonna have it with me all the time. Not true. But if you're like, \"I'm mostly at home and I want a thing that I can sit for my reading and research or whatever\", I think the iPad's the better advice. The other thing is if Terry wants a foldable phone, which one would you recommend right now? And the thing for Terry is, Terry does care about the price, but we are here to tell Terry, \"All things considered here is the one we think you should buy.\" What do you think the answer is right now? - [Allison] Yeah, like my general pick right now is the Samsung, the Galaxy Z Fold5. I think they had a head start and they've figured out a couple more things with the durability and with the software that I think Google and OnePlus, those are really the only two other options in the US, they're still kind of figuring out. I say that with the asterisk of like the Z fold five form factor might not be Terry's favorite because when it's closed it has that long narrow remote control shape and it's not as bad as it once was. But if you're not enjoying the experience of typing on a normal slab smartphone, this is gonna feel a little more cramped. The keyboard on the front, the cover screen is just a little more narrow. So for that reason I would steer him towards the Pixel Fold and I would hold off on that one maybe, 'cause we might get a new one pretty soon. So that was like three answers in one. - [David] Okay, that's fair. I will say the only part of that I disagree with is I do have a hard time telling someone right now to buy a Pixel Fold because I think the odds of there being one that is dramatically better very soon, I think is pretty high. I do think the good news is, Terry, if you can wait two months, three months, Google IO is in June and historically speaking we are virtually guaranteed to hear about whatever thing they're making around then sometime, even if it doesn't come out till the fall. So you'll at least have kind of a hint about what's coming. But I think I'm with you that if you wanna buy a phone that is both a year old and likely to still be good for a while, it seems like Samsung is probably the safest choice. Even if it does feel like a TV remote, - [Allison] It does, but it's gonna solve all of Terry's problems, I'm pretty sure. - [David] There we go. Terry, good luck on all of your endeavors with your foldable phone. I hope that helped. Alison, thank you as always. - [Allison] Thank you. (upbeat music) - [David] Alright, that's it for the Vergecast today. Thank you to everyone who came on the show and thank you as always for listening. There's lots more on everything we talked about on theverge.com, especially the Rivian stuff. We had a lot of really good coverage, including that conversation with RJ Scaringe, the CEO. We'll put some links in the show notes, but theverge.com, it's a website. We love it. As always, if you have thoughts, questions, feelings, or other cars you want Rivian to make, you can always email us at vergecast@theverge.com. Call the hotline, 866VERGE11. We love hearing from you. Also keep sending TikTok thoughts. This is all happening really fast. We really want to know what you think and I suspect we're gonna talk about it a whole bunch again on Friday. This show is produced by Andrew Marino, Liam James, and Will Poor. The Vergecast is a Verge production and part of the Vox Media Podcast Network. Nilay, Alex and I will be back on Friday to talk about, presumably, TikTok, some AI gadgets and a whole bunch of other stuff. We'll see you then, rock and roll. (upbeat music)",
    "transcript_keywords": [
        "Rivian",
        "people",
        "lot",
        "Tesla",
        "Tony",
        "thing",
        "cars",
        "company",
        "car",
        "things",
        "Uber Eats",
        "Yeah",
        "Terry",
        "year",
        "phone",
        "make",
        "lot of people",
        "years",
        "Pixel Fold",
        "vehicles"
    ],
    "transcript_entity_values": [
        "zero",
        "45,000",
        "the nineties",
        "Scout Motors",
        "BYD",
        "Moonwalking with Einstein",
        "Allison",
        "a couple of years old",
        "Uber Eats",
        "Twitter/X",
        "Duolingo",
        "RAV",
        "two months",
        "Vox Media Podcast Network",
        "a sixth",
        "Andrew Marino",
        "a big couple of years",
        "three",
        "Reddit",
        "Equinox EV",
        "one year",
        "Target",
        "the last few years",
        "2",
        "Allison Johnson's",
        "up to $80,000",
        "Hyundai",
        "5",
        "the end of the day",
        "only two",
        "a few minutes",
        "Mercedes",
        "Google IO",
        "about eight to",
        "Chipotle",
        "EV",
        "3,500",
        "Meta",
        "every year",
        "Steve Jobs",
        "Blazer",
        "Wrangler",
        "Loki",
        "June",
        "one day",
        "1,000",
        "One",
        "Evergreens",
        "2,000 years from now",
        "secondly",
        "AirPods",
        "six more months",
        "Alex",
        "Google Maps",
        "TikTok",
        "80s era",
        "22,000",
        "Rivians",
        "a Pixel Fold",
        "a couple of minutes",
        "57,000",
        "almost $20",
        "Honda",
        "each year",
        "the Pixel Fold",
        "David Pierce",
        "Vergecast",
        "six months",
        "Kia",
        "the 1 Plus Open",
        "Shokz",
        "about last week",
        "OnePlus",
        "5,000",
        "Tony Isles",
        "Philadelphia",
        "the past month",
        "the Verge review",
        "three moment",
        "Audi",
        "the AirPods Pro",
        "DIY",
        "the fourth quarter of this year",
        "7,500",
        "1,800",
        "KIRO 7",
        "Highlanders",
        "Verge",
        "Stanford Prison",
        "Mexico",
        "90%",
        "Google",
        "R3",
        "2017",
        "Norway",
        "R2",
        "the beginning of February",
        "2020",
        "Polestar",
        "Grand Cherokee",
        "Fold",
        "iPad",
        "Golfs",
        "three months",
        "every week",
        "Samsung",
        "under 3 seconds",
        "2008",
        "VW",
        "Elon Musk",
        "Toyota",
        "New York City",
        "800",
        "this year",
        "China",
        "Shokz",
        "Illinois",
        "Abigail Bassett",
        "10 years",
        "Liam James",
        "BMW",
        "first",
        "around 2017, 2018",
        "Friday",
        "Mustang",
        "Rivian",
        "the Pixel Fold",
        "month",
        "Chinese",
        "10",
        "this past January",
        "last year",
        "Elon",
        "Tony Delivers",
        "the next three years",
        "5",
        "1,000 years",
        "47,000",
        "AI",
        "Polestar",
        "Tesla",
        "Ionic",
        "Yo",
        "a few more days",
        "Andy",
        "Galaxy Z Fold5",
        "4s",
        "a decade",
        "the year 2024",
        "Chevy",
        "US",
        "the last couple years",
        "over $75,000",
        "five bucks",
        "4D",
        "100%",
        "RJ",
        "over a million",
        "a couple of weeks ago",
        "Maslow",
        "Tony",
        "one to",
        "4",
        "Rivian",
        "Russian",
        "Android Auto",
        "several 10s",
        "over 300 miles",
        "second",
        "just a few weeks later",
        "five",
        "La Neva",
        "Alison",
        "the first 30 minutes",
        "San Francisco",
        "a couple square miles",
        "the year",
        "1,000s of dollars",
        "1,000s",
        "sec",
        "First",
        "Tony Isles",
        "three years ago",
        "Ford",
        "Audi",
        "one",
        "Will Poor",
        "five years",
        "Apple",
        "Subaru",
        "four",
        "the next few years",
        "Bronco",
        "Ionic 5",
        "a month ago",
        "70s",
        "Volkswagen",
        "today",
        "RJ",
        "Jeep",
        "David] Fair",
        "the Galaxy Fold's",
        "100,000",
        "Spotify",
        "Europe",
        "Andy Hawkins",
        "60",
        "tonight",
        "early 2026",
        "two years",
        "years",
        "the years",
        "Scaled EV Production",
        "Tim Cook",
        "Lada Niva",
        "a year",
        "several years ago",
        "3",
        "R2",
        "at least one",
        "DoorDash",
        "21,000",
        "million",
        "Georgia",
        "Apple CarPlay",
        "five minutes",
        "two",
        "Dave",
        "the United States",
        "$5 billion",
        "Amazon",
        "David",
        "Seattle",
        "Verizon",
        "MSRP",
        "Rivian",
        "RJ Scaringe",
        "iPhone",
        "the Galaxy Z Fold",
        "millions upon millions",
        "Model Y",
        "Dunbar",
        "Terry",
        "the next week",
        "2022",
        "R3"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "DATE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "FAC",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "EVENT",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "GPE",
        "DATE",
        "ORG",
        "TIME",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "DATE",
        "MONEY",
        "MONEY",
        "LAW",
        "NORP",
        "ORG",
        "ORG",
        "GPE",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "PRODUCT",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "MONEY",
        "DATE",
        "GPE",
        "PERSON",
        "GPE",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "NORP",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "MONEY",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "NORP",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "TIME",
        "GPE",
        "QUANTITY",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "LOC",
        "PERSON",
        "CARDINAL",
        "TIME",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERSON",
        "GPE",
        "MONEY",
        "ORG",
        "PERSON",
        "GPE",
        "GPE",
        "ORG",
        "NORP",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "GPE"
    ]
}