{
    "id": "tcllgqjDqsc",
    "title": "E3 2019! Real life Luigi's Mansion!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-06-13T23:15:59Z",
    "video_url": "https://www.youtube.com/watch?v=tcllgqjDqsc",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "nintendo",
        "luigi's mansion",
        "E3 2019"
    ],
    "views": 110774,
    "likes": 4569,
    "comments_count": 406,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- It's E3 2019. This is one of my favorite times of year because this conference basically sets up all of the games that we can look forward to in the upcoming year. Not only is it so much fun getting to play unreleased games, but getting to say hi to you guys and meet you on the show floor is always so much fun. So thanks for saying hi and it was lovely to meet so many of you. This year, of course, my first stop was the Nintendo booth. I'm always such a huge fan of Nintendo, and their booth always looks amazing. And much like previous years, we've also got some gameplay, so let's go. The first demo that we're gonna be playing is Luigi's Mansion, and if you guys don't know, Luigi's Mansion is one of my favorite games. It's also one of Jenna's favorite games. - I'm so excited for this game. - Oh my gosh, I'm sucking up popcorn. Learning my controls. Let's get this ghost! Oh my god, I need to flash him. (screeching) No, no, no! Now I'm Gooigi. - [Man] So if you... - (gasps) No way! How cool! (screeching) All right. Okay, so we cleared that level. Oh, he can go through. - [Man] Exactly, yeah. - Yes. (screeching) Come here, no! I'm so close. (gasps) Yes. Oh, I slipped on a banana peel! Oh, there's a heart, I need that. We found the key. I'll take that. I can't wait for this game to come out. This is gonna be really fun. What about that fan? Does that do something? Yes. Okay, where's my goo friend? Get that sword for me. All right, so we just got to the boss battle. But I can't show you guys this part, but when I get the game for real, then I'll show you. Oh, I died. Do you wanna say hi to my video? - I'd love to say hi to your video. - Guys, look who it is! - Hi you guys, how you doing? - Welcome to another E3 vlog. - Here we are again. Isn't that exciting? - Oh my gosh, so many new things coming out. So what's your favorite thing you guys are showing today? - Oh, I am fan of Legend of Zelda: Link's Awakening. - That's amazing. - Yeah. I played that originally 20 years ago, and playing it again in full color on Nintendo Switch, it's like an old experience and a new experience at the same. I made up a word, I call it nostaljoy. It's a little nostalgia and a lot of joy. - Yeah. How great. Shall we play that one too? - Yeah, try it out, we have it right here. - Oh wow, this is an expansive map, okay. A Chain Chomp! That's kinda crazy, 'cause I never did play the original ones, so this is gonna be really fun. Ooh. Whoa, no, no, no. Gimme that sword. Yes. Ooh, I wasn't paying attention yet. I looked down. (laughs) Oh no! Okay. Now we're gonna be playing Mario & Sonic at the Olympic Games. I saw a rock climbing wall down there, so I really wanna get a chance to try that, but the line looks pretty long so fingers crossed, I can try it. If not, I can always rock climb at home. But now, let's play Mario & Sonic, Olympic Games. Oh my gosh, how fun. Let's try skateboarding, I like skateboarding. Girl, where is your helmet? - [Game Announcer] Start! - Okay. - [Game Announcer] New trick bonus! New trick bonus! - Oh, I am so skilled. (audience cheering) I'm the champion. Let's play one more event and maybe surfing? Okay, here we go. (exciting, energetic music) No way, this is awesome. So I've never surfed in real life, so I don't know what I'm doing. Whoa, I'm doing something. Yes, okay, now we're getting into it. - [Game Announcer] New trick bonus! Time's up! - Time's up. She's crying. She didn't do very well. (upbeat, energetic music) All right, we're going in. This is Luigi's Mansion. (gasps) This is really weird, because it really does feel like you're in the game. Jenna! - [Jenna] What? - It's real life Luigi's Mansion. - I know, this is, I'm taking everything in, this is incredible. (gasps) - No way, look, a ghost! (laughs) There's a spider! This is really, really freaking cool. No way, no way. (gasps) He's got a flashlight too! Hello Luigi. - [Jenna] Flashlight, here you go. Awesome. - Super spooky, thank you! I'm gonna cry. Last year I cried when I met the voice of Mario. Here's a clip of that. - Hello, it's-a me, Super Mario, with Super Princess iJustine. Mamma mia, she number one! Ha ha! - It just doesn't ever get old, and it makes me cry every time. It's okay, it's a good-- - Happy cries, happy tears, yay. - They're happy cries. (laughs) - Brings back so many great memories, doesn't it? - It does, like my childhood. Oh my gosh, I can't handle it, okay. I'm composing myself, I'm sorry. Thank you so much, I appreciate it. - My pleasure, thank you. - Oh my gosh, yes, thank you. - Have a great time. - Okay, I'm sorry, you can stop filming now. - [Woman] Do you want a picture? - It's okay, okay, sure, I'll get a picture. - Yippee, ha ha! - [Woman] You have tears everywhere. - [Charles] Whoopee, ha ha! - I can't even handle this. (laughs) It's like one of those things when you guys come up and meet me and I see you guys in tears, you can't actually understand it until you have that same feeling. This is crazy, oh my god, I'm so. I'm an emotional mess right now. Anyway, we're back here at E3! (gasps) Spooky, spooky! Okay, that was really fun. Let's go see what else we can see at the Nintendo booth. So I just played Mario & Sonic Olympic Games, and now I'm gonna try to do this rock climbing wall and I rock climbed for the first time a few months ago, so I don't know how well I'm gonna do. I might not be able to make it, but I'm going to try my best. (tense music) Yay! Okay. You guys, I was so scared. So now we're on the show floor, and I see Cyberpunk up here. That was such a great highlight of the Xbox press conference. When Keanu Reeves came out on stage, we were all shook. Let's go check out the booth. The line is so long to get in. So I overheard somebody say that they don't have a playable demo, but they have a 25-minute kinda little presentation things. I don't think we have enough time to wait several hours to get in, but let's carry on. I see Fortnite. (dance music) What Fortnite has done for gaming is so interesting 'cause I've talked to so many little kids. I'm like, what games have you played? And they're like, this is my first game. Fortnite is the first thing that they've ever played, and it's really cool just to see what it has done to this entire industry. We gotta find Jenna. - Hey, no touch! (laughs) - Oh. This is so awesome. - Yeah, no, it's fun to be able to showcase all the creative stuff, too. - So cool. Did you say hi to my video? - Oh yeah, what's up guys, how you doing? You know, Mooney here, come by the Fortnite booth, 601, E3, and I'll be here all week. I'm poppin', still poppin'. - Yes, yes, yes! - I'm here, Justine's here, it's great. - We are in the Fortnite booth, and I'm in a shopping cart. When people say, Justine, what's your job? I don't even know. I think, am I working right now? Okay, bye bye! (chill dance music) Well, that was my day at E3. It was so much fun. Honestly, one of my biggest highlights was going through Luigi's Mansion. It was so cool, and I can't wait for that game to come out. Hope you guys enjoyed the video. I will see you in the next one. Make sure you like, comment and subscribe. I have to tell you that, I'm a YouTuber. See you later. (upbeat music)",
    "transcript_keywords": [
        "Luigi Mansion",
        "guys",
        "games",
        "Olympic Games",
        "game",
        "Luigi",
        "fun",
        "Mario",
        "Mansion",
        "Sonic Olympic Games",
        "Fortnite",
        "favorite games",
        "yeah",
        "Nintendo",
        "Time",
        "booth",
        "year",
        "gosh",
        "Nintendo booth",
        "Jenna favorite games"
    ],
    "transcript_entity_values": [
        "20 years ago",
        "601",
        "all week",
        "one",
        "This year",
        "E3",
        "Mamma mia",
        "Luigi's Mansion",
        "Justine",
        "Nintendo",
        "Mario & Sonic Olympic Games",
        "Fortnite",
        "Luigi",
        "Luigi's Mansion",
        "Time",
        "Mooney",
        "a few months ago",
        "Keanu Reeves",
        "Mario & Sonic",
        "Xbox",
        "25-minute",
        "Legend of Zelda: Link's Awakening",
        "several hours",
        "Nintendo Switch",
        "the Olympic Games",
        "Last year",
        "Mario",
        "Charles] Whoopee",
        "Spooky",
        "today",
        "Super Mario",
        "Olympic Games",
        "the upcoming year",
        "Gooigi",
        "first",
        "E3 2019",
        "Fortnite",
        "Jenna"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "FAC",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "TIME",
        "ORG",
        "EVENT",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "EVENT",
        "DATE",
        "PERSON",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERSON"
    ]
}