{
    "id": "TCTWyNstpD0",
    "title": "CD-ROM, CD-R, CD-RW, Books of Red, Blue, Purple, Beige, Orange, Scarlet...",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2018-10-19T16:23:29Z",
    "video_url": "https://www.youtube.com/watch?v=TCTWyNstpD0",
    "category": "Science & Technology",
    "tags": [
        "Compact disc",
        "CD",
        "CD-ROM",
        "CD-R",
        "CD-RW",
        "Rainbow books",
        "DVD",
        "optical disc",
        "CD burning",
        "WORM"
    ],
    "views": 800764,
    "likes": 24779,
    "comments_count": 2248,
    "description": "You can support this channel on Patreon! Link below     The time has come. What was once just a replacement for big black frisbees of sprially wavey soundy sounds has matured into a versatile, ubiquitous data storage solution. Would you look at that, progress on a disc! But that wasnt all; many colors of books were published (neato, wouldnt ya say?) and the disc went from a-thing-you-buy-with-stuff-on-it to a disc that you can put your VERY OWN stuff on it! Radical! And heres some of that story.  You can support this channel on Patreon! With the support of people like you, this channel has grown from a small hobby into a real thing. There are big projects just around the corner, and if youd like to help make them possible, please consider pledging some support. Thank you!   If you dare, you can follow me on Twitter for mostly silly tweets:   Are you a Redditor? That's pretty cool. If you'd like to watch me not know how to be a Redditor, you could take a peek at this subreddit, a subreddit that I am barely responsible for;   And of course, thank you to the following Patrons! Andres Plaza, Revenge, Matthew Baron, Andr, Gerald Monaco, Tab Patterson, Jason Weathered, h.drew foy, Roger Beal, Gantradies, Chris Hartl, Steve Stone, Brian G. Shacklett, Colton Aubrey Hooke, Paul Mills, Christopher Luna, Kotanu, Brendan Terrett, Techmoan, Mike Mason, Elijah Reeds, Christopher Jett, Justin Talbot, Steven Metcalf, Verysofisticated, Lolucoca, John McLusky, Ashleigh R, Stephen Bell, Logan Beenken, Eric Wood, Stephen Pick, BlancoGrande, Matthew Giraitis, James Ryan, Robert Joscelyne, Francis Fisher, Kedar Deshpande, Lukas Komischke, Dave Anderson, Felix Freiberger, Dane Peterson, Brent LaRowe, Aerospyke, Kieran Cox, Hunter Schwisow, Logan Kriete, Rafa Wiosna, Adam D. Ruppe, Audin Malmin, Eric Hansen, Noah McCann, Jason R Scheuren, Rufo Sanchez, The War Academy, Yaniv, neko, Daniel Ch, Lee Wallbank, Grayson Lang, Neil Bronner, Carl Yazbek, Jeffrey Grajkowski, Christopher Splinter, Eric Merrill, Stefan Berndtsson, Michael Sims, Seth Kneller, Clint Eisinger, Jesse G. Donat, Christopher Leidich, Mike Friedman, Svante, Andr Waage Srensen, Ed McCloskey, Jasper Thun, Camilo Rodrigues, Dusan Dzelebdzic, Sam Douglas, Sam Redfern, Sen, mark barratt, Tully, Violet Moon, Duncan Ward, Tobias Faller, Justin Smith, Corey A Hudson, EpicLPer, Luc Ritchie, Michael Dragone, Manfred Farris, Eric Romero, John Laur, Patric Bates, Sven Almgren, Lutz Broska, Jrgen Kieser, Nicholas, Ewen McNeill, thefanification, Nicolas, Albin Flyckt, Michael A Kalfas II, Michael Bernstein, Kevin Kostka, Shame Zamora, Brad Wilmot, John Bailey, Alex Ilyin, Miles H, Deovandski Skibinski Junior, Andrew \"FastLizard4\" Adams, Avi Drissman, Jens Bretschneider, Phil Taprogge, Sam, Rich Jeanes, Jonathan Skowronek, Tim Grov, Pieter van der Eems, Philip Kvist, Brian Condron, Peter Jerde, Torin Zaugg, James Watson, Vince Terranova, Jason Nevins, Andrew Montagne, David Scott, Mike Nichols, MrSonicOSG, Brandon Enright, James Fialho, Christian Torelli, Sunchild, Kim Rypstra, The Paul Allen, toasterking, Seth Robinson, Ralph Dont see your name?  Dont worry!  To keep this little perk alive, the $5 patron shoutout is now on a rotating basis!  If youre not here, you should be here in one of the next two videos.  If youve slipped through the cracks, dont hesitate to send me a message via Patreon and Ill fix it!",
    "description_links": [
        "https://www.patreon.com/technologyconnections",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections/"
    ],
    "transcript": "If you look at a blank CD-R, odds are youll find these two numbers. 80 minutes of audio, and 700 megabytes of data. You may be surprised to learn that these two numbers dont match. See, lets take the 80 minute figure. We know that the Compact Disc Digital Audio standard consists of 2 16 bit streams (2 because its stereo audio) each consisting of 44,100 samples per second. Lets make it a bit easier and say that its one stream of 8 bit words or bytes, so by doubling 44,100 twice (once for stereo, once again to turn 16 bits into 8), we find that its 176,400 bytes per second. Multiply that figure by 60 for sixty seconds per minute, and again by 80 for our eighty minute runtime, and you get 846,720,000 bytes. It would seem that an audio CD holds over 146 more megabytes than a data CD. What gives? We interrupt this program for a marginally important message. In the computing world there is an unfortunate mixing of the terms megabyte and mebibyte. Youll almost never hear someone say mebibyte, because its a silly word, but the 700 on this disc is actually referencing mebibytes. Whats the difference? A Megabyte is 1,000,000 bytes, based on powers of 10. A mebibyte is based on powers of 2, so it is actually 2 to the 20th bytes. So, a kibibyte is 1,024 bytes (rather than 1,000) and a mebibyte is 1,024 kibibytes. This annoying debacle has been causing problems forever, for example hard drive manufacturers quote sizes in gigabytes or terabytes, when your PC works in terms of gibibytes and tebibytes. So this 2 terabyte portable drive only appears as 1.81 terabytes on my PC. But my PC is actually misrepresenting this figure as terabytes when it is in fact tebibytes. But CDs and DVDs are quoted in mebibytes and gibibytes, so even though this label shows MB instead of the correct M lowercase i B, my computer does the same mislabeling, and since theyre both wrong, they agree. Anyway, all of this is to say, Ill be using the word Megabyte, even though sometimes its actually a mebibyte. Please send complaints to: It would seem that an audio CD holds over 146 more megabytes than a data CD. What gives? Well its actually more of a what takes away as the CD-ROM standard sacrifices those bytes for more precise error correction. As discussed in this channels first video on the compact disc, the CIRC error correction used in the Compact Disc Digital Audio standard can perfectly correct errors up to 3,500 bits long. But, it can also mask errors up to 12,000 bits long through interpolation. That means that its essentially guessing what the audio samples should be for errors between 3,500 bits and 12,000 bits. Now, for audio samples, thats fine. 12,000 bits is less than one one hundredth of a second of audio, so even though the error correction might be fudging things, youll almost certainly not notice it. But for data, thats not gonna do it. Data cannot be fudged without serious consequences. In order for the compact disc to store data files reliably, it would either need to sacrifice durability or come up with a new error correction scheme. And it did neither. But also yes. CD-ROMs (or would that be CDs-ROM?) use the same CIRC error correction and basic data structure of the CD-Audio disc, including the frame structure, subcode, and all that. But more error correction was added within the frame (which weve now formally decided to call a sector). Of the 2,352 bytes available in a sector on an audio CD, 304 get sacrificed, mostly for error correction, but also for some basic signalling, such as synchronization and distinguishing between mode 1 and mode 2. Combined with an additional layer of CIRC error correction, the CD-ROM standard maintained the same durability with zero tolerance error correction. Well get to Mode 2 later, but nearly all CD-Data applications use Mode 1 for its complete error correction. Now that the compact disc was being used for more than a simple linear stream of audio, a true file system needed to be standardized. Initially things were rather ad-hoc, but a group of 12 computer hardware manufacturers met at what was then the High Sierra Hotel and Casino in Lake Tahoe, CA, where they settled on a standard called the High Sierra Format. Eventually this would become ISO 9660, the standard used to this day, however it has been extended and improved over the years. Now that the CD-ROM was officially a thing, whole new multimedia experiences could be created. With the ability to store images, program files, sounds and even video, the possibilities with CD-ROM were seemingly limitless. No longer bound by the 1.44 megabytes of a 3.5 inch floppy, elaborate games with full-on soundtracks, thousands of color images, and more complicated structure could be produced. My greatest nostalgia factor comes from mid-nineties educational games, like the Magic School Bus games or my personal favorite, JumpStart 3rd grade. Seriously, this was a wicked awesome game and its holding up pretty well Id say. [In another day, the world will see the dawning of Polly Planet.] *buzz sound* [Whoops!] [It seems theres someone at the door.] [Lets take a little peek!] Anyway, of course home computers werent the only beneficiaries of this sort of vast data store. Video game consoles soon appeared which could take advantage of it, in fact one of the earliest was the Philips CD-i system. It technically wasnt using CD-ROMs, though, as CD-i discs were in fact their very own category, published in the Green Book. But unless youre either very young or were living under a rock through the 1990s and early 2000s, Im sure you already knew what CD-ROMs could do. But the OM, in that CD-ROM, man thats a bummer. Sure, having 700 megabytes at your disposal is fantastic, but no one has a CD manufacturing and duplication facility just at home. But wait, they do! The development of the CD-R, for Compact Disc Recordable, meant that no longer would you be forced to write up a contract with a commercial CD pressing facility for at least 10,000 discs just to make a mixtape, instead all you needed was a $35,000 machine and a computer! It would take until the mid-to-late 90s for CD burners to come down in price, and even then there were annoyances, but now we're really talking. A CD-R, which incidentally is a pirates favorite kind of CD, is constructed much the same as a normal CD, but with two important changes. First, the pits and lands molded into the polycarbonate layer are replaced with a continuous spiral pregroove. This spiral will guide the laser of a drive writing to a disc, and it also contains the ATIP which tells the drive the properties of the disc, such as its maximum write speed. Right on top of the pregroove is a thin layer of an organic dye. Thats why CD-Rs are sometimes a strange color, or even just a little bit off from the normal silver. Then on top of the dye, a partially transparent thin layer of metal, usually aluminum, is placed. This allows the laser light to be reflected back while still being influenced by the dye. To burn data on the disc, the laser switches from its everyday gentle glow to an all-out LIGHT CANNON of FIRE LASER, and the high intensity heats up the dye so much that its optical properties change. Thats right, CD burners are literally burning the equivalent of pits onto the disc. Once its been written, almost any CD drive, going back to the earliest CD players, can read these discs. The parts of the dye that were made into a pit by the writing laser will dim the reading lasers reflection, which is much the same as how real pits cause destructive interference. So long as the CD reader can tell the difference between a burned spot and an untouched spot, it will read the data just fine. Being able to store data files onto a compact disc at home meant that just one of these guys could replace hundreds of floppy disks. But now we had a new problem. Remember how in a normal CD, there are three parts? The Lead-in, program area, and lead-out? Well, if we stuck to this limitation for the CD-R, then if you were to write as little as a Word document on a blank CD, youll have written the lead-out, and now the disc is done. The Orange Book introduced the standard of multi-session writing. Now, after the lead-out of the disc, another lead-in can be made. Each time a new session is made, the lead-in is updated to include the location of all the files. On a multi-session disc, the drive will look for all of the lead-ins, and once it finds the last one, it basically just ignores the rest. This is also how a file can be deleted from a CD-R, as the latest lead-in may simply not include it in the table of contents. But the data is still physically there, and there are ways of getting to it. Of course, the central limitation to the CD-R is that is a write-once, read many format. In fact, its original name was going to be CD-Write Once, which I really wish had been stuck with because we could have called them CD-WOs! Woah! But, we wouldnt be stuck with write-only for long. Interestingly, the Orange Book detailed a rewritable CD based on magneto-optical technology in 1990 (the technology behind the MiniDisc). This never made it to commercial production, but the CD-MO would have been the perfect companion to the CD-WO. Instead, we got the CD-RW in 1997. This is functionally identical to a CD-R, but the organic dye layer is replaced with a Silver-Indium-Antimony-Tellurium alloy, also called by at least one person AgInSbTe. This alloy has a unique property which alters its reflectivity based on phase changes. In an unburned disc, the alloy is in a polycrystalline structure. But when the laser heats it to somewhere in the neighborhood of 500-700 degrees C, it melts it. And when it solidifies, it no longer has the same crystalline structure, and thus it reflects light about 15-25% less intensely than the crystalline parts. So, spots that are melted by the laser turn into sorta pits, and spots that arent remain sorta lands. What allows the disc to be re-written is that when the alloy is heated to around 200 degrees C, it doesnt melt, but any parts that have lost their polycrystalline structure will actually reform. This effectively erases all of the burned pits, and allows the disc to be written again. CD-RWs have several severe limitations, though. Unlike a CD-R, these discs generally cannot be read in standard drives. Because the change in reflectivity between a pit and land is so slight, a CD reader needs to be much more sensitive to pick up the data. After the introduction of the CD-RW, many standard CD readers were made more sensitive to accommodate them, sometimes branded as Multi-Read, but it certainly wasnt universal. Another big problem of the CD-RW was that the discs werent always backwards compatible. Because of that phase-changing alloy, there is actually a minimum speed to write the disc. This basic 1-4X disc will work in pretty much any drive, so long as you can force it to burn slowly, but later, higher-speed discs might need a minimum speed of 8x or more, so if you only had a 4x drive, youre SOL. And before we put the CD to rest, lets look at some of the other stuff that those crafty engineers at Sony and Philips jammed into here. Remember the subcode channels R through W? Eventually these would get used. CD+G, for CD Graphics, was used in karaoke machines. The first CD+G discs were released in 1985. This was further refined into the CD+EG, standing for Extended Graphics. In what seems backwards, it would take 11 years for Sony to introduce the CD Text format, in 1996. Also using the R through W subcode channels, this was essentially a way to add metadata such as track titles, artists, album, and all that jazz. Oddly, I cant find references to it being used for lyrics, which seems a wasted opportunity as there definitely is room. Remember the Mode 2 in CD-ROM I talked about earlier? Thats right, Im putting it in the same video this time. CD-ROM Mode 2 sacrificed some of the error correction of mode 1 for a larger data capacity, about 800 megabytes. You wouldnt want a computer program or documents stored in Mode 2, but for things like video files or large collections of images where a small error will simply result in a glitch or artifact, it was OK to use. Video CDs, defined in the White book, used Mode 2, and now that I know that, VCDs make a lot more sense to me. The video compression of VCD is ridiculous, but knowing that its actually playing with 800 megabytes makes it seem a little less crazy. And there were other odds and ends. The delightful beige book defined a standard for photo CDs in 1992. The standard was a little ahead of its time though, as in 1992 CD-ROM drives really werent that common yet, and it also stored photos in a proprietary format. Kodak developed the Photo CD in a time when digital cameras werent really a thing at all for consumers, so in a sense it was a very clever product. Get your film developed and receive a disc with very high-resolution scans for future use. But by the time CD-ROM drives became widespread, digital cameras were starting to appear. And, once CD burners came down in price, well you could just burn JPEGs onto a CD (which, you might recall, many DVD players can show as a slideshow on your TV). You look back at Kodaks history and you just cant help but feel sorry for them. And to round out the rainbow, the Blue Book of 1995 defined the Enhanced CD, which functioned both as an Audio CD and a CD-ROM, with two sessions on a stamped disc. This was kinda neat, as a CD player would treat it as a normal audio CD, but you could store photos or interactive material in the data portion which a computer could access. The Scarlet book of 1999 defined the standards of the Super Audio CD, a high-res audio format, which is pretty much just a DVD but with audio only. It also had significantly different audio encoding, which I wont go into right now, and multi-channel support. And the last of the rainbow books was the Purple Book of 2000, which if you thought the Super Audio CD was obscure, well you havent read the Purple Book. All this was was a reduction in pit size and narrower spacing to double the data capacity of a CD. And, it was only for use as data storage, not audio. But, when DVDs already existed, what was the point? Thats pretty much what everyone asked, and it was practically dead on arrival. But an interesting thing about the purple book. In a way, it had been implemented (although much more subtly) long before it was published. See, the original Compact Disc standard was 74 minutes or 650 megabytes of data. But, the vast majority of CD-Rs and CD-RWs you can buy are 80 minutes, 700 megabytes. It was discovered not long into the life of the CD that the tolerances were generous enough to space the tracks just a little bit tighter together without violating the Red Book specs. The purple book just did that to a much more radical extent, but many years too late. And finally, one thing you should know about pretty much all writable optical media. The dyes and alloys arent terribly stable. Many of the earliest CD-Rs are failing, as the dye is degrading or the disc is delaminating. If you have any precious data stored on optical media, you might want to back that up pretty soon. Thanks for watching, I hope you enjoyed the video! This just about wraps up the saga on the Compact Disc. I think I hit all the bases, but I certainly didnt go into detail on everything. If theres something more specific youd like me to look into, let me know in the comments and Ill see what I can do! As always, thank you to everyone who supports this channel on Patreon. I say this every time, but seriously. Thank you. Your support makes this channel possible, and you are awesome for it. If you would like to join the Patreon crew to support the channel as well as get perks like early video access, some occasional behind the scenes stuff, and the inside scoop on the latest projects, please check out my Patreon page. Thanks for your consideration, and Ill see you next time! exceptionally smooth jazz So long as the CD reader can tell the difference between a burned spot and an untouched spot, it will read the data just fine. I need to record that line because I screwed it up. The development of the CD-R, for Compact Disc Recordable, meant that no longer wait No that was right. [clears throat] Lets try again! ...was replaced with a silver, indium, antinomy antiMOny, right? Its Antimony? Yeah. Antimony Cricket! And it also stored photos in a proprietary format Kodak developed. AHH! It technically wasnt using CD-ROMs, though, as CD-i discs were in fact their very own category, published ...in the green book.",
    "transcript_keywords": [
        "Compact Disc",
        "Disc",
        "Disc Digital Audio",
        "error correction",
        "audio",
        "data",
        "Compact Disc Digital",
        "Compact Disc Recordable",
        "Book",
        "CIRC error correction",
        "CDROM",
        "Compact Disc standard",
        "discs",
        "error",
        "Compact",
        "CDR",
        "Digital Audio standard",
        "standard",
        "correction",
        "megabytes"
    ],
    "transcript_entity_values": [
        "74 minutes",
        "1,024",
        "700 megabytes",
        "the Purple Book",
        "1990",
        "1-4X",
        "Mode 1",
        "Audio",
        "2 to the 20th",
        "Super Audio",
        "two",
        "3.5 inch",
        "early 2000s",
        "about 800 megabytes",
        "2",
        "1996",
        "Mode 2",
        "700",
        "Kodak",
        "80",
        "the 80 minute",
        "Mode 2",
        "sixty seconds per minute",
        "less than one one hundredth",
        "one",
        "4x",
        "44,100",
        "the 1990s",
        "Philips",
        "1999",
        "the Green Book",
        "650 megabytes",
        "Compact Disc Recordable",
        "Extended Graphics",
        "Sony",
        "terabytes",
        "2,352",
        "Kodaks",
        "8",
        "the 1.44 megabytes",
        "35,000",
        "80 minutes",
        "at least 10,000",
        "at least one",
        "176,400",
        "the Orange Book",
        "over 146",
        "first",
        "Compact Disc",
        "Compact Disc Digital Audio",
        "Multi-Read",
        "Lake Tahoe",
        "16",
        "2 terabyte",
        "1992",
        "846,720,000",
        "late 90s",
        "three",
        "Megabyte",
        "zero",
        "the Blue Book of 1995",
        "ATIP",
        "the Magic School Bus",
        "1",
        "200 degrees",
        "another day",
        "the Compact Disc",
        "MB",
        "3,500 bits",
        "the High Sierra Format",
        "hundreds",
        "our eighty minute",
        "Patreon",
        "304",
        "mid-nineties",
        "thousands",
        "1997",
        "10",
        "3,500",
        "12,000",
        "1,000,000",
        "2 16",
        "60",
        "8x",
        "VCD",
        "the years",
        "The Orange Book",
        "500-700 degrees",
        "the Purple Book of 2000",
        "11 years",
        "12",
        "mebibytes",
        "the High Sierra Hotel and Casino",
        "ISO 9660",
        "this day",
        "1985",
        "Mode 2 later",
        "First",
        "second",
        "3rd",
        "800 megabytes",
        "Megabyte"
    ],
    "transcript_entity_types": [
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "LAW",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "EVENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "LAW",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "EVENT",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "LAW",
        "ORDINAL",
        "ORDINAL",
        "ORDINAL",
        "QUANTITY",
        "PERSON"
    ]
}