{
    "id": "tehQjoZFyGY",
    "title": "Samsung Galaxy S9 Review",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-03-08T13:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=tehQjoZFyGY",
    "category": "Science & Technology",
    "tags": [
        "galaxy s9 review",
        "galaxy s9+ review",
        "galaxy s9 plus review",
        "galaxy s9 camera",
        "galaxy s9 vs s8",
        "mrmobile",
        "michael fisher"
    ],
    "views": 1397797,
    "likes": 20402,
    "comments_count": 1979,
    "description": "Brought to you by Tech21. Get your Galaxy S9 cases here: Galaxy S9 cases:  Galaxy S9+ cases:    [GALAXY S9 REVIEW]  In a world where companies are adding keyboards, rumble packs, even lasers to their smartphones, the Samsung Galaxy S9 might seem a little dull. Not only does it strongly resemble its immediate predecessor the Galaxy S8; it also carries much of the same functionality. So whether you should splurge on the Galaxy S9 will depend mostly on how old your current phone is  and how much you care about that camera. Im MrMobile and I'm here to help you figure it out in the Galaxy S9 review, brought to you by Tech21.   [SUBSCRIBE]     [ABOUT MRMOBILE'S GALAXY S9 REVIEW]  MrMobile's Galaxy S9 Review was produced following seven days with a Galaxy S9+ review device in Barcelona, Spain and Boston, USA. The device was used on T-Mobile US and AT&T and was paired to a Movado Connect for the duration of the review. The device received no software updates during the review period.   [PRODUCTS IN THIS VIDEO]  Samsung Galaxy S9:   RAVPower Fast Wireless Charging Stand:    [LINKS]  Galaxy S9 Review [Android Central]:   Animated Galaxy S9 border wallpaper [lock screen only]:    [MUSIC]  Burning Man\" by Zac Nelson, available at Premium Beat:   Tidal Lines by Ryan Carlson, available at Premium Beat:   \"Escapade\" by Vincent Tone, available at Premium Beat:   [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "http://bit.ly/2FuPNIw",
        "http://bit.ly/2Fs2BzA",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/4m9",
        "http://mrmobile.tech/4m8",
        "https://www.androidcentral.com/samsung-galaxy-s9-review",
        "http://www.samsung.com/global/themestore/index.html?appId=sec.com.S8exclusivecolorfulMar.common.wallpaperanimated",
        "https://www.premiumbeat.com/royalty-free-tracks/burning-man",
        "https://www.premiumbeat.com/royalty-free-tracks/tidal-lines",
        "https://www.premiumbeat.com/royalty-free-tracks/escapade",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Mr. Mobile] Can we be real for a second? In a world where companies are adding keyboards, rumble packs, even lasers to their smartphones, the Samsung Galaxy S9 seems a little dull. And it's not just looks, for a lot less money you can get 90% of the experience by buying last year's Galaxy S8 instead. So whether you should splurge on the new one is gonna depend mostly on how old your current phone is and how much you care about a camera that doubles as a time machine. I'm Mr. Mobile, and let's figure it out in the Galaxy S9 review brought to you by Tech21. (upbeat music) If you've ever said \"don't fix what ain't broken\" and meant it, well the Galaxy S9 is the phone for you. Glass and metal, water resistant design, a bright, color-accurate display with curved sides and narrow bezels, convenient features like dual-mode wireless charging and a headphone jack. Inconvenient features like a Bixby assistant button right next to the volume rocker. And yes, top-shelf specs befitting a top-tier phone. Look, it's not just jaded tech reviewers tired of the same old, same old, this really is a minor step up from the S8. Before we hit the big stuff, though, I do wanna call out my favorite minor fix. The fingerprint sensor isn't just better positioned than last year, it learns your fingerprint faster than anything else out there. It's quick to unlock, too, and it's a great shortcut to the notification tray. The alternative login option, iris scanning with a fallback to face unlock, is speedy for now, I like it, but I worry it'll slow down over time as it did on the S8 and Note 8. Speaking of slowing down, every year Samsung gets a little bit better at keeping its software sprightly. The S9 comes the closest yet to something like Google's Pixel, but that also serves to highlight these annoyances that have persisted for years. The occasional hiccup when you swipe over to the leftmost home screen, the slightly manic animation of the app switcher, plus there's the duplication of features that comes any time a manufacturer pushes its own ecosystem on top of Android. You get two app stores on Samsung phones, two sets of user data between your Google and Samsung accounts. Anyone coming from a more streamlined experience like the Pixel 2 or, yeah, the iPhone, will probably find this more complex than what they're used to. Of course sometimes complexity leads to a commendable leap in quality. Take the camera here, I only had access to the S9 Plus for this review, but the primary cameras between the two sizes are the same. The only thing the Plus adds is this secondary shooter with a telephoto lens. A word on that, it's supposed to give you higher quality zoom, but it only works in favorable lighting because its sensor still isn't as good as the main cameras, so the upshot is that when you press the zoom button, the phone often does not use the telephoto camera at all because it can get a better shot by cropping the main sensor's image instead. This is the same way the iPhone handles things. So if you really want the smaller S9, you should worry more about the battery life you're sacrificing then losing that second lens. I'll come back to that in a second, first how 'bout that primary camera? You've gotta give Samsung's engineers credit here, it's the only modern smartphone shooter with a variable aperture. Aperture is like your camera's pupil, okay? It's the opening that allows light to hit the sensor, and Samsung gave this camera the widest aperture you can find on a phone, that means at night the S9 can pull in more light than most of the competition, and once it puts the captured image through some processing, it can put out some very nice low-light photos. Now here's the clever part, because you don't always want an aperture that big, the S9 uses mechanical shutter blades to physically obscure the outer portion of the lens in brighter settings, stopping it down from f1.5 to f2.4. The result is a camera suitable for day or night, and I've taken a few shots I'm quite happy with. So will the S9 be replacing the Google Pixel 2 I keep in my other pocket? No. See what Google's camera lacks in fancy hardware, it makes up for with incredible processing, and shooting side-by-side with the S9, most of the time I preferred the Pixel 2's pics. Yes it oversaturates a bit in daylight shots, but in low-light or situations with weird lighting, like in a bar or my studio, it was Google's phone that kept things sharper, the colors closer to authentic, while the Galaxy S9 was more likely to produce a soft shot that ran way warm. And that's true on the selfie side too. Samsung seems to have spent more effort on AR Emoji and other cutesy cruft than on making any meaningful improvements to the front-facing camera, and side note if you've ever wondered how raggedy you can look after a week in Barcelona and eight hours scripting a review, here you go. But the S9 punches back against the Pixel with raw hardware power that you just can't find on last year's phones. That lets the S9 do two really cool things, first, you can shoot video in 4K HDR, which is predictably beautiful and also quite steady thanks to the very good optical image stabilization, and secondly, if you really want your brain blown, swipe on over to super slow-mo, hit that toggle, and welcome to warp zone. The framerate jumps from 30 up to 960 FPS to stretch 0.2 seconds into six, giving you a glimpse into moments that otherwise pass too quickly to notice, and also some moments that maybe you'd prefer to forget. Now there's caveats galore with this, you need an awful lot of light for it to work, the focus is finicky and you're limited to 720p resolution. That leaves room for Sony to catch up later in the year, but Samsung's is so far, the only one with a motion-activated trigger mode. So for now, it's both easier and more fun to use. For all the special features the S9 brings to the camera, when it comes to the battery, it's sadly quite average. Even with the larger capacity on the Plus model, I found myself hitting the 20% mark before bedtime on several nights, and because my day won't be quite like yours, here's all the apps and services that were burning through that battery on a typical day. Eagle-eyed viewers will spot a lot of voice calls in here, and the S9 is great at them. With excellent noise-canceling, even in windy weather and very clear calls over T-Mobile's VoLTE. It's a shame the phone doesn't put its new dual-speaker array to use for those, though. While media will play through both the earpiece and the bottom port, speakerphone calls only make use of the latter. Anyway, let's bring it home by coming back to the battery, it's not bad, but it's not great, especially since endurance degrades over time. And if you go for the smaller S9 with its smaller power pack, you'll want to think about installing a dark theme and maybe turning off always on display to penny-pinch your milliamps. If the Galaxy S9 were a Radiohead song, it would be No Surprises. It packs the upgrades you expect and a camera that pushes boundaries, yes, but overall, it's emblematic of the kind of safe iteration that has people holding onto phones for longer. In a world where year over year, smartphone shipments just fell for the first time in history. Still, if you love your Samsung, and have an S7 or older, it's absolutely a worthy step up, and it's available for pre-order now, with prices ranging from $720 to $915, depending on model and your carrier. If you want something more affordable, there's no shortage of fantastic options out there, and I've covered a lot of them on the Mr. Mobile YouTube channel, but if you want a smartphone that checks as many boxes as an Android can, the Galaxy S9 is the Samsung for you. And don't act like you didn't see the smudges and scratches on mine after just a week. To keep your S9 looking as perfect as the day you unbox it, pick up a case from today's sponsor, Tech21 uses scientifically proven impact materials, innovative design, and a rigorous testing methodology developed in partnership with the National Physical Laboratory to protect your Galaxy S9 drop after drop. Tech21 cases are drop-tested 20 times to ensure durability so they pack the kind of protection your phone needs to withstand the clumsy fingers that afflict us all. Get yours at the link in the description below. Let me know what else you wanna know about the Galaxy S9 down in the comments, folks, hit up Android Central's review for more detail, and please do subscribe to The Mr. Mobile here on the Tube so you don't miss more S9 videos coming soon. Until next time, thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "Samsung",
        "Galaxy",
        "camera",
        "phone",
        "Google Pixel",
        "Samsung Galaxy",
        "year",
        "time",
        "Pixel",
        "Google",
        "Samsung phones",
        "year Samsung",
        "year Galaxy",
        "Google camera",
        "Google phone",
        "Google camera lacks",
        "Mobile",
        "phones",
        "year phones",
        "features"
    ],
    "transcript_entity_values": [
        "several nights",
        "the Galaxy S9",
        "year",
        "secondary",
        "last year's",
        "20%",
        "Bixby",
        "the National Physical Laboratory",
        "Samsung",
        "Android Central's",
        "night",
        "eight hours",
        "Glass",
        "Galaxy S9",
        "later in the year",
        "915",
        "last year",
        "Samsung Galaxy S9",
        "a week",
        "Plus",
        "a typical day",
        "Galaxy S9",
        "Radiohead",
        "Mobile",
        "0.2 seconds",
        "30",
        "today",
        "20",
        "2",
        "iPhone",
        "first",
        "the S9 Plus",
        "jack",
        "Google",
        "day",
        "two",
        "4",
        "the day",
        "VoLTE",
        "T-Mobile's",
        "years",
        "S7",
        "six",
        "secondly",
        "second",
        "Barcelona",
        "just a week",
        "Galaxy S8",
        "Mobile YouTube",
        "S9",
        "90%",
        "AR Emoji",
        "S9",
        "Sony",
        "S8",
        "Android",
        "the Galaxy S9",
        "$720 to $"
    ],
    "transcript_entity_types": [
        "DATE",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "DATE",
        "PERCENT",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "TIME",
        "PERSON",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "TIME",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "GPE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY"
    ]
}