{
    "id": "tF013HYQd2Q",
    "title": "Why PC Game Ports STILL Suck",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2022-02-08T19:56:55Z",
    "video_url": "https://www.youtube.com/watch?v=tF013HYQd2Q",
    "category": "Science & Technology",
    "tags": [],
    "views": 498619,
    "likes": 27483,
    "comments_count": 1435,
    "description": "Share your repairs with the hashtag FixitFeb for a chance to win a Pro Tech toolkit!   Consoles are more similar to PCs than ever before, but many games designed for console still suffer from performance and technical issues when they're ported over to PCs. Why does this happen?  Leave a reply with your requests for future episodes, or tweet them here:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:",
    "description_links": [
        "https://www.ifixit.com/ltt",
        "https://twitter.com/jmart604",
        "https://lttstore.com",
        "https://lmg.gg/tqsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech"
    ],
    "transcript": "- Even though arguments between Console and PC gamers still happen all the time, consoles are more PC like than ever before. The Xbox Series X and Series S are based on AMD's Zen two architecture and you can even buy off the shelf SSDs to expand the storage of your PlayStation 5. But if consoles are so similar to PCs now, why the heck do ports of console games still have all sorts of performance issues when you try to run them on a regular desktop? To find out, we reached out to our friends over at Digital Foundry and we'd like to thank Alex Battaglia and Richard Leadbetter for their assistance with this deeper dive as well as some of the footage you're about to see. One issue might be familiar you if you played Horizon Zero Dawn at launch or Final Fantasy Seven Remastered. Problems with how PCs handle the game shader. A shader is the code that handles how to illuminate and color each pixel on the screen. On a console, the shader is just a file that the console loads when the game starts up and because each model of console has exactly the same hardware in each unit, programmers know how to write the shader for that specific hardware configuration. But because PCs can have nearly endless combinations of processors, memory graphics cards, et cetera, the shaders in PC ports are instead recompiled as you play the game. So, each time you encounter a new area or object, there's a good chance that the game will stutter while the shader recompiles and renders the scene. But the good news is that once a shader gets recompiled, it is saved to your SSD or to your hard drive. So, your CPU won't have to do that extra work ever again. However, there are other problems that can appear over and over again because of differences in how memory works on a console versus on a PC. Modern gaming PCs tend to have more memory than consoles. It's not uncommon to find 16 gigs of system RAM plus eight or more gigs of VRAM in a gaming computer, but modern consoles have a shared pool of typically between 10 and 16 gigs of memory in total. Meaning that games written for consoles often work by constantly streaming the necessary data into RAM since there just isn't as much of it to work with. Now, PCs could give you better performance simply by loading in more assets ahead of time thanks to their extra RAM, but games have to be recoded to take advantage of this and that would be a lot of extra work that publisher timetables may not allow for. And while this might not create graphical glitches, it does mean that you're leaving performance on the table even if your GPU is more powerful than what you would find in a console. God of War is a great example of a title where this limitation is visible with the game becoming dramatically slower at dedicated loading portals. And the fact that PCs have separate system RAM and video memory also means that data like textures and geometry information is getting shuttled between those two RAM pools quite often, which takes time. Generally speaking, the CPU has to handle this information including decompressing all this visual data. Consoles on the other hand have just one pool of memory where the data goes and they usually have a dedicated decompression chip that just handles this visual data lessening the load on the CPU. The fact that PC CPUs have to do this extra legwork can, you guessed it, cost you performance, though hopefully the new direct storage API for Windows will help alleviate this burden, since it offloads decompression work to the GPU which wouldn't tax your performance very much due to the way that GPUs are designed. We're just waiting for developers to take advantage of this feature in newer titles. We'll tell you more right after we thank iFixit for sponsoring this video. All month long, iFixit is challenging our YouTube community to fix or make something instead of buying new. For iFixit February, iFixit is giving away a Pro Tech Toolkit to one lucky fixer every week. All you have to do is share photos or videos of your repairs with the hashtag FixitFeb for a chance to win. So, save yourself money by fixing your tech while entering for a chance to win with FixitFeb. Get your iFixit kits today using the link in the video description. Now, it isn't uncommon anymore to see PC processors with 12, 16 or even more threads, but console games are written with fewer threads in mind. Even though the new Xbox Series X has 16 threads, the previous generation of consoles, which many games are still being made in mind for, didn't have nearly that many. And because it would be a massive amount of effort to recode these games to scale to higher numbers of threads, most developers don't bother and the gameplay experience suffers as result. Far Cry 6 is a good example of a recent game that suffers from this problem. Although it can definitely take advantage of high end modern GPUs, it can still stutter if you're getting a high frame rate, because the CPU is trying to load assets and it can't use all of its threads to do so. Because developers have been so used to coding mostly for a single thread until about the mid 2010s, this paradigm shift is taking a long time. Now, how games use or don't use multi threading leads us into our last topic, the DirectX API. On the surface, you might think that the fact that both the Xbox and Windows use DirectX might make it easier to port games between them. But the problem is that both DirectX 11 and DirectX 12 are widely used in game development and they are very different from each other under the hood. DirectX 12 gives developers more granular control over their games and it's become especially popular with Xbox titles because, as we mentioned before, everybody already knows a exactly what's inside of an Xbox. So, programming specifically for that fixed set of hardware isn't too difficult. But when those titles get ported over to PC, many games instead use DirectX 11, like Assassins Creed Odyssey for example. DirectX 11 doesn't provide as much granular control and instead takes care of more tasks automagically. That's important because PCs can have such a wide range of hardware, but it isn't always a good thing. More specifically DirectX 11 by default uses only one thread for rendering, meaning that games that get a DirectX 11 port released for PC often have poorer CPU performance, especially on AMD with its DirectX 11 driver being slower on the CPU. Using DirectX 12 for PC ports could solve this issue. But again, because of all the different hardware configurations possible on a PC that would necessitate a great deal of coding maintenance from the developer. DirectX 11 also does not support a feature called asynchronous compute. This feature allows one part of the GPU to render a scene's geometry while another takes care of compute tasks like physics or ambient occlusion. Consoles rely heavily on asynchronous compute to increase performance, but since so many PC ports are written with DirectX 11, the result is that many games released in the mid 2010s have lower than expected performance, especially on AMD GPUs which historically tend to be designed more with compute tasks in mind compared to their counterparts from Nvidia. In fact, there were a number of games where GTX 1060 and an RX 580 performed similarly under DirectX 11 even though the RX 580 from AMD is a more powerful GPU on paper. The lack of asynchronous compute is probably playing a big role there. Whew, so yeah, there's a lot that prevents our PC ports from playing the way that we expect. But hopefully as time goes on, developers will be able to take advantage of new tools to make coding for both platforms far less tedious. I would say to just try and exercise some patience until then, but I do think we used up a lot of that on Cyberpunk 2077 and the GPU shortage and this darn pandemic, subscribe.",
    "transcript_keywords": [
        "games",
        "DirectX",
        "Console",
        "consoles",
        "CPU",
        "game",
        "performance",
        "console games",
        "RAM",
        "PCs",
        "Xbox Series",
        "shader",
        "Xbox",
        "GPU",
        "gamers still happen",
        "memory",
        "time",
        "AMD Zen",
        "AMD",
        "work"
    ],
    "transcript_entity_values": [
        "the mid 2010s",
        "the DirectX API",
        "DirectX",
        "PlayStation 5",
        "RX",
        "Cyberpunk 2077",
        "GTX",
        "Horizon Zero Dawn",
        "One",
        "RAM",
        "580",
        "one",
        "1060",
        "iFixit",
        "between 10 and 16",
        "YouTube",
        "every week",
        "Windows",
        "February",
        "Windows",
        "Pro Tech Toolkit",
        "11",
        "Xbox Series X",
        "API",
        "FixitFeb",
        "Final Fantasy Seven Remastered",
        "AMD",
        "AMD",
        "Nvidia",
        "16",
        "DirectX 12",
        "two",
        "Digital Foundry",
        "GPU",
        "The Xbox Series X and",
        "12",
        "Assassins Creed Odyssey",
        "Richard Leadbetter",
        "only one",
        "Xbox",
        "CPU",
        "Alex Battaglia",
        "DirectX 11",
        "eight",
        "today",
        "SSD"
    ],
    "transcript_entity_types": [
        "DATE",
        "EVENT",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG"
    ]
}