{
    "id": "Tf3095vIE1I",
    "title": "Top 5 Free Mac Apps You Should Be Using! (2017)",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-02-23T21:36:13Z",
    "video_url": "https://www.youtube.com/watch?v=Tf3095vIE1I",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Macbook",
        "Apps",
        "app store",
        "best apps",
        "bartender",
        "fantastical",
        "Mac OS",
        "best mac apps",
        "best",
        "mac",
        "apps",
        "free mac apps",
        "must have mac apps",
        "os x",
        "imac",
        "macbook",
        "mac pro"
    ],
    "views": 420532,
    "likes": 13229,
    "comments_count": 737,
    "description": "These are the best Apps for your MacBook, iMac or Mac Pro in 2017. MacBook Pro -   Free Apps: Onyx -  Appcleaner -  F.Lux -  Unarchiver -  Copy Clip -   Paid Apps: Duplicate Finder -  dupeGuru (free) -  DaisyDisk -  Grand Perspective (free) - grandperspectiv.sourceforge.net/ Disk Inventory (free) -  AirMail3 - airmailapp.com/ Pixelmator -  Affinity Photo -  GIMP (free) -    Music Credits: Intro: Matanoll - Clearness (Robotaki Remix) Background: Fili - Closure  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2mpWpuG",
        "http://www.titanium.free.fr/onyx.html",
        "https://freemacsoft.net/appcleaner/",
        "https://justgetflux.com/",
        "http://unarchiver.c3.cx/unarchiver",
        "https://itunes.apple.com/us/app/copyclip-clipboard-history/id595191960?mt=12",
        "https://itunes.apple.com/us/app/duplicate-finder-retrieve/id1031826818?mt=12",
        "https://www.hardcoded.net/dupeguru/",
        "https://daisydiskapp.com/",
        "https://affinity.serif.com/",
        "https://www.gimp.org/",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going? Dave2D here! So this is a video on five free Mac apps that I think everyone should be using, if you have an Apple computer. So if you have an iMac, a Mac Pro, or any of the MacBooks, you should be using these apps because they're good, they're useful, and they're free. In addition to the five free ones, I'll be talking about some paid ones, none of these are sponsored or anything, these are just apps that I've used that I like, hence the creation of this video. So the first one is an app called OnyX. So OnyX is an excellent Mac cleaning tool. It's powerful, it's free, and it gets updated frequently. You can clean your Mac using some basic stuff, like erasing caches and cookies, but it can also do some more aggressive cleanup, like removing languages that you don't use. It can go pretty deep. Now OnyX can be a little bit risky, like if you go ham and start erasing everything, you can mess stuff up. So if you want something a little bit more restrained, there's an app called CleanMyMac, it's also good, but it costs $40. I prefer OnyX, just because it does everything you would need and it's free. The second app is AppCleaner. See, when you erase apps on Macs, they already do a decent job, just by deleting the DMG file. But there's often residual files, and this application gets rid of them. On thing to keep in mind, you do need to have AppCleaner installed in advance, so if you've already deleted a bunch of apps from your Mac, it won't be able to find those older, residual files. You need to use something like OnyX to clean that stuff out. Next is f.lux, of F-flux, I'm not really sure how to pronounce it. It's an application that controls the color temperature of your screen, based on the time of day. And it does this in a really gradual manner. So during the day, your screen will look normal, but as the sun goes down, it'll slowly remove the cooler hues from the screen to make it easier on your eyes. I know it sounds gimmicky, but try it for a while, and I think you'll like it. The thing that it's not good for is color accurate work. So obviously things will look more orangy and warmer, with f.lux running at night. But aside from that, once you get used to the color temperature changes, it makes your computer experience better. It helps you work for longer, because there's less eyestrain, and for me, and I think for a lot of people, it'll help you sleep better after you shut it down. Next is The Unarchiver. Which I think is the best unzipping or unarchiving app. Even if you don't frequently use compression programs, install this thing, because eventually, you'll download something or someone will send you something that needs decompression. And this will handle it. It does all of the major compression formats, and it extracts them properly. It's lightweight, and it's free. Last up is CopyClip, and this is an app that stores all the stuff that you copy using Command-C. So imagine if you copy one selection of text, and then moments later you copy some numbers or something. Normally, you lose that first selection of text. CopyClip stores them all into a list. So if you're typing a message for school, or doing stuff for work, or just doing anything, having a functional history of text that you've copied with Command-C is awesome. And once you've used this for a while, it's hard to go back to not having that kind of functionality. So, these five apps so far are free, they're good, they're awesome, but I also want to talk about some paid apps, and again, not sponsored, this is just, like, stuff that I like. Okay, the first one is Duplicate Finder. And this, as the name would suggest, finds duplicate files. So if you have a giant archive of photos, or videos, or music, this thing will search through them, find duplicates, and then clean them out. It's pretty fast, and also gives you good control for searching and erasing them. Sadly, it's not free. It's a ten dollar app. Now there's another app called Gemini 2, that's seemingly more popular. But it's $20, and I've used them both. They perform, like, almost identically. So, if you're going to choose between them, I'd rather if you guys saved $10 and get Duplicate Finder. I actually prefer it, I think the icon looks better. The other thing, if you're looking for a free option, well, I'm sure there's multiple free options, but the one that I've used with the most success in the past is something called dupeGuru. So if you're looking for a free option, there's one for you. Okay, next up is DaisyDisk, it's also $10. What this thing does is analyze your drive, and then it shows you what kind of files are taking up space on your computer. So it's another cleanup tool, and it does a great job at sorting out your drive into categories of what you have on there. So you can kinda decide what you want to nuke. There are a couple free alternatives that I've used, so GrandPerspective is one, Disk Intventory is another, they all kinda do the same thing. DaisyDisk is a little bit prettier, a little bit faster, but whether or not it's worth $10 is up to you. Okay, next up is Airmail, it's yet another $10 app. There are a lot of really good email apps for Mac, even the stock Mail app is pretty good. Now I've tried most of the popular ones, and Airmail is my favorite. It boils down to customizability. You get full control in this app for how your mail is handled when it goes in and out, as well as full control of viewing and sorting your email. Also, I like the icon. I know this seems silly, but I like a good icon. Okay, lastly, if you're looking for a Photoshop alternative, because Photoshop is expensive, and if you don't want to pay that, like, monthly fee. The app that a lot of people get recommended is something called Pixlemator. And it's a good app, it's like, $30. But there's another app that I think is much better called Affinity Photo. It's $50, quite a bit more expensive, but it looks, feels, and behaves much more like Photoshop for photo editing. Now, if you're looking for something that's free, you can get Gimp, it's also a very capable app for image or photo editing. And that's basically it. Hope you guys learned a thing or two. If you want to see one of these videos for Windows applications, give me 50,000 likes. *No*, just let me know down in the comments below, I'll do my best to make one of those as well. Hope you guys enjoyed this video. Thumbs if you liked it, subs if you loved it! I'll see you guys next time.",
    "transcript_keywords": [
        "app",
        "free",
        "free Mac apps",
        "Mac",
        "apps",
        "good",
        "thing",
        "app called",
        "Mac Pro",
        "Mac apps",
        "stuff",
        "free Mac",
        "called",
        "OnyX",
        "bit",
        "Duplicate Finder",
        "files",
        "Photoshop",
        "app called OnyX",
        "Duplicate"
    ],
    "transcript_entity_values": [
        "The Unarchiver",
        "iMac",
        "20",
        "Command-C.",
        "CopyClip",
        "50",
        "one",
        "F-flux",
        "Mac",
        "Apple",
        "Affinity Photo",
        "Command-C",
        "40",
        "second",
        "the time of day",
        "10",
        "Duplicate Finder",
        "30",
        "Disk Intventory",
        "Macs",
        "ten dollar",
        "the day",
        "two",
        "first",
        "five",
        "Photoshop",
        "Pixlemator",
        "MacBooks",
        "50,000",
        "Gemini",
        "night",
        "monthly",
        "DaisyDisk",
        "GrandPerspective",
        "Mac",
        "AppCleaner"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG"
    ]
}