{
    "id": "tg--L9TKL0I",
    "title": "Movies made sound with a light bulb: Sound-on-film",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2022-12-25T14:38:19Z",
    "video_url": "https://www.youtube.com/watch?v=tg--L9TKL0I",
    "category": "Science & Technology",
    "tags": [],
    "views": 1670645,
    "likes": 67197,
    "comments_count": 5468,
    "description": "Just like the movies in a theater! Links 'n' stuff: The Engineer Guy did a fantastic explainer on the mechanism of film projectors - much deeper than I went as I was focused mainly on sound. Check it out if you want to learn more!   Technology Connextras (my second channel where stuff goes sometimes)   Technology Connections on Mastodon:   The TC Subreddit   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!",
    "description_links": [
        "https://youtu.be/En__V0oEJsU",
        "https://www.youtube.com/@TechnologyConnextras",
        "https://mas.to/@TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Class, teachers gotta bit of a hangover. I... I cant do it today, so were gonna watch a mooooovie! Let me just whip out the ol Filmosound, here [projector whirrs to life, and muffled speech is heard coming from it] This is a Bell & Howell 16mm film projector. As you might have guessed from its name Filmosound, plus the fact that it has a volume and tone control, plus the fact that sound is coming from it, this thing is not only capable of recreating the illusion of movement through rapidly projecting a series of still images onto a screen, but it can also play a soundtrack synchronized with that moving imagery to recreate a true audio-visual experience. Just like the movies in a theater! But where is that sound coming from? Film is an optical medium, and doesnt sound come only on discs or magnetic tape? Well Jimmy, its time we learned a littlebit about sound on film. The 16mm film that this projects was a very commonly used sort of mid-tier format. As a matter of fact its still used in some production environments. Sitting between the cheap-but-limited 8mm film used for home movies and the expensive-but-highly-detailed 35mm film used in Hollywood, 16mm found widespread use where that middle-ground was appropriate such as for television productions, industrial and educational films, and the like. But, as ever, exceptions abound and some theatrical releases were shot on 16mm film and plenty of television productions were shot on 35mm film so there are no hard and fast rules here. *slurp* Looking at the film itself we can see a series of images in the center, plus sprocket holes on one side of the film... and an Audacity waveform on the other. Thats interesting. I wonder if thats the soundtrack. It is. But before we get to how the projector reads that, which is trust me - very exciting we should probably talk a little bit about how the projector handles the film it projects. Because that itself is pretty fascinating. The basics are pretty straightforward. Obviously the projector shines a bright light through the film so that a lens can throw a big blown-up image of that film at a screen, and itll just show one image after the other real fast and boom - The Illusion of Movement. But be warned. It might be tempting to simply move the film through the projector smoothly. But try that and youll be disappointed. Instead of seeing anything coherent on the screen, youll see a blurry mess of shapes moving quickly upward. To actually see anything, every image on the film needs to be still while its projected, and thats why projectors like this are elaborate mechanical contraptions which make that trademark projector noise. [that trademark projector noise] Here, lets look behind the lens. This part is known as the film gate and its absolutely critical. The lamp and its condensing lens blasts light through this hole and thus through a single frame of the film, and when the projection lens is in place it essentially magnifies that tiny frame and throws it at a screen. To the left of the light hole are three metal fingers. This is the film advance mechanism, known as the shuttle, and those fingers engage with the sprocket holes on the film. If I slowly turn the projector mechanism by hand, youll see that these fingers repeatedly stick out, move down, then retract and move back up. An awful lot like the feed dog on a sewing machine. With the help of this pressure plate to provide a bit of friction, the result is a stepped, rather than continuous, film motion. Every frame of film is held stationary so it can be projected clearly, and after a small fraction of a second the film is quickly advanced to the next frame. To keep you from seeing that movement, a rotating shutter synchronized with the mechanism blocks out the lamps light while the film is in motion. Once the next frame is in position and the film has stopped, light is allowed to pass once more. In a motion picture camera, the same mechanism is used - however in that case, the film is collecting light from a lens to capture photographic images, and the shutter not only prevents it from getting exposed while advancing to the next frame but also can change the length of time it is exposed through varying the size of the opening on the shutter - and thats why they use \"shutter angle\" in the movie business and not fractions of a second. Anyway, in a projector the constant opening and closing of that shutter means that the projected image is in fact flashing. Early on this was very noticeable and the frantic flicker on the silver screen is where the slang term flick comes from, fun fact. Later projectors, in an effort to make this less noticeable, have shutters which block the light multiple times with each projected image. Although the frame rate is still 24 frames per second, this projector displays each frame three times meaning that the image actually flashes 72 times per second, which is too fast for most people to notice. Since the film can only move when the shutter is blocking the light, and that happens three times per frame, this means that the film advance movement happens in one half of one third of 1/24 of one second - or 1/144th of a second. Or one grossth of a second. That means the film advance mechanism is yanking the film down real fast. Now, when you actually do the math it works out to about 2 and a half miles an hour so its not that fast but still, thats pretty stressful on the film. And to help with that, the film follows an elaborate path through a pair of rotating sprockets that are, again, mechanically linked to the film advance and shutter. Threading this thing is a pain and involves slipping the film over this sprocket, down through the film gate, then up over this second sprocket, around this mysterious thing, then back under that second sprocket, before finally taking a spin around these roller guides on its way to the take-up reel. After its all threaded you close in these little film guides and pray. Ive only messed this up several times! Anyway, the sprockets advance the film smoothly and youll notice that theres an area above and below the gate where the film just sorta hangs loose. These are there to provide some slack before and after the gate in order to reduce the stresses caused by the jerky film advance. If you forget to leave this slack there when threading, congratulations youve just chewed up some film! But when threaded correctly and operating, were left with a relatively straightforward (if mechanically elaborate) device. The first sprocket steadily pulls film from the supply reel, maintaining a few frames of slack as the film turns downward to pass through the gate. There it is repeatedly advanced one frame at a time, and between movements the shutter opens to project the image on the film. After it exits the gate at the bottom, another short length of slack is maintained as it turns again into a second sprocket which, moving at the same exact speed as the first, pulls the film steadily away from the gate. Looking at the transition space between the herky-jerky gate and the smoothly-turning sprockets is fascinating. It comes across better in-person, in fact its almost freaky in-person, but youll notice that near the sprocket (and in fact anywhere else along the film path) the film is just a blur. Its moving smoothly so you cant focus on any of the images it contains. As it gets closer to the gate, though, its periodic stillness allows you to pick out film frames, and right near the gate you can actually see motion in the imagery on the film. It appears upside-down because the lens flips it during projection. You can see the same thing as it exits the gate, but it becomes a blur again as it approaches the second sprocket. Now, if this were a silent projector this would be the end of its job - the film could simply go straight to a take-up reel after this point. But this aint no silent projector, now is it? No its not. But before I explain the sound this thing reproduces, I think its important that we go over how flicks became talkies. The technologies of sound reproduction and the motion picture were both fairly well understood by the turn of the 20th century. We knew how to capture and reproduce sound with phonograph records, and we knew how to make movies to be projected in a theater. It seemed pretty obvious that these two technologies should be connected, but there were two big problems. The first was that early acoustic sound reproduction technology wasnt suitable for the large audiences youd find in a theater. The devices of the time simply werent loud enough to reach the people in the back. But the second and arguably bigger problem was sound synchronization. That would prove tricky. Recording sound and filming action at the same time wasnt a difficult concept. In fact, people were trying to make talking movies happen for about as long as movies and talking machines coexisted, but satisfactory results were stubbornly elusive. Every time you were finished shooting you were left with two separate recordings: one visual, one sound. Playing them back together wasnt exactly rocket surgery, but for a convincing experience, they needed to be reproduced at the exact same time and crucially neither one could drift from the other so the playback speeds had to be exact. Otherwise, yknow, Singin in the Rain, and all that. By the 1920s electronic sound amplification was starting to be a thing, and that solved the volume problem. But we still had the synchronization problem. Some early sound films did use phonograph records as their sound source, including the technically first feature-length talkie The Jazz Singer. These systems involved mechanical interlocks between projector and phonograph to keep them in sync, but it required projectionists to carefully align each device with cue marks at the start of every reel and was susceptible to a bumped record player completely ruining the moviegoing experience. But what if the sound could be stored on the film itself? Putting both visuals and audio onto the same physical object would guarantee theyd stay in sync, but how could we do that? Magnetic tape wont be invented until 1928 so thats not gonna work, and besides that would be complicated to manufacture. Youd have to, like, bond this theoretical tape stuff to the film somehow. Now film works by blocking light in specific parts to make an image - what if we used that concept to store sound? Great idea, several people in 1919. In a classic case of contrived collaboration, Lee de Forest - who you may recognize as an electronics pioneer who invented the first amplifying vacuum tube - would work with Theodore Case and Earl I Sponable to invent an optical sound-on-film process, building on earlier work in optical sound transmission. See, we had already learned that we could modulate light to carry sound - in fact Alexander Graham Bell, the telephone guy, had demonstrated this in 1880. That concept was then used by the navy.... and fast forward to 1919 and de Forest is granted a patent which uses the photographic properties of motion picture film to carry a sound signal. You might have noticed that 1919 was before 1927. Yes, in an odd twist, sound-on-film predates synchronized sound-on-disc by well it kinda does and kinda doesnt. Hollywood for whatever reason was much more enamored with discs, that is once they were finally convinced talkies might just be more than a fad, and thats why the Jazz Singer used the Vitaphone system, but the Phonofilm system was in use in 1923 just not in Hollywood. Anyway, glossing over a ton of history, lets get on with it. This projector uses essentially the same sound-on-film technology that de Forest patented. In fact, from the 1930s and into the 1990s sound technology in movies shown in theaters remained largely unchanged. A long, long time ago I showed you what the film looks like. Along the edge opposite the sprocket holes is the soundtrack and its resemblance to the waveforms you might see in modern sound recording software is no coincidence. This is a physical representation of an audio signal, and thanks to the fact that the film moves, we can reproduce it with elegant simplicity. You might have thought that this projector has but one lamp: this nasty little 1,000 watt light bulb that will light up the screen and also burn a nice little hole in the film should it get stuck. But when you switch on the audio amplifier, youll discover that there is in fact a second one. That ones not important though, its just to help you see a little bit in a dark projection booth. Wait a minute though and you will find a third lamp lighting up this little red dot. This is the exciting one. This lamp is called the exciter and its job is to shine a light through the films soundtrack. That mysterious thing I mentioned during the threading process is the sound section, and when threaded the soundtrack on the film lies between the exciter lamp and a light-sensitive doohickey of some kind that will generate a voltage or maybe current proportional to how much light hits it. Id be more specific but the technologies changed a bunch over the years and I couldnt tell you if this is a photodiode or a selenium light cell or a photoresistor or what. It doesnt really matter, though, the specific specifics arent important, what is important is that the light sensor, when it picks up changes in brightness, will generate a signal which we can amplify. The light sensor lives here, tucked behind this large silver drum thing. The large silver drum thing, called the sound drum, serves a similar function to the capstan in a tape recorder, and the film is threaded around it. Its a little different as its not powered, but inside the projector we find a large flywheel that the drum attaches to. Like a tape recorders capstan, the rotating mass of the flywheel smooths out any small variances in film speed that would be audible as flutter - and since everything in here is driven by mechanically-locked gear trains, while the motion of the sprockets might look smooth, theyre actually much too jittery for pleasant sound reproduction. When threaded properly, these spring-loaded rollers put tension on the film to keep it snugly in contact with the drum, and once the drum is up to speed theyll just sort of float up and down as needed. In essence, the floating rollers constantly absorb the tiny bits of slack introduced by the slightly jittery turning of the sprocket, and the inertia of the drum keeps the film moving as smoothly as possible through the sound section. This is by far the most fiddly part of the threading process on this projector and I hate it! You need there to be enough tension on the film for those floating rollers to actually float, which means you kinda have to slip the film in the top section of the sprocket, lock in the guard, bring it around the drum, and then keep constant tension on it as you slip it under the bottom half of the sprocket and the film engages with the teeth. You only have about one film frame of tolerance, here, and if theres enough slack that those rollers dont ride on the film the sound will either sound muffled and warbly or just wont come through at all. Now, to be clear, not every projector works like this one does - this is an older and relatively simple projector, in fact its old enough to have a vacuum tube amplifier. Newer and fancier units featured automatic threading or just a generally less annoying design. Anyway, now that we have a way to make the film move smooth as butter, were done, right? Well, not quite. Simply shining light through the soundtrack section and onto a light sensor wont work well. The sound signal on the film is, in this case, modulated using the variable-area technique. The width of the clear sections corresponds to the signal amplitude - more clear area means more light will pass through the film and thus we get a stronger signal from the sensor. And of course that varies along the length of the film - combine the changing width and linear movement of the film and youve got an amplitude that changes with time - just like sound pressures do in the real world. But in order to reproduce that signal with any degree of fidelity, we need the sensor to be able to discern rapid changes in amplitude like you see here. To do this, the exciter lamp shines through a slot and lens which projects only a tiny slit of light onto the film. That literally narrows the area being scanned which makes the signal we receive more precise and allows us to recreate the nuances of the waveform. And the fidelity thats possible here is frankly not bad, especially considering that this is 16mm film which only moves at a hair over seven inches per second. Here are some samples taken from this projector. [Narrator] Printing is a process of transferring an image from one surface to another. [sad bagpipe toot] [normal bagpipes] Note that 35mm film, which is what youd be seeing in a commercial theater, moves at a much faster 18 inches per second. With more than twice the speed, high-frequency sounds are reproduced much more accurately, and the fidelity is greatly improved. Still, though, the sound on 16mm is perfectly acceptable - and with a fancier projector, I imagine this would sound better. [Narrator with acoustic guitar in background] For right handers: feet apart, left foot forward. Bring the ball in front of your chest, then above your shoulder. Steady the ball with your left hand. Hold the ball with your right. Shift your weight to your left foot as you throw. [70s flutes in background] Theres nothing there I really dont understand. [Narrator] Excellent. Then perhaps you can tell us what this code does. How should I know? Sure, I can read the language but how can I understand unless you tell me what the names stand for? [more very groovy mid-seventies instructional flute-music] Something doesnt add up. And thats exactly what Crookes thought when he invented this device. Now, nature isnt wrong. The theorys wrong. Instead of demonstrating the pressure of light, he must have been demonstrating something else. [Narrator] The correct position for the head is slightly tilted back. When the arms are in their correct position, a pole can be placed on the bridge of the nose and the ends of it will rest between the thumb and forefinger of each hand. All the windows in our house have wooden doors outside. They must be opened every morning, and thats my job. [Narrator] Communicore, with its central location, is the hub of Future World. In a sense, its also the heart of EPCOT Center, for here are the computers that control many of the attractions. [Narrator] Sometimes he went stalking with his Highland uncles. [birds chirping] Once, after staying still for a long time, Wee Gillis couldnt hold his breath [exhales] [clopping hooves] and he frightened away the deer. [more incredibly 70s flute music, but now with harpsichord!] [Narrator] Its much like the Golden Rule. If you read programs critically when you get a chance, apply some of the ideas weve covered, and use tact with personal criticisms, you and your colleagues will be a lot more successful and so will your programs. There are some interesting things to point out about the sound, here. Of course, that buzzing is mainly the result of an old amplifier that probably could do with new capacitors. But did you hear a sort of metallic sound throughout the recordings? One of the downsides of analog optical audio is that its susceptible to vibrations - if the film physically moves even just a tiny bit in a way that affects how much light hits the sensor, youll hear that movement. And the sound drum on this machine doesnt spin silently. If I give it a quick spin we hear a similar sound. I believe that is getting transferred into the signal, though it could also be one of the rollers. In any case, its just interesting. Something else to point out is what signal noise sounds like. For instance, when the translucent leaders at the head and tail of a film travel through the sound section, what we hear is a scratchy sound not unlike a phonograph needle sliding on the surface of a record before it locks in the groove. [buzz as amp switches on, then scratchy surface noise] [clicking and popping] Little bits of dust or scratches on the soundtrack will have a similar effect. And since even a silent section will have tiny little variations in it, there is a noise floor just like you find on vinyl records. Anyway, its just interesting that the noise is much more like a phonograph and much less like magnetic tape. You may have already guessed that since the sound section is here but the projected frame is all the way back there, that the sound is recorded onto the film ahead of the images, in fact by 26 frames. At the beginning of many films there will be a brief beep on the soundtrack 26 frames ahead of a marker which will flash on the screen, and that helps assure that the sound is in sync. Threading mishaps can cause film to bunch up in unexpected ways so its nice to have that confirmation. However, the sync can easily be off by a frame or two thanks to the slack section after the gate. Its easy to vary how much film is left floating here, and that will affect sound sync. Luckily, if its off by just a couple of frames most people wont notice. Like how it was slightly off in this entire shot. Another thing to point out about these soundtracks is that, while you might assume these are in stereo thanks to the two waveforms right next to each other, this is in fact just a mono recording. The two parallel waveforms are identical. So, why bother having two of them? Is there some magic to be had? Yes, actually! This, like most of the films I have, is a dual-bilateral variable-area soundtrack. Say that five times fast. Two parallel soundtracks help reduce whats known as azimuth distortion - which is basically how well or poorly centered the scanning beam is on the soundtrack. With a single waveform running in the center, a slightly misaligned scanning section (which could happen for a number of reasons including a slightly out-of-tolerance exciter lamp) might miss the edges of the waveform and thus that sound information wouldnt get through. Having two identical soundtracks right next to each other means that if the scanning beam is slightly off, the signal is less likely to be damaged as at least one of the two waveforms will be completely captured. Some manufacturers would go on to take this concept to the extreme and produce soundtracks with four or even six identical waveforms. Did it help? Maybe. OK, so we understand how the projector makes sounds from those wiggly waveforms on the film, but how did they get there in the first place? Well, have you ever seen one of those laser light show thingies? Think that, but itty bitty. A device called a mirror galvanometer was used to bounce a tiny spot of light onto a strip of photographic film. That mirror, when fed an audio signal, would vibrate and wiggle that spot of light left and right. The stronger the signal, the more it vibrated, and thus the wider a line it would appear to make. Without a signal it wouldnt vibrate at all and it would remain a spot. Running photographic film past this wiggly light would produce waveforms like this once developed with a reversal process. Id love to know more about the specifics of how films like this were mass-produced. For instance, most of the color films I have are quite severely faded, but the soundtracks are not. Indeed, the soundtracks were made using conventional black-and-white, silver-halide film chemistry and then bonded somehow to the dye-based color film print. However that was done, the soundtrack must be very very thin as you cant feel a ridge of any kind. Or perhaps the film was made with two emulsions on it, but given what I now know about how film is manufactured (thanks Destin) that seems unlikely. Anyway, I dont want to dwell on this but I am very curious. Oh, and while all of my films have variable-area soundtracks, that wasnt the only way to do it. In fact, de Forests original Phonofilms used a variable-density scheme. Here, rather than wiggle a constant light to make different shapes, we change the brightness of a light source projected through a slit. In essence its the same exact concept as we see in the projector, but with a fast-acting light source exposing the film to record sound onto it. That makes a soundtrack in which the recorded sound looks more like banding than a waveform but it will block light in much the same way when being reproduced so it is entirely compatible with this or any other optical sound projector. And, although much rarer in the grand scheme, there are films in which the audio section is indeed a strip of magnetic tape bonded to it. They probably offered higher fidelity especially on 16mm film, but they required a compatible projector. Speaking of projectors, before we get to the part about Digital Sound On Film - thats right, thats a thing - I want to talk a little bit more about the lost art of projection. You might be wondering how long of a film the projector can show before it runs out of film. Well, a big 15 inch reel like the one Im using as a takeup-reel can hold 2200 feet of film which, side-note, did you know thats where the term footage comes from? As in, wheres that sasquatch footage? Motion picture film is measured in feet! And some quantity of it is footage! There are even little gauge marks on the reels. Anywho, since 16mm film has relatively small frames, at 24 frames per second a full 2200 foot reel will run for an hour. Thats a pretty uncommon size, though, and the 1600 foot reel, which ran for 44 minutes, was commonly used for feature films with 800 foot reels like these common for short-subjects or educational films. This means that feature films came on multiple reels. And on 35mm film with its much larger frames, a 90 minute movie might be split up onto five 2000 foot reels which held a maximum of 22 minutes runtime. And for many years 1000 foot reels were standard, meaning the same film would need to be on 9 reels. So how did movie-going audiences get to watch a seamless performance? Well, have you ever watched a home-video release of an old movie and caught one of these little dots showing up in the corner? If youre too young you probably havent as these are generally edited out these days, but those are cue marks. See, although a projector in a cinema could only show 11 or 22 minutes of film at a time, through the Magic of Having Two Of Them, you could have another projector standing by ready to go and switch to it the moment the first one runs out of film. Those cue marks appear at 8 seconds and 1 second before the end of a reel. The first signals to the projectionist to get ready to switch, and the second says nows the time. This used to be entirely manual, and projectionists would have to quickly cover the first projectors lens with a shutter and open up the second which was rarely seamless, but eventually this process was semi-automated and merely required the push of a button. As you can imagine, back in the day a projectionists job was pretty hands-on. Theyd have to constantly be getting the next projector ready - as soon as they hit the changeover, they had to immediately unload the first projector, then start threading the next reel and cue it up. Then they could rewind that first reel (assuming they had a separate rewinder) and after that theyd be on the lookout for the cue marks to do it all over again. These folks were really watching the same movies again and again and again which was undoubtedly tedious but also meant they could get really good at timing the changeovers. If they were good enough, the audience wouldnt even notice. Unless they were looking back at the projection booth like some kinda nerd. Like me. Eventually, though, most theaters would upgrade to large platter systems which could store an entire spliced-together feature plus trailers. And those could be loaded from the center, meaning the film just shuttled between two platters and didnt ever need rewinding. This meant a projectionist only had to start a film and could wander around to other screens in a multiplex and just keep tabs on them. Plan some sort of schedule for screen times and you might only need a single person to manage a dozen screens. Thats what they call progress, I guess. Speaking or progress, starting in the 80s people got a taste of sound made not from shapes, grooves, or magnetic flux but from ones and zeroes. They also liked the idea of sound coming from many different places in a theater. The advent of digital surround sound meant that sound-on-film was gonna need an update. And it looked like this! This is a 35mm film trailer, and you probably recognize our old friend dual-bilateral variable-area! Though in this case, it actually is stereo - professional projection systems used much more precise sound heads to correctly scan both waveforms separately. By the 1970s, stereo sound was pretty standard and Dolby Stereo - a way to derive Left, Right, Center, and Surround channels from a cleverly-modulated stereo source - offered basic surround sound using this technology starting in 1976. But anyway, thats not the only soundtrack on here. In fact it has not one, not two, not three, but four different soundtracks! To the left of the analog soundtrack we find Dolby Digital sound hanging out in the middle of the sprocket holes. First used in 1992, these QR-lookin matrix barcodes, complete with an adorable little Dolby logo in the middle, encode a Dolby AC-3 bitstream at 320 kilobits per second. Theres some error correction built in, of course - by my rough count I think the raw data rate is closer to 530 kilobits a second but anyway to upgrade your cinema a new digital sound head that scans this area using what you can describe as basically a tiny high-speed camera (sigh) thats gonna ruffle some feathers. Theres a scanner thingy that uses the same tech thats in a camera sensor to read the datastream with the help of backlight, lets just leave it at that - that thing gets installed somewhere on your projectors film path and now youve got digital surround sound! And a fun thing about being digital is that you no longer needed to put the sound head in exactly the correct place. Just like 16mm film, oddly enough, the sound data is 26 frames ahead of the projected image. But you could easily put the sound head a little bit further ahead and simply buffer the data to delay the sound by however many fractions of a second you need to attain synchronization. Thats pretty neat. Oh, and the fact that the physical location of the sound is well ahead of the projected image gives the MPAA preview approval cards a second purpose: at every film splice, theres gonna be a little over a second of silence in the audio before the picture catches up, and since multiple trailers would get spliced together onto the start of a main feature, there will always be a series of gaps. Might as well use those for this thing. To be clear that also happened with analog audio but I only thought of it at this point in the scriptwriting process. Now, to the left of the Dolby Digital soundtrack youll find another very digital one. In fact this one is even more digital! As in, it has a higher bitrate. This is Sony Dynamic Digital Sound, also known as SDDS, also known as of course Sony made another sound format they just cant help themselves! Hitting theaters in 1993, its scanned in much the same way as Dolby Digital and encodes 8-channel audio at 2.2 megabits per second, much greater than Dolby. However, very few movie studios embraced mixing in that particular format and since the data is placed on the edge of the film where its vulnerable to damage, reportedly this often suffered from dropouts and yeah it was the least popular format for cinemas when film projection was still the norm. Are you really surprised? But I said theres a fourth format. Wheres that one? Why, its right here! This is Digital Theater Systems surround sound, also known as DTS, which also first hit the screen in 1993. You may notice that this is hardly any data at all compared to Dolby Digital and SDDS. Did they discover some sort of really magic compression format? No, as a matter of fact this is merely a timecode as DTS did a throwback to sound-on-disc. Special CD-ROMs containing a 5.1 channel mix encoded at 882 kbit/sec stored the sound, and this data stream simply identified what film or trailer was playing and the exact time of the projected frame. Offboard equipment with the loaded discs would simply monitor this code and cue up the correct audio. This made the scanning equipment much simpler but meant that the sound was technically not on the film anymore and of course required more off-projector hardware plus the wrangling of the discs. But anyway, one nice benefit of the DTS system from a producers point of view was that, like Dolby Digital, it was also a 5.1 channel system. Since it used ~essentially~ the same sound mix, a production studio could master in either one and get essentially the same experience between a DTS or Dolby-equipped cinema. Which was another nail in the coffin for SDDS. But dont be blue, Sony. Eventually youll win one of those format wars. Oh, and while off-film discs might have made the projectionists job a bit more complicated, that technique was theoretically more future-proof as it could be easily upgraded to DVD-ROM which could store more channels with more bits, though Im not sure this was ever done in theaters before film projection faded away. But at this point, I think were done. And that means its time to rewind the film! On this projector, that means depressing this latch to lift the take-up reel into this position, then grabbing the tail of the film and wrapping it around the supply reel a few times. After thats done, set the projector to reverse. Oh, did I mention you can watch anything backwards? Thats fun and/or necessary sometimes because a piece of masking tape got caught in the gate somehow. .terr sall wus yeep ziT .ssip moes sey vaaawW .sez yeep ziP .swup g'nosh gelwozwod wilno wunnondazI .herri hunai pumeH Anyway, after its set to reverse you can hit this button which engages a clutch to make the supply reel go backwards real fast! Reel. Fast. Then at the end, you can watch it go fwip fwip fwip fwip for as long as you like. Though you should probably shut it off before too long. This stuff is fragile, yknow. cinematically smooth jazz [inhales] wheeeeee Eugh The 16... The - hmph. Heh heh. Heuh!! As a matter of fact its still used in some production environments. Sitting between the [film moves] thats gonna be really loud, isnt it? Every frame of film is held stationary. [confusion] Stationary still... thats whats written there? stationary, so. There's just a redundant word. Thanks, spell check for not catching that. You kinda have to slip the film in the top section of the shproc shection of the shprocket. A shection of the shprocket. In a world where Technology gets Connected the fate of all humanity lies in the hands of one man. He must convince people to buy powdered dishwasher detergent. Will he succeed? In theaters this Christmas.",
    "transcript_keywords": [
        "film",
        "sound",
        "projector",
        "light",
        "films",
        "Digital Sound",
        "film advance",
        "fact",
        "Dolby Digital",
        "Dolby Digital sound",
        "Digital",
        "frame",
        "early sound films",
        "sound films",
        "soundtrack",
        "digital surround sound",
        "time",
        "sound section",
        "sprocket",
        "reel"
    ],
    "transcript_entity_values": [
        "Heuh",
        "a minute",
        "90 minute",
        "two",
        "Sony Dynamic Digital Sound",
        "six",
        "Bell & Howell",
        "35mm",
        "SDDS",
        "2200 foot",
        "fourth",
        "Jimmy",
        "70s",
        "the Golden Rule",
        "Phonofilms",
        "four",
        "one",
        "mid-seventies",
        "Lee de Forest",
        "1600 foot",
        "22 minutes",
        "5.1",
        "de Forest",
        "Two",
        "Dolby Digital",
        "the 1990s",
        "530 kilobits",
        "Digital Sound On Film",
        "Destin",
        "Crookes",
        "320 kilobits",
        "26",
        "Sony",
        "8",
        "800 foot",
        "Vitaphone",
        "EPCOT Center",
        "at least one",
        "1976",
        "1/144th",
        "first",
        "the turn of the 20th century",
        "16mm",
        "these days",
        "Theodore Case",
        "Alexander Graham Bell",
        "16",
        "1928",
        "about 2 and a half miles",
        "the Magic of Having Two Of Them",
        "AC-3",
        "11 or 22 minutes",
        "1993",
        "1992",
        "72",
        "one half of one third",
        "sec",
        "The Jazz Singer",
        "three",
        "18 inches",
        "1919",
        "80s",
        "a dozen",
        "9",
        "24",
        "15 inch",
        "2200 feet",
        "1880",
        "Future World",
        "Digital Theater Systems",
        "Audacity",
        "the day",
        "1927",
        "today",
        "Dolby Stereo",
        "DTS",
        "this Christmas",
        "Dolby",
        "8 seconds and",
        "between two",
        "Sponable",
        "MPAA",
        "1/24",
        "8mm",
        "five 2000 foot",
        "44 minutes",
        "moes sey vaaawW",
        "the Jazz Singer",
        "the 1930s",
        "Hollywood",
        "third",
        "half",
        "2.2 megabits",
        "the years",
        "Filmosound",
        "Wee Gillis",
        "navy",
        "1923",
        "1920s",
        "seven inches",
        "Singin",
        "about one",
        "the 1970s",
        "882",
        "1000 foot",
        "Highland",
        "One",
        "five",
        "an hour",
        "First",
        "second",
        "Earl"
    ],
    "transcript_entity_types": [
        "PERSON",
        "TIME",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "PERSON",
        "DATE",
        "FAC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "FAC",
        "FAC",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "PRODUCT",
        "TIME",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "PERSON",
        "ORG",
        "DATE",
        "GPE",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "ORDINAL",
        "PERSON"
    ]
}