{
    "id": "TG0-xhZ1Jds",
    "title": "How Nintendo Invented the PlayStation",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2019-03-04T17:15:24Z",
    "video_url": "https://www.youtube.com/watch?v=TG0-xhZ1Jds",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "nintendo",
        "super nintendo",
        "playstation",
        "sony playstation",
        "sony",
        "gaming",
        "snes",
        "video games",
        "super nes",
        "super famicom",
        "philips",
        "sega",
        "virtua fighter",
        "legend of zelda",
        "ken kutaragi",
        "norio ohga",
        "philips cdi",
        "wii u",
        "sega saturn",
        "games",
        "console",
        "gaming news",
        "tech news",
        "game",
        "zelda",
        "prototype",
        "playstation prototype",
        "nintendo playstation",
        "walkman",
        "sony walkman",
        "play station",
        "cd-rom",
        "ps1",
        "technology",
        "retro",
        "famicom",
        "wii",
        "super mario",
        "psx",
        "nes",
        "ces"
    ],
    "views": 91889,
    "likes": 3368,
    "comments_count": 152,
    "description": "Hey, who got this Nintendo on my PlayStation?! What's That Scream In Every Movie?:  The World's Tiniest Country:  How A French Mill Invented the Computer:  How Star Wars Saved LEGO:  How An NFL Team Disappeared In 24 Hours:   Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/g11vCwtZAYY",
        "https://youtu.be/FrVVy8uSvEc",
        "https://youtu.be/R7-a7kzlk9g",
        "https://youtu.be/a3KY0DhyJ7s",
        "https://youtu.be/EYEzhTLR9QY",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hey guys! This is how Nintendo created the Playstation on accident, I guess. Back in the late '80s, Nintendo realized that the 3D era of gaming was on the horizon, and their still-in-development Super Nintendo wasn't powerful enough to handle it. At the time, Sony didn't see the value in video games, but a Sony researcher, Ken Kutaragi, became very interested when he saw his daughter playing a Nintendo. This interest resulted in him secretly developing the sound chip for the Super Nintendo, without letting his bosses at Sony know. Oops. Maybe let your boss know before you make a thing for a Nintendo product. Well, I guess to be fair, it was still a Sony product. But, uh, yeah. Obviously, the executives at Sony weren't too thrilled about this; however, the CEO at the time, Norio Ohga, supported not only Kutaragi, but importantly, allowed him to continue working on the project. This made Sony the perfect partner. When Nintendo started looking into a revolutionary new technology, the CD ROM. In 1988, Sony and Nintendo signed a contract for Sony to develop a CD drive for the Super Nintendo. Where things got a little nafarius is that Sony was listed as the soul worldwide license heir to create their own consoles that ran Nintendo's games, meaning that Sony would make most of the profit from this venture. Nintendo started to realize just how much control they were giving up over their own console, so at the 11th hour they switched sides to Sony's main rival, Philips, to develop their own CD ROM attachment. Sony found out about this so to publicly shame Nintendo, they announced their own Super Nintendo with a CD ROM drive called the Play Station at CES 1991. And to be clear, it's not Playstation, it's Play space Station. The next day, Nintendo clapped back and announced their own partnership with Philips, instantly killing the Play Station. I don't know how else to say it. It's not the Playstation, it's the Play Station. The Play-Station, The Play-Stay... The Play... Station. I don't know how long of a pause to do. It's weird. - [Matt] It reminds me of when I played the first Microsoft console. It was X-Box. (laughing) - [Austin] While Nintendo ultimately gave up on the idea of a CD ROM, both Sony and Philips were far enough along that they actually ended up developing their own proper competitors to the Super Nintendo. What a great move. They start out by trying to make a new add-on for the Super Nintendo, and instead create two giant competitors. Philips created the ill fated CD-I system which did feature some licensed Nintendo games such as The Legend of Zelda. If you remember this awful, terrible monstrosity. On the other hand, Sony took the split personally and their CEO appointed Kutaragi to continue to vomit on the PlayStation. This time without a space. After witnessing the success of Sega's virtual fighter in Japanese arcades, Sony opted to go with 3D polygon graphics over the much more old-school style 2D sprites. With the prototypes built and dozens of developers signed up to make games for the brand new PlayStation, now was the time to release it. In December of 1994, Sony released the PlayStation in Japan with a price roughly equivalent to about $400 and it was an immediate hit. To put things in context, Sony served 300,000 PlayStations in the first 30 days. Their biggest competitor at the time, Sega, sold only about half as many Saturns. That little gaming business that Sony didn't think was worth pursuing is now one of the largest parts of the company. Meanwhile, Nintendo, thankfully, makes much better decisions these days. Well, except for the Wii U.",
    "transcript_keywords": [
        "Super Nintendo",
        "Nintendo",
        "Sony",
        "Play Station",
        "stillindevelopment Super Nintendo",
        "Super",
        "Nintendo games",
        "Play",
        "Station",
        "Hey guys",
        "Nintendo started",
        "ROM",
        "Play space Station",
        "Philips",
        "Kutaragi",
        "time",
        "Ken Kutaragi",
        "Nintendo product",
        "Sony product",
        "Nintendo realized"
    ],
    "transcript_entity_values": [
        "Norio Ohga",
        "300,000",
        "Sega",
        "The Legend of Zelda",
        "Kutaragi",
        "the 11th hour",
        "1988",
        "Nintendo",
        "Matt",
        "Super Nintendo",
        "the late '80s",
        "dozens",
        "about $400",
        "1991",
        "only about half",
        "two",
        "The Play-Station",
        "the Super Nintendo",
        "Philips",
        "Ken Kutaragi",
        "Nintendo",
        "Playstation",
        "Saturns",
        "the first 30 days",
        "Japan",
        "the Wii U.",
        "Sony",
        "The Play-Stay",
        "these days",
        "Japanese",
        "the Play Station",
        "the Play Station",
        "first",
        "Microsoft",
        "Sega",
        "PlayStation",
        "The next day",
        "December of 1994",
        "PlayStations"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "NORP",
        "FAC",
        "WORK_OF_ART",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG"
    ]
}