{
    "id": "tHNrBuN4V3U",
    "title": "The Weirdest Tech of CES 2018",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-01-12T23:21:03Z",
    "video_url": "https://www.youtube.com/watch?v=tHNrBuN4V3U",
    "category": "Science & Technology",
    "tags": [
        "ces",
        "tech",
        "weird",
        "ces 2018",
        "consumer tech",
        "gadgets",
        "technology",
        "dr fuji",
        "2018",
        "cool tech",
        "gadget",
        "cool gadgets",
        "austin evans"
    ],
    "views": 1241400,
    "likes": 25527,
    "comments_count": 1047,
    "description": "CES is a wonderful place full of weird, weird tech gadgets. Trying the World's Thinnest Laptop at CES 2018:  Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "https://www.youtube.com/watch?v=uMATo2qiscY",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin, and today my mission is very simple, to find the weirdest tech of CES 2018. And should be pretty easy, there's a lot of weird stuff here. So the Razer booth is incredibly loud, incredibly busy for one reason, they have the unbelievably impressive giant keyboard. It sounds very solid. I'm not entirely sure why this exists though. Why does this exist? - Because why not? Who else is out here doing this, man? Razer's out here, guys, doing things people aren't. - You heard it here first. Razer does stuff because they can. So you might be familiar with this little known product called the iPhone X. No well, out of the box it's going to be waterproof up to about six feet. Catalyst was like oh no, not good enough. So not only do they have a case for the iPhone X which is going to be waterproof up to 33 feet, but they're even cases for the AirPods, so you wanna go take those underwater you can do that. You can take the iPad underwater which is my personal favorite. So that's only going to be for a few feet deep, but I mean, an iPad underwater sounds cool. This is something you definitely don't see everyday. So this is a fully transparent keyboard. So not only is it going to be flexible, but the idea is that you actually can connect it via Bluetooth. So hey guys. It's a little hard to type with. But it's actually kind of a cool idea, and one of the best parts is that when you hit the button it will actually retract it inside. This is still a concept right now, so there's actually no release date. But the idea of having a keyboard that can roll up in your pocket is kind of cool even though it would be nice if it was just a little bit bigger. He's sitting down right now. Can I go say hi? Is that okay? Is that a thing I can do? I know we came back. I know you're out having lunch. Can we please take a look? Thank you Doctor Fuji, this means a lot. - You see, gets a workout? Nice you see, we did the medium for ya. Explore. Nice! This is, shook out my fat you see. Shook out, it's for real. That's why we can be your motivation. Care for your health. Care for your sexy body. Looks - a major change. It's American line, you see? - That's quite the statement. - Yeah, that's quite a technology for health fitness. - Oh boy. - Oh wow. Wow. This is-- I'm feeling things I did not think I was going to feel. (dance music) I feel so sexy right now. Okay so after getting the full Doctor Fuji experience, I've gotta say that CES, it's looking pretty good. I've never felt healthier. I've never felt sexier. At CES there is wild and crazy tech all around, but one of the most exciting things I've seen is right behind me. So I was over here yesterday, and something about this laptop definitely jumped out to me. And that was the .com button on the keyboard. So can you tell me anything about this? - This is the only for IT products okay. - Revolutionary tech at CES. A .com button built in to the keyboard. It's hard to go wrong. All I know right now is Ken pulled the camera out and said, \"Hey, follow Wes.\" So my hopes are high. What is that? What is that? These actually look really cool. Hey guys, this is Austin at CES 2018. I finally found some style. I mean, maybe, I don't really know. This is style, right? This is an actual battery belt. - It is. - Can you give me like the 30 second pitch on what this is and why I should want it. - Sure this is padded wearable technology for belts and straps. We do belt straps or, your know, purse straps, belts, anything that has a strap or a belt. - A medium all right. Let me give it a try here. Let me give it a try. So I\"m about to try on the battery belt. This is a really big belt. So the actual battery is from here to here it looks like or...interesting. So we've got a USB as well as a micro USB. We are three quarters charged. Okay, a little large, I will admit, but basically the idea here is that I could just plug my phone in to my belt and to be able to charge it. So I can walk around being incredibly stylish while charging my phone. So I'm just gonna walk around for the rest of CES with my slightly too large belt on. Or maybe not, I might just give it back to him 'cause it's not mine. I've seen a lot of weird stuff this day, this week, this year, my life. This is up there. That face. It doesn't make it any better. They're singing in a really creepy way. I need to go home.",
    "transcript_keywords": [
        "today my mission",
        "find the weirdest",
        "CES",
        "belt",
        "Hey guys",
        "keyboard",
        "guys",
        "Hey",
        "Doctor Fuji",
        "idea",
        "cool",
        "Razer",
        "give",
        "weirdest tech",
        "stuff",
        "battery belt",
        "things",
        "feet",
        "underwater",
        "straps"
    ],
    "transcript_entity_values": [
        "this year",
        "Razer",
        "2018",
        "iPad",
        "first",
        "Ken",
        "USB",
        "this day",
        "AirPods",
        "yesterday",
        "Austin",
        "30",
        "this week",
        "up to",
        "Austin",
        "one",
        "about six feet",
        "a few feet",
        "second",
        ".com",
        "CES",
        "33 feet",
        "three quarters",
        "American",
        "Wes",
        "today"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "PERSON",
        "DATE"
    ]
}