{
    "id": "TiBA5i8OiHU",
    "title": "I built a PUBG Mobile Arcade Machine!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-05-17T16:19:14Z",
    "video_url": "https://www.youtube.com/watch?v=TiBA5i8OiHU",
    "category": "Science & Technology",
    "tags": [
        "pubg",
        "pubg mobile",
        "arcade cabinet",
        "arcade",
        "arcade machine",
        "build",
        "custom build",
        "cabinet build",
        "tech",
        "phone",
        "smartphone",
        "android",
        "oneplus",
        "oneplus 8 pro",
        "the test drivers",
        "test drivers",
        "this is",
        "austin evans"
    ],
    "views": 609463,
    "likes": 11931,
    "comments_count": 826,
    "description": "Download PUBG Mobile for FREE!  Thanks to PUBG Mobile for sponsoring this video! The latest episode of the PHONE GAME on This Is!   My new podcast The Test Drivers!  Our second channel @thisis!  I stream on Twitch now!  We have a new Discord:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://www.inflcr.co/SH2Bp",
        "https://youtu.be/O8ri-QIP1eE",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "https://discord.gg/sQ8Sw27",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "(trap music) - So when our friends over at PUBG Mobile reached out and wanted to sponsor a video to celebrate their second anniversary, they told us to think big. Wes, we have a project. - Oh boy, well so if we're playing the game on the phone, can we take advantage of USB-C's capabilities, go out to HDMI? - To like a TV or something? - Yeah a TV, a display, - Yes. - and build some experience around that? Well actually if we're gonna be putting a TV in a crate you're pretty much halfway to an arcade cabinet at that point. So fill me in a little bit on PUBG, even though I'm obviously a very avid gamer. Remind me a bit of sort of the general aesthetics of PUBG Mobile. - [Austin] So think like brown rolling hills with some kind of brown buildings sort of around. So one of the mains things in the game is when either you kill someone, or when something drops from the sky there's like sort of smoke. So you could be like kind of a mile away, if you see smoke generally speaking you wanna run toward that because there's gonna be something there like weapons, armor, grenades, whatever the case is. - All right let me start sketching something out here. So if this is a side view, of sort of your standard arcade cabinet. - You think we can build an arcade cabinet in just a few days? - I think what we should do is, we should look for one of those pre fabricated kits that they sell, they're fully bare bones. - Oh. - If I can go down to Micro Center today, I know that they sell a kit, and if I can go down today and snag that, that'll save us a ton of time. - Okay. - Thinking about the concept though, if this is, oh boy I know how to spell side, (laughing) side view yay. So smoke you said is sort of a big element in this game right? - Yeah, yeah. - So what if we took some of this empty space up here that would normally be reserved for speakers, - Okay. - We could actually probably stick a fog machine up here sort of angled down like this. - I'm seeing smoke for some reason, but obviously fog is such a better idea. (laughing) - Yeah let's, I'd rather not (laughing) actually light it on fire, but you know if the project goes wrong, you know screw it. - It would go down in flames. - Well actually you said it has kind of like a whole military sort of feel to it. - Camouflage. - Yeah well actually, I feel like I've seen these big blankets that look like a ghillie suit, but they're like a full blanket. Like if we just take a ghillie blanket and we sort of drape it all the way around the thing, and we cut out the notches here. - Oh so you don't see the cabinet really at all? This looks really cool. - If we can get all the parts. - Yeah, can we actually do this, like this seems like this is, it's gonna take a while. Okay so this is starting to shape up, so what all have we missed the last 24 hours. - You've missed me getting covered in black paint. (laughing) Before we covered the whole thing in like that ghillie suit material, we're gonna be putting on some piping and ducting for the fog to come out and just generally looking steam punkie and cool. (train horn) - You gotta train in the background, that sounds very authentic to PUBG Mobile. - I actually really like trains, have I ever told you about that? - Yeah, tell me about trains Wes. - On my 26th birth... (beeping) - So the next thing is we're gonna be putting some of these all around, but if we have the fog machine up top, I'm thinking we'll put a 'T' in the back. But then we'll continue the piping over to the sides, and I thought maybe we could extend a couple ducts out, just to have a little extra flowing out, and put some flicker bulbs in there to make that sort of fire smoky effect. But, the other big challenge with this is you may notice, that this is a hole, and there's no hole here. So, how do you think you'd go about making that hole. - I got it. (punches cabinet) - Yeah, there you go, yeah you're the strong one here. (drill whirring) - Wow that sounds great. - Yeah its really dangerous, so you drill the pilot hole and then this think just starts boring in. - [Austin] Wait, what's this? - Oh, so I ordered a custom marquee for the top, you know black tape is black on one side, but you often forget it's white on the other, but that's okay this is just sort of a proof of concept, and what's really cool, do you want a preview of the ghillie suit? - [Austin] Oh yeah. - It's actually not a ghillie suit, it's a ghillie blanket. So this is a five foot by nine foot mossy forest ghillie blanket that we're gonna cover the entire thing with. We just sort of do a little something like this. Oh yeah, you can start to see the general idea of what's going on here. - [Austin] I mean obviously work in progress, but I feel like having the marquee really sort of sells it as an arcade cabinet especially when you light this up. I like how this just covers, we don't have to deal with anything inside. Don't worry about it it's fine. - This is the best cheat ever. (piano music) (drill whirring) - Is this how I film? Is that how I film? (piano music) (speaker blasting) - It's so bad. (laughing) (piano music) (door squeaks) - Oh! (laughing) What! Wes what have you done, oh my god it's so good. Look at the way that the smoke is coming down. - [Wes] Our custom marquee is all lit up. - [Austin] Yeah, yeah and the flickering does so much to add to it. - Yeah, right so the chiller inside is now loaded with a full four pounds of ice, and you can see its really making that nice \"cascadiness\", we have lights piping into each of the ducts on the side. - Dude! - The last bit I added at the very last moment, is a little bit of rust if you wanna take a peak there. - Oh my god. - We've got little specs of rust all around. - One cable and we're ready to play some PUBG Mobile. (game music) - Yeah, that's loud. There we go that simple. - And you're in, it's that simple. - Dude this is such a cool experience, like just sitting here, also its nice because the fog is like very cool. So we've got like some air conditioning action. So right now I'm playing on a OnePlus 8 Pro, and there's literally its as if there's no latency at all, like as soon as I move on the screen, the arcade cabinet is just immediately showing up. (gun fire) It adds so much to the ambiance to hear the fog machine churning as I'm playing the game. (gun fire) There we go, if this was a real arcade game, I would dump so many quarters into it, I would just be sitting here playing all day long. Ah, whoa, wait for me, wait for me. If somehow you've never heard of PUBG Mobile, it is only one of the most popular games in the world, with over 700 million downloads. It's of course a free to play mobile game where you and your friends can parachute in on a 100 player \"battle royale\", see exactly who will be victorious, and believe it when I say it won't be me even though I have the super cool arcade cabinet. And of course Royale Pass 13 has just come out, Wes what's in Royale Pass 13? - Well it has a toy themed season with Carton Rangers. - Wow. - Yeah. - It's pretty exciting. PUBG Mobile also has the new cheer park where you can hang out with your friends, check their stats, and even roast a chicken together. Now well yes this might be my new favorite way of playing PUBG Mobile, but the best part of the game is that you can get pretty much this exact same experience minus the smoke and the lights on your phone that you can play anywhere anytime. So of course huge shout out to PUBG Mobile for not only sponsoring this video but sponsoring this ridiculous, ridiculous cabinet. So of course check out the link in the description to download PUBG Mobile, and we might build more of these things. We're not gonna do that. 1 of 1 my friends 1 of 1.",
    "transcript_keywords": [
        "PUBG Mobile",
        "PUBG Mobile reached",
        "Yeah",
        "PUBG",
        "Mobile",
        "sort",
        "arcade cabinet",
        "playing PUBG Mobile",
        "cabinet",
        "ghillie",
        "game",
        "arcade",
        "wanted to sponsor",
        "Mobile reached",
        "download PUBG Mobile",
        "smoke",
        "fog",
        "cool",
        "ghillie suit",
        "side"
    ],
    "transcript_entity_values": [
        "100",
        "a five foot by nine foot",
        "over 700 million",
        "the last 24 hours",
        "USB-C's",
        "a full four pounds",
        "Austin",
        "Royale Pass 13",
        "1",
        "OnePlus 8 Pro",
        "26th",
        "a mile",
        "one",
        "second",
        "Carton Rangers",
        "a ton",
        "only one",
        "One",
        "Wes",
        "today",
        "PUBG Mobile",
        "13",
        "PUBG Mobile",
        "just a few days",
        "Micro Center"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "ORG"
    ]
}