{
    "id": "TIo7-3y80hg",
    "title": "The Best Tech Under $100 - January 2017!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-01-05T01:45:48Z",
    "video_url": "https://www.youtube.com/watch?v=TIo7-3y80hg",
    "category": "Science & Technology",
    "tags": [
        "Best Tech Under $100",
        "Best Tech Under 100",
        "Best Tech Under 100 dollars",
        "Tech Under 100",
        "Tech Under $50",
        "Best Tech Under $50",
        "top 5 tech",
        "cool tech under 100",
        "top tech gifts",
        "cool tech under 50",
        "top tech gadgets 2016",
        "top tech under 100",
        "tech",
        "tech under 50 dollars",
        "best tech",
        "cheap",
        "tech under 50",
        "tech deals",
        "technology",
        "best",
        "gadgets",
        "top tech",
        "best tech 2016",
        "cool tech",
        "2016",
        "deals",
        "jonathan morrison",
        "tld",
        "(つ▀¯▀)つ"
    ],
    "views": 617180,
    "likes": 16763,
    "comments_count": 675,
    "description": "More Tech & Gadgets Under $50!  Check out the Philips Hue Go!  Say what's up on the Philips Videos I got to do!    SHIRTS ARE HERE! :D  Why my eye is jacked up lol   Logitech MX Master (original):  Stone:  Navy:  Philips Hue Go:  Cant recommend this Circle LED Lamp:  Original Circle LED Lamp:  Chromecast Ultra:  HooToo Shuttle USB-C Hub:  iHome Smart Plug:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://www.youtube.com/watch?v=0xKSzEhOhV4",
        "http://www2.meethue.com/en-us/productdetail/philips-hue-go",
        "https://www.youtube.com/watch?v=QJt7PfUfgt8",
        "http://www.s2apparel.com",
        "https://www.youtube.com/watch?v=xshYJVm6qFY",
        "http://amzn.to/2iMhwXf",
        "http://amzn.to/2j1r53I",
        "http://amzn.to/2hMTOID",
        "http://amzn.to/2i7h7Od",
        "http://amzn.to/2j1va8h",
        "http://amzn.to/2c4LIMV",
        "http://www.bestbuy.com/site/google-chromecast-ultra-black/5578628.p?skuId=5578628",
        "http://amzn.to/2hMOyEM",
        "http://amzn.to/2j1xWtT",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo guys, Jonathan here. We're kicking off 2017 with a fresh episode of the Best Tech Under 100 Bucks, and first up is a revisit of sorts, the Logitech MX Master. Now the MX Master isn't new by any means but I was browsing Amazon, and said \"Holy crap, \"there are two brand new colors; navy and stone.\" So with there being new colors of course, I immediately purchased them, and after getting them in and comparing them side-by-side, I would definitely say stone is my favorite out of the two, simply because you don't normally see mice this color. Now recently Dream Desk 4, that's what actually got me to switch back to the MX Master because my initial experience with this mouse, right when it came out was really bad; the connection issues, the headache kinda outweighed the usefulness of it. But this time around those problems were gone and it's been nothing but a really pleasant experience. And what I love specifically about this mouse is the side-to-side actions so in Final Cut Pro, for example, be able to navigate through the timeline left-to-right and right-to-left is immensely helpful. You combine that with the fact that it's super-customizable, really comfortable, and that is why it is currently my favorite mouse out there right now. And the fact that there are two new colors makes it even better. Now recently I got an awesome opportunity to actually shoot some commercials for Philips and thanks to that, they were awesome enough to sponsor this video and with that, next up is the Philips Hue Go. What these are essentially are portable Philips Hue that you can place pretty much anywhere you want. If you haven't noticed yet, that is actually what is giving me that splash of color back here and what's especially nice about these is the fact that they're battery powered and rechargeable, which means you're not tied to an outlet. So you can move them, you can take them outside, you really have a lot of flexibility. Just like any of the Philips Hue stuff, you have instant control over this through the color, through the brightness, if I wanna dim it, brighten it back up, or maybe change the color I am doing that on the fly, little bit of red, pink, maybe a little bit of orange and I think we're gonna go back to blue. What's also kinda cool is these work standalone as well so if I have Ralphy grab one of the Hue Gos, he can actually navigate and change the colors by clicking through them. That's gonna shuffle through some pre-selected scenes, brightness and colors. You do, of course, get the most control through the app but if you're outside, or if you don't have your phone near you, this is a cool way to switch it up and mix things up. So if you've recently got into the Philips Hue game, you know it's extremely addicting and these are no different. The portability, the flexibility is awesome. And I apologize in advance to your wallet because these are the next things you're gonna wanna buy. And next I'm gonna change things up a bit. Normally when you watch a Best Tech Under 100, Under 50 Bucks, you only see the tech that makes the cut but what actually happens is I'll go down these deep Amazon rabbit holes and order 10, 15, 20 pieces of tech under that certain price point and actually test them out to see which ones are worthy. Recently you guys have seen the circle LED lamp in a ton of my videos. I even went as far as putting it in the Tech Under 50 Hall of Fame. So when I saw they had a standing tall lamp version of this, I was super excited. Now as much as I love this guy behind me, it was kind of the opposite experience with the standing version because for 90 bucks the build quality is kind of bad. I really, really wanted to like this thing but I just cannot justify it for the price so if you're looking for a circle LED light, stick to the original right there. Now jumping back to the tech that actually made the cut, next up is the Google Chromecast Ultra. And I'm sure by now everyone knows what a Chromecast is. This does everything that did but that Ultra gets you 4K and HDR. Now, obviously, if you don't have a 4K TV do not buy this because it's not gonna magically make your 720p TV output 4K. If you do have one, however, this is a really great, relatively inexpensive option to enjoy 4K content. Now, yes I know, most 4K TVs out there do have some sort of smart capabilities but the convenience with this is the fact that you have control with your phone, whether you're watching YouTube, Netflix, Hulu, there is a ton of apps that support this now. So with that, if you're looking to step up your pixel game, the Google Chromecast Ultra is a fantastic choice. Now recently in the latest episode of the Best Tech Under 50, I showcased the TP Link Smart Outlet which worked really well with the Amazon Echo and I got a ton of questions asking \"Does it work with Apple HomeKit?\" The short answer is no, it doesn't. So with that I thought I would showcase one that does, this is the iHome Smartplug. So even though this is the Best Tech Under 100 Bucks, this is actually around 50 and personally I bought mine at Best Buy but if you pick yours up on Amazon, it actually comes with a free wireless remote that you can use in addition to your voice and to your phone. Not sure exactly how useful that is to most people out there but something free is something free. And again, really the main purpose with this is to have control over something plugged into your outlet that you control with your phone, or in this case with your voice through Siri. Hey Siri. (Siri bleeps) Turn the living room off. (Siri bleeps) - OK, they are off. - The set up was simple, it was quick, and more importantly, this is an extremely versatile smart plug because on top of working with Apple HomeKit, it also works with Amazon Alexa and Samsung SmartThings. Last up is the HooToo Shuttle which is a USB Type-C hub that works really well with the new MacBook Pros and is personally what I am using. This specific one here is space grey but it also comes in silver and rose gold so, in addition to the 15 inch MacBook Pros that just came out, it also works really well with the 12 inch models. In addition to three USB-A ports, you're also getting an HDMI, an SD card slot, and on top of that there's also a USB-C port that supports charging. Really, for me though, I only truly use this for an SD card reader because luckily, for the most part, all my peripherals I've been able to find USB-C cables. But just in case I'm ever in a pinch, having those extra ports and even HDMI is a super nice touch. I've had it pretty much ever since the new MacBook Pros came out so so far it's been reliable, it hasn't gone out. And overall if you're looking for a well-built, good looking USB-C hub that's gonna give you SD card slot, USB-A, and HDMI, you can not go wrong with the HooToo Shuttle. Aside from that hopefully you've enjoyed the video. If you did and you are feeling like being awesome, make sure to smash that like button. Links to everything I talked about are down below. And yes, my eye is still a little jacked up, if you have no idea why you can check out that video here or down below. This is Jonathan and I will catch you guys later.",
    "transcript_keywords": [
        "Philips Hue",
        "Tech",
        "Google Chromecast Ultra",
        "Logitech MX Master",
        "Philips",
        "Hue",
        "Philips Hue game",
        "Master",
        "Amazon",
        "portable Philips Hue",
        "Philips Hue stuff",
        "colors",
        "recently Dream Desk",
        "Chromecast Ultra",
        "MacBook Pros",
        "color",
        "Google Chromecast",
        "back",
        "Final Cut Pro",
        "Bucks"
    ],
    "transcript_entity_values": [
        "two",
        "Apple HomeKit",
        "2017",
        "100",
        "around 50",
        "Siri",
        "100 Bucks",
        "the iHome Smartplug",
        "the HooToo Shuttle",
        "Final Cut Pro",
        "10, 15",
        "Chromecast",
        "Hulu",
        "the Philips Hue Go",
        "the Amazon Echo",
        "MX",
        "Alexa",
        "MacBook Pros",
        "SD",
        "Samsung SmartThings",
        "Tech",
        "the TP Link Smart Outlet",
        "4",
        "20",
        "the Best Tech",
        "K TV",
        "USB",
        "the Google Chromecast Ultra",
        "Netflix",
        "a ton",
        "50",
        "the Philips Hue",
        "the Hue Gos",
        "15 inch",
        "Ralphy",
        "three",
        "first",
        "12 inch",
        "Amazon",
        "Dream Desk 4",
        "Philips Hue",
        "USB-A",
        "Logitech",
        "Philips",
        "YouTube",
        "90 bucks",
        "MacBook Pros",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "PRODUCT",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "FAC",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "PERSON"
    ]
}