{
    "id": "Tkzeu4Y5RAc",
    "title": "World's Smallest 3D Printing Pen",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-06-10T16:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=Tkzeu4Y5RAc",
    "category": "Science & Technology",
    "tags": [
        "3d pen",
        "3d",
        "pen",
        "printing",
        "3d printing pen",
        "lix",
        "lix pen",
        "tech",
        "technology",
        "unbox therapy",
        "unboxtherapy",
        "gadget",
        "gadgets",
        "lix 3d pen",
        "best 3d pen",
        "review",
        "unboxing",
        "3doodler",
        "new",
        "3d printing",
        "iphone",
        "best",
        "3d printer",
        "smartphone",
        "apple",
        "android",
        "test",
        "iphone 7",
        "phone",
        "art",
        "3doodler 2.0",
        "futuristic",
        "pla",
        "wireless",
        "invention",
        "top",
        "diy",
        "apple inc. (publisher)",
        "apple iphone",
        "samsung",
        "iphone 6",
        "iphone 6s",
        "vs",
        "galaxy",
        "6s",
        "plus",
        "s7",
        "iphone 6s plus",
        "galaxy s7",
        "apple iphone 6s",
        "edge",
        "android (operating system)"
    ],
    "views": 3871283,
    "likes": 52777,
    "comments_count": 2030,
    "description": "Video you may have missed -   Here's a cool gadget that prints in 3D. Unlike other 3D printing pens on the market the Lix is similar in size to a standard pen.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/-K4utUrwjUM?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys, Lew here back with another video and today I've got something that happens to be the worlds smallest this is the world's smallest 3D printing pen this thing here, will allow you to draw three dimensional objects See how I'm doing that there As the material comes out of the pen tip. It hardens in real time. It's very unusual to experience Let's crack it open. Wooh That is pretty slick Look at that its kinda got like a military vibe to it. Like a tactical pen This is cool like some designs to get you started here. Hahaha That's a little elaborate Probably not going to start there. So this is ABS black filament. These little strips are what become the eventual Structural component of your 3D object Some color ones So it looks like standard USB on one end, power connector on the other. This plugs into the back. Of the pen right there. Lets get this baby booted up. And see what I can create. The filament it goes in, I don't know if you can see that there Jack. That little channel there. Lets start out with a Black filament, it goes right in here. Wow 200 degrees Celsius, the bottom gets, do not touch the tip. Ho-ly We got one LED. One so I guess I gotta wait. A minute You can also adjust the rate of extrusion, I don't know if its better for me, probably slow. Oh we got something coming out! Yes, much better now. Not really, probably not doing this right. Definitely not doing this right. Going for it anyways You have to really make an effort to stick it to the page Look at that! I like how loading this one up, is pretty straight forward Were going to try and make, like pyramid points At each intersection here See if I can do this Theres my, uhh, nnehh Structure? of some kind. *giggles* Look at that thing! 3D, Doing it all. Lets get some colors going on here For the ability for that thing to stay up right,as you are drawing it Where is the point of failure Woahah Its like a plant! Theres a much more organic feeling to this like this is like some kind of lifeform. Its like mimicking like some kind of natural thing This one gets hot It is hot to the touch Obviously, you can now appreciate how artistic I am What's interesting is once you go to the next color you usually-- that next color is what pushes down the remainder of the last color you were using I think the most amazing thing to me about this material is how strong it is Somehow all of my 3D pen creations end up looking like something out of a Tim Burton movie We're gonna need-- OH I SNAPPED IT Good as new Unboxed therapy just turned into art class It's what you'r in now, Welcome to Art Class- Therapy There ya go-- its Tim Burton's CNty- OH NO. Nooooo Who knows what my future holds? Obviously you can tell I'm an architect One of these people that you can imagine prototyping the next masterpiece using one of these You should definitely try it out, it's a really... unique experience, drawing in 3D",
    "transcript_keywords": [
        "worlds smallest",
        "video and today",
        "draw three dimensional",
        "smallest",
        "Lew here back",
        "Lew",
        "printing pen",
        "pen",
        "dimensional objects",
        "thing",
        "Tim Burton",
        "worlds",
        "world",
        "kind",
        "color",
        "ABS black filament",
        "black filament",
        "guys",
        "art class",
        "filament"
    ],
    "transcript_entity_values": [
        "Tim Burton",
        "Wooh",
        "One",
        "Lew",
        "USB",
        "three",
        "Woahah",
        "ya go--",
        "Tim Burton's",
        "Jack",
        "Ho-ly",
        "one",
        "200 degrees Celsius"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "QUANTITY"
    ]
}