{
    "id": "TLbvZUnY22E",
    "title": "Smart Home Setups - Nest IQ Security Camera!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-07-30T18:38:31Z",
    "video_url": "https://www.youtube.com/watch?v=TLbvZUnY22E",
    "category": "Science & Technology",
    "tags": [
        "Smart Home",
        "smart house",
        "best smart home tech",
        "smart home automation",
        "smart home technology",
        "best smart home setup",
        "best smart home products",
        "best smart home devices",
        "home automation",
        "tech",
        "best smart home",
        "Nest",
        "Nest IQ",
        "Nest IQ Review",
        "smart home devices",
        "philips hue",
        "setup tour",
        "smart home tech",
        "home automation system",
        "jonathan morrison",
        "smart home 2016",
        "hue",
        "google home",
        "review"
    ],
    "views": 423741,
    "likes": 7117,
    "comments_count": 567,
    "description": "Thanks to Nest for partnering with me on this project! Check out the Nest Cam IQ:  The Best Smart Home Tech + Automation! Why I'm Excited for the Galaxy Note 8!   Nest IQ Giveaway!  Google Wi-Fi -  The Best Tech Under $500!   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://goo.gl/e7Tfkv",
        "https://youtu.be/FAJwbluAxcg",
        "https://gleam.io/SE5sP/nest-iq-giveaway",
        "http://amzn.to/2uOaRSB",
        "https://youtu.be/rYbNu8ivZzo",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Over the past few weeks you may have noticed a new shooting set up. If you did you are correct. And the reason for that is I moved. Now with that I kind of have this blank canvas in front of me to build out my dream smart home set up. And I thought it'd be cool to document the process and take you along for the ride. So part two is going to be all about the TV, all about the audio. Super excited for LG 65 inch 4K OLED and potentially even more excited for a pair of speakers coming in from Focal that has me drooling just thinking about them. Today though part one is going to be the foundation, the groundwork, Internet WiFi security and because of that I reached out to nest and asked if they'd be down to send out a couple of their brand-new NEst IQ cameras. They said, \"Yes.\" I said, \"You are awesome.\" So huge shout out to them for sponsoring episode one. You also know what that means so for your chance to win a Nest IQ of your own details are down below. And if you're down with that let me know by dropping a like. As far as the Internet goes it's kind of been a little bit of a roller coaster. Initially I was trying to get Frontier AKA used to be Verizon they hold the key to Fios. It wasn't going to be anything crazy about a hundred up hundred down and I'm sure I'm going to hear about some of your insane Internet speeds in the comments section below. But ultimately after going back and forth for two weeks I found out there were no open ports and I would essentially have to go on a waiting list and who knows how long that would have taken. So ultimately what I ended up doing was going with Spectrum who weren't quite as tasty on the upload speeds. We're looking a hundred down and 10 up which does make me slightly sad just thinking of that hundred up within arm's reach. But ultimately after feeling like a caveman for two weeks without Internet I am just happy to be connected. Now as far as WiFi I went with Google WiFi which comes in a pack of three. The reason for that is the layout of the house is three stories. Technically though the first story is just the hallway and extra calories burned to get to the living room. Because that the router lives on the second story I wanted to make sure there were strong consistent WiFi upstairs and throughout the house. Google WiFi works as a mesh network with different access points to give you that solid consistent signal. There's a few different brands that make very similar things but for me Google WiFi has worked perfectly and I have zero complaints. Popping over to the Nest IQ though this is where things get really cool. And if you're founded tech this is one of the coolest gadgets you can put in your house. Now what makes my geek heart happy is inside the Nest IQ is a super crispy 4K sensor. You pair that with the 130 degree wide angle lens night-vision HDR and that is a killer combination. The way the 4K sensor works though is actually kind of genius. It's not outputting 4K because one that would eat up extra bandwidth and two would be harder on your system to stream smoothly. But rather, it's very similar to shooting a video in a 4K and then output it into a (mumbling) You have to go to punch in crop and overall everything is just extra sharp. What takes that one step above and beyond though is when the hardware works with the software. So Nest is actually smart enough to decipher the difference between just motion and a human being and when it spots a human it will actually lock onto them crop in and follow the movement which is crazy. What's cool though is because of the software base if you're looking back at old footage and it's locked in and following that person you still have the ability to zoom out and see the entire field of view. Now full disclosure, as you know, Nest was awesome enough to sponsor my home setup. But no joke, because they work so well, I got a couple more for the office. In addition to the security they have also become the ultimate behind the scenes camera. Now speaking of software, one of the craziest features on Nest IQ is face recognition. And it works really good. So the way it works is when Nest IQ sees a face it doesn't recognize it instantly sends you a notification saying, hey, there's an unfamiliar face in your spot. From there you can kind of then create a database of whose face is who's and then from now on it will let you know when that person enters the room. I do wish there was an ability to turn off familiar faces and then only receive notifications for unfamiliar faces. I did reach out to Nest and they are working that potentially in the future which is good news. But either way it works lightning fast. To demo that over here in the office I added my face, I added Rich's face. I am going to call Ralphy to come over in a real time you're going to see how fast it works. - [Ralphy] Hello. - Hey what you're doing? Come to me and Rich. - [Ralphy] Okay. - Ralphy just entered the room. Take a few steps this way. Look up there. Your cameras spotted if someone it doesn't recognize. - What's up? What's up? - Look man. - Where, I don't see it. How am I supposed to see myself if I'm over here? - Look at that mean mug. Hold on hold on hold on. (laughing) - That's very good man. Yeah. I got you. That's a clean face right there man. - Do you know this person? Uh. Yes. Yes. Hey, just sent me a notification for a familiar face Ralphy which also comes through on an Apple watch. So there was kind of a real-world example of not only how quickly it works but also how well it works. Immediately when Ralphy came in it had no idea who he was and it let me know that. But as soon as I added his face it instantly knew who he was. Beyond that what's also cool is you can now talk and listen through the Nest IQ. So I'm gonna send Rich over to the Nest IQ right now. Hey, it sees you. Rich. - Whoa. - Don't break yourself. So as you're looking at this Nest footage hopefully Rich isn't making it too shaky. But not only can you see the wide-angle view but you can also see how to adjust on the fly. Night vision works extremely well to the point where things can be pitch-black in the room and you can no joke see everything. Now because Nest IQ is plugged in at all times you essentially have 24/7 live streaming that you can access at any given moment. Now if you want to archive that footage you have two subscription options which we either go back the last 10 days or all the way up to the last 30. And details on that are down below. All in all though I think the Nest IQ is the result of one great hardware meets great software because both ends of the spectrum are equally satisfying. If you've been looking for a smart home camera and you want the latest cutting-edge tech the Nest IQ is an awesome choice. This is Jonathan, and I will catch you guys later.",
    "transcript_keywords": [
        "nest",
        "works",
        "face",
        "Internet",
        "Rich",
        "Google WiFi",
        "WiFi",
        "kind",
        "Ralphy",
        "Google WiFi works",
        "hundred",
        "cool",
        "hold",
        "Nest footage",
        "Google",
        "hey",
        "software",
        "room",
        "Internet WiFi",
        "brandnew NEst"
    ],
    "transcript_entity_values": [
        "a hundred",
        "two",
        "the past few weeks",
        "Rich",
        "the last 30",
        "Focal",
        "LG",
        "Today",
        "Fios",
        "10",
        "Frontier",
        "about a hundred up hundred",
        "4",
        "two weeks",
        "zero",
        "130 degree",
        "that hundred",
        "Spectrum",
        "Apple",
        "Nest IQ",
        "NEst IQ",
        "Google WiFi",
        "Ralphy",
        "Nest IQ",
        "second",
        "three",
        "first",
        "Nest",
        "one",
        "the Nest IQ",
        "the last 10 days",
        "Verizon",
        "the Nest IQ",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "PERSON"
    ]
}