{
    "id": "TLm7Q92xMjQ",
    "title": "The simple, clever sensor behind automatic windshield wipers",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2024-04-29T15:27:44Z",
    "video_url": "https://www.youtube.com/watch?v=TLm7Q92xMjQ",
    "category": "Science & Technology",
    "tags": [],
    "views": 1352897,
    "likes": 65502,
    "comments_count": 3890,
    "description": "When it's wet it wipes.  Links 'n' stuff:  The video I just did on stovetops:   Technology Connections on Mastodon:   Technology Connections on Bluesky:   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!",
    "description_links": [
        "https://youtu.be/ff04ecF9Dfw",
        "https://mas.to/@TechConnectify",
        "https://bsky.app/profile/techconnectify.bsky.social",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "[ambient noise] My car knows when its wet. Thats right,its got automatic windshield wipers. When theyre set to automatic, and the cargets wet, they wipe. How it know that? Its actually really simple. If you lookat the windshield, youll notice an area near the top center which is black. And if youlook closelier youll see the component the car uses to determine windshield wetness. Oh, thecamera? No, it's not the camera - thatd be silly! Then youd have to devote some precious clockcycles away from the already wildly complicatedcomputer vision tasks which help keep the carcentered in its lane. That seems like a weird decision and I dont even know how well thatcould possibly work no matter how many software updates you throw at it. No, Im not alluding to anythingspecific, why on Earth would you think that? Right above that camera which looks forward at theroad youll see a little circular spot with some spots within the spot and that, viewers, is therain sensor. Look, I get it wet - and the car wipes! But two can play at that game. You maythink this is wildly complicated and expensive technology but actually its just two of thesimplest electronic components you can imagine working together in a very clever way. Below thedark portions of the rain sensor are infrared LEDs shining light up into the glass, and adjacentto them are photodiodes which detect that light. Now, that bright spot at the bottom? Thatsnot actually part of the rain sensor. Its an ambient light sensor used to control thecars headlights automatically. The two components just live in the same assembly. The parts thatmake up the rain sensor arent really visible because theyre below a filter which blocksvisible light and thus it appears black to our eyes. Thats strange, didnt we just encounter that withstovetops? Weird connections happening lately. To demonstrate how that detects rain, Illuse a piece of glass and a laser pointer. If I shine the laser up at the glass at about a45 degree angle, youll notice that a spot of laser light is reflected back down towards the table. Ill put a piece of paper there to make it more visible. Now watch what happens when I get theglass wet. Not a whole lot. Thats a bummer. Ah, but this isnt actually an accuratedemonstration of the principles involved in the rain sensor. Rather than look at thelight reflected back downward by the glass, lets look at the spot produced above the glass by the laser light which makes it through. Now watch closely. Did you see that? It moved. That happenedbecause the water on top of the glass changed the angle of refraction as light left the glass. Now,like some politicians, Im really not really good at the whole optics thing so Im not getting too deepinto the weeds here. But as light passes from one medium to another, its speed actually changes and because of reasons that means it appears to change direction. That concept is known asrefraction. And the refraction index of water is different from that of air. That means the changein speed and thus change in refraction angle is different between light passing from glass intoair and light passing from glass into water. The rain sensor, though, is entirely under theglass so its not as if it can directly detect that change. Instead, it leverages the effect oftotal internal reflection. If youve ever gone swimming in a pool with goggles on and lookedup at the surface of the water while submerged, you may have noticed that it looks likea mirror from shallow angles. Heres some stock footage to illustrate. Thatstotal internal reflection at work - the water directly above you transmits lightjust fine and you can see through it, but theres a critical angle at which the air-water interface will reflect all light back down and since its smooth likeglass, it looks like a mirror. So now - how can the rain sensor take advantageof that? Well, first, since the module isnt part of the glass, we need an optical interfacematerial to couple the sensor to the glass and remove the air-to-glass optical interface on the bottom. That takes the form of a sticky gel which, now that its in-place, you cant see. Which, really, is the point - when its doing its job, the sensor and the glass becomeone (from an optical perspective). Now the key is that the infrared LEDs thatwe talked about earlier are shining up at the glass just shallow of the critical angle oftotal internal reflection. So, all the light they produce will simply bounce off the top surface of the the glass andhead back downward. And, at the other end of that beam of light, is a photodiode. That will thendetect the light being generated by the LED. And to make sure its detecting that light andnot something else, the LEDs are actually rapidly blinking and the photodiode is looking for thatpattern of blinks. Thats a simpler way of saying the LEDs are producing a specific modulatedsignal that the photodiode is tuned to detect. But because the angle between the photodiode and the LED is so close to the critical angle of total internal reflection, if conditions should changethe intensity of that signal being received by the photodiode will also change. What condition? Condition wet. Water on the glass, as we saw in the earlier demo, changes the refraction anglebecause its refractive index is different from air. And it will change it just enough to breakthe effect of total internal reflection. Wet glass will allow some of the light produced by the LEDs to actually escape and be transmitted through to the outside surface. Which in turn means theresless light bouncing down to the photodiode to be detected, so the signal it was receivingbegins to diminish. And, with a little logic circuitry and programming, you can use that lossof signal as a measurement of windshield wetness. And honestly thats it! Its that simple. The sensor starts to see the signal from the LED drop out so it says to the windshieldwiper motor - wipe. And the wetter the glass, the more the signal drops, so the moreit wipes. And youll notice the sensor is deliberately placed in the path ofthe windshield wipers so they clear the glass with every wipe. That allows thelogic to get some sense of how hard it might be raining based on how quickly thesignal drops out after every wiping event. The only other complexity here iscalibration. Every time the sensor powers up, its got to pick a baseline signal level which it deems dry. Yet, if you are out and about in the rain and youturn your car on with the windshield already wet, its going to start out with some lower signallevel than typical. So, somebody smarter than me probably established a minimum signaldropout level which always causes a wipe, and in fact Im certain Ive encountered the car do a single wipe after turning it on when it didnt really need to. But then it can resetits calibration after that wiping event. And, theres another trick up its sleeve, and it'smy very favorite one: having two of them. There are actually two sensor assemblies under here. You can barely make out the infrared light in this smartphone camera footage. You'll see there's two spots. If the windshieldis dry, the two sensors should see very similar signals but if theres even just a tiny bit ofwater on top of one of them, or differing amounts between the two, then the two signals will bevery different and it will know immediately that the windshield is wet. Which calibrationmethod is it actually using? I do not know. And if youve never lived with a car withautomatic wipers, you may wish to know they are great but not exactly perfect. You are affordeda sensitivity adjustment on the wiper stalk, so you can fine-tune its behavior to yourliking. But while the wipers pretty much always come on when they need to, sometimes theygo absolutely nuts when its barely raining or they get a little lazy in a sudden downpour. Luckyfor me, if that happens all I have to do is just slap this stalk which is right next tomy hand on the steering wheel and the wipers will come on full-steam! Handy user interface,those stalks. Theyre always there and muscle memory takes over! Im pro-stalks,is what Im saying. Its a good idea. Whats less of a good idea, though, is theKonami-code like trick I had to look up just to change my cars wiper blades. The hoodblocks you from lifting the wiper arms so you need them to stop in the up position in order tochange them. and despite digging through all the settings menus I couldnt find a change wipersoption. So I tried just switching the car off with the wipers in the up position, y'know just time it right, using the powerbutton, but it outsmarted me and parked them anyway. It turns out what you have to do is turnthe car off and then hold the wiper stalk up in the mist position for a few moments and then thecar will do this. Is this procedure in the owners manual? Yes, but who looks there for information? I usually like to end my videos withsomething akin to a moral. In that vein, the first lesson today is for me and thatis to read the freaking manual! Theres even an index in here and finding the appropriate information would have taken me mere moments. People worked hard on this thingand I just completely ignored it! So dont ignore the manuals in your life. And the second moral is dont ignore what you can do with a few simple components. Software isnt everything. Thatsnot directed at any organization in particular, mind you. Just something to keep inmind. Did I get to 10 minutes yet? internally smooth jazz Thanks, by the way, to Jason, a supporteron Patreon, for recommending this video topic. That happened a long time agoand Im pretty certain at least one other person has suggested this in themeantime so if I forgot who you were, Im sorry. Theres just too manybimetallic strips getting in the way. Thats right, its got automaticthe thing didnt start. Youll notice that the spotof laser light is re oh. conditions should change, the intensityof a- Ooh, I needed a comma for my sake ...critical angle of total internal reflection [annoyance at outside noise] ...its got to pick a baselinesignal lever. Signal. Level. ...had to look, oh yeah I forgoohyeahIgottagetthething! You mean to say all you need is an LED, a photodiode, and a bit of adhesive to take the task of detecting rain away from a sophisticated computer vision system? And that this was a technology available back in the nineties? That sounds unpossible, I mean if there were a better way to do things, surely it would only come from the halls of one particular company and not anyone else. This section is usually for puns but today I chose vicious sarcasm. Not directed at any particular organization, of course :)",
    "transcript_keywords": [
        "light",
        "glass",
        "rain sensor",
        "sensor",
        "rain",
        "internal reflection",
        "angle",
        "laser light",
        "car",
        "wet",
        "signal",
        "LEDs",
        "photodiode",
        "windshield",
        "wipers",
        "critical angle",
        "LED",
        "internal",
        "water",
        "reflection"
    ],
    "transcript_entity_values": [
        "the nineties",
        "two",
        "at least one",
        "theroad",
        "tomy",
        "a few moments",
        "Jason",
        "Illuse",
        "powerbutton",
        "second",
        "first",
        "one",
        "10 minutes",
        "Thatsnot",
        "theKonami",
        "Earth",
        "Patreon",
        "today"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "NORP",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "PERSON",
        "PERSON",
        "LOC",
        "ORG",
        "DATE"
    ]
}