{
    "id": "tm4gWS2TWg4",
    "title": "Buy this instead of a Pixel 5! - Samsung S20 FE",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-10-06T19:15:19Z",
    "video_url": "https://www.youtube.com/watch?v=tm4gWS2TWg4",
    "category": "Science & Technology",
    "tags": [
        "Samsung",
        "S20",
        "Fan Edition",
        "5G",
        "Camera",
        "Display",
        "OLED",
        "Selfie",
        "3 Cameras",
        "Riley",
        "Unboxing",
        "Smartphone",
        "Mobile",
        "First Impressions",
        "FE"
    ],
    "views": 673350,
    "likes": 30098,
    "comments_count": 2714,
    "description": "Samsung added a new version of the S20, the Fan Edition. This phone is actually pretty surprising as it's not just a simple variation and it's $699!  Check out our merch as there might be something cool coming out tomorrow at   Buy Samsung S20 FE On Samsung (Paid Link):  On Amazon (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):  On BestBuy (Paid Link):   Buy Samsung S20 5G On Samsung (Paid Link):  On Best Buy (Paid Link):  On Amazon (Paid Link):   On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy MSI GS66 On Best Buy (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lttstore.com",
        "https://shop-links.co/1725432024318611548",
        "https://geni.us/Vxtf",
        "https://geni.us/Yyr1",
        "https://geni.us/WL6xIE",
        "https://geni.us/jRJOgyh",
        "https://shop-links.co/1725432025644529386",
        "https://shop-links.co/1725432026031943903",
        "https://geni.us/A6nUgoa",
        "https://geni.us/Oacvp",
        "https://geni.us/OVFN",
        "https://shop-links.co/1725432026909502291",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- One question, Samsung, just how many Galaxy S20s do you need? (scoffs) Like, what is this? The eight or something? Remember when we used to release phones and it was just like the galaxy S2. And that was it. Now we've added not only a zero, but also a zero 5G, but then we've also got S20 plus 5G, we've got the S20 5G, there's also vanilla non 5G versions of these phones. There's the S20 Ultra, there's the S20 Ultra 5G. I'm getting upset (fire rumbling) But I really shouldn't be upset about this phone because it's really something that everyone should be happy about everywhere because they essentially, what Samsung has done is they took one of the greatest flagships, Android flagships of this year, and basically kept all the really good stuff, took out the stuff that you don't really care about, most people and reduce the price and boom, it's called the Fan Edition because that's what fans really want. I would think that fans want the fancy stuff. No. This is some cool packaging. I prefer this kinda packaging to just like the black, featureless on the, like void on the S20. Yeah, I like this packaging. It's fun. And I think that's kinda the idea behind this phone. It's like fun, there's a bunch of new colors, they're trying to target the youth, the cool people, they had a whole like live stream. The whole unpack thing was with Millie Bobby Brown, and she's dancing around with the different colors and \"Ow! I'm having such a fun time. I'm a young person.\" That's beautiful. I can't wait to unlock it after the sponsor, which is lttstore.com. That's right. We got shirts, we got water bottles, sweatpants. Sweat things to catch your sweat. Anything, anything for you, sweat on lttstore.com. Get sweaty. Hashtag get sweaty. Okay. Let's let's check it out. Actually wait, before we actually like play with the phone, we gotta find out what's in the box. What's in the box! There's nothing in- There's nothing. Oh, okay. (laughs) I expected there to be papers, but there's no papers. There's just a SIM removal tool. There's the phone. We'll look at. Ooh, we got the navy version looks like, but we'll take a look at that in a second. Wall charger. I think it's 25 Watts and a USB type A to type C charging cable. Nice. That's what you call an unboxing. I don't know if you've ever seen that before. That's what we do here. Okay. The phone itself. Very nice. Oh, we gotta peal some stuff off first. (indistinct chattering) I think Linus was talking during (mumbles) completely. (indistinct chattering) The big deal with this phone is that it is, supposed to be available for 699, whereas the normal galaxy S20 is available for 999. Okay. So that's like a $300 difference. That's pretty good as we'll see, because this phone is in many ways, completely identical to the galaxy S20 in all the places that matter. It's got a Snapdragon 865, depending on the version that North American and I think East Asian, whereas the rest of the world has to deal with the Exynos 990. It's got six gigs of Ram, which is a little less than the S20 I think you can get eight gigs and 12 gigs versions of that. But six gigs is fine. It's got 120 Hertz screen, which is the big deal. Very smooth, very nice. There are some concessions that Samsung made to make this, a little to take the price off. They had to do it somewhere. And one of the big things is the back. So this is not glass, it's apparently what Samsung is calling, \"Glasstic.\" (chuckles) But it also feels real nice. I mean, like I'm one of these guys that don't really care whether the phone is glass or not. If it's got plastic, like who cares? I'm gonna put a case on there anyways. So one of the big things that they are talking about in regards to the S20 FE is the colors. It comes in six colors because the fans, that's also something the fans want is lots of colors on their phones. So this comes in cloud mint, cloud navy, which I guess we have right here, cloud lavender (chuckles) cloud red, cloud origin, cloud white, they're all cloud. Why do they bother putting the cloud in front of it? At that point is my question. In terms of cameras, I think we got a slightly worse set of rear cameras where there's still the 12 megapixel standard camera. There's a eight megapixel telephoto, whereas the S20 has a 64 megapixel telephoto. So you're getting a little bit more detailed when you zoom all the way in like that. And there's a 12 megapixel ultra wide on both of them. So it's not that different. I mean, you're gonna be able to not zoom in so much. But let's see. Can I zoom in on Hoffmann? Zoom way in on Hoffmann. Hi? - Hi. - You're gonna waiver. The more interesting bit about the cameras is that the selfie cam is actually higher quality on on the Fan Edition. This is a 32 megapixel selfie cam compared to a 10 megapixel on the S20. And we're seeing that in a couple of other places as well. The battery is also larger here, 4,500mAh battery compared to 4,000mAh power on the S20. And it doesn't stop there either. Let's grab the S20. It's actually a bigger screen. It's a bigger screen Hoffmann! (laughs) So this is actually where I started to get confused in terms of the value proposition here, because what kind of person is gonna go and drop a thousand bucks on the S20 5G, instead of dropping $300 or $400 less for the S20 Fan Edition 5G. What are you getting for that extra money? You got a higher resolution screen, 3200 by 1440 compared to the 2400 by 1080 in this one. But I would argue that you're not gonna really notice that much of a difference unless you're- There's also a smaller screen. So you've got higher resolution on a smaller screen. So it's like, you're gonna have your phone up like this, like, \"Wow, that looks great.\" (laughs) You got the 120 Hertz screen on both. You got a little bit more protection on the S20 5G because this is Gorilla Glass 6, as opposed to Gorilla Glass 3 on the Fan Edition. And the S20 also has HDR10+. You can also record 8K video on this one, as opposed to just 4K video on this one. But when it comes to the most important things, this is what's so confusing to me, IP 68, completely waterproof, larger battery, same type of fast charging, 25 watt, fast charging, 15 watt wireless charging, 4.5 watt wireless power share. So you can charge other phones. They both have under display fingerprint readers although the Fan Edition is optical as opposed to the Ultrasonic on the S20 5G. And beyond that, I mean like that's really, that's all it boils down to. So I guess what I should be doing is instead of being kind of just like confused and like asking what the deal is here, I should just be like, \"Thank you, Samsung. This was a great idea.\" Apparently Samsung is planning to make Fan Edition for all their flagship phones going forward. Like they're gonna release the big phone and then they're gonna kinda pair the specs down a little bit to something more reasonable and then release a Fan Edition of it. Whoops, not founder's edition, Fan Edition. I guess, for like the people who still want that Samsung phone and who aren't content to like pick up a 349 pixel foray or something. That's basically just got the bare bones, like it's got a pretty good camera, but other than that, it doesn't have the greatest specs or whatever. If you still want a Samsung phone, this is an incredible value proposition. Hoffmann? - Ow. - Say good gravy man. - Good gravy man. (chuckles) - Look at that guy. He's beautiful. Where is he? There he is. Always obscured. Oh, you can see a little bit more processing on Jono on the S20 5G. A little bit more sharpness added. Hoffmann looks about the same. The takeaway is that it's a fine camera, although we should check the selfie camera because this is, as I said, a 32 megapixel version versus the 10 megapixel on this one. (screams) Hmm, I don't know. My teeth are better in this one and they're a little yellow in this one. I don't know Jono. I like the colors in this one a little bit more. (laughs) This is my new profile picture. So there is a little bit more of a bezel. So that's something, I guess. There's a bit more of a premium look to the S20 5G. I mean, you don't have, you can't see the glass back on this one. Thanks D brand. But they're, most of the phones just have that glass back that you can see on the back. But this one has that plastic. I don't know guys. I think it's great. I wanna see more phones like this. For me, basically I look for the cheapest phone I can get that has like decent specs, but this one is also very impressive if you're like, \"Okay, I do like Samsung. I do want their...\" Their one UI is one of the best Android skins if you're not doing stock Android. If you're into Samsung phones and you loved the S20 but you're just like, \"It's just too expensive.\" It's got everything you want, Snapdragon 865, 120 Hertz screen, micro SD card support up to one terabyte, didn't say that. That's what I'm talking about, man. There's so many specs that are just like the same. - [Jono] Have you tried the speakers? (upbeat music) - Okay. That's the regular S20. Drop the beat. FE. (upbeat music) Hmm, might be a bit weaker. (upbeat music) Wait, wait, wait, wait, wait, wait till it comes in. (upbeat music) Oh! Jono. Good call. - [Jono] Yeah. (upbeat music) - Yeah, I think there's a bit fuller mids in the S20 5G. So that's something else. The high end and the low end seems to be pretty similar, but like kinda the middle part where it just kinda fills it out a little bit more. I think we're maybe it was maybe a little bit, a bit, bit better on the S20 5G. Okay, well, yeah, I'll play again. Guys who cares? Jono? You want me to buy this one instead? - [Jono] More money baby. (scoffs) - Whatever you're gonna be fine with 699, 599 FE 5G Fan Edition (laughs) So at the end of the day, whether you're a Samsung guy or a Motorola guy, the Samsung galaxy Fan Edition, S20 Fifth Generation is the one for you. Or is it? Maybe. Hey, that's a short circuit for you, everybody. Thanks for watching. If you wanna see more on boxings, then make sure you subscribe and comment. Do anything you want on YouTube. It's a website (laughs)",
    "transcript_keywords": [
        "Fan Edition",
        "Samsung",
        "Edition",
        "Fan",
        "bit",
        "phone",
        "Samsung galaxy Fan",
        "phones",
        "galaxy Fan Edition",
        "Samsung phone",
        "wait",
        "fans",
        "megapixel",
        "screen",
        "cloud",
        "make Fan Edition",
        "glass",
        "kind",
        "Hoffmann",
        "colors"
    ],
    "transcript_entity_values": [
        "a thousand bucks",
        "400",
        "Glasstic",
        "4,500mAh",
        "4,000mAh",
        "navy",
        "3",
        "Fan Edition",
        "Ultrasonic",
        "4.5 watt",
        "699",
        "599",
        "Hertz",
        "999",
        "One",
        "the Fan Edition",
        "Motorola",
        "8",
        "one",
        "4",
        "USB",
        "S20 Fan Edition",
        "S20",
        "Ram",
        "3200",
        "12 megapixel",
        "micro SD",
        "this year",
        "10 megapixel",
        "second",
        "S2",
        "15 watt",
        "Watts",
        "G Fan Edition",
        "North American",
        "YouTube",
        "FE",
        "32 megapixel",
        "the Fan Edition",
        "349",
        "Samsung",
        "Jono",
        "Millie Bobby Brown",
        "Hoffmann",
        "1440",
        "2400",
        "first",
        "East Asian",
        "120",
        "1080",
        "Android",
        "S20 Fifth Generation",
        "300",
        "25 watt",
        "Linus",
        "12",
        "the end of the day",
        "six",
        "the S20 FE",
        "64 megapixel",
        "eight",
        "eight megapixel",
        "5",
        "zero",
        "25",
        "UI"
    ],
    "transcript_entity_types": [
        "MONEY",
        "MONEY",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT",
        "QUANTITY",
        "LOC",
        "PRODUCT",
        "NORP",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ]
}