{
    "id": "TmCXxIEGXdE",
    "title": "What a time to be alive! - ASUS ROG x EVANGELION Collection",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-06-18T02:28:30Z",
    "video_url": "https://www.youtube.com/watch?v=TmCXxIEGXdE",
    "category": "Science & Technology",
    "tags": [],
    "views": 452074,
    "likes": 22725,
    "comments_count": 1347,
    "description": "Check out the OnePlus 10 Pro 5G with 12GB RAM & 256GB of storage at   Plouffe channels his inner pilot and attempts to build the ultimate ASUS ROG x Evangelion gaming PC, but does he have the NERV?  Buy ASUS ROG Maximus Z690 HERO EVA Edition:   Buy ASUS ROG Strix RTX 3090 EVA Edition GPU:   Buy ASUS ROG Strix RTX 3080 EVA Edition GPU:   Buy ASUS ROG Strix Helios EVA Edition :  Buy ASUS ROG Keris Wireless EVA Edition:   Buy ASUS ROG Delta S EVA Edition:   Buy ASUS ROG Strix Scope RX EVA Edition:   Buy ASUS ROG Thor II platinum EVA edition:   Buy ASUS ROG Strix Arion EVA edition:   Buy ASUS ROG Strix XG279Q-G GUNDAM EDITION:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 0:13 Coolest PSU case ever 0:34 What is Evangelion? 1:42 Swag B^) 2:00 Shake it Plouffe! 2:19 Unboxing the case 3:03 What else do we have? 3:42 Unboxing the (wrong) monitor 4:06 PSU unboxing 4:43 Mouse and keyboard unboxing 5:39 Headphone, router, and AIO unboxing 6:48 Motherboard and unboxing 7:56 Sponsor - OnePlus 10 Pro 5G 8:37 Checking out the fully assembled PC! 10:14 Eva super fan reactions 11:41 Plouffe said WHAT?! 12:21 Outro",
    "description_links": [
        "https://bit.ly/ShortCircuitOnePlus10Pro",
        "https://geni.us/fuHjBKd",
        "https://geni.us/xiHmrvo",
        "https://geni.us/rgUr",
        "https://geni.us/nIFrN",
        "https://geni.us/zymE",
        "https://geni.us/CUxVFQ7",
        "https://geni.us/DPUY",
        "https://geni.us/aP0BfA9",
        "https://geni.us/YzDvGDs",
        "https://geni.us/sj2W8Ns",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Ah, we're doing a big boy unboxing today with a ton of stuff. Not just this box. We've got all of this here today, and it's for the Neon Genesis Evangelion collection by Asus. We're gonna start with the big swag box. Are you sure this is swag? Whoa! That's heavy. Holy (beep). Gaming power supply unit. Whoa! If this is the power supply, then it comes in the coolest power supply case I have ever seen in my life. Check it out. ROG Thor, 1000 watt, platinum II, gaming power supply unit. For those of you who don't know, Neon Genesis Evangelion is a mid nineties anime about, - [Jono] it's about a lot of things. - It's about a lot of things. Yeah. It gets a little off the rails near the end, partly because they actually just kind of ran outta money. But, there's also a couple movies that came out after the fact that are supposed to fix that. But they didn't necessarily, depending on who you talk to. Essentially, mankind is kind of doomed. There was this first impact that happened that killed off a bunch of people. And there are these quote unquote angels that are attacking earth. The secret organization called Nerv has made these essentially, I mean they're, I'm gonna say they're Gundams, 'cause that's the easiest way for people to understand it. They're Mechas. Yeah. They're just, they're these giant Mechs. And I'm not gonna say more than that, otherwise I'll spoil some things. But they're really cool. And they're called like Eva units, basically. Well, they're Evangelion units which is shorthand like Eva units. Everyone just says Eva. That's why it's like Eva edition, or whatever. All of this stuff is colored and themed in the kind of color way of Eva unit zero one, which is Shinji's Eva. I'm real excited because my one problem with modern computer components is that like, they're all just black. Or, they're all gray. Or, whatever. And so, these aren't. They're just cables. I don't know why these are red and black. It should all be like, purple and green. Boom. This is shirts. ROG x Evangalion project. It's Eva one. A bunch of Kanji. Yeah. Okay. The rest of them are a little different. Like, that's got the Nerv symbol on it. It looks like we've got some cool shirts for the swag pile. Oh my God. What a, what a time to be alive. Oh, it's not wanting to slide easily. Ahhh. Ohh. Sorry. I'm a little out of breath. It was actually kind of hard shaking the, shaking the case out of here. I love how it's got like Eva unit zero one right there. Oh, look at this. They've even got the fabric straps. Oh my God. I love this thing already. Can you pull the box? There we go. Oh my God! They like, etched. Well, I don't know if it's etched. I can't feel anything, but there's like, a pattern put here. Looks like the Eva from the like, not profile but like off axis profile. Asus Evangelion. Oh my God. It's got the whole like, caution tempered glass sticker. It's also Evangelion. Oh! Oh my God. The PCIU slot covers are green, purple, green, purple, green, purple, green, purple. Is that supposed to be first impact or something? - [Speaker] No. I think that's when like, you know when you hit an angel? - Oh, it's the uh, AT field. Oh, yeah! They've got an AT field on the back? That's so cool. Don't know what's in here. Looks like we've got a GPU 3090. More foil. More unit one. What do we have here? Z690 Hero. That's a hell of a motherboard. Yeah. DDR5. LGA1700. Oh yeah. They did a Ryugin, but Evangelion colors. Super cool. This, yeah. The 360ml AIO. Pretty good. We got a huge pile of stuff. Let's do the monitor. We'll leave the power supply and the super cool Pelican case for last. I swear to God, no matter what power supply you have, if you ever buy this, you need to keep this box to carry around any power supply. It feels like I'm carrying a bomb. - [Speaker] What the, - What's this? - [Speaker] It's the wrong one? What? - What? Mobile. G mobile suit? Wait it's Gundam? - [Speaker] Booo! - Oh, my God. Look, Gundam's pretty cool too, but it's another like anime series that I never really watched. I've seen pictures of the monitor, and oh my God, it's so cool with the purple and green. So I'm a little, I'm a little chapped. Oh, this is cool. You don't even have to break the seal. You can delicately take off the Asus and Evangelion branding stuff 'cause it's got a frigging velcro bit on the top there. Alright. So, it's nothing too crazy. It's just like, normal power supply stuff with the Asus and Evangelion thing. Thank you for purchasing. Blah, blah, blah, blah, blah. Take this off. Cool. Yep. The power supply, so far, is nothing too crazy, but you're also just gonna not really see it ever. So, that's okay. I like that it's got the whole Nerv logo here. That's pretty cool. And then this is just cables. I wonder if the cables are already themed? No, they're just red and black. Oh, my God. Oh, I love the green and purple. I don't like the mouse. I'm a, I'm much bigger on like, Logitech mice, but this is fine. Let's see. Then the bottom's all purple too. I'm already like, a hundred percent sold on this thing. The purple cable is amazing. Oh, and it's got the purple cable too. Ha ha. This keyboard is sick. It's optical. So, that may not be for you. I actually don't mind it. I kind of like how the switches feel. They're super like linear, which is really nice. There's all this other custom Neon Genesis Evangelion stuff that's like, actually on the case, and then up here, and then on all the different keys and stuff like that. Like, the space bar looks awesome. And then if we flip it around, it's nothing too crazy, you know. Just more green and purple as we kind of expect. It comes with four extra custom key caps. They're nothing too crazy. They just say like, internal or Evangelion test type, or top secret, or whatever. But it's always nice to get just a couple extra free key caps with your keyboard. These headphones look sick. It's like purple on the outside. Then on the inside, we've got this band of green here. And then on each side, on each cup, that's type one. That's type one. I think it's all just type one. The only thing that I would've loved, and I know that it just doesn't make sense because the cult following isn't big enough for them to sell a ton of these. But I would've loved it If you could get it in like type zero, type one, and type two, let's just get. Oh, the router! I actually really, Oh my God! This thing looks sick. So imagine now you've got like all four of them on there. Oh my God. If these green lights, like. If these are lights and they light up, this thing is automatically like on my wishlist. I kind of need one. What are we gonna? The Ryujin! This kind of just looks like a Ryujin. But, yeah there's some Eva stuff on the side here. It's a bunch of, it's the Nerv stuff. So I'm wondering, I really can't wait to see it all put together and see like where the Nerv stuff is and where the Eva stuff is. Oh, a custom like default Eva zero one, or like Shinji Ikari, or something on there. That'd be cool. Kind of wish that the actual fan casing was also green or purple. It's a small thing, but I think it would actually kind of stand out here. Radiator is just a radiator. Ryujin, cool, but you're not my favorite thing so far in this box. Oh, this one's heavy. What is this? The motherboard. Oh my God! Oh, this is what I want from motherboards! I want like. Okay. You've got all this cool motherboard armor now. Sweet. It totally does make the motherboards cooler, at least in my opinion. Don't do it black. Make it all like colored like this. Oh, my God. It's so cool! The CPU socket cover has the Nerv logo. So here we go. The 3090. This is, ooh. Oh my God. Oh, come on. That's so cool. It's got like Eva one, and then like Nerv on the other fan, and then Asus on the final fan. Check it out. That is so cool. I love this green and purple theme they've got going on. Here's the desk pad. And honestly, for a lot of people, this is probably one of the easier parts to attain, 'cause this is probably cheap. This is probably like 50 bucks or something, maybe. Once again, this is the only thing I'm torn on with this stuff. It's like, about a quarter or a third of it is Nerv, and then the rest of it is Eva zero one. And I really wish it was just all Eva zero one, or all Nerv. Like, just do one or the other. This is all super cool, and I can't wait to check it out fully assembled. We're gonna get our logistics team to do that for me and then come back. But first, we have to pay our logistics team. So a word from our sponsor, One Plus. Starting June 15th, the One Plus 10 pro 5g will officially be coming with 12 gigs of Ram and 256 gigs of storage. This option is great for users who are in need of tons of extra space for photos, videos, apps, music, and more. The 10 pro 5g features a 120 Hertz display, with LTPO technology, and One Plus's hyper boost gaming engine for a smooth gaming experience. And, included in the box is a 65 watt wired charger that can charge your device from one to a hundred percent in just 34 minutes. Learn more about the One Plus 10 pro 5g at the link below. Alright, it's gonna be assembled. Whoa! Aww, it's too bad we couldn't get the monitor, aye? It really would've completed the look. Oh my God. It's awesome. It's like unit one when he is all monstery and stuff. That's sick. Oh, okay. This is so much better. Why didn't you start with it on? I love the RGB on the GPU. That's super cool. I love this power supply. The Thor power supply is super duper cool 'cause it's got like a wattage readout on there. The rest of it's great. Especially, Oh, and it's all synced up now, now that it's like, booted. That looks awesome. I think the only thing I would probably change is put RGB fans on the front, and then an RGB fan on the back here to like give it that kind of full effect. - [Speaker] Take a look at the front panel. - That's amazing. So it's not just like the glass is etched. They've like, etched it with RGB somehow. I don't even know how they did this. Oh my God. And then you just change it from up here? That's sick. - There's one problem that logistics actually pointed out. - No cable combs? - Cable cones. Yeah - Yeah. That sucks. - Here. Actually see at the bottom here. - Yeah. - Because this motherboard is built for this case. - Yeah. - So, it is super difficult. - Oh, you can't get the SATA. - You can, but it's like one cable at a time. - Yeah. Wow. - Go to army. - Oh, that's sick. You got Shinji crying? Okay. Yes. Apply. Apply. Sorry. Shinji. You're a sad, sad boy. Yes. Oh my God. Yes. Crying Shinji. Shinji, you're cool, but you're also really whiny a lot of the time, and a very, very sad individual. Let's get some more cast members to come and take a look at this thing. I like the anime, but I only just watched it. So, we'll get some more like, longer time fans to come in and see if they actually like it or not. How much do you guys like or love Evangelion. - It's alright. - Did you just say Evangelion? - Yeah. - I've only heard it Evangelion. - Oh, Yeah. - Yeah. Well then they say Eva though in the show all the time. - Yeah they do. Well, The Dub? - Yeah. I watch The Dub. - Oh my God. - Ha ha. See, I told you they're a lot more into it than I am. That's okay. 3, 2, 1. - Oh. - Does it? Does it make sound? - No. - That'd be amazing! - No. - Oh, oh. Oh. When it turns on, - Yeah. - Is there a specific animation for that? Like, is it, is it the launching? - No, you can set it to, you can set it to stuff. - Oh my God. If you like set a, an overclock profile. - Yeah. - You can have a clip of, of eating one like, dessert. - Yeah. Totally. - If it were dynamic and based on like stats, that would be amazing! - Oh, no, no, no, no, no. Yeah. Click, click the dropdown. - Hardware monitor? - Hardware monitor. - Yeah. Look. - Oh, there you go. - Hell yeah. - It eternal! Are there different sets for like, different characters? - No. I wanted that too. I thought it'd be so cool if they had like a red one for Asuka, and then like a blue one for Rei, or something like that. But they, - Did you say Asuka? - I said Asuka. - Even the dongle for the mouse is purple on the back. - Oh! - So you'll never lose. - Oh, it should have been the plug! - Oh, my God! You're right. - Missed opportunity. - Yeah. So you guys have it. This is the Asus collaboration with Neon Genesis Evangelion. Oh, I know. - What! - Don't worry. Don't worry. Don't worry. I know. I know. I know. This is the Asus collaboration with Neon Genesis Evangelion. I really enjoyed unboxing all this stuff. I think it's sick. I wanna see more colored components come back to the market, even if it's not for something that I'm like, a super fan of. If you wanna see other short circuits, we've done the collin built in the fractal torrent. Mini or the compact? - [Speaker] Compact. - Yeah. In the compact. Super tiny case, but a lot of power he was able to fit in there. So go ahead and check that out. Thanks for watching. - If you can have it, when you, when you shut down you have like an audio clip of Megumi Ogata saying, \"I mustn't run away.\" That'd be amazing. - [Speaker] Asus, hire this man for the V two of this.",
    "transcript_keywords": [
        "Neon Genesis Evangelion",
        "God",
        "Eva",
        "Yeah",
        "Evangelion",
        "Genesis Evangelion",
        "cool",
        "power supply",
        "purple",
        "stuff",
        "Neon Genesis",
        "Nerv",
        "power",
        "green",
        "thing",
        "supply",
        "Asus",
        "Eva stuff",
        "kind",
        "Eva units"
    ],
    "transcript_entity_values": [
        "3",
        "PCIU",
        "65 watt",
        "2",
        "Nerv",
        "Hertz",
        "a ton",
        "ROG Thor",
        "One",
        "one to a hundred percent",
        "one",
        "Ram",
        "1000 watt",
        "Pelican",
        "Gundam",
        "mid nineties",
        "all four",
        "Eva one",
        "Evangelion",
        "3090",
        "Eva zero",
        "Logitech",
        "LGA1700",
        "LTPO technology",
        "Ryugin",
        "AIO",
        "Asuka",
        "Megumi Ogata",
        "Asus Evangelion",
        "ROG",
        "Shinji",
        "5",
        "third",
        "256",
        "Nerv",
        "10",
        "Evangelion",
        "first",
        "1",
        "Asus",
        "two",
        "120",
        "four",
        "GPU",
        "June 15th",
        "Gundams",
        "Thor",
        "a hundred percent",
        "Shinji Ikari",
        "Eva",
        "12",
        "RGB",
        "Neon Genesis Evangelion",
        "Rei",
        "CPU",
        "just 34 minutes",
        "Neon Genesis",
        "50 bucks",
        "Eva",
        "today",
        "zero"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "NORP",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERCENT",
        "PERSON",
        "GPE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "TIME",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "DATE",
        "CARDINAL"
    ]
}