{
    "id": "TmksF3LwVow",
    "title": "OnePlus 7T Unboxing and First Impressions!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-09-26T17:42:12Z",
    "video_url": "https://www.youtube.com/watch?v=TmksF3LwVow",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "oneplus 7t",
        "unboxing",
        "review",
        "camera test",
        "comparison"
    ],
    "views": 283165,
    "likes": 9474,
    "comments_count": 940,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Today we're unboxing the press kit for the OnePlus 7T. (upbeat music) (box popping) (pages flipping) Just making sure there's no hidden surprises. (box clatters) A little notebook, cute. (box clatters) And here it is, everything that comes in the new OnePlus 7T box. We have the phone, we've got a clear case, a SIM card ejector, USBC cable, and charging brick. Are you ready? And here it is, the brand new OnePlus 7T in glacier blue. The screen is a 90 Hertz AMOLED 6.55 inch, full HD display with a 20 by nine aspect ratio. It's 27% brighter than the 7 Pro, its 1,000 nits for better viewing in direct and bright sunlight. You may also notice a very small difference here in the water drop notch. It's 31.46% smaller. As for a processor, we've a Qualcomm Snapdragon 855 Plus, which give it 15 percent faster graphics rendering. The battery capacity is 38 mA. It has 8GB of RAM and 128GB storage. It's also got the in screen fingerprint reader, much like the previous version, but it has an upgraded security algorithm so, this means it'll be faster and more secure when unlocking. When OnePlus announced their Warp Charge 30 we thought that was pretty fast but now they have a Warp Charge 30T which will charge your phone 23 percent faster than the previous version. You can now charge your battery up to seventy percent in just a half an hour. In 60 minutes through a full charge. I'm actually super into this camera design, I don't know why, I feel like just having it placed in the middle everything feels very symmetric. So, with these three lenses, you're going to have a telephoto, a wide and an ultra-wide. The telephoto lens is 12 megapixels and you'll get 2x zoom, the regular camera is actually 48 megapixels, which is pretty incredible. One of the things that I'm super excited to try out though, is it has a new macro-mode, which is built into the hardware so this isn't something that is just software based, its kind of rendering it to make it look like it's macro. Its actually getting macro shots. So you can get about 2 and half centimeters from your object which is pretty awesome, to think that you're going to be able to get that close and get some really detailed shots just on a phone. You can also use two different views for portrait mode, so you'll have wide and close up, which is great because I feel like sometimes portrait mode feels like you are only able to take just portraits. So being able to move back and get a little bit wider view but still get that really great depth of field look is pretty cool. Video is something that is always my favorite to test out on phones. You can shoot 4k30 and 4k60. You can also do super slow motion. You can shoot 1080P at 240 fps, you can also shoot super slow motion, so you can 1080P shots at 240fps but you can also get 980P and 480P but you'll only be able to capture that at 720P. The front camera is 16 megapixels and you aren't able to 4k in front-facing but it will still shoot at 1080P. Night-scape is available on both the main and the wide angle lenses. It'll combine information from multiple frames to help produce better images in low light. Low light photography on phones, obviously with the new integration to the new iPhone 11 having that night mode, I think that's something that a lot of phones, now, are going to be striving to do. Obviously, the Pixel was one of the first to do it and to do it very very well, so to see all of the other phones kind of following suite and trying to catch up to what the Pixel did initially is pretty great. I usually vlog a lot and I'm always on the go, using a lot of hand-held video. So with this, the video is combining optical image stabilization along with the electronic image stabilization and that's giving us OnePlus 7T's hybrid image stabilization. I did a review of the OnePlus 7 Pro when that one came out and they introduced Zen Mode, and OnePlus said that the Zen Mode went over so well in the previous version that now you can set Zen Mode up to an hour. So what Zen Mode is, is you can basically just lock your phone, you won't be able to access social media or notifications, you'll only be able to send and receive calls and access your camera, which I think is really good because there are some times where I just want to set my phone aside, I don't want to be bothered but yet I love that I'm still able to make calls or use my camera if I need to. Especially if there's an emergency. I think that's a pretty cool feature. The OnePlus 7T will be exclusively sold at T-Mobile carriers but you can also of course, get it online. It will be coming in two colors, this one, which is the glacier blue, which I've already smudged up. Sorry. And the frosted silver. Its priced at $599 which I think is a pretty competitive price considering how expensive some phones are, nowadays. I just wanted to do a quick unboxing and a test of this because it was just announced and I know you guys are probably so sick of seeing iPhone content. So I'm so excited that we also have some new Android phones to check out and I'm always such a fan of OnePlus, they do such a great job with listening to the community and trying to integrate things that we actually want. Into their next version of their phones, while also keeping the prices down. I think that's really difficult because how do you make the technology better and yet keep the price as competitive as possible. We also have a few cases to check out. This is the OnePlus 7T Sandstone. (package tearing) I just destroyed the case and all I had to do was go like this. These look great. I love the OnePlus cases because they do such a great job of making them look really nice but also super thin and light. Like, this carbon fiber one, it feels like I'm holding nothing. Which case am I going to put on? I think I'm probably going to go with he carbon fiber. Oh yeah, its a really good look, with those blue accents? Hello! So now that its all un-boxed and set up, lets take this thing outside and test out some photos and video. (upbeat music) Time to take some photos. I can not wait to try this out, especially with this ultra-wide mode. In a little bit I will also test it out in comparison to the iPhone, since the iPhone now has the ultra-wide mode. I kind of want to see what the difference is between both of the cameras but first, lets take our first photo on the OnePlus 7T. I just love the way the ultra-wide lenses look. Wow, so fun. (upbeat music) So a quick little video test. Now, lets do a front facing video. And of course this only does 1080p so it doesn't shoot 4K. But, lets try it out. Here's a front facing video test. Watching the sun set here at Santa Monica. There's Tyler. Living in Los Angeles, you sometimes forget how amazing and how close the beach is. I need to enjoy this a little more. (upbeat music) The one trick I found when you're shooting live focus or portrait mode on cellphones, is to try and keep yourself contained. So don't have your arms up craZy and allot of spaces like this in your hands and your fingers. The closer you can keep yourself together the less difficulty these cameras have. I'm trying to figure out what it should focus on. (upbeat music) One thing I'm excited to test out is portrait mode because this will do portrait mode on both the telephoto and the ultra-wide, which is cool because I can give you two different perspectives. So Tyler can you take some portrait mode photos for me - [Tyler] Yes. - Okay. - [ Tyler] Let's Do It Right There. - All right. (upbeat music) Now lets test out the wide angle on the iphone versus the iplus10, and obviously we are comparing two completely differently priced phones. So its not entirely a fair comparison. But I wanna see what these look like. OnePlus looks like it did a pretty good job. (upbeat music) So lets test out the mackro modes There's a little macro button right here so this takes you into super macro so lets place the subject 2.5 centimeters to 8 centimeters away in macro mode. Lets try to get these little flowers and see how close we can get. These aren't flowers, they look like some sort of weed. This is so crazy. Oh my goodness. I keep getting even closer. (upbeat music) This looks like something you would see under a microscope in a lab. Oh my gosh, that's wild. Wow! Oh God, did you see that ant? I didn't even know where it is it was so small. I think we got some pretty cool macro shots. So there's a super stable option for video. I wish there was a super stable option for life. Okay Tyler. Your up. (upbeat music) The ones I just took in night scape just to see if it would pull out some of the shadows and it actually kind of did Which is kind of cool. (upbeat music) (gasping) Look at that. How pretty. (upbeat music) You guys. I've been waiting all day for the sun to go down to get a nightscape shot. And then I forgot. So I had to just run outside real quick. Go to a back alley and get a shot. So, lets take this nightscape shot and see what it looks like. (upbeat music) So here's what the iphone looks like compared to the OnePlus. I'm surprised they both actually look pretty good although much like most other comparisons to the iphone the iphone does have a more realistic look. But I'm pretty surprised how good the OnePlus actually does look. So I'm back from testing out the OnePlus7T and I just want to look at some of the images that I took, because its really hard to tell when you're looking on an actual phone screen. Because everything tends to look different. One thing I will say though is that 90Hz refresh rate on that screen, it lookes really smooth. Even when your taking photos everything looked so seamless. I love it. One thing that I did notice is there is some inconsistency in the color between the 3 cameras. So it looks like a telephoto even in a couple of these they look a little bit warmer. The sun was super bright, but I feel like it still should have been able to compensate for that. but even looking at it now, here. The photos actually look pretty good. But you can tell the color difference when you switch between the wide angle on the telephoto. It did a pretty good gob with the portrait mode. I really love this wide angle , like that looks cool. This photo is so funny, because it actually looks like I was photoshopped and placed onto a massive picnic table, because I look like I've been shrunk down this is so weird. Like this photo is messing with my mind. Like just the picnic table and the way that the backgrounds and stuff are blurred. I look like I've been plucked out of Polly pocket into the real world. My biggest complaint on previous OnePlus phones is the audio it always seemed like the microphone was a very tinny sound. And this this sounds way better. So I guess this was my first look at the OnePlus7T No. This is not it. This is it. This is the 7Pro I had this out for the unboxing and I never actually showed it to you guys. Cause I wanted to show you, om gosh its so smudgy. I wanna show you guys the camera differences between the previous version and also sort of the color difference. So there is a little bit of a color variation because of the Pro. It has more of a gradient type color. So I feel like its a little darker at the top. So a little more of a ombre look where as this time, its more of a consistent overall and a little bit lighter of a blue. But either way, this was my first look at this. I cannot wait to try it out a little bit more, I am kind of a fan of this camera arrangement. I was talking to Tyler and he said he wasn't. I'm was just gonna throw you under the bus there Tyler. But now I'm not gonna do that anymore. So I'm kinda a fan of this camera arrangement. I feel like its a little bit different. But what I like most about it, is how it looks when I have this in a case. But for now I think I'm just gonna let it be free. No case. And just let it live its best life. Another thing I noticed in my short time with this thing so far is the in-screen fingerprint reader is way faster, like it just feels like its just snappy. Another difference between the 7T and the 7Pro is obviously the pop up camera which was something that I thought was so cool that they decided to implement in here. But this is a lower cost phone so you are going to be losing a few of the features in the pro version That's it. That's the first look at the new OnePlus7T. I look forward to seeing what you guys think. I know that you guys are such big OnePlus fans. I mean honestly I am too. I love the look of their phones. I'd love to hear from you guys. What do you think of this phone so far. Do you have one? Are you gonna get one? And what phone do you guys have? I love reading all of those comments below. So I will see you guys in the next video. So. Bye Bye.",
    "transcript_keywords": [
        "mode",
        "OnePlus",
        "portrait mode",
        "pretty",
        "Zen Mode",
        "phones",
        "phone",
        "camera",
        "super",
        "test",
        "Video",
        "guys",
        "pretty good",
        "iPhone",
        "love",
        "portrait",
        "Tyler",
        "kind",
        "bit",
        "good"
    ],
    "transcript_entity_values": [
        "iPhone 11",
        "4k",
        "12 megapixels",
        "Zen Mode",
        "all day",
        "nine",
        "up to seventy percent",
        "one",
        "mA.",
        "27%",
        "2x",
        "90Hz",
        "OnePlus 7",
        "T-Mobile",
        "the Zen Mode",
        "Warp Charge",
        "the OnePlus 7 Pro",
        "OnePlus 7T.",
        "OnePlus",
        "Pixel",
        "OnePlus 7T Sandstone",
        "38",
        "20",
        "USBC",
        "30",
        "60 minutes",
        "three",
        "Pixel",
        "240",
        "OnePlus 7T",
        "iPhone",
        "Time",
        "1080P. Night",
        "un",
        "Los Angeles",
        "90",
        "7",
        "31.46%",
        "just a half",
        "OnePlus",
        "16 megapixels",
        "23 percent",
        "720P.",
        "2.5 centimeters to",
        "RAM",
        "night",
        "3",
        "1080P",
        "OnePlus",
        "1080P",
        "Hertz",
        "128",
        "two",
        "15 percent",
        "up to an hour",
        "4k30",
        "6.55 inch",
        "48 megapixels",
        "980P",
        "Android",
        "Tyler",
        "8 centimeters",
        "first",
        "Santa Monica",
        "Polly",
        "Qualcomm",
        "about 2 and half",
        "1,000",
        "8GB",
        "GB",
        "599",
        "One"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "PERSON",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "TIME",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "TIME",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "GPE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "GPE",
        "MONEY",
        "CARDINAL"
    ]
}