{
    "id": "Tmpx91Ch0io",
    "title": "So much for PRIVACY, Apple...",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-04-02T02:26:57Z",
    "video_url": "https://www.youtube.com/watch?v=Tmpx91Ch0io",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Apple",
        "Meta",
        "Discord",
        "Snap",
        "hackers",
        "EDR",
        "user data",
        "privacy",
        "iPhone",
        "iOS 15",
        "hacker group",
        "emergency data request",
        "Snap Inc",
        "Krebs on security"
    ],
    "views": 733388,
    "likes": 39533,
    "comments_count": 1095,
    "description": "Get your NZXT function keyboard today at:    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 wait how does this work 0:08 Apple, Meta gave hackers data 1:17 iFixit partners with Samsung 2:05 Apple reader app web links 2:57 NZXT FUNCTION Keyboards 3:36 QUICK BITS 3:42 Windows 11 default browser stuff 4:12 Double your Wifi 4:47 Moore Threads Chinese GPUs 5:31 April Fool's stuff 6:29 Spot, guard Pompeii   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://nzxt.co/FunctionTL",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/bmpmg",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- Okay, yeah. Give me the tech news I'm ready for it. (laughs) April fools, I wouldn't accept it anyway. (Riley laughs) Apple, Meta and Discord mistakenly gave up user data to hackers posing as law enforcement, according to a Bloomberg report. Meaning that for some people what happened on their iPhone did not stay there because Apple gave it to hackers. (Riley laughs) Hmm, good old privacy. It is continually proven that the billboard was a mistake. - [Riley] Great meme potential though. - The fake emergency data requests or EDRs occurred in 2021 and resulted in sensitive data like IP addresses, not that sensitive, phone numbers, more sensitive, and even home addresses much more sensitive. - [Riley] Whoa. - Being handed over to a group of hackers. The same ones also sent EDRs to Snap incorporated but it's not clear whether Snap complied with the order. Discord did though. When they were sent an EDR earlier this year, according to Krebs on security. Frankly, I totally understand the mistake like one time I handed over a wallet to a guy dressed as a cop at a Halloween party. He didn't even ask. April fools, that didn't happen. (Riley chuckles) I don't go to parties. - [Riley] Got you again. - Aye! I got 'em. After partnering with Microsoft and Valve to offer official parts and repair tools for devices made by those companies, iFixit has announced a new corporate buddy, Samsung. As pressure from the right to repair movement heats up. Because real friends bond over looming legislation which will enforce consumer rights that should have already been protected. - [Riley] That's what it's all about. - That's what it's all about. Samsung will provide an iFixit with official smartphone parts like the original display assemblies and back glass to sell to the public. And iFixit is also expanding it's Samsung focused repair guides. So people will actually know what to do with those parts. Because look, we can't all be Louis Rossmann. The world would just be too sassy. (Riley laughs) Could you imagine? Just... - [Riley] Everyone would be upset all the time. - And Apple has begun rolling out its previously announced app store policy that allows some apps to link to their website where users can sign up for subscriptions. Thank you, maybe Floatplane can finally work. - [Riley] Um. - The policy applies to reader apps, a category Apple made up for services like Netflix and our very own Floatplane that refuse to use the app stores in-app purchasing. All developers of reader apps have to do is fill out an application for external link account entitlement. I mean, come on, we're talking about posting a link here. - [Riley] You have to fill out the form. - Fill out the form. - [Riley] And post a link. - Gotta do it. It's worth pointing out that Apple only announced it will make this change after pressure from Japanese regulators. Marking yet another instance of tech giants doing the bare minimum to help consumers only when they're basically forced to do so by legislation. Speaking of which, I am legally required to throw it to Riley now. (Riley laughs) - Now it's time for quick bits brought to you by NZXT and their new function keyboards, the perfect entry point to the mechanical keyboard community. And they come in ten keyless, mini ten keyless and full size models, if size does matter to you. The standard units with Gateron red key switches and white and black color ways are, dare I say pretty minimalist, nice and sleek. But countries with NZXT build can choose from five different kinds of switches and a variety of color options for a custom look to match your desk. Plus every keyboard comes with hot swappable switch sockets, a detachable USB C cable and per key RGB. So get your NZXT function keyboard today using the link below. - Watch the LTT April fools video. We were too busy doing that to make one for TechLinked. Also quick bits. Even Microsoft thinks that still using Internet Explorer is a bit cringe as the kids say. And if that program is set as your default browser in windows 10 the company won't let you upgrade to windows 11. What? - [Riley] Based. - For how many times they just say, \"Hey, let's just switch to edge\". You'd think they just do it right? (Riley laughs) Thankfully, Microsoft has finally taken its head out of its ass and made switching default browsers in windows 11 in all in one setting like it used to be. - [Riley] You're swearing a lot these days, Anthony. - (Beep) you, Riley. - [Riley] Whoa. (Riley chuckles) - We don't usually get excited about the features of Dell's business focused laptops, but today.. - [Riley] Speak for yourself. - But today is an exception because the newest version of Dell's express connect feature allows the company's new work notebooks to use two internet connections at the same time. Either two WiFi connections or one WiFi and one ethernet to increase speed and reduced latency which frankly sounds like something that should be in gaming laptops first. What are we worried that people are gonna cut each other off on Zoom because of lag? It's part of the fun. - [Riley] You can waste time in meetings, steal your boss's money. - Why not? - Intel has enjoyed industry hype about it's ARC graphics cards but we're actually getting another player in the industry. Thanks to Chinese company, Moore Threads. What? - [Riley] More threads, more threads. - That's what they're called? I didn't realize that. (both laughing) - Moore Threads. (Riley chuckles) The MTT, Moore Thread Tech, I guess. It just announced two graphics cards. The MTT S2000 for servers and the MTT S60 for desktops which is demo playing League of Legends at 1080P. Pretty sure my phone can do that. So I don't know what that means exactly except China number one or number four that's more than two. - [Riley] Some number that... - Carry the three. - [Riley] There's numbers involved. - I don't know. Seems like everybody forgot about April fool's day today and no one posted any jokes. (laughs) Got you again. - [Riley] Oh! - Oh, I'm so good. - [Riley] You're tricking it, you're tricking. - Oh, so tricky. Some tech and game companies did participate in the traditional holiday. Razor announced a metaverse suit which actually a full body tracking suit with like haptics and stuff would probably be pretty. You could make them, you can get vests and stuff but like a full body, like body suit. - [Riley] Yeah, would be nice. - That would be nice. NZXT made a slick video for a steam deck like thing with mouse buttons and a keyboard inside, I don't know. But I think HyperX has to take the crown for its touch grass keyboard caps. (both laughing) Now some of you can actually know what it feels like. - [Riley] Oh man, the zingers today. - Oh man, it's actually kinda sad because like there are kids who grow up in concrete jungles who actually, literally cannot touch grass. - [Riley] Okay, don't make this serious. - Okay. (Riley chuckles) And in slightly dystopian news of the day robot dogs are now being used to guard the sight of an ancient natural disaster. Okay, Boston dynamics robot dog SPOT is being enlisted in the smart at Pompeii project. To patrol for signs of looting or damage. Okay, wouldn't want to damage all those collapsed buildings or anything right? Don't worry, I'm sure Tom Holland or Nicholas Cage will be able to outsmart them and access the secret Illuminati vault, no problem. - [Riley] I give the movie six outta 10. - Six outta 10? - [Riley] It's kind of fun. - Getting past all the SPOT dogs with like lasers and - [Riley] SPOT dogs. - machine guns. - [Riley] Not again. - And I'm sure it'll be no problem for you to come back on Monday for more tech news. Hopefully with way less jokes, come on, Riley more joke. To be fair, it is hard to know what is real or not on April 1st. You know, real like our sponsor.",
    "transcript_keywords": [
        "April fools",
        "April",
        "Apple",
        "NZXT",
        "Moore Threads",
        "Threads",
        "tech",
        "keyboard",
        "time",
        "announced",
        "sensitive",
        "Moore Thread Tech",
        "MTT",
        "Microsoft",
        "Riley",
        "hackers",
        "Samsung",
        "make",
        "SPOT",
        "Moore"
    ],
    "transcript_entity_values": [
        "number four",
        "six outta 10",
        "Boston",
        "Intel",
        "three",
        "Moore Threads",
        "Valve",
        "Riley",
        "one",
        "ten",
        "Bloomberg",
        "April 1st",
        "USB C",
        "iPhone",
        "April",
        "EDR",
        "earlier this year",
        "2021",
        "iFixit",
        "Pompeii",
        "IP",
        "windows 11",
        "Moore Thread Tech",
        "Japanese",
        "LTT",
        "Internet Explorer",
        "Microsoft",
        "Samsung",
        "Nicholas Cage",
        "more than two",
        "Discord",
        "China",
        "about April fool's day",
        "10",
        "Floatplane",
        "first",
        "Anthony",
        "Chinese",
        "windows 11",
        "Netflix",
        "these days",
        "Razor",
        "two",
        "Floatplane",
        "Monday",
        "Riley",
        "TechLinked",
        "MTT",
        "Tom Holland",
        "the MTT S60",
        "Krebs",
        "Louis Rossmann",
        "Illuminati",
        "League of Legends",
        "Gateron",
        "RGB",
        "five",
        "Halloween",
        "NZXT",
        "Dell",
        "Apple",
        "today",
        "Meta"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORG",
        "NORP",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORDINAL",
        "PERSON",
        "NORP",
        "EVENT",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "FAC",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG"
    ]
}