{
    "id": "TqjwSNRDrO8",
    "title": "Mac Pro and Pro Display XDR Unboxing!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-12-10T17:00:42Z",
    "video_url": "https://www.youtube.com/watch?v=TqjwSNRDrO8",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 7828765,
    "likes": 196375,
    "comments_count": 14063,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today, we're unboxing the brand-new Mac Pro, and two Pro XDR Displays. Now, I wanted this unboxing to be very special, because obviously, the Mac Pro is super-powerful, so I rented three 8K REDs. We have one, two, three. We are gonna test this thing out, after we unbox it, of course. (ripping) (upbeat jazz music) Wow! This might be one of the happiest days of my life! This thing is so in there. (gasps) I can see it, I can see it! I honestly think this might weigh more than me. I'm not even joking. Oh, no, maybe not. Wishful thinking. Let's show you guys the front of this thing. Oh yeah. This is great. Let's get these monitors opened! (ripping) Is there an unboxing feature here? - [Smart Watch] Which workout do you wanna start? - Unboxing. I was expecting these boxes to look differently. I thought that they would have the full screen display, the full Mac Pro on it. It's also a different type of box. It feels more of a higher-quality plastic. We've got one more monitor. (ripping) Oh my gosh, you're so beautiful! It's such a nice, minimalist design. It's got a really industrial handle here, too. And now, for the stands. Even they have a little pull tab! (playful string music) I love how it all matches! Dual monitors, baby! I decided to go with the matt monitors, mostly because my office is very reflective when I have the windows and stuff open, so I thought this would be a really great change of pace. That was not even the unboxing yet. That was just unboxing the box that I need to unbox! This is a 32-inch Retina 6K Display with 10-bit color, 1,000 nits full screen brightness, 1,600 nits of peak brightness, which makes working with HDR content way more accurate. So we're gonna unbox one of the stands first, and then a monitor, 'cause I'm gonna be using the Mac Pro to unbox these things. I will say that the experience of unboxing this, so far, has been amazing. Like, the texture on the box, the design, the fabric little handle here, and of course, Apple doesn't require a knife. This just pops open like that. I mean, even the stand is an enjoyable unboxing! Feels like there should be something in this, but there's not. Look inside! There it is. This is way bigger than I thought, even though I saw it at WWDC. I've been waiting for a new Apple monitor for so long. You can't tell, we currently turned my living room into a nice little office. Also got some directions. Probably going to actually read the instructions, for the first time in my life. Knowledge has been seeped into my brain. Let's open up this monitor. It's packaged in, like, a little blanket! Okay, so this just folds down? I can't believe that I'm touching this right now. I can't believe this is in my house! Wait' til I turn this around for you. You guys, look at this. (laughs) Oh my goodness. Really does look like a cheese grater. There is no way around that, 100%, but I love it. It looks like he's got a little Band-Aid on! It's the Apple logo. They protected the Apple logo with this little sticker! So, I think that the installation is pretty simple. This really isn't that heavy, either. Wait, is it on? Is it in? So, this monitor guided itself onto the stand. I didn't even do anything. I was just sort of in the vicinity. You are so freaking beautiful. Don't ever let anybody tell you that you are not worth $1,000. Don't let them tell you that, because you're worth it. Oh, it smells so good. It smells like, oh wow, like a fresh winter day. (relaxed electronic music) I'm so glad I decided to get the matt version. It's been a really long time since I've had a matt screen, and this is super exciting, because I shoot a lot of videos, and I'm always shooting my screen, so to be able to have a matt screen with almost zero reflections is going to be amazing. We have one display ready! I'm gonna be editing all of my Instagram stories like this from now on! This is incredible! There's a little switch in the back here, so you just flick that. Unlock, locked... Look at this. Okay, let's see what else is in this box. Looks like we've got some more instructions here, so here's the Pro Display XDR booklet. This is a nice paper. This is something that I would put on my bookshelf. (relaxing guitar music) Monitors are all set up. Now, it's time to do the unboxing. Mac Pro, oh my gosh, I can't believe this is actually... The time is now. This box itself is just a piece of work. This has Velcro here on the side. It has them on both sides. This is a perfectly engineered box. (upbeat pop music) Wow! I wasn't sure if this was going to include a mouse and keyboard or not. Mouse, keyboard, trackpad. This is the extended keyboard as well. Is this the matt black mouse? No, this is a black mouse. Matty, come see this! This is an all-new mouse. Because the other one is more of a space gray color. This is something that I don't think that they even talked about. And a black trackpad? Hold on a second, I'm processing my emotions! Look at this! I'm gonna go grab the space gray one, because you guys gotta see the color difference! Oh gosh, I know we're burning through that RED footage! I'm gonna go as fast as I can! Okay, all right, okay. The track pad, obviously, extremely different. But here's the mouse. It's more of a little bit of a grayer color, with a blue kind of a hue to it. This is the new mouse. Completely black. Come see these color differences! I know you're a dog and you can't see colors. Okay, bye. Oh my gosh, it's really heavy! Okay, there we go. There's inside the box. I'm glad this gives you the instructions on how to open the box, after you've already opened it. Power cable. I think that's it! This box is so well-designed. I mean, you need to protect this thing in transit, obviously. Matty, this could be your new home! I feel like there's probably a better way to do this! (ripping) Look at the feet! I cannot wait to get wheels on this thing! Look at that Apple logo, it's massive! Spin this around, so you guys can get a real nice shot of this. Isn't this beautiful, Matty? What do you think? The one thing that I have been dying to try out is lifting up the top of this, so it gives you easy access to the internal configuration, so if you need to do any upgrades, which at this point, I'm not sure why you would, because this thing is so powerful already, you just turn, and lift. It is just so beautiful. (relaxed pop) So, I wanted to show you guys the side-by-side comparison of the old Mac Pro tower and the new one. It's really crazy to see what this looks like up next to this new one. It was actually over 10 years ago that I won this thing on The Price is Right. You guys probably think I'm joking. I'm not! So the old one, the side just popped right off. It's still pretty impressive design. Oh, this one is way heavier, for sure! We changed up our angle a little bit, and now, we're gonna finally plug this thing in, and get these monitors all fired up! Mac Pro. This is the power cable. Matty, that's old tech. Don't look at it. Okay, finally plugging this thing in. We gotta get this thing set up! Look at the back of this thing. It's so beautiful! Now, let's get these thunderbolt cables plugged into the monitors. I think that's it! Cable management, no so good! Three, two, one... (gasps) Look, look! We have something happening! It is booting up over here. Shall I move the screen? Can you see it okay? Are we okay? Is everything okay? Is everyone okay? Am I okay? I'm not sure. Everything is, it's working! Next. We've got both of them set up. Each one of these monitors can go up to 1,600 nits of brightness. We have two of them side-by-side. Now, I need to get this thing all set up, so that I can start to edit. Night mode Catalina. Daytime Catalina! It's great, because I have two little desktop options here for each display. I am so excited to edit. I've never been this excited to edit anything in my entire life. The brightness is all the way up. You can see here, there's different display options. So, this one says, \"Pro Display, 1,600 nits.\" So, I still need to download everything. I basically have nothing on this computer, except whatever iCloud is automatically downloading. I need to get Final Cut, I need Compressor, gotta get Photoshop in here. And then, we're gonna copy all of this RED footage over. I do have a four-terabyte drive, and we've shot... How much stuff have we shot already today? - [Cameraman] Almost four and a half terabytes. - Almost four and a half terabytes! (gasps) So, there is an option to go update terabytes, but this is only the four-terabyte option, so I'm probably gonna have to also edit some footage off of the solid-state drive, which I normally do anyway, so that's totally fine. Because we're also gonna be shooting some more footage tomorrow, I'm probably gonna have to bring my server down, so that I can edit directly off of that, because these REDs are just eating up the space. One of the highlights of Mac Pro, especially if you're Final Cut editors, which I am one, is if you have ProRes RAW 8K footage, you can simultaneously edit up to six streams, which is pretty impressive. You can connect up to six of the Pro Display XDRs to the Mac Pro, but if you have 4K monitors, you can connect 16 of them. So I think everything is now officially downloaded, and we can start transferring over this footage. (relaxing rock music) We are now down here in Santa Monica. I wanted to bring you guys here. This is where I shoot all of my review videos, but I wanted to shoot some B-rolls, and have some 8K footage to use while I'm editing, 'cause I don't really have any! But now I do. Okay Justine, I know you're editing this right now. Let's cut to some of the B-roll that we just shot while we were down here! (relaxed pop music) Oh, moonchild Where have you gone Floating through the music Dangling to the beat Smiling to some strangers Swinging on my feet We're now on 3rd Street. This is in Santa Monica. This is the promenade. You guys may have seen this in GTA if you've ever played, or if you've ever been to Los Angeles. This is one of my favorite places. It was one of the first places that I ever visited when I came to Los Angeles. This is the area that made me want to move here, and this is also the home of one my favorite Apple stores. I have a lot of memories here. I slept outside here for 55 plus hours for the iPhone 6. You guys may have seen that video. But this place has a very special place in my heart, in my life, and especially, this Apple Store, it's so cool. (relaxed electronic music) So, I haven't quite figured out how I'm gonna set these monitors when I start editing, but I have some footage already over here, and it looks so incredible, I cannot wait to start editing, which I'm gonna do, I guess right now! So, I will see you guys later, and wish me luck, 'cause I'm probably gonna be here all night! (lullaby music) I can't believe how good this footage looks. What time do you guys wanna start tomorrow? Nine o'clock? Maybe earlier? Do you think maybe you guys can leave, like, one light on? Did you eat all the pizza? Matty, where are they going? Do you want... See you later! (door slams) (sighs) Sun up, sun down I know now You are the one So, we're back from my night of editing, which was more like a few hours of editing, 'cause I fell asleep, but I got a few things edited here. But what we have going on is I am editing this all in an 8K timeline. So previously, we were shooting REDCODE five to one compression, and I realized that the compression rate was super-high, and it was eating up storage space so quickly. So we switched it for the rest of the shoot, and we're now shooting 10 to one, so that's giving us much more time to record, and a lot more storage space. Here we go! This is it! I'd play this for you, but you already saw this edited in this video. So, when I click into here, you'll see that I have this in a multicam timeline, and I'm able to quickly and easily switch between camera shots. So, this monitor I'm using has an AV output, which is super-easy to do. You just click \"AV Output\", and this is basically being used as our display monitor. Currently, at the time of shooting this, I'm not entirely done editing this yet. It's still a rough edit. So, many of you guys are probably wondering what the specs are of this computer. So, this is obviously the Mac Pro. This is the 2.5-Gigahertz 28-Core Intel Processor, which is so insane that this is something that is sitting in my house right now. This has 384 gigs of memory, which can be upgraded to 1.5 terabytes, also absolutely insane. This has the four-terabyte solid-state drive. My storage is full?! No! I made a huge mistake by thinking that I could edit a lot of this off of the internal, so I'm gonna be exporting all of this onto my Jellyfish server, and then editing just with the library on my internal drive. Now, I'm never gonna be able to shoot another YouTube video again, unless it's with a RED 8K! This is a problem. This MAC configuration also has two AMD Radeon Pro Vega IIs, plus it's equipped with an afterburner card. This is used to offload processes, to help eliminate the need of creating proxy footage, while editing really high-quality content. Thank you guys so much for watching this video. I had so much fun shooting this. I hope you guys enjoyed this first-look video here at the new Mac Pro. I've been having so much fun editing this. This video was shot over the course of two days, so at the time of me shooting this right now, I have not got a chance to fully edit, and really experience this computer, so stay tuned for a follow-up video at some point. In the meantime, I hope you guys liked this video. Make sure you guys give it a thumbs-up if you enjoyed it, and be sure to subscribe, so you'll see more of my videos, and I'm gonna go edit now. Maybe I'll make myself a grilled cheese sandwich. Hi, Matty! Good boy, you excited about this Mac Pro? We're gonna unbox it together, okay? You gonna help Mommy edit?",
    "transcript_keywords": [
        "Mac Pro",
        "Pro",
        "brandnew Mac Pro",
        "Mac",
        "guys",
        "Pro Display",
        "thing",
        "editing",
        "full Mac Pro",
        "display",
        "monitors",
        "Apple",
        "edit",
        "Pro Display XDR",
        "Pro XDR Displays",
        "footage",
        "unboxing",
        "box",
        "monitor",
        "video"
    ],
    "transcript_entity_values": [
        "winter day",
        "Matty",
        "second",
        "WWDC",
        "Velcro",
        "one",
        "two days",
        "Nine o'clock",
        "ProRes RAW 8K",
        "AV Output",
        "Apple",
        "Justine",
        "Compressor",
        "a few hours",
        "this Apple Store",
        "32-inch",
        "AV",
        "Instagram",
        "100%",
        "Mac Pro",
        "4",
        "three",
        "16",
        "RED 8K",
        "AMD Radeon Pro Vega",
        "four-terabyte",
        "1,600",
        "Almost four",
        "Almost four and a half terabytes",
        "YouTube",
        "Los Angeles",
        "Daytime",
        "the Mac Pro",
        "GTA",
        "terabytes",
        "Catalina",
        "8",
        "55 plus hours",
        "10 years ago",
        "Band-Aid",
        "five",
        "2.5-Gigahertz 28-Core Intel Processor",
        "Mac Pro",
        "the happiest days",
        "Final Cut",
        "moonchild",
        "Pro Display",
        "six",
        "today",
        "iCloud",
        "Mac Pro",
        "two",
        "Three",
        "up to six",
        "3rd Street",
        "384",
        "matt",
        "10",
        "Final Cut",
        "first",
        "tomorrow",
        "1,000",
        "Santa Monica",
        "the Mac Pro",
        "MAC",
        "1,000",
        "almost zero",
        "Jellyfish",
        "One"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "TIME",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "MONEY",
        "GPE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL"
    ]
}