{
    "id": "tQMIy5Gnck0",
    "title": "Too Thin For A Keyboard: Lenovo Yoga Book C930 Hands-On",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-08-30T18:31:24Z",
    "video_url": "https://www.youtube.com/watch?v=tQMIy5Gnck0",
    "category": "Science & Technology",
    "tags": [
        "yoga book 2",
        "yogabook 2",
        "yoga book c930",
        "lenovo",
        "ifa 2018",
        "notebook",
        "laptop",
        "mrmobile",
        "michael fisher",
        "windows 10",
        "best laptop",
        "lightest laptop",
        "thinnest laptop",
        "yogabook"
    ],
    "views": 212452,
    "likes": 5460,
    "comments_count": 380,
    "description": "Sponsored by Skillshare. Be one of the first 500 people to sign up for two FREE months of Skillshare Premium at this link:    [LENOVO YOGABOOK C930 HANDS-ON]  Back in 2016 I called the Lenovo Yoga Book the most interesting laptop Id ever touched  and it just got a sequel. From IFA 2018 in Berlin, Im MrMobile, and this is the new laptop of the future: the Lenovo Yoga Book C930!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S YOGABOOK 2 HANDS-ON]  MrMobile's YogaBook 2 / YogaBook C930 Hands-On was produced following an hour with a YogaBook 2 / YogaBook C930 review device at a Lenovo press event prior to IFA 2018 in New York City. Pre-production hardware running pre-release software. This video was sponsored by Skillshare.   [MUSIC]  \"Fashionista\" by Olive Musique, available at Premium Beat:   \"Groove Science\" by Olive Musique, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #yogabook #lenovo #laptop #notebook #yogabook2 #yogabookc930 #technology #ifa18 #ifa2018",
    "description_links": [
        "https://skl.sh/MrMobile",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.premiumbeat.com/royalty-free-tracks/fashionista",
        "https://www.premiumbeat.com/royalty-free-tracks/groove-science",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] Back in 2016, I called the Lenovo Yoga Book the most interesting laptop I'd ever touched, and it just got a sequel. From IFA 2018 in Berlin, I'm Mr. Mobile, and this is the new laptop of the future, as long as you don't need any physical keys. (techy music) Lenovo's calling this thing the Yoga Book C930, which brings it in line with the rest of the company's branding, but in my opinion, isn't quite flashy enough to do this product justice. After all, where else are you gonna get a Windows 10 laptop that's only 10 millimeters thick? Maxes out at 800 grams? One that pops itself open with a little knock knock on its casing. There are a lot of minor changes to the new Yoga Book, and also two major ones, which I'll cover first. I said Windows a second ago, and that distinction is important. Whereas the 2016 model came in both Android and Windows models, this C903 is only offered with Microsoft's OS. This is no great loss in my view. Android on tablets is, if not dead, then at least on life support, and from what I've heard, the old Android variant didn't sell well anyway. With full Windows 10, this thing seems like it would be a great platform for the new always connected PC devices running on Snapdragon, but nope. Instead, this runs on either an Intel Core I5 or M3, with optional LTE in some markets. That apparently doesn't include the U.S, though, so American buyers will have to settle for wifi only for now. Lame. Lenovo says the battery should last up to 8.6 hours. Let's talk about the other big change: the keyboard. It's just as flat as last year's frosted glass, and you still get audio and haptic feedback when you type, but now, instead of a backlit stenciled touch pad, the keys are e-ink. That means you can change the way the keyboard looks, or change the language, and, this is a neat trick, you can call up the track pad only when you need it and discard it when you don't. Once again, you have the option to use the keyboard as a memo pad, too. There's a built in MyScript engine to convert your handwriting to text. The one thing there isn't, and this is kind of huge, is a keyboard back light. Lenovo said it didn't have the room given the tolerances here. Maybe it won't be a big deal for everyone, and maybe the light wash from the screen will be enough to keep the keyboard visible in a darkened plane, but if not, this is gonna be a big deal for frequent travelers. I mean, there's also a reader mode here, so you can throw pdfs onto the e-ink panel. It'll be great to use this thing as an e-reader, but again, not without a back light. Thankfully the other changes are welcome. From the bigger display with a higher resolution, to the addition of a fingerprint sensor, to the updated USBC ports, two of them. And I'm eager to get this new Yoga Book back in the studio for some testing ahead of its official release, which is due in October, for the starting price of a penny shy of 1000 U.S. dollars. Is that too much the pay for the kind of extreme portability this little guy promises? My early thoughts, after a word from a sponsor that might just help you achieve some of your dreams. This video is brought to you by Skillshare. Skillshare is an online learning community with thousands of classes, from technology to design to business and beyond. Now, you've probably heard of programs like this, but Skillshare is more affordable than most. For less than 10 bucks a month, you get unlimited access to over 20,000 high-quality classes taught by experts. These are experts who are actually working in their fields. There's no better people to learn from if you're trying to figure out how to do the work you love. For me, the classes that caught my eye were the ones that helped me up my Instagram game. From choosing the right apps to mastering street photography techniques. I use Instagram everyday, and I learned something new in the first five minutes. Build your own list of the classes that excite you. Visit Skillshare at the link in the description below, and hurry, the first 500 people to sign up with this link will get two months absolutely free. Folks, I was entranced by the first Yoga Book because I love products that look like they just walked off the set of a sci-fi movie. But I gotta tell ya, the second I wrapped that review video, that Yoga Book went right back on the shelf. Part of the reason was I had the Android model, but if I'm honest, I just don't think I was willing to take the time necessary to retrain my fingers to accommodate a touch keyboard. Well, things have gotten weird since 2016. In 2018, I've retrained my thumbs to get used to a Blackberry again. So I might be more willing to go the long haul for the Yoga Book 2 C903, especially given the switch to Windows. Seeing as how other laptop manufacturers are reintroducing the concept of dual-screen notebooks as well, maybe it's just the early part of a new trend? Subscribe to theMrMobile on YouTube, so you don't miss my full review, presumably coming some time in September or October, and follow me on Instagram at the same handle for all the smaller stuff that I'm seeing every hour here at IFA 2018 in Berlin. Until next time. Thanks for watching, and stay mobile my friends.",
    "transcript_keywords": [
        "Yoga Book",
        "Lenovo Yoga Book",
        "Yoga Book back",
        "Yoga",
        "Book",
        "Windows",
        "interesting laptop",
        "keyboard",
        "laptop",
        "Android",
        "Lenovo Yoga",
        "Back",
        "Skillshare",
        "Lenovo",
        "Book back",
        "thing",
        "keyboard back light",
        "classes",
        "Instagram",
        "Windows models"
    ],
    "transcript_entity_values": [
        "IFA 2018",
        "Lenovo",
        "Skillshare",
        "LTE",
        "last year's",
        "Instagram",
        "Berlin",
        "Microsoft",
        "October",
        "USBC",
        "2016",
        "American",
        "2018",
        "20,000",
        "YouTube",
        "thousands",
        "1000 U.S. dollars",
        "the Lenovo Yoga Book",
        "Mobile",
        "Snapdragon",
        "Intel Core I5",
        "One",
        "first",
        "U.S",
        "one",
        "the Yoga Book 2 C903",
        "two",
        "September",
        "every hour",
        "Michael] Back",
        "M3",
        "Yoga Book",
        "second",
        "less than 10 bucks",
        "Windows 10",
        "only 10 millimeters",
        "800 grams",
        "500",
        "Blackberry",
        "Windows",
        "the first five minutes",
        "two months",
        "8.6 hours",
        "Android"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "NORP",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "LAW",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "TIME",
        "PERSON",
        "PRODUCT",
        "WORK_OF_ART",
        "ORDINAL",
        "MONEY",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "DATE",
        "TIME",
        "ORG"
    ]
}