{
    "id": "tSRfYteappo",
    "title": "OnePlus 6T Review - REAL Changes",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-10-29T16:07:00Z",
    "video_url": "https://www.youtube.com/watch?v=tSRfYteappo",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Oneplus 6T",
        "OP6T",
        "best value smartphone",
        "best smartphone",
        "budget smartphone",
        "best camera",
        "under 600",
        "under 500",
        "best phone for the money",
        "nexus",
        "pixel",
        "samsung"
    ],
    "views": 888067,
    "likes": 29470,
    "comments_count": 3319,
    "description": "Dave2D review of the OnePlus 6T. With a smaller tear-shaped notch and a new in-display fingerprint sensor, the OnePlus 6T feels like a big improvement. OnePlus 6T -   It's still rocking the snapdragon 845 with 8 gigs of ram and 128 gigs od storage but the headphone jack has been removed.  Background Music: Fili - For momma  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2zgwnSC",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going Dave 2D here. Okay the OnePlus 6T. This is a phone that has a very different vibe for a smartphone from OnePlus, the past twelve months in the smartphone industry has been nothing but like notch city. We've seen so many similar variations of that notch to the point where a lot of Android phones actually look identical to each other, even the OnePlus 6 had a very similar looking notch The OnePlus 6T is the first phone that I've used that has this teardrop shaped notch, and it's obviously visually different I'm never one that likes notches, and this looks so much better to me just even when the phone is just sitting in the UI It looks so much cleaner to me and when you're watching videos and stuff in landscape. It's way less obtrusive It's gonna depend on whatever you're watching the type of content you're watching, but I think most people will appreciate this Reduced notch size compared to a regular large notch and another thing I like about the shape is that this design is immediately recognizable as being different Like all those notched phones out there whether it's an iPhone X or any of the 50 million Android notch phones out there They all look very similar to each other. There's nothing wrong with it, but it's clearly a notch phone from the past year You look at this This looks different. This looks unique. This looks like you have a phone from the future now And does it matter? Probably not, I think most people don't care about that stuff But if you do, if you want that unique look to your phone This is that phone the teardrop notch will shift the earpiece up So it's in this thin slot on the edge of the phone now It still sounds just as good and you sell the sensors But you do lose that customizable notification light and that's something that I've always liked about oneplus phones It's now gone another new feature on the OnePlus 6T is the fingerprint sensor built into the screen So we've seen this technology on a bunch of Asian phones before But this is the first one that I've used with this technology, and I got to be honest It is super cool If you think of all the ways that phones have implemented fingerprint sensors on their phones for the past few years Like they've been on the back on the front on the side on the top It's lots of different variations, but when you have it built into the screen It just removes that physical object that physical fingerprint sensor from the phone And now you have a significantly cleaner design. The sensor is built under the screen You can't see when it's off but when you want to unlock the phone you place your finger on that spot a Green light fires up to help the sensor read your fingerprint and it unlocks the phone I love the way that this fingerprint sensor looks but does it perform well? It does but it's not as good as a regular fingerprint sensor So the one thing I noticed right away was that the speed is a little bit slower than the regular OnePlus 6 fingerprint sensor That thing is fast! The in screen fingerprint sensor on the 6T is quick, But it's just not as quick. The other thing I've noticed is that in terms of just reliability I feel like the in-screen fingerprint sensor is More sensitive to things like dirt and moisture in your fingers when I had wet fingers was pretty much impossible to unlock the phone But that being said this is not the only way to log into the phone, right? You still have access to your superfast face unlock I don't think a lot of phones going forward are slated to have this type of technology to have that in screen fingerprint sensor and This is one of the first phones to do it So if you want to be an early adopter, here's your ticket. Now, this phone is actually a little bit bigger than the original OnePlus 6 The screen is also a little bit bigger and you get a slightly smaller bottom bezel, but physically the phone feels bigger It is taller and slightly thicker I actually don't notice the length if you told me that these were the same phones in terms of length I would have thought they were I had to look up the dimensions to notice that the 1 plus 60 is a little bit taller but the girth the thickness is Noticeable, it's only half a millimeter thicker, but because of the way that these phones sit in your hands It is a noticeable difference compared to the 1 plus 6 It's not uncomfortable in any way and it's also a little bit heavier But the thickness is what you'll notice more than anything else and with that extra room in there Oneplus has filled it up with a bigger battery. So this is now running a 3700 milliamp hour battery The old one was at 3000. That's like a 20-25 percent increase in battery life. It's significant So this phone has also had the removal of the headphone jack and this is a move that really surprised me I feel like a lot of one-plus fans are headphone jack enthusiasts. They depend on that thing they really rely on that headphone jack as being like one of the main features as to why they buy this phone and Move it It's not that it's offensive I just feel like a lot of people gonna be disappointed now if you think about it If you really think about the situation in the smartphone industry right now, this was inevitable I mean I thought they would have gone one maybe even two more generations of phones with that headphone jack, but it's gone now I guess it's just the natural progression of things okay, the camera this remains unchanged from the oneplus 6 the camera bump doesn't protrude as much anymore because it's a slightly thicker foam but There's still a protrusion and the camera on the 1 plus 6 and 60 are good cameras way better than the previous Generations of oneplus cameras, I feel like the 6 had a very respectable camera There's a new feature in the software called nightscape, which allows you to take some really clean images of cityscapes at night It's pretty cool. So the one plus 60 is a phone. That is I think it's a pretty big shift for the company Here's the thing. T phones like the T series of phones from oneplus are usually iterative changes, right? They've tweaked a couple things here and there and it's like it's a new phone It's like the second release of that phone for that year and it's cool. But this year this 60 feels like It's a big jump for them Not just in the shape and design of the phone But I feel like the choices that they've put on this phone like to remove the headphone jack to remove the regular fingerprint sensor they're doing stuff to their T lineup or just their phone lineup that feels more aggressive more like Forward-looking than the regular one plus that I've known The 60 looks way more like a flagship than any other oneplus phone to date and I think the 60 is actually a better looking Phone than a lot of other flagships out there. Some of them are double this price So should you pick up the 60? Honestly, if you skip the 6 because you felt like it was too small of a change like just you know the slightly bigger screen this has features in it that make it feel like a significant change this feels like it's a phone from the future if you want a phone that is gonna look and act like You know, it's not like every other phone out there 60 that looks pretty nice. Okay. Hope you guys enjoyed this video thumbs If you liked it subs you love to see you guys next time",
    "transcript_keywords": [
        "phone",
        "phones",
        "fingerprint sensor",
        "OnePlus",
        "Android notch phones",
        "sensor",
        "fingerprint",
        "notch",
        "screen fingerprint sensor",
        "regular fingerprint sensor",
        "Android phones",
        "screen",
        "oneplus phones",
        "feel",
        "phone feels bigger",
        "notch phones",
        "thing",
        "Dave",
        "phone feels",
        "headphone jack"
    ],
    "transcript_entity_values": [
        "20-25 percent",
        "50 million",
        "the past twelve months",
        "60",
        "Dave",
        "Green",
        "OnePlus 6",
        "Asian",
        "one",
        "this year",
        "the past few years",
        "one-plus",
        "that year",
        "the past year",
        "jack",
        "second",
        "1 plus",
        "Android",
        "3000",
        "two",
        "first",
        "night",
        "6",
        "Noticeable",
        "UI",
        "OnePlus",
        "Oneplus",
        "3700 milliamp hour",
        "only half a millimeter"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "QUANTITY"
    ]
}