{
    "id": "TsVyQSVy2bo",
    "title": "Did I Flip?!",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-08-12T14:52:43Z",
    "video_url": "https://www.youtube.com/watch?v=TsVyQSVy2bo",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "microsoft",
        "duo",
        "samsung",
        "z flip",
        "5g",
        "folding phones",
        "smartphones",
        "smartphone",
        "tech",
        "technology",
        "zflip",
        "galaxy",
        "galaxy z flip",
        "samsung galaxy",
        "windows",
        "android",
        "microsoft duo",
        "flippy boi",
        "review",
        "first look",
        "unbox",
        "unboxing",
        "new smartphone",
        "moto razr",
        "galaxy fold",
        "fold",
        "fold 2",
        "note 20 ultra",
        "pixel 4a"
    ],
    "views": 125985,
    "likes": 5403,
    "comments_count": 317,
    "description": "Microsoft Duo versus the Samsung Z Flip 5g... Whats the WORST Microsoft product?  Samsung Note 20 Is(n't) Garbage Town.  The Google Pixel 4a Wins.  What is the WORST PlayStation?  Best vs. Worst Apple Products:   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/r0LAk3F8ldg",
        "https://youtu.be/ZC0vdejEoYw",
        "https://youtu.be/W3tgJ7uBDew",
        "https://youtu.be/OkBdZoqLqdA",
        "https://youtu.be/pQWqbZ1raE0",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to This Is. You've picked a very special day because today the flippy boy gang gets just a little bit bigger. So not only do I have the brand new Samsung Galaxy Z Flip 5G in front of me, but Microsoft have also announced the final details of the Surface Duo. Now the Surface Duo specifically, I think is really interesting because unlike the flippy boy, where it is more of a, what was it what you said, call it the hot dog versus the hamburger. - [Matt] Yes! - Okay, so instead of opening and closing like this Z Flip, So, open, close, open, close. Instead, the Duo is much more of a full dual screen device. Now, unlike something like the Galaxy Z Fold 2 which is an actual single display that folds, instead, Microsoft have opted to go for two individual screens. Now that's not necessarily a bad thing. One of the main advantages to that is that they can make this Duo much, much thinner. So the entire phone is just under 10 millimeters thick, which is about the thickness of some normal, like non-folding flagships and significantly thinner than any of the folding phones from Samsung, including the Flip and the Fold. Now beyond that, the hardware looks really nice. Now, while it is on pre-order at the moment, I don't have one in my hand just yet, so we will be doing a video. So make sure to subscribe to This Is for more information on that. But right now it is available at a pre-order price of 1,399. And it will be shipping in September, September 12th, 10th, 12th, 10th, 8th. So there are some things about the Duo that at first glance are a little bit underwhelming. First of all, there's only one camera, which does make sense because the way the hinge is actually designed, you can open and close it all the way. So it serves as your front facing camera, you flip it around, it's your rear facing camera, but it's an 11 megapixel sensor, which is probably fine. I don't think you're buying this $1,400 phone to have what I would consider to be a very good camera. This back is also a little bit underwhelming on the Surface Duo. So it is powered by the last year's Snapdragon 855 which means you get no 5G, and you get a little bit worse performance, especially considering that you're powering two OLED displays. Now, as someone who's been using the standard Z Flip with basically the exact same spec, it is certainly not impossible to use or anything like that. The camera specifically I think is probably going to be fine but with 11 megapixels and only a single camera, which you have to share as your front facing and you flip it around, use it as the rear. However, what it does have is incredibly good looking hardware. So again, make sure to stay subscribed. I'll be talking a lot more about that very soon, but for now, why don't we talk about the Galaxy Z Flip 5G. So for some context, I have been a Galaxy Z Flip gang member, as you would probably know if you listened to The Test Drivers podcast, for almost six months now, and I really, really love the phone. And the Z Flip 5G is all about giving you more on top of that, although unfortunately, not a lot more, 'cause it's very similar I believe. So full disclosure, this is not a Samsung review unit. This is a Z Flip 5G that I have purchased with my own money, which means that, well, I hope that it's the flippy boy that I'm looking for. So the packaging contains the Z Flip, the wall charger, as well as the protective film. Do they have a new screen protector installed by chance? Very interesting. So as someone who's been using the Z Flip for a while, the actual screen has held up pretty well. I have a couple very minor scratches, but certainly nothing that's any worse than like most normal phones that live in your pocket all day anyway. Do not press the screen or the front camera lens with a hard or sharp object such as a pen or fingernail, doing so could result in scratching or puncturing them. We recommend to keep the attached film to protect your screen, interesting. So if I recall correctly and it has been a little bit, I don't think the original Z Flip had anything on the screen whatsoever. I don't think there was any kind of like screen protector or whatever, which is something that I actually was a little bit concerned about, because I believe that with that first Z Flip, you could have like, gone, like I think that they had like some concierge service that will install a screen protector. It sounds like this actually may have it already included, and then it has magnets, don't put it next to a defibrillator or something stupid. All right, look, I'll be completely real. I'm an idiot for buying this phone. This is almost the same as my other Z Flip, but it's got 5G and a better processor. And apparently a screen protector. Oh yeah, that is definitely a screen protector built-in. Interesting, that's gonna be really hard to get on camera. Aw, dude, so they've actually totally redone the finish here. So it's actually a matte texture. So one of my only problems with the Z Flip was that it was very slippery. And one of things that I did to get around that, also because I kept pulling it out of my pocket upside down, was I put two different dbrand skins on it, not a sponsor. I bought this with my own money like everything else. But essentially what I do with my current Z Flip is I have one of the textured skins on the front and then a non-texture skin on the back. So when I actually pull it out of my pocket I know that I'm not gonna pick it up upside down. Interestingly, with the new Z Flip, it has a much more sort of like soft touch matte finish. It's actually kind of similar to what you get on the Galaxy Note 20 Ultra. I like that a lot, can you just hear that? That's a really good sound. Yeah, so it's really gonna be hard to see, but maybe if you look on the top screen, you can see there is definitely a screen protector installed. I like that, that's something that I never did on the current Z Flip, and while it's very slightly scratched up on the screen side, still, honestly, not too bad. Oh, also I forgot on the box. One year screen replacement offer. One time out of warranty screen replacement for $119 if you purchased it before 2021, that's nice. I'm sure if you try to replace the screen out of warranty it'll be... a lot of money. One of the issues with the Z Flip is that it actually is kind of based on slightly older tech. So it does have the newer processor, the 865 Plus from latest generation of Note and S20 what not. And it does have 5G support, but it still uses the older style like S10 cameras. There are a few things that are older. Like it does only a 60 Hertz display. And it also only uses the older style charging. So it does have wireless charging, but it's not the super ultra fast, it's like 18 Watts, 20 Watts, it's not crazy fast charging, especially when it comes to the wireless side. Oh, what a wonderful wallpaper I have. And with that, the Z Flip 5G is now set up. It's a Z Flip, so if you're not familiar with what makes this phone exciting, it really is the fact that this is one of the only phones that really does the folding form factor thing justice, as far as I'm concerned. Now there's nothing against the Fold, which is obviously a much larger phone it gives you when you open it up, more of a tablet. But the reason why I like the Z Flip is that this is tiny, right? I mean, if I compare it to something like an iPhone, it is significantly smaller. And that to me makes a big difference, right? I love being able to have something which is super thin, super lightweight in my pocket. Doesn't mean that I have a huge bulge. I honestly really like the design of this Z Flip though. I mean, you get a very nice sized display. You get a full smartphone. When you fold it up, it's super compact and the phone will actually stay up sort of, you can watch videos like this. There's a ton of stuff. If you wanna know more about the Z Flip by itself and all the various quirks and features, you can check out our original is the Galaxy Z Flip video worth it? Over here on This Is. But what I wanna find out is what's new? So with the Z Flip this year, we do know that it is 5G. Or I say this year, this month, I mean, this thing came out in February originally. It has 5G, and that is because it does have that new Snapdragon 865 Plus processor. Now that might not sound like a huge difference and that's because it's not. But it does have sub-6 5G, so at least we should be seeing some better speeds. I should have done a speed test on my old Z Flip before I took my SIM card out. But look, it's 5G, it'll be a little bit faster. It also does Wifi 6. I do wanna play around with the cameras a little bit though. Oh, wait, hold on, I've noticed a difference, can you see that on camera? This screen is brighter, wait hang on. That screen is much brighter, which is actually nice because one of the downsides to the Z Flip is that when you have closed, it actually, you can if you double tap the power button, if I can find, you can actually use the cover display as a quick little way of taking a selfie and you can still use it with the phone closed. The problem is that when you're outside, that screen's a little bit dim, so it's harder to actually see. The fact that this is so much brighter actually is a small, but noticeable improvement. Let me actually take that selfie now and see what it looks like. So we're gonna get these nicely adjusted, something like that. Okay, shoot. There we go, perfect. Let's see if these are any different. Well, regardless, the screens are, as far as I can tell identical, right? I mean maybe there might be some slight differences in brightness, which makes me think, what's the deal with the selfie, why does it looks so different? Let's actually take a better photo. Okay, Z Flip 5G, surprising no one, has the exact same camera. The Z Flip is still a tough phone to recommend. It is almost $1,500 now, which is, I don't need to tell you, not a particularly cheap price. What it does give you is something which legitimately you cannot find anywhere else. There's a lot of character to this phone. The fact that it is a very small device. Yo don't have a lot of compromises, especially now we have 5G, we have Wifi 6, we have the updated specs. You have water, well, actually, no, you have no water resistance but you have wireless charging. There's a lot going for it. That being said, as much as I am a proud Z Flip gang member and have a podcast, which is at least 63% dedicated to the Galaxy Z Flip. It's a tough phone to recommend. If you want a flippy future, then this is legitimately the number one folding phone that I recommend. This is just a good, solid standard Samsung phone that just happens to fold in half. And while that might not sound like a huge thing, to me, it makes all the difference between a perfectly competent flagship and something which really does feel like it's next level. So thank you very much for watching this episode of This Is. Make sure to subscribe to the channel for lots more flippy boy content, including don't forget, that Galaxy, I said it again, the Surface Duo, not the Galaxy, the Surface Duo coming very soon. I hope they still send it to me now that I've called it the Galaxy Duo like eight times.",
    "transcript_keywords": [
        "Flip",
        "Surface Duo",
        "Galaxy Z Flip",
        "screen",
        "Duo",
        "Galaxy",
        "phone",
        "screen protector",
        "camera",
        "Flip gang",
        "Galaxy Duo",
        "bit",
        "Surface Duo specifically",
        "Surface",
        "current Z Flip",
        "Surface Duo coming",
        "Flip gang member",
        "lot",
        "Samsung",
        "Samsung Galaxy"
    ],
    "transcript_entity_values": [
        "Flip",
        "February",
        "10 millimeters",
        "Duo",
        "only one",
        "18",
        "one",
        "almost six months",
        "the Galaxy Z Flip",
        "at least 63%",
        "the Surface Duo",
        "S10",
        "Watts",
        "119",
        "today",
        "One year",
        "Fold",
        "Yo",
        "almost $1,500",
        "1,400",
        "eight",
        "1,399",
        "5",
        "60",
        "Matt",
        "this Z Flip",
        "the last year's",
        "20",
        "Hertz",
        "the Galaxy Z Fold 2",
        "this month",
        "Samsung",
        "half",
        "the Galaxy Duo",
        "two",
        "Samsung Galaxy",
        "Galaxy",
        "all day",
        "One",
        "this year",
        "Wifi 6",
        "Snapdragon 865 Plus",
        "a ton",
        "Galaxy Note 20",
        "Galaxy Z Flip",
        "11 megapixel",
        "a Z Flip",
        "Microsoft",
        "September, September 12th, 10th, 12th, 10th, 8th",
        "first",
        "S20",
        "iPhone",
        "11 megapixels",
        "a very special day",
        "2021",
        "First"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "LOC",
        "MONEY",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "EVENT",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORDINAL"
    ]
}