{
    "id": "tWdH7cQ_RkI",
    "title": "Do Dual Screen Phones Make Sense?",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-07-17T19:19:50Z",
    "video_url": "https://www.youtube.com/watch?v=tWdH7cQ_RkI",
    "category": "Science & Technology",
    "tags": [
        "lg velvet review",
        "lg v60 review",
        "lg dual screen review",
        "phone with 2 screens"
    ],
    "views": 309216,
    "likes": 13645,
    "comments_count": 901,
    "description": "Sponsored by Surfshark. Get Surfshark VPN at   Enter promo code MRMOBILE for 85% off and 3 FREE additional months!   [DO DUAL-SCREEN PHONES MAKE SENSE?]  No. Thats the answer Betteridges Law dictates be given in the instance of a headline that asks a question  and Im gonna say it right out front: its also true, for me. Personally speaking, a dual-screen phone does not make sense for most of my needs.  But my needs are not everyones needs. And more to the point: Microsoft is about to hit the dual-screen scene in a big way with its Surface Duo later this season, so like it or not, dual-screen smartphones will soon be a thing (whether they ultimately last is a question for another time). So for the past few months Ive been using a few LG Dual Screen review devices; Ive compared notes with other LG users; and Im now convinced that there are benefits to a twin-display device  as long as youre willing to put up with some fairly large compromises.  Join me for a look at the various use cases of dual-screen phones, featuring the LG Velvet and LG V60, and stay tuned for my Microsoft Surface Duo coverage  whenever that device finally makes it to market!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S DUAL SCREEN PHONES VIDEO]  \"Do Dual-Screen Phones Make Sense?\" was produced following several weeks with an LG Velvet review sample, and several months with an LG V60 review sample, both provided by LG. The devices were tested on T-Mobile and Verizon in and around Brooklyn, NY. Preproduction samples running prerelease software. The lone sponsor of this video is Surfshark; neither LG nor any other company paid a fee or otherwise offered compensation in exchange for this coverage.   [LINKS]  Into The Fold: How Many Ways Can You Fold A Phone? [YouTube]:   Microsoft Surface Duo: Coming Sooner Than You Think! [Android Central]:   Closer Look At Android On The Surface Duo [Windows Central]:   Surface Duo: Everything We Know So Far [Windows Central]:   Savvy Milennial [YouTube]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #lgvelvet #lgdualscreen #dualscreen #twoscreens #surfaceduo #lg",
    "description_links": [
        "https://surfshark.deals/mrmobile",
        "https://www.youtube.com/channel/UCSOp...",
        "https://www.youtube.com/watch?v=5t8RSwbbeCs",
        "https://www.youtube.com/watch?v=DM3GdiQFfro",
        "https://www.youtube.com/watch?v=Qeaak6rx6Lk",
        "https://www.windowscentral.com/surface-duo",
        "https://www.youtube.com/c/SavvyMillennial/featured",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- Sponsored by Surfshark VPN. No. That's the answer that Betteridge's law dictates be given in the case of a headline that asks a question. And I'm just gonna put it out there right upfront. It's also true for me. Personally speaking, a dual-screen smartphone doesn't meet most of my needs most of the time. But my needs are not everyone's needs. And more to the point, Microsoft is about to hit the dual-screen scene in a big way with its Surface Due later this season. So this isn't just a flash in the pan. To try to get a better handle on it, for the past few months, I've been using a few LG dual-screen review devices. I've compared notes with other LG users. And I'm now convinced that there are benefits to a twin display device. As long as you're willing to put up with some fairly large compromises in the process. (gentle upbeat music) As you can tell from the box, the focus of this video is the Velvet on loan from LG. For now, the only company really making an effort in the dual-screen smartphone space. LG seems intent to make a splash ahead of the Surface Duo with the Velvet, which in my case, came in a limited edition reviewers kit packed with accessories like a Wacom stylus and some genuinely pretty cases. But the only case that matters to me is this one. This is actually LG's fourth iteration of the dual-screen concept, after earlier experiments with the V50, G8X, and V60. \"Chunky,\" you say, too, which I nod my head. Until you also say, \"Clunky,\" at which I also nod. Clumsily folding the flap underneath around back, the biggest phone case of my life. That's a reference to the 2000 single \"Hey Pretty\" by Poe. Which is apt because, in contrast to those earlier clunky designs, the Velvet's dual-screen cases is pretty. Pure white with a scalloped back for grip and out front, an intentionally offset, external display, looking like a Cylon visor. And because the Velvet is thinner than its predecessors, this case is too. Using the second display is pretty much plug and play. You drop the Velvet into place, you tap one soft key, and bingo, you've got double the desktops. So what can you do with them? Well, when I touched on that question in the first episode of \"Into the Fold\", my series exploring life on a folding screen, it was in the context of a comparison with true foldables. And I found no usability advantages to the dual-screen. In terms of software, the Samsung Galaxy Fold can do everything dual-screen phones can, and more. But folding phones are more fragile due to the lack of water and dust resistance and the softer plastic displays. And then there's adaptability. My Galaxy Fold will never not be a giant 270 gram mass. It feels like a gold bar in my pocket and it costs almost as much. The Velvet is not only much cheaper, but it can turn into a standard thin phone on demand. - Yes, when relieved of its bulk, the Enterprise becomes an exceptional weapon. - Quick aside, massive props to LG for the speaker performance, even when the Velvet is in its case. I'm reviewing a 17-inch laptop alongside this phone at the moment. And it's no exaggeration to say that sometimes the phone has better audio. (upbeat music) Using the Velvet over the past few weeks has given me an insight into why people really enjoy this dual-screen life. One night I had an outdoor drink at a bar that has an online menu, and I enjoyed being able to keep the menu up for reference on one screen while scrolling Twitter on another. I also juggle a few group chats on Telegram, so it's nice to monitor those convos on the side-screen while seeing how far away my Lyft is on the primary or whatever. And probably the most polished dual-screen feature on this phone is one I pretty much never use 'cause I don't really like mobile games, but the gamepad is slick. It's got several preset modes for different game types and even the option to create your own custom configuration. I knew that was only scratching the surface though. So as I often do, I took to Twitter to talk to real owners. Far and away the most popular response to my question of what do you use this for? Was multitasking while watching a video. Even though you should be paying attention to me. Just kidding. But I got productivity suggestions too. The second screen is great when you need to take notes on one document while consulting another. As I do every time I build a shot list for a video while consulting the script I wrote. One gentlemen said it was useful for him when trading stocks, keeping info on one screen, and executing trades on the other. Several folks said it makes password managers easier to use. I see that. A longhand fan even brought the stylist into the equation, taking handwritten notes on one screen, concerning video from the other. And in the only example I can think of where spreading an app across both screens makes sense, several folks said editing video on the go is made easier with dual-screens. Recalling my experience, cutting a video on the Galaxy Note 10 plus, yeah, I'd have appreciated more screen real estate for sure. So there are plenty of reasons the dual-display concept makes sense, but there's still a lot that needs fixing, including my two very favorite use cases. The details after this special offer for MrMobile viewers. I'm not traveling as much as I have in years past, but I'm still using today's sponsor just as often. While Surfshark VPN is great for safely browsing on a public hotspot, it's also a powerful tool for preserving your privacy at home. Look, I make my living thanks to the advertising that goes alongside my content, but some ads come with an uninvited guest, malicious software. Surfshark helps fight that malware and it also hides your IP address, which makes it tougher for bad actors to target you. If you think your internet service provider might be throttling your speeds based on usage Surfshark can help level the playing field. And it works on your computer, tablet, and your phone. Try Surfshark now at the link below and use promo code MRMOBILE. You'll get an 85% discount and three additional months for free. Thanks to Surfshark for sponsoring this video. (upbeat music) - A mini-laptop. You may not like it, but this is what peak dual-screen performance looks like. At least to me. Spreading out with two hands typing on the full width of a phone screen with another screen up top? Unless you've got a Cosmo Communicator in your pocket, it just doesn't get any better for on the go writing that doesn't require you to pack a backpack. So what a shame that this mode requires you to use LG's subpar keyboard, with terrible auto-correct and basically nonexistent auto punctuation. Also, the keyboard takes a long time to deploy in this mode. And as usually happens, when you try to push Android to do something unusual, it works, but it's funky. Normally I'd switch over to Gboard or SwiftKey, but spreading the keyboard that way doesn't really work well because again, not all apps allow themselves to be divided across that huge hinge gutter, at least not without downloading another app to force that behavior. The other big compromise isn't LG's fault, it falls squarely on Amazon. Dual-screen devices were absolutely made for eBooks, but Kindle, the industry leader, doesn't offer two-column view in portrait mode. Such a missed opportunity and I really hope Amazon rectifies it soon. There are a few things LG can fix like its software, which still tells you you shouldn't remove the battery to reset the phone, even though LG hasn't shipped a flagship with a removable battery in five years. A custom launcher could smooth over some of LG rough edges, but the physical realities of a removable case, they're tougher to negotiate. Yeah, slim as it is by comparison with its forerunners, the Velvet in the dual-screen case is still a beast. Using it one-handed while folded back is awkward. You need its proprietary cable to charge it if you don't have Qi. And when it's closed, you only get the barest glimpse of usable data on the outer display. Some of these are problems the Surface Duo will likely share, others, not so much. But at the end of the day, this is one particular case where Betteridge was wrong. Broadly speaking, the dual-screen smartphone does make sense. Just depends on how you use your phone. They are for a very specific set of use cases, most of them involving multitasking. And for now, you have to also enjoy LG phones to experience them. Now they're still not for me. You'll have to watch my \"Into the Fold\" episodes to see why I still consider them an intermediate step toward a fully foldable future. But for a world as full of compromise and half measures as the one we find ourselves in in 2020, well, dual-screen phones seem like a perfect fit. If you're interested in learning more about Microsoft's take on the dual-screen life, check out Zac Bowden's videos at Windows Central for a detailed walkthrough of the Surface Duo emulator. This video was made possible by several reviews samples from LG, but MrMobile works for you, not the manufacturers. LG provided no compensation for this coverage, nor was it offered copy approval or an early preview of this video. So they're seeing it for the first time, right alongside you. Please subscribe to the theMrMobile on YouTube if that's the kind of video you'd like to see more of. Until next time, thanks for watching. And when you're not staying home, remember to stay safe and mask-up, while you stay mobile my friends.",
    "transcript_keywords": [
        "dualscreen",
        "Velvet dualscreen cases",
        "Velvet",
        "case",
        "video",
        "phone",
        "dualscreen phones",
        "Surface Duo",
        "screen",
        "dualscreen smartphone",
        "Surfshark",
        "Velvet dualscreen",
        "Galaxy Fold",
        "Surface",
        "Surfshark VPN",
        "cases",
        "dualscreen life",
        "pretty",
        "Fold",
        "Samsung Galaxy Fold"
    ],
    "transcript_entity_values": [
        "2020",
        "Telegram",
        "three additional months",
        "half",
        "V50",
        "Betteridge",
        "Microsoft",
        "the past few weeks",
        "Samsung Galaxy Fold",
        "Betteridge",
        "Cosmo",
        "Android",
        "YouTube",
        "85%",
        "Wacom",
        "today",
        "2000",
        "the Galaxy Note 10",
        "Windows Central",
        "first",
        "One",
        "Cylon",
        "Poe",
        "two",
        "Velvet",
        "Gboard",
        "Kindle",
        "later this season",
        "Surfshark",
        "Into the Fold",
        "years past",
        "My Galaxy Fold",
        "second",
        "five years",
        "the Surface Duo",
        "the past few months",
        "Surfshark VPN",
        "fourth",
        "MRMOBILE",
        "LG",
        "270",
        "Lyft",
        "SwiftKey",
        "V60",
        "Velvet",
        "MrMobile",
        "Zac Bowden's",
        "17-inch",
        "Twitter",
        "one",
        "One night",
        "Amazon",
        "the end of the day"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "LAW",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "DATE"
    ]
}