{
    "id": "TXeZ5fNazk8",
    "title": "The Secret behind E-ink Displays - Durability Test!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-01-31T15:13:00Z",
    "video_url": "https://www.youtube.com/watch?v=TXeZ5fNazk8",
    "category": "Howto & Style",
    "tags": [
        "e ink technology",
        "e ink",
        "e ink phone",
        "kindle scribe",
        "e ink tablet",
        "e ink durability test",
        "kindle",
        "e-reader",
        "best e-reader",
        "e ink color",
        "e ink display",
        "e ink technology kindle",
        "technology",
        "how does e ink work"
    ],
    "views": 1689395,
    "likes": 55152,
    "comments_count": 20156,
    "description": "How does an Electronic ink display work?! Grab your own Huel Black Edition Shake HERE:  Huge thanks to Huel for sponsoring this video. Ive always been curious about how E-Ink display work. Electronic ink comes in all the greyscale colors.... all one of them. And is great for e-readers. Today we do a durability test of the Kindle Scribe:  to see how it can hold up to the test of time and see how the e-ink display works from the inside.   Off Road Kid Wheelchair HERE:   Get my Shirts and Razor Knife here!    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://jlinks.io/jerryrig",
        "https://amzn.to/3YdE71T",
        "https://youtu.be/yVPWGK54bRQ",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Don't mind me today. I'm just getting a little snack before we commence the durability test. Today we're going to be checking out our very first e-ink tablet called the Kindle Scribe. It is the very first e-ink tablet for both reading and writing. And I did buy two of them...you know what that means [wink]. I think it even has a stylus inside which should be pretty interesting to see how that works. This video is not sponsored by Amazon even though Kindle is owned by Amazon. This video is sponsored by Huel. But don't worry, it takes less than 60 seconds to make a nutritionally complete, affordable, vanilla shake with 40 grams of plant based protein. It's not just protein either, the shake has 27 vitamins and minerals. I mean, just look at the list of all these nutrients on the back, plus no artificial sweeteners. Huel Black is an easy way to maintain and keep track of your nutritional goals. I've lost 15 pounds since last June, thanks for noticing, all thanks to keeping track of my calories and, of course, my daily workout of snapping phones in half. New year, new me...you know how it goes. And Huel Black has a 12 month shelf life. Personally I like the vanilla flavor, but I have not yet tried the cookies and cream or strawberry shortcake yet. I'll be getting those next to spice things up. I like it because it's not super sweet like you might see with some other protein powders. If you want your own plant based, affordable, nutritionally complete food. I'll leave a link down in the description. But you don't have to take my word for it. Over 270 million meals have been sold in over 100 countries. You'll even get a free t-shirt with your order. And huge thanks to Huel for sponsoring this video. Now that I've refueled with my healthy vanilla shake from Huel, it's time to see if an e-ink tablet can survive a durability test. It should be interesting. Let's get started. [Intro] Now, tablets with e-ink displays have been around for a really long time and are actually fairly priced. It's easy to find them for less than $100. This guy, however, the Kindle Scribe with the stylus, costs quite a bit more, sitting right around $370. The stylus and power cable are joined together, but at that price point we are up in the iPad territory, so let's see if the cost is worth it. This is my first experience with an e-ink display this large, and I guess the main difference between electronic ink and regular IPS or OLED is that e-ink is grayscale and has basically no refresh rate...ever...unless it's time to turn the page. The unrefreshing screen is what gives us a battery life that's calculated in weeks instead of days. It comes in 16 shades of gray, I guess 50 shades costs extra, and it actually does a pretty good job of displaying images, in black and white of course. The 10.2 inch screen has a density of 300 pixels per inch, which is about the same as what we saw in the iPhone 11 so there's pretty solid clarity. Plus going into dark mode inverts the colors, not only for easy night reading, but also some vision impairments can see white text on black pages better. So I can see this feature being very useful since most regular books are printed black on white. The matte screen also reduces glare. It does feel like glass, but we'll have to find out here in just a second. If I rotate the tablet top to bottom, the screen does refresh itself by not only inverting the page but also inverting the coloring of each pixel quickly before returning back to normal again. Like a really expensive Etch-a-Sketch. It happens both while reading a book or if you're scrolling through the e-book library. Not a bad little unit. I can see it being extremely useful for the type of person who wants to carry thousands of books around. I was surprised to learn, however, that even though you might purchase a book from Amazon, you don't actually own it. You're only buying permission to read the title the title's not actually yours. So there is some merit to just getting a physical copy. But then again, it all just goes back to how many books you want in your pants everyone's different. It's also surprising to see that the matte screen is also made from plastic, with scratches appearing at a level 3 and deeper grooves at a level 4. It's definitely not glass. There is no camera on this unit, which is nice. The real differentiator from this e-ink e-reader from others is the stylus. It's got a removable tip and the ability to take notes not directly on the page itself however, but as a small Post-it note type thing that's saved as an icon wherever you're inserting the note. Pressing the button on the sides allows me to highlight instead of write. This would definitely be more useful on PDFs or forms which the scribe can also do. While taking notes, however, fingers cannot do any of the drawings, and I think we should find out why, especially since this stylus supposedly never needs to be charged and has no internal batteries of its own. How does the screen know where the stylus is at? It's all done with very similar technology to what we find in Samsung's s-pen stylus. A coil of copper wires around the tip that can accurately be detected by a wire mesh behind the pixels. In the far end of the stylus, near the digital eraser, we find some magnets whose only job is to hold the pen to the edge of the tablet. I kind of forgot to show this beforehand so just use your imagination to see the rest of the pen still attached. The body of the e-ink e-reader is pretty simple. Bare metal on the right side and bare metal on the top side. I guarantee there's a grandma who's watching right now for the first time and is very confused. On the left side we have the USB-C port which you won't be using much since a single charge can last up to three months. We also have a metal power button all made with 100% recycled aluminium. Thumbs up for that. Nice work, Kindle. The bottom of the Scribe is also metal and there are some interesting features on the back. Little rubber footpads in each corner which are actually quite nice. Very securely attached to the panel, and they do a very good job of elevating the reader when it's set down. A slightly more quality experience than just having the bare metal rest on a table or desk kind of like built in coasters. It's pretty impressive that in a span of about 600 years, we went from Gutenberg's printing press making books one handset letter at a time, to a lightweight internet connected e-ink e-reader that can instantly pick from 13 million different titles. Technology changes pretty fast. The Scribe is pretty cool and definitely has its place, but I don't think that physical books are going anywhere anytime soon. I know the biggest question on your mind when clicking on this video is what happens to an electronic ink display during the bend test and let's find out. We know that LCDs go black and usually recover. OLEDs go white and usually don't recover. And e-ink...well, it looks like this e-ink display does nothing under the heat from my lighter. There is a slight ripple of melted plastic on the top, but the screen itself is unfazed and undamaged. I'm impressed. The picture you keep seeing by the way is a sculpture on a hilltop in Ohio that the author thinks was made by a very advanced civilization on earth about 10,000 years ago which got wiped out at the end of the last Ice Age. I'm not normally a conspiracy theorist, but this one's actually pretty interesting. And with a tablet this thin, the bend test should also be interesting. With the price of an iPad, let's hope this Kindle Scribe is durable. You gotta admit, that was some pretty hefty flex, with some serpent-like curvature. Yet, the e-ink display is still totally functional. The frame is a bit crinkly now, but catastrophic damage has occurred so far. Super impressive. Bending from the front, however, yields different results. While no physical cracks have appeared, it does look like half the display is now unresponsive. Black and white streaks running down from the right side corners, but the left half of the tablet is still displaying text, although unresponsive. Let's find out why. Taking off the back cover is easy enough. No screws or glue to worry about. The dual cell battery takes up most of the real estate inside of this thing all 3,000 milliamp hours of it. The rest of the guts include the motherboard and a rather thick display. Apparently this thing is backlit with 35 LEDs that shine through the e-ink to illuminate the pixels at night. Very similar to the QLED technology we see on Samsung TVs, but illuminating grayscale instead of colors. Separating the outer plastic from the pixels reveals that there is actually quite a bit of glass inside so the screens are crackable even if glass isn't on the exterior. There is one additional layer between us and the pixels, which are still amazingly turned on. These 16 shades of gray don't mess around. Apparently when the pixels are flipped to black or white they stay in that orientation forever, even in death this e-ink display is taking its job seriously. The words and letters are permanently etched onto the tablet's surface. Scratching past the layers of pixels we can see a copper mesh that's used to find the stylus. Regular Kindles that don't have a stylus would also not have this mesh. It's very, very interesting. I hope any grandmas passing by haven't entirely lost their faith in this new generation. We do the durability test for science of course, and the joy of learning new things. And grandma, if you're looking for a much happier, non-destructive video, I'll link our off-road wheelchair project for kids that was just released last week. Definitely one of my favorite videos. Like I mentioned at the beginning, I do have an extra Kindle Scribe to give away. Just be subscribed and leave any comment down below any comment at all. I'm curious though, when was the last time you sat down and read a book. Let me know. And as always thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Kindle Scribe",
        "eink",
        "eink display",
        "stylus",
        "Scribe",
        "eink tablet",
        "Black",
        "Kindle",
        "pretty",
        "tablet",
        "Huel Black",
        "find",
        "Huel",
        "screen",
        "display",
        "pixels",
        "eink ereader",
        "time",
        "white",
        "extra Kindle Scribe"
    ],
    "transcript_entity_values": [
        "Kindle",
        "15 pounds",
        "13 million",
        "the Kindle Scribe",
        "days",
        "Ohio",
        "35",
        "about 600 years",
        "up to three months",
        "100%",
        "two",
        "around $370",
        "40 grams",
        "16",
        "thousands",
        "Huel Black",
        "27",
        "Regular Kindles",
        "half",
        "last June",
        "4",
        "Kindle",
        "Amazon",
        "night",
        "last week",
        "iPad",
        "10.2 inch",
        "Gutenberg",
        "daily",
        "Over 270 million",
        "300 pixels per inch",
        "Scribe",
        "first",
        "second",
        "this Kindle Scribe",
        "Kindle Scribe",
        "weeks",
        "today",
        "Samsung",
        "all 3,000 milliamp hours",
        "over 100",
        "Today",
        "Huel",
        "12 month",
        "less than $100",
        "3",
        "the Kindle Scribe",
        "less than 60 seconds",
        "50",
        "one",
        "New year"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "GPE",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORDINAL",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "LAW",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "EVENT"
    ]
}