{
    "id": "TY7sWql_9oo",
    "title": "The History of Apple's Easy-Open Feature (Apple II and Macintosh Products)",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2018-09-27T20:00:45Z",
    "video_url": "https://www.youtube.com/watch?v=TY7sWql_9oo",
    "category": "Science & Technology",
    "tags": [
        "The History of Apple's Easy-Open Feature (Apple II and Macintosh Products)",
        "Apple",
        "Mac",
        "Apple IIe Enhanced",
        "Mac mini",
        "Mac Pro",
        "Power Mac G4 Cube",
        "Opening a Mac",
        "Mac upgrade",
        "Expansion",
        "PowerBook G4",
        "Vintage",
        "Tech",
        "Computer",
        "iMac G3",
        "iMac",
        "Macintosh SE",
        "TidBytes",
        "Mac History",
        "Apple History"
    ],
    "views": 17557,
    "likes": 684,
    "comments_count": 135,
    "description": "Today, we'll look at the history of Apple's \"easy-open\" feature; Apple products, especially Macs, used to be simple to open. We'll talk about the Apple IIe Enhanced, and time-travel all the way to the 2013 Mac Pro.  Get more vintage Apple tech!   Dont miss future tech videos!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?    COMPUTER CLAN COLLABORATORS INVOLVED IN THIS VIDEO Ken (Hildron101010) Zach Unferth iTek (@itekapple)  Amazon links are powered by the Amazon Associates Program.  #AppleProductHistoryCC #Apple #ComputerClan",
    "description_links": [
        "http://applevault.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- Greetings internet, Ken here from the Computer Clan and today, we're gonna talk about, opening Macs. You really don't see this nowadays, do ya? Nowadays we kinda make fun of Apple for making their Macs very hard to open, which results in low repair-ability and low upgrade-ability. But, it didn't always use to be that way. Doors, sliding panels, covers, you name it. Apple had unique, and sometimes fun ways for users to open up their Macs without using tools. Now I don't have every single computer, so bear with me, but I will show the stuff I do have. The original Macintosh, really didn't start with this whole easy open design, but a little while later with the Macintosh SE, the SE stood for \"System Expansion\", there was at least some kind of upgrade ability, functionality in it. Now it didn't really have an easy open feature, but the computer wasn't inherently too hard to open. Yes, you still had to use tools, but you could remove the whole case and get to all the components rather easily. Technically the system expansion features would be serviced by professionals not by the typical end user. So let's rewind a little bit to March of 1985 with the Apple IIe Enhanced, this computer could be opened easily without tools, you just take the tabs on the back and flip the cover off. Boom, you had all the components on the inside, and all the expansion slots easily accessible. Jump to September of 1989, the Macintosh IIci had a similar feature to the Apple IIe Enhanced, there were just some tabs on the back, you lift 'em up, and you could throw the cover off. You have the inside completely accessible, again, no tools necessary. So let's go to February of 1993 with the Macintosh Color Classic. So, this was an all-in-one, kinda like the Macintosh SE, so it wasn't that easy to open up all together, but there was still an easy open feature on the back. No tools needed, you could pop the panel off and the motherboard would literally slide out like a drawer and you can get to the components on the motherboard. And we actually do show this feature and other parts of the Macintosh Color Classic, on Vintage Apple Vault, if you want to get a more in-depth look at that computer. So now we come to a fun one, the iconic door feature of the Power Mac G3 blue and white, introduced January 1999. You could just lift the handle, and pull the door down and all the components would be easily accessible, and the computer could even run while the door is open. So a few months later, introduced in July of 1999, we have the iBook G3 clamshell, there was some other PowerBook computers from Apple that had a similar feature but the iBook G3 did it in a new, elegant way. You could flip down these little tabs on the keyboard and remove the keyboard giving you access to some components and there was even a little panel on the back where you could get to the battery easily without having to use a tool, you could just use your fingernails or a coin or something to undue the little hatch. And that's a feature you don't see anymore in Apple products, actually Michael MJD summed it up pretty well in Vintage Apple Vault. - [Michael] And this is so unlike Apple, at least today, by the way. - So when the iMac was introduced it didn't feature any kind of easy open functionality, to open it up you would need tools and little more of advanced knowledge. But the updated versions that came out in October 1999, had some easy open features, there was a simple hatch on the bottom, very similar to that iBook, you can just put a coin in there or even your fingernail, and undue the little screw on the hatch and you can get to the RAM and the AirPort card rather easily. And now we come to another fun one, oh my gosh, this is probably my favorite. The Power Mac G4 Cube, so this was introduced in July of 2000 and on the bottom of the computer there was this little push handle, you would push it and it would retract out, and then you could grip on that handle and literally lift the whole core of the computer out of the chassis. And all the components were accessible. I'm not saying everything could be upgraded or easily switched out, but the components were still accessible and that's the only point I'm trying to get across. Again a tool-less easy open design, that was a cool feature of the short-lived, Power Mac G4 cube, which we also do explore more in Vintage Apple Vault, if you'd like to check that out. And the funny thing is, this computer was introduced way back in 2000 and kinda has a similar feature to a newer Mac, this is the same but different, it's like the opposite, I'll show you that in a sec. From the 2000s on, Apple started phasing out more of the easy open features. There was still some basic functionalities, where you could undue a little screw on a panel to get to the RAM on an iMac, or something like that. But mainly, you would only have the easy open features on the Mac Pro, the other computers that started getting phased out, yes you could still open up the computers with tools but as time went on, the computers started getting a little more sealed off, and if you look on iFixit, you'll even see some downward spiraling of the repair-ability scores. So even though Apple was moving away from that for most of their computers, the Mac Pro still had an easy open side panel. I mean heck, even the Mac Mini had an easy open hatch on the bottom, the first generation Mac Minis didn't, those were a little more tricky to open but later they introduced this nice little twist cover feature on the Mac Mini and that was cool and then they of course sealed the bottom when they updated it later, but you know that's kind of what Apple does now, they seal stuff off. The latest Mac as of 2018 to feature an easy open design is the late 2013 Mac Pro, this is kind of the opposite of that G4 Cube, with the G4 Cube you extracted the core from the case, but with the Mac Pro, you kind of extract the case from the core. It has an easy open design with a simple little locking switch and you can get access to the components. It's pretty cool design, but that's really the only remaining Mac, modern Mac, with any kind of easy open tool-less functionality. Apple miniaturizes a lot now, to make high-performing thin computers, they have to seal stuff off. Even the $13,000 iMac Pro is like a fully sealed machine. What do you think though, is it worth it? Should Apple continue sealing these computers more or should they maybe go back to some more easy open functionality. I'm a little indifferent but I wanna know what you think, and I wanna know what your favorite easy open feature from the past computers was, so feel free to drop a comment down below, and if you want to look more at these other vintage apple products, feel free to check out Vintage Apple Vault too. So there you have it, thanks for watching guys, and I'll see you in the not too distant future.",
    "transcript_keywords": [
        "Vintage Apple Vault",
        "easy open",
        "Apple",
        "open",
        "Mac",
        "Vintage Apple",
        "easy open feature",
        "Mac Pro",
        "Apple Vault",
        "easy",
        "easy open design",
        "Power Mac",
        "Computer Clan",
        "feature",
        "Macintosh Color Classic",
        "open feature",
        "Computer",
        "Mac Mini",
        "computers",
        "Apple IIe Enhanced"
    ],
    "transcript_entity_values": [
        "Ken",
        "AirPort",
        "Macs",
        "the 2000s",
        "the Macintosh IIci",
        "Michael MJD",
        "SE",
        "the Mac Pro",
        "the Mac Mini",
        "Apple",
        "the Power Mac G3",
        "Macintosh Color Classic",
        "January 1999",
        "PowerBook",
        "October 1999",
        "sec",
        "Mac",
        "Macintosh",
        "July of 2000",
        "Mac",
        "today",
        "Mac Minis",
        "the Mac Pro",
        "The Power Mac G4 Cube",
        "Vintage Apple Vault",
        "RAM",
        "iFixit",
        "first",
        "iBook",
        "Power Mac G4",
        "2000",
        "iMac",
        "$13,000 iMac Pro",
        "2018",
        "the Mac Mini",
        "February of 1993",
        "G3",
        "the Computer Clan",
        "September of 1989",
        "Michael",
        "a few months later",
        "March of 1985",
        "July of 1999",
        "Macs"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "FAC",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "DATE",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "ORG"
    ]
}