{
    "id": "tYUC_Ni3lb4",
    "title": "Samsung Galaxy Ring Review: I Wanted to Love It!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2024-07-19T00:56:54Z",
    "video_url": "https://www.youtube.com/watch?v=tYUC_Ni3lb4",
    "category": "Science & Technology",
    "tags": [
        "Galaxy ring",
        "Galaxy Ring",
        "Samsung Galaxy ring",
        "MKBHD",
        "Galaxy ring review",
        "Galaxy ring vs",
        "Oura ring",
        "Ultrahuman ring",
        "Galaxy ring features"
    ],
    "views": 3305326,
    "likes": 100381,
    "comments_count": 4354,
    "description": "Smart rings are fun fitness trackers, but turns out they're not for me.  Get $350 off the Pod 4 Ultra or $200 off the Pod 4 at   MKBHD Merch:   Tech I'm using right now:   Playlist of MKBHD Intro music:   Samsung provided the Galaxy Ring for review.  ~",
    "description_links": [
        "https://eightsleep.com/MKBHD",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - I have learned a lot about rings and about myself in the past week of testing the Galaxy Ring. It's been an adventure, I've got it resized, I've had some existential thoughts, and at the end I have maybe a hot take on smart rings versus smartwatches. So, buckle up (upbeat music) (camera shuttering) Smart rings, they've been around for a while now. The Oura Ring came out like 10 years ago as a kickstarter, but the main point of these, the whole advantage of it, is you can wear it 24/7. 24 hours a day, seven days a week. It has a seven-day-long battery life. So, the whole idea, is you just walk around like living life with a ring on like normal. Living, eating, sleeping, showering, swimming, whatever, just with a ring. And that's honestly, the most impressive thing about the smart ring to me, is the fact that it gets so close in dimensions to like a regular ring that some people would wear. Now, keep in mind if you have smaller hands, it'll look bigger, but it's 2.6 millimeters thick, so it kind of bulges around your finger, but aside from that, it just looks normal. It's not a tiny ring, but I mean that it's still, I'm impressed by how much tech they shove into this tiny little frame. And by tech, I mean a small battery and a couple pretty basic sensors. But when you put it all together, you get this all-day activity tracker that you can kind of just put on at the beginning of the week and then forget about it, not worry about the battery life, just wear it every day, every night, and then just get a ton of valuable insight on your health and sleep and energy levels. At least, that's the ideal use case. Now, I have never worn a ring before, so there's always some layer of like getting used to wearing something on your finger every day. But then on top of that, there are a couple other best practices like things you should know about wearing this one. So, first of all, there is a correct way to wear it, okay? All the sensors are on the same side of the ring lined up at the bottom with this little notch. So, you're supposed to align all those sensors with the palm side of your hand for the best readings, and then you're supposed to wear it on your index finger for the best results. So apparently, not actually, on your ring finger. So, once you get this right, you should have all the info showing up in the Samsung Health app. This is calories burned, steps taken, how many miles you've covered, and it all accumulates it together with this one energy score, which is out of 100. So, I was wearing my Apple Watch Ultra at the same exact time that I was testing the ring. And so, I'm looking at the numbers back and forth and it seems like the ring and the watch are way off from each other. Like the ring, I'm just gonna say it's over counting a lot of regular activity, but then it didn't count nearly as many floors climbed for some reason. So, I don't know, there's just, there's a big delta between these numbers. And then I also at one point took the ring off for a while around 10:00 pm one day, more on that later, but it continued to show heart rate ranges all the way you can see here until 03:00 am when I am definitely not wearing it. That's kind of weird. You know, I did that challenge a while ago of walking 1,000 steps in a bunch of smartwatches and with a pedometer and they were all within a few percent of each other. So, I think I lean towards trusting the watch over the ring numbers. But that brings me to the importance of sizing, because you only get one size, you don't get to adjust it like you would with a watch, right? So, you might've seen this right here. This thing is Samsung's ring sizing kit. You can buy this on their site for 10 bucks and then you get a whole bunch of different plastic versions of the ring and they even have the nubs on the inside for the sensors. So, you try a bunch of these on and you try to figure which one is the most snug, but won't fall off, and that'll be the size of the ring that you get. And then you get 10 bucks off the ring itself. So, I bring this up because I totally did the size kit thing, either with the wrong finger, I did something wrong, because I ended up with a ring size 11, which it was a little too big when I got the actual ring. And so, I noticed that because it was kind of loose, it didn't really feel comfortable all the time. And then there would be like gaps in my sleep readings, which probably just meant that it was like pushed off of my finger while I was asleep and it wasn't actually reading anything. So, I got a new size, I got the size 10 and then it felt much better. And by the way, it turns out the index finger is a much better place to put like a heart rate monitor and other sorts of vitals sensors than the back of the wrist. This is one of those weird secrets or whatever that nobody really talks about with smartwatches, which is that the back of the wrist is a horrible place to measure any of this stuff. But yeah, the ring, that's where you should get that info. Now, here's the thing that using this smart ring for a while actually, taught me about myself. All of the benefits are still true, like it's more wearable than a watch 24/7, definitely. It's got that full week-long battery life. It's legit. You can basically forget you're wearing it after a few days in a row and have lots of ways to wear it out. It's more versatile. You don't have to dress it up or dress it down to match an outfit. It's just a simple concave titanium design that looks good anywhere. There's three colors, gold, silver or matte black. So, you already know this matte black one feels right at home. I've just discovered that I'm not a big smart ring person myself. That's just what it's come down to. The main thing is the activities that I do that I care about the most, I can't have anything on my hands. Like number one, ultimate Frisbee, a lot of throwing, a lot of catching. Golf, where the ring again just doesn't work. And weight training, a lot of grip stuff, just can't have a ring on. So, for each of those major workout activities, I take the ring off, which defeats the purpose of a fitness tracker that's supposed to know everything about my fitness when it's not tracking the most workout stuff that I do. Now, I did keep the ring on for some other like lighter plyo workouts, and there is auto workout detection, but with the lighter workouts like where you're not moving quickly and your heart rate doesn't spike up super high, then the auto workout detection didn't work super well, at least for me. And same thing for sleep tracking, I had a couple of days on here where it thinks I actually, didn't go to sleep until midnight when I was actually in bed earlier than that with the ring on. I just didn't know. And I can see the exact numbers, because the smart mattress cover, the Eight Sleep, did pick up everything, which is a great segue, because this video is sponsored by Eight Sleep. So, I was recently telling you guys how the two times better cooling performance was helping me actually, sleep better and getting more 100 sleep scores, which it still is, but also the autopilot intelligence automatically adjust the temperature throughout the night and the elevation on the Ultra responding to sensor readings to find the optimal sleep conditions. So altogether, the Pod 4s tech is clinically validated to increase total sleep time by up to an hour every night, and increase deep sleep up to 2.5 hours a month, and reduce wake up time by up to three hours per month, and is just as comfortable as the last gen. So, I kind of love it. So, if you wanna check out one for yourself, you can go to EightSleep.com/mkbhd and get 350 bucks off a Pod 4 Ultra or 200 bucks off a Pod 4. And with that money, you could get a whole smart ring, actually. But anyway, my point is, if I am taking my ring off for my most important workout activities, then this is not a great activity tracker for me, clearly. And even for my lighter workouts, turned out the wrist thing that I have on that has a screen on it, even though it's not the optimal place and it's not the optimal form factor to wear 24/7, I can tell it when I'm starting a workout and I can actually have it track the specific sets of time where I'm using it for a workout that I needed to know everything about. So, the ring, I like the idea of it, but it's just not for me, which is really too bad, 'cause I love the idea of it not distracting me with notifications. It never vibrates, it never makes any noise, there's no speaker in it. It's just this 24/7 ultra minimal smart wearable with a stripped down feature set that you can wear for a week at a time, like that's a sick idea. And Samsung's made this nice little case for theirs that charges the ring inductively from the inside and has these clever little LEDs to indicate how much battery is left in the case and in the ring. So, it can charge the ring up to 1.5 more times with its own built-in battery. So, it's not meant to replace a smartwatch, it's just a different offering of a product into the same ecosystem. But that conveniently brings me to my last point, which is they've leaned heavy into the ecosystem thing with the Galaxy Ring. So, there are some specific Samsung-only features where like you can dismiss an alarm or take a picture with a gesture with your Samsung phone, which is hilarious. I don't think anyone's gonna do that very often. But it also only works with a Samsung Galaxy phone, that's according to Samsung on their site, so that the Galaxy Ring can only be paired to a Galaxy phone. Not any Android phone, just a Samsung phone. So, I happen to be using a Samsung phone right now and that's fine and I can test it, but if I was using a Pixel or something else, I don't see what would stop me from just picking up an Oura ring, or an Ultrahuman ring, or any of those others, which basically, have the same feature set, but work with any Android phone. Other than this one not having a subscription, which actually, is pretty sick. So, at the end of the day, this ring is for people who already have a Samsung phone and who prefer the wearability of a ring over the functionality of something like a smartwatch, because a smartwatch clearly is more functional, but less wearable. So, this thing is all about this simplicity, which is probably a good time to mention the one feature that I wish the ring did have, which is either like some sort of tiny speaker, or maybe some ultra wideband antenna, or something like that. Something to make it easier to find, if you lose it, because if you do lose it, well, this is a really hard to find. Like there's a Find My function in the app, which I can tell you gives you the rough GPS location based on the last spot that it was connected to your phone. And it can light up the LEDs on the inside that it uses to measure heart rate. So, if it's really dark, maybe you'll see it visually, but if it's not out somewhere invisible, like if it's in a pocket, or underneath something, or outta sight, then yeah, you've got about as good a chance of finding this as a regular ring, which yeah, is what did actually end up happening to me. The other smaller ring that I was wearing before I got this one resized, at some point it fell off my wrist or hand and I just never found it. So, yeah, Samsung, if you're watching this, sorry about that. Hopefully, I do find it at some point and I can ship it back to you. But that's my feature request, along with hopefully, not giving me phantom heart rate readings till 03:00 in the morning. That's still kind of creepy. Anyway, that's been it. Thanks for watching. Let me know what you think, and I'll catch you guys in the next one. Peace. (upbeat music)",
    "transcript_keywords": [
        "Ring",
        "smart ring",
        "Galaxy Ring",
        "Samsung",
        "Samsung phone",
        "sleep",
        "thing",
        "Oura Ring",
        "wear",
        "Samsung ring",
        "phone",
        "smart",
        "Samsung ring sizing",
        "Samsung Galaxy phone",
        "workout",
        "rings",
        "finger",
        "Galaxy",
        "time",
        "regular ring"
    ],
    "transcript_entity_values": [
        "Oura",
        "the Galaxy Ring",
        "three",
        "10 years ago",
        "seven days",
        "around 10:00 pm one day",
        "one",
        "up to an hour",
        "a couple of days",
        "up to 1.5",
        "The Oura Ring",
        "11",
        "Frisbee",
        "350 bucks",
        "the end of the day",
        "03:00 in the morning",
        "Pod 4",
        "10",
        "4s",
        "Android",
        "every night",
        "a week",
        "first",
        "03:00 am",
        "a few percent",
        "2.6 millimeters",
        "Ultrahuman",
        "midnight",
        "the beginning of the week",
        "100",
        "the night",
        "24 hours",
        "a few days",
        "week-long",
        "Galaxy",
        "24/7",
        "up to 2.5 hours",
        "200 bucks",
        "the past week",
        "10 bucks",
        "Samsung Galaxy",
        "seven-day-long",
        "Ultra",
        "Apple Watch Ultra",
        "1,000",
        "Eight",
        "two",
        "a ton",
        "Pod 4 Ultra",
        "up to three hours",
        "Samsung"
    ],
    "transcript_entity_types": [
        "GPE",
        "FAC",
        "CARDINAL",
        "DATE",
        "DATE",
        "TIME",
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "DATE",
        "TIME",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "ORDINAL",
        "TIME",
        "PERCENT",
        "QUANTITY",
        "PERSON",
        "TIME",
        "DATE",
        "CARDINAL",
        "TIME",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "TIME",
        "MONEY",
        "DATE",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "TIME",
        "ORG"
    ]
}