{
    "id": "TZcgvi_KRvY",
    "title": "WiFi hacking like Mr Robot (with OTW)",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2023-12-17T14:30:09Z",
    "video_url": "https://www.youtube.com/watch?v=TZcgvi_KRvY",
    "category": "Science & Technology",
    "tags": [
        "wifi",
        "wifi hacking",
        "scanner",
        "wifi scanner",
        "hacking",
        "hackers",
        "ethical hacker",
        "ethical hacking",
        "hacker",
        "hacking course",
        "hacking tutorial",
        "learn hacking",
        "ceh",
        "how to hack",
        "wifi password",
        "wi-fi",
        "wpa2",
        "wpa3",
        "panda wifi",
        "alfa",
        "alfa adapter",
        "wifite",
        "hashcat wpa2",
        "how to hack wifi password",
        "penetration testing",
        "wpa2 cracking",
        "wifi password hacker",
        "wifi password hacker app",
        "hashcat wifi cracking",
        "wireless security",
        "wpa2 hacking",
        "wifi cracking",
        "spiderman",
        "flipper zero",
        "flipper",
        "mr robot",
        "robot"
    ],
    "views": 260593,
    "likes": 9168,
    "comments_count": 394,
    "description": "Occupy the Web shows us how to hack WiFi like in Mr Robot. No need to use a password dictionary or brute force. A different method is used here (wifiphisher)  // Occupy The Web Books //  Linux Basics for Hackers:   Getting Started Becoming a Master Hacker:   Network Basics for hackers:    // OTW Discount //  Use the code BOMBAL to get a 20% discount off anything from OTW's website:    Direct links to courses:  Pro Subscriber:    // Occupy The Web SOCIAL //  Twitter:    // Playlists mentioned // Linux Basics for Hackers:     Mr Robot:    Flipper Zero:    // David's SOCIAL //  Discord:   X / Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:   YouTube:   // MY STUFF //    // SPONSORS //  Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  // MENU // 00:00 - Coming up 00:42 - OccupyTheWeb books 01:38 - Wi-Fi Phishing // Cracking WPA2 passwords 04:17 - The importance of Social Engineering 06:45 - New movie by Sam Esmail (creator of Mr. Robot) 08:58 - Social Engineering in Mr. Robot 09:39 - Wi-Fi Phishing demo // Using Wi-Fi Phisher in Linux 17:19 - Wi-Fi Phishing demo// What the phishing victim sees 17:49 - Wi-Fi Phishing demo continued 20:17 - Social Engineering is part of hacking 20:55 - Turning up the wattage limit on APs 21:38 - Summary of Wi-Fi Phishing demo 23:09 - Reasons to use a Deauth command in Wi-Fi Phishing 25:41 - Changing countries/region on APs to change wattage limits // Rogue Access Points 27:40 - Other techniques to do Wi-Fi Phishing 29:43 - OTW's SDR/radio hacking // Flipper Zero 35:08 - Future videos with OTW 36:04 - Conclusion  wifi wifi hack wifi hacking wifi phishing wifi phisher wifi mr robot mr robot rogue access point rogue ap  #wifi #kalilinux #hacking",
    "description_links": [
        "https://amzn.to/3JlAQXe",
        "https://amzn.to/3qCQbvh",
        "https://amzn.to/3W1iiCQ",
        "https://davidbombal.wiki/otw",
        "https://davidbombal.wiki/otwprosub",
        "https://twitter.com/three_cube",
        "https://www.youtube.com/watch?v=YJUVNlmIO6E",
        "https://www.youtube.com/watch?v=3yiT_WMlosg",
        "https://www.youtube.com/watch?v=F5iiwounbzY",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/@davidbombal",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "One of the things that we I always tell my students and hackers and anybody who's in this field is that social engineering is really really important. If you if you forget or if you ignore social engineering you're going to miss out a big part of what actually takes place in hacking. You know this is actually a pretty complex piece of software but it works really pretty flawlessly it works really well and is able to capture your password and most people will never detect that they're on you a what's basically an evil twin. Hey everyone it's David Bombal back with the amazing Occupy the Web, OTW welcome. Thank you David it's always an honor to be on the best IT and cyber security channel on YouTube. I appreciate you saying that and just for everyone who hasn't seen our previous videos which you know you should have I've linked a whole bunch below but if you don't know who OT W is, he's the author of this book Linux Basics for Hackers very very popular book I think it's been number one on Amazon for a long time right? It's been it's been Amazon most a number one Linux book on Amazon for most of the last five years although there has been a couple times when it's been number two but right now it's number one and probably stay at number one. And if you want to see videos where Occupy the Weband I talk about this book I've link that below as well where we do like sort of a video companion guide to the book. He's also the author of this book Getting Started Becoming A Master Hacker as well as one of my favorites Network Basics for Hackers. Occupy the Web we've got a really exciting one today. We did a whole bunch of Mr Robot videos and we haven't done one for a while a lot of people have been asking for one and I think the one that you're going to cover today is like a really cool one. Yeah it's a it's an interesting one because couple of things is that I often get I get lots of emails from people who try who try to hack wifi and they'll they'll say to me I've been working on this for days and weeks and months and I've not been able to crack the password and sometimes they're just making simple mistakes but when we're talking about WPA 2 which is what most of the Wi-Fi access points are at this point in time it's basically a a password guessing exercise so what you do is you put together a good password list and you try to to you hash each one of those passwords and see if it match is the hash that you captured from the exchange between the client and the AP that makes sense and in some cases the passwords might be in another language and so oftentimes I'll have people write me and say yeah I've been trying this the RockYou password list for days and I haven't gotten anything it's like what what what language are you is your is your native language and you know. Well it's it's Spanish. Well you need to use a Spanish list right. So these are kind of simple things that people people forget sometimes and if you're obviously in a country using Cyrillic alphabet you need to use a list with a Cyrillic alphabet list or if you're using you whatever language it has to be it has to match what is the probable language of the password on the system all right so keep that in mind just using any password list is not going to get you anywhere. People often use that RockYou list which you know is fine I actually prefer I recommend that people use I have a couple of password list hackers arise that are the top 10,000 and the top 1 million passwords so these are passwords that we know that people use because they've come out of the data dumps for passwords. So we simply go through all those passwords that appear in those data dumps on the dark web and collect the 1 million most common passwords which turns out the top 1 million passwords account for a about 30% of all the password is being used. So it's not a sure fire by any means that you're going to get it. It's gives you about a one out of three chance which is pretty good chance to get it if you use one of those passwords. There's still there's still that two third that you're not it's not going to work against. And so one of the things that we I always tell my students and hackers and anybody who's in this field is that social engineering is really really important. If you if you forget or if you ignore social engineering you're going to miss out on a big part of what actually takes place in hacking you know often times newbies to hacking will go oh I I know that's that's not that's not technical that's not that's not real hacking you know if you're social engineer. Let me tell you that the Russian hackers use it, the Chinese hackers use social engineering, that criminal gangs use social engineering, you've probably seen lots of emails you know he's probably seen lots of emails that are basically social engineering emails and most of them are poorly designed and they're not going to work except against you know really naive people. For instance soon after the war between Ukraine and and Russia started I started getting a lot of social engineering attacks from the Russians. They were none of them were successful they were some of them were pretty good some of them were not those attacks have dwindled now I don't get as many from them but I got lots of them initially imagine yeah yeah and so they none of them worked but you know you're you're trying to hack somebody who's who who doesn't trust anybody right I don't I don't trust anything right but you know there's been times in my life when I have gotten emails or or uh text messages that look very very convincing you know I think I've told the story before that I I got a few years ago you know my cell carrier sends me an email every month saying here your bill is ready you know go ahead and pay it now and I got one from them it looked perfect like it came from my cell carrier and it was like triple of the normal amount and I'm like oh my god what happened you know why why are they charging me three times as much I need to click on this and check my bill which is exactly what they wanted me to do. And I almost did it and then I went wait a minute this isn't the this isn't the day of the month that I get my bill and that's how close I came to clicking on that one but there's a lot of other good ones that are out there but my point simply is is that even the best hackers in the world use social engineering and you can't ignore social engineering. I'm going to go back to Mr Robot okay which is a a great show as you know it's probably one of my favorite hacker shows you know I've I've watched nearly all of the hacker movies and TV shows which by the way I wanted to put a little plug in for a new Netflix show that's coming out today uh in at least in the US is coming out today and it's by the same fellow who did Mr Robot and it's called but Leave the World Behind I think is what it's called let me check on it and so it's a it's a story of a massive Cyber attack that knocks out all the digital systems at some point in the future and this is something that I think is a real possibility I think it's a I think massive DDOS attacks are something we're going to see in the very near future especially in a world of IoT devices. So keep in mind take a take a look at that show if you get a chance it's on Netflix if you have Netflix it's by Sam Esmail who's the same guy who did Mr Robot and Sam makes sure that his hacking is real. That's what we love about his shows now in Mr Robot you know about episode three somewhere around there he's talking about how he hacks everybody's passwords. You know how easy it is to hack their passwords basically he's going through and and creating custom password list based upon Facebook details what have you he's he's going ahead and doing open source Intelligence on them and then using that to create password lists which we have uh some tutorials on hackers and realize how to do that. But if you remember his next door neighbor is Shayla, Shayla eventually becomes his girlfriend quasi girlfriend okay his girlfriend who ends up getting killed hopefully I didn't do any spoilers for people who haven't seen it who end up dying but in any case he gets her password by social engineering. He says oh I got Shayla's password by social engineering. Well he lives next door in an apartment next to hers. You don't actually know me all you know is that I'm of course I know Shayla I hacked her email as soon as she moved in next door with a simple phishing scam I owned her password pretty easily. I'm not talking about the stuff you can find online. And so it's pretty clear I think that he got social engineered her through Wi-Fi so she lives next door so he can reach her Wi-Fi right they can everybody can see everybody's Wi-Fi access points within you can usually see with a a normal antenna on your with your uh Wi-Fi adapter about about 100 meters all right. If you put specialized antenna is you can go much farther than that but he probably used a socially engineering attack against her Wi-Fi and that's what I want to show you how he did that today. So there there's an application called Wi-Fi Phisher that is excellent now it's gone through multiple iterations over time so if you've used it in the past and it didn't work well for you try it again because it's gotten pretty good. So what it's built into some of the Kali's but not all of the Kali's so I'm using this case today I'm using 2022-3 I believe that's what this is so we need to go sudo apt okay sudo gives us root privileges right. Apt is the package manager that's built into Debian all right so sudo apt and then we tell it what we want to do we want to install and then it's wifiphisher let's see if we can find it. Give password yeah okay it tells me that Wifiphisher is already the newest version. It also gives me some other messages just that says that there are some applications on my system that have unmet dependencies you can see it right here since we're not using those that's not really an issue so if you get that error message don't worry about it if you don't have Kali anonsurf you're not going to get it but you might have other things on your system that have unmet dependencies and if you're not using them for in this case when won't be then you don't have to worry about this error message, this error message just really doesn't pertain to us. So we've got Wifiphisher let's go into sudo all right give us root privileges if you try to run it without sudo actually let's do that just to show you you try to run it without sudo it comes back with an error message said you got to be rooted right. No root user detected. So let's go ahead and use it as root okay and then's just do an -h there for help I whenever I'm running any tool I always like to either go to the help screen this usually the help screens are -h or they're dash dash double dash help okay so one of those two you know you can you can get the help screen and there you're going to find a lot of information about how to use the tool and that's what we have here there's a lot of information on how to use this tool. Now like everything there usually you can boil this down to very simple command right there's are lots of options here but what we want to do here okay is to go clear my screen and you can get pretty fancy with Wi-Fi Phisher but we don't have to. let's go sudo wifiphiser and then we got to go dash oh before we even do that we got to go do an if config we got to see if we have a a wireless adapter and it looks like we have several wireless adapters probably a better way okay is to go iwconfig which is the wireless and you can see I've got the wlan0, I've got some others that are configured for Wi-FiPhisher. It's important to note that to make this attack work you must have a wifi adapter that can be uh put into a monitor mode. Monitor mode mode is the equivalent of promiscuous mode on a wired network it means that it will see and pick up all of the traffic that's what we need to do right we need to pick up all the traffic normally your wired adapter or wireless adapter only will pick up the traffic that's destined for it what we need to do is to put it into promiscuous mode which in wireless world is called monitor mode and you see right here it says mode right here manage okay that's the default mode we have to get that into monitor mode. Do you have any favorite Wi-Fi adapter? Yeah I can I can definitely recommend the Alpha okay this is actually the one I'm using in today's class is a is quite an old one I think it's it's been around for quite a while and uh and also I wanted to point out that one I'm using VMware okay workstation is I'm work work with a virtual machine if I'm working with a virtual machine and you're using a WiFi adapter to get your internet access it is plugged into the virtual machine as wired so to do this you not you have to have another Wi-Fi adapter one that is capable of going into manage mode and two you have to plug it into your virtual machine so if I go up here and look here I look at removable devices you can see there it is there's the Ralink 802.11 okay it's an older but speed is not an issue here right so doesn't matter it's not matter if I have a old because speed is really irrelevant I can I can run this at old speeds because basically what I'm going to do is I'm basically going to put it a man in the middle attack between the wifi adapter and the client and make them believe that they need to enter their password to update their system what have you and that way I can get their password. So we know we've got we' got a Wi-Fi right there's wlan0 we know that it's this one's an Alpha it's an older Alpha and so what we need to do next is simply tell it sudo I'm going to clear my screen again so we're going to go sudo wifiphisher and then -i which is the interface wlan0 and then -e is what do I want to call the the AP the the Access Point. So I'm going to what I'm doing is I'm creating a new access point with the same name as the person I'm trying to social engineer. So let's assume that Shayla all right his nextd door neighbor has an access point called Shayla okay and and it you know it's we don't know it would be easy enough to look right we can easy enough to just scan the network to see what hers is and so what we're going to do here is we said we want to open up a AP called Shayla on wlan0 so we're turning our WiFi adapter our network adapter into an AP and we're calling it the ESSID or more commonly the SSID is going to be called Shayla. Let's go ahead and hit enter and there it goes here's my available Phishing option a firmware upgrade page. So what this will do is that when she goes to connect to her AP the Shayla AP it's going to give her a screen that says you need to update your firmware we need your password and then there's another one down below for the network manager connect. There's some others as well but right now let's just stay with with the firmware upgrade page let's go ahead and hit enter it's starting a fake access point and you can see that it's on channel six Shayla is the ESSID, it's on wlan0. All right so what Shayla is going to see let me show you what she's seeing. So this is what Shayla is seeing all right this is pops up on her screen and when she tries to connect it pops up a new version of the firmware has been detected in waiting installation please review the following terms and conditions and proceed you need to click she's going to click I agree with the above terms and conditions that looks really legitimate right and then put in then put in her pre-shared key that's what's appearing when she tries to connect to her AP all right. We got a couple of connected I'm going to go over and now attempt to connect the Shayla okay from another machine okay you can start to see that there's some traffic appearing the HTTP requests okay now Shayla is going to try to connect to her network and she's going to get the message I just showed you I'm getting it over here in another machine and I'm going to agree to the terms and conditions and I'm going to put now watch my screen what's going to happen here and then when she goes ahead and starts her upgrade watch what happens. There it is see the password popped up right there we know her password now. So you know this is actually a pretty complex piece of software but it works really pretty flawlessly it works really well and is able to capture passwords and most people will never detect that they're on you know a what's basically an evil twin okay this is what we're doing is we're putting up an evil twin that looks just like her AP and then asks her for update or upgrade on it so there's a this is a pretty easy way you I think that the screens are pretty legitimate looking as I showed you. Uh there's also ways that you can use the same software for um being able to install a a payload on their system. It's a pretty pretty pretty complex pretty advanced piece of software that does a really really good job. So on Shayla from Shayla's perspective it's going through a firmware update in progress screen let me show you what that looks like okay and and it takes it takes a couple minutes to go through this whole update in progress while you know we we've got our password now and uh let me show you what it looks like I got to capture it from your other computer so here's what's going on on Shayla's screen over here she's getting this and it's updating uh while we're capturing her password it it goes through like a couple of minutes doing this so it looks legitimate you know as it's trying to update her firmware so this is the way that Elliot was able to get passwords uh from at least from Shayla and I think it's one of the reasons that I wanted to talk about it is that once again I want to emphasize that social engineering is a real part of hacking right. It's a it's a key element of for most hackers that need to have in their toolbox and you need to do it well because you might only get one chance if people suspect you know for instance if Shayla suspects that this is not legitimate she's not going to go back there you only get one shot it's got to be look good, it has to be um legitimate looking and if you do it right you can get a lot of information this way. This will of course only work if you're within say about a 100 meters of the AP and the other thing that you want to keep in mind is that you want to be relatively close to the target physically close or turn up the wattage on your AP which is actually illegal all right. You know most countries have a limit on what your AP can project in the United States it's a half a watt but it's possible to get inside the firmware and change that that limitation on the wattage and some sometimes on the Alphas you can turn up the wattage four or five times I'm not going to show you that here because that's illegal that is illegal and YouTube would take it down immediately. So that's it that's our our social engineering of Shayla, we can see it came across the screen it was on there for a moment, we captured her password, now we can one log into her AP but probably more importantly it's likely that she's using that same password someplace else and and that's what uh Elliot does and although people won't always use exactly the same password they'll often use a variation and so once you've captured this password there are some tools like Cupp and Crunch which both of which we have tutorials on hackers rise that you can take that password that that basic password and add numbers and letters before and after it you can munge it by changing some of the letters into numbers and special character you know like at sign, dollar sign, dollar sign, w, 0, r, d that's called munge that's what you know everybody's taught to do to make your your password more difficult to crack so there are a lot of tools that can munge passwords including something as simple well that's so simple. Burp Suite can do it, you can do it with Burp Suite, you can do a number of other password crack in tools and you can make your own password lists that are munged by using things like um Crunch and Cupp. So Occupy the Web I just want to ask some questions that um think a lot of people maybe thinking about themselves. At the top there it says Deauth so I'm assuming what's happening is your your um adapter is deauth thereal access point or clients on the real access point so that the clients connect to this fake one right? That's exactly right yes so you know within WPA2 we have what's called the deauth command you I've I've I've written some tutorials that hackers arise it can be a really good tool for doing a DOS attack against an AP because it sends out a Deauth packet that is then kicks everybody off the AP and to you keep on sending it people can can never connect and that's what's happening up here is that it's deauthing the clients so they have to connect and they're going to connect to the other in this case Shayla the other AP with the same name. So they can't connect to the original but they can connect to the fake one that we just created. Yeah so I mean deauth from the real access point then the client automatically connects to the fake one and that's how you get her to put her credentials into that fake web page. What about WPA3? WPA3 is a whole another exercise and you know if my guess is I haven't tried this tool on WPA3 but this is a man on the- middle attack it's not cracking passwords it's basically um creating an evil twin so I haven't tried it against WPA3 but I think it'll work um but I don't know that the deauth will work on WPA3. I found yeah deauth doesn't work but you I mean that's where the power comes in right because if you set yours higher power or you're closer then the client may just connect to your access point rather than the other one. Exactly so you're you're system will try to connect to the strongest AP and it's in the case of of Elliott he's right next door and you know what he could do if he knew layout of her apartment is to put his AP right next to the wall where she's trying to connect that way he doesn't have to change the firmware as long as his AP is stronger appears stronger if it's closer it's going to appear stronger also as I mentioned it's possible to actually manipulate the firmware inside of these network adapters to have them use more power, to project more power than um is legally possible but we can't do that on YouTube. It's also like I've I'm not recommending once again because of legal rules that anyone does this but I've seen with a lot of um more advanced access points you can change the country right so that's one way to change the power because some countries allow much higher power than others so like in the US you have a lot more you allowed higher power than you allowed in in the UK as an example. Right and that's that's exactly right is that US is only limited to half a half a watt other countries don't have limitations uh, some some Nations have some Nations have larger and the higher limitations. The other thing is that in the US we only use channels 1 through 11 and most countries use channels 1 through 14 so sometimes it's important to know that because sometimes you which you can do if you're a hacker is use those channels on the 12, 13, 14 for nefarious purposes and it won't be seen by people who are scanning looking for you know often times the network security engineer is looking for illegal or malicious yeah rogue access points or connections and by using those other channels in a country like the US it's not going to appear to them they're not going to see it so there's these these National rules sometimes can be used to your advantage. I just think it's so easy I mean if if again we don't advocate this and you have to be really careful with the legal frameworks but um you know if you set yours to like Russia or some other country where they allow much higher power then your access point is going to be higher and this is where the whole discussion comes in about like looking how using software that looks for rogue access points and shuts them down because this kind of stuff like you've shown you so easy to do. Yes yeah rogue access points if you're a network engineer rogue access points are something you have to be cognizant of and be scanning for because you it can compromise your entire network. I mean you've shown how easy it is because the thing is you could and this is the problem with like WPA2 right as well if you you don't have to use a password list you could use a Brute Force attack using hashcat but then it's also limited on the number of characters it can do so you know if you use a really good password um then this is such an easy way around that problem if you want capture the password sorry go on. It's a it's a much easier way than trying to to crack WPA unless somebody's using a simple password which a lot of people do like I said there's you know about a third of people using simple passwords and you can crack them pretty easily but you know somebody who's very security conscious and has used a very complex password this is an easy way to capture their password and most people not everybody most people will fall for this and so it's a it's something that should be part of the hacker's tool kit is the social engineer if this one doesn't work there's other social engineering attacks that you can try yeah. I mean it's just thinking about it like you said this is good visibility for people who who not aware of it because like your phone or your other devices are just automatically going to connect to the one with the highest power um and then you're going to have that thing pop up so it's not as if you someone has to be tricked to connect to the access point the device is doing it by itself right? The act, the device is going to access by itself self to the the strongest access point, so yes so if you're close by or you're giving off a much stronger signal then you're going to get or one of the things that you can do also is use a directional antenna so use a directional antenna and shoot the signal directly at the user so it's going to appear stronger to them so like for instance a parabolic antenna. This one that I'm using right here has a high gain antenna on it but when I connect it to a parabolic antenna it's amazing what it's amazing i' I've got a good dish antenna outside and it's amazing what it can pick up it cost me about $150 $170 um but it can pick up Wi-Fi access points for great distances. I need to like talk about your SDR stuff because I I want to I want to plug that as well because you do the the software defined radio training and I mean Wi-Fi is just one frequency band right there's a whole bunch of other bands and like interesting things you can do? Yes, well I mean there's Wi-Fi is Wireless right so it's one of those radio signals that are out there but there are so many radio signals out there and the ones that you know you are maybe most interesting are the cell system right so in a recent class we built our own cell system, we built our own cellular system which is possible you can do this we can intercept satellite communications these are all radio sign so with the right software and the right hardware and it does get a little bit expensive you can go in with a $30 RTL-SDR which is about 30 bucks and that's a receiver and that works pretty good at a lot of things but it can't send a signal and so to get a good transceiver something that can both send and receive you're starting to look at $300 to $350 in our recent cell class we were using align SDR which is a it's about $500 $550 and then ideally you'd want a good antenna and so the antennas like I said I've got a parabolic that I use that's about I I paid $170 off Amazon and then for satellite hacking I have a a another antenna for satellites and GPS hacking GPS is one of those other things that is a radio signal right that you can go ahead and intercept and spoof your GPS these are all radio signals that people really haven't thought much about in terms of security until Flipper Zero came out. That that was my next question is the Flipper Zero a toy or is it a great tool what's your opinion? It's it's it's a limited you know it's I think it's great in increasing awareness of radio hacking but to really get into this subject and do it in depth you know you you've got a much greater processor, stronger processor powerful processor on your desktop or laptop okay you can put a better SDR on it and you have a whole host of software that you can install and run with a good RAM and a good processor that it's not possible on a little tiny Flipper Zero. Now Flipper Zero you know it's it's good for some things and I'm not gonna I'm not gonna you know talk it down it's but I am going to say that it's limited in what you can do okay it's limited in range, it's limited in software and it's limited in power there's it's limited in the the uh frequency range as well. So some of these other SDRs can cover a frequency range of like 1 kilohertz all the way up to six gigahertz that's a huge range and we start talking about things like GPS and cell you know those those are often operating in the 123 gigahertz range which is outside of the range of a Flipper Zero a lot of the home appliances that you know the Flipper Zero works really well against is they are operating in the less than one gigahertz range so that's where it works it's it it goes up to about 900 megahertz just short of a gigahertz but these others can do up to six gigahertz which covers a much broader range of the spectrum and allows you to do hacking like cell systems, like satellite systems that are up in this higher frequency range. In the case of 5G cell we're looking at 5G cell operating up in the 5 gigahertz range some of them are some of them are operating as low as 2 gigahertz to 5 gigahertz so the Flipper Zero just not going to it's not going to cut it in that field all right but it's a good place to start in radio hacking. Radio hacking is an under-appreciated field of penetration testing, cyber security whatever you want to call it that has been ignored for years and as a result like Scada hacking which is something that we do we have a class coming up in January in Scada hacking for years people just ignored Scada as as a cyber security vulnerability and a threat now that awareness is growing but because it was ignored for so long people didn't secure it and it many of these massive systems that run refineries and electricity grids were largely unprotected some of them still are and that's what Sam Esmail's new film is about is about those systems being attacked and I think that that's a very real possibility and that's why I'm excited I haven't seen the movie yet but I'm excited because I know one Sam Esmail makes good movies two he makes sure that his hacking is all realistic so I'm looking forward that's what on my agenda for tonight I think it's a it premieres tonight on Netflix so that's what I'll be doing tonight. Occupy the Web I really want to thank you for sharing your your knowledge and your experience and you know keeping it simple for people who are starting but also showing us you know sort of where things are going and you know what's possible we're going to have to get you back with dragon OS and like some other products where you show us more of the spectrum and stuff that you can do but I really want to thank for sharing. You're very welcome I'd love to be back and do some SDR hacking for your viewers because this is a area that I'm very enthusiastic about you can tell by my voice I'm enthusiastic about it, I love it, I think it's under-appreciated and I think that we're we're one of the few places that actually teach it so we can do a class of a video on Dragon OS introducing the uh the viewers to Dragon OS which is an Operating System designed specifically for radio hacking and then we'll look at maybe some of the other adapters and some of the strengths and weaknesses adapters and some of the attack vectors that we can use in this field. That's great I look forward to it for everyone who's watching put comments below stuff that you want to see Occupy the Web I will say I will end off with this a lot of comments whenever we delay posting a video for any length of time I get comments where you where are you where are you, when are you coming back, so thanks for know thanks for coming back so often and sharing your knowledge. I'll I'll always keep coming back folks so I it might be a little gaps in there but you can rest assured I'll be back",
    "transcript_keywords": [
        "password",
        "Shayla",
        "social engineering",
        "Access Point",
        "people",
        "passwords",
        "password list",
        "access",
        "WiFi access points",
        "social",
        "wifi",
        "good",
        "pretty",
        "connect",
        "point",
        "engineering",
        "WiFi adapter",
        "hacking",
        "hackers",
        "lot"
    ],
    "transcript_entity_values": [
        "YouTube",
        "30",
        "three",
        "13",
        "Burp Suite",
        "the last five years",
        "two",
        "four",
        "2022-3",
        "YouTube",
        "Occupy the Web",
        "Brute Force",
        "HTTP",
        "Ukraine",
        "Deauth",
        "170",
        "tonight",
        "Spanish",
        "Network Basics for Hackers",
        "a half a watt",
        "AP",
        "Scada",
        "a about 30%",
        "Russian",
        "up to",
        "David Bombal",
        "Wi-Fi",
        "Sam Esmail",
        "Sam",
        "the Flipper Zero",
        "months",
        "Facebook",
        "Cupp",
        "Wifiphisher",
        "half a half",
        "Sam Esmail's",
        "RTL-SDR",
        "about $150 $",
        "12",
        "January",
        "the day of the month",
        "a Flipper Zero",
        "2 gigahertz to 5 gigahertz",
        "about 30 bucks",
        "Shayla",
        "today",
        "a couple minutes",
        "Alpha",
        "OTW",
        "SSID",
        "Russians",
        "one",
        "Linux Basics for Hackers",
        "11",
        "a couple of minutes",
        "Flipper Zero",
        "UK",
        "Elliott",
        "Deauth",
        "IoT",
        "WPA",
        "about about 100 meters",
        "Russia",
        "days",
        "the United States",
        "a few years ago",
        "Wi-Fi",
        "Amazon",
        "years",
        "Cupp and Crunch",
        "about $500 $550",
        "WPA2",
        "David",
        "Wi-FiPhisher",
        "Spanish",
        "Linux",
        "Chinese",
        "VMware",
        "SDR",
        "5 gigahertz",
        "Nations",
        "two third",
        "Debian",
        "less than one gigahertz",
        "Dragon OS",
        "up to",
        "the Shayla AP",
        "1",
        "5",
        "US",
        "number two",
        "$300 to $350",
        "123 gigahertz",
        "Cyber",
        "a minute",
        "six",
        "National",
        "WPA 2",
        "the Access Point",
        "Netflix",
        "Intelligence",
        "every month",
        "five",
        "One",
        "six gigahertz",
        "10,000",
        "Wi-Fi Phisher",
        "1 kilohertz",
        "DDOS",
        "number one",
        "Kali",
        "ESSID",
        "about a third",
        "Robot",
        "about a 100 meters",
        "Elliot",
        "0",
        "weeks",
        "about 900 megahertz",
        "14",
        "Flipper Zero",
        "Cyrillic",
        "1 million",
        "Getting Started Becoming A Master Hacker"
    ],
    "transcript_entity_types": [
        "GPE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "MONEY",
        "TIME",
        "LANGUAGE",
        "ORG",
        "QUANTITY",
        "ORG",
        "GPE",
        "PERCENT",
        "NORP",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "DATE",
        "TIME",
        "LOC",
        "ORG",
        "ORG",
        "NORP",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "TIME",
        "PERSON",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "GPE",
        "DATE",
        "GPE",
        "DATE",
        "LOC",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "NORP",
        "PERSON",
        "NORP",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "WORK_OF_ART"
    ]
}