{
    "id": "U0YW7x9U5TQ",
    "title": "Electric cars prove we need to rethink brake lights",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2023-05-25T14:49:13Z",
    "video_url": "https://www.youtube.com/watch?v=U0YW7x9U5TQ",
    "category": "Science & Technology",
    "tags": [],
    "views": 4411822,
    "likes": 159351,
    "comments_count": 18890,
    "description": "Truly, this is a pressing issue. I hope somebody at the helm is watching.  Links 'n' stuff: The mentioned turn signal video   My other vehicular-lighting related content: On how we used to require all cars to have the same headlights   On why you can't get turn signals to synchronize (except now you can)   Technology Connextras (my second channel where stuff goes sometimes)   Technology Connections on Mastodon:   The TC Subreddit   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!   00:00 Intro 01:47 Demonstration 03:15 Regen braking and one-pedal driving 09:17 Somebody forgot about the brake lights 12:25 One solution that GM came up with 15:12 Adaptive cruise control 16:25 US regulations 21:15 The Boy who Cried Wolf problem 21:50 Europe's previously terrible regulations and their fix 25:47 An earnest call to action 28:38 Bloops",
    "description_links": [
        "https://youtu.be/O1lZ9n2bxWA",
        "https://youtu.be/c2J91UG6Fn8",
        "https://youtu.be/2z5A-COlDPk",
        "https://www.youtube.com/@TechnologyConnextras",
        "https://mas.to/@TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "If youve been following the channel for a little while, you may know that I think an awful lot about automotive lighting. Brake lights and turn signals take up far more of my brainspace than they arguably should - but, of course, when needlessly ambiguous combined stop and turn signals keep finding their way onto new car models in a world where the obviously better solution of separating those two signals into dedicated amber indicator lights for turning and dedicated red stop lamps for stopping is not only an option but in fact required in pretty much every country on the planet except for this one for some reason - well its prone to happen. But Ive already made a video about that. [clunk] This video is about a whole new and entirely different brake light problem! You didnt used to have to think about what makes a cars brake lights come on. They came on whenever you depressed the brake pedal. And since the brake pedal was the only thing that could slow the car enough to warrant the brake lights coming on, a simple switch on that pedal was all we needed. But this is swiftly changing. Modern cars often slow down all on their own - maybe youre using radar adaptive cruise control, or maybe the car has automatic emergency braking. Or perhaps you have an electric car with a one-pedal driving mode. And with these new features, we now have no choice but to control the brake lights with software. [thunderclap] As the old saying goes, one mans software is another mans nightmare, and somebody at Hyundai (and quite possibly Kia) really dropped the ball. The way the Hyundai Ioniq 5 handles its brake lights, or at least the US-market 2022 Hyundai Ioniq 5 with software as-delivered, is so astonishingly bad that I think it warrants a recall. And I assure you thats not hyperbole. Take a look, here I am going 60 miles an hour on a country road. And through the magic of buying two GoPros, heres the back of the car and its third brake light. Watch as I bring the car to a stop. [A descending whirr from the electric motors as wind and road noise diminish] Notice that the brake lights have not illuminated, but the vehicle is rapidly slowing. If this accelerometer app of mine is to be believed, its pulling about .25G with a peak almost .3. It only takes about 13 seconds to come to a stop from 60 miles an hour, but someone following me would have no warning that I was slowing down so rapidly. In fact, theyd only get the warning once I had stopped. A little late there, bud. Why didnt the brake lights illuminate? Thats a great question to ask Hyundai, but in the meantime I can tell you that although I was indeed commanding the car to stop, I never touched its brake pedal to do that. I was using the cars i-Pedal mode, which is Hyundais Apple-esque name for one-pedal driving. Ill explain what that is in a moment, but whats perhaps even worse than the cars just atrocious behavior is that, as far as I can tell, this is not actually violating any federal motor vehicle safety standards thanks to a technicality and poorly-worded, outdated regulations. Yay! To understand the problem here, first its important to understand what one-pedal-driving is and does. An electric car, just like any other, has an accelerator pedal and a brake pedal. And they work just like you would expect: press that one to go faster, and press that one to slow down. Hyundai even helpfully labeled them plus and minus in case you forget. In an ordinary car, the big one engages the friction brakes. But an electric car, along with most hybrids, can turn its electric motor into a generator and will use it to slow down whenever possible. This regenerative braking allows it to capture the kinetic energy of the moving car and put it back into the battery rather than just turn it into heat as brake pads do. And that makes the car more energy-efficient. The first hybrid cars (like most to this day) use the brake pedal to control this function. Rather than immediately engage with the brake master cylinder to squeeze the calipers together, the first portion of the brake pedals travel functions as a sensor input which gives the car a braking request value. If you stomp on the pedal and go past that sensor region it does directly engage with the friction brakes - you dont want a computer getting in the way of that. But except in panic-stops or low-traction situations, these blended-braking systems will use the electric motor to recapture as much energy as possible before blending in the friction brakes either when you need more braking force than the motor can muster or simply to bring the car to a complete stop. But the accelerator pedal is also a computer input. It hasnt been tugging on a real throttle cable for many years regardless of whats powering the car - it simply tells the cars powertrain control module essentially how much youre pushing on it, and then the PCM does whatever it needs to do to make the car go. But now that we have regen braking in the mix, you could also use the accelerator to make the car slow down. Rather than put zero forward power at the top of the pedals range of motion, you can put it down a ways and make the top quarter or so of the pedals travel range provide a braking input, with increasing brake intensity the more you let off the pedal. Doing this allows the driver to both accelerate and slow down with the same pedal, and when implemented well, it allows you to never touch the brake pedal except in emergencies. This is cool and lots of people really like this one-pedal driving, but it means we can no longer rely on the brake pedal switch alone to turn on the brake lights. And in case you werent aware, a cars brake lights ARE SUPER DUPER IMPORTANT! They warn the driver behind you that youre slowing down - potentially quite abruptly. You want that to be clear in an instant because youre not in control of the car behind you, somebody else is. And if you dont give that somebody else sufficient warning that your vehicle is slowing down right now, they might just run into you. And both parties involved would rather that not happen, which is the entire reason brake lights exist, dontcha know. Now, this newfangled electrical car still has a traditional brake pedal switch like cars of old. It needs it to enable the shift interlock and the whole depress brake to start vehicle thing, but it will still light up the rear end nice and bright. And the car does in fact rely on it for the brake lights in some settings. When I drive the car in either its Level 0 or Level 1 regen settings, that brake pedal switch is the only thing that turns the brake lights on. Right, I should explain that. Uh, these levels here adjust how aggressively you want the vehicle to use its regenerative braking as you let off the accelerator. Electric car nerds call this \"throttle-lift-off regen,\" and you switch between modes with these shift paddles. Level 0 provides no regen at all, and moving to level 1 is almost indistinguishable from coasting; theres just a teeny bit of resistance, similar to what a car with a traditional automatic transmission feels like. Hit level 2, though, and now the car starts noticeably slowing down whenever you lift off the gas pedal. Enough to warrant brake light activation, and sure enough, Hyundai thought of that! In this mode, the brake lights come on once youve released the accelerator. You have to let off all the way, but thats OK. Even just barely touching the gas pedal almost entirely removes the braking effect. Move up to level 3 and now the throttle-lift-off regen is getting pretty aggressive. The throttle mapping has changed enough to where you can actually modulate the amount of regen youre getting at the top of the pedals travel. Yet the brake lights are still only coming on when youre completely off the pedal. This doesnt bode well. No it doesnt. But we still arent in one-pedal-driving mode. Although it slows you down fairly aggressively, level 3 regen will not bring the car to a stop - you need to press on the brake to stop completely, and once you let off the car will creep forward like a traditional automatic (unless, that is, you use the auto-hold function - Hyundai was not shy about giving you every conceivable option on this car). Engage the i-Pedal mode, though, and now the car offers true one-pedal driving. Let off the accelerator and the car will provide aggressive regen braking as long as it can before seamlessly engaging the friction brakes to bring you all the way to a complete stop. And I must say, the powertrain tuners over at Hyundai did an excellent job here. Theres a big range of travel in the negative portion of the throttle input which allows quite a lot of brake modulation with practice. And the stops it makes? Absolute perfection. Its nearly impossible to bring a car to a complete stop without at least a little bit of jerk at the end as the brake pads lock the rotors in-place, but this car stops with as much finesse as those ultra-smooth elevators where you cant really feel that the cab has stopped but then the doors open so apparently it did. Its literally just like that with almost every stop. Its amazing. But the brake lights. Somebody forgot about the brake lights! They still, even in i-Pedal mode, only come on when your foot is completely off the pedal. And this is terrible! Remember that quite a lot of brake modulation thing I said just a few sentences ago? Near the top of the pedal theres a lot of regen to be had - way more than you get in levels 2 or 3. But the brake lights will not illuminate unless and until your foot is completely off the pedal, so if you stay near but not quite at the top, they just don't illuminate. And thats bad! Thats what was going on in my 60-zero stop earlier in the video. By lifting almost-but-not-quite entirely off the gas pedal, the car slows down very aggressively. In fact, if you watch the power gauge you can see that the car is performing almost the maximum amount of regen braking that it can. Yet, the brake lights never lit up because I didnt completely release the pedal. I know youre just watching a video and seeing falling numbers on a speedometer probably wont convey just how much the car slows down here, but its a lot. Enough to dislodge some loose articles in the car in an earlier take. [ka-thunk as loose articles are dislodged in this earlier take] Yet still - no brake lights. This is, quite frankly, dangerous. And its likely my cars E-GMP platform mates like the Kia EV6 and Genesis GV60 have the same problem. If you use the one-pedal-driving mode, youre risking being rear-ended, possibly getting pulled over and ticketed for malfunctioning brake lights, or even potentially being found partially at-fault in a rear-end collision if the driver who hit you can prove your brake lights werent working - which, with the proliferation of dashcams, is definitely not out of the question. Once I realized the car was behaving this way, which took quite a while as you generally dont get to see what your brake lights are doing unless youre paying close attention at night, I stopped using i-Pedal mode. Hyundai spoiled a really quite good one-pedal-driving mode with this little oversight. One reason some folks dont like one-pedal driving is that it can be quite nauseating. Going from acceleration to braking and right back is one way to make your passengers pretty queasy, and when a one-pedal driving mode doesnt have a decent dead-band in the center to allow for coasting and a wide-range of differing brake intensities at the top of the pedal, its really hard to avoid a rubber-bandy, stomach-upsety back and forth sloshing motion. But this car manages to avoid that quite well so long as you use the pedal gently. But if youre using the pedal that gently the brake lights basically dont work! They won't come on until youve come to a stop. And thats not what theyre supposed to do! And its not like this is a new problem at all. You may remember that back in 2016, Chevrolet released a frumpy little egg-shaped EV called the Bolt. And from the very beginning these cars offered a fantastic one-pedal driving mode. It works just as well as Hyundais, perfect stops and all, although to get full regen you actually need to squeeze this little paddle on the back of the steering wheel. But, that adds its own element of fun. Now, because General Motors suffers from this chronic condition called being GM they thought that re-using the parts bin shifter from a Buick would be a fine way to select between drive modes so... thats what they did. Put it in Drive and it behaves like a normal automatic, creep and all, but bump it back again to L and youre in one-pedal mode. You know, L for one-pedal. Despite that, somebody at GM thankfully realized that a one-pedal drive mode would need a way to turn on the brake lights, so they snuck an accelerometer somewhere in the car that will activate the brake lights if the car is pulling more than about .2G of deceleration. So, when driving the Bolt in low gear the brake lights work just fine. They come on well before my foot is off the pedal, and in fact what the pedal is doing doesnt actually matter at all. If that accelerometer detects enough slowing doing is happening, on go the brake lights. Truthfully, though obviously miles better than what my new car does, I think that this solution is way overcomplicated and a bit flawed. For a start, being accelerometer-based, the brake lights go out once you have come to a stop. Thats technically fine, I suppose, but living in a country where almost everybody drives an automatic transmission, being stopped in traffic without an illuminated rear-end tends to worry me a little. Supposedly this was fixed for 2022 model Bolts, and hopefully GM continues that behavior with their new EV offerings. But my bigger question is - why did you use an accelerometer at all? Just use the accelerator pedal position and turn on the brake lights when its somewhere that requests regen braking. When I first got my new car, I thought thats what Hyundai had done. One of the first things I did was take it out at night and watch the rear window glass to see what the brake lights were doing with one-pedal-mode engaged. I could tell that they were behaving based on the pedal position, and they stayed on when stopped, so I thought good job, Hyundai, you didnt overthink this like GM did. But I didnt realize that they were only coming on when the pedal was all-the-way let off until, well, until a couple of months ago actually. Now I realize they underthought this by a staggering degree. Now, so far Ive been talking about electric cars and their one-pedal driving mode, but remember that there are plenty of combustion-powered cars out there with adaptive cruise control. Those cars will automatically adjust speed and following distance to the car ahead, letting you drive miles and miles without touching any pedals. Those systems need the capability to brake quite aggressively in case you get cut off or if theres sudden traffic, so they most definitely need a way to turn on the brake lights. Luckily, this wasnt something Hyundai overlooked. The brake lights perform just fine when using adaptive cruise control, so its really only the i-Pedal mode thats problematic in my car. And honestly that sorta makes sense as Hyundai puts the same highway driving assist technology that my car has in plenty of their conventional cars, and I doubt the systems are all that different. But does that actually make sense? Why would the car turn on the brake lights without brake pedal input when using adaptive cruise, but notin one-pedal driving? I cant claim to know Hyundai's thought process or motivations, but in the regulations that govern when stop lamps are required to illuminate here in the US, theres a key distinction between service brakes and supplemental brakes. Strap in, folks, were gettin in the weeds. Federal Motor Vehicle Safety Standard No. 108; Lamps, reflective devices, and associated equipment states that Stop Lamps are to be steady-burning and must be activated upon application of the service brakes. Thats it. Theres no standard for G-force or meters per second squared deceleration or anything like that, they just have to come on when you apply the service brakes. But what are the service brakes? What does that mean? Well, Federal Motor Vehicle Safety Standard No. 105 says Each vehicle must be equipped with a service brake system acting on all wheels. Wear of the service brake must be compensated for by means of a system of automatic adjustment. So, in other words, they just mean the regular ol brakes. But, of course, thats kind of ambiguous. Regenerative braking systems often dont actually engage the friction brakes until necessary, and since many hybrids and EVs are two-wheel drive, regen braking wouldnt be considered acting upon all wheels. Doin a Ctrl-F on standard 105 reveals that regenerative braking is a thing the standards writers are aware of, so thats good I guess. But is that part of the service brakes? Well it depends. The standard says that For an EV equipped with RBS, the RBS is considered to be part of the service brake system if it is automatically controlled by an application of the service brake control, if there is no means provided for the driver to disconnect or otherwise deactivate it, and if it is activated in all transmission positions, including neutral. And there we have it. When using adaptive cruise control, my car is almost certainly applying an automated input to the service brake system, as would be the case for any Hyundai thats not electric, so the brake lights must and will activate. But since its one-pedal driving mode can be deactivated, and it also doesnt work when the car is in neutral (I tried), thats not considered part of its service brakes. So, technically, its not required to light up the rear end. Its not actually violating anything by having brake lights that dont always work. This is utterly and completely bonkers and needs to be fixed ASAP. You dont even need to rely on my interpretation here. Back in 2009, a lawyer for Eaton asked the NHTSA for clarification on when the brake lights should activate as Eaton was working on some sort of hydraulic regenerative launch system thingy called Hydraulic Launch Assist. It wasnt a regenerative braking system as defined by standard 105 because it wasnt electric, which meant it definitely wasnt part of the service brakes, and they wanted to know whether the brake lights should come on when using it. NHTSA wrote back that Because the HLA system is a supplemental brake system (i.e., not the service brakes), the standard does not require the stop lamps to be activated upon activation of the HLA system. Couldnt be any plainer, if its not the service brakes then the brake lights dont matter. However, they went on to say that We note, consistent with past interpretations, that FMVSS No. 108 does not prohibit the activation of the stop lamps when the HLA system is retarding the speed of the vehicle after the accelerator has been released. The SAE Recommended Practices on stop lamps that are incorporated by reference into Standard No. 108, SAE J586 and SAE J1398, define stop lamps as lamps which indicate the intention of the operator of a vehicle to stop or diminish speed by braking. If the vehicle is designed so that release of the accelerator results in braking action from the HLA, we believe this condition can be viewed as an intention by the operator to diminish speed by braking. So, in other words: you can turn on the brake lights, but you dont have to. Clearly the SAE has a much more reasonable understanding of what the stop lamps are for - they warn other drivers that youre slowing down, and not that youve applied the vehicles service brake system. But the problem here is that the SAE isnt a regulatory body. Theyre just, like, some society of engineers or something and they can make recommendations but not law. So whether and how the brake lights work when using a one-pedal driving mode is entirely up to automakers right now, and that should not be a decision left up to automakers because apparently they suck at it. They might really overcomplicate things like GM did, or they might completely forget about it like Hyundai did. Theres even a third option! We now have a bit of a boy who cried wolf problem on our hands. I dont know if youve noticed this, but some electric cars activate their brake lights way too frequently. My presumption is that these cars are simply too sensitive and kick them on with the tiniest amounts of deceleration. That is arguably just as bad at not having brake lights at all because that diminishes the urgency and importance of the signal. You know what would really clear this up? A regulation based on the vehicles actual rate of deceleration. And heres, after digging through all these regulations, where my mind was blown. I thought to myself, surely Europe, the land of the amber turn signal, will have thought of this. Guess what? You havent either! As a matter of fact, your regulations are even worse than ours because they actually FORBID activation of the brake lights specifically(!) when slowing down an electric vehicle with regenerative braking. Look, Regulation No. 13-H, Uniform provisions concerning the approval of passenger cars with regard to braking section 5.2.22, Generation of a braking signal to illuminate stop lamps. Things were looking good here with Activation of the service braking system by automatically commanded braking shall generate the signal mentioned above. However, when the retardation generated is less than 0.7 m/s2, the signal may be suppressed. You specifically mentioned .7 meters per second squared, great job! But then you spoiled it with Electric regenerative braking systems, which produce a retarding force upon release of the throttle pedal, shall not generate a signal mentioned above. WHYYYY??? I can only presume that whoever wrote that sentence as well as all of the members involved in approving that regulation had never driven an electric car because this is beyond absurd. Regenerative braking is quite strong with modern EVs and absolutely warrants activating the brake lights - may I remind you I was able to stop my car from 60 miles an hour (thats 96 and a half kilometers an hour) in 13 seconds (or 13 seconds). It is absolutely astounding that anyone would FORBID the generation of a signal to activate the brake lights in that situation merely because it was throttle-lift-off regen, especially when my cars average rate of deceleration was about .25G, or about 2.4 meters per second squared which is a lot higher than the 0.7 m/s2 you just mentioned as the threshold by which that signal may be suppressed by an automatically commanded braking occurrence. This is just bonkers! And wouldnt ya know it, Im not the only one who thinks so. A proposed update to UN regulation 13-H wants to clear this up. In this lovely powerpoint I found, it is very correctly pointed out that The stop lamp signal should reflect the intention to decelerate. and that The driver of a following vehicle does not care about the kind of braking! I mean, yeah! I thought that was obvious! So, theyd like to eliminate all this gobbledygook and simply make it such that if the car is slowing down by more than 1.3 meters per second squared, the signal SHALL be generated regardless of what propels the vehicle or why it might be slowing. Hopefully this proposed change gets adopt - What? Excuse me? It did? Ju. jus.. just back in March? Really? Why did I get this document then when I was looking for... Ah, Google, being screwy again. OK, um... Hm. Well I guess I got a little overly animated just now. But it did take you quite a while - EVs with serious regen braking abilities and one-pedal drive modes have been around for about a decade now. But at least you got around to fixing it. Ah, but did you fix the boy who cried wolf problem? Im not sure you did. Yeah, the brake lights shall come on when exceeding 1.3 m/s/s deceleration, but you said they may come on at rates below. I see you thought to make sure there are methods to prevent the lights from flashing erratically or flickering or whatever, but honestly I think you should have defined a minimum deceleration value. We dont need them coming on when people are just coasting. Still, this is much much better - and good job! We here in the U S of A still have a lot of work to do. If any of you watching happen to know someone who works at NHTSA, the US DOT, or otherwise has sway over the federal motor vehicle safety standards, please send this video to them. And maybe also the one on the combined stop and turn signals - removing signal ambiguity decreases reaction time which is actually important when operating a two ton machine at 70 miles an hour. I do not understand how we still find this arrangement acceptable. Also, if you are one of the people in charge of this stuff, please for the love of god get to work. My car should frankly not be allowed on the road as it is, yet theres nothing on the books to say otherwise. And thats not OK. And to circle back to the beginning, I said I think Hyundai should recall this car - and I still think that. But based on what Ive uncovered theres technically no reason Hyundai would have to. Still, that doesnt mean its safe to drive this car in the i-Pedal mode, and I would urge Hyundai to voluntarily recall these vehicles and perform a software update to make the brake lights actually work in a sensible fashion. I think we urgently need regulations similar to the ones Europe just adopted. That way nobody will make a car like this again. But until that happens, if youre an automaker producing cars for people to drive, please think a little harder about what brake lights are for. Its frankly inexcusable, Hyundai, that you would release this product as is. I mean, if GM could figure it out back in 2016 Now, I do want to reiterate that although my car is an EV, and I expect lots more to be sold in the coming years, theres more than just the one-pedal driving mode that we need to be thinking about. The first time I drove a car with adaptive cruise control I really didnt think about the brake lights at all, and in hindsight I probably should have. As technology changes, we can no longer rely on a simple switch on the brake pedal for brake light activation, and as weve seen regulatory bodies are a little slow to respond - if they do at all. To anyone out there who drives any kind of car that does its own braking, I would encourage you to figure out what the brake lights do as it slows down. Maybe have a friend follow you in another car, or perhaps go out at night (when its safe) and see what you can see in the rearview mirror. Nissan, as it turns out, put in a little display in their new Ariya that will show you what the brake lights are doing - and Im the type of guy to think thats a pretty useful idea actually. You may want to adjust your driving style depending on what you find out. I know I did. Thanks for watching, use your turn signals, and drive safely. ham-fistedly smooth jazz You could put it down a ways and make the top quarter or so of the paddles pedals... But the accelerator pedal... but the accelerator pedal yeahgrgrlbgrglyagabadaHH The standard does not require the stop lamps to be activated upon adivatiofehfehhfehha Its not actually violating any federal motor vehicle safety standards thanks to a technicality and poorly warded warded? Welp! The obviously better solution of separating those two signals into dedicated amber inder lights. Inderlights? OK. If the driver who hit you can prove your brake lights werent working. Which, with the perliferolphh. Thats, why did I write proliferation? When it comes to brake lights, these Hyundai's aren't too bright. Get it? Because, like, the rear of the car is dark but also it's not smart? But hey, our lighting regulations are also not that bright. In more ways than one.",
    "transcript_keywords": [
        "Brake lights",
        "Brake",
        "car",
        "lights",
        "cars brake lights",
        "brake pedal",
        "pedal",
        "Hyundai",
        "cars",
        "service brakes",
        "brakes",
        "braking",
        "stop",
        "brake lights work",
        "brake pedal switch",
        "service brake system",
        "brake light activation",
        "brake system",
        "stop lamps",
        "cars brake"
    ],
    "transcript_entity_values": [
        "The SAE Recommended Practices",
        "Hydraulic Launch Assist",
        "the electric motors",
        "two",
        "Kia",
        "3",
        "2",
        "Drive",
        "General Motors",
        "Standard No.",
        "regen",
        "one",
        "many years",
        "about 2.4 meters",
        "Bolt",
        "Hyundai",
        "WHYYYY",
        "Stop Lamps",
        "Eaton",
        "13",
        "Genesis",
        "a couple of months ago",
        "Hyundais Apple",
        "Lamps",
        "60 miles an hour",
        "about a decade",
        "about 13 seconds",
        "RBS",
        "2022",
        "more than about",
        "Google",
        "70 miles an hour",
        "the coming years",
        "first",
        "NHTSA",
        "60-zero",
        "Chevrolet",
        "a half kilometers an hour",
        "13 seconds",
        "zero",
        "2009",
        "amber inder",
        "Ioniq 5",
        "Federal Motor Vehicle Safety Standard No.",
        "1",
        "Bolts",
        "108",
        "PCM",
        "the top quarter or so",
        "two ton",
        "the US DOT",
        "UN",
        "GoPros",
        "HLA",
        "Ariya",
        "GM",
        "EV",
        "Level 0 or",
        "more than 1.3 meters",
        "2016",
        "1.3 m",
        "the U S of A",
        "jus",
        "third",
        "less than",
        "Inderlights",
        "Bolt",
        "105",
        "Europe",
        "Ju",
        "Buick",
        "US",
        "SAE",
        "this day",
        ".7 meters",
        "Hyundais",
        "wolf",
        "5.2.22",
        "One",
        "March",
        "second",
        "night",
        "about .25",
        "Nissan"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "DATE",
        "ORG",
        "EVENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "MONEY",
        "GPE",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "FAC",
        "CARDINAL",
        "LOC",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "ORG"
    ]
}