{
    "id": "u2J_5JnqQ8Y",
    "title": "Under Display Camera TEARDOWN - How does it work?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-12-28T14:15:02Z",
    "video_url": "https://www.youtube.com/watch?v=u2J_5JnqQ8Y",
    "category": "Howto & Style",
    "tags": [],
    "views": 1201590,
    "likes": 53009,
    "comments_count": 1934,
    "description": "Can the human eye see through the same display that a camera can? Only one way to find out! I used this tool kit today in my video:  Under screen cameras are the future. Even though this first version on the Axon 20 is first generation technology, its actually surprisingly good.   See the Transparent TV video here:  More Axon 20 5G info here:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   Anker is named as the Official Charging Partner of JerryRigEverything:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://amzn.to/34Lujm8",
        "https://youtu.be/PRx9aAx8RPQ",
        "https://global.ztedevices.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "http://ankerfast.club/JREpartnership",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "It's time to take a look at the world's first under display camera from the inside. This Axon 20 5G has secrets that need revealing. It'll be interesting to see if our own mortal human eyes can peer through the transparent display once it's open, or if that's something only the camera can do. Let's get started. [Intro] Getting inside the Axon 20 is pretty similar to other glass back smartphones. A lot of heat and gentle prying. Even though there's not an official water resistance rating on this guy, there is still a lot of glue. I can use my razor blade around the Noxv logo, taking special care not to put too much stress on the glass, since glass is glass and all. The back glass is pretty awesome...like a Nazgul dressing up for a work party. Finally, the back glass does come off. Having a good suction cup is always useful. And now that we're inside the phone I think my new screwdriver set is a bit of overkill since all I really need is a Phillips head. I'll put a link for this new toolkit down in the description. There are 20 screws holding down the back plastics. One of those screws is hidden up here under the NFC coil...which I'm 94% sure isn't supposed to be removed just yet. The interesting part of this phone though is that instead of just the rear plastics being removed, it's actually the whole back plastics and the side rails that come away from the screen in one piece something that we don't see very often. ZTE is keeping us on our toes over here. The dual rear flash has some gold contact pads that just rest on top of the motherboard. We can unplug the battery just like a little Lego, and the bottom speaker can also come out at this point. It has some of those gold contact pads for communicating with the motherboard. The vibrator motor is one of those old school eccentric rotating mass motors from the olden days. But keep in mind that this phone is also only $450 and still has some bleeding edge display tech. So we'll have to give this ancient vibrator a pass. There's a water damage indicator sticker next to the USB-C charging port. I'll unclip the side button ribbons, along with the two long extension ribbons over the battery. And unfortunately for us, the battery adhesive is still permanent and very strong. I can drip some isopropyl alcohol in here to dissolve the adhesive and make the removal easier, but it's still rather annoying. ZTE should be charging $450 and a penny on their next phone so they can afford to install those battery pull tabs. Eventually all phones do need to be recycled, and it's much harder to recycle them when extra steps are needed for the disassembly. And now everything under here is just slimy. Along with the new pull tabs they can also get rid of this 'battery not removable' message, since it obviously is still removable. Anyway, let's get back to finding that camera. The Axon 20 does have a copper vapor chamber under the battery, along with the ribbon for the display. I'll remove the two screws down here on the bottom board and unclip the underscreen fingerprint scanner. Then the charging port board can come loose. Nothing super interesting to see on this thing. The interesting part is the optical fingerprint scanner. The optical part means that it's also using a camera to look through the display to see the fingerprint that's pressed up against the glass. The top camera, the main under display camera, is a bit larger but it looks pretty much the same as every other selfie camera that we've seen over the years. We'll take a closer look in just a second, but first we have to unbury everything else. The underscreen earpiece is underneath this metal bracket. Once that's removed with it's two screws, the motherboard can come away from the phone revealing a lot of pink thermal paste and another strange warning symbol up here in the corner which looks like it's saying not to touch. I like though that this warning is on the underside of the motherboard so the only way to see the do not touch warning is by touching it to see what's underneath. The underscreen earpiece is an oversized tic-tac looking block that vibrates the display that transmitted sound to your ear. And then of course, we have the four rear cameras: the top 8 megapixel wide angle camera, the large 64 megapixel main sensor, the 2 megapixel depth camera, and the 2 megapixel macro camera, none of which have the optical image stabilization. Before I put the phone back together though, let's see if we can see through these displays. Remember, ZTE is using two different screens on the Axon 20, a tiny lower resolution square patch up at the top directly in front of the selfie camera, and then the rest of the screen is the normal 1080p full HD OLED. And if we set up my own camera to focus on my pry tool, we can peer through the top camera hole and clearly read 'Jerry Rig Everything' with our own human eyes all right here through that display. It's got a kind of post-apocalyptic hue from the layers of the screen that we're looking through, but I'm sure the camera's software compensates for that discoloration after it takes the picture. An interesting thing is is that if we move the phone down to the bottom hole in the display for that underscreen fingerprint scanner, we can't see through the pixels anymore since those pixels are more dense. I guess seeing the ridges up close on our fingerprint doesn't require as much transparency as producing an actual colored image does. I think this is all pretty cool technology, even for a first generation version of an underscreen camera. It's pretty fun hanging out with all of you here and experiencing this history together. Feel free to leave a comment for your posterity to find in 50 years when they come back to see how it all started. Assuming, of course, that the world hasn't ended because smartphones were too hard to recycle. Getting the phone back and assembled like a dementor getting dressed in the morning. Everything still turns on and the camera still functions like normal. Nice work, ZTE. Hit that subscribe button if you haven't already. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "camera",
        "back",
        "display",
        "phone",
        "glass",
        "back glass",
        "display camera",
        "phone back",
        "battery",
        "Axon",
        "ZTE",
        "top camera",
        "interesting",
        "fingerprint",
        "underscreen",
        "pretty",
        "top",
        "back plastics",
        "glass back smartphones",
        "glass back"
    ],
    "transcript_entity_values": [
        "20 5",
        "the olden days",
        "8 megapixel",
        "64 megapixel",
        "Lego",
        "Instagram",
        "four",
        "two",
        "20",
        "ZTE",
        "Phillips",
        "Jerry Rig Everything'",
        "Noxv",
        "50 years",
        "NFC",
        "450",
        "first",
        "second",
        "94%",
        "2 megapixel",
        "Nazgul",
        "One",
        "only $450",
        "one",
        "Twitter",
        "the years",
        "2"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "ORDINAL",
        "ORDINAL",
        "PERCENT",
        "QUANTITY",
        "NORP",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL"
    ]
}