{
    "id": "U45yQEmxjyU",
    "title": "I'm LEAVING the Dell XPS 15 for the Microsoft Surface Laptop 4",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-06-21T20:22:20Z",
    "video_url": "https://www.youtube.com/watch?v=U45yQEmxjyU",
    "category": "Science & Technology",
    "tags": [
        "Microsoft Surface Laptop 4",
        "Laptop",
        "Intel",
        "Thin and light",
        "processor",
        "Gaming",
        "PC"
    ],
    "views": 810293,
    "likes": 24098,
    "comments_count": 1346,
    "description": "Get $25 off all pairs of footwear using offer code shortcircuit at   I was a huge fan of the Microsoft Surface Laptop 2, but the Surface Laptop 3 made me switch to the Dell XPS 15. Can Microsoft win me back with the Surface 4 Laptop?  Buy Microsoft Surface Laptop 4  On Amazon (PAID LINK):  On Best Buy (PAID LINK):  On Newegg (PAID LINK):   Buy Dell XPS 13\" On Amazon (PAID LINK):  On Best Buy (PAID LINK):  On Newegg (PAID LINK):   Buy iFixit Pro Tech Kit On Amazon (PAID LINK):  On Best Buy (PAID LINK):  On Newegg (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - Intro 0:33 - Unboxing 1:05 - I/O ports and charging 1:55 - Opening 2:56 - Turning it on 3:37 - Spec options 4:29 - Keyboard impressions 5:11 - Display ratio  5:29 - Palm rest impressions 6:30 - Weight 7:01 - Display and speaker impressions 8:23 - Opening the laptop 9:48 - Closing thoughts",
    "description_links": [
        "https://www.vessi.com/shortcircuit",
        "https://geni.us/BXdKxYs",
        "https://geni.us/bW4ON",
        "https://geni.us/9sFqwSK",
        "https://geni.us/xB6YZm7",
        "https://geni.us/cDQAj",
        "https://geni.us/8BQPuD8",
        "https://geni.us/PNL7",
        "https://geni.us/UdeTjr",
        "https://geni.us/zDcqAzp",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- The happiest I've ever been with a laptop was a Surface Laptop 2, which I used here for two years. Now, that's the longest I've ever had a laptop since I got this job, where I can just ask anyone for any laptop, and it's for good reason. They're fantastic. But they're also kind of the most annoying laptop in existence, because they're so close to being the best, but they're just not, and Microsoft, just... Please fix the things that we asked for in the Surface Laptop 1. I wanna daily drive this thing. So let's get into it. Surface Laptop 4. Very simple packaging for what is really quite a simple little device. This one right here is in a silver-blue kind of thing. I think it looks fantastic. I don't know that I like it quite as much as the black one that they had for the Surface 2, but this is a really cool color. Surface Laptop 4. This is not the most descriptive thing I have ever seen. For the charger we get 65 watts, this is not a super high powered device so we don't need loads of power. But it is magnetically attached, so you can have it there, and someone trips over it, it just comes out of your laptop instead of chucking it onto the ground. Awesome. That's the only connector you get. It does have Microsoft's stupid proprietary Surface connector dock chummy that kind of has the functionality of Thunderbolt, but doesn't. I really wish that they would just... I know, I like the magnetic thing, but if we had two Thunderbolt-4 ports here, I would like this laptop way more. Moving on to the other side, three-and-a-half inch headphone/microphone combo jack, USB type C, not Thunderbolt, it should be Thunderbolt. Microsoft, what are you thinking? We've been asking for this for years. And a USB type A. Like seeing those. I guess there's not much else to show you on the outside, it's pretty much as plain as you can get, in a good way I think. What is one of the most controversial bits of this laptop, but I also think one of the best, the Alcantara palm rest. Now, we're a bit late to this because I specifically asked for this config. I absolutely love the feel of having your palms on this. It's such a nice surface to have on. It's not cold like every other laptop. It's nice and soft. I know lots of people are going to say that there's durability problems, but I used one for three years, my mom has one that's four years old, my girlfriend has one that's... Well, it's dead, but that's because of beer, so that doesn't really count. - [Crew Member] Sponsor! - Vessi! Thanks, Vessi Footwear, for sponsoring today's video. Vessi is known for being lightweight, comfortable, and most importantly, waterproof. The shoes are made of a material called Dyma-tex which keeps your feet cool in the summer and warm in the winter. Lots of us here at LMG wear them all the time. Keep your feet dry in the upcoming wet months by using offer code ShortCircuit that gets you $25 off at vessi.com/short-circuit. Now, the first thing that you notice about this laptop is that it looks premium, but it kind of looks premium from like three years ago. The bezels are brutal, although right there is the perfect example of why this is great. The facial unlock on this laptop is just exceptional. It's so much better than every other Windows Facial Unlock laptop I've ever used. Open it up. Boom, you're in. That was, like, one of the slowest ones that I've seen, and that was basically instant. Yeah. Good job, Microsoft. Oh, can it recognize me when I have a mask on? I do not know. It immediately got me in, so it passes that test. For the specs, I would recommend getting one that's a bit less expensive than this one. So we have an i7, 1185 G7, so that's four cores, eight threads. There are AMD ones available. I'd kind of just toss up which one you want. They have the last-gen AMD chips, like the fourth gen as opposed to the fifth gen that they have now, so they're not quite as snappy as the new ones. Then again, it's not like you're losing Thunderbolt when you switch over to the AMD one, so who cares? Get whatever one's in stock. For memory we have 16 gigabytes, half a terabyte on the SSD, and Intel Wi-Fi 6, which is awesome because that's the fast wifi. Running it out we get Intel Xe graphics, which is fine on a computer like this. This right here, you're not buying it because it's fast, you're buying it because it's, well, pretty and nice to use. I do have to say, using this thing is fantastic. I always compared every single laptop keyboard that came in for quite a while to the Surface Laptop, and it's because it is one of the best keyboards on the market. Now, one thing that I'm noticing is it feels like there's more deck flex than it used to have. So if you kinda look here, it's especially in this area a bit on the squishy side. Now the switches are still really great, but if memory serves me correctly, I think that the Surface Laptop 2 was stiffer around the keyboard area than this. I'm guessing that's due to this right here. You're now able to, with a couple screws, remove the bottom panel. Actually, I wonder if you can on the Alcantara version. Hm. Another thing that makes this fantastic for things like script writing and productivity is the three-by-two display. Super tall given the size of the laptop, loads of vertical space for just all of your activities. I was about to say it is kind of the benchmark for Windows laptops, but I think that might be the XPS 15 now. There's just something about this laptop that I absolutely love. I do wish that the deck flex was a bit better, especially compared to the carbon fiber XPS rate here. But I set my fingers down on this, and it's just, I don't know. This right here just feels better. I think it's the Alcantara, but just the way your hands rest on it. It's really great. I think another thing that makes this laptop so nice to use is how close it is to the table. So if you look here, you've got this nice little slopey slope, and it kinda just, the way that you're able to rest your arms on a table and use this isn't really replicated in any other laptops. 'Cause look, you go on here, and you're kind of resting all of this part of your hand, and then kind of here is up. Whereas on this one, it's just so comfortable. In its class, the Surface laptop is a little bit heavier, so we're looking at 2.8 freedom units and 1.2 kilograms. But then again, you get way more display than other laptops that are around that price point. XPS 15's coming in at two kilograms, 4.4 pounds. So yeah, that's a substantial difference in your laptop, and you really feel it when you're going around. Turn it up all the way. I think it's only 350, maybe 400 nits brightness. A lot of laptops, like the XPS is now 500, and it just has more color. This is sRGB, but it is color calibrated, and most of Windows' stuff is sRGB anyway, so for the most part, you'll be fine. (upbeat music) Okay, okay. For a laptop of this size, that is surprisingly good. Nice and clear, there's a good bit of bass. It's not going to be the same amount of bass that you get in an XPS 15, we'll just switch it over here. Okay, that's just way better, that's hardly comparable. But like, this is still totally usable. I wouldn't hate having this. I would just much rather have... Yeah, that's just way better. As for the displays, though, you're getting way darker blacks, much brighter brights on the XPS, as you expect, that's pretty much, the display is the best part of this laptop in my opinion. Me and Brandon were just talking, he has an XPS 15, and for him, I would say get this, 'cause he actually photographs things and needs power, and likes the really, really good screen. Oh! We might be able to get in. This is what I found on the Surface Laptop 3 as well, even though it is repairable, it's not letting you have it easy. Oh, there we go. (gasps) Okay. Wow, the internals of this are pretty cool. Here we have the keyboard, which I guess does explain why this is a bit more flexi. So before this would have just been glued to the actual chassis, whereas now it's sort of its own unit, which is probably why it's a bit more flexi. The battery is super weird in this. Normally you got one big thick boy across the bottom, but here we have six super little ones that are really thin, spread across the whole bottom right here. Now, the total of these is 47 watt-hours, which Microsoft says gets you, I think, 17 hours of battery life. I would give it more like 10 or so. Oh, the coolant solution in here is super weird. There's a C pipe that goes across here, but I don't know what it's cooling. I was going to say the SSD, but the SSD is right here, it's a super little boy, which I guess is why they're so darn expensive. I'm almost curious if the cooling that they have right here is for the keyboard and your fingers, 'cause that's right where your hands would normally rest. I wonder if it's just to make it nice for people that use it and have cool fingers on the home row kind of thing. So, the Surface Laptop 4, then. It's flawed in a lot of ways. It has a not great battery life, the bezels on it make it look like it's from four years ago, the IO's trash, get Thunderbolt please, Microsoft. The screen's middling now, whereas it was way ahead when it first dropped. But for all of that, I really like using it. This is a fantastic laptop to use. There's just something about, especially with the Alcantara keyboard, it just feels fantastic. I love it. That's about it, Surface Laptop 4, I really like it, probably shouldn't. So have a fantastic day, hit Like, get subscribed, and so long.",
    "transcript_keywords": [
        "Surface Laptop",
        "laptop",
        "Surface",
        "kind",
        "thing",
        "XPS",
        "laptops",
        "Microsoft",
        "bit",
        "Thunderbolt",
        "nice",
        "fantastic",
        "years",
        "good",
        "super",
        "Alcantara",
        "Windows laptops",
        "keyboard",
        "Facial Unlock laptop",
        "nice surface"
    ],
    "transcript_entity_values": [
        "16 gigabytes",
        "three years",
        "eight",
        "the Surface 2",
        "IO",
        "Thunderbolt",
        "15",
        "three",
        "four years old",
        "Surface Laptop 4",
        "4",
        "one",
        "LMG",
        "USB",
        "4.4 pounds",
        "two years",
        "Surface",
        "the summer",
        "Vessi Footwear",
        "Dyma-tex",
        "25",
        "65 watts",
        "fifth",
        "Windows",
        "2.8",
        "the Surface Laptop",
        "today",
        "Intel Wi-Fi 6",
        "Microsoft",
        "three years ago",
        "only 350",
        "47 watt-hours",
        "Brandon",
        "first",
        "AMD",
        "Intel Xe",
        "two",
        "a fantastic day",
        "G7",
        "four years ago",
        "four",
        "400",
        "500",
        "wet months",
        "ShortCircuit",
        "XPS",
        "three-by-two",
        "17 hours",
        "1185",
        "six",
        "Alcantara",
        "2",
        "two kilograms",
        "1.2 kilograms",
        "years",
        "Vessi",
        "fourth",
        "SSD"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "MONEY",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORG"
    ]
}