{
    "id": "U4b0W4jaizA",
    "title": "World's First Projection Mouse - Does It Suck?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-12-24T20:41:19Z",
    "video_url": "https://www.youtube.com/watch?v=U4b0W4jaizA",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "odin mouse",
        "mouse",
        "projection",
        "computer mouse",
        "cool mouse",
        "projection mouse",
        "does it suck",
        "does",
        "it",
        "suck",
        "cool tech",
        "new tech",
        "new technology",
        "mac",
        "pc",
        "computer",
        "apple",
        "macbook",
        "keyboard",
        "laser",
        "laser keyboard",
        "iphone",
        "android",
        "projection keyboard",
        "magic cube",
        "wireless",
        "mouse (computer peripheral class)",
        "computer hardware (industry)",
        "hidden features",
        "smartphone",
        "cool keyboard"
    ],
    "views": 2822722,
    "likes": 49989,
    "comments_count": 3332,
    "description": "Thanks to our sponsor Dollar Shave Club new members can get a one month trial of any of their razors for only $1 -- with free shipping, just a few bucks a month after that -   This video features the Odin projection mouse... So is it any good or does it suck?  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://www.dollarshaveclub.com/unboxtherapy",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Alright, today we got something unusual.. It's called 'The Odin Worlds First Projection Mouse'. I don't have a problem with my mouse or trackpad or anything like that. But sometimes I'm just looking around and I'm like there some new tech right there maybe it's interesting I'm not really sure, I gotta check it out. I gotta find out more importantly if it's any good or if it's sucks. So the world first projection mouse. Let's find out together. It's from a company I haven't heard of called 'Sarafim'. My first time using one. Your first time seeing one. It kinda looks like a transformer as well. It's good thing I think. Maybe advantages as a small- uuh... It is very small actually look at that thing. That's the mouse, definitely transformer like. Some red cut out on the front and then on the back is where the Micro USB Port is. So this end here, just gonna plug right in over here and supposedly what happens is this little guy sits in front of you wherever you want your trackpad to be and then projects it on to the desk. So let's go ahead and grab this laptop here. Uh wow! That do booted up right away! Okay so, I have it plugged in now. I don't know I mean.... OOOWW! Alright it's actually not... bad. uuuuh aaaah I don't know guys. Ugh! It's mostly it's a precision thing like it works but... I like how it makes a little clicking like the dude winks when you click down. I mean it's usable. It's hard to really compare it to a real trackpad. In what kind of scenario would you need something like this as opposed to a traditional mouse. I don't really know. And also the surface you projecting onto is gonna make an impact to a certain extent because if it's a slick surface you probably slide a little bit better than if it's a rough one. It just doesn't really have a precision for me ugaaah! It's kind of frustrating to be honest. Now maybe if you went up here kinda adjusted the sensitivity you could maybe dial it a little bit better. I don't if it's slower would it be? Yeah, I mean. It works it's not as good as an actual trackpad. I mean it would have to be quite good for to be cool in my opinion. It would have to be such a substantial improvement that you would like to use it over whatever you have built-in. Or over a standard mouse that cost a couple dollars. Is it cool? Yeah, of course. Look at that I mean he's got a red laser. I mean it's look incredibly cool you would want to try that I'm sure. But... aa I don't wanna really shut the guy's down too much after all they claimed it the worlds first is kind of interesting. I like new technology. Plus it look's like a transformer so, it's got to be points for that. It's claiming to be a mouse. It's claiming to displace this product that everybody super familiar with you have one on your desk or maybe you have trackpad. You're very familiar. He claims he that it's gonna displace that is calling itself a mouse yet it doesn't do that job better the other stuff that's already out there, so. And I mean I saw this in Amazon. I was skeptical but of course the only way to truly know is to order it and test it yourself The thing is cool, right. I mean it's look like a transformer got to get cool points for that alone. But the question you want answer is does it suck? It probably does. If you bought this thing, you would probably be disappointed you probably would hope that it would perform as well but with the new tech. You let me know in the comment. My evaluation. It' ain't that good. I'm na say it probably sucks. You tell me that's what the comments are for. Merry Christmas! Oh yeah right! This episode of Unbox Therapy has been sponsored by- [Smelling the box] Oh my... That's smells... There something nice in there! Sponsored by Dollar Shave Club. Shave time. Shave money. I think there trying to send me a message here, Okay there trying to trim up uncle Lou for the holiday season. There something new. They got shampoo now! So, it's not just razor. Now you can stay fresh over the holidays as well. Right now you get the very their very best razor their top-of-the-line razor for one dollar. right now the links can be in the description so go check that out They probably gonna make oh...aw... Oh... I took few hairs there that is that sharp! You know they just wanna... they wanna make the ladies happy. Jack knows what I'm talking about. Men's clean shaving over there. Here you go Jack. Citrus Hawaiian ginger cleanser? Whoo! You got the Shave Butter, The Post Sage Cream Sage and Black Pepper Hydrating Whoo Jack attacks gonna like that. And they also got the body bar okay, so you get that you that in the mail it's simple. You got no excuses all right. You're using the cheap stuff right now. You smell terrible, you got a giant beard like this. And Dollar Shave Club is gonna try to fix that up for you what your excuse you got a dollar you know you gotta dollar. The links can be down in the description. I wanna thank them for sponsoring this Holiday episode. Stay fresh, get the respect, it all starts here Citrus Hawaiian Ginger, Post Shave Cream! You're gonna see an all-new-me in the New Year!",
    "transcript_keywords": [
        "Mouse",
        "Dollar Shave Club",
        "Shave",
        "Projection Mouse",
        "Odin Worlds",
        "Dollar Shave",
        "Dollar",
        "kind",
        "Shave Club",
        "thing",
        "trackpad",
        "good",
        "cool",
        "Worlds First Projection",
        "Post Shave Cream",
        "transformer",
        "Citrus Hawaiian ginger",
        "Micro USB Port",
        "Jack",
        "Projection"
    ],
    "transcript_entity_values": [
        "the New Year",
        "the holiday season",
        "Unbox Therapy",
        "Dollar Shave Club",
        "Men's",
        "the Shave Butter",
        "today",
        "first",
        "Shave",
        "Citrus Hawaiian",
        "Sarafim",
        "one dollar",
        "The Odin Worlds First Projection Mouse'",
        "Lou",
        "Jack",
        "Post Shave Cream",
        "Black Pepper Hydrating Whoo Jack",
        "Christmas",
        "Amazon",
        "the holidays",
        "the Micro USB Port",
        "a couple dollars"
    ],
    "transcript_entity_types": [
        "EVENT",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORDINAL",
        "PERSON",
        "NORP",
        "PERSON",
        "MONEY",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "MONEY"
    ]
}