{
    "id": "U4JPhUr_d7g",
    "title": "$99 Virtual Reality!",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2015-06-09T22:32:06Z",
    "video_url": "https://www.youtube.com/watch?v=U4JPhUr_d7g",
    "category": "Science & Technology",
    "tags": [
        "vr",
        "virtual reality",
        "google",
        "google cardboard",
        "zeiss",
        "zeiss vr",
        "zeiss vr one",
        "vr one",
        "iphone vr",
        "android vr",
        "iphone",
        "android",
        "galaxy",
        "samsung",
        "samsung galaxy",
        "vr headset",
        "virtual reality headset",
        "tech",
        "technology",
        "unbox therapy",
        "review",
        "Android (Operating System)",
        "oculus rift",
        "oculus",
        "rift",
        "Oculus Rift (Video Game Platform)",
        "samsung vr",
        "samsung virtual",
        "samsung virtual reality"
    ],
    "views": 2652156,
    "likes": 41804,
    "comments_count": 2968,
    "description": "Check out the Zeiss VR One -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/1U7yWvN",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Welcome to the new three-dimensional Unbox Therapy starting today. What's up guys Lew here back with another video, and today i'm checking out a VR headset. It's more of a holder because it still requires your phone in order to operate. But, it's pretty cool it's definitely a step up on the google cardboard concept. You slide your phone in. I've got the holder here for the iphone 6 but they have holders for other popular phones as well and you get a more ski goggle-like type fit, that's comfortable and stays on without the need to hold it there like google cardboard. This one, from Zeiss, is about 99 bucks I believe. Links in the description to all of the relevant information. It supports smartphones 4.7 to 5.2 inches. Simply put your smartphone into the tray, slide it into the glasses. Let's go ahead, jump inside the box. I always say, \"jump inside\" like I'm going to physically jump in there, but i like it. Sounds more exciting than, \"Open the box up.\" A little bit of tape. Trusty blade. Wow. This is more serious than I expected. Whoa! Look at the... That thing is solid. Here's a manual for how to get started. You can use the headphones. That's cool. So you still have access to the headphone port. Very nice. Very cool. Our little box for the augmented reality experience. I'm gonna go ahead, and make this little box right now. Because I'm crafty like that. Now this is the headset. Ski or snowboard goggles that's what comes to mind when you see this thing. And this channel right here is where your phone slides in. A legit headband. Headstrap I guess is optional. And as you know, Zeiss is known for their high quality lenses. You have this padding here. It's kind of like a microfiber on top of a foam. Should be comfy. It's not too heavy, which is good. Here is the attachment for the iphone 6 but as i said before, you can use this with some other devices. Wow that's simple. And then we simply slide it in like that. Oh wow! So, comfortable even with my glasses. That's a big plus. That's actually pretty comfy. I probably look pretty cool right now right? Jack? Don't lie to me. It's time to install the Zeiss apps. What if I do, \"Zeiss VR\"? That must do it. There we go. VRONE cinema, let's get that. VRONE media, let's get that. Hmm. Let's do the cinema first. You have a stereoscopic image here, so there's a left channel and the right channel. Essentially, when paired with these lenses, that's what creates the immersive experience. Here we... Oh! Wow! It's an actual movie happening in here. what! a play? How do i click? Is threre a click on here? How do i click to do it? Jack Jack oh I have nothing to play I have to pick something oh wow ok so i pick a movie oh wow uses the experience of like sitting in a movie theater we're talking about a huge screen out here how do i exit out now though one side of it oh there's a door Wow now i'm in the media launcher and there's all kinds of apps here! Auto track VR, our roller coaster vr zombie shooter?! install by the way I think I need that top strap because otherwise this is a little tight little pinch so we go oh yeah money in the bank this is zombie shooter vr which apparently works with this headset so of course that's the next thing for me to try oh my goodness this is a little much i'm picking an ak-47 right now how do I shoot it oh jesus, i got 'em, i got a zombie sighting oh man this one's coming quick that's a female zombie right there *laughter* Get away from me man! oh no, keep shooting! No! Jesus... I died man, well anyways.. I i should try out with that one one last Zeiss app that's an amazing VR experience you can get just with the simple contraption like this in your phone ok so the way this interface works is the apps that you have installed in this universe are all managed from this interface so you don't actually have to back out so say i installed VR fitness, VR player tuscany froggy all these things they would show up here in the top and instead of having an install button would have a launch button like it does for the AR and it does for the cinema and i'm going to try this be our exposition whoa whoa I'm in an art gallery right now guys it's just I'm just in an art gallery oh what the that's how you exit I'm going to launch the augmented reality right now with this little box somewhere over here this little box, this should be fun ok so right now I'm seeing my set up the whole studio thing here I see you know Wow hands and via my knife look at that without even see my own hand super smooth oh what what there's a dude right now standing I just poked him he's about that big I just poke him again now i have like a space shuttle over here and there's a battle going on warrior princess type girl with a staff this is the kind of thing that you need to experience in real life and i recommend you do all right so yeah man like it's so hard to explain it you guys can see sort of there can get an idea to different images there when you're looking at them through these lenses augmented reality headset VR headset emerged tricking your brain into seeing three dimensional space and here comes a shark oh not good this is not good can you imagine like loading up a bunch of movies put this on an airplane or something or a bunch of TV shows a binge watching and not having to hold your phone in front of your face and getting a way bigger field of view look at this you still have access here to your charge port as well as your headphone lenses are crystal clear obviously this is a step up from google cardboard and zeiss has a history of making a beautiful glass so hey jumping into VR why not so there you have it the zeiss vr1 inexpensive relatively speaking vr headset if you're looking to experiment with this stuff i recommend checking it out for sure if you haven't tried vr yet it's time there's very little holding you back you could be swimming with the sharks just like me or course getting attacked by zombies probably not going to do that again I've gotta wait for me then I've said it all thanks very much for watching guys appreciate it very much if you enjoyed this content make sure to leave a thumbs up down below subscribe if you haven't yet and i'll catch you on the next episode or maybe some like nature stuff like planet earth type stuff that'd be pretty wild in here as well all right i'm actually out of here now with my glasses later guys Oh No keep shooting No! Jesus I died man :[",
    "transcript_keywords": [
        "Unbox Therapy starting",
        "threedimensional Unbox Therapy",
        "Therapy starting today",
        "Unbox Therapy",
        "threedimensional Unbox",
        "Therapy starting",
        "Zeiss",
        "Wow",
        "starting today",
        "phone",
        "Unbox",
        "Therapy",
        "box",
        "headset",
        "google cardboard",
        "thing",
        "guys",
        "experience",
        "man",
        "guys Lew"
    ],
    "transcript_entity_values": [
        "Lew",
        "tuscany",
        "today",
        "zeiss",
        "first",
        "Jack Jack",
        "Headstrap",
        "jesus",
        "Jesus",
        "Jack",
        "VR",
        "6",
        "Zeiss",
        "vr1",
        "three",
        "4.7 to 5.2 inches",
        "about 99 bucks",
        "one",
        "ak-47"
    ],
    "transcript_entity_types": [
        "PERSON",
        "LOC",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "PRODUCT"
    ]
}