{
    "id": "U5C-vWBsNrU",
    "title": "Ford Mustang Mach-E: First Impressions",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-04-14T19:59:08Z",
    "video_url": "https://www.youtube.com/watch?v=U5C-vWBsNrU",
    "category": "Science & Technology",
    "tags": [
        "Ford",
        "Mustang",
        "Mach-E",
        "Electric Vehicle",
        "Car",
        "Crossover",
        "SUV",
        "Performance",
        "Technology",
        "Energy",
        "First Impressions",
        "Alex"
    ],
    "views": 555445,
    "likes": 29723,
    "comments_count": 3023,
    "description": "Head to  and activate Honey for free to start saving today! Thanks to Honey for sponsoring this video.  The Ford Mustang Mach-E is fairly controversial, not because it's an electric vehicle but because it has the Mustang name. It's a fairly interesting car loaded with a ton of features!  Thanks to MSA Ford for providing us the Mustang Mach-E, check their Mach-E inventory at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "http://joinhoney.com/shortcircuit",
        "https://lmg.gg/qDNci",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Oh man. I have been wanting to try one of these so bad for so long. Ford Mach-E. We freaking got one, Ford's first full electric vehicle. And you know, a lot of people have been complaining like, is it a Mustang? Is it not a Mustang? It doesn't make V8 noises or like plow into crowds of people. But at the same time, just look at it. I don't know if it like really translates to the video here but I think it looks sick. Like coming around the front here compared to like a Tesla, this is just so much more prominent. And like when you're in the vehicle looking out it just feels like (grunting) muscle car. Under the hood I guess, you get, what's sort of a frunk but it's like a cheater frunk. Ford says its so you can put your drinks in there and throw in a bunch of ice and I guess go to a frunk party. But at the same time, it feels kind of just like a cop out to me because like I think that they just wanted to save costs, not waterproofing this and making it a proper funk. Moving around to the side, one thing he might notice doesn't exist are door handles. On the driver's side, I kind of like it. Like the button works really well. And you can just pull it out with this little handle. And you also got the nice little key pad so that you can punch in like your code to get in. I personally really appreciate that. What I'm not a huge fan of is that on the back you just get a button and then you kind of have to like pull it out. Not a huge problem in most situations probably, but being from the East Coast where like lots of snow and rain happens, I would be pretty concerned that you might just get locked out of your back. If you know, you can't really pull on it when it freezes shut. The overall look from the side though, I think is awesome. Like it has this real, kind of almost shooting brake style look. Around to the back. You know, you get the good old tailgate. What is loads of storage, in my opinion. We don't have like boxes to chuck in. And then down below, there's just your charger. Yeah it's kind of slow opening and closing. Like I don't care too much about the closing but I open my tailgate way faster than that. So this is adjusted for Brandon actually. It's further back than I was. And I'm like 6', heaps of space, especially up top. This kind of encroaches. So you probably don't want like three adults back here but at the same time, what car do you want three adults in the back? In the middle we get two cup holders. Although it looks like, yeah, there's no ski hatch so you can't put stuff right through the middle. Also down below, we get type C and type A for charging and a little spot to stash your stuff. Oh oh oh that's a big deal right there. I was going to complain about how the headrest was when I was up front but it turns out that you can just adjust it, which is sick. You don't get a lot of buttons around but you get enough that it's just nice. There's this nice little handle for getting out. And it works really good. And it's super satisfying. I think it's made with aluminum with a bit of plastic. You also get, you know your lock/unlock and your driving positions. This is really comfortable. It's like lightly bolstered on the sides, but in a way that holds me in really well. You can kind of shake around like this and you just feel supported. And they're comfy in a way that I find the Tesla ones just aren't. As for the steering wheel, this leather that's wrapped around it is fantastic. Like it's so plush. And I really like pushing into it. My only complaint though, is that this plastic bit down here, when you're kind of like spinning the wheel around, I find that my hand kind of gets caught on it. As for controls though, I think they're great. You push up and down for like volume or setting your cruise control. And the rest is all just really simple. One complaint that we'll get more into once we get the infotainment though, there's a button right here for your assistant but it only goes to the Ford assistant and not to your like Android Auto assistant like it does in the Ford that I own. And this is just so much worse because the Ford assistant is just absolutely useless. So now we know this works well as a normal car but does the tech hold up? Honestly, a lot of things about it that are pretty annoying. Like there's no automatic return to Android Auto button, and there's no like home screen or return to Ford Sync. Now the biggest thing this does have over a Tesla is the Android Auto or Apple CarPlay integration. It's just, it's the best way to interface with your phone. It's wireless so I can just, you know, chuck this in my pocket and it works or I can chuck it down here and there's wireless charging, which also seems to just work great. Now what Android Auto gives me is super easy access to like Spotify or in my case, like Pocket Casts. You can just come in here, boom, your podcasts are there. Like if we come over to Spotify and we want to play Crab Rave, we just click on the thing and are like, \"Play Crab Rave.\" - [Android Auto Assistant] Crab Rave by Noisestorm, sure. Playing on Spotify. - It just does it. It's fantastic. What also is pretty fantastic are the speakers. I'm not like completely sold on them. They're Bang and Olufsen and like up here, there's like a soundbar that goes all the way across the dash. I don't know, they're kind of muddy. So I'll show you what I did here. I had to take the mid range and just crank it right down to get anything that sounded good out of these. But once I did this and had the separation between the bass and the treble in the mid range, they're pretty great. (techno music playing) Hey Brandon says maybe a little bit better than the speakers in the Model X. Don't expect it to blow you away but at the same time you'll be happy. Now for the drive modes you get Whisper, which I think is a comfort mode. You also get Engage, it's like Sport but not very sporty. And then you get Unbridled for when you really want to give her. Now it is kind of cool, I need to turn it on for it to show up. But when you change the modes, the thing around the speedometer changes depending on which mode you're in. And it's just a really nice little touch. What we're going to show you right now, this is maybe one of the coolest things. Now this is available on like a fair few cars now, but the 360 around the car is just so awesome. We parked in a parking spot earlier when we were setting up for this and Brandon had just taken all of his camera stuff and put it beside the car. And then we like drove out and drove back in, and it was pretty much a small little parking spot, including things that you just can't see at all. And using this camera, we were able to park it without a problem. It's freaking sick. Like I would say, like compared to the Tesla, this is worse but the Tesla does not have the 360. Not in Brandon's at least. So I guess, are we ready to drive it Brandon? But not until after I tell you about our sponsor, Honey Honey is the free online shopping tool that searches for the best promo codes whenever you shop online at specific sites. It's free to use and installs in just two clicks. Honey works on lots of your favorite stores including Amazon, eBay, New Egg, Razor, Best Buy, Walmart and many more. All you have to do is click Apply Coupons while you're at the checkout page and wait for Honey to search for the best working coupons. Get Honey for free right now at joinhoney.com/shortcircuit. That's hard to say. I'm really excited to finally actually hit the gas on this thing. You kind of do want to normally leave it not in the Unbridled mode. I found that like coming on and off of the gas and hitting the brakes was just a little bit on the jerky side in there. Like it's all fine and good to improve the throttle response. But at the same time, I want to be able to drive smoothly while I do it. Let's come in here, driving modes. We're in Whisper now. The drive train feels great, but I'm pretty disappointed in the suspension. Like we're coming up on some speed bumps right here and it's just, ugh. That's like 12 kilometers per hour and it is not comfortable at all. So like compare it to something like the Model Y, it is very similar, but at the same time I did not really enjoy the driving dynamics of the Model Y. So there you go I guess. This thing's like $74,000 Canadian. For that amount of money I really feel like that you should have adjustable dampers. Now we do have it in Unbridled mode. We're going into a little tight little corner here. Oh, wow! It kind of feels like it gives up a bit early. It feels like that, after about a hundred kilometers per hour, you're really not getting that electric car push. Whereas in like the Model Y performance especially, that thing just rockets you and just keeps on going past like 150. Now adjustable dampers and more power will be available in the GT version of this, which is coming out, I think next year. But again, this is already like $74,000 Canadian. I don't want to be spending $100,000 on a car that is very similar to what, like a $70,000 Model Y. In the most go mode and hit it. That's pretty good, but it has a Mustang badge though. Like, that's very similar to like my Fiesta ST. This is a 0 to 60 of 6.1 seconds. Yeah it feels less immediate than a Tesla. This is definitely fast enough for you to drive like a bit of a jerk though. That is for sure. The steering input's good, but I'm not getting a whole lot back. Like it's the same problem that I had with the Tesla, where like, when I'm turning the steering wheel, it goes where I point it, but I'm not like the chassis isn't telling me anything. The steering wheel isn't telling me anything. I'm just trusting that everything's fine. And like, we're not on a track so it's not like it really matters, but there is definitely a level of disengagement from the drive compared to something like my Fiesta. So Brandon says that he really likes one pedal. My problem with one pedal is that I find that I don't like just keeping my foot on the gas so much. Okay, cruise control is set, lane keeping system on. So when you have the lane keep and cruise on, your speedometer goes over to the side instead of saying staying in the center. Here's a big challenge for the lane keep assist, I'm going to just, oh, we're going into a corner. Will it keep me? Oh, yep. That worked really well. Now there's a truck in front. Oh, the adaptive cruise does not seem great. Although at the same time they kind of cut us off. Now it seems to be just keeping up. These are some pretty complex turns here and the lane keep seems great. Oh, that's a bit scary. That was a touch scary but at the same time, like it might've been fine? I just don't want to find out in a situation where falling off a bridge is a potential. I would say this is very comparable to Autopilot in my little bit of using it, at least. Yeah, I have no clue how much I trust it either. Like that was sketchy. Oh, that's oh yeah it (beep) the bed there. So there we were just coming up to an intersection, so it was a slight corner. And then like, you know how there's left turn and the yellow line kind of goes like that? It decided that it wanted to follow that. And it was not pleasant. According to Brandon, Autopilot feels like it's still more refined. I would say as far as for just driving on the highway, this would be really good. I want this in my car. So to be clear, this is just first impressions. I don't want to finally compare this to like the Model Y because I just don't have enough time in this. I need to spend like a week or maybe even more getting to know how this actually feels to drive and what annoyances you just completely forget about after a week and what stuff is still annoying longterm. Now this is our first car review on Short Circuit. So just plop down in the comments, like for one if you liked it and how we can make it better in the future. And also what other cars you want us to cover. So, yeah, I think that's about it. Honestly, this thing is pretty freaking sick and I can't wait for more electric cars to come out that. (engine vrooms) Oh, oh wait, did you hear that Brandon? There was a V8 noise in there, I didn't hear that before. Oh, that's fake, but I like it. Hit Like, get subscribed and just have a fantastic day. So long.",
    "transcript_keywords": [
        "kind",
        "Brandon",
        "Android Auto",
        "Tesla",
        "Ford",
        "car",
        "time",
        "pretty",
        "thing",
        "Model",
        "feels",
        "back",
        "bit",
        "drive",
        "good",
        "Honey",
        "Crab Rave",
        "great",
        "Mustang",
        "Yeah"
    ],
    "transcript_entity_values": [
        "Crab Rave",
        "Olufsen",
        "0 to 60",
        "Bang",
        "74,000",
        "Fiesta",
        "Mustang",
        "100,000",
        "Play Crab Rave",
        "three",
        "One",
        "70,000",
        "chuck",
        "one",
        "Tesla",
        "Spotify",
        "Honey Honey",
        "the Android Auto",
        "6.1 seconds",
        "Amazon",
        "GT",
        "Whisper",
        "150",
        "Ford",
        "the Model Y.",
        "Fiesta ST",
        "next year",
        "Walmart",
        "V8",
        "the East Coast",
        "Brandon",
        "12 kilometers per hour",
        "first",
        "Model Y",
        "Razor",
        "two",
        "Canadian",
        "a fantastic day",
        "Ford Sync",
        "Pocket Casts",
        "eBay",
        "just two",
        "Short Circuit",
        "Spotify",
        "Apple CarPlay",
        "Ford Mach-E.",
        "New Egg",
        "about a hundred kilometers per hour",
        "Android Auto",
        "Best Buy",
        "Noisestorm"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PERSON",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "FAC",
        "FAC",
        "DATE",
        "ORG",
        "ORG",
        "LOC",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "NORP",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON"
    ]
}