{
    "id": "u5EQ_9wvUZ8",
    "title": "Apple Watch Series 6 review: a minute update",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-10-01T14:00:20Z",
    "video_url": "https://www.youtube.com/watch?v=u5EQ_9wvUZ8",
    "category": "Science & Technology",
    "tags": [
        "watch series 6",
        "apple watch series 6",
        "apple watch",
        "series 6",
        "apple",
        "review",
        "series 6 review",
        "watch series 6 review",
        "watch series hands on",
        "apple hands on",
        "watch",
        "smartwatch",
        "hands-on",
        "first look",
        "impressions",
        "blood oxygen monitor",
        "heart rate",
        "processor",
        "screen",
        "price",
        "apple event",
        "september",
        "september event",
        "dieter bohn",
        "verge hands on",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "verge",
        "the verge",
        "watch series 6 unboxing"
    ],
    "views": 335914,
    "likes": 6752,
    "comments_count": 394,
    "description": "Apple Watch Series 6 has lots of tiny updates over the Series 5, but none of them add up to a must-upgrade. It is the best smartwatch, but don't forget that Apple's other watches are also great. Plus, the blood oxygen monitor is unreliable. Dieter Bohn has the full review.  If you buy something from a Verge link, Vox Media may earn a commission. Seeour ethics policy:   Order the Apple Watch Series 6:   Read the full review:   Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "http://bit.ly/2TQsqjB",
        "https://amzn.to/34earas",
        "https://bit.ly/36lPfll",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "(upbeat music) - The Apple Watch Series 6, is the best smartwatch by a country mile by five miles. But then last year's, Series 5 was the best smartwatch too. So Apple would have had to have really screwed that up to change it. And Apple didn't, but the new features this year compared to last year Series 5, just aren't that major. Even the headline feature, blood oxygen monitoring. Isn't what some people might be hoping it will be. So it's an iterative update, but there are a lot of iterations to talk about. Including the Apple Watch SE, older other model, Family Setup and these new stretchy solo loop bands. (band snapping) Let's review the Apple Watch. (upbeat music) Instead of one major update for the Series 6 this year, Apple has put in a bunch of little ones. Honestly, I think the new feature that will drive the most sales are the new colors. There's blue and then there's this very red product red and there's a graphite stainless steel model. And all the rest. The big update is a blood oxygen monitor, which means that that sensor right at the bottom is a little bit different. And you know, we should take some more time on blood oxygen. So let me come back to that. All of the rest of the updates are super minor. There's a brighter standby screen, slightly faster charging. It's the easiest bit thinner. And there's a new processor inside even though the old processor was already fast. Oh, and there's an always on altimeter and there's no more force touch, reports touch. I don't miss you basically, I'm saying that if you have a Series 5, there's no need to upgrade. The bigger question is if you have an older Apple Watch or if you're thinking about the new Apple Watch SE there's also still the Series 3 hanging around you could get a refurbed Series 5. We could matrix out which Apple Watch is right for you all day long. It is starting to feel a little bit Samsungy just how many options of Apple Watch there are. But the reality is that the things that make the Apple Watch great are available across pretty much any recent model. And part of the reason why all that stuff is good is that watchOS 7 is really good. The new watch spaces aren't bad either. I still can find one watch face that I love using all of the time, but I have started switching between different watch faces for different tasks. So I have a biking watch face, and a workspace, and a cooking face. I need the cooking face because Siri can't set multiple timers and I get one extra timer with the cooking watch face which means that watchOS 7 is pretty good but Siri still is not and because I know a lot of people are wondering a couple more words about battery life. I didn't notice any difference between the Five and the Six, I suppose that you turned off the always-on screen. The Six could get you to a full two days, but I never did. As far as charging speeds, it is faster but not by that much. The Five would get the 80% when the Six would get to 100% at about the same time. So it's a pretty subtle difference. watchOS 7 also add sleep tracking. You get pushed into using full on sleep scheduling the system, which has you set bedtimes and so on. It's too much for me, but it works. Now the data it provides isn't as detailed as what you can get from a third party app though. Like even my Withings HR watch gives me more detailed rundowns of restless sleep or whatever, but as an included feature, I'll take it. And if you want more granular data you can still use a third party sleep tracking app. But the most important new feature in watchOS 7 is this new thing called Family Setup. It lets you set up a watch for a kid, even if they don't have an iPhone. And look, my actual only real dad thing is making dad jokes on Twitter. So I wanna talk to an actual dad. Who's been testing this feature. So we're gonna call Dan Seifort. So Family Setup, how does it work? - Hi Dieter, well, essentially it's lets you set up a managed watch from your iPhone and then you can set limits on it for your kids, like who they can message and what apps they can use. It's a lot like those big chunky GPS tracker watches that Verizon or T-Mobile sell. - Right, but those suck. How did, how does the Appalachian family model work? - Well, the thing that like, I couldn't help but notice is that the overall experience is basically the same as an Apple Watch. It's a full, real smartwatch, it's the same user interface. It isn't customized or dumbed down at all. I figured there might be some kind of simple mode for kids when you put it on the Family Setup, but Nope, same thing as before. And it does take a little bit of work for me as a parent to figure out how to do all of this controls, whether it's limiting their apps or their contacts or what content they can access. And then it's kind of an expensive solution. 'Cause you have to get a cellular model of the Apple Watch and then you have to make sure that your kid's not gonna break it. And then you have to pay a monthly service fee on top. - Right, well okay. That all doesn't sound super great, but at least if you get the SE model, it's a little bit less expensive to set all this up and even testing the SE model. And I've only got the Series Six. So what's SE like? - Yeah, so the SE it's basically a Series 4 from 2018. It doesn't have the always-on screen. It doesn't have an ECG and it doesn't have a blood oxygen monitor but if you don't care about that stuff, it's a really great smartwatch, and it's a lot less expensive than the Series Six. - Yeah, I think that sounds great. I personally care about an always-on screen but maybe I'm a little bit fiddly about that, but that's what I would like to get on an Apple Watch which is why I would probably wanna get a Series 6 or maybe I prefer Series 5. Okay, look, you you're busy, you got to go parent parent, parent, the kids go go dad, the kids. I don't, I don't know how raising kids works. - Yeah, you really know. Bye then. - Bye. - Okay, so Family Setup turns out to be a somewhat small step that really isn't for everybody. And that's kind of the story of the Series 6, a bunch of small steps that will matter to some people but will feel pretty minor to everybody else. Oh yeah, these solo loops they're really good but the sizing isn't as easy as Apple makes it seem. I use it a little sizing tool and I figured I was a seven or an eight, but I think I'm actually like a 6.5. If you could find a good fit it is amazing, but don't force it. So let's finally talk about the blood oxygen monitor in the Apple Watch Series 6 it's like I said it's not what I think a lot of people were hoping for. Here's how it works. There are these lights on the back that light up the blood under your skin and then determine its color and thus your blood oxygen level. Anything over 95% is usually considered fine. And anything under that is sometimes considered worrisome. There are two ways to use it. The first is to check it manually and to do that, you need to make sure that you've got the watch set up just right it needs to be pretty snug and up on your arm a little bit so they can get a clear reading of your blood. Then you need to rest your arm horizontally hit the little fiddly buttons and wait 15 seconds and it should give you a result. Probably I got a lot of unsuccessful readings unless I followed the instructions exactly. And that brings me to the second way to use it. It just tries to read your blood oxygen in the background. But I think a lot of the time, it's just not able to get an accurate reading. I don't wear my watch this far up my arm. And in fact, when it was trying to read it in the background sometimes I would get readings that were like worryingly low. Like, I didn't know if I should call a doctor or not but I have this finger monitor right here when I use it at the same time, it tells me that I'm fine. So the truth is this is not a medical device. Apple, isn't saying it's a medical device. You should think of it as a medical device or a diagnostic device or anything like that. It's like a wellness device. It's for, I don't know, high altitude endurance runners as it stands, blood oxygen detection isn't as useful as a heart monitor or even the ECG. And I want to be very clear on this. The Apple Watch Series 6 is not an early COVID-19 detector. Yes, Apple is doing a study, but we should wait for the actual scientific results of that study to come in before we say anything about that. If you're experiencing symptoms beyond what this thing is telling you, please go get checked out. But again, Apple is not even talking to the FDA about this blood oxygen feature yet. I sort of feel like it's here so that Apple could say that it's on the spec sheet because it's already coming out on a bunch of other watches. It's really not Apple's emo. What I would have done is wait for the results of those studies before I put it in a mass-market consumer device. But look, if you are a quantified self kind of person who thinks that blood oxygen would be another interesting stat to add to the list of things that you track, then go forth. If you're not, then don't worry about it. (upbeat music) I started this review by saying that the Apple Watch is the best smartwatch by a country mile. And I wanna remind you why that is. I think it has the best combination of the three things that most people want from a smartwatch. So one for fitness and health, it does a great job for the basics and Apple's Health app is both comprehensive and it keeps your private, unless you choose to share it to some other service. Now I'm not impressed with the blood oxygen monitor but I trust the rest of what these sensors are saying for basic fitness stuff. For connectivity and communication that has LTE options and integrates health iMessage. It's good for phone calls and it manages picked up fairly easily to Bluetooth headphones. Plus it also has this new Family Setup thing. And for basic smartwatch stuff, there's really no comparison. It's fast, it'll last, just over a day. And it has a pretty good set of apps and services that is all true for the Apple Watch Series 6, but it's also true for the less expensive Apple Watches. The second, third and fourth best smartwatch are the Series 5, the Apple Watch SE, and the Series 3. Basically what I'm saying is if you need an Apple Watch get the one that fits your budget and don't sweat the upsell. It's really not as good as data as you could get from a tinted, bloop, ala-lap, Whoo, whoo, whoo papa! Zig zigbit zig zigbit uh, wapo wapo uh Hey everybody, thanks so much for watching you know who wants you to subscribe to the verge? This cat right here, hit that subscribe button.",
    "transcript_keywords": [
        "Apple Watch Series",
        "Apple Watch",
        "Apple",
        "Watch",
        "Watch Series",
        "Series",
        "Family Setup",
        "Apple Watch great",
        "blood oxygen",
        "older Apple Watch",
        "blood",
        "watch face",
        "oxygen",
        "Family",
        "blood oxygen monitor",
        "Setup",
        "set",
        "smartwatch",
        "good",
        "Family Setup thing"
    ],
    "transcript_entity_values": [
        "Zig",
        "last year",
        "Withings",
        "seven or an eight",
        "wapo wapo",
        "one",
        "third",
        "fourth",
        "Apple",
        "the Family Setup",
        "the 80%",
        "Dan Seifort",
        "Verizon",
        "T-Mobile",
        "three",
        "Twitter",
        "95%",
        "the Apple Watch Series 6",
        "LTE",
        "Family Setup",
        "the Series 3",
        "the Series Six",
        "ECG",
        "a country mile by five miles",
        "5",
        "the Apple Watch SE",
        "Five",
        "the Series 5",
        "Whoo",
        "the Series",
        "Appalachian",
        "15 seconds",
        "The Apple Watch Series 6",
        "6.5",
        "an Apple Watch",
        "3",
        "100%",
        "monthly",
        "the Series 6",
        "Family Setup",
        "7",
        "Siri",
        "two",
        "Six",
        "6",
        "Apple Watch",
        "iMessage",
        "this year",
        "Apple Watches",
        "Apple Watch SE",
        "2018",
        "the Apple Watch",
        "second",
        "FDA",
        "SE",
        "first",
        "iPhone",
        "Samsungy",
        "last year's",
        "the Apple Watch Series 6"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "WORK_OF_ART",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "FAC",
        "ORG",
        "ORG",
        "EVENT",
        "EVENT",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "EVENT",
        "PERSON",
        "EVENT",
        "NORP",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "EVENT",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG"
    ]
}