{
    "id": "U5N10txFyls",
    "title": "Colorful iMac House Makeover!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-05-21T15:27:39Z",
    "video_url": "https://www.youtube.com/watch?v=U5N10txFyls",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 543278,
    "likes": 19233,
    "comments_count": 1415,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(upbeat music) (door knocking) - Oh, hey! Come on in! Welcome to M1 iMac cribs! This is so exciting because as a lot of you guys know, Apple introduced seven new colors of their M1 iMac, and today I am at my sister's house who is not very tech savvy. She's also a mom and she has a house full of rooms that need an iMac makeover. So come on in, I'm gonna shut the door first here so that the baby and the dogs and the iMacs don't try to run away. Protect the iMacs. Protect, protect. Let's go to our first location. You may be wondering, \"Justine, hey, this is really not safe to be putting an iMac inside of a baby crib,\" but here's the thing. The child actually does not like to go in here at all, so this is a great place for Mommy. I'm not Mommy. My sister's Mommy. Where she can go and just have a safe space because the child doesn't like to come in here anyway. So this is not a playpen for the baby. It's a playpen for the iMac. And I chose the yellow one for this specific location because I felt like it really kind of brought out the cheeriness of the room. I opted to use the trackpad here in the playpen because this is kind of a rugged environment, so using a mouse on sort of this kind of blanketed texture I thought was not the best idea. So, we're gonna use the trackpad. I think this really looks great. I think it really ties in the entire room, and I think it really kind of just brightens everything up a little bit. So let's look up some stocks, I feel like that's what, like, you know, a day trading mom would do. So stocks are looking good, everything looks great. Hi, Matty, do you want to come in the pen? Here Matty, look at this. Here, look. Here. I guess this could also be a playpen for the dog, since this is my dog and he doesn't really like children very much. So what do you think about the stocks? Everything is looking pretty good. If, Matty, if you wanna check out right here. The Apple stocks, it's rising, it's going up really high. Everything is going great. This is a new 1080p camera. It's a larger sensor, they've increased the image processing, so it's a way better experience. He gets it. We're heading into the kitchen. Welcome to the kitchen. What's great about this little location is first of all, because the baby, her name is Brynn. Which is actually our niece, I keep calling her the child and the baby, but she is related, she is our niece. She absolutely loves the color purple and she can also say \"purple,\" and every time she has been walking past the iMac boxes, she's been saying \"Apple.\" Hopefully we can catch her saying that here in a little bit, but this is where she eats her food a lot of the times. So not only can Mom be over here to check out recipes when she's cooking, but she can then spin this around. Just put it, try- taste it. Just see- yum. Yum! Has she eaten this before? (people laughing) 'Cause I'm not sure if she's enjoying it! - [Woman] Put the rest of it in there. - [Justine] I'm capable. Oh, that's in your arm. Oh... eee! (people laughing) She's eating applesauce and salmon and peas. I'm feeling nauseous just thinking about that combination. Feeding time is done for Brynnie. We're gonna flip this around, so Mom could maybe watch some Netflix, or some Apple TV, while she's probably cleaning up. What do you think that Breanne would like to watch? - [Woman] I think probably anything, 'cause she hasn't been able to watch anything in two years. - Well this morning I saw her watching the Property Brothers, so maybe we'll just put on some Property Brothers for her. - [Woman] That sounds nice. My video? - [Justine] Yeah, this is your video. My hair was very blonde. She's watching Property Brothers, doing dishes. She's distracted, actually put the keyboard in there. Oh, wow, don't do that. Now that we're done in the kitchen, it's time for dinner. So I'm going to prepare myself a nice meal. Welcome to the dining room iMac. This is the blue iMac. I chose blue for this room because she has a lot of like darker, kind of silvery gray colors. So I felt like the blue kind of pulled out those colors really, really well. And also, this is kind of my favorite one, so it's sort of the centerpiece. When you first walk into the house and you look over, this kind of a very warm, welcoming, greeting color. Having a dining room iMac is honestly key for any family, because I feel like this is really gonna bring us all together. We can have discussions over local politics and that really does bring families together. Now that I'm full from dinner, I really wanna play some games, but oh, you know, maybe I should have a drink first. Side note, I don't even drink, but we're gonna go to the bar for the sake of this video. Let's just, we're gonna, let's go. Hey! Welcome to the bar! This is where we make drinks. I don't drink, and I actually don't think my sister or her husband actually drink either, but they have a bar in their home. And I thought it would be really great to put the silver iMac here. Mostly because it ties in the colors of their bar. It's kind of like a nice silvery kind of graphite look. And I thought vodka is sort of a very similar color. That's an alcohol. A lot of spirits and liqueurs, or whatever. I don't really know much about alcohol, but this looks like a nice drink. This is why I'm not an interior designer or a bartender. Okay, that's actually why I put it over here because it matches the Millennium Falcon lego set that my sister's husband put together. Let's be real. That's actually why it's here. Having a bar iMac will allow you to play music to entertain all of your guests that you're probably not gonna have over, 'cause it's still kind of COVID times. But when they do decide to entertain again, you have entertainment. Music, movies, Apple TV, Apple Arcade. You can also look up bar recipes for drinks. How to make a Mojito. We are gonna need club soda, lime, white rum, fresh mint leaves, white sugar... Looks like they have a lot of Sutter Home and Barefoot wine, and I think that's from their wedding. Which was a long time ago. I think maybe bartending is not for me. Let's go play some video games. So we're now in the game room, this is where my sister's husband has his gaming consoles. He's got the PlayStation, the Xbox. He also has this really incredible LG TV that has Apple TV built into it. So you would probably be thinking, there's no real reason that you're gonna need to put an iMac here. That's very valid, most people would say that. This is gonna be the game room iMac. I chose the green color because I thought it kind of really tied in the room, with these beautiful fake plants back here. Just ties everything together so nicely, and it makes it feel like it's the centerpiece of the room. Not the consoles, not the TV. It's all about the iMac. Something else that is very exciting is you can connect Xbox and PlayStation controllers to this iMac, so you'll be able to play games on it as well. You can also do, if you have an Apple TV connected to your TV, somebody could be playing on the iMac and somebody could also be playing on the TV. I didn't even think about that. - [Woman] Big brain energy. - Big brain energy. Speaking of big brain energy, my brain is exhausted, and I also think that the baby might be tired. So maybe we should go put her to sleep now. So this is the new iMac. It's an M1 Chip, so it's super fast, very, very efficient. This has touch ID built into the keyboard right here, look. Touch ID! So when you press the touch ID button, it locks it. Oh, now you've turned it all off, look. Oop! This is the orange iMac, I thought it would put it in the bedroom so that it would kind of, you know, be a nice wake up. (Brynn murmurs) Oh, okay. - [Man] Here, just put that on her. - Uh... a diaper?! - [Man] Yeah, put it on her. - I put this on the baby? - [Man] Yeah, put it on her. - I don't know how to do that. - [Woman] Just put one leg in, the other leg in. - Which side is the front? That's the trackpad. - [Woman] You gotta put the diapie on. - I gotta put the diaper on. Oh God. Brynn, should we Google how to put on a diaper? 'Cause I'm unsure. Here, we're gonna put this on. Are you gonna help me do it, or do I have to do everything myself? Okay here, leggy in. Good girl! Stand up. I'm so bad at this. (Justine chuckling) - [Woman] How's it going, Brynn? - [Justine] There you go! - [Woman] Is it going well? - [Justine] Look at her little Apple shirt. That's your Apple shirt. I got this in Cupertino when you were a baby. I think you were actually weren't even born yet. Also, I just want to note that all of the places that I've put these iMacs are incredibly not child-friendly, so we're not actually keeping them here. This isn't a touchscreen, I know that that's something that you're used to. Watch this, check this out. Use the trackpad, watch we're gonna do- oh, hold on a second. Connect it to wifi. (Brynn murmuring) Um, hold on a second. You can't escape yet because- oh geez. Oh gosh. Oh boy. Oh boy! Take me down, t-t-t-takedown! That's a takedown! Now we've moved into learning jujitsu. Okay, so you want to get side control. There you go, there you go. Side control. Good girl, good girl, good girl! Welp, up and running away is an option. All right, come on into the nursery. So you might notice that this is a very gender neutral bedroom because they didn't want to know the sex of the baby before she was born. So everything is very gray and kind of very neutral. For this room, I chose the pink iMac because I really wanted to kind of tie in the color from her sheets. There's a nice little rose theme going on. And since this is a very neutral bedroom, I thought adding a little pop of color would be perfect. With the M1 Macs, you're able to run iPhone apps, so I think maybe putting on a nice little calming meditation would be really great to help put the baby to sleep. - [Woman] I'm feeling relaxed already. - That's really nice. Shh, go to sleep. Go to sleep. Time for bed. The baby is now asleep because of this incredible, relaxing melody that I was able to play for her on the M1 Mac. And one day, she's gonna be old enough to actually use this, and I feel like I'm probably gonna hire her as an editor. So anyway, she's asleep. I think it's time for me to go to sleep. Here you go. Shh. Go sleep. (relaxing music) Time for bed. I'm so exhausted from setting up seven iMacs and doing all of the software updates. Life is really hard when you're an interior decorator, decorating only with new M1 iMacs. I chose orange for the bedroom because I felt like it was a very warm, welcoming color for when you wake up. Like, when you wake up, you want to feel invigorated. And when I think about the color orange, I think about breakfast. I think about orange juice, I think about beautiful tropical days. And that's how I wanna start my mornings. I also like to start my mornings with the news. Maybe I don't like waking up to the news, unless it's good news. Can also listen to a podcast. Starting my morning off right, to the only podcast that you should be listening to, called \"Same Brain.\" - [Woman] The Same Brain Podcast Special Edition Spring Loaded Apple Event. Roll back. Intro, please! - Wow, I'm exhausted. Matty, I think it's time to go to bed. So if I want to lock my computer, I'm just gonna hit that touch ID key. And we are gonna go sleep! Come on, ready? Come on. Let's go sleep. Shh. Night-night. Just, just fake it for a second. It's okay. Thank you guys so much for watching this video. It was really fun to kind of figure out which rooms these colors would go really well in. And I think that's the great part about them is not only are you getting an incredibly powerful computer, but they really do look beautiful in any room. Don't forget to subscribe. If you guys enjoyed this video, give it a thumbs up. And, of course, let me know which color is your favorite. Shh, go sleep. Go sleep. (upbeat music)",
    "transcript_keywords": [
        "put",
        "iMac",
        "kind",
        "Apple",
        "room",
        "baby",
        "color",
        "sleep",
        "room iMac",
        "great",
        "time",
        "nice",
        "iMacs",
        "Property Brothers",
        "brain",
        "good",
        "colors",
        "Matty",
        "thought",
        "bar"
    ],
    "transcript_entity_values": [
        "Millennium Falcon lego",
        "Matty",
        "second",
        "my morning",
        "Sutter Home",
        "iMac",
        "one",
        "the M1 Mac",
        "Apple",
        "Justine",
        "Apple Arcade",
        "this morning",
        "iPhone",
        "Brynn",
        "Property Brothers",
        "PlayStation",
        "M1 iMacs",
        "Cupertino",
        "Welp",
        "the M1 Macs",
        "Xbox",
        "two years",
        "Google",
        "Xbox",
        "one day",
        "Netflix",
        "Shh",
        "Justine] Look",
        "iMacs",
        "today",
        "iMac",
        "M1 Chip",
        "seven",
        "M1 iMac",
        "Breanne",
        "the Property Brothers",
        "iMacs",
        "Same Brain",
        "Brynnie",
        "first",
        "LG TV",
        "Apple TV"
    ],
    "transcript_entity_types": [
        "FAC",
        "PERSON",
        "ORDINAL",
        "TIME",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "FAC",
        "WORK_OF_ART",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG"
    ]
}