{
    "id": "U6pDqFhN82I",
    "title": "She hacked me!",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2022-06-24T14:30:06Z",
    "video_url": "https://www.youtube.com/watch?v=U6pDqFhN82I",
    "category": "Science & Technology",
    "tags": [
        "hack",
        "hacking",
        "phish",
        "phishing",
        "phishing email",
        "phishing scams",
        "phishing link",
        "phishing website",
        "phishing attack",
        "phishing link creator",
        "phishing tutorial for beginners",
        "phishing email analysis",
        "phishing training",
        "scary text message",
        "dont download this app",
        "phishing campaign",
        "phishing call",
        "phishing campaign training",
        "phishing campaign tool",
        "phishing campaign software",
        "phishing campaign simulation",
        "vishing baby crying",
        "vishing example",
        "vishing attacks",
        "vishing"
    ],
    "views": 276000,
    "likes": 9169,
    "comments_count": 467,
    "description": "Cori shows us how easy it is to set up a phishing campaign and hack companies. Be warned!  Cori was kind enough to give my domain back to me:  - Thanks Cori :)  / MENU // 00:00 - Coming up 00:35 - Introduction 01:28 - Cori's Twitter and website 02:14 - Cori's background 02:58 - Phishing David Bombal 04:10 - Phishing definition and demonstration 11:36 - Setting up a Gophish server 13:51 - How it started 14:38 - Setting up a Gophish server (continued) 18:00 - Gophish server 20:33 - Phishing demonstration 31:15 - How to prevent phishing 34:27 - Cori's war story 37:16 - Best pretexts for social engineering 39:44 - How to learn social engineering 42:00 - Phishing demonstration recap 42:44 - Final words and advice 43:22 - Connect with Cori 43:34 - Conclusion  // Software used // Gophish:  LinkedInt:  Singlefile:   // Books discussed // The hacker playbook by Peter Kim:   // Cori SOCIAL // Twitter:  Website:   // People mentioned // Rachel Tobac:  Snow:   // David's SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube Main Channel:   YouTube Tech Channel:  YouTube Clips Channel:  YouTube Shorts Channel:  Apple Podcast:  Spotify Podcast:   // MY STUFF //   // SPONSORS // Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com hack hacking phish phishing phishing email phishing scams phishing link phishing website phishing attack phishing link creator phishing tutorial for beginners phishing email analysis phishing training scary text message dont download this app phishing campaign phishing call phishing campaign training phishing campaign tool phishing campaign software phishing campaign simulation vishing baby crying vishing example vishing attacks vishing  Disclaimer: This video is for educational purposes only.   Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!    #phishing #vishing #hack",
    "description_links": [
        "https://discord.gg/davidbombal",
        "https://github.com/gophish/gophish",
        "https://github.com/vysecurity/LinkedInt",
        "https://chrome.google.com/webstore/detail/singlefile/mpiodijhokgodhhofbcjdecpffjipkle",
        "https://amzn.to/3tZHwoe",
        "https://twitter.com/corg_e",
        "https://www.corgima.com/",
        "https://twitter.com/RachelTobac",
        "https://twitter.com/_sn0ww",
        "https://discord.gg/davidbombal",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://youtube.com/channel/UCZTIRrENWr_rjVoA7BcUE_A",
        "https://www.youtube.com/channel/UCbY5wGxQgIiAeMdNkW5wM6Q",
        "https://www.youtube.com/channel/UCEyCubIF0e8MYi1jkgVepKg",
        "https://davidbombal.wiki/applepodcast",
        "https://open.spotify.com/show/3f6k6gERfuriI96efWWLQQ",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "- At the end of all of your messages, you append a bunch of your URLs, and they're all pretty standard. It's like davidbombal.com, youtube/davidbombal. - And then I noticed that your Discord is like discord.gg slash random characters. And I was like, don't tell me that David hasn't snagged his own Discord URL. - What really worries me is, you know, how easily you could get good domains, including my Discord, how easy it was for you to build this like phishing platform and send emails. It's really worrying how easy it was. (bright upbeat music) Hi everyone, David Bombal back with a very special guest. Cori, welcome. - Hi David, so happy to be here. - You gotta tell me, I mean, it's, we were talking about this offline. Today's a big day in the U.S. It's also a big week if you like in the UK. You gotta tell us about this handle. Why did you get this handle? Well, what is it and why did you get it? - So Corgi is my handle. I've gone by Corgi for probably like the last 10 years. It's just a play on my normal name, which is Cori with an I, just append a G in there. And it's such a cute dog as well. - It's funny because yeah, with the Queen's Jubilee, when I was like getting ready, I thought, is there something that you really like the dog, or you like the Queen, or it's just something that happened? - It's just something that happened pretty naturally. - Cori, before we get into the details, do you have like, a Twitter account and other accounts where people can follow you, you know, if they wanna learn more and perhaps ask you questions? Just for everyone who's watching, please don't send her like thousands and thousands of questions, but Cori, where's a good place to follow you, or, you know, to interact with you? - Yeah, definitely reach out on Twitter. My username is just Corg and then it's underscore, the letter E. I'm more than happy to answer any questions if I can about anything, social engineering or getting into pen testing. - And I was looking when I was trying to get your social media profiles ready for this interview, do you have a LinkedIn or is it, is Twitter the best place to go and perhaps your website, is that the best places to go? - Twitter is definitely the best place. Or my website, yeah, which is just corgima.com. - So I'll put those links below. Anyone who wants to follow Cori and get the details. You do a whole bunch of things. So when I was researching this, you do, and you correct me if I'm wrong and, you know, just tell us the details. You do physical pen testing, you do red teaming, you do social engineering, you do phishing, you do a whole bunch of stuff. So tell us kind of what you get up to and what's, you know, what we're gonna be covering today. - Exactly. Yes, so I'm just an offensive security consultant. So I do everything under that umbrella, the standard like network pen testing, which is like internals, externals. And then I do a lot of social engineering for my organization. So that's like the physical pen test and then like vishing, which would be phishing over the phone and then standard phishing, which is through email. - And today we're gonna do mainly phishing, is that right? And I was gonna say, be careful which URLs you click on because you did a lot of great preparation for this demo. So tell us what you've been up to and yeah, take it away. - Yeah, so thinking about this episode, I thought like, what would be a unique approach for David Bombal? So I kind of went out there and at the end of all of your messages, you append a bunch of your URLs and they're all pretty standard. It's like davidbombal.com, youtube/davidbombal. And then I noticed that your Discord is like, discord.gg slash random characters. And I was like, don't tell me that David hasn't snagged his own Discord URL. - You're putting me to shame here. - So I took that for you. So it is in my control right now. I had let your team know beforehand. I was like, he can have it after this show. - Oh, I really appreciate it. I'm getting red now. You know, you've called me out. No, that's brilliant. So, and you, what did you do with the domain name? 'Cause you also got a domain name didn't you? - I did, yeah. So it's kind of like a non-standard, it's just David-Bombal, but I went ahead and I just downloaded some of the content from your website and it is hosted there right now. - I love it. I'm gonna step back now and let you do a demonstration and I'll ask a bunch of dumb questions. Like, were you hosting it, do you know how much it costs, how you prepared for this? 'Cause obviously you've done a lot of preparation, so I'm really, really impressed. So take it away. Show us what, you know, lead us down this road. If I wanted to do phishing of a company, how would I do that? 'Cause let's assume that I know nothing. So let's start perhaps with that, sorry to talk so long. What is phishing and then, you know, show us how it's actually done. - So phishing is kind of like tricking people into an action via email. Usually you'll see like credential phishes, that's the most common type of phish when someone is trying to gain access to a plain text username and password. But then there's also payload phishes, which would have some type of like malicious file attached or whether, you know, it's related to Cobalt Strike or like any type of payload that someone has made. To start with phishing, when you're targeting an organization, usually you'll just wanna build like, a complete detailed listing of everyone that could work there. And then of course the email addresses and contact information of those people. For that kind of stuff, there's a tool that I really like. It's called LinkedInt. And that's just LinkedIn with a T at the end. It's hosted up on GitHub, and it allows you to query an organization through LinkedIn and then pull everyone that has a LinkedIn account associated with that organization. And then it even lets you play around with the email formats. So like if you think that their email addresses are formatted, first name dot last name, it'll go ahead and make all of those email addresses for you. But obviously when we're phishing, like if I was phishing people who like David Bombal, it would be a little bit different than if I'm phishing like, employees of an organization. So for this, I took kind of a different approach. Yeah, so I had went ahead and I went, 'cause you do a lot of giveaways and I snagged a bunch of this verbiage that you have. It's all pretty similar. This is also how I saw that you also don't have the David Bombal TikTok. I should have looked into that. - Oh that I do, fortunately. - Oh you do, okay. - Fortunately, I've got that. So you can't get me there. - But there's tons of verbiage here that you could pull. Obviously you do a lot of giveaways. That would be a really good avenue to approach. - It's funny because, it's interesting that you mention that 'cause on YouTube, I have this constant problem and I know a lot of YouTubers have where scammers send people messages in the comments, like \"DM me and you've won a prize.\" So let me just say that for everyone who's watching this video, please do not reply to the scammers. I will never ask you to DM me on Telegram or something for a prize. But sorry to interject. It's interesting that you've taken this route because that happens all the time. People are getting scammed who, you know, get told they've won prizes. - Yeah, and so with your website here, what I had actually done was there's this awesome tool, it's called SingleFile, I don't know if you're familiar with it, but it makes phishing really, really easy because you can just go to any website and it's a Chrome extension and you just click it and it will take all of the content of the website and minimize it into one document. So that'll take like the CSS and the JavaScript and it'll minimize all of it into one thing. So here I've just cloned your entire website. - Wow, yeah, just assume I know nothing. So assume, just teach us. So that's just a tool that you got from the Chrome store, yeah? - Yeah, exactly. It's just a Chrome extension. - Wow. - And then the part here, especially, you know, if I was trying to do- oh, you can see my own credentials. - We got you there. I will blur that out. - If you know, you were trying to take this website, which is actually what I had done, you could just clone that. And then this is actually the site that I have up right now. So it's just David-Bombal, which is completely different, you know, obviously. - Wow. - Your domain, but it functions perfectly and it just, you know, I've removed a couple of things that didn't look, I didn't think would look good in a phish clone and it'll just capture any credential submitted into it. - It's interesting what you've done because David-, I don't want, I'm scared to say anything now because what you've been able to do so far so quickly, the David Bombal domain is hosted on a different site to the courses, which is what we're seeing here. This is like, - [Cori] Teachable, right? - [David] Teachable. - And one of the reasons I'm doing that is because people, I've been getting more and more people who are attacking my website and trying to like, break in. It's like, no, I'd rather put this on another company. So if we have a problem, it's their problem, not my problem. Obviously didn't save me this time, sorry, go on. - And I did notice that yeah, that it was unteachable. But it still has your logo, so it looks fancy. So that was really it from that avenue. I also went ahead and snagged that Discord URL of yours that was available. I hadn't done anything with it yet, but basically if you just go to discord.gg/davidbombal right now, it'll go to my Discord. - Don't do that! (both laugh) - Until after, yeah. Because I will give that to you. - That's very kind, I mean, that's so cool. I mean, it's actually quite bad for me obviously being a personal person, but it's so nice to see you doing this because these kind of things are the same mistakes that companies are gonna make. And I'm sure, you know, the bigger the company, the more likely they're gonna make lots of dumb mistakes. - Most definitely, yeah. And then I thought maybe a fun kind of like show and tell for this would be configuring a Gophish server. If you're not familiar with Gophish, it's a type of phishing platform. A lot of red teams use it internally. And I thought we could just create one and like, so it's super easy, quick to do. - Yeah, show us, because I mean, my thing is, okay, you're going to, you've attacked me. So what you've done is you've found domains that are valid and then domains that are similar, is that right? - Exactly. - Or domains that should have been registered, but weren't registered, like the Discord. And then you just register that somewhere on a like Bluehost or some registrar, is that right? - Yes. And if I was targeting you, I would probably take either of those, you know, take both of those links because they look so verifiable and I'd go spam YouTube comments saying like, \"Hey, here's my new giveaway page!\" Stuff like that. - Just like we said, what's actually really happening. Yeah, that's really good. On YouTube I've actually, I'm scared to tell you now, but it's, I've blocked all URLs by default because of all this scamming that goes on. But that would- that doesn't stop you. I mean, you can find people's details, can't you? - Yeah, of course, yeah. You can go into each individual person, yeah. It's all about persistence. How much time you really wanna spend doing it. And the truth is like, I don't wanna spend a lot of time when I'm working because I'm only getting paid for a week or two weeks or however long an engagement is, but when people are doing it to support their families, you know, in impoverished countries, they'll spend forever if they have to. - So just so that I, sorry, I just wanna systematically get in my head how it works. So you did some reconnaissance on me. You found some domains, you found similar domains that were available, then you registered those. And then now that you've done that the next step is to do this, is that right or am I jumping the gun? - Well, so I would kind of put these into two different parts because, I don't think I would email users that follow your YouTube. I would probably just go to your Udemy course and find people who have registered for that or left reviews for it and I would dig into them, either find their contact information or probably go a more public route, which would be just commenting on YouTube videos. But just to stay true to the episode, which is phishing, I thought that we could probably set up a Gophish server, which is just a phishing platform and show people how they could send out phishing emails in mass. - So Gophish just for everyone. I wanna bring the level down. That's a platform that allows you to create a phishing campaign, is that right? - Yes, exactly. - Okay. - So Gophish is a phishing platform and I'll do a run through of it too, because I love Gophish. - So I will go ahead and just start up a Lightsail instance. - What is a Lightsail instance? - So within Amazon web services, it's just like a virtual private server. People can do like EC2 or Lightsail. I prefer Lightsail. - And those are the kind of costs up there that it costs for like a month or something, yeah? So basically you're just setting up a virtual server in the cloud for some amount of dollars so that you can set this up, yeah? - Exactly, yeah. And this one is free for the first three months. - Even worse. - Yeah, I won't even use it for that long. - It's just amazing how the tools are so readily available if you know where to go. So appreciate you, you know, sharing this. - Of course. This will take a minute to load, but all the Gophish documentation is on GitHub and then on their website as well. It's a really amazing phishing platform. It lets you do so many things and maintain so many different campaigns within it. So my virtual private server is loading up right now. I will give that a minute. This is the documentation within GitHub. It's super readable even for like, non-technical people. For the downloads, we'll utilize that in a second, whenever this loads up. - So you're spinning up a server and then you're gonna do like a git clone or something? - Exactly. Exactly, yeah. I'll wget it. Just download and then we'll work from there. You'll see, it's literally like a 10 step process. It's unbelievably easy to set this up. - Just for someone who wants to start out, the first thing you did, you gotta find information about some, like a company we've all got these like dodgy emails. So will you also show us how to like write an email so that it looks legitimate? Is that part of this Gophish thing? - We can definitely do that, yeah. I will show you how to configure everything within this if you'd like. This is our virtual private server. - I've gotta ask the question. How did you learn this stuff? Did you, sorry to take on a tangent. It's just always interesting. Did you just pick this up through years of like experience or are there any resources that you found really valuable, books, stuff like that? - So I've always been super into technology. My dad was a programmer when I was growing up. He was like a pro monk. - Wow. - So he was always securing stuff and I was always like, I have to break it to get past my dad. So I've always been super aware of security and hacking. That was just something I like, grew up loving, but in terms of just- really, doing hands on stuff is the best way to learn. There are really great resources too, for like generic pen testing. I always recommend \"The Hacker Playbook.\" It's one of my favorite series of books. It's absolutely incredible. So we're in here, just do a sudo so that we have root privileges and I'll go ahead and just make a directory called Gophish. So everything's super organized. I like to be very organized within my machines. - [David] That's great. - We'll go into that and then we're just gonna do a wget, so we'll pull this Linux download, perfect. All right, so we wanna go ahead and grab that. We'll make sure that it's there. We're gonna have to do, 'cause this is a Fresh VPS we're gonna have to apt install unzip so that we can unzip that and we'll unzip our Gophish. Make sure that it's all there, perfect. And then, so this is the really big part when you're configuring a Gophish server. This config.json, that file stores all of your configurations. So we are going to have to just make a small adjustment here. So this admin server listen_url right now, it's at local host, and then at the port 3333. To make this externally accessible, you have to actually change that to 0.0.0.0.3333. - Could you use port 443 or 80 or just change it to whatever port, yeah? - Yeah, this is just like, the standard Gophish configuration. I usually leave it at that just 'cause it's what I'm used to, but you totally can, you can change that. We have that set up and then we are gonna go back within our VPS and Amazon has some weird, like- I shouldn't say weird. They're very strict about their like, networking rules. So we are gonna have to add a custom rule here to allow our port, and we have that configured. So back in here and all we have to do now is just start Gophish. Ah, configuration issue, so. - I'm glad when you make mistakes 'cause it's, you know, it helps us learn. - Exactly, yeah. I love when I see people make mistakes in like, online tutorials. So yeah, we're changing our permissions for Gophish. So we're doing a chmod and now we should be able to start it. Awesome. And so whenever you spin up a Gophish server, whenever you spin it up for the first time, it will host the username and password for the administrator within the starting message. So we'll go ahead and find it here. Awesome. So we've opened it up to the internet. So we'll just take our VPS's address, we'll go there and then we'll append our 3333. And here we go. - [David] Just like that, eh? - Yes. - [David] Wow. - So we'll go ahead and log in with those credentials that we made. And I love Gophish. It's such an amazing platform. It has so many characteristics to it for phishing and it'll prompt you to reset a password whenever you first create a server. - Let me guess it's Corgi. - It's not. - Sorry, but I- - Don't say that on the air! - Sorry, sorry! - So this is Gophish. So this is just the standard dashboard. So once you start to create phishing campaigns within Gophish, they'll all show up here along with some really fun stats on like the number of users that clicked it, the number of users that reported an email, the number of users that submitted credentials, et cetera. So this is where you store campaigns. So this would be anything active that you have running, any active like phishing campaigns. Users and groups, this is awesome, where you submit any users that you're forwarding a phishing campaign to. So if you're targeting an organization, you could use a tool like LinkedInt to pool the employees that are listed as working at that company on LinkedIn. And then you can actually just put them in a CSV. LinkedIn makes them into a CSV and you can just bulk import that here. So you can target like 1,000 people within seconds. - How long does it take you to, you know, from the technical part, it's taken you a few minutes, that's all it's taken you, right? - Exactly, yeah. And most of the time people will have, you know, standard phishing servers that they maintain internally. So they don't even have to do this every single time. - It's worrying, isn't it? It's worrying. - It is. It's scary. Although I feel like I don't get very many phishing emails and I've seen my organization's internal, like phishing attacks, like the real phishing attacks that we've received from threat actors. And it doesn't seem like it's as much as I would have thought it would be. - Do you think that's 'cause people are more aware or do you think that's because the, like the spam filter, stuff like that is picking it up? - Well, and I've seen on the other side of the spam filter too. I think that probably most people that conduct phishing attacks like this are probably like sole actors or they work in like those warehouses, you know, in another, in an impoverished country where they're just trying to make money. Less as much APTs, you know, or people who are trying to mass steal credentials. So this is where you would create email templates. So those actual phishing emails that you forward to people, you can store hundreds of them within here. Landing pages, which would be the actual website. So like the david-bombal.com that I had made. And then sending profiles, so this is where you store all of your personal domains. You can host tons of domains in here so that you can cycle through tons of different phishing emails. And that is really it in terms of their configurations. If you want me to walk through any of them or we could like build out a phishing email or something. - It'd be great if you can show us like A to Z, if you like. Okay, so you've got this installed now, how did you get my website? Or like, what do I do now? So I'm looking at this application, what do I do now? - So we could go ahead and create an email template. - [David] Okay. - This is how you create an email. The naming convention is just for your own use. So that would never be seen by a user. Here I'll just say David Bombal's. Then my email subject will be, let's see, you're at like, 900-something thousand subscribers. - Sorry, go on. - 1,000,000! - Well done. - Subscriber giveaway! - Giveaway! Well done. Yeah, I can see you do this for a living, wow. - And I already stole some text that you had up on your website. - You did good. - We'll use the Udemy one when you had 500,000 students on Udemy. - So I'm not- for everyone watching I'm not doing a giveaway. 1 million, - Yet. It's Cori's fault, no giveaway. - Okay, so this is the exact wording that you had posted when you hit half a million students on Udemy. So we can just update it so it looks exactly like you would say it. - And I'm using Discord, even worse. You got me. So that's where you could use like my proper Discord or the one that you registered. - Oh, exactly, yeah. - Wow. - And that is the only social that I would link here. So, and then you also use these, I noticed this too, for links. You always use the bit.ly, which- - I've changed that, fortunately. - Oh, you have changed it? - Yes. - Okay. - I've got wise, yeah. - I was gonna use that as well. - No, that's fine. I mean, let's just- because people would, people would recognize that, wouldn't they? And they'd probably click on it. So yeah, feel free to use one of those. Yeah, I use another David Bombal domain, but that's the problem. It's like a David Bombal Wiki domain. So you could have registered david-bombal.com, which you've registered and you could do something else there. You already, you already done it, wow okay. - Yeah, so we can go ahead and make our bit.ly, We'll also steal this because it looks pretty good. CCNI, CCOP. - I'm glad you're working on the right side of the law. - And then yeah, we can just steal these links. Perfect. Yeah. So this is just how we would craft an email. Oh, I didn't even take that bit.ly. We could just leave it like this. - Yeah. I mean, it proves the point. - Yeah, exactly. So save that template. So this is what we have here. The landing page, I would just actually forward to my- so I'd redirect this to the website that I actually own because for landing pages, this would just be hosting dynamic content. When I already have the static website that I purchased. And then we would just integrate users in groups. So if I was targeting people that watch David Bombal, I would go to your YouTube page and look through everyone who has either left a comment on your videos or I'd go to your Udemy and see the people who have left reviews for it and target those people, likely. - How would you get the email addresses, you know, like social engineer them to give you an email address, is that right? - Well, yeah, if I had enough time to dig, I would just identify those actual users, you know, identify people that have a name or some sort of information associated with their account. And then just kind of backwards trace that, use open source intelligence to identify that. - And if it was a, let's say it was a corporate, rather than my subscribers, you would just find the emails on LinkedIn and places like that. Is that right? - Exactly. - So let's say I'll give you an email address. Can the editors please beep it out? So it's just (bleep). - Yes. Do you want this to be sent to your email? - Yeah, let's send it. I'll put it on screen. - I will have to send it to you afterwards cuz I don't have, I would need to associate my DNS A record with this, so. - So you, in other words, okay, so that's good that you've said that. So if I'm using this tool, I've gotta do something here to send the email. Is that right? - Yes. So you'll need to add an A record to whatever domain you're using for the sending profile. So if you want it to be @, like, my david-bombal.com, if you wanted to be david@david-bombal.com, you can easily do that. You just need to associate the DNS records with this Gophish server that you've created. - Okay. So if you did send it now, it would just come from some random email address. Is that right? Or it wouldn't send at all. - It would not send. - Okay. So do, where do we set that up? Where do we set up that piece? Is it something that you have to do here or is it something that you have to do on like, your provider? - I would have to go through my provider, the person that I purchased the domain name from. - Yeah. I wanted to keep the level low and just make sure that we understand the steps. This server needs to be configured with SMTP or something, is that right? To forward that email and you need to have the right details. Is that correct or? - Exactly. Yeah. - Okay. So in this app, is there a place where you have to set that or is it just, I'm just trying to in my head, how do I connect this to the, oh, is it on the sending profile? - Yes, exactly. - So there's the- okay. Sorry. - Yeah. Those are the sending profiles that you associate the email with. - Okay, so it's SMTP. Okay, I get it. Yeah. Okay, that makes sense. So you give it a name like \"David, the boomer, easy to hack guy\" SMTP from David, the boomer and then the host is the actual SMTP server. Okay, great. That makes sense. - Exactly. - Wow. It's way too easy. - It is. I'm trying to think- - Okay. So I get the email. So I click on the link, which I won't do 'cause I'm scared of you, but let's say I did click on the link. That would take me to the server that you've got, the phishing server. Is that right? - Exactly. Yeah. And you could take any approach, like a payload phish where you're prompting users to download something. That seems like a really good option if someone was targeting you or users, because what would I do with their credentials besides like their Google credentials or something, which could be linked to a lot of different things. But yeah, more likely just establishing a connection to their device would be best. - So you're gonna try and get them to download something onto their computer. - Yeah. - So let's make it corporate now. So this is in a corporate environment. What are you gonna try and get them to do? - So it depends. We take both approaches at the corporate level, both credential phishes, which would allow us to access their internal network. Unless they have MFA, but of course there are ways around that. Or a payload phish where, you know, we're just trying to establish access to their actual device. - So you're basically gonna get something to install, so you can backdoor into their computer. Is that the payload idea? Yeah. - Yes, exactly. - And then the credential is where you get them to log into a \"real\" site, which is obviously your fake site. And then you grab their credentials and then you could use that to get access to their company. Is that correct? - Exactly. And something that I like doing a lot, I really like forming chained social engineering attacks. So that'll be like, we send out an original phish email and then we pull the submission rates off of that. But then we go ahead and we attach another form of social engineering attack. So something that I frequently do is, if I don't get a lot of submissions or a lot of success with the phishing, like through the email, I will go ahead and call each one of those users that I had sent the phishing email to. And I'll try it from that way. So a frequent pretext that I use in that situation is, Hey, you know, I'm Cori with IT. And I sent you this email the other day. I haven't heard a response back yet and we can't close the ticket until you do this. And it is incredibly effective. - People are way too trusting. Is that right? - They are. And I think it's kind of necessary, you know, otherwise we would all be... - Paranoid. Yeah, yeah. It's interesting, different parts of the world I find are more trusting than others. I agree with you. You have to have some kind of level of trust. Otherwise, you know, you can't function. - Yeah, definitely. - Cori, do you have like an example of a real campaign that you've run or something? Cause this is like, blank, and it's nice to see it from scratch, but can you give us like an idea of what it would actually look like in reality? - Yes, definitely. So when you go into the campaigns, once it's completed, you'll see all these sorts of statistics on how many users have submitted credentials or how many users have clicked the links, even how many users have opened an email, which is very helpful sometimes to ensure that emails have passed like spam filters. - So on the email templates, you've crafted a great one for me. Have you got any example that you can show us of like, real phishing templates that have worked and obviously we'll hide the company information. - Yes I can. I can pull something up. I can show you one that's super, super effective. I'm just gonna stop sharing my screen for one second. Awesome. So this is a super effective, this is one of my favorite phishes. Of course, when we're targeting people, the things that we aim for are getting emotion out of them because that's what gets people involved. So this is one of my favorites. It's like Cobranded Company Swag. So the entire email targets that this organization has created a new wearable for their employees. And everyone gets an option. Whether it be a shirt, a like quarter zip-up pull, a blanket or a water bottle. For each of these, I Photoshop like the organization's logo onto that item. And then the image goes out with that. So it just adds like a really nice touch. I've never had this not work. - [David] Wow. - And frequently, this is the most popular phish that I use. It'll get anywhere between like a 40 to 60% submission rate, which is pretty nonstandard. - [David] Wow. - Yeah. - So just for everyone who's watching, I'm not gonna do, send you an email with swag. There's no David Bombal swag coming on an email because you know, it's coming from Cori, not from me. But that's brilliant. Wow. Did you say 40 to 60% click through? - 40 To 60% submission rate. So those are actual credentials. But this is the most- Things like this are super common for credential fishes. When you're trying to obtain a username and password pair. When you move into like payload fishes, something I'll frequently do is based off of security tooling. So coming from the perspective of IT like, hey, you know, our antivirus or endpoint detection response tooling has not been updated on your system. It needs to be updated immediately because of whatever security concerns are happening. Please go ahead and download this. That pretext itself is very successful as well. - So now the big question. I get a lot of flack. 'Cause I talk about, I do these red teaming interviews and these like hacking interviews. And then all the blue team guys are like, David, what about stopping this nonsense? So what's your advice? How do people on the good side stop this? Cause you're doing this penetration testing to help a company improve their security. So what, what advice would you give them? If like someone- like 40% of people, you know, give you their credentials? What advice? What's the next step? So what do you advise the company? - For the organization to do? - Yeah. So like, now you've proven that you can get through their security defenses and a lot of people are falling for this. What do you- do you just give them the report and say, \"You're in trouble now!\" Or do you like say, okay, this is what I suggest to teach you, do they go for training? What's the next step? - Yeah, of course we always work with organizations through mitigations and remediations past this stuff. For organizations that are susceptible to phishing, obviously multifactor authentication on everything is our first suggestion. Because really, you can phish a user. And if that single set of credentials isn't helpful, you can't move any further. Right? Because there are plenty of instances that we see where you can get a username/password pair, and you can't access anything because they have like, fully protected all of their authentication points. - So yeah. So the best deterrent or the best thing to do as a minimum is two-factor authentication. Is that right? - Yes. And we also see that done poorly. Just recently with, I can't remember. It was like a group of 16 year old kids that had gotten into Microsoft. I forget the name of their group, but they had done something called MFA bombing, so we see MFA implemented poorly as well. Like when users get a text message and it says, click this text message or click this push notification to allow access to your system. And if someone is already on their computer, they'll think, you know, that's for me. Or if it happens at 3:00 AM a hundred times in succession, then of course, you know, they wanna stop receiving that notification. So implementing MFA and then implementing it appropriately. Google's MFA is one of the best implementations that I've ever seen. If you try, attempt to log into a Google account, it'll tell you, go into this specific app on your trusted device and then enter the code that you see on that, on this computer. So there is no way getting out of that other than like social engineering, maybe calling a user, which, you know, is a great deterrent. - Any other advice? 'Cause I think that's br- I'm glad you used the Google example because I find that it's, you know, the problem is it's frustrating and then people turn it off or try and circumvent it because, you know, I might not have the device with me. I'm traveling, and all this kind of stuff. What's your advice to organizations to convince the users to do this? - Just forcing them. I feel like that's the only response, especially internally, because you know, being an employee, you do have a responsibility to help secure your organization. And if that means it will take you an additional 30 seconds to log in, then unfortunately that's just the pathway that has to happen. - So have you got any war stories? I mean, obviously don't tell us names, but have you got like any crazy war stories of things that you've done? - I do have war stories. Moreso on the physical pen testing side because you know, when you're sitting behind a keyboard doing phishing, it's not as exciting. - So I think we need to get you back for physical pen testing. I dunno- that's very hard to demo, but hopefully you can do some, give us some B-roll for another video. But give us some examples just to, you know, to whet the appetite. Give us some crazy examples of physical pen testing that you've done. - Yes. So physical pen testing, the only time that I was ever \"caught,\" I would say, I was working for an organization that was... it was a super, super secure industry. So I had identified an employee that was working at a location I was trying to access through LinkedIn. And I saw that he had only been working there for like six months or so. So I thought he probably doesn't have a great idea of the practices that they use in terms of letting visitors come in. And I spoofed their director of physical security's phone number and I called him. I called his personal cell phone that I had found, you know, just through open source intelligence, I spoofed her phone number and I was like, Hey, this is me, the director of physical security. And I have a vendor that's performing a physical access control review within half an hour. She's going to come on site, can you please let her in? He was like, of course I'll let her in. So then this was actually across the country from where I live. So I had just flown into there that morning. And then I called him, I got on site. He let me in. And he was like, you can go anywhere you want, besides the server room. And of course, you know, being a physical pen tester, that is really the only place that I wanna go. I don't care about your bathroom or whatever. From the perspective of an auditor, I was saying, you know, I really need to access the server room. That's the final part of this process. And so he let me in there, did what I do. And then as I was walking out, two people came up to me and they were swearing. They were like, who is this person? How, why did you let them in here? And he was like, don't worry. It's not a breach. That was when I cut it. 'Cause they were just so upset. So visibly upset. I was like, you know, I finished my review. I'm gonna go ahead and head outta here. Thank you so much for all of your help. And then as I was leaving, their CSO had called me and he was like, please tell me that that was you, Cori. - Oh wow. So I mean, they obviously paid you to do the test. And they were obviously very relieved that it was you at the end of the day. - Yeah, definitely. No, that was it. So that was the close call. And actually they said that that was the first breach that they had ever had at that location, even in terms of physical pen testing, so. - And the poor guy lost his job. No, I'm just kidding. I don't know. Hopefully he was all right. - I hope so. - Tell me, you, I saw in another interview, you have this excuse that you use that gets you past a lot of people's security. You say you're an auditor. You kind of use that term again in this example, could you just tell us like that? I can't remember exactly, what term you use and how it helps you. - Yes. So I do use the auditor pretext a lot when I do physical pen testing, 'cause everyone is familiar with auditors and they're so frequently happening on a reoccurring basis. And people feel really out of the loop when it comes to an annual audit. So being an auditor surprise at someone's door, you know, across the country, it helps all the time. It's a pretext that I don't think has ever failed. With me, at least. - That's amazing. So I mean, you don't- do you have to break through doors, 'cause I've seen a lot of like physical penetration testing where people do all kinds of like crazy things. Do you find that social engineering is the way that you get in or do you have to also, like, go through doors and do interesting things? - So there are times that I need to do stuff like that. I always try to go this social engineering route just because it's easier. It's easier on everyone. It doesn't damage your locks, you know? And it's easy for me to lie to people. And this is actually a funny instance. I actually had someone once, I went into the front of this organization, I was like, hey, I'm an auditor. I'm doing a physical access control review. I need to take pictures of all your cameras and stuff. And someone, an employee from that organization had come out and he was like, this is so funny. The last time someone checked our physical security controls they broke in through the stairwell! And I was like, oh, don't worry, that won't be me. - You know what the thing is, it's nice to talk to someone like yourself who's doing this, because you know, the movies displayed as like, James Bond doing crazy things. And you saying that's not always necessary. Social engineering is a lot easier. - Exactly. It really is. And yeah, just putting the work into forming pretext is super beneficial. One of my favorite pretexts that I've ever had was I had dug into this organization, their background and all of the employees at it. I identified that the CTO had a daughter who had just went off to college a few years ago. And so when I woke up in the morning, I grabbed some muffins from my hotel cafe. I went over to the office and I was like, Hey, I'm so-and-so's daughter, I'm in town from college and I really wanna surprise him. And they were like, oh, this is awesome. Like, I'm so glad to be involved in this, come in. - The thing is always in the back of my mind, I'm always thinking, how do you learn this stuff? And how do you stop this? You've given us some books. Have you got any other resources or is it just practice? - Yes, a lot of practice. I also think some people, I hate to say this, but I think that some people are just better adapted to like social engineering naturally, whether they can read people in an instance. Because I work with a lot of technical people, obviously when I do, you know, I do often security, and a lot of them do not make great social engineers. And they try and try, but yeah, sometimes it can be painful to watch them. Something really fun that we're doing is we have the social engineering community, which is a new village at DEFCON this year. And so we have a vishing contest where people can submit an entry to that. And they'll actually go up on stage in our sound booth and they'll make real vishing calls to these various organizations and they'll collect like flags. It'll be super fun. - That's great. I mean, it's fun. Did I hear a baby in the background there? - Yes, you did. - No, that, as soon as I heard that, it reminded me there's this YouTube video where a lady was also doing social engineering and she just played baby sounds to get people to feel pressured to do something, like give them personal details. Sorry, go on. - Yeah. I think that video is, I think that's Rachel, Rachel Tobac, she's in the village too. I love her so much. She is incredible at what she does. She was one of my first like, role models in social engineering. She is just incredible. - So social engineering, obviously you gotta have like, naturally have a skill for it. I mean, whenever I have these conversations, I think of my wife. She's gonna be a million times better than me because she can just read people. I tend to be much worse at that. She can just look at someone and read what's going on. And I think when I heard you getting interviewed before you were saying that reading and you said, you need to be able to read people and then adjust to the situation. Is that right? - Exactly. Yeah. And it can be within seconds. 'Cause not everything is overt as people coming up to you and swearing. It can be on the back end while you're doing things, whether it be calling the police or, you know, being suspicious of you and you have to identify when it's time to move on. - So Cori, just for me, because I'm a bit slow. What you did is you, you found domain names. So like davidbombal.com and then you registered a similar domain and that's where you were gonna host the fake website where I would put my credentials in. Then you downloaded the software, the Gophish software, or sorry, you firstly registered. And you got a VPS on Amazon, then you copied that software down. And that gave you the ability to actually send the email. And the email is the way that the person would go to the fake website. And then they would log in with their real credentials, hopefully. And then you would grab those credentials. Did I understand that correctly? - Exactly. Yeah. - Before we wrap up, do you have any final words or advice for anyone who wants to get into this or advice for people who are trying to stop this nonsense? - So for anyone trying to get into social engineering, if you're gonna be at DEFCON this year or any other year, come check out the social engineering community, which is the new social engineering village that we have set up. It's gonna be awesome. You can go ahead and make calls within our sound booth, you know, try your hand at phishing, see whether you like it or not. And really just get out there. There's some great books out there on social engineering. There's some really great people to follow. Rachel Tobac is amazing. Snow over at IBM is also awesome. - So just remind us, what are your socials? I think it was your Twitter account that's the best place. Is that right? - Yes. Feel free. If anyone wants to reach out to me on Twitter, it's just corg, C O R G, underscore the letter E. - Thanks so much for doing the demo. I know demos can be really hard. And you know, sometimes, it's easier to talk about this stuff than to demo it. What really worries me is, you know, how easily you could get good domains, including my Discord, how easy it was for you to build this like phishing platform and send emails. It's really worrying how easy it was. But thanks so much for demoing that because you know, it's one thing to talk about it and it's a different thing to, you know, see it in practice. So really appreciate you spending the time. - Yeah. Thank you so much, David. (bright upbeat music)",
    "transcript_keywords": [
        "yeah",
        "people",
        "David Bombal",
        "phishing",
        "email",
        "Gophish",
        "David",
        "social engineering",
        "David Bombal domain",
        "Gophish server",
        "social",
        "lot",
        "phishing emails",
        "Discord",
        "server",
        "make",
        "engineering",
        "website",
        "kind",
        "users"
    ],
    "transcript_entity_values": [
        "VPS",
        "YouTube",
        "Microsoft",
        "Linux",
        "SingleFile",
        "E.",
        "80",
        "3333",
        "LinkedIn",
        "MFA",
        "two",
        "one second",
        "second",
        "YouTube",
        "Google",
        "an additional 30 seconds",
        "Lightsail",
        "hundred",
        "Udemy",
        "3:00 AM",
        "Cori",
        "million",
        "Queen",
        "Bluehost",
        "1,000",
        "David Bombal",
        "the end of the day",
        "the last 10 years",
        "500,000",
        "annual",
        "Corgi",
        "0.0.0.0.3333",
        "like six months or so",
        "Today",
        "that morning",
        "today",
        "a few minutes",
        "a week or two weeks",
        "a David Bombal Wiki",
        "one",
        "40",
        "Cobalt Strike",
        "16 year old",
        "EC2",
        "CTO",
        "DNS",
        "IBM",
        "CCNI",
        "E. - Thanks",
        "SMTP",
        "first",
        "UK",
        "David-Bombal",
        "Rachel Tobac",
        "a few years ago",
        "443",
        "Rachel,",
        "Amazon",
        "40 to 60%",
        "Discord",
        "1,000,000",
        "this year",
        "David",
        "Gophish",
        "the first three months",
        "900-something thousand",
        "a big day",
        "LinkedInt",
        "CSV",
        "David] Teachable",
        "LinkedIn",
        "thousands and thousands",
        "CSO",
        "someone- like 40%",
        "10",
        "half a million",
        "david@david-bombal.com",
        "a minute",
        "half an hour",
        "hundreds",
        "the other day",
        "a big week",
        "YouTubers",
        "Chrome",
        "Telegram",
        "The Hacker Playbook",
        "One",
        "month",
        "James Bond",
        "CSS",
        "the David Bombal TikTok",
        "DEFCON",
        "60%",
        "Corg",
        "JavaScript",
        "3333",
        "seconds",
        "GitHub",
        "U.S.",
        "David Bombal's",
        "Twitter",
        "1 million",
        "Cobranded Company Swag"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "ORG",
        "ORG",
        "TIME",
        "GPE",
        "CARDINAL",
        "ORG",
        "TIME",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "TIME",
        "DATE",
        "TIME",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "GPE",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "TIME",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}