{
    "id": "U7nbGiIkU8k",
    "title": "A new year of gadgets",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-01-16T16:00:18Z",
    "video_url": "https://www.youtube.com/watch?v=U7nbGiIkU8k",
    "category": "Science & Technology",
    "tags": [
        "apple",
        "samsung",
        "lg",
        "CES 2021",
        "amd",
        "oled",
        "Razer project hazel",
        "razer mask",
        "the verge",
        "verge",
        "dieter bohn",
        "miniled",
        "rollable phone",
        "rolling phone",
        "transparent tv",
        "tcl",
        "new at ces",
        "galaxy s21",
        "galaxy s21 ultra",
        "ces",
        "ces trends",
        "nvidia",
        "m1",
        "intel",
        "ces 2021 sony",
        "ces 2021 tv",
        "ces 2021 preview",
        "ces tvs",
        "ces laptops",
        "gaming laptops",
        "samsung galaxy s21 ultra",
        "samsung galaxy s21",
        "4k",
        "tech",
        "lg tv",
        "ces2021",
        "technology",
        "samsung s21",
        "best of ces",
        "lg oled",
        "processor",
        "microled",
        "tech news",
        "gadgets"
    ],
    "views": 343445,
    "likes": 8828,
    "comments_count": 266,
    "description": "In 2021 there are a few big CES trends to keep an eye on. There are concept devices from Razer and LG; processor news from AMD, Intel, and Nvidia; some very great laptops (especially gaming laptops); and of course the state of the art for televisions move forward once again. In this recap, Dieter Bohn breaks it all down.   Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  More about our podcasts:   Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:   #TheVerge #CES2021",
    "description_links": [
        "http://bit.ly/3ihSvCp",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(gentle music) - CES 2021 is over. CES 2020 was also virtual. Now, a virtual thing is not technically real. So if it was never real in the first place, can it actually be over? Yes, CES 2021 is over. And because it was virtual, we were expecting it to be a pretty slow show but it turns out there were some really interesting trends and things that happened this year. Now, CES is not a show where you should expect there to be huge flagship announcements, of products that you can go out and buy right away. That's just not what the show is. It's a show about the parts of gadgets like the screens and the processors. It's a lot of promises basically. And that doesn't mean that it's vaporware, but it does mean that what you learn from CES is about the trends and things that are going to happen a little bit later, not things that you can go out and buy right now. But that said, I do think that some of those trends are really interesting. And so I wanna talk about a few of those promises. The first big trend of CES is the same trend as every CES, and that there are a lot of concept devices. These are things that might not necessarily get made but that doesn't mean that they're vaporware. It means that some companies have produced some things that are really interesting and that might turn into products or might tell you what a future product is going to look like. And the concept that ran away with the show was Razor's Project Hazel. It has an N95 rating or at least it's supposed to, if it ever gets certified. It uses little gaskets to breathe but there will be filters on them. It's clear so that people can see you speaking, which is really interesting. It has a silicon thing over your nose so hopefully it won't fog up glasses. It also has a microphone and a speaker that razor says it's working with THX to tune so that your voice doesn't sound muffled when you're wearing the mask. That it sounds natural. Of course it's rechargeable. Of course it comes in a case with a UV light to disinfect it or whatever. And of course, because it's Razor, it's gonna have RGB lights that you can set to do all sorts of fancy color things. This is a cool idea. I don't know if they're actually gonna make it. And it's part of another trend that I just wanna mention on the side, which is there were a lot of COVID gadgets this year and I was very, very nervous going into CES that what we were going to see is, we'll call it COVID profiteering, a bunch of gadgets that don't actually help anybody, that are very scientifically unsound, that are just taking advantage of people's fear of this pandemic. Luckily, it wasn't as bad as I thought. We have seen a few things like thermometers built into doorbells that I don't think are very useful because the science, external thermometers like that, isn't very good. We also saw a bunch of UV gadgets to disinfect stuff and that's fine, but overall, companies were relatively good about not taking advantage of people's fear of the pandemic. I don't think Razor did either but I will tell you that the problem that we have with the pandemic right now, isn't enough smart tech. The problem is that people aren't being smart themselves. They're not wearing masks, they're not social distancing, not as much as we need. So please do that. And Razor as cool as this Project Hazel thing is, I am more impressed with the fact that you switched one of your factories over to making masks for healthcare workers and that you gave away a million of them. Thank you for doing that. And if you decide you actually wanna produce this Project Hazel smart mask, yeah, I'll take some flaky lights on my face, why not? We saw a bunch of other regular kind of CES concepts. Of course we saw concept cars and we also saw a bunch of concept screens. Like for example, LG has a semi-transparent screen which is a very good idea. They're showing it off again that's even more transparent than before, but for some reason they think you're gonna wanna put it at the foot of your bed and have it rise up on a motor. Sure, why not? The main thing that we see with concept screens is that they bend and fold. And so TCL, which is trying really hard to prove that it's a big deal now, showed off a bunch of different bendy screens that showed up off thing that was like literally a scroll. Maybe someday, I don't know. The rolly screen that I'm most impressed with is LG's rollable phone. It's a phone where it sort of rolls out to become a tablet-size thing or rolls back into the regular form factor that you expect. It is just a concept but LG says they are going to sell one this year. LG also makes the Wing though so they're probably not gonna sell that many of them but just getting one out the door will be interesting. I want a phone that turns into a tablet and a foldable is one way to do it and a rollable is a really interesting, different way. (gentle music) The next big thing that happened at CES has to do with processors and laptops. So let's talk about processors and laptops. We had keynote presentations from Intel, AMD, and Nvidia. And you put all them together, what I think you're going to get are gaming laptops in 2021 that are very, very interesting and very good, I hope. So Intel, it has a bunch of new core chips and you probably know by now that Intel has had a rough go of it lately. They had to sell off their modem business to Apple. They're competing with Apple, with Apple's new M1 chip which is very good in terms of performance per watt and Intel is having a hard time getting down to the 10 and seven nanometer process for making its chips which we know are more power efficient or more powerful per watt. Anyway, Intel, they're doing their best with kind of what they got. They do have some interesting things coming but we will have to see if they are like significantly better or if we're still playing the waiting game with them. Then there's AMD, which has another generation of its Ryzen processors running on the seven nanometer process, which means that they can be very powerful without completely destroying your battery. I'm very interested to see what these are like and I'm also kind of hoping that they're actually easier to find 'cause they weren't in a ton of laptops last year but the ones that they were in were very, very good. Finally, there is Nvidia, which is bringing down some GPU's to gaming laptops that are actually more powerful than I would have guessed as early as they're coming. I want to figure out to take it a little bit longer for this much power to come to gaming laptops. And by this much power what I mean is, proper 1440P resolutions running at 90 frames per second. That seems like it's completely a doable thing on gaming laptops this year in form factors that aren't like three inches thick and weigh eight pounds. Now, after all these announcements were made, there were a ton of laptop announcements because all those parts were public and so all the companies are making laptop talks about all of those parts. We're interested in a bunch of them but the one that I'm most interested in is the successor to this guy right here, the Republic of Gamers, Zephyrus G14 or whatever. If there's a G15, that's gonna use this design and it's gonna have, I hope really, really good performance. And I think it's gonna be one of our favorite laptops of 2021 if it pans out because this guy right here was one of our favorite laptops of 2020. Now, if you're not interested in gaming laptops, what is all this chip and gaming laptop stuff actually mean to you? Well, watch Intel. See, on the one front they're fighting Apple, which has its ARM chips on its laptops, Qualcomm is trying to make a thing with ARM and Windows, we'll see how that goes, and AMD is hard-charging on the x86 side, Intel sort of stuck in the middle, trying to make it work. And they have a new chip that's called Alder Lake that sort of takes some of the ideas from ARM in terms of a big powerful processor and a little high efficient cores to improve battery life and just sort of improve overall performance on a laptop. And that is gonna be their big chance to try and take on the M1 chip with head-to-head performance. We shall see, but that is the best bet that they've got for 2021 and I'll be very, very interested to see what ultra-light laptops with that chip look like. And if they can be competitive with what's coming from Apple. (gentle music) If you know anything about CES, you know that what it really is deep down in its heart and its soul, what it truly wants to be is a TV show. And so of course, we got a bunch of TV announcements. We got TV announcements before CES even technically began because it was trying to get out ahead of it. And this year, the thing for you to remember if you're not buying a high-end TV, if you're just buying a TV is make sure you get one with HTMI 2.1. It's pretty much everywhere but it's pretty much the best way for you to be sure that you're gonna be at least a little bit future-proof. Now, you're gonna have to check a whole bunch of specs to make sure it can support all of the stuff that you might want from a PS5 or an Xbox Series X if you're getting one of those or if you're lucky to have already bought one, but at the very least, HDMI 2.1 is a start. Now, in terms of high-end TV technology, the big story here is mini-LED versus OLED. You might know that OLED TVs are really good because they can have truly black blacks and then bright whites. You get a high contrast ratio. They look amazing and LG is the king of making OLED TVs. But there's a competing technology. It is mini-LED and what it tries to do is have the light that shines behind the pixels be ever, ever smaller so there's more dimming zones so that it can get true black as well. The advantage to mini-LED is that it's not organic which means that it should last longer and there's fewer banning concerns. The disadvantage is they have to do a lot of work to get those mini-LEDs more and more mini so that they can get closer to the true black that you can get from OLED. Samsung thinks it's really getting there, it's pushing it hard. And another company, TCL, is also pushing mini-LED. Now, you might think of TCL just as a sort of a value brand. They make very good TVs for the money and they run Roku software. We've loved TCL TVs for a long time. They really wanna be LG. They wanna show that they are a big high technology company and you should pay attention to their innovation and so they are pushing mini-LED as well. But LG is not just sitting still, their OLED TVS they claim are brighter and that's one of the few knocks on OLED TVs besides, you know, apparently expensive, is that they don't necessarily get bright enough if you've got a really sunny living room. And so LG is promising that it's TVs can be brighter than ever. Will any of this matter to you if you're trying to buy a TV in 2021? Maybe if you're gonna spend lots of money on a TV but what really does matter with all of this high technology mini-LED versus OLED stuff is, if you're gonna buy a TV down the road, all this stuff is gonna eventually trickle down to TVs that cost more a reasonable amount of money. Oh, one more thing that's interesting with TVs is smart TV software. Sony is switching over from Android TV to Google TV which is the Googlefied version of Android TV. I think that's good. I think Google TV is actually pretty solid. LG has taken WebOS and made it act less like the old WebOS worked and more just like a standard, boring, smart TV interface. I mean, just look how they massacred my boy. Now like I said, this is all trend stuff. You're not gonna be able to go out and buy pretty much any of this stuff today. You will get some of it later this year but this is telling you where technology is going not what you can go out and buy today. And so it's stuff to watch out for. If you are looking for something that you can just go out and buy today, well, guess what? Samsung just announced the Galaxy S21 series, and we've got a hands-on. I'm gonna be reviewing it very soon. You can check that out because it is the flagship Android phone for the year for Samsung as well as the CES stuff and all the promises that all these tech companies are making. Well, you know what? Actually some of it does seem pretty promising. Thanks so much for watching. Let me know what you thought the best stuff CES was down in the comments below. There was a ton of things that I couldn't get to. There were new WIFI 6E routers, there were some other concept cars and there was this ice cream maker that sort of works like a courier machine, where you'd like drop a can and it just gives you a soft serve. People are really excited about it because I guess people wanna pay too much for ice cream. I love ice cream, I don't need to spend that much money on it.",
    "transcript_keywords": [
        "CES",
        "thing",
        "laptops",
        "things",
        "OLED TVs",
        "Intel",
        "OLED",
        "good",
        "stuff",
        "bunch",
        "gaming laptops",
        "interesting",
        "TVs",
        "show",
        "Project Hazel",
        "year",
        "concept",
        "Razor",
        "Project Hazel thing",
        "Apple"
    ],
    "transcript_entity_values": [
        "WebOS",
        "M1",
        "last year",
        "CES",
        "Project Hazel",
        "90",
        "2.1",
        "PS5",
        "one",
        "Razor",
        "AMD",
        "Apple",
        "three inches",
        "Alder Lake",
        "Android",
        "G15",
        "GPU",
        "Windows",
        "the Galaxy S21",
        "Googlefied",
        "LG",
        "AMD",
        "today",
        "the Republic of Gamers",
        "Google TV",
        "Zephyrus G14",
        "2020",
        "eight pounds",
        "RGB",
        "Qualcomm",
        "seven nanometer",
        "Android TV",
        "Samsung",
        "6E",
        "Roku",
        "N95",
        "TCL",
        "this year",
        "Wing",
        "a million",
        "a ton",
        "second",
        "Ryzen",
        "Sony",
        "later this year",
        "Hazel",
        "first",
        "Nvidia",
        "Intel",
        "TVS",
        "1440P",
        "the year",
        "2021",
        "10 and seven nanometer"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "GPE",
        "ORG",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "NORP",
        "ORG",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL"
    ]
}