{
    "id": "U82aw8WEYAM",
    "title": "Google I/O 2022 keynote in 18 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-05-11T19:50:29Z",
    "video_url": "https://www.youtube.com/watch?v=U82aw8WEYAM",
    "category": "Science & Technology",
    "tags": [
        "google io 2022",
        "google",
        "google io",
        "pixel 7",
        "pixel 7 pro",
        "android",
        "android 13",
        "android updates",
        "pixel watch",
        "pixel 6a",
        "pixel buds pro",
        "android tablet",
        "google tablet",
        "google maps",
        "google io announcements",
        "google io highlights",
        "google assistant updates",
        "google wallet",
        "google i/o supercut",
        "verge",
        "the verge",
        "tech",
        "google i/o",
        "google developer conference",
        "google AR glasses",
        "google glass",
        "smart glasses"
    ],
    "views": 949809,
    "likes": 19494,
    "comments_count": 1144,
    "description": "At Google I/O 2022, the company announced the Pixel 7 and 7 Pro, along with a new Pixel 6A, the long-awaited Pixel Watch, and new Pixel Buds Pro. In addition, Google also demoed new features in Android 13, \"Immersive View\" in Google Maps, and showed new AR glasses that translate language in real-time.  Read more:    0:00 Google Pixel Watch 1:16 FitBit & Pixel Watch 1:43 Pixel 6A 2:43 Pixel 6A Camera 3:20 Titan M2 security 3:38 Pixel 7 & Pixel 7 Pro 4:45 Google Pixel Buds Pro 6:16 Pixel Tablet 6:55 Google Search (Scene exploration) 7:51 Google Assistant (Look and talk, Quick phrases) 9:18 My Ad Center 10:00 Privacy (Removal requests) 10:25 Android 13 10:58 Google Wallet 11:45 Android on tablets 13:09 Phone hub & Fast Pair 14:11 Matter (smarthome) 14:40 AR glasses 17:25 Closing remarks  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/3N6DUaX",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- We will start with a quick preview of the new Google Pixel Watch. (crowd cheering) And, it's coming this fall with our new Pixel 7. Pixel Watch has a bold circular dome design, a tactile crown, and beautiful recycled stainless steel, with customizable bands that seamlessly attach. And, Pixel Watch delivers an outstanding wear OS experience on your wrist. It features an improved wear OS UI with more fluid navigations and smart notifications. You can ask the assistant for help getting things done. And, for those little bits of information you need throughout the day. And, with Google maps, you can get directions on the go even without your phone. With the new Google wallet, you can leave your physical wallet at home too. And, with the new Google Home app for wear OS, you can turn off the lights, adjust the thermostat, or get an alert when there's a person or a package at your front door. Now, my favorite thing about the watch is the deep integration with Fitbit. It's coming first to the Google Pixel Watch for industry leading health and fitness experiences. You can get insights into your health with continuous heart rate and sleep tracking. You can see your active zone minutes when you're working out and track your stats and progress against your personal fitness goals. It'll be available this fall and we'll share many more details in the coming months. Today, I'm excited for Sonya to show you the new Pixel 6A. - Pixel 6A delivers the helpful personal Pixel experience for the unbeatable price of 449. Pixel 6A shares the same iconic design language introduced on Pixel 6, with a unique two-tone look, and slim bezel surrounding our perfectly pocketable 6.1 inch display. And, you'll notice the Pixel camera bar, which houses our dual rear camera system, with a 12 megapixel main and ultra wide lens. And, all of that is encased in our recycled aluminum frame. It means that Pixel 6A includes the same fast 5g connectivity as Pixel 6 and 6 Pro. It uses the exact same security architecture with Titan M2 for industry leading protection that makes the phone more resilient to attacks. And, most importantly, Pixel 6A uses the same premium Google Tensor SSC as our Pixel 6 Pro. The camera system has real tone built in, so your photos are beautifully and accurately reflect your own skin tone. It also has night sight, so you can take incredible low light photos. And, yes, Pixel 6A includes magic eraser in Google photos to remove those distractions from your otherwise perfect pictures. So, you can also change the color of distracting objects in your photo. In a tap, the objects' colors and shading blend in naturally. And, thanks to Tensor, we're able to bring live translate to Pixel 6A. Along with the Titan M2 security chip, there's an under display fingerprint sensor for secure unlock, and you'll get five years of security updates. So, you'll always have the latest protection. We're super excited to make Pixel 6A available for just 449. - Here's a first look at the Pixel 7 and Pixel 7 Pro. (crowd clapping) You can see that we've extended the aluminum finish to the entire camera bar for the next evolution of the Pixel design language. The housing and camera bar are made from a single piece of 100% recycled aluminum. And, the gorgeous Pixel 7 Pro, in its triple camera system, sets a completely new standard for photography, performance, and design. I really love the contrast of the different materials in the simplicity of the design. The polished aluminum looks beautiful with the glass on the back of the phone. On the inside, Pixel 7 and 7 Pro are designed to deliver the most helpful, most personal experience you can get in a smartphone. They'll use the next generation of our Google Tensor SOC, bringing even more AI heavy breakthroughs and helpful personalized experiences across speech, photography, video, and security. And, of course, both phones will ship with Android 13 and all the goodness that comes with our latest mobile OS. And, this summer, we're excited to expand the Pixel Buds family with a Pro tier offering. It's a powerful new set of earbuds called Pixel Buds Pro and they're the first Pixel Buds with active noise cancellation, because they're designed around a new custom audio processor. It's a six core audio chip running Google developed algorithms, tuned by our in-house audio engineering team. Sometimes, though, you do wanna hear what's going on around you. For these occasions, there's transparency mode. It lets outside sound in, so you experience the world like you're not wearing earbuds at all. Our beam forming microphones use noise suppression algorithms that have been trained with machine learning. Wind, traffic, or other background noise will be suppressed. And, your voice will be clear no matter where you are. Pixel Buds Pro gives you up to 11 hours listening time or seven hours with active noise cancellation turned on, so you can tune out the noise on that long flight. The Pro series are built to deliver a helpful hands free experience, so you can ask the assistant for all sorts of things like walking directions. Pixel Buds Pro will support multipoint connectivity. So, your earbuds know to automatically switch from a podcast on your phone, to a video call on your laptop. And, later this year, we'll update Pixel Buds Pro to support spatial audio. So, when you watch a movie or TV show on compatible Pixel phones, you'll be right in the middle of the action. The new Pixel Buds Pro come in four colors, they'll be available online for pre-order on July 21st, and on sale, the 28th, delivering the smarts of Google and top tier active noise cancellation for 199. So, I want to give you a sneak peek at something we're working on for 2023. So, here's a first ever look at our new Pixel tablet. (crowd cheering) It's a next generation Android tablet powered by Google Tensor, designed to be a perfect companion for your Pixel phone. The tablet bridges your on the go life with your at home life, working seamlessly with all of your Pixel devices to provide the most helpful experience possible. We're designing it to be the most helpful tablet in the world, and we're aiming to make it available next year. - We're redefining Google search yet again, with an advancement we are calling scene exploration. You'll be able to use multi search to pan your camera and ask a question and instantly glean insights about multiple objects in a wider scene. Let me give you an example. If you went to the store today to find the best nut free dark chocolate, you'd be standing in the aisle for a while, but thanks to scene exploration, you'll be able to scan the entire shelf with your camera, and see helpful insights overlaid in front of you. (crowd cheering) Scene exploration uses computer vision to instantly connect the multiple frames that make up the scene and identify all the objects within it. Simultaneously, it taps into the richness of the web, and Google's knowledge graph to surface the most helpful results, in this case which bars are nut free, dark chocolate, and highly rated. - It's amazing how quickly voice is becoming such a common way to access computing. We're introducing two new options so you don't have to say, hey, Google, every time. First is a new feature for the Nest Hub Max called look and talk, which is beginning to roll out today. You can simply look directly at your device and ask for what you need. Once you opt in, look and talk is designed to activate when both face match and voice match recognize it's you. And, video from these interactions is processed entirely on device. We're also excited to expand quick phrases on Nest Hub Max. And, in the next few months, you'll be able to ask your assistant for many common requests like setting alarms, asking for the time, and controlling lights from your Nest Hub Max, all without saying the hot word. Designed with privacy in mind, you choose which quick phrases are enabled for your Nest Hub Max. We're also improving how the assistant understands you, by being more responsive as you just speak naturally. I might tap and hold on my Pixel Buds and say, play the new song from... Florence and the something? - Got it. Playing free from Florence and the Machine on Spotify. - We believe that the best ads are helpful, relevant, and safe. So, later, this year, we'll launch my ad center to give you even more control over the ads you see across YouTube, search, and discover. You can directly control the data used to personalize your ads. You can choose to see more ads from the categories or brands you like. You can also opt to see fewer ads from categories or brands you're not interested in. You'll be able to access my ad center through your Google account or directly from the app. We also know people wanna have more control over their online presence to feel safer. Soon, if you find search results that contain your contact details, such as your phone number, home address, or email address that you want taken down, you can easily request their removal from Google search. This feature will be available in the coming months in the Google app, and you will also be able to access it by clicking the three dots next to individual Google search results. - Android 13 builds on our material you design language. All your app icons can now incorporate your color theme. And, there's a new media control that tailors its look to the music you're listening to. And, of course Android 13 comes jam packed with dozens of new security and privacy features. That's why we've worked with carriers and device makers all over the world to upgrade SMS text messaging to a new standard called RCS. We're excited to introduce the new Google wallet. (crowd cheering) Your Google wallet securely stores your payment cards so you can tap to pay anywhere Google pay is accepted, but wallet is for so much more than payments. So, we're working with states here in the US and governments around the world to bring digital IDs to wallet later this year. Google wallet will be rolling out to Android and wear OS devices around the world in the coming weeks. Later this year, we'll start bringing emergency SOS to wear, so you can instantly contact a trusted friend, or family member, or call emergency services, right from your watch. We're also expanding Android's earthquake alerting system to many of the remaining high risk regions in the world. - So, this year we've been working hard to make Android tablets amazing. From the moment you power on the device, you can see the Android experience has been refined for the larger screen. One thing I absolutely love are the changes to the notification shade. It's been expanded to let you see more at a glance and have control right at your fingertips. There's also a new app task bar that runs along the bottom. You can see, if I go ahead and fire up Google photos, the task bar is still there, and it gives me easy access to all my apps when I need them. This bigger screen also makes multitasking super easy. Say I want to share a picture from my latest vacation with a friend, I can pick up the conversation... Choose a photo, even edit it. It was pretty warm that day, as I remember it, and then drag it straight in. If you swipe up to overview, you can see I'm already busy planning my next vacation. So, starting today, we'll be updating more than 20 Google apps to look amazing on large screens, and take full advantage of the extra functionality. - So, let me show you how Android brings your devices together to be more helpful. Casting makes that really easy. So, it should be everywhere, which is why we're working to extend casting capabilities to new partners and products. And, I want my messages to move across my devices too. This fall, we're extending phone hub, so you can directly access all your phone's messaging apps on your Chromebook. Phone hub gives you the exact app you're familiar with because of streaming from your phone. No need to install a desktop client or keep on running in a tab that gets lost on your browser. And, here's one of my favorite new features. Copy something on your phone and paste it on your tablet. We're continuing to expand fast pair, so your phone, your laptop, and your TV, all pair easily and instantaneously with your headphones and smart devices. That's where Matter comes in. It's an open industry standard launching this fall. Matter connects our Google Nest hardware along with top brands and hundreds of supported products, like light bulbs, door locks, smart plugs, and a lot more. It's a big list. You'll be able to quickly connect all those Matter enabled devices in seconds to your home network, Google Home, and your favorite apps using fast pair. - It's important we design in a way that is built for the real world and doesn't take you away from it. And, AR gives us new ways to accomplish this. Let's take language as an example. Language is just so fundamental to connecting with one another, yet understanding someone who speaks a different language, or trying to follow a conversation if you're deaf or hard of hearing can be a real challenge. Let's see what happens when we take our advancements in translation and transcription and deliver them in your line of sight in one of the early prototypes we've been testing. Take a look. - My mother speaks Mandarin and I speak English, which is a strange thing. (women speaking in Mandarin) - [Google Employee] We'd love to be able to share with you a new prototype we've been working on. You should be seeing what I'm saying just transcribed for you in real time, kind of like subtitles for the world. - What we're working on is technology that enables us to break down language barriers, taking years of research and Google translate, and bringing that to glasses. - Do you see me? (man speaking in Spanish) I'm actually looking straight into your eyes and it seems like you're looking right at me. (man speaking in Spanish) - Making access to information just instant and intuitive. By doing that, technology fades into the background. And, we're more connected with the people and the things around us. Giving people the gift of communicating with anyone, no matter what language they speak, I think is a really powerful thing. (man speaking in Spanish) (woman speaking in Mandarin) (crowd cheering) - You can see it in their faces, the joy that comes with speaking naturally to someone. Each year we get a little closer to delivering on our timeless mission, and we still have so much further to go. At Google, we genuinely feel a sense of excitement about that. And, we are optimistic that the breakthroughs you just saw will help us get there. Thank you to all of the developers, partners, and customers who join us today. We look forward to building the future with all of you. Thank you so much. (crowd cheering)",
    "transcript_keywords": [
        "Pixel Buds Pro",
        "Google Pixel Watch",
        "Pixel",
        "Pixel Buds",
        "Google",
        "Pixel Watch",
        "Google Pixel",
        "Buds Pro",
        "Nest Hub Max",
        "Pro",
        "Google Tensor",
        "Google wallet",
        "Pixel Watch delivers",
        "called Pixel Buds",
        "Google search",
        "update Pixel Buds",
        "Pixel Buds family",
        "phone",
        "Android",
        "Buds"
    ],
    "transcript_entity_values": [
        "Android",
        "seconds",
        "that day",
        "Sonya",
        "more than 20",
        "three",
        "the day",
        "Pixel 7 and",
        "SOS",
        "5",
        "Google Pixel Watch",
        "the coming months",
        "UI",
        "English",
        "One",
        "6",
        "12 megapixel",
        "Tensor",
        "YouTube",
        "Pixel 6",
        "Pixel 6A",
        "Pixel Buds Pro",
        "Spanish",
        "up to 11 hours",
        "hundreds",
        "Later this year",
        "seven hours",
        "Chromebook",
        "Pixel 7",
        "the coming weeks",
        "Google",
        "Nest Hub Max",
        "July 21st",
        "dozens",
        "RCS",
        "Titan M2 security",
        "Mandarin",
        "Google Tensor SSC",
        "Pixel 7 Pro",
        "Pixel Buds",
        "this year",
        "first",
        "the Google Pixel Watch",
        "199",
        "next year",
        "Google Home",
        "Today",
        "AI",
        "US",
        "6A",
        "100%",
        "13",
        "Android 13",
        "Pixel Watch",
        "the Nest Hub Max",
        "Fitbit",
        "later this year",
        "this summer",
        "449",
        "6.1 inch",
        "Google Nest",
        "First",
        "This fall",
        "one",
        "five years",
        "four",
        "Google Tensor SOC",
        "Florence",
        "today",
        "Google Tensor",
        "Spotify",
        "six",
        "the next few months",
        "SMS",
        "years",
        "2023",
        "two",
        "the Pixel 7 and Pixel 7 Pro",
        "minutes",
        "this fall",
        "the 28th",
        "Machine"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "LANGUAGE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "EVENT",
        "PRODUCT",
        "PRODUCT",
        "LANGUAGE",
        "TIME",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "FAC",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "LANGUAGE",
        "ORG",
        "EVENT",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "FAC",
        "PRODUCT",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "FAC",
        "TIME",
        "DATE",
        "DATE",
        "ORG"
    ]
}