{
    "id": "U9JIanRXsfU",
    "title": "CRYPTOMINING",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2017-07-02T13:47:15Z",
    "video_url": "https://www.youtube.com/watch?v=U9JIanRXsfU",
    "category": "Science & Technology",
    "tags": [
        "bitcoin",
        "ethereum",
        "bitcoin wallet",
        "cryptocurrency",
        "bitcoin explained",
        "crypto",
        "cryptomining",
        "blockchain",
        "bitcoin mining",
        "what is bitcoin",
        "btc",
        "how does bitcoin work",
        "austin evans"
    ],
    "views": 1215898,
    "likes": 35348,
    "comments_count": 4222,
    "description": "Explaining cryptocurrency mining like Bitcoin and Ethereum! What is ransomware?   Coinbase Bitcoin Wallet:  NiceHash cryptocurrency mining program:  Cryptocurrency mining calculator:   Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "https://www.youtube.com/watch?v=UJlhVUE6Zh8",
        "https://www.coinbase.com",
        "https://www.nicehash.com/?p=gstarted#seller",
        "https://www.nicehash.com/?p=calc",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. This computer is making me money right now. While that might sound like some scummy pop-up ad, in reality, it's all thanks to Cryptomining. You've probably heard of cryptocurrency, such as Bitcoin and Litecoin. These are digital currencies that are worth real world money. For example, a single bitcoin goes for about $2400 right now. This has become a really big industry. Not only has Bitcoin been recognized as legal currency in places like Japan, but you can spend Bitcoin at a lot of online retailers, such as Microsoft, buying games on Steam. You could even purchase things with PayPal using Bitcoin. It is a big deal. For example, if you fire up a mining program on your computer, it'll immediately start crunching the numbers on different transactions that come it's way. As a reward for doing all that hard work, you'll gain tiny, tiny amounts of cryptocurrency. Typically, this doesn't really equal much. However, as things like Bitcoin become more and more valuable, it can actually add up. There are two different ways of getting your hands on cryptocurrencies such as Bitcoin. The first is really straightforward. You can buy and sell them just like anything else. So, the market will go up and down and it does that a lot, but the theory is, you buy 'em for cheap, sell 'em for more and you make a profit just like the stock market. The other is by mining. So, every transaction is public. So what that means is that some computer has to do the work of deciding that hey, someone has money, it needs to go to the other person. Make sure that's a legit transaction. In the early days, you could use an ordinary gaming PC to mine Bitcoin, but as it's gotten more popular and more importantly, there's more and more competition for mining, it is pretty crazy to use a standard gaming PC to mine Bitcoin today. There has been other cryptocurrencies that have sprung up over the years. So, back in 2013, I had a few different Litecoin mining rigs set up and generally speaking, if you have a PC with a solid GPU, you can make that work. However, the issue is, as things get more and more popular, people design what are called ASICs, which are literally custom-designed chips that are purely made to destroy a PC at mining. Today though, cryptomining has seen a major resurgence and a lot of that is thanks to a new option called Ethereum. Now, this is something that actually does make sense to mine on a standard gaming PC. So, we've been using this CyberPower PC that we did a video on recently which actually is now down to $650, which is kind of funny because thanks to cryptomining, even the graphics card itself sometimes will go for $650. Generally speaking, higher end AMD cards like the RX 580 that's inside is going to be your best bet for cryptomining. NVIDIA options also do work pretty well too. If you have a lower end card that's maybe a little bit older that's gonna draw a lot of power, you wanna try mining on the CPU, it's generally not going to be worth it. Cryptomining really is all about the GPU. The actual setup for mining is surprisingly straightforward, a lot better than it used to be. So you just need three things, a PC to do your mining, a Bitcoin wallet and a mining program. There are lots of options for creating a wallet, but I use Coinbase. Not only is it fairly simple as they do pretty much all the work for you, but not only can you buy Bitcoin, but more importantly, you can sell them or just spend them. For the mining program, a really easy option is to use Nicehash. So, this runs as a normal Windows app and all you need to do is let it do it's initial setup, give it your Bitcoin wallet address and it handles everything else from there. Nicehash does take three percent of everything that you mine but in return, it's a completely automatic setup, so if you're not super familiar with this stuff, it works pretty well and it's even smart enough to automatically pick between different algorithms based on what's going to be most profitable. The cool thing is, since this is just a normal Windows program, you can mine whenever you want. So, say you wanna actually play some games on your game PC, just stop mining for a few minutes. Once you're done, turn it back on. So I'm about to throw some numbers at you guys, but please take all these with a giant grain of salt. This can go way up and way down pretty much at any point. So right now, with this setup over the last few days, it's averaged making about $2.10 a day. So, of course, you do have to keep the electricity bill in mind. So with this system and the electricity rates here, it's pulling about 25 cents worth of power a day. That might not sound like much, but when you add it up, that's about $57 a month or about $690 a year, which is actually enough to pay for the entire system. But, and there's a giant but, this changes all the time, seriously. So, just today, as we've been filming this video, prices have changed a lot. So, earlier this morning, we were making about $1.90 a day. However, right now, we're doing about $2.31 in mining. It really does change on an almost hourly basis. All of this is just an example with this single graphics card inside this system. So if you have a really beefy system with say, a pair of 1080 Ti's, you can be making a lot more money. On the other hand, if you have an older graphics card, it might not even make sense to mine in the first place. So, there is a cool calculator. I have that linked into the description where you can plug in what your hardware is. It'll tell you roughly about how much you would make per day. What doesn't really make sense is going out and buying a bunch of hardware just to start mining. So, this has actually made graphic cards not only out of stock in a lot of places, almost more important than that, really, really expensive. One things that makes a little bit more sense is if you already have a gaming PC and you just wanna give this a try. It is kinda fun. The thing you need to keep in mind though is that this is going to be essentially running your GPU at 100% 24/7. It's not necessarily going to immediately break or anything, but it will definitely shorten the lifespan of your card. This definitely isn't for everyone, but as a nerd, there's actually something kind of fun about this. So, what do you guys think about mining cryptocurrencies? Let me know in the comments below and I will catch you in the next one.",
    "transcript_keywords": [
        "Bitcoin",
        "mining",
        "lot",
        "mine Bitcoin",
        "make",
        "Austin",
        "Bitcoin wallet",
        "mine",
        "Cryptomining",
        "mining program",
        "work",
        "things",
        "card",
        "mine Bitcoin today",
        "pretty",
        "day",
        "make sense",
        "GPU",
        "money",
        "buy Bitcoin"
    ],
    "transcript_entity_values": [
        "about $2400",
        "about $1.90",
        "AMD",
        "three",
        "Windows",
        "650",
        "first",
        "about $2.31",
        "Bitcoin",
        "the last few days",
        "about $57",
        "Austin",
        "earlier this morning",
        "two",
        "Coinbase",
        "100%",
        "about $690",
        "the years",
        "Japan",
        "Today",
        "about $2.10",
        "580",
        "Nicehash",
        "hourly",
        "Ethereum",
        "a few minutes",
        "1080 Ti's",
        "Microsoft",
        "CyberPower",
        "2013",
        "CPU",
        "One",
        "about 25 cents",
        "NVIDIA",
        "Cryptomining",
        "today",
        "ASICs",
        "the early days",
        "PayPal",
        "GPU",
        "Litecoin",
        "three percent"
    ],
    "transcript_entity_types": [
        "MONEY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORDINAL",
        "MONEY",
        "NORP",
        "DATE",
        "MONEY",
        "PERSON",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "MONEY",
        "DATE",
        "GPE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "LOC",
        "PERCENT"
    ]
}