{
    "id": "U_EEF29Ui_Y",
    "title": "Unboxing Razer's FIRST Gaming Chair! - Iskur",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-10-27T18:59:17Z",
    "video_url": "https://www.youtube.com/watch?v=U_EEF29Ui_Y",
    "category": "Science & Technology",
    "tags": [
        "Razer",
        "Gaming",
        "PC",
        "Chair",
        "Egronomics",
        "Comfort",
        "Lumbar",
        "Support",
        "Weight",
        "Fake Leather",
        "Comfortable",
        "Casters",
        "Back",
        "Spine",
        "Adjustable",
        "Large",
        "Colton",
        "Unboxing"
    ],
    "views": 1172372,
    "likes": 35550,
    "comments_count": 2505,
    "description": "Check out the DROP ENTR Mechanical Keyboard at   Razer releases their first gaming chair, the Iskur. It's priced what you would expect. The big change is that they didn't merely slap their logo on anything and called it a day. They took some time to make something really unique and built tough.   Check out the Razer Iskur Gaming Chair at   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://dro.ps/shortcirc-entr-nov",
        "https://lmg.gg/Szcxe",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Stop. (man laughing) No, you don't sit like that. (buoyant music) - Hello. Today, we're going to be looking at the Razer Iskur gaming chair. Beautiful, and look, I've got my Razer mask that I'm actually going to take off. We're going to unbox this thing and we're going to take a look at, we're going to try it out. We're going to sit on it, we're going to play some games. It'S going to be fantastic. How do I start? I got a knife. - You are not supposed to have a knife. - A spoon? Can I No, I won't be able to unbox with a spoon. It's fine. Just always cut away from yourself. Be safe about it, okay. So, for those that don't know, this is actually Razer's first gaming chair. One of the features that makes it different than some other gaming chairs on the market is that it has this unique way of handling the lumbar support, which we will take a look at it in a minute here. (man laughing) Look at these. (man laughing) No having Okay you can't have any you can't double up. You can't have a person on your lap. You can't surf with it. No surfing. That wouldn't even work. (man laughing) Some light reading from Razer here. It's time to take your throne. What you're about to experience is posture perfect hardcore gaming, to keep you performing at your best. All Razer gaming chairs offer the optimal balance of support and comfort. Min-Liang Tan, co-founder, CEO and creative director. I can hear Min saying that out loud right now. All right. First piece of foam off. Dude, I struggle with this. It's like the gaming sofa all over again. So, it's kind of just in here. I'm sure there's directions somewhere. We'll find them. Okay. Back rest, should I just build it right here? Some more protective foam. For those of you that watched my Herman Miller Logitech Embody Gaming Chair unboxing, I'm going to read the instructions this time. Don't worry. We're going to be okay. We'll get through this together, okay? (man laughing) Totally. (paper rustling) Head pillow. Ooh, this is a nice feeling pillow. Feel the edge of it. It's pretty nice. - [David] Oh yeah it's like memory foam. - That's decent, yeah. I find with a lot of like these head cushions, the memory foam is there, but the exterior like material is usually pretty rough. This is very soft. Okay. Accessories for Razer Iskur. Just in case you didn't know what the accessories were for, they're letting you know. Oh, yeah. These are seats, and I believe that's pretty much it. Designed and engineered by Razer in California. Cool, so the first thing that they have is a little leaflet about their ergonomic lumbar support system, which is really cool. So we'll instead of me boring you with the details, we'll just show you it, when we get to it. So this just shows you how to use the chair, which is fantastic. It comes with a three-year warranty, which I've got all of the info here. Hardware, which I don't want to lose, cause I always lose it. And what is this? Is this instructions? Oh, Razer stickers. Sick. - [David] Lttstore.com - lttstore.com Fantastic. Okay, five castors. Castors are like a hard plastic. They feel good though, which is good. My big thing with a lot of chairs is the castors. And if they're rough, if your chair is hard to move, I don't know, I just find that annoying. No rhyme or reason to this, you should always keep your parts together. Don't throw them all in different places like I'm doing. Front, they tell you where the front is, cool. Problem number one, I actually don't see instructions. Like I have usage instructions, I don't have assembly instructions. Am I wrong on that? (clock ticking) So we're watching the Razer Iskur assembly guide. Perfect, yeah we've got all of those. - [Jono] What's that? - Dude, they are flying through this. That's okay. You can always pause it. Okay, hardware is right there. Hold on, let me get this up. (paper rustling) You know, if you've got a buddy to help you build the chair, just do it, just do it. - I'm a buddy? - Two people are better than one. I'm a buddy? (man laughing) I ain't your buddy, buddy. You know what's your, your synthetic leather. You've got a little bit of your carbon right there. Looks sick, look at that. Cable clip, cable clip. Front. Front, yep. Yep. This is the right way. Do we literally just drop it on? That's fine? - [Jono] Yep. (man howls) She's up. (leather chair tapping) The Razer Iskur Gaming Chair. The only thing I really don't like, and I know it's their motto, I just don't like that this is stitched on the front. It's just, you know, \"for gamers by gamers\", I get it. And now, it's time to do what everybody's been waiting for. It's time to sit, right after a word from our sponsor, Drop. - [Host] The Drop ENTR keyboard. A new keyboard from drop.com, made with enthusiast-grade materials, featuring an aluminum top plate and a plastic bottom plate with white LEDs for visibility and dark conditions. And it's available in three colors, with your choice of mechanical switches, Buy it today at drop.com, or the link in the video description. Time for the sit. Big sit. Oh, that's nice. Immediately, my lower back is supported. Perfect. So I believe this chair is engineered to support up to 300 pounds, up to six feet, two inches in height. I am definitely not that tall. I'm five foot six and I weigh about 150 pounds. So yeah, pretty good. It's got lots of room on either side of me. Yeah. I guess that kind of leads us into the lumbar support system that they have, which is kind of like the defining feature of this chair in my opinion. (lever clicks) (man howling) You can control the lumbar support with the lever on the front right of the chair and it, man, it, it goes. It... (man howls) - [Jono] Wow. - That's insane. So it'll go off for obviously though, way you do it is, pull the lever, sit back to a position where your spine is sitting in a neutral position, which would not be like this, but something like that, because naturally when I'm playing video games, I lean forward a little bit. And even if I'm gaming like this, I'm in a neutral position. So, and my back is still, my lower back is still supported, which is pretty cool. So, that's pretty dope. I find with a lot of gaming chairs, they'll give you the body pillows. I went around the office before we filmed this video and most of the office has gaming or racing chairs. Not one person was using this on their chair. These things are just tough because they don't actually, there's no customizability. So, you can't actually change anything. You either have it or you don't really, right? The Herman Miller Embody Gaming Chair does a better job of that, but this is really, really cool. And it's a fraction of the price, right? I think this chair retails for 500 USD. I think they're out of stock right now though, so that's the thing. (man howling) So and then the lever on the left side that is to lock in your position. So if you want to just lay, you know lay back. You know, you just you just hanging out. You're taking an extra, actually this is a pretty comfortable. Back-right is for the lift. So this is as tall as the chair goes, which is way too tall for how short I am. We've got 4D armrest adjustability. Actually, this is kind of neat. So one thing that's cool about the armrest is the button is actually in the armrest. It doesn't like jet out. It's not like an annoying thing that like hangs out over and you like hit it with your arm or your elbow or whatever like that. So it's actually in there and it's cool. So you can adjust it. Bam forward, backward. This one can go up, down. Then go side to side, sorry. (lever clicking) And up down as well. Oh, that's actually pretty sick. Oh, and a Castor test. We gotta do a Castor test homies. Oh, that's smooth. Hold on. That's nice. That's actually really nice. Ooh. So then that kind of just leaves us with the look of the chair. You're either into the green or you're kind of not. One really cool thing is that Razer did build this from the ground up. They didn't just like slap their logo on, on the thing and call it a day. They did a ton of different tests to the chair. Impact resistance. They did 24 hours in salt fog for like corrosion testing. So, if you're in a salty environment, this might be the chair for you. You know, it, it stands up. So yeah, I think the last thing we should do is game and get a few other people to come and game. You know? I really liked their lumbar sport system. I think every chair should have something like this. Ooh. Yeah what are this easy bots. Yeah bud. Knives only boy. And my back feels great. My back feels supported. The base is definitely wide enough for me. Yeah, I've got room to kind of move. I could probably like lounge a little bit side to side. I like that in a chair, you know, be able to, but when I'm gaming, forward. - [Jono] What happens when you rage or get mad? - I don't get mad playing video games. Welcome. Welcome, Ed. Take a seat. Take a seat, dude. - This' just a regular chair. That's what you think. I hate this chairs though. - Why do you hate this chairs? - They are not that comfortable. I don't need these to hug me in, right? When I'm playing a game, I don't, I don't really fear falling out of my chair. (man laughing) - Fair enough. (man laughing) CS GO. It's your favorite game, dude. Sit how you would for CS GO. - Stop. (man laughing) No, you don't sit like that. - Sometimes I do. - Yeah, that's right. You got lumbar support. How's it feel? - I feel like it's too low for my lumbar. It's like hitting my butt. - How tall are you? My resume says five eleven. (man laughing) Can I adjust this? Can I move it up or down? - It doesn't move up or down. - Oh, man. - Interesting. So it just doesn't hit you in the right spot. - Yeah. - Tilt. - That's normal. - Big tilt. - Is that really it? - That's really it, dude. - Honestly with the Razer, I was expecting something really dumb and like unnecessary, like maybe a subwoofer or vibrator in the back. (man laughing) So overall there's like nothing special about this compared to other gaming chairs. So since I wouldn't buy a gaming chair, I wouldn't buy this one either. - So a Chase is our event coordinator. The reason why Chase is here is because Chase plays a lot of video games. - Too many. - On the right side, the front, there's adjustment for the built-in lumbar support. Here. - Yep. - Perfect. - So that would adjust... - Oh, wow. Okay. - Yeah, yeah so. - I actually find this kind of nice. I don't have it on the chair that I currently have. I'm going to be honest, having a headrest, a hundred percent better than not having one. That's my one complaint about the chair I currently have. (man laughing) You can't lean back and relax because then all of a sudden you're just, you're just going way back. - Their lumbar support, Do you feel that it hits your lower back in the right spot or is it like kind of hitting like lower or higher? - It feels a little high. I don't know if that's just cause of the adjustment. I can keep trying to make an adjustment. I probably wouldn't use that too much. I think same with this one. If I'm in a game, like I'm going to want to have it upright or you know, maybe leaning a little bit forward, but then that becomes awkward when all of a sudden you want to relax for a moment. (man laughing) Like if you die or something. - Yep. I've just found that if you come up with any chair, you're going like this, it's just it's too much, especially when you want to have as much mouse pad real estate. - [Jono] Wow, I should get you to host this for me. - Honestly, yeah. A hundred percent. (man laughing) Would you pay 499 US dollars to buy this chair though? (man sighs) - Probably not. That's cause I'm kind of cheap. (man laughing) That's why I have the same chair I've had for the last like five whatever years. - Yep. - [Jono] All right swap out for a sec. - All right, cool. - Try that Herman Miller Embody Gaming Chair. - Bring it in. How much is this one? - Ah, let's not talk about it. - [David] It's like 1500 USD. (man laughing) - Okay. - Ooh. - Oh, let's go. I don't want to spend that much, but this is comfortable. You can instantly tell like, the seat part, it's a little bit different. I feel like I can almost feel the difference in the material or just like the way that they support you. Is it more breathable too? Is that supposed to be a thing? - Yeah. - [Jono] Would you buy this or a 3090? (keys typing) (man Laughing) - I'd rather buy the 3090. - Oh my God. So, this brings us to the end of the video. This is the Razer Iskur. 500 bucks. I like it. I really liked the back support system that they have here. I'm excited to see what they do in the future. You know, is it better than these pillows? I definitely think so. It's kind of up to you guys. Yeah, now that's pretty much it. So, thank you very much for watching. Check out some of our other videos, you know. Check out some of my other chair videos, if you really want, you know. You're in the market for a chair, you know, watch some stuff and like the video, comment, get subscribed. See you.",
    "transcript_keywords": [
        "chair",
        "gaming chair",
        "Razer Iskur gaming",
        "Razer Iskur",
        "Razer",
        "Embody Gaming Chair",
        "Iskur gaming chair",
        "gaming",
        "Razer gaming chairs",
        "yeah",
        "chairs",
        "Back",
        "thing",
        "support",
        "kind",
        "lumbar support",
        "Miller Embody Gaming",
        "Embody Gaming",
        "pretty",
        "lumbar"
    ],
    "transcript_entity_values": [
        "Chase",
        "499 US dollars",
        "five foot",
        "Min",
        "Razer",
        "three",
        "a ton",
        "One",
        "Razer Iskur",
        "one",
        "Drop",
        "three-year",
        "about 150 pounds",
        "sec",
        "3090",
        "Logitech",
        "500 bucks",
        "Today",
        "24 hours",
        "Ed",
        "1500 USD",
        "up to six feet",
        "Liang Tan",
        "Herman Miller",
        "up to 300 pounds",
        "first",
        "A hundred percent",
        "Razer",
        "Razer",
        "500 USD",
        "4D",
        "California",
        "two inches",
        "The Herman Miller",
        "CS GO",
        "Two",
        "five eleven",
        "hundred percent",
        "five whatever years",
        "six",
        "First",
        "five",
        "a minute",
        "today",
        "The Razer Iskur Gaming Chair"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "DATE",
        "TIME",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "MONEY",
        "ORDINAL",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG"
    ]
}