{
    "id": "UbVMvS5Cq7w",
    "title": "HD Output For Your Nintendo 64 - UltraHDMI Review",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2018-05-15T15:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=UbVMvS5Cq7w",
    "category": "Science & Technology",
    "tags": [
        "Nintendo",
        "Nintendo 64",
        "N64",
        "HDMI",
        "UltraHDMI",
        "HD",
        "high-definition",
        "high-def",
        "gaming",
        "video games",
        "retro gaming",
        "Retroactive",
        "DIY",
        "mod",
        "hack",
        "install",
        "Mario 64",
        "GoldenEye",
        "Mario Kart 64",
        "StarFox 64",
        "Cruisin' World",
        "review",
        "This Does Not Compute"
    ],
    "views": 101352,
    "likes": 2896,
    "comments_count": 261,
    "description": "The Nintendo 64 hasn't been left out when it comes to HD output mods for retro consoles. What does it take to install the UltraHDMI, and is it worth the effort and cost?  Main UltraHDMI product page:  UltraHDMI installation guide:  I bought my kit from Game-Tech:   -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music: \"Tony's Belated Breakfast\" by Birocratic ( Additional music by Epidemic Sound ( and Lakey Inspired ( Intro music by BoxCat Games (",
    "description_links": [
        "http://ultrahdmi.retroactive.be",
        "https://www.game-tech.us/installation_guide/",
        "https://www.game-tech.us/product/ultrahdmi/",
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "http://birocratic.lnk.to/allYL).",
        "http://www.epidemicsound.com)",
        "http://www.soundcloud.com/lakeyinspired).",
        "http://www.box-cat.com)."
    ],
    "transcript": "Hey everyone, it's Colin. How's it goin'? So far, a number of retro game consoles have gained options for high definition output in one way or another. This time, let's take a look at one for the Nintendo 64. [ Intro ] This is the UltraHDMI kit from Retroactive. It's a custom circuit board that installs in an original N64 console to provide upscaled, hi-def audio and video. An Intel Altera Cyclone III FPGA does the work, but also adds a number of other options, which we'll get to in a bit. Let's get the kit installed. I started by disassembling the N64 and removing the motherboard... then pulling off the heatsink assembly. If your console's dirty, now's a great time to clean it up. I decided to do the hardest part of the install first: soldering the flat-flex ribbon cable to the motherboard. Most of the pads connect to the N64's Reality Coprocessor, or RCP. Basically, the console's graphics chip. I lined up the ribbon with pin 6, then held it in place with some kapton tape. It's necessary to apply solder flux to keep from shorting the pins together, and the UltraHDMI installation guide strongly recommends *only* using rosin-based flux. I put a small amount of solder on the tip of the iron, then dragged it across the pins to bridge 'em to the pads on the flex cable. This technique can be a bit tricky, and while I practiced it on some scrap PCBs beforehand, my results still aren't the prettiest. There are three breakout pads on the ribbon that connect to other places: two solder to the surface-mount capacitors next to the RCP for power, and the longer one goes to the peripheral interface, or PIF chip. Where exactly to solder this one will depend on the revision of your console. On mine, it went to pin 16. There's a link to the install guide in the description and it explains where to solder for the other console revisions. I folded the ribbon cable so it would be routed properly, then taped it in place. Next, I needed to cut a hole in the back of the console for the HDMI connector. I lined up the UltraHDMI module, and marked the housing with the craft knife. You *could* use a rotary tool to cut out the notch, but it's a small amount to trim and needs to be pretty precise. So, I decided to simply use a flat file. [] I was careful to keep from making the notch too big. A snug fit is important as it provides the strain relief for the connector. One of the included pieces of foam gets stuck to the bottom of the PCB, then the other goes on the N64's AV connector. These are used to help keep the UltraHDMI module in place. The install guide says to put the PCB in the housing next, but I found that it doesn't leave much room to access the ribbon cable connector. So, I left the board out while I got the flat-flex hooked up. Okay, let's finish up the installation. I dropped in the PCB, then the N64's motherboard, and finally, the AV connector housing. I made sure that the heatsink assembly wasn't pinching the ribbon cable, then got everything screwed back in. I buttoned up the housing... and finally, applied the label included in the kit. So, what about the results? Simply put, they're amazing. The image is perfectly clean, with no noise and vibrant colors. It's surprising just how much nicer it looks compared to composite video, which is what most people are probably used to with this console. But it's gonna be a good step up even from RGB, since the scaling is handled by the UltraHDMI module, and not the TV. Pressing a hotkey combo on the controller gets you into the unit's menu, and there are a lot of options. You can adjust the overscan... change how the image is interpolated... apply artificial scanlines... and also tweak some advanced settings, like the gamma... or enabling simulated CRT bloom. There's also a self-test mode, which is really useful to help you figure out if you made any mistakes while soldering the flat-flex cable. The UltraHDMI supports resolutions of 480p, 576p, 720p, and 1080p, all at 50 or 60 hertz. In normal operation, it has about a one frame delay, which really isn't noticeable, but the module's processing can be turned off to eliminate this. Doing so limits you to 480p or 576p, and due to the N64's non-standard refresh rate, there might be screen tearing every few seconds. But there's also a mode that passes the signal through as-is, with no lag or tearing. The caveat being that not all displays can handle it. Even with all the settings at default though, the image quality is really impressive. Of course, it can't make games look better than they were designed to, so the improved picture can sometimes highlight the N64's graphical limitations that might otherwise go unnoticed. The audio isn't left behind either. It's output at 16-bit 48 kilohertz, which is the maximum resolution of the console itself. Have a listen. [ Music & SFX - Super Mario 64 ] My only minor gripe about the UltraHDMI's design is its use of a Mini-HDMI connector for output. It was likely picked due to space constraints in the N64 housing. But it's not that commonly used, and it means you'll need to pick up an adapter or separate cable. As with similar mods for other consoles, this kit doesn't come cheap. I paid a bit over $155 US, with shipping, from Game-Tech. They're also sold in batches, so you usually need to wait for a pre-order to open up. For mine, it was almost five months between placing my order, and it being shipped. It seems like Retro Active simply makes these in small quantities, so you need to be patient. That patience extends to installation, too. I've done my fair share of soldering, but this one still had me concerned due to the risk of bridging pins or damaging the flat-flex. I wouldn't consider this kit beginner-friendly. Of course, a number of reputable console modders offer installation services, and sometimes pre-modded consoles pop up for sale too. But those also have their price. Yet, as a big fan of the Nintendo 64, I think the UltraHDMI is worth the cost. My favorite console game is Mario 64, and seeing it at its best is really satisfying. For a lot of people, there's nothing quite like playing retro games on their original hardware. And this kit gives those games... the quality they deserve. If you like the video, I'd appreciate a thumbs-up, and be sure to subscribe. You can follow me on Twitter and Instagram at thisdoesnotcomp, and as always, thanks for watching.",
    "transcript_keywords": [
        "console",
        "ribbon cable",
        "UltraHDMI",
        "cable",
        "ribbon",
        "Colin",
        "connector",
        "UltraHDMI module",
        "kit",
        "Intel Altera Cyclone",
        "Altera Cyclone III",
        "Cyclone III FPGA",
        "solder",
        "ribbon cable connector",
        "consoles",
        "housing",
        "retro game consoles",
        "flatflex ribbon cable",
        "PCB",
        "module"
    ],
    "transcript_entity_values": [
        "UltraHDMI",
        "almost five months",
        "UltraHDMI",
        "Music & SFX - Super Mario 64",
        "over $155 US",
        "two",
        "60 hertz",
        "Instagram",
        "PIF",
        "RGB",
        "16-bit",
        "48 kilohertz",
        "50",
        "6",
        "PCB",
        "Mini-HDMI",
        "Game-Tech",
        "first",
        "one",
        "576p",
        "CRT",
        "One",
        "Reality Coprocessor",
        "16",
        "Mario 64",
        "Colin",
        "Twitter",
        "N64",
        "every few seconds",
        "AV",
        "three",
        "Retro Active"
    ],
    "transcript_entity_types": [
        "NORP",
        "DATE",
        "GPE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "ORG"
    ]
}