{
    "id": "uCDAdO8H778",
    "title": "Mercedes EQC: Hands-On With The 'Anti-Tesla' SUV",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-09-07T15:50:21Z",
    "video_url": "https://www.youtube.com/watch?v=uCDAdO8H778",
    "category": "Science & Technology",
    "tags": [
        "mercedes eqc",
        "mercedes benz eqc",
        "mercedes eqc 400",
        "mercedes eqc 2019",
        "best electric car 2018",
        "mercedes ev",
        "tesla model x",
        "mrmobile",
        "imore",
        "michael fisher"
    ],
    "views": 86041,
    "likes": 3733,
    "comments_count": 268,
    "description": "Earlier this year Mercedes-Benz let me sit behind the wheel of the most futuristic electric car I had ever seen. But the \"Concept EQ\" was just what you'd expect: a concept. So when Mercedes invited me to swing on over to Stockholm to check out the real version coming to market next year, I hopped the first sailboat I could find. This is the Mercedes-Benz EQC400, a crossover SUV with an all-electric power plant, an all-Mercedes fit-and-finish ... and a spec sheet thats already stirring up a few mixed feelings. Join me for a first look at one of the first electric SUVs to take on Tesla in a big way.   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S MERCEDES EQC HANDS-ON]  MrMobile's Mercedes EQC Hands-On was produced following several hours with three Mercedes EQC400 show-floor models at the Mercedes EQC unveiling in Stockholm, Sweden. (Travel and lodging were provided by Mercedes-Benz. No other compensation was requested or provided, and no copy approval was offered to Mercedes-Benz prior to release.)   [LINKS]  \"The Mercedes-Benz EQC's 200 Mile Range Is A Disappointment\" [Jalopnik]:   \"MERCEDES-BENZS FIRST SERIOUS ALL-ELECTRIC CAR IS A 402-HORSEPOWER SUV WITH OVER 200 MILES OF RANGE\" [The Verge]:   \"First Look Inside The All Electric Mercedes!\" [JerryRIgEverything]    [MUSIC]  Road to San Francisco by Magnetize Music:   New Media by Olive Musique, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #mercedes #eqc #electriccar #ev #mercedesbenz #automotive",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://jalopnik.com/the-2020-mercedes-benz-eqcs-200-mile-range-is-a-disappo-1828812912",
        "https://www.theverge.com/2018/9/4/17818836/mercedes-benz-eqc-suv-ev-specs-photos",
        "https://www.youtube.com/watch?v=HDrv4qMpClw",
        "https://www.premiumbeat.com/royalty-free-tracks/road-to-san-francisco",
        "https://www.premiumbeat.com/royalty_free_music/songs/new-media",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael Fisher] Earlier this year, Mercedes let me sit behind the wheel of the most futuristic electric car I had ever seen, but that was just a concept. So when Mercedes invited me to swing on over to Stockholm to check out the real version, coming to market to real people next year, I hopped onto the sailboat they sent faster than you can say EQC. That's the car we're talking about, a crossover SUV with an all-electric power plant, and an all-Mercedes fit and finish, and a spec sheet that's already stirring up a few mixed feelings. (electronic theme music) - [Michael] The last time I was in an electric SUV it was the Tesla Model X, and the EQC's cockpit is, basically, the opposite of that. Don't get me wrong, there's lots of tech here: a digital instrument cluster and head unit controlled by a big trackpad on the armrest, a Heads Up Display so you don't need to take your eyes off the road, and voice control. If you need the car to have itself charged by 8 am... - [Automated voice] Okay, I will have the car charged by 8 am. - [Michael] Or you need to navigate to a destination, you just say, \"Hey, Mercedes,\" and tell it what you want. A few cars have that but this one is clever enough to tell whether it's the driver or passenger talking to it. So if somebody says, \"I'm freezing,\" well, the system will only turn on the heat for that side of the car. That's pretty cool. But where Tesla serves up its tech with an ultra-modern aesthetic, Mercedes takes a much more traditional tack and, honestly, I prefer it. One of the things I don't like about modern cars is the trend toward more and more touch controls. Sure, they make the car look like a spaceship, which is great for pictures, but when you get down to driving and need to keep your eyes on the road, touch screens are just the worst. So, there's still a lot of tactility to the EQC's climate and media controls. In particular, the stereo volume knob is a big, steel cylinder that's just, so intense! You can control the instrument cluster and head unit by touch, but if you're driving you've also got the option of using twin trackpads on the steering wheel. They kind of remind me of old Blackberry touchpads. To a guy who loves technology but still came up driving 1980s cars well into the early aughts, this combination of modern conveniences and traditional controls is almost perfect. To someone who prefers a cleaner look, like one particular YouTuber we all know, maybe the cockpit full of switches is too archaic. - [JerryRigEverything] There are quite a lot of buttons in this vehicle. - [Michael] Your mileage may vary. There's a good reason I started with the interior for this video. The exterior is, well, kind of looks like a lot of crossovers. Of course, that's part of the plan. Mercedes sees this as a more accessible design than the ultra-futuristic concept version, and all the commonalities with a traditional SUV mean the company can use existing factories to build the EQC. But for every two or three things I like, like the eyebrow headlight design and illuminated Mercedes logo that doubles as a radar, there's also a missed opportunity, like the lack of a front trunk to augment the rear one. Also, the reuse of the more traditional design means that there's a center-lying tunnel that'll probably get annoying for the person riding in the rear middle passenger seat. The biggest open question is a matter of a single number. Not the 400 horsepower combined motor output, nor the maximum torque of 564 foot-pounds - which can be split dynamically between front and rear motors, by the way. No, the number that has people talking is two hundred. That's the maximum number of miles Mercedes says you should be able to drive on one charge of the eighty-kilowatt-hour battery pack, and even that figure is fuzzy at this time. That means that the EQC, which won't see a US release until 2020, is already rated for less range than the Tesla Model X, the Jaguar I-Pace, and the Audi E-Tron I'll be looking at later this month. Now two hundred miles is nothing to sneeze at, of course, but as Jalopnik points out, it's strange that a company whose slogan is, \"The Best or Nothing,\" would settle for such a middle-of-the-road target when it comes to such an important metric as range. There's much more I wanna know about the EQC, folks, but my time in Stockholm is short, my time for filming is shorter, and the time to release is still quite long. I'm eager to take a test drive out in the real world, though, and when I do, I'll be happy to have you along. Please, subscribe to the MrMobile on YouTube so you don't miss it and see the links in the description for some of the well-reported stories that I referenced in the creation of this video. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "futuristic electric car",
        "Mercedes",
        "EQC",
        "car",
        "Tesla Model",
        "SUV",
        "futuristic electric",
        "time",
        "electric SUV",
        "cars",
        "Earlier this year",
        "Tesla",
        "electric car",
        "traditional SUV",
        "Mercedes invited",
        "year",
        "traditional",
        "crossover SUV",
        "head unit",
        "controls"
    ],
    "transcript_entity_values": [
        "2020",
        "Tesla",
        "two hundred",
        "Mercedes",
        "Michael Fisher",
        "8 am",
        "Mercedes",
        "eighty-kilowatt-hour",
        "The Best or Nothing",
        "564 foot-pounds",
        "US",
        "YouTuber",
        "Jalopnik",
        "One",
        "two hundred miles",
        "Michael",
        "Stockholm",
        "two",
        "400",
        "next year",
        "1980s",
        "the early aughts",
        "Earlier this year",
        "Blackberry",
        "MrMobile",
        "three",
        "one",
        "later this month"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "TIME",
        "PERSON",
        "QUANTITY",
        "WORK_OF_ART",
        "QUANTITY",
        "GPE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE"
    ]
}