{
    "id": "UCOHbvvF5BE",
    "title": "You're going to need a case... - Samsung Galaxy S23 Ultra",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-02-02T18:26:43Z",
    "video_url": "https://www.youtube.com/watch?v=UCOHbvvF5BE",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "Samsung",
        "Galaxy S23",
        "Ultra",
        "phone",
        "cool",
        "note"
    ],
    "views": 351265,
    "likes": 12713,
    "comments_count": 820,
    "description": "Get a dbrand skin or grip for your devices today at   Samsung just announced their new S23 lineup and it's looking to be similar to last year's phones with a few key updates. Bell went down to San Francisco for Unpacked to see if the Ultra is worth your time or if Samsung has lost their touch!  Check out the Samsung devices featured in this video:  Samsung S23 Ultra:  Samsung S23+:  Samsung S23:  Samsung Galaxy Book 3 Series:   Want us to unbox something? Make a suggestion at    GET MERCH:   COME TO LTX 2023:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   OUR WAN PODCAST GEAR:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 The next gen of Samsung is here! 0:31 S23 design 1:30 S23 Ultra design 2:51 Colour options 3:18 Sponsor - dbrand 3:37 S23 Hand feel 3:54 S23 Display/speaker impressions 4:53 S23 Ultra Display/speaker impressions 5:59 Gaming performance  7:31 Camera testing 9:57 Pricing and Overall thoughts 10:59 Outro",
    "description_links": [
        "http://www.shortlinus.com",
        "https://lmg.gg/JSlUX",
        "https://lmg.gg/k808u",
        "https://lmg.gg/bMBg5",
        "https://lmg.gg/ns9ho",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/masponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- What's up, guys? We're here at the Samsung Galaxy Experience here in San Francisco. And just to let you know, Samsung did provide flights and accommodation, but they're not getting any sort of review and this is not sponsored by them. So if it's trash, I'll let you know. They're showing off the brand new S23, S23 Plus, and S23 Ultra and we're excited to show it off so let's get right into it. Right off the bat, here we have the S23 and S23 Ultra. There is the S23 Plus as well, but we're not gonna take a look at it, as it's very similar to the S23, just with a larger screen, larger battery, and slightly faster charging, so if you like this phone and wanted it a bit bigger, you should be safe to go for the Plus size. Starting with design, and this is definitely a phone. It's like Samsung said, \"Let's take the essence of a phone and boil it down into the most basic thing you can get.\" And that's not a bad thing. It's a flat design. It still has that kind of rounded corner so it fits nice in your hand. It's not quite that complete flat rails like the iPhone. And on the back there's no set of camera housing, it's just the raw lenses, which I think looks nice, but it's definitely gonna be something you wanna put a case on 'cause these are pretty exposed. Looking around the phone, on the right side we have our power button and volume rocker. On the bottom we have a speaker, USB-C, and SIM card tray. We're not allowed to open it up, but I feel like it's safe to assume it's a single nano SIM with an eSIM possibility. On the left side, nothing. And on the top, nothing but a microphone. Very plain. You know, you're not gonna get those things that, you know, budget phones somehow have like the IR blasters, expandable storage or anything like that. But we haven't had those for years on these flagship devices, so it's nothing too surprising. And of course, on the front we have the 6.1 inch full HD+ AMOLED screen. We're gonna take a look at the screen closer later though. So let's move on to the Ultra. Here we have the Ultra, the phone for gamers. Let's take a look at- This one here, it's big. It's a big phone. If you like big phones, if you had the S22 Ultra, you kind of know what you're getting into. But for someone who prefers smaller and flatter phones, this is very round and very big. The screen is quite flat, but the glass itself falls off so you're still getting a pretty flat writing area for the pen and you're not gonna get as many accidental touches. On the side here, we have the power button and volume rocker. On the bottom, we have our probably single sim slot, our USB-C, as well as the speaker grill and S Pen. I actually was a Note user back with the Note 5 I think it was, and I loved it. I think it was great for playing like \"Jackbox\" or any of those kind of drawing games, or signing PDFs. I worked at a bank at the time and it was great to be able to sign something off and send it off just on my phone. Plus, it's a great fidget toy. (pen clicking) You'll be hearing that frequently when I'm around. Frequently. On the back, it looks very similar to the S23. We have our four main shooters here compared to the three. And then we have our laser auto focus module, so again, you'll be getting some really quick focus. And on the front we have the 6.7 inch dynamic AMOLED2X 120 Hertz QHD+. Oh, and it's Corning Gorilla Glass Victus 2 as well. So you know I'm a big fan of just not dropping your phone, but if you do, this should be okay and it's Gorilla Glass on the back as well. Speaking of, we have a lot of different colors. Phones are a major fashion accessory, whether we like it or not, so Samsung's got a few different colors here that might tickle your fancy. We have the lavender, cream, green, and phantom black, and I'm a big fan of the green. My favorite color phone was a green iPhone 11. And this one might take the bill. It's a nice almost flat matte, that even though it's a Gorilla Glass, it feels great in the hand and the color reflects really well. But if you don't like the color, then you'll love our sponsor, dbrand. Thanks to dbrand for sponsoring today's video. Now, dbrand claims they have the world's grippiest case. The case has thousands of grippy dots that span the surface of the case, creating a tremendous number of contact points for your buttery fingers. Get yours today by clicking the link of the description. I'll wait. I'll just be here. All right, come on back. Wait, wait- I gotta say, I was just taking off the case in the dbrand spot and the size of the regular S23 is nice. I've been using the OnePlus 11 5G for the last little while here, stay tuned for that video, and it's big, versus this fits so nicely in the hand and pocket. So if the performance can keep up, this might be a really good option. First, let's go check out the display and speakers. All right, we've got the regular S23 here. So obviously we gotta do a display and speaker test by bumping \"Crab Rave\" in his quiet Samsung cafe. Cringe, they don't have YouTube Premium. (\"Crab Rave\") All right, so the screen looks great. Of course, it's a Samsung phone, they make some of the best screens in the game. The speakers are loud and not bad, but I did notice a little bit of peaking in the earpiece speaker. So it doesn't have complete dedicated dual speakers outside of the earpiece, and I think it's suffering a little bit because of it, but it's not awful. It's definitely better than a lot of the other phones we've tried. And, you know, you're gonna be fine playing \"Crab Rave\" on the bus like you usually do. As for colors, it's that patented Samsung vivid. So if you like your colors really punchy, this is gonna look great. And I'm sure there's ways to turn it down to a more neutral look. But as a normie, I kind of just like it looking pleasing to the eye. I'm not gonna watch \"Oppenheimer\" on this, so I don't really care if it's not that gritty, realistic look. Sometimes I just wanna to have something that looks nice and this definitely does it. All right, now let's check out the Ultra and see if their speakers are better. (\"Crab Rave\") All right, same as S23, this sounds great. I didn't notice that little bit of crackling, so maybe it's just this device that's been sitting out and being used last little bit. But sounds phenomenal. Again, you're not getting the stereo separation as if there were two dedicated speakers, but you're not gonna complain. In a pinch, you put this down on a table, you're gonna be bumping a whole freakin' party. - [David] Show me what party looks like. - I've never been to one. I didn't want you to find out like this. As for the display, again, amazing colors, very punchy in this vivid mode, very sharp. And it takes a little bit to get used to the fact the screen doesn't fall over the edge like past devices. But again, I think that's nothing but a good thing. The accidental touches really aren't worth that little bit of a waterfall effect that you get with that curved edge and it still looks really good. One thing we noticed while getting this ready is that the pen was low on battery. So something to be aware of is this is an active pen and it's probably 'cause the Bluetooth you use as a remote or whatever when you push the button. But it's a trade off. It's something to be aware of at the very least. Obviously, \"Crab Rave\" looks great. But we're gamers, which means we need to go to the gamer zone to see if everything really looks good. I'm in my zone, the gaming zone that is. We're here with the S23 Ultra, which Samsung is toting as being a gaming beast. So let's talk some raw specs. The S23 Ultra has the Snapdragon 8 Gen 2, but it has a special overclocked version so you should get a performance bump over the S23, as well as just other phones coming out in the next little bit here, which is pretty exciting. Also inside you can do eight gigs of RAM or gigs (bell ding) of ram. And for the (bell ding) gigs of Ram version, you can go from 256 gigs all the way up to one terabyte. Now, that one terabyte one's only available through Samsung. So if you're someone who gets through a carrier, you're a little bit outta luck, but that's a lot of storage for a phone. If you use that much, sus. San Fran, baby. I love New York. Overall, gaming's not too bad. I mean, it's a mobile game, it's one they have preloaded on this so I'm sure it's kind of optimized for this new device. But it loaded up really quick. I tried closing it, reopening it. We've switched devices to see if there's any a difference and everything runs pretty smoothly. David was even saying earlier that this looks better than like a Nintendo Switch game, that if you saw it you'd be like, \"Good job, Nintendo, this looks pretty good.\" And it's on this. It's a little warm, it's not too bad. It is plugged in, which is gonna add to that. So something to be aware of, you might get some sweaty hands. I don't think it's gonna be anything too bad, especially with how large the device is. It should be able to passively cool just from the amount of glass that's being exposed to fresh air. One thing to note is that there are no S23s here in the gaming center and it just has the regular Snapdragon 8 Gen 2, so it's gonna perform a little worse. But with the latest flagship SOCs, I don't think there's gonna be any trouble running any games that really exist. But let us know if you want labs to check it out. Hey, I won. All right, we're on set for where they filmed the moon landing in 1969. We're ready to talk about cameras to see if they're really as good as paper says. So we got the S23 Ultra here and there's a lot going on. So we got two telephoto lenses, one at 3X and one at 10X. Both are 10 megapixel. Then we have a 12 megapixel ultra wide. And luckily enough, all the cameras this year have optical image stabilization so you're not gonna get any shaky ultra wides like you might have gotten last year. What's really special is the 200 megapixel adaptive pixel main camera. What adaptive pixel means is it takes that 200 megapixel photo, which is way too big to do anything with if you're the average person, and it turns every 16 pixels into one pixel. So what that means is that you're gonna get more brightness in each photo so that when you're taking photos at night, you can still get details in all of the dark little crevices and corners you're taking pictures in. Now, I'm gonna go to a shady back alley and see just how this does. Come on. Now, as you can see, it's really dark in here so we're gonna change the settings so that you can see what's going on. Whoa. Daytime. The night performance on these is crazy. We're not allowed to actually share these photos with you, even though by the time you're seeing this, it's after the embargo because they don't want anything being transferred during this embargo in case something happens. So we're just gonna have to film the screen to show you. But right off the bat, the night performance is amazing. The selfies are really well-lit, and the color of my skin, especially being a person of color still looks really natural. And then on the main camera itself, it's like I'm taking a picture with an actual DSLR and tripod. And yeah, these are all handhelds. Into the bright scenes, of course, everything looks great. The 10X zoom, surprisingly sharp, even though it did miss a focus a little bit. I feel like if I had taken more time or put it on a tripod just to give the OIS a little bit of help, maybe it would've been a little bit sharper. But I'm still blown away. They look really, really nice. And again, I wish I could show you the full resolution photos, but I can't. For video, I was, again, really impressed. No struggles at all. And now, we have the S23. So it has a 50 megapixel main shooter, 12 megapixel ultra wide, and a 10 megapixel telephoto, which is three times. We're gonna go into the dark room again and take some pictures to see what we think. It looks good still. It doesn't seem to be as good as the S23 Ultra though. And I did have to manually adjust exposure a couple times and that just might be the difference of grabbing that focus with the S23 Ultra's laser auto focus. But everything still looked really good. Although, things were a little bit more grainy in the dark, I think that you'll be really happy with any photos that it takes. My quality was also great on both of them, which is fantastic. Overall, the S23 and S23 Ultra look like amazing phones. This is coming from a guy who's been on iPhone for a long time, and when I was on Android, didn't really want to use Samsung 'cause I thought it was just kind of extra. But trying out these things, the amazing cameras, the beautiful screens, great speakers, on top of all these other just miscellaneous little features like night modes and AK filming, it doesn't matter if there's a ton of great features and it performs really well if it's too expensive. Now, I only have Canadian pricing so we're gonna put the kind of today's equivalent of USD on the screen here. For the S23, it starts at $1099 Canadian. For the Plus, it starts at $1399 Canadian. And for the Ultra, it starts at $1649.99 Canadian. It seems like these are really competitive. The new Snapdragon 8 gen 2 performed really well. The cameras, again, are amazing. And the software, it's a Samsung. I think this year's Samsung is probably we're checking out. But of course, wait for it to come out and see full reviews and unboxings. So this is just a quick look and it was in Samsung's own setup areas where everything's gonna work perfectly. So keep an eye out, let us know if you want labs to check it out when it fully releases. And if you like this video, maybe check out my POCO video, something on the opposite side of the spectrum. It's only 160 bucks.",
    "transcript_keywords": [
        "Samsung Galaxy Experience",
        "Ultra",
        "Samsung",
        "phone",
        "bit",
        "great",
        "good",
        "phones",
        "Galaxy Experience",
        "Samsung Galaxy",
        "screen",
        "big",
        "megapixel ultra",
        "Gorilla Glass",
        "Crab Rave",
        "Samsung phone",
        "megapixel ultra wide",
        "speakers",
        "kind",
        "megapixel"
    ],
    "transcript_entity_values": [
        "Crab Rave",
        "New York",
        "eight",
        "year",
        "Hertz",
        "three",
        "one terabyte",
        "One",
        "6.1 inch",
        "RAM",
        "last year",
        "8",
        "one",
        "David] Show",
        "a ton",
        "1399",
        "1649.99",
        "the S22 Ultra",
        "iPhone",
        "12 megapixel",
        "1099",
        "the Samsung Galaxy",
        "this year",
        "10 megapixel",
        "OnePlus 11 5",
        "200",
        "DSLR",
        "Nintendo",
        "3X",
        "only 160 bucks",
        "San Fran",
        "1969",
        "David",
        "Samsung",
        "AK",
        "S Pen",
        "Corning Gorilla Glass Victus 2",
        "Nintendo Switch",
        "S23s",
        "Daytime",
        "256",
        "thousands",
        "Ultra",
        "50 megapixel",
        "San Francisco",
        "a Gorilla Glass",
        "two",
        "120",
        "6.7 inch",
        "Ram",
        "YouTube Premium",
        "16",
        "Android",
        "four",
        "Snapdragon 8 Gen 2",
        "Canadian",
        "POCO",
        "USB-C",
        "Oppenheimer",
        "First",
        "years",
        "S23",
        "today",
        "IR",
        "200 megapixel"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "GPE",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "ORG",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "QUANTITY",
        "GPE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "LAW",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "QUANTITY"
    ]
}