{
    "id": "ud6rwVkbovA",
    "title": "Zune: The Failed iPod Killer - Krazy Ken’s Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2023-05-26T15:00:24Z",
    "video_url": "https://www.youtube.com/watch?v=ud6rwVkbovA",
    "category": "Science & Technology",
    "tags": [
        "Microsoft Zune",
        "Zune",
        "iPod",
        "Apple",
        "iTunes",
        "Mac",
        "PC",
        "Windows",
        "Steve Ballmer",
        "Xbox",
        "Zune HD",
        "Zune Fail",
        "Guardians of the Galaxy",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Tech",
        "Comedy",
        "Humor",
        "Funny",
        "Tech History",
        "MP3 Player",
        "iPhone",
        "Android",
        "Computer Clan",
        "Zune: The Failed iPod Killer - Krazy Ken’s Tech Talk",
        "CES",
        "Windows Phone"
    ],
    "views": 393176,
    "likes": 11123,
    "comments_count": 1486,
    "description": "Go to to get a 30-day free trialthe first 200 people will get 20% off their annual subscription! You can support this channel on Patreon! Link below Former iPod user Krazy Ken is trying a Zune for the first time! He's going to tell you all about the product history, and he'll debunk some myths.  See more tech flops   Magic Cube episode   Patreon!    Buy my Wallpaper Mega-Pack!    Follow me on Twitter   Facebook   Shop for cool stuff on my store   Hey! I have a Discord    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   NOTE: I'd like to clarify that the original \"CE\" in \"Windows CE\" did not act as an initialism per Microsoft's design. The dev community associated various meanings with it over time.  Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear I use   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://brilliant.org/computerclan",
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1rjrzxzjt_6iGeYS0jiBBZfq",
        "https://youtu.be/KK7n1HZf2Pk",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/megapack",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- I'm so happy Microsoft got a lot of Zune product placement in \"Guardians of the Galaxy.\" That should help boost sales. Oh, the Zune hardware was discontinued in 2011. Microsoft is such a successful and big company. How could this thing possibly fail? Let's take a look. Sponsored by brilliant.org. (bright energetic music) Hey, everyone, how are you all doing? If you're new here, welcome. My name is Crazy Ken. And the Zune is getting a lot of love lately. It's kind of coming back. It was in \"Guardians of the Galaxy,\" and Microsoft is even hosting a new Zune giveaway. Heck, they're even hosting a STEM challenge on zune.net. To learn how we got here, we need to explore the Zune's history, what the devices are capable of, and ultimately how this whole thing flopped. And I'm also gonna debunk three myths about the Zune, including one regarding the infamous squirting feature. Let's take a look. In 2004, Microsoft launched a music store feature as part of their MSN music service. A few months before it shut down in November, 2006, reports surfaced about Microsoft working on an iPod competitor. At the time, Apple was king of media player sales, so it makes sense that someone would wanna step up and try to dethrone the fruit. Microsoft employee, J Allard, who worked on the Xbox, oversaw this new project code named Argo. On July 10th, 2006, Engadget posted a photo of what's likely a Zune prototype. They said this photo was sent from an insider. Note the silver control pad as opposed to the black, and the thinner iconography on the buttons. 11 days later, Microsoft confirmed the product's name would be Zune, and they teased it with the website comingzune.com. Cesar Menendez also posted about it on Zune Insider blog. And Cesar was an employee at Microsoft, so I thought it was kind of cool that Microsoft was letting someone give the public an inside scoop on the product. One month later, an FCC filing with the name Toshiba 1089 appeared, and this apparent prototype circulated online. It looks similar to a white Zune, but the control pad is white instead of black, and there's no symbols on the buttons. Additional photos were also uncovered showing the Zune in some sort of lab testing. This unit is brown with a white control pad as opposed to a black pad on the production model. Ooh, I just love speculating about new products. It's always so much fun, but we didn't have to wait much longer, because on September 14th, 2006, Microsoft officially revealed the Zune's appearance. So let's take a look at it, and fun fact, if you look at the back of the black model, the text at the bottom says Model 1089. Coincidence? I think not! The first generation Zune, which was later named Zune 30, was manufactured by Toshiba and came in three colors. Black, white, and everybody's favorite, brown. And it sold for $250. Well, $249.99 if you like cents. The case is made of double-shot plastic, and the black color had dark blue accents around the edge, and the brown had green accents. And I really like the matte finish this plastic has. I think it feels really good in my hand, but I've noticed the plastic screen is really prone to scuffs and scratches. But don't worry, Microsoft will have a solution for that soon. The screen's bezel is silver and shiny, and that design also encloses the control pad. It's not touch-sensitive, so if you come from an iPod background, you may be tempted to scroll with a circular thumb gesture, but it's not designed to work that way. You can click the pad in four directions, and you can click and hold for faster scrolling. There's also a back button on the left and a play, pause button on the right. The three inch display is bigger than the iPod's 2.5-inch display, which I think is really nice, and it works for portrait and landscape content. However, despite the larger size, it is the same resolution as the iPod's display, 320x240. On top is the headphone jack and hold switch, and on the bottom is the connector port for charging and syncing. And on the back of the Zune is this circular thingy. I have no idea what it's for, but it's there. And it says hello from Seattle. Nice touch. Now the Zune is kind of big. It's 2.4x4.4x0.58 inches, and I think it looks like a chunky brick next to an iPod. Don't get me wrong, I still like the design of the Zune, and I abso-freaking-lutely love this black and blue color, but the size is just not appealing to me. But to each their own. And the weight is 5.6 ounces, not too different from the iPod's 4.8. I should also mention Zune came in some limited edition designs, like this \"Halo\" model, and this applied to future generations too. Now let's talk specs. The Zune features a 30 gigabyte hard disk drive and was advertised to hold up to 7,500 songs. It uses a free scale IMX31L processor with 64 megabytes of RAM, and the battery lasted for 12 hours of music playback or 3 1/2 hours of video playback, and it had an FM tuner built-in for radio. And it sounds good for radio. I tried it out and it sounds pretty much the same as if I would tune in on the station's website. However, my picky eye noticed that the five in decimal characters in the radio application are cropped slightly, but hey, nobody's perfect and frankly, I'm just a pixel peeper. But while we're on the topic of user interfaces, let's talk about the software. Now I've heard some folks say that Microsoft took Toshiba's software and reskinned it for the Zune, but I'm here today to debunk that little myth. Many non-Apple portable media players at the time ran Portable Media Center. Microsoft engineered the software and the Windows CE core it's based on, and they licensed it to other companies. So if you see some UI similarities between Toshiba's product and the Zune, now you know why. The Zune's graphical user interface is a program which runs on top of Microsoft Windows CE, Compact Embedded. In fact, with some computer trickery you can access CE's desktop on a Zune. I'm using version 3.3 of the software, because version three was the last major release this device supports. But if you're curious, this is what version one of the software looked like. And you don't see this too often, because pretty much every Zune is updated nowadays. The UI had smaller menu text and a different font. Future versions of the software including version three featured Microsoft Segoe font, which I've always loved. It's so thin and beautiful. The main menu lets you access music, videos, pictures, games and more. And you could customize the background image. And I think the UI still looks pretty today, 15 plus years later. This whole shift of the flat look and these thin, clean fonts was a big visual change for Microsoft at the time. Internally, this was known as the Metro style before it was officially named MDL, Microsoft Design Language. Although Microsoft did say Metro a lot when they demoed stuff publicly. - Metro, Metro, Metro. - A recurring theme with this UI is two-dimensional scrolling, similar to what we saw in the Portable Media Center software. You can scroll up and down in a list, but you can also scroll horizontally to other tabs. Like, if you switch from artist view into playlist view. And I was a bit confused at first, because I thought when you clicked a song it would play, but no, it actually doesn't. Anytime you click a song, it brings you to a menu that lets you add it to the now playing queue or send it to somebody else. So you have to click play a second time. So it's kinda like you have to double click, like, on a PC desktop just to play a song. Hey, now I know that. You can install games too. Some games were built-in, including Hexic, a game you play in portrait orientation, and Texas Hold'em, which you play in landscape orientation. The social features were a big thing Microsoft was trying to push. I mean, heck, the whole tagline was, \"Welcome to the social,\" which still confuses me when I'm trying to think about a music player. But Microsoft was trying to build a social network around music and one of the features of social was you could take these flash-based widgets and embed 'em on a website so you can share with people what you're listening to, and you can also see what other people are listening to. I can't fully demo these social features, because Zune Social doesn't exist anymore. But there is one social feature that still works today, and now we need to have a conversation about squirting. And depending on your sense of humor, you can interpret that a couple different ways. Let me back up and add some context here. Squirting was the common term people used when referring to the Zune's song-sharing features. This was one of the product's differentiators. You could send pictures from your Zune to your friend's Zune if you two were nearby. And you could also share a song which they could listen to for three days or three plays, whichever comes first. But I'm here to bust this myth. And I know we all love laughing at the word squirt because, apparently we're all 12 years old, and I think we have Steve Ballmer to thing for that. I think Leo Laporte contributed a little bit too. - Hey, baby, mind if I squirt you a song? - But this feature's official name is simply called Send. That's what the button says at least. And the official fact sheet calls it wireless Zune-to-Zune sharing. No mention of the word squirt anywhere. So I hate ruining the fun. Wait a minute, what am I talking about? I love ruining fun. The word squirt was not the official name. In fact, the term squirt is just a general tech term for beaming a file from one device to another, especially back in the infrared beaming days. And if you're interested, Windows does have a system application called fsquirt.exe, you know, just in case you were curious. So that's the hardware and the software, but now how do you load all your juicy content onto these things? That's where the Zune desktop software comes in. The first and last major releases were versions one and four. So we'll take a look at those two programs. Upon installation, you're greeted with this photograph. Okay, I'm gonna be very careful with what I say, because this is a family-friendly show, and this can get R-rated very quickly, so just use your imagination. It looks like this was a software update screen, but let's ignore it. The next screen says, \"Welcome to the social.\" - Welcome to the social. A social? Ice cream social? - I remember this slogan vividly from back in the day, probably because it never made sense. I never even owned a Zune, yet I remembered this catchphrase for some reason. It's making more sense now that I'm actually using the Zunes. I kind of get it, but at face value, it's confusing. Okay, now that the software is installed, let's absorb the skeuomorphic goodness. I really like how the bezel and play buttons are made to look like the physical Zune hardware. The Zune software lets you rip music, burn CDs, organize music, pictures and videos, and of course, you can sync all that data with your Zune. It also has a compact mode. The software also gives you access to Zune Marketplace, which replaced MSN music. You could purchase music here, TV shows and movies were added later, and you could also subscribe to Zune Pass for 14.99 a month. Zune Pass lets users download an unlimited number of songs without having to pay for them all individually, and you can play them as much as you want, as long as your membership was active. And in a November 19th, 2008 update, you could then keep 10 of those songs to permanently add to your library. At the time, I thought it was kind of silly to rent your music, but (laughs) oops, that didn't age well. That's all I do nowadays. In fact, that's what a lot of us do. And Microsoft made a compelling argument when they challenged Apple's 99 cents a song method. They said it would take about $30,000 to fill up an iPod classic solely from iTunes purchases. But ultimately, even though it kind of sounded like a good idea, looking back, it wasn't enough to save the Zune. So my Zunes are running newer software and firmware, which are not compatible with version 1.0 of the desktop software. So that's why I installed the latest version, 4.8. On launch, version 4 brings you to a quick play screen. You can change the default screen in the settings if you want. This screen's Metro style UI with tiles reflects the UI on the Zune HD, which we'll take a look at in a bit. The quick play screen lets you pin content, look at newly added content and view your play history. When you play a song, all of your other album art populates the background. The music scrubber sits at the bottom with a neat audio visualizer in the center and playback controls on the right. And they fade away after a few seconds of inactivity. The collection tab on top brings you to a column view of your media, music, videos, pictures, and more. And again, the marketplace tab lets you buy media, but those services don't exist anymore. Which is a bummer, because how am I gonna load apps and games on my Zune HD? Don't worry, I have a little workaround. And you'll see it Zune. Soon. The social page is also inoperable, but it featured a friends list, an inbox, and your user profile page. And that brings us to the device tab. You can click this tab to view your Zunes or click the icon in the lower left. For quick syncing, you can simply drag media onto the Zune icon and it will sync. The device page lets you change sync options and it shows a status bar with your storage space. You can also view the content that is on your Zune, even if the Zune was originally synced with another computer, and you can copy the files into your own library. I'm not 100% sure how that worked with DRM-protected content, but that was still a nice feature, because with the iPod, you could not merge libraries. If you synced your iPod with another iTunes library, you were forced to erase the iPod before any content was put on it. So we took a look at the first generation Zune and the first and last releases of the desktop software. But we're just getting started. But before I continue, I do want to thank everyone in the tech community inside and outside of the Computer Clan who helped me obtain a brown Zune. In short, I ordered one off eBay originally. Little did I know that was a dead account, so I was in a big rush to get a new one. And also a big thanks to Elite Obsolete Electronics for all of the media player donations. So Microsoft had another media player in the works, the next generation of Zune. But it wasn't just one Zune, it was a line of Zunes. And I hope it works, because in the first quarter of the Zune's launch, the project cost Microsoft $289 million. That was a lot of money back then, and now. But hey, it's young, right? Let's give it the benefit of the doubt. The second generation line was launched on November 13th, 2007. It introduced two size options with various colors. No brown this time. The smaller models featured four or eight gigabytes of flash storage and the larger model used an 80 gigabyte hard disk. The available screen sizes were 1.8 inches and 3.2 inches, and both models featured an upgraded scratch-resistant screen made of glass as opposed to plastic. And they featured a new Zune pad, which replaced the control pad from the original. Zune pad can be used with touch gestures and with physical clicks. The back inside of the new Zunes were now made of aluminum as opposed to the all plastic design. And the battery for the Zune 80 was advertised the last 30 hours with wireless turned off for music playback and four hours of video playback. And I'm just making an educated guess here, but I think Microsoft wanted to make this smaller player to compete with the iPod Nano, because this Nano was playing a big role in helping Apple cross 100 million iPod sales at the time. Funny enough, right before this new Zune came out, Apple ditched the tall look and made this cute little square. So I guess they look different enough now. You can't make a copycat argument anymore. But also in 2008 and 2009, Apple went back to the taller look. Then on September 16th, 2008, a new 16 gigabyte flash option was introduced and a new 120 gigabyte hard disc option was introduced as well. Microsoft also considered a foldable Zune design based on this patent application, but this product never went to market. And that brings us to the third generation Zune, which featured a big redesign in terms of the hardware and the software. And again, if I had to make an educated guess, Microsoft released this to compete with the iPod Touch, which at the time, sold 20 million units. So I present to you Zune HD. Zune HD ditched the Zune Pad in favor of a 3.3 inch all LED touchscreen at 480x272 resolution. Built inside of a new aluminium enclosure, designed in collaboration with Astro Studios, the same company Microsoft worked with for the Xbox 360 design. The home button is on the lower front beneath the screen, the power button is on top, and the media button is on the left, which lets you summon playback controls and volume. And the sync port is on the bottom along with the headphone jack. And it still said hello from Seattle, but it was on the side as opposed to the back. I'm not gonna lie. I mean, I grew up with the iPod, so I always just in my head imagined the Zune HD was the same size as the iPod in terms of the screen size. But no, it's actually much smaller. But the cool thing is it's an OLED display, which the iPod is not. That means the black pixels have no light in them making the blacks really black as opposed to a dark gray look. And this was one of the first consumer products to ship with an all LED display. So I think that's a really cool feature and a good achievement. Zune HD's UI used the Metro style we talked about earlier. It featured new animations, new iconography, and lots of tile-like elements. Zune HD also featured an HD radio and 720p HD video out with an optional AV dock accessory. And to give Microsoft credit, this was a differentiator for the Zune. The iPod's video out capabilities could only go up to 480p and in some cases, 576p with Apple's Component AV Cable, according to the spec sheet. On the inside, Zune HD featured an NVIDIA Tegra APX 2600 arm processor, 128 megabytes of RAM, and an accelerometer for motion-sensitive applications. The home screen also shows a parallax effect when you tilt the Zune slightly, and it uses the accelerometer to do this. Unfortunately, there's no built-in speaker, which the iPod Touches had for a couple generations. So that's a bit of a deal breaker for me. In terms of battery, Zune HD could play music for about 33 hours and video for 8 1/2 hours, and it was available in 16 gigabyte and 32 gigabyte flash storage configurations for $220 and $290 respectively. And for the first time on a Zune, there was a built-in web browser. Now Microsoft's new focus for the Zune HD was apps and games. That's why they moved to this whole touchscreen interface. So you can play on the screen with custom controls and the software. But the Zune Marketplace doesn't exist anymore. So how the heck am I gonna load those things on here? With computer trickery, that's how. Thanks to the amazing dedication and archived content on r/Zune and this guide by itsnotabigtruck, I learned how to install Visual C# 2008 Express and XNA Game Studio 3.1 with Zune extensions. With this installation, I was able to take the CC game files from the archives and deploy them directly to my Zune HD simply by double clicking the file and clicking unpack. And voila, I now have games on my Zune. Now I can play drums, 2048, Minesweeper, and my favorite game, Stopwatch. (laughs) Oh, yeah, new high score. And Zune HD received a 64 gigabyte option on April 9th, 2010 for $349. And that's it. Three years and three generations of Zune, and Microsoft let it go. I can't find any reports about further Zune losses, so maybe that's a good sign. But what happened next? On March 14th, 2011, mumblings in the tech community suggested Microsoft ceased development of new Zune players due to low demand, but existing models remain for sale. On October 3rd, 2011, Microsoft quietly announced it would discontinue Zune hardware in favor of Windows Phone. But the Zune brand was still active on the software and services side. Now the demand for smartphones was growing as the demand for media players was shrinking. So the Windows Phone focus was a good idea for Microsoft. Windows Phone 7 was a major software update to Microsoft's Phone OS, featuring an all new user interface with the Metro design language, which again, was later named Microsoft Design Language. This style featured new animations, sideways scrolling, clean typography with that sexy Segoe font. I'm sorry, I can't get over how good it is still. And tiles, lots of live tiles. And many of these UI elements evolved from the Zune software. And Windows Phone 7's UI evolved into Windows 8, 8.1 and 10, and this style was a big part of Microsoft's visual identity for years until it started getting phased out with the Fluent Design System in 2017. Rewinding back to June, 2012, Microsoft announced they'd phase out the Zune brand in favor of the Xbox brand for digital music and video services. And the Zune desktop software was replaced with the Windows Phone app. Then on November 15th, 2015, the final dwindling remnants of Zune were killed off. The remaining Zune services were completely shut down, and all Zune Music Pass subscriptions were converted into Groove Music Pass, which Microsoft killed two years later. Oh, for heaven's sake, Microsoft. Please just stick to something. Now, Microsoft didn't announce official sales for the Zunes, but they did say between the launch date and May, 2008, they did sell 2 million units. And maybe this trial and error is helping Microsoft realize where their focus should remain, because they're not a dumb company. They do a great job in many areas. Today, Microsoft's top three revenue streams are server and cloud services, Office, which is now part of Microsoft 365, and Windows. Those three revenue streams made up 69% of Microsoft's 2022 revenue, grossing $137 billion. And you don't just get there by mistake. You have to have a lot of smart people working together. So how, how on God's green and brown Earth did the Zune even fail? How could they not figure this out? Well, here's my breakdown. Reason one, lack of developer adoption. Many developers felt Microsoft's SDK for the Zune was incomplete. It did not offer full access to the Zune's hardware, and they were going up against the Apple Goliath. There was already a proven SDK for the iPhone and the iPod Touch with a huge app marketplace. That combination led to a lack of developer adoption, which led to a lack of choices for apps and games for consumers. Reason two, some features lagged behind. Yes, there were some great features in the Zune that the iPod didn't have at the time, but for the most part, I would say a lot of big features consumers were concerned with weren't in the Zune, but they were in the iPod, give or take a year prior. For example, touchscreen features and a built-in marketplace to download songs were already in the iPod Touch two years before the Zune HD came out. And when the Zune HD was released, Apple was already on the third generation iPod Touch. And the app marketplace was huge for it, and a lot of developers were already on board, because the SDK that worked for this also worked for the iPhone, which was growing a lot at the time. Still is today. And reason three is bad market timing. This is hard to gauge sometimes. I get it. But when the Zune came into the market, the iPod had already garnered 26% market share. So it was already going up against a big beast. And iPod sales continued to climb. But shortly after the iPhone launch and the smartphone revolution, everything changed. iPod sales peaked and then started declining. And the whole portable media player industry went down with it because everyone wanted a smartphone. Apple wasn't immune to this either. Their iPhone product cannibalized the iPod. Sales went down, and they don't even sell it anymore. So those are my three reasons, but I think Jim Kramer sums it up best. - [Jimmy] Apple had you beat before you hit the market. - Oh, don't worry. I didn't forget about myth number three. The final myth I want to debunk is the Zune sucks. - Apparently the Zune zucked. (crowd laughs) - In my opinion, it absolutely does not suck. I just don't think enough people gave it a fair chance. I would say a lot of the opinions about it sucking came from people that didn't own one, just to guess. But despite Microsoft's failed attempt to sell it well, the products were good. And wireless syncing, that was another convenient feature that the Zune had four years before the iPod got it with iTunes 10.5. So in terms of features, Microsoft was ahead in some regards. And the UI was much more pretty than the iPod's UI, which had good navigation, especially with the amazing click wheel. But the graphics were just kind of plain compared to that Metro style. So there's lots of positive traits about the Zune, and although it flopped, I'm still very happy that I finally got to play with some. And it's really cool to see a dedicated community that's still happy and thriving today that cherishes this device so much. Despite the Zune flopping, it still took a lot of smart people and problem-solving skills to make this thing happen. And regardless of the topic, I think learning how to learn is an imperative skill. And that's why I wanna show you brilliant.org. Brilliant has thousands of interactive courses about computer science, neural networks, programming and more. And since you're watching me, I assume you're into tech, right? Then the \"How Technology Works Course\" is perfect for you. No joke, I was so immersed in a lesson once, I was up past midnight learning about video compression, which is a crucial technology that you're using right now to watch me. - [Some Girl] Ken, it's getting late. Come to bed. - Not now, babe. I'm learning about motion compensation. You can try Brilliant free for 30 days. Simply visit brilliant.org/computerclan. And if you're one of the first 200 people to visit that link, you'll get 20% off your annual subscription. And when you do that, you're also supporting the Computer Clan. So thank you very much. Catch the crazy and pass it on. (bright energetic music) I'm sorry, I just need to wipe all squirting references out of your brains and mine, so we'll just do, ah, (beep).",
    "transcript_keywords": [
        "Zune",
        "Microsoft",
        "Zune pad",
        "iPod",
        "Zune desktop software",
        "Zunes",
        "Zune hardware",
        "Zune software",
        "generation Zune",
        "Zune Music Pass",
        "Zune Pass",
        "software",
        "Zune product placement",
        "Zune Marketplace",
        "music",
        "Microsoft Design Language",
        "Windows Phone",
        "Zune desktop",
        "play",
        "Zune Music"
    ],
    "transcript_entity_values": [
        "May, 2008",
        "Xbox 360",
        "Microsoft Design Language",
        "8.1",
        "2017",
        "Windows Phone 7",
        "Engadget",
        "Xbox",
        "DRM",
        "Zunes",
        "a minute",
        "15 plus years later",
        "two",
        "Zune",
        "1089",
        "a few seconds",
        "the Computer Clan",
        "Zune Marketplace",
        "Zune HD",
        "my Zune HD",
        "3.1",
        "20%",
        "Steve Ballmer",
        "Astro Studios",
        "Windows Phone",
        "three inch",
        "jack",
        "four",
        "one",
        "Cesar Menendez",
        "three days",
        "$289 million",
        "576p",
        "Earth",
        "September 16th, 2008",
        "Minesweeper",
        "249.99",
        "two years",
        "Zune",
        "June, 2012",
        "Microsoft Windows CE",
        "Stopwatch",
        "November 13th, 2007",
        "November 15th, 2015",
        "UI",
        "Zune Pass",
        "AV",
        "r/Zune",
        "5.6 ounces",
        "3.2 inches",
        "2004",
        "MDL",
        "the Zune 80",
        "80 gigabyte",
        "years",
        "Apple",
        "J Allard",
        "the last 30 hours",
        "Jimmy] Apple",
        "Windows CE",
        "16 gigabyte",
        "7,500",
        "11 days later",
        "Zune Insider",
        "Nano",
        "the first quarter",
        "four hours",
        "Zune Social",
        "3.3",
        "120 gigabyte",
        "349",
        "100%",
        "3 1/2 hours",
        "Leo Laporte",
        "14.99",
        "100 million",
        "Zunes",
        "first",
        "4",
        "Microsoft",
        "four or eight gigabytes",
        "26%",
        "64",
        "Windows 8",
        "Component AV Cable",
        "iTunes",
        "July 10th, 2006",
        "Galaxy",
        "64 megabytes",
        "$137 billion",
        "A few months",
        "three",
        "128 megabytes",
        "iTunes 10.5",
        "the \"How Technology Works",
        "Hexic",
        "CC",
        "2009",
        "$220 and $",
        "250",
        "480x272",
        "non-Apple",
        "the Zune HD",
        "iTunes",
        "Seattle",
        "Cesar",
        "Metro",
        "iPod",
        "XNA Game Studio",
        "CE",
        "30 days",
        "about $30,000",
        "Phone OS",
        "today",
        "Groove Music Pass",
        "a November 19th, 2008",
        "MSN",
        "Model 1089",
        "September 14th, 2006",
        "Zune HD's",
        "SDK",
        "3.3 inch",
        "290",
        "April 9th, 2010",
        "all 12 years old",
        "Today",
        "Argo",
        "the Zune Pad",
        "thousands",
        "the Portable Media Center",
        "Segoe",
        "2048",
        "Windows",
        "10",
        "Windows Phone 7's",
        "FCC",
        "Toshiba",
        "4.8",
        "2.5-inch",
        "iPhone",
        "Portable Media Center",
        "2.4x4.4x0.58 inches",
        "October 3rd, 2011",
        "2011",
        "the Computer Clan",
        "1.8 inches",
        "a year prior",
        "69%",
        "March 14th, 2011",
        "8 1/2 hours",
        "November, 2006",
        "annual",
        "the Zune Marketplace",
        "32 gigabyte",
        "third",
        "200",
        "iPod Nano",
        "30",
        "2022",
        "eBay",
        "the Apple Goliath",
        "Office",
        "One month later",
        "12 hours",
        "30 gigabyte",
        "99 cents",
        "Jim Kramer",
        "the Fluent Design System",
        "Texas",
        "Halo",
        "NVIDIA",
        "2008",
        "two years later",
        "Zune HD",
        "about 33 hours",
        "RAM",
        "20 million",
        "the Zune HD",
        "Three years",
        "five",
        "four years",
        "second",
        "1.0",
        "Crazy Ken",
        "Compact Embedded",
        "Elite Obsolete Electronics",
        "2 million",
        "the day"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "TIME",
        "DATE",
        "CARDINAL",
        "EVENT",
        "PRODUCT",
        "TIME",
        "FAC",
        "ORG",
        "PERSON",
        "FAC",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "MONEY",
        "CARDINAL",
        "LOC",
        "DATE",
        "PRODUCT",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "ORG",
        "EVENT",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERSON",
        "TIME",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "PERCENT",
        "TIME",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "MONEY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "LAW",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "FAC",
        "NORP",
        "GPE",
        "PERSON",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERCENT",
        "DATE",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "ORG",
        "GPE",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE"
    ]
}