{
    "id": "ud6uNY5E2wQ",
    "title": "Project Jacquard Smart Jacket: Levi's Commuter Trucker Review",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-10-07T00:40:24Z",
    "video_url": "https://www.youtube.com/watch?v=ud6uNY5E2wQ",
    "category": "Science & Technology",
    "tags": [
        "project jacquard review",
        "smart jacket",
        "levis commuter trucker review",
        "levis commuter trucker with jacquard by google",
        "smart clothing",
        "wearable tech",
        "digital jacket",
        "jacquard",
        "mrmobile",
        "michael fisher"
    ],
    "views": 115716,
    "likes": 4632,
    "comments_count": 257,
    "description": "When you hear the term wearable technology, probably the first thing that springs to mind is a smartwatch - or Snapchat Spectacles, or even that crazy FrontRow Camera I reviewed a while back. But if you take the term at its most literal  well, you get something like the Levis Commuter Trucker, the first wearable technology from Googles Project Jacquard and my first \"smart jacket.\" Basically speaking, it's a denim jacket with some incredibly smart Google technology sewn in  but while its potential is huge, so is its price tag. Join me for the first MrMobile review of a Project Jacquard smart jacket!    [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  Levi's Commuter Trucker smart jacket with Jacquard by Google:   TYLT Energy Pro Charging Backpack:   Bose QC35 Noise Canceling Headphones:   Starfleet insignia badge from Star Trek Discovery by Quantum Mechanix:   Hyperdrive USB-C Adapter for MacBook Pro 2017:   Microsoft Surface Pro 2017:    [ABOUT THE PROJECT JACQUARD REVIEW/LEVI'S COMMUTER TRUCKER REVIEW]  MrMobile's Project Jacquard Review was produced following seven days with a retail Levi's Commuter Trucker jacket with Project Jacquard, purchased by Mobile Nations at Concepts in Cambridge MA. The smart jacket was paired with a Google Pixel and an LG V30.    [MUSIC]  Home Organ by Zach Nicita, available at Premium Beat:   No Major Delays by Julian Bell, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/3hl",
        "http://mrmobile.tech/3hn",
        "http://mrmobile.tech/3hp",
        "http://mrmobile.tech/3ho",
        "http://mrmobile.tech/3hm",
        "http://mrmobile.tech/3hq",
        "https://www.premiumbeat.com/royalty_free_music/songs/home-organ",
        "https://www.premiumbeat.com/royalty_free_music/songs/no-major-delays",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Announcer] When you hear the term, wearable technology, probably the first thing that springs to mind is a smartwatch or Snapchat Spectacles, even that crazy Frontrow camera I reviewed a while back. But if you take the term at its most literal, well you get something like this. I'm Mr. Mobile and this is the Levis Commuter Trucker, the first wearable technology from Google's Project Jacquard, and my first digital jacket. Okay, first and foremost, if you've ever tried on a good quality denim jacket, you already know what wearing this one feels like. It's lined, too, with a comfortable mix of soft polyester and elastane, it's got plenty of pockets for your stuff, and a dropped hemline around back for preventing Al Borland disease. Also, in keeping with its name, well this is built for commuters, it's got strategically placed reflective strips to keep you from getting creamed by a car while you're on your bike or walking to work. Aside from an annoying tendency for the pocket zippers to get stuck in their hideaway folds, this is a really solid and comfortable jacket. Even for a guy who doesn't usually do denim. So where's all the technology? Well it's confined to a small area, which is good because that means the rest of the jacket is free for whatever adornments you want to add. Specifically, the active zone is the left sleeve cuff which features 15 rows of conductive fiber woven into the denim. While these are metallic textiles, they're spun in such a way that they look and feel just like normal thread. Triggering them is as simple as swiping across with your fingers, your gestures are then transmitted to your Iphone or Android phone to make it do things. Doing the transmitting is a weather resistant snap tag which is a flexible little dongle that plugs into a port and tucks into a neighboring slot. It's got a Bluetooth radio to talk to your phone, a haptic motor to buzz your wrist for notifications, and an LED for visual alerts. If that sounds an awful lot like a smartwatch, yup, this jacket is gonna be super redundant for people who already wear one of those. But the snap tag does offer better battery life. Google says up to 14 days depending on usage and my own experience is tracking that pretty closely. After about a week, I haven't even hit 50%. When it does run dry you can plug it in to a USB A port to charge it back up. So once all this is set up, what can you actually do with it? Truth be told, not much, yet. Music control is the big thing. I mean this is for bicyclists or pedestrians who don't wanna fumble on a phone or a wristwatch to skip songs, and it basically assumes that you're wearing your headphones whenever you're wearing your jacket. I've got mine set so that a forward swipe skips a track, a backwards swipe is previous track, and a double tap starts and stops. The app lets you program additional gestures and it'll work with a whole mess of music players. In addition, if you're using turn by turn navigation to get somewhere, the app can be set to tell you your next move in your headphones. You can also set a gesture that prompts Jacquard to tell you the time, or count. I don't really get the counting, but... If you're pressing the jacket into service as a surrogate smartwatch you get about as much usefulness as you could expect from a device with no display. When someone calls you or sends you a text, the snap tag can buzz and light up, and it'll also give you an announcement in your headphones about who's trying to reach you. You can then accept or reject with a sleeve swipe. Also, if you're waiting to hear from someone in particular, you have the option of only receiving alerts from that person. Despite being introduced over two years ago, Project Jacauard still feels like a very early product. What it does, it does well, but I was constantly wishing it could do more, like adjust headphone volume, or integrate with Google Assistant. Or even just serve as a pedometer. And then there's the warranty thing. The jacket is covered against defects for a year but Google recommends you don't wash it more than 10 times in its lifetime. Presumably because of those special conductive threads. Granted most people who actually care about their denim won't wash it often, they'll spot clean instead, and that might seem like an okay compromise to make on the first day you walk out of the store with your fancy new digital jacket, but a year or two later when you're afraid to put the thing in the washing machine because you might break it? You might look back and wish you'd spent your $350 on something else. Especially since you can get almost this exact same jacket without Jacquard for less than half the price. Project Jacquard is much more than just this one product. Google talks about connecting all kinds of garments and accessories with your digital life, and the possibilities are super exciting. But given the high price and limited capabilities at this point, I'd say you're gonna wanna wait and see how much momentum Jacquard is able to develop before putting your dollars in this particular pocket. Hey, speaking of Google I was just over in San Francisco checking out another few products you have heard of, check out TheMrMobile on YouTube to see my hand on coverage of the new Pixel smartphones and the new Pixelbook. And please, subscribe, so you don't miss more mobile tech videos landing every week, until next time, thanks for watching, and stay mobile my friends. - I can't, (laughter) - [Man Off Camera] I'm like, oh he missed. (laughing together)",
    "transcript_keywords": [
        "crazy Frontrow camera",
        "Snapchat Spectacles",
        "crazy Frontrow",
        "Frontrow camera",
        "Levis Commuter Trucker",
        "jacket",
        "springs to mind",
        "camera I reviewed",
        "wearable technology",
        "Google",
        "Google Project Jacquard",
        "Jacquard",
        "Spectacles",
        "Snapchat",
        "Frontrow",
        "Project Jacquard",
        "smartwatch or Snapchat",
        "Commuter Trucker",
        "Levis Commuter",
        "technology"
    ],
    "transcript_entity_values": [
        "the Levis Commuter Trucker",
        "year",
        "Project Jacquard",
        "Project Jacauard",
        "Jacquard",
        "less than half",
        "Al Borland",
        "14 days",
        "the first day",
        "about a week",
        "Iphone",
        "every week",
        "San Francisco",
        "Jacquard",
        "YouTube",
        "USB",
        "Snapchat Spectacles",
        "15",
        "a year",
        "Mobile",
        "first",
        "Google",
        "50%",
        "350",
        "Pixelbook",
        "more than 10",
        "two years ago",
        "one",
        "Android"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PERCENT",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG"
    ]
}