{
    "id": "UdQxMux_cu0",
    "title": "Vega 20 MacBook Pro Review",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-11-21T21:41:01Z",
    "video_url": "https://www.youtube.com/watch?v=UdQxMux_cu0",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "amd",
        "macbook",
        "vega 20",
        "VEGA 16",
        "xps 15",
        "razer blade 15",
        "dell",
        "best macbook",
        "best apple laptop",
        "best laptop for video editing",
        "most powerful macbook",
        "fastest macbook",
        "best laptop",
        "students",
        "college",
        "university",
        "design"
    ],
    "views": 889249,
    "likes": 22147,
    "comments_count": 1847,
    "description": "Dave2D reviews AMD Vega 20 2018 MacBook Pro. Significantly faster performance for certain applications like Adobe Premiere.  Available Here -   With a 6-core i9-8950HK this newly updated MacBook Pro can push out some serious GPU and CPU performance. Vega 20 and Vega 16 are some badly needed graphics upgrades on the 15\" Apple MacBook Pro  Background Music: Fili - Domo  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2Kv0Gul",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going Dave 2d here So the 15-inch MacBook Pros can now be configured at the time of purchase with the new Vega GPUs This one's running a Vega 20 and before I get into performance and stuff like that I want to talk about power consumption because this is very relevant when it comes to Comparing performance of this device with anything else out there MacBook Pros including the 15 inch one are powered by USB C the AC adapter they include in the box is an 87 watt adapter It's not particularly big but there's a limitation to this port you can only feed a 100 watts to it So everyone wants to have that super thin laptop that's running like an RTX 2080 or some like that But you can't power something like that with this everyone's big on USB C charging because it's Universal and awesome But you can only feed so much power through that port something like the Razer Blade 15, a more powerful system, a more powerful GPU, But it needs a significantly bigger AC adapter and it's a barrel plug, does not take USB C alright when Apple announced the Vega 20 They kind of did a pretty stealth announcement with it their website had some seemingly impressive graphs But because it didn't have Adobe Premiere on those charts and I use Adobe Premiere as my regular video editing thing I was not expecting very much from this device because I'm like why not put Premiere in there unless it was not a very impressive performance increase, but it's awesome There's a significantly faster render time on the new Vega 20 compared to the Radeon 560 X from three months ago And it's not just render time its playback the whole system feels significantly faster running this new Vega 20 GPU when you run some other benchmark you can see some very significant improvements over the 560 X and the thing is, that 560 X was a GPU that existed in their Mac books since 2016 like ever since they went to this new style. They've been using that kind of GPU They bumped up the clock speed a little bit every year, but it was the same architecture the new Vega 20 is completely new and it just it finally feels appropriate for 2018 because that 560 X from a few months ago was just so underpowered compared to all the other Windows laptops and Even as someone who prefers Mac OS I just found myself using Windows laptops because that performance difference was way too big to ignore And when it comes to gaming I only played some games native to Mac OS there's a bit of a bump from the 560 X but it's not massive, right? keep in mind that most games are gonna run slower on Mac OS than they would on Windows but The truth is any kind of comparable thin and light Windows gaming laptop is gonna crush the MacBook The thermal performance is a little bit better. I'm noticing a premiere for long renders. It's actually getting slightly lower temperatures The fans aren't any louder but the temperatures are a little bit lower and I'm assuming it's from better Efficiency on the GPU so you have lower GPU temperatures So a lower overall system temperature now the bad thing about this new Vega 20 MacBook is the price. So this thing is now a $350 price increase if you want that upgrade and this is on a device that's already very expensive also for people that owned the original 2018 MacBook Pro from like two or three months ago the existence of this new Vega 20 GPU just, it hurts because that old MacBook is no longer. It's no longer the most powerful MacBook Pro on the market So for people that depend on this stuff for work it's just so tempting to pick this up and really depending on what you do and your Applications and what you plan on doing with it? It might be worth it So here are my closing thoughts: if you're professional and use this for work This is going to make sense for the right application If you're playing games, like you'd have to be a serious baller to buy something like this to play games. But if that's your jam the performance increase on this in games is just not there, but the pricing is- Its not that I'm defending the pricing it's just that you can't get anything like this in the Windows laptop market You can't get a USB C powered device that has this kind of performance in the package like this in Any Windows laptop? It just doesn't exist So the fact that they haven't monopoly on a product like this allows Apple to charge whatever they want. Okay Hope you guys enjoyed this video thumbs if you liked it subs if you loved it? See you guys next time?",
    "transcript_keywords": [
        "significantly faster running",
        "feels significantly faster",
        "Razer Blade",
        "Adobe Premiere",
        "significantly faster render",
        "seemingly impressive graphs",
        "significantly faster",
        "pretty stealth announcement",
        "system feels significantly",
        "Windows gaming laptop",
        "watt adapter",
        "Windows laptops",
        "Vega",
        "faster running",
        "Comparing performance",
        "MacBook Pros including",
        "impressive performance increase",
        "Vega GPUs",
        "super thin laptop",
        "Windows laptop market"
    ],
    "transcript_entity_values": [
        "two or three months ago",
        "MacBook Pro",
        "2080",
        "MacBook",
        "Dave",
        "350",
        "87 watt",
        "GPU",
        "AC",
        "Mac",
        "USB C",
        "Apple",
        "15 inch",
        "20",
        "15-inch",
        "Vega 20",
        "MacBook Pro",
        "2018",
        "Adobe Premiere",
        "MacBook Pros",
        "560",
        "Windows",
        "2016",
        "three months ago",
        "MacBook",
        "a few months ago",
        "15",
        "Mac",
        "Vega",
        "100 watts"
    ],
    "transcript_entity_types": [
        "DATE",
        "EVENT",
        "DATE",
        "FAC",
        "PERSON",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "LAW",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "QUANTITY"
    ]
}