{
    "id": "uDzMn9tfFUI",
    "title": "RangeXTD - Not 100% a Scam, But Very Fishy - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2021-01-22T16:59:41Z",
    "video_url": "https://www.youtube.com/watch?v=uDzMn9tfFUI",
    "category": "Science & Technology",
    "tags": [
        "RangeXTD - Not 100% a Scam But Very Fishy - Krazy Ken's Tech Talk",
        "RangeXTD",
        "Knock-Off",
        "Scam",
        "WiFi Repeater",
        "AirPort Extreme",
        "Modem",
        "Router",
        "ISP",
        "Internet",
        "Network",
        "WiFi Extender",
        "WiFi Booster",
        "Wireless Internet",
        "WiFi",
        "Computer",
        "Tech",
        "Apple",
        "Mac",
        "macOS",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer Clan",
        "Joe's Computer Museum",
        "Fake Reviews",
        "CNBC",
        "Amazon"
    ],
    "views": 461751,
    "likes": 15409,
    "comments_count": 1337,
    "description": "Get your Anker Nano and start charging 3 faster than the 5W iPhone brick! Click here:  The RangeXTD is claimed to have been invented by a \"quantum physicist,\" so it HAS to be good, right? Apparently, this device can help you take back control from greedy Internet companiesand the \"totally legit\" reviews seem to back that claim up! Let's see how well it really works  Watch more scam-busting episodes   Download our epic wallpapers   Support our channel and get cool stuff    Subscribe and listen to our podcast   Subscribe for more tech videos!    Follow us on Twitter   Like us on Facebook    Krazy Ken's Tech Talk - RangeXTD - Not 100% a Scam, But Very Fishy  Big thanks to @JoesComputerMuseum for helping write this episode! Check out the CNBC video featured in this episode     Patrons got to see this episode early (and in much higher playback quality). They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #KrazyKen #ComputerClan",
    "description_links": [
        "https://amzn.to/3l4s2I0",
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1riKzQK3dHt6c9_6D2lVwr78",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "https://anchor.fm/computerclan",
        "http://subscribe.thecomputerclan.com",
        "http://twitter.com/thecomputerclan",
        "http://facebook.com/computerclan",
        "https://youtu.be/Mq_Ksga9uHY",
        "http://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- Sponsored by Anker Nano. Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken and today we're gonna be taking a look at the RangeXTD 3, a product that was created by a quantum physicist. I don't even know where to begin with this idiocy, honestly. I mean, if you're a quantum physicist and you're now inventing cheap, fishy WiFi repeaters, man you've really stepped down in your career. I've received many messages about these types of repeaters and extenders, but the first one I recall receiving was from @snowTerabyte on Twitter. And don't worry, I would love to cover other wireless type things, especially those stupid faraday cages for routers or those 5G blockers, I would love to talk about that stuff in future episodes but that's for a later day. Anyway, right off the bat, I won't say this is 100% a scam, because one, it actually exists. And two, it actually arrived pretty quickly. I think it delivered to my place in about two weeks, so that's not too bad, but the problems lie in the reviews, the fake reviews and the very misleading advertising. So let's go ahead and dive in to what the RangeXTD is, but more importantly, what it isn't. The RangeXTD product video claims this quantum physicist was tired of hearing how much his friends were paying for internet access, so he decided to create a revolutionary new WiFi device, or as they like to say, technology device, which is groundbreaking, and it will help you eliminate expensive internet bills and take back control from greedy internet companies. A little overdramatic, but okay, what's wrong with this? Well, first off, this isn't a revolution. This isn't anything groundbreaking. It's a WiFi repeater, they're pretty common. Also these aren't new, WiFi repeaters have been around for at least 20 years. And second, the inventor that is featured in this product video, doesn't exist. Also, you never see him in the same shot as the product. That's a huge red flag, and also a simple reverse search shows he's merely an actor in a bunch of stock footage clips. So the whole backstory is fake. It's a clever trick though. If a consumer isn't conditioned to pick up on that fakeness, they're gonna watch the video and consume the story and merely react on impulse and emotion. That's another reason why the product video talks about the greedy internet companies. They made this enemy which is easy for any consumer to hate. And the advertisers are doing that intentionally, they know better. And they're saying, \"Hey, join this movement against these greedy people.\" That's something that anybody can get on board with who wouldn't want to be a part of that movement? People like feeling like they're part of something. And as a seller, if I can warm up my audience like that, I'm gonna be able to convert them and make them purchase my product much more easily. So be careful out there. Sometimes these fake stories will have disclaimers in them, so always be on the lookout for those. And I still think it's unethical to make a fake story in the first place, but if a company wants to do that and they at least include a disclaimer, well, I guess you can get half a brownie point. So that kind of crap was already triggering my (BS) detector but there was something else that was bothering me this whole time. The reviews. Now, fair warning. We're about to go on a little bit of a rabbit hole here but I think it's important because this is a recurring issue, we've seen multiple times during these episodes, and I think it's finally time that we dive deeper into it. I've dealt with fake reviews on many past episodes but something I've seen repeatedly is an average rating of 4.6. There's no way that could be a coincidence. And then I saw a CNBC video that talked about Amazon's fake review problem. And in the thumbnail for the video was the number, you guessed it 4.6. I was now convinced this is not a coincidence. So I was intrigued. Unfortunately, the video didn't explain where the 4.6 comes from and I still can't figure it out. There's probably some mathematical reason as to why it happens, but, that aside, the video had a lot of other good nuggets in it. It's hard to trust many written reviews on websites like Amazon, especially Amazon and Amazon has worked to limit this, but let's be real, they're working with hundreds of millions of products, so things are going to slip through the cracks. Fraudsters will make bot programs and they will use open-source technologies technologies that are available to anybody, to make this stuff happen. And the bots will leave fake reviews that sound like English. They're programmed to sound like a human and they'll click star buttons and rating buttons, and this is also done by usually low paid workers. This isn't just a thing that robots do. Humans are doing this stuff generally in a click farm setting, where there's a bunch of people with a bunch of phones and a bunch of computers tapping on things. And the fact that this whole review problem exists, especially the click farm stuff. The fact that this stuff exists, makes me a little upset. Personally, I just think rating and review systems on all websites for any product listing, honestly should just be abolished, particularly on Amazon, because it's impossible to police everything right now. Why even bother? Review systems are abused so much. They've been turned into a form of marketing and advertising really. And they've been weaponized, which is scary. So why even bother? Let's get back to reality here, Krazy Ken, we know that's not gonna happen, so we'll just move on. That's why more or less I don't treat online written reviews seriously. I may skim them once in a while, but that's it, and I highly recommend you do the same as well. And if you really truly need to find more written reviews for something, cross check them with another website and see what those writers are saying too. Don't just treat them from one website as the one and only truth. So getting back on track again. This isn't the worst scam I've ever looked at. It's okay, because it actually arrived, and it arrived quickly, but the fake reviews and the fake video and the misleading ads and statements, that stuff just made me very wary of the company. And I wouldn't trust them, but you know what? Despite that I went ahead and bought one. Like many other sites I've used before on the show, the checkout pages littered with fake loading bars, bogus discounts, and annoying posts transaction upsells, trying to get you to buy more products but surprised there weren't as many pop-ups as I usually see with other products, you get a thumbs-up. But then they emailed me and texted me relentlessly with marketing offers after I made the purchase. So I'm gonna have to take some points off, but speaking of points, there's maybe a few points they can get back. There's a little bit of redemption here. Despite the BS claims in their product video, to RangeXTD's credit, they do say your internet speed is only as good as the hardware it runs on. And to an extent that is true, which leads us to the next thing I wanna talk about. Let's take a look at what this thing actually is and then, we'll test it out and see how well it actually performs. The RangeXTD 3, is a WiFi repeater. Sometimes this is referred to as an extender, depending on who you ask. This type of device helps extend wireless internet access into other areas of your home, which may be a dead zone. And they're receiving a weaker WiFi signal, due to distance from the router or other obstructions. How is this achieved? The WiFi repeater receives a wireless signal from your router, and then it broadcasts its own signal, relaying the information it received, and rebroadcasting it. It's important to note that it's not magically amplifying the original signal, so when you connect to the extended signal, you're actually not connecting to your router at all, but instead you're connecting to the extender. On the inside of this RangeXTD product, there's a Pix-Link board with two antennae and MediaTeK radio right here. Overall, pretty simple internals. So that's the basics as to what this is and how a WiFi repeater works. Now in practice, how well does this particular thing work? Well, let's test it out. First impressions weren't that great, because the box was slightly crumbled and it had a hole in it, not a huge deal, but issues like this, just make the whole experience feel cheap. The RangeXTD itself can be used in three modes. Access point, repeater and router. My main focus for this test is the repeater feature, so that's what I used. The specs say it can provide wireless speeds up to 300 megabits per second, which is only a fraction of my router's 1.3 gigabits per second rate. So I plugged in the extender at a near halfway point between my router and my iMac. Then I connected to it with the provided IP address and logged into the portal. The setup wizard was very reminiscent of early builds of windows eight. I was also amused by the internet Explorer and Microsoft office icons, they just hijack those designs from Microsoft and put them in their software. Yeah, I mean, who cares about intellectual property anyway? I added my network to the list, put in the password and boom, the setup was actually quite painless. But now, it's time for the speed test. Without RangeXTD, my speed test peaked around 430 megabits per second down and ended on 224. The upload speed clocked in at 20.8. So then I ran the RangeXTD speed test, and I got 15. And just a reminder, they value this thing at $99. The upload speed, however wasn't affected much, so thumbs up there. So overall pretty disappointing results. There's maybe some different things I could have tried to get the speed to be better, but you saw the numbers, even if I would have quadrupled the down speed, I wouldn't have gotten close to what my router can normally give me. And personally, I've never used a WiFi repeater, I never saw them useful for myself. Honestly, if you live in a bigger house and you have problems connecting to your central router I highly recommend wiring access points through your house. That's gonna give you a much better result than using these things anyway. So if you really need to extend your signal reach, do it the right way, wire your access points. And personally, I'm still using my AirPort Extreme. It is about eight years old, but it can still provide blazing fast speeds. Even multiple rooms downward my offices, through walls, through closed doors. The router still works fine, no need for a WiFi repeater here. And before we continue, I do wanna thank a few awesome people who helped me write this episode. One of my viewers, Luke, thank you, and also Joe, from Joe's Computer Museum, thank you guys very much for helping out. And on that note, if anybody watching this is a subject matter expert on wireless communications, I would love to work with you on a future episode, because I want to debunk things like those 5G blockers and stuff like that, so I think that'd be a lot of fun, and if you wanna collaborate with me, feel free to send me a DM on Twitter, or you can email me to all of my contact info is down below in the description. Also, I wanna thank our sponsor, Anker, for making this episode possible. And believe me, their stuff works way better than this knockoff stuff, oh yeah. Compared to the original 5W iPhone charger, the anchor nano can charge three times faster, but it's about the same size and it can even charge an iPhone 11 to 53% in just 30 minutes. And Hey, if you buy a new iPhone 12 which doesn't come with a charger brick in most countries, the Anker Nano is the perfect solution. Anker also has a two port wall charger with dual USB-C ports. So you can charge your laptop and iPhone simultaneously, for example. It's also ultra compact and includes interchangeable plugs for use in the U.S, U.K and Europe. So if you're sick of slow charging, Anker is the way to go. So go ahead and click the link in the description to get your own anchor chargers right now, and when you do use that link you're also supporting the Computer Clan YouTube channel, so thank you very much for your support and thanks again Anker, for partnering with us and making this episode possible. So that's the RangeXTD. Not the worst product I've ever looked at on the show, but definitely not the greatest either, of course, so let me know what you think and also feel free to subscribe for more tech episodes coming out every week, usually on Thursdays, I do have a knockoff pair of the AirPods Pro Max coming soon too, so that's gonna be a lot of fun. I also am working on a follow-up to the UVLEN scam and I'll also be releasing soon, a retrospective about one of the rarest Macintosh computers that Apple ever sold. So lots of fun stuff coming. And if you'd like to help me buy more knock-off crap, plus get some cool perks along the way, feel free to pledge to my Patreon, thanks in advance for your support. And Hey, if you liked this episode, you know what to do. Thanks for sticking with me, catch the crazy, and pass it on. (upbeat music)",
    "transcript_keywords": [
        "WiFi repeater",
        "product",
        "fake reviews",
        "product video",
        "reviews",
        "video",
        "fake",
        "WiFi",
        "stuff",
        "RangeXTD",
        "router",
        "repeater",
        "speed",
        "Amazon fake review",
        "Anker",
        "Amazon",
        "things",
        "internet",
        "RangeXTD product video",
        "RangeXTD product"
    ],
    "transcript_entity_values": [
        "Joe's Computer Museum",
        "53%",
        "99",
        "Luke",
        "RangeXTD",
        "up to 300 megabits",
        "windows eight",
        "half",
        "5W",
        "the AirPods Pro Max",
        "Explorer",
        "the RangeXTD 3",
        "around 430 megabits",
        "just 30 minutes",
        "every week",
        "two",
        "Apple",
        "IP",
        "3",
        "Anker Nano",
        "about eight years old",
        "about one",
        "224",
        "Europe",
        "Macintosh",
        "Patreon",
        "4.6",
        "today",
        "at least 20 years",
        "Krazy Ken",
        "the Anker Nano",
        "U.S",
        "100%",
        "1.3 gigabits",
        "Anker",
        "English",
        "Joe",
        "about two weeks",
        "first",
        "a later day",
        "Microsoft",
        "my AirPort Extreme",
        "Amazon",
        "Anker",
        "5",
        "iMac",
        "UVLEN",
        "One",
        "U.K",
        "20.8",
        "15",
        "iPhone",
        "MediaTeK",
        "First",
        "second",
        "Twitter",
        "hundreds of millions",
        "Thursdays",
        "three",
        "CNBC"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERCENT",
        "MONEY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "EVENT",
        "QUANTITY",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "GPE",
        "PERCENT",
        "QUANTITY",
        "PERSON",
        "LANGUAGE",
        "PERSON",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG"
    ]
}