{
    "id": "Uf1Y7hWZU9g",
    "title": "Samsung Galaxy S9 vs iPhone X!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-03-09T15:27:09Z",
    "video_url": "https://www.youtube.com/watch?v=Uf1Y7hWZU9g",
    "category": "Science & Technology",
    "tags": [
        "samsung s9",
        "galaxy s9",
        "samsung galaxy s9",
        "iphone x",
        "iphone",
        "galaxy",
        "apple",
        "samsung",
        "apple iphone x",
        "samsung galaxy s9 plus",
        "galaxy s9 plus",
        "galaxy s9 vs iphone x",
        "galaxy s9 vs iphone 10",
        "iphone x vs samsung s9",
        "iphone x vs s9",
        "iphone vs galaxy",
        "iphone vs android",
        "s9",
        "samsung galaxy s9 vs iphone x",
        "iphone x vs galaxy s9",
        "smartphone",
        "android",
        "review",
        "austin evans"
    ],
    "views": 934052,
    "likes": 20358,
    "comments_count": 4640,
    "description": "The Samsung Galaxy S9 Plus and Apple iPhone X are here but which is better? Building the Ultimate iPhone X:  Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "https://www.youtube.com/watch?v=npOwGSilebc",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- This is the Samsung Galaxy S9 and S9 Plus, you're getting an improved camera, better internals, but at the cost of looking pretty much identical to the Galaxy S8. In fact, the S9 looks so much like the Galaxy S8, that this is a Galaxy S8, but I bet you couldn't tell. On the other hand, we have the iPhone X, now at $1000, this is one of the most expensive smartphones ever made, and thankfully, Samsung didn't take the bait and left the Galaxy S9 priced at a cool $720. My real question, though, can such a minor update actually compete with the iPhone? One look and you can see that Apple and Samsung are going after the bezel-less trend in two very different ways. So with the S9, the bezels are small but noticeable on the top and bottom of the display, move over to the iPhone and there's basically no bezels to be seen, except for the notch. To be honest, I don't have a huge preference, so the iPhone X notch doesn't bother me that much, but it does rob you of a little bit of screen real estate, which can be important when you're talking about a smartphone. Now with the S9, you're really not going to be losing anything, but it also lacks that sort of distinctive look of the iPhone X. It's kind of up to you, honestly I think the cleaner look of the S9 does it for me, though. While the S9 looks very similar to the S8, Samsung did make some minor tweaks that you can notice once you actually get it in your hand. So one of the big ones is that there's a little bit more of a well-defined edge on the actual frame of the phone, so especially when you consider that this is an all-glass phone with sort of curved glass front and back, it's nice to have just a little bit more grip on it, although to be fair, it's still going be a very slippery phone and you're probably going to want either a bumper, case, or a skin on this guy. In contrast, the iPhone, well it just doesn't look quite as impressive. Sure, you're getting the notch, but the completely flat panel just doesn't look as cool as the S9. However, instead of opting for aluminum like Apple always does, instead they upgraded this year to stainless steel, and I've gotta say, it works. It adds some welcome heft to the design, which when you combine it with the all-glass metal build really does make this feel like a very premium product, which is good when you're spending $1000 on a phone. Now one minor downside is that because it is going to be very polished stainless steel, it's really easy to get minor scuffs on it, but thankfully it's not going to be that difficult to buff these out. To the surprise of exactly no one, these phones have a lot in common. First of which is water-resistance. While the iPhone X is IP67 rated, the Galaxy S9 is slightly better at IP68, now what this really means is that if you say, go get tossed in a pool or something with your phone it's going to be fine, but for the most part this is a really nice thing to have when you're spending this much money on a smartphone. It should pretty much be a standard thing on flagships these days. You're also getting an almost identical stereo speaker setup, so both phones have a single bottom-firing speaker as well as a second front-firing speaker that doubles as the earpiece. Now it might not look all that impressive, but these both sound a lot better than just the single speaker. It's hard to pick a clear winner here, the S9 does get a bit louder, especially once you enable the ATMOS setting, however, it's at the expense of a little bit of clarity. Personally I think the iPhone X sounds a little bit richer, but it is going to be quieter. At the end of the day, though, it is really splitting hairs, both of these phones sound pretty solid. One area where the S9 definitely wins, though, is with the headphone jack, it actually has one. Considering that this is basically a dead feature in flagship phones today, big props to Samsung for actually keeping it around. Now no, it's not going to be some crazy high-end hi-fi DAC like you're going to be getting in the LGV30, but it sounds totally fine and I think a lot of people are going to appreciate having this around in 2018. Another advantage of the S9 is the fingerprint sensor. Now not only is it back this year, but unlike on the S8 where it was in this awkward spot beside the camera where you couldn't really reach it and it was easy to miss, this year it's going to be below the camera and slightly raised from the body of the phone, making it a lot easier to feel without actually having to go look at the back of your phone every time. It's just as fast as you would expect, and while I like how fast Face ID is on the iPhone X, there are definitely times where I prefer having an actual fingerprint sensor like on the S9. That being said, the S9 does have its own version of Face ID, so it's kinda similar to the setup in last year's Galaxy Note 8 in which it uses not only facial recognition but also iris scanning and it kind of works, it's reasonably quick but still nowhere near as fast as Face ID on the iPhone X and it's also not going to be the most secure thing in the world. This setup on the Note 8 has been easily fooled a million times, whereas at least on the iPhone you're getting something that's going to be reasonably secure. That shows in Samsung's confidence in their own system. Where Apple is perfectly happy to allow you to use Face ID to unlock apps or even pay for things with Apple Pay, Samsung conveniently asks for your fingerprint instead of facial recognition when you're actually using Samsung Pay. Move around to the displays, and there's no question, These are the two best panels on a smartphone you can buy today. I have the larger Galaxy S9 Plus here, which is rocking the 6.2 inch display, but if you opt for the standard S9, you're getting a 5.8 inch panel which is the same size as what you're getting on the iPhone X. Both are very similar, which makes sense, as Samsung is the one who makes AmoLED panels for both Apple as well as Samsung themselves. Now what you're getting here is supposedly a slightly brighter screen on the S9, they're claiming about 15% brighter than on the S8. The real use, especially one you actually tweak some of the color profiles on the S9, they are almost identical-looking. Inside, things get a little bit more interesting. Where the iPhone X is rocking the Apple A11 Bionic chip, here in the United States you're going to be getting a Galaxy S9 with that new Snapdragon 845, or for the rest of the world, it's going to be powered by a Samsung Exynos 9810 processor. Jumping to Geekbench, and you're going to see a nice performance uplift over the Galaxy S8, however especially when you compare to what you're getting in the iPhone X, it's just not even going to be close. Single thread performance especially is going to be much much faster on the iPhone. Now sure, benchmarks aren't always representative of what you're going to be seeing in the real world, but when you look at Geekbench and you see something like nearly twice the single thread performance, that is something that you are definitely going to notice. In my experience, the only phone that comes close is the Pixel 2, and that's entirely based on Google's awesome optimization job, which makes sense considering that they make Android. Now a big part of me feels like if Samsung was a little bit lighter with their skin, things would be a little bit of a different story. I will say, though, that unlike in previous years, it feels like Samsung actually paid some real attention into polishing up the software. So a lot of those little design inconsistencies that you used to find in Galaxy software is nowhere to be found, and the Galaxy launcher itself is pretty solid, but when you dedicate an entire hardware button as well as the left side of your home screen to Bixby, a feature that I would argue most people find less useful than Google Assistant, which is also preinstalled on the phone, then it's hard to argue that Samsung has really stepped that far away from their old ways of slapping bloatware on the phone. That comes across to the bizarre inclusion of a lot of weird Android apps that are sort of duplicated thanks to Samsung. So things like the Samsung email client, or Calendar, or even the Samsung browser all feel really out of date in 2018. Now sure, there's nothing stopping you from jumping into the Play store and downloading the stock Android versions of these apps, but just why do they exist? Like seriously, why? Move over to the iPhone X, and while iOS 11 might not be all that new or exciting right now, thankfully over the last few months, they have polished up a lot of the bugs and it feels like a much more cohesive setup. Now sure, there are still some weird design choices, like hiding your notifications as well as your control center behind two very similar swipes based on where you are at the top of the display, but it's really hard to look at the S9 and the iPhone X and not be impressed with just how much Apple was able to do with this guy and how Samsung just hasn't really been able to keep up. It's close, but the performance and especially the polish is just top-notch on the iPhone. Get it? Top notch? Something else the iPhone has the advantage with is battery life. The Galaxy S9 is pretty solid, it usually lasts me through a full day, however with the iPhone, I regularly used it for the entire day and still put it on the charger with 30% or 40% left. It is a big step up over previous generations. While most of the upgrades on the S9 have been fairly minor, the biggest one is definitely with the camera. The most obvious change is the addition of a telephoto camera on the Galaxy S9 Plus, nicely matching what you're able to get on the iPhone X. This isn't going to be on the standard Galaxy S9 but it's a solid addition. Not only is it going to be nice to get that extra focal length, but in my opinion I think it actually looks a little bit sharper than what you're getting on that iPhone X. The real star of the show, though, is that new main camera, which is going to be shared with both the S9 and the S9 Plus. It's an all-new 12 megapixel sensor that has stacked DRAM on the chip. Not only does this speed things up, but it also enables some pretty cool new features. This enables a new 960 frames per second slow-motion mode, albeit in 720p. Now yes, it's going to be a little bit soft, and you need a lot of light to actually make this look good, but if you can time it right, it can look really really nice. Low light performance has also been improved thanks to the addition of a new mechanical aperture. Now not only is this going to be pretty much a first on a major smartphone, but it gives you two options, for standard photos you're getting an f2.4 aperture, when you get into a low light situation, it can open up all the way to f1.5. f2.4 is what the camera will default to and it looks good, it's a nice blend between getting a nice bit of sharpness as well as actually letting enough light into the camera. However, if you get into a really low light situation or you switch over to Pro mode and manually enable it, you can open it up to that full f1.5. The results are really impressive. With that wide aperture, as well as Samsung's new multi-shot processing, which will allow up to eight photos to be taken and combined into one to reduce noise, it looks really really good. Now yes, you're going to be giving up a little bit of sharpness here, but for the most part there's really not much to complain about, you get this guy in low light it's gonna look awesome. Now for outdoor shots, Samsung does get a little overagressive, especially when you look at the saturation as well as the sharpness, but compares really well to the iPhone X, especially if you don't want to edit your photos. The front-facing camera on the Galaxy S9 is pretty wide and it still looks nice, right Ken? (laughs) In comparison, the iPhone X front-facing camera is fine, but it's not quite as wide-angle, which especially for selfies is really helpful. Where things get a little bit more one-sided is with AR Emoji vs Animoji. So this is what AR Emoji looks like on the Galaxy S9, kind of creepy right? So essentially, this is very similar to what you're getting on Animoji on the iPhone, except it's just not as well done, mostly thanks to the lack of face tracking as well as it's just going to be a little unsettling, especially when you make your own like I did. And this is what an Animoji on the iPhone X looks like. Now no, I can't make my own custom emoji, but as you can see, especially with the front-facing camera and the Face ID tech to actually track my face, the level of detail here is really impressive. Much much more so than the AR Emoji. The Galaxy S9 is the best smartphone that Samsung has ever built. It takes a lot of what was great about the S8 and subtly improves it in some ways and majorly improves it when it comes to the camera. It also does this at a significantly cheaper price. Where the S9 comes in at $720 unlocked, that iPhone X at $1000 is definitely going to hurt the wallet. That said, the days of the Galaxy being the obvious answer if you wanna get a high-end Android flagship are definitely over. The Pixel 2 still has a lot of advantages over the S9, even though it's going to be a little bit older, and when you compare it to the iPhone X, what you're getting on that phone, if you can of course overlook the eye-wateringly expensive price, is excellent performance, good battery life, polished software, it really is a solid package. The Galaxy S9 is a great phone, but for me it just can't quite match the iPhone X. So I'm curious, what do you guys think about the S9 versus the iPhone X? I'm sure there are going to be lots of wonderful comments all about the merits of each phone and not fanboys or arguing at all. Let me know in the comments below and I will catch you in the next one.",
    "transcript_keywords": [
        "iPhone",
        "Samsung",
        "Galaxy",
        "bit",
        "phone",
        "Samsung Galaxy",
        "camera",
        "Apple",
        "lot",
        "Face",
        "year Galaxy Note",
        "pretty",
        "nice",
        "Galaxy Note",
        "Samsung Pay",
        "phones",
        "things",
        "make",
        "Samsung Exynos",
        "real"
    ],
    "transcript_entity_values": [
        "5.8 inch",
        "a full day",
        "this year",
        "2",
        "12 megapixel",
        "last year's",
        "Calendar",
        "iPhone",
        "iOS 11",
        "2018",
        "previous years",
        "The Galaxy S9",
        "Animoji",
        "the entire day",
        "Samsung Galaxy S9",
        "the Galaxy S8",
        "Apple Pay",
        "Google",
        "first",
        "the United States",
        "the Galaxy S8",
        "720",
        "Samsung",
        "jack",
        "Ken",
        "6.2 inch",
        "two",
        "the S9 Plus",
        "Apple",
        "the end of the day",
        "the last few months",
        "polish",
        "iPhone X",
        "S8",
        "S9 Plus",
        "these days",
        "one",
        "Geekbench",
        "30% or 40%",
        "second",
        "Snapdragon 845",
        "S9",
        "the Galaxy S9",
        "Galaxy",
        "a Galaxy S8",
        "A11 Bionic",
        "the Galaxy S9 Plus",
        "AR Emoji vs Animoji",
        "Galaxy S9",
        "the AR Emoji",
        "1000",
        "buff",
        "the days",
        "about 15%",
        "Bixby",
        "S9",
        "One",
        "up to eight",
        "Galaxy Note 8",
        "960",
        "the Galaxy S9",
        "The Galaxy S9",
        "today",
        "First",
        "IP67",
        "AR Emoji",
        "Android"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "EVENT",
        "ORG",
        "LAW",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "DATE",
        "PRODUCT",
        "FAC",
        "ORG",
        "ORG",
        "ORDINAL",
        "GPE",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "NORP",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "DATE",
        "PERCENT",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "ORG"
    ]
}