{
    "id": "ufW1Ogsq83o",
    "title": "Redmi K20 Pro Durability Test! - Is Value Worth it?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-09-06T10:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=ufW1Ogsq83o",
    "category": "Howto & Style",
    "tags": [
        "redmi k20 pro",
        "redmi k20 pro review",
        "redmi k20 pro drop test",
        "k20 pro",
        "k20 pro durability",
        "k20 pro scratch test",
        "k20",
        "budget phone",
        "best budget phone",
        "best cheap smartphone",
        "smartphone",
        "strong phone",
        "unbreakable",
        "android",
        "iphone",
        "oneplus",
        "xiaomi",
        "redmi",
        "poco",
        "techreview"
    ],
    "views": 3374847,
    "likes": 87794,
    "comments_count": 6009,
    "description": "Redmi just released what could be the best budget phone this year! Go to  to take back your Internet privacy TODAY and find out how you can get 3 months free. Thanks to Express VPN for sponsoring this video. The Redmi K20 Pro has specs and a price that could make a flagship phone jealous... So we should compare them side by side. In this durability test video Ill be comparing the Redmi K20 Pro with the Note 10.  They are very similar in numbers and features. Just swap out the s-pen and headphone jack. Of course there are many points to consider when buying a new smartphone... But with SO MANY good phone options out there, 'more expensive' doesnt always mean 'the best'. Let me know what you think in the comments!   What do you think of this red and black 'evil' color scheme?   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://expressvpn.com/jerryrig",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPV...",
        "https://www.youtube.com/user/JerryRig..."
    ],
    "transcript": "The Redmi K20 Pro, something Redmi calls the Alpha Flagship, has been out for a while now, but it's been requested by you guys quite a bit. And since it's one-third the price of a brand new Galaxy Note 10, I figured it was a good time to compare the two and talk about how good inexpensive feature-rich phones are getting. And oh boy does this K20 Pro look crazy. It's kind of like the abyss that Gandalf fell into when fighting the Balrog. Or some freaky glimpse into the upside down. It's time to find out if the K20 Pro is durable. This video is sponsored by ExpressVPN. Let's get started. [Intro] Seriously though, I can't get over this color scheme. It's like if 9 year old me wanted a Charizard themed smartphone. This would have been my number one choice. Nine year old me would also be super pumped about this motorized pop-up camera. I mean, current me is also still pumped about it. Especially because the thing lights up on either side of the lens as it pops out of the frame. If that's not the kind of innovation we've all been waiting for, I don't know what is. The accent lights are only visible from the front and only turn on when the camera is motorizing up and motorizing back down. There's also a very unique sound being made each time the camera moves. This can be changed of course, and there are several to choose from. [Different sounds] I'm going to go with the magical sound because that's what nine year old me would have wanted. [Magical sound] Looking at the K20 Pro you might be wondering if all this loud bling is totally necessary...and it's probably not. But I'm definitely not complaining. The LEDs that shine up into the pop up camera also include a ring on the outside of the phone for notifications and a charging indicator. It'll be cool to see how this whole light contraption works when I take the phone apart to see the inside. Redmi has also included this same drop protection feature that we've seen in the OnePlus and Oppo pop-up cameras, where if the phone senses a fall, it'll start to close the camera automatically. Personally it feels kind of slow. The phone will probably bounce once or twice before the camera retracts, but it's a good thought. Let's get to work. The reason I want to compare this $350 smartphone to a $900 smartphone like the premium Note 10, is because when you look at both phones side-by-side on paper they're eerily similar. Both have the same screen size and resolution. And even though the Note 10 is using Gorilla Glass 6 and the K Pro is using Gorilla Glass 5, they both scratch the same with scratches at a level 6 and deeper grooves at a level 7. Both phones have wall to wall bezel-less screens and nearly non-existent earpieces. Instead of a cheerio cut out in the display like the Note 10 has, this K20 Pro has a 20 megapixel pop-up camera. And the lens that protects the camera is made from glass. The red side LED light up bars are made from plastic - a kind of translucent red acrylic. The whole thing feels very secure though. I'll test this out more in just a minute, but the back of the camera is also made from plastic. He's a happy little guy. The sides of the phone are made from aluminum with a metal volume rocker and a metal power button. If we rotate the phone up here to the top, we get the motorized pop up camera and some more metal. And instead of the s-pen, the K20 Pro has a headphone jack. I'm sure there are a few people who would gladly make that trade. The top of the pop-up camera is made from plastic which is fine because there's plenty more metal on the other side of the phone. The bottom has a loudspeaker, a USB-C port that can quick charge at 27 watts. The regular Note 10 is a 25 watt fast charge. Very similar. And neither the Note 10 nor the K20 Pro has an SD card slot. One perk the $950 Note 10 has over the $350 K20 is water resistance. But since Samsung doesn't warranty or guarantee any of that water resistance, it's more of a helpful perk and not something you should be totally trusting anyway. Even the back panels of the two phones are similar. Both made of a psychedelic glass catering to our inner child. And each phone has three different perspective cameras. A 12 megapixel ultra wide angle at the bottom, a normal 48 megapixel main camera in the center, and an 8 megapixel 2x optical zoom lens up top. These are the exact same perspectives as the Samsung Note 10. The similarities just keep coming. Both phone have under screen fingerprint scanners. Yeah, the Note 10 is an ultrasonic and this K20 is optical, but they both accomplish the exact same thing in basically the same time frame. And both of them can handle being scratched up by level 7 deeper grooves. One perk the K20 has over the Note though is a bigger battery. It's a 4,000 milliamp hour which is quite a bit bigger than the Note 10's 3500. You might be thinking that I'm trying to roast the Note 10, which I'm definitely not. There are software differences of course that need to be taken into consideration and warranties and customer service and durability and camera quality. So many factors go into choosing a phone, but if you need a car to get you to work and back, you probably aren't going to go buy a Ferrari when a Honda Civic will work just fine. The same goes for cellphones. Both the Note 10 and the K20 have 1080p AMOLED displays that recover when the flame is taken away. And both phones are incredibly flashy and good looking. Let's see if the K20 pop-up camera can handle a bit of abuse. I've tested the OnePlus 7 and Oppo Reno pop-up cameras and each time I've been impressed with the mechanical build quality. And so far, this K20 is no different. Rated for 300,000 protrusions like the others, it's probably also being built with the same hardware and design as it's predecessors and can handle me pulling it out and pushing it in with no adverse reactions. The K20 Pro pop-up camera can take a beating. I might make fun of the wispy black and red coloring, but I'm actually glad that phones are getting loud designs. The ring around the camera is an LED by the way. It's just a super reflective colorful coating. Jumping into the bend test. When the K20 Pro is bent from the back, there's a minor flex to the phone, but no creaks or cracks. Flipping it around to bend from the front we get similar results. No flex or permanent damage to the frame. The screen is still fine. The K20 Pro is a solid well-built device with premium materials and I'm a fan. Let's be real. Everyone can choose themselves whether they want to spend $350 to browse social media or spend $1000 to browse social media. Of course there's nothing wrong with buying a $1000 flagship, but it's just good to keep in mind that there are plenty of good options for a fraction of the price that accomplish the exact same thing. Whether it's last year's model or a brand new budget phone like this K20. There are plenty of ways to keep money in your pocket. Don't buy a Ferrari if it makes your wallet hurt. I forget to mention Redmi includes a little protective case in the box which is nice of them. And a very convenient protection related segue to ExpressVPN. Huge thanks to Express VPN for sponsoring this video. Physically protecting yourself is important and protecting yourself online is also important. Any time you're on public Wi-Fi with your phone or computer, you're information is visible...credit card, password information. A VPN is an app that secures and encrypts your data so no one can see your personal information when you're on public Wi-Fi. ExpressVPN can also change your physical location when you're online since they have server locations in over 94 different countries. Since I travel quite a bit I personally use ExpressVPN to access YouTube videos that might otherwise be blocked in the country that I'm visiting. I'm also a huge fan of the fact that ExpressVPN is the only VPN that runs on trusted server which is the industry's most advanced VPN server technology. It works on up to 3 devices simultaneously, no tech skills required, all for less than $7 a month with a 30 day money back guarantee. To take back your internet privacy today and find out how you can get 3 months for free, check the link in the description: ExpressVPN.com/jerryrig. They have 24/7 live customer support which is pretty awesome. ExpressVPN.com/jerryrig. And huge thanks again to ExpressVPN for sponsoring this video. What color scheme would you like to see on your next phone? Go ahead and hit that subscribe button if you haven't already. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Note",
        "camera",
        "Pro",
        "calls the Alpha",
        "phone",
        "popup camera",
        "Pro popup camera",
        "Alpha Flagship",
        "Galaxy Note",
        "phones",
        "made",
        "popup",
        "back",
        "Alpha",
        "Oppo popup cameras",
        "time",
        "good",
        "ExpressVPN",
        "Redmi",
        "cameras"
    ],
    "transcript_entity_values": [
        "900",
        "Honda",
        "Redmi",
        "OnePlus",
        "Express VPN",
        "3 months",
        "3500",
        "a 4,000 milliamp hour",
        "one-third",
        "30 day",
        "Nine year old",
        "6",
        "over 94",
        "8",
        "less than $7",
        "this K20 Pro",
        "SD",
        "up to 3",
        "Instagram",
        "two",
        "Wi-Fi",
        "jack",
        "three",
        "K20",
        "the K Pro",
        "just a minute",
        "nine year old",
        "25 watt",
        "2x",
        "VPN",
        "Oppo",
        "12 megapixel",
        "950",
        "VPN",
        "$350 K20",
        "Ferrari",
        "The K20 Pro",
        "Gandalf",
        "Wi-Fi",
        "10",
        "the OnePlus 7",
        "last year's",
        "Civic",
        "Galaxy Note 10",
        "300,000",
        "1000",
        "the Alpha Flagship",
        "Samsung",
        "today",
        "27 watts",
        "9 year old",
        "Charizard",
        "Oppo Reno",
        "the K20 Pro",
        "One",
        "YouTube",
        "48 megapixel",
        "20 megapixel",
        "USB",
        "the K20 Pro",
        "The Redmi K20 Pro",
        "7",
        "Twitter",
        "350"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "LAW",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "LOC",
        "CARDINAL",
        "EVENT",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "FAC",
        "ORG",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "LAW",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY"
    ]
}