{
    "id": "UFytB3bb1P8",
    "title": "You SHOULD buy Used GPUs - Testing Used Mining Cards",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-02-04T18:20:54Z",
    "video_url": "https://www.youtube.com/watch?v=UFytB3bb1P8",
    "category": "Science & Technology",
    "tags": [
        "mining gpu",
        "cryptocurrencyt",
        "cryptomining",
        "buying used gpu",
        "buying gpu",
        "nvidia",
        "amd",
        "used",
        "graphics card",
        "used electronics",
        "intel used",
        "computer used",
        "used computer",
        "linus",
        "linustechtips",
        "are mining gpus bad",
        "DubbedWithAloud"
    ],
    "views": 2050703,
    "likes": 81490,
    "comments_count": 4360,
    "description": "Try Zoho One free for 30 days with no credit card required here:   Start monitoring your network and servers with Pulseway at   Dont buy used GPUs! A warning weve heard far too many times. But does mining actually harm your GPU? We think not. So we tested 19 different used GPUs from AMD and NVIDIA to determine if cryptomining will make your PC Hardware purchase die on arrival.  Discuss on the forum:   Buy a Used RTX 3080 on eBay:  Buy a Used RTX 3070 on eBay:  Buy a Used RTX 3060 on eBay:  Buy a Used RX 5700 XT on eBay:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   COME TO LTX 2023:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:12 Purchasing Cards 3:30 How We Tested 4:25 Clock Speeds and Thermals 6:52 Gaming Results 8:19 VRAM Performance 8:39 She's Dead, Tim 9:24 Responding to the Media 12:35 Price Used vs New",
    "description_links": [
        "https://www.zoho.com/one/lp/linus.html",
        "https://lmg.gg/PulsewayLTT",
        "https://linustechtips.com/topic/1485946-i-ran-1500-tests-to-prove-the-media-wrong-testing-19-used-mining-gpus/",
        "https://ebay.us/r5HTnJ",
        "https://ebay.us/cy9p69",
        "https://ebay.us/UQqOLl",
        "https://ebay.us/gV6tMN",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- New GPUs are expensive. Ooh, ah, oh my money bone. But the media says that buying a secondhand GPU is risky. Ooh, it's a bad idea. Well, as a ruthless deal hunter, I disagree. And to prove my point, I bought 19 used GPUs to run through our gauntlet of over 1500 tests, settling this argument once and for all. Every one of these GPUs was sourced anonymously from 17 different sellers on eBay. And we looked at everything from clock speeds to performance to thermals. We did run into some pitfalls, but with our help, there's no reason for you to be afraid. So when the time comes to adopt your rescue GPU, you should be able to recognize and maybe even overcome any past abuse, and with the money that you save buying used, maybe you can check out something from our sponsor - Pulseway. Pulseway is a mobile first remote monitoring and management tool built with MSPs and IT teams in mind. To learn more about how you can see and control your network from anywhere, check out the link in the video description. It's always the video description. - When we bought these cards last year, we took a shotgun approach, trying to get a mixture of different brands at a variety of price points. The only requirement was that at some point they had to have been desirable for mining and hard to find for gamers. So we ended up with some Radeon 5700 series cards. These were super power efficient and lower demand compared to the NVIDIA competition, making them some of the most profitable cards for mining. On the green side of things, 3060s were popular thanks to their high VRAM to price ratio and not to mention the failure of NVIDIA's foolish attempt to limit hash rates. And as for 3070s and 3080s, well they were just plain powerful. Now, whenever you're buying used, step one is to talk to the seller. As much as people like to paint crypto miners as evil monsters, and some of them are, the majority of used GPU sellers are just regular people who saw a way to make some extra cash and would happily tell you about the card's history. Step two then is to inspect the product for obvious issues physical damage, wear and tear, scratches, or in the case of a GPU, any loose components, be they fans or capacitors. I'd recommend at this stage giving the GPU a good shake, for real. Then you wanna investigate the source of any of the noises that you hear. Now for obvious reasons, it would be best to do this before handing over your money, like if you were to meet up in person through Facebook Marketplace. But eBay buyer protection is really good these days, meaning that you can do it after the fact. If you use a good marketplace. Just make sure to report any issues with the condition of the product before the time limit runs out. Now most of our cards arrived looking pretty good other than maybe needing a quick blast of compressed air, which seems to support the theory that I've seen many times that miners actually are financially incentivized to take good care of their cards in hopes of maximizing their lifespans. However, we also got a couple that were in questionable condition and that, how do I put this? Kind of smelled. It has kind of a vinegar smell to it. And then there's that MSI 5700 XT with the rattle to it, but that otherwise looks good. Of course, looks is only enough if you're planning to use your new GPUs as bookends. We want to know how they perform. The best way to determine if their performance has been affected by their time in the mines would be to measure these GPUs against identical brand new ones. Unfortunately, however, these are older cards and mint condition ones don't really exist. So the control lines that you see on our charts are going to be from lightly used GPUs from our stock that have spent most of their lives on the shelf. It's worth noting here by the way that we expect some degree of variation between these cards. And the goal here is not to find the winner but rather to see if our used GPUs are performing within spec. A quick and dirty way to check this is MSI Combustor. It takes just a couple of minutes. So it's the kind of thing that you could ask a seller to run before you hand over your money. If your GPU is significantly degraded, its clock speeds may fail to reach a normal level and right out of the gate, it's obvious that some of our samples do have some problems. The maximum and average clock speeds of our 3080s and our 3070s check out nicely with some variance but nothing that would indicate an issue. Meanwhile, our 3060 results show us our first obvious problematic GPU, the Eagle OC. Its average clocks are far lower than they should be. We're gonna put a pin in that for now though, and move on to the 5700 series, where we see some very odd behavior as well. We wanna keep a particularly close eye on the performance of this Sapphire Pulse card. Now, there are a few factors that determine the boost clock speed of a card. The main ones are the type of work the card is performing, the quality of the silicon and the quality of the cooler. Now we've standardized our workload for now, Combustor, and there's no way for us to affect silicon quality. So the first troubleshooting step for any underperforming card is to take its temperature. Maybe it's got a wee little fever, and there it is. The eagle OC 3060 that we flagged before is firmly throttling with temps that far exceed any of our other 3060s. If we wanted to fix it, getting those temps under control would be a very good start. But this is a secondhand buyer's guide not a GPU repair guide. So what you need to do is return that thing and let the seller figure it out. Now let's turn our attention to the 5700 XTs. That Sapphire Pulse that had the lower clocks seems to have its thermals well in check. So throttling is unlikely. It also doesn't have clock speeds that are substantially limited, which seems to rule out the possibility that our seller was using a modified BIOS optimized for mining. Stuff like this is why Combustor can only be considered a quick and dirty tool. So for this one, we are gonna need to go a little bit deeper and look at the amazing new underwear on lttstore.com. Oh, and also at some real world games. We settled on six games at three resolutions and at risk of spoiling the conclusion a little bit here, the vast majority of our results were neck and neck with our control cards. Now, the lab hasn't defined specific values yet for what counts as equal, but we figure for the purposes of this video, 58-60 FPSs, that's gonna be an imperceptible difference. So as long as our mining GPUs managed to be 97% or higher than the control card, we're calling them in spec. Starting with the 3080s, interestingly enough, once we averaged out our results, we noticed that we had a problem with our control GPU. While its average frame rates were fine, we found that its lows were lower than our mining GPUs, which is gonna manifest as stuttering and choppy animations during demanding sections of the game. Kind of funny that the lightly used card ended up being the borked one here. We'll talk a little bit more about that later. For now, the similarities between our mining cards are still enough for us to demonstrate that they at least are fine, Or in the case of our EVGA model, a bit more than fine. I miss you already, EVGA. For the 3070s, we see every card performing as expected with little to no variance across our samples, and we've got similar results with the 3060s except for the Ventus 2X, which landed a little below our expectations. Thankfully, it looks like this one was pretty easy to explain and rectify. Our Ventus targets clock speeds that are about 3% lower than our reference card and when lightly over clocked, it easily comes back in line. Now, it is possible that the reason for this lower target clock speed is that the silicon is slightly degraded, but it's more likely that this particular card just wasn't as good from the start. I'm gonna give it a pass. As for the 5700 XTs, our sapphire pulse ended up performing just fine in real world applications. What a relief. \"But wait,\" some of you are screaming \"We know the cores are fine. What about the VRAM Linus? You need to test the VRAM.\" So we did. We used IDA 64's GPU benchmark to see if the modules have lost any performance or started throwing errors, and every single card looks good except the Eagle OC, rest in peace. Get your money back for this one. Unless you can't for some reason. In that case, can we save the Eagle OC? Sadly, no. There are some things that can be overcome. A bad fan can be replaced, a bad Tim can be replaced. - Hey! - And if a mining BIOS has been flashed, for example the folks over at Tech PowerUp have an amazing database of GPU BIOSes that you can simply use to flash a stock one back onto your card, bada bing, bada boom. But if you encounter artifacting which looks a little something like this or outright errors like we just saw, the cold hard truth is that you probably cannot do anything which means then that there is some truth to the warnings you've seen about used cards whether it's intentional or not, there are people out there trying to sell broken GPUs as working ones. But I still disagree with a lot of the points made by my fellow members of the media. Let's work through them together. First, the idea that you will suffer some kind of performance shortfall from the heavy use of mining was always silly and portrayed a fundamental misunderstanding of how these products even work. In some ways, the heating and then cooling cycles, not to mention the higher clock speeds that are typical in gaming workloads are more damaging to a GPU. So a heavily mined on GPU could fail, but then so could a lightly gamed on one, and until either of them does, it will work as well as the other. And now that you're armed with the tools that you need to weed out the bad from the good, GPUs follow a very similar failure pattern to other electronics, meaning that the lemons usually die within weeks or months of manufacture within their warranty period. And those non lemons tend to live long and happy lives until they really, really don't. The next misconception that I've seen thrown around is that not purchasing used cards is somehow like sticking it to crypto miners. And while I fully support withholding demand until prices fall to acceptable levels a stubborn refusal to buy one at all can only lead to two possible outcomes. Either someone else will buy them, or they will be scrapped as e-waste to avoid storing them. I mean, I get the anger, but by not purchasing a used GPU, you're not only depriving yourself of something that you want, you're potentially encouraging more harm to the environment. From my point of view, every non obsolete GPU that is not in a gaming PC is a brand new GPU that needs to be manufactured in its place. And if you think about it buying new are you really morally superior? Your purchase encourages large money grubbing corporations to keep producing more GPUs out of our dwindling rare earth minerals. And these are the same big corporations that happily dropshipped literal tons of GPUs to large scale mining facilities, reaping record high profits during the pandemic. But like (beep) scalpers, right? Guys, Nvidia and AMD were the biggest scalpers of all, leaving us at the point then we're the only moral thing to do is to simply not purchase a GPU at all. But come on, what are we gonna do? Not play \"Modern Warfare II\"? So the right thing to do would be be to purchase a used GPU then? I mean, only you can say. I've long grappled with my effect on increasing consumerism and how my very existence encourages some of the worst aspects of capitalism. But in my defense, I've also always been an outspoken advocate of keeping older hardware IN service rather than buying things that you don't need. Maybe it's because I believe in the importance of the first two Rs. You know, the reuse and reduce ones. Or maybe it's because I'm just a cheapskate. Maybe it's that I'm lucky enough to be able to afford to gamble on used products But in the grand scheme of things, even if they do fail every once in a while I don't see how you can afford not to buy used. I mean, considering that we weren't being particularly savvy with our purchases, we didn't haggle, we didn't bid on auctions, we just bought whatever was available for asking price and then compared it to buying new at the time, and we still saved about 22%. That is not too shabby. Even if you removed the price of our broken GPU from that calculation, our savings are still 18.5% compared to if we bought this stuff new. Again, we could have saved more money with patience and haggling. But as for whether it makes sense for you, it's gonna depend on your risk tolerance. But like, come on, everything's a risk except buying a GPU with a transferable warranty by the way. Look, RIP EVGA. And anyway, I'll tell you this much. As someone who's been Hands on with more computer hardware than most people will ever even lay eyes on, I've seen brand new stuff die for no reason. just as often as I've seen secondhand pieces of crap survive a brutal drop. Life is a crapshoot, and then you die. Just like I killed the original segue we had to our sponsor, Zoho One. Do you own or manage a business? If so, Zoho One can make your life easier. Zoho One takes the essential elements of any business like accounting, marketing, HR, and then combines them into one unified operating system. Build your own website from the ground up and maintain it with intuitive customization and personalization options. Send out purchase orders, create marketing campaigns, manage shift scheduling, all in just a few clicks. You can track metrics and use data to make key decisions to increase revenue. And then, once you've got everything set up, you can start automating your processes to never worry about them again. If you're working on the go, that's no problem. Zoho One includes mobile apps so that you can run your business from anywhere. So don't wait. Take control of your business the way that you see fit with Zoho One. Follow the link below to try it for free for 30 days with no credit card required. If you like this video, why not check out our video about the benchmarking automation that allowed this project to happen? It's actually come a long way since then because we had to work on it a lot to actually do all these benchmarks. But the basic idea's there.",
    "transcript_keywords": [
        "GPU",
        "GPUs",
        "card",
        "cards",
        "clock speeds",
        "mining GPUs",
        "good",
        "clock",
        "mining",
        "money",
        "control",
        "buying",
        "speeds",
        "control GPU",
        "GPU sellers",
        "check",
        "Zoho",
        "lower",
        "Sapphire Pulse",
        "Sapphire Pulse card"
    ],
    "transcript_entity_values": [
        "3070s",
        "30 days",
        "Ventus",
        "weeks",
        "19",
        "one",
        "first",
        "eBay",
        "17",
        "Tech PowerUp",
        "Combustor",
        "First",
        "3060s",
        "Modern Warfare II",
        "3070s",
        "last year",
        "97%",
        "3060",
        "58-60",
        "EVGA",
        "GPU",
        "3080s",
        "NVIDIA",
        "Pulseway",
        "about 22%",
        "18.5%",
        "MSI Combustor",
        "Facebook Marketplace",
        "1500",
        "months",
        "64",
        "Zoho One",
        "Tim",
        "three",
        "AMD",
        "Nvidia",
        "5700",
        "six",
        "Zoho One",
        "Linus",
        "about 3%",
        "two",
        "a couple of minutes",
        "these days",
        "Sapphire Pulse"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "EVENT",
        "DATE",
        "DATE",
        "PERCENT",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERCENT",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG"
    ]
}