{
    "id": "ugMotxD9wlw",
    "title": "Mac Mini Restoration - Mac OS X Snow Leopard and Windows XP - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2019-10-31T19:58:33Z",
    "video_url": "https://www.youtube.com/watch?v=ugMotxD9wlw",
    "category": "Science & Technology",
    "tags": [
        "Mac Mini Restoration - Mac OS X Snow Leopard and Windows XP - Krazy Ken's Tech Misadventures",
        "dosdude1",
        "macOS Catalina",
        "Mac OS X Snow Leopard",
        "Apple",
        "Mac mini",
        "Macintosh",
        "Mac",
        "Microsoft",
        "Windows XP",
        "Windows XP Tour",
        "Krazy Ken's Tech Misadventures",
        "KKTM",
        "Krazy Ken",
        "Computer",
        "Tech",
        "Comedy",
        "Funny",
        "Computer Clan",
        "RealArcade"
    ],
    "views": 157646,
    "likes": 2818,
    "comments_count": 294,
    "description": "After the macOS Catalina dosdude1 mod experiment, the Mac mini test subject must be restored to its previous statewith a fresh copy of Mac OS X Snow Leopard and Windows XP. Along the way, we're gonna bump into some nostalgia, so hold on tight!  Support the show and get in the credits   Check out the dosdude1 mod episode   Want more videos like this?   Subscribe for more tech videos!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures - Mac Mini Restoration - Mac OS X Snow Leopard and Windows XP  Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!*   Thanks, Steve, for donating Snow Leopard, and for donating loads more! Check out his eBay store here:   Get our wallpapers here:   Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?    Amazon links are powered by the Amazon Associates Program.  *not all Patreon tiers qualify for all rewards  #KrazyKen #ComputerClan",
    "description_links": [
        "http://Patreon.com/KrazyKen",
        "http://bit.ly/clan2MTcyb7",
        "http://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://Patreon.com/KrazyKen",
        "http://bit.ly/clan2k4UEHY",
        "http://thecomputerclan.com/wallpapers.html",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- Oh, hello old progress bar, old friend. It has been a long time since I've seen you. How have you been? How are the kids? We'll just say Chicago. Oh I just blacked out the whole planet, did I blow up the power grid again? (beeping) (keyboard clattering) (logo charging up) (upbeat music) Hey guys, how are you all doing? Really, that's just great. I'm doing pretty great today too because I'm back with my old Mac mini friend. Now, if you have not seen the other two episodes where I try to get dosdude's Catalina Patcher on here, check it out. One of them was a great episode and the other one was a great live broadcast, it was a two-parter but if you're ready to keep watching, continue. I'm just letting you know, there's spoilers. Ready? Spoiler alert, it failed epically. So what happened is we couldn't get the system on here, even though we took it apart and tried different hardware configurations. Either way, we're gonna revisit that whole setup later, we're gonna try on a different computer to get Catalina installed on it. So what we need to do now is restore this Mac mini back to its former glory, basically how it was before the two failed experiments and that means we have to do two Installation Sensations, two for the price of one. That includes Mac OS X Snow Leopard, because that was one of the original systems on here, and Windows XP, I don't have my colorful box and manuals and stuff but I have this (sighs) copy of it on this beautiful generic CD. So those are the things we're gonna install, but while I was digging out those discs, I came across my Windows 7 box and I just wanna say we will do an Installation Commemoration of this in a future tech video log when the support ends. We're even gonna have a mini Windows 7 house party because I have a house party kit, remember when Microsoft did those house parties? Ooh, so exciting, so we're gonna do that again, this time to commemorate its death. (glass shattering) But for today, let's focus on the big cat, and then Windows XP. So, boot her up. Thank you to my buddy Steve for giving me this copy of Snow Leopard with the box, he's actually donated quite a few things to me and I have them stored in my lair here. He is also an eBay seller, so he has a store and if you ever wanna buy some of his stuff, several listings are vintage computers. Check out the link in the description and you can look at his store. All right, in you go. (disc drive trying to spin up repeatedly) Um... That's not a good sign. (disc drive spinning up) Oh, think it's going now. It seemed like it wasn't working for a second there. Good, it's working, I was a bit worried for a second because during the live broadcast, I took this thing apart like six times and I was like, \"Ooh, I hope I didn't break the optical drive.\" All right, let's boot into that CD, or DVD, technically. And let's install Snow Leopard. Man, I don't remember the last time I ever installed Snow Leopard, it's been a long time. I like the old boxes, I like the artwork, I like the features they put on there, all the icons and I love the wallpaper, I think the Snow Leopard wallpaper was the best wallpaper Apple ever did. DSMOS has arrived. That is my favorite line, it sounds so ominous, but also like DSMOS is an important guy, like DSMOS has arrived, the party can start now. He's really important. All jokes aside, it stands for Don't Steal Mac OS, it's kext or something like that. Okay and we're gonna use English as the main language, that makes sense to me. The barber pole animation, the old Aqua user interface, very nice. Yeah, oh man. Okay so I say we start with Disc Utility, in fact, the hard drive in here probably won't even work with Snow Leopard 'cause it's probably APFS. Snow Leopard has no idea what Apple File System is. Yep, it has no clue. So let us format this, we'll do one partition, we'll use the Boot Camp Assistant later to do the Windows XP installation and then we can just let the assistant do the repartitioning. Mac OS Extended journaled GUID and let's apply that. And there we go, nuke that sucker! And it should be clean. All right, that finished successfully, let's Command + Q back to the installer. Continue. And for some good bedtime reading, let us begin. Family Pack license, if you have purchased a Family Pack, agree. Macintosh HD seems like a good option, it's the only thing we have. Let's take a look at the customization though. QuickTime 7 for shits and giggles, sure. X11, that's always fun to mess with. We don't need different languages, we're not using this with a printer, I mean, saves a couple gigs and the installation will be way quicker. And install. Here we go, oh man, that looks so pretty, the old Aqua. There's our utilities, pretty sweet. Let's take a look at the log, 'cause that's entertaining. Show all, and now we can watch the installer do its thing, what version do we have here? 230.1.1, sweet! I just figured while we were waiting for it to install, we could take a look at the old box and admire it. Yes, it did get a little scrunchy but that's okay. But yeah, this operating system was all about refinements, it wasn't really about new features, in fact, it was advertised that way during the early WWDC previews. It wasn't a feature release, it was all about refining it to make it better and then adding in core technologies like we talked about before and then support for MS Exchange. Yeah, this version of Mac OS X had Safari 4 and I remember they had Cover Flow for the history browser, they don't do that anymore. Probably because your cache sizes would be huge for storing all those images. I was really excited about the new QuickTime X when that came out because you could record right inside of it, you could trim right inside of it, stuff that you couldn't do in QuickTime 7, you could do some of that stuff in QuickTime 7 if you bought the Pro version but the new interface was great too, it was basically nothing, the controls would just fade away, QuickTime 7 wasn't like that. Share online though, yeah, MobileMe, remember that? To quote Steve Jobs, it wasn't our finest hour. Trying to find a way to hold this. And as a friendly reminder, as with any Installation Sensation tradition, we don't just install software, we take it for a test drive and since it's been a long time since I've test driven Snow Leopard, we'll have some fun with that, same with Windows XP. 'Cause yeah, there's some features in here that didn't last very long, the Dock Expose, where you click and hold on an app icon and it throws it into expose mode, yeah, that doesn't exist anymore. Oh yeah, this was a small thing but a big deal. I don't know if you still use Stacks in your Dock, where you can open up a folder from the Dock, but in Leopard, where they introduce this feature, you couldn't scroll through a Stack. If the Stack ran out of room, it just would stop displaying items. But in Snow Leopard, you could scroll though it and you could also navigate through folders. All right, time to put you back in your box. And we have about 18 minutes remaining, the concerning thing is it said that about four minutes ago. And I lost the signal. I'm guessing it just went into some kinda sleep mode, display sleep. There we go, looks like it's retrieving packages for speech voices right now. Well, the number 18 must just be the installer's favorite number because it's been saying that for about another five minutes and for about 30 seconds it went to 17. We're back to 18 now so, yeah. Okay, it went up to 19 minutes now, fan-fricking-tastic. I think we're gonna be here for awhile. And here we go, three, two, one, ready to restart. And guess what? This was the last version of Mac OS X to come with the intro video, so we get to enjoy that. Here we go. Okay, there's the blue, which means we should have the intro and the setup assistant in a few seconds. (rhythmic music) Aw, check it out man, isn't that great? Kinda nostalgic. You don't see that anymore. (vocalizes) Oh, that tiny little speaker in the Mac mini is trying so hard. And our little cube transition, yes. Welcome, we made it, here is Snow Leopard, let's, well, not install, let's set up the rest of this. Yes, we are in the United States. Apple ID, we don't need that right now. Registration information, let's skip it. Create an account. Krazy Ken. Connecting to Apple, ping! (clicks tongues) \"What the heck, \"this guy just installed Snow Leopard, what's going on, \"why didn't he install Catalina?\" That's how I picture the Apple spies sound. \"He should have installed Catalina, that's the new system, \"why'd he install this piece of crap? \"Didn't we stop supporting that thing \"like five minutes after it came out?\" Maybe so, but that doesn't mean I need to upgrade. I remember being so excited when it came out. I remember when it launched, getting that box from the delivery man and he told me that he had so many of them on his truck because a bunch of people were ordering it all at the same time. That is fun. Set timezone using location, I think that was a new feature in Snow Leopard. We'll just say Chicago. Oh, I just blacked out the whole planet, did I blow up the power grid again? Crap. Your Mac is set up and ready so you can back up your computer, which we won't do, browse your files with Cover Flow, which is annoying. Email with style, which we don't need, chat using effects and backdrops, you need friends to do that, and organize your work, I'm very disorganized, so none of those are gonna be useful. But, anyway, I will enjoy using my Apple computer. And fade to the aurora and the Dock rises from the abyss. And there it is, the nice, glassy, 3D Dock. And it froze. Oh, the Dashboard, rest in peace, that didn't make it to Catalina. iTunes, rest in peace, that didn't make it to Catalina either. Let me play this for you in slo-mo here, as Steve Jobs would say, hold down the Shift key and enjoy those slow motion animations, yes. It looks like we're actually overscanning a little bit, the top of the menu bar is cropped out just a little bit. Ah yes, MobileMe, good times. The iDisk, oh the users' iDisk, yeah you could just go to, if you knew someone else's username and password, you could just like blub, blub, blub, blub, blub, type it right in and mount their iDisk right on your desktop. Oh yeah and Spaces, the virtual desktops. Spaces is not set up, well let's do that shit. It looked different, we can turn it on, you have Spaces nowadays where you can put the Spaces across the top and the Mission Control interface but in Leopard and Snow Leopard, it kinda just looked like this and you can drag the windows to different spaces or you can move the entire space around. It's lagging a little bit, that's interesting. Can we slo-mo that? Doesn't look like we can. But yeah, that's what it looked like back in Snow Leopard, pretty different from how we have it nowadays. Oh yeah, and the other feature I was talking about, the Dock Expose, you can clip and hold, and there's your expose and you had these little menus here. That feature did not last, I kinda like the little spotlight look there and all that stuff. But that feature did not make into future versions. We're not finished yet. That was just phase one. So let's open up Boot Camp assistant. Let's give it five gigs, right? That'll be nice, just kidding. What do we do, like maybe 40? 40 sounds good. So we're gonna partition that and then install XP and then we have to install the Boot Camp drivers but, oh yes, the Boot Camp drivers were on the Mac OS X disc, that's right, that's how they did it back in the day, hah! Look at that, instructions, those are helpful. All right, let's throw that in there. And start. Boy, I have not installed Windows XP in years, this is gonna be a nostalgia attack for me. Admittingly, I had to install it a lot back in the day because, well, let's just say sometimes it would have crashes or corruption and I would need to do repair installs quite often. And I also have my handy-dandy index card here, which on the reverse side, has the activation key, this thing has been with me for a long time, I was probably in middle school when I drafted up this index card. So the fun thing is Windows installation processes are typically built upon previous systems, so the first part of setup is actually gonna look like how it did I think back in the Windows 3 days. Very blue, just get ready for a lot of blue. I don't know how to prepare you for it, other than, there you go. One of my favorite files is driver.cab. I'm just amused by that nomenclature right there. Maybe we'll see it pop up, maybe we won't. Setup is starting Windows, that means we're almost ready to do stuff. I just thought of something else, we're gonna witness the Luna theme, yes, all that blue kinda plastic look Luna. So yeah, this was it ladies and gentlemen, looks pretty, right? We can read the end-user license agreement like this if we want. Okay, partitions, this is the Boot Camp partition, FAT32. I thinking we should use NTFS, it's a little more robust. And modern. Let's do that, let's do a quick format, F. Oh yes. Oh, hello old progress bar, old friend. It has been a long time since I've seen you. How have you been? How are the kids? Why am I talking to you? Okay, so now it's gonna do the examination process, checking drive C, all right, it's already done. Now it's gonna copy a bunch of stuff over. Oh, there it is, there's my old friend, driver.cab, how are you doing, buddy? Wow, all my friends are here, this is great. Well, I'll let you get going, I'm sure there's other files that have to be copied. You must be a big file, it's taking a while for you to get in there, you're stuck at 11%. Almost done copying, lot of .dlls. All right, we're gonna reboot with the nice bloody progress bar. We're gonna hit enter and skip right past that. Here we go. Ahhh, oh my gosh, the dithering. Oh, Luna, it's been so long. Sweet, sweet Luna, fingerprints on my screen. It has been so long since I've seen you. Orange accent color, the green radio buttons, the blue everywhere. Yeah, Windows XP was a big step up. I gotta give props to Microsoft. Honestly here for a second, Windows XP is, what, the most installed software in history? I think it is. Think of how many people installed it. Think of how many people still use it. Ah, the green little squares down there too. How I've missed you. Ah yes, I forgot about you, regional and language options window, legitimately I did, I forgot that stuff popped up while the installation was happening. Next, name and organization. Well, my name is Krazy Ken, as my friends call me. So, pretty much nobody calls me that. Organization, we'll just say Krazy Ken Incorporated. Product key, one of the best features of Windows is this activation process. It's not valid, what the shit! It's gotta be. Hang on, yes, this is what happens when I talk and type at the same time, I type in wrong shit. I can't believe it, man that code works, that's amazing. I wrote that down with pencil on an index card forever ago. Computer name, yes, we'll call it Krazy (speaks gibberish) that's okay, I like it. Okay, time to reboot. (Windows chiming) Ah, so nice. Please wait while I try to connect you. To improve the appearance of visual elements, Windows will automatically adjust your screen resolution. Yeah, oh. If you can read this text, click OK to continue. It looks horrible, it looks really pixelly and blurry. Okay, (laughs) we'll fix that we also have to install the Boot Camp drivers, so we'll get to that just in a little bit. Aw, I just realized we're probably not gonna hear the music. Yeah, we got the cool video but we're not gonna hear any sound right now because the audio drivers aren't on here. Here's our little wizard guy, you can just drag him around and bounce him around like the DVD logo. Boop, boop, boop, boop, boop, boop, boop. Help protect my PC by turning on automatic updates now. Sure, why not? My name: Krazy Ken. You're ready to go. Really, that was it? Okay then, if you say so. Ah, yes. Yeah I know we won't be able to hear the iconic music but once we get the driver installed, we can do that. Yeah, here's the start menu and yes we're overscanning, it's really terrible right now. Let's see what resolution we can actually get. Your computer might be at risk, that's the first thing you wanna see when you install your new system. Oh yes, that's great, that's exactly what you want to see. It's because we don't have antivirus on here. Yeah, well my brain is my antivirus, just don't be stupid. Oh, look at that painting. Take a tour of Windows XP, we will do that, but right now, it's gonna perform like crap, especially with that redrawing, check that out, this is what happens when you install XP on a Mac mini with no graphics drivers. Your computer may be at risk, how about you suck it? All right, let's see what resolution we can get here. Oh, apparently nothing higher than that. And we will reinsert the glorious Snow Leopard disc. You'll be guided through the thing, yep, I accept the terms. Next, Apple software update for Windows, why the hell not? Install. There we go, the display driver. Yep, we could use that right about now. (laughs) Let me close that and get a view of that beautiful wallpaper, which is probably also the most viewed photograph in the world. Chuck O'Rear, right? He shot that in wine country. That's probably the most famous hill in the fricking world. (laughs) At least in terms of photography. You know while this is installing, my mind is just gonna go down rabbit holes, what I wanna do in a future episode is experiment with a Zune. If anyone has an old Zune just lying around and you wanna send it in for a Krazy Ken episode, I will gladly take it. (bubble popping) Huh, a little balloon sound. (pops lips) Wait, what? I just got an Apple Watch notification that said \"LGR commented,\" LGR. Like, Lazy Game Reviews, hang on. He said this was a fun show, I'm guessing he's talking about Vintage Computer Festival Midwest because I was there when 8-Bit Guy and him were there as well. Let's see, he said, \"This was such a fun show! \"Definitely considering going next year.\" Fantastic! I'm considering hosting a booth next year. Maybe we should meet up. Anyway, what else did he say, \"Matt, the guy \"that you bought your NeXTcube from, is the same guy \"who hooked me up with the P5 glove,\" that he just covered on LGR. Oh, sweet. \"I was eyeing up that cube as soon as I got there. \"You got a stellar deal.\" Well thank you, Clint, I really do appreciate that, yes, fan-fricking-tastic. Anyway, that was fun. Finish! We are done. So now we have to reboot and log out sound, you ready? (Windows chiming) Ahhh, yes, that is very nice right there, that good old piano. (windows booting) Okay, this time, we should have the log in sound, ready? Or the startup sound, whatever you call it. (Windows chiming) Mm, if that doesn't give you nostalgia, I dunno what will. I guess it depends on how old you are. Yes, okay, so display settings, let's fix that, things are looking sharper at least now and the overscanning seems to be gone as well, maybe it's a little bit at the, no actually, no, yeah, the overscanning looks like it's been corrected. Take a tour of XP, we will do that soon. Let's see, we can probably run this at 1080. GeForce 9400M. Do you wanna keep that? Yeah. Yeah, everything is really freaking' tiny but it's sharp, I mean it works. This lonely little recycle bin, I'll just put you on the hill right there. Go ahead and sit on the hill. Some hikers come by and they need to recycle some stuff, you can just, oh, it's snapping to a grid, you can just sit there on the hill, right there. Okay, tour Windows XP. Oh my gosh, Windows Messenger. Are you ready for this? Buckle your face. Hang on, we gotta turn up the volume all the way to make sure we can really enjoy this. Here we go, buckle up. Oh, that was anticlimactic, I forgot it had this. Play the animated tour, hell yeah, this is fricking Macromedia Shockwave 5, we gotta use all the animations, bitch! I missed the button, there we go. - [Tour Guide] Welcome to Windows XP from Microsoft. - Nice! - A new version of Windows that brings your PC to life. - So hot. - [Tour Guide] Experience the best. - [Both] Experience Windows XP. - [Krazy Ken] This is sharper than I remember. - Best for business. - [Krazy Ken] Is this like vector art? I don't remember it being this crisp looking, it actually adapted to the full resolution of the monitor. That's impressive. - [Tour Guide] To begin the tour, click any selection. - [Krazy Ken] Dude, Macromedia, oh it was Flash Player, not Shockwave. Yeah, this was back when Macromedia owned Flash, shit. Yeah, Flash is like dying now, well it's been dying for a long time. - [Tour Guide] Windows XP, you get the proof. Friendly new screens, simplified menus and a whole lot more. - [Krazy Ken] The start menu. But then they have this pixelly looking screencast inside this beautiful full res interface, of course they do. Wow, that is just fan-freaking-tastic, that's amazing. Okay, let's try to, well, yeah we gotta get this on network. We have easy access to the guards' router, I can just run some cable. Ha, ha, Bon appetit. And we'll just give you a little poke. There you go. After all, why use wifi when you can use non-wifi? Let's open up, probably the most memed piece of software in the world, the infamous Internet Explorer. Yeah, done it says, I don't think you are. It probably has no idea how to load modern webpages, especially if they are SSL. Let's try microsoft.com. You're about to view pages over a secured connection, uh, good, I guess. Yeah okay this page cannot be displayed. Thecomputerclan.com, there we go. Yeah I think the network is working, it's just it can't really parse anything. Let's ping thecomputerclan.com, just to make sure. Yes, so we are getting a pong. So we know internet access is working, we just can't really do much with this older version of internet explorer, I guess we could put a newer thing on here if we really want to, but yeah, I got some data to transfer, I'm not sure how much of it's gonna be compatible or how much it's gonna it's work from the backup, but let's try anyway. So while I was waiting for the other files to copy, I just kinda left the tour run and this is probably the most I've ever watched of the tour before. Some people may watch TV, may watch Game of Thrones or whatever the kids are watching these days, but me, I just sit here and watch the Windows XP tour. - Improved system - All right, - restore, - let's plug this in. - [Tour Guide] And restore your system to the way it was-- - Oops, my fingers bumped Alt + F4, I'm sorry tour lady. I have some pictures on here, just because why not. It's a good way to test the new Filmstrip view in Windows XP, so let's see, let's open up a new Explorer window and let's just copy all of them in here. Some of the stuff I shot, which by the way, you can download some of these as wallpapers from our website if you want, the link is in the description. We could actually set one of these as the wallpaper right now, we could just right click and go set as desktop background and boom! There's the rainbow board. Oh yeah. Yeah, well that'll work for now. Okay so here's my Windows XP backup, I just backed up the whole freaking thing. I know there were games in here, yep, which need RealArcade to work I believe. The RealArcade servers are probably long gone, so I doubt any of these are going to be able to reactivate, but yeah, we can try. Let's see. (laughs) Yeah, some of these items are hidden but we're rebels, we can do this, we know how this works. Hey, here's our games, I'm just gonna drag 'em in there, I have no idea if that's gonna work at all, but we're gonna try. Program files, these are hidden, yes they are. Not anymore. BumpTop was on here, what! That was that old 3D desktop thing from, from awhile ago, holy crap. That goes back. Safari for Windows was on here, aw man. You could probably still install that if you know where to look. (laughs) That was back when Safari was available for Windows, yep, not anymore. Well let's transfer those over and see if they will work, I don't think they will. I doubt any of this stuff is gonna work without a proper installer. (Windows error honking) Yeah. 'Cause the application configuration is incorrect. RealArcade. Oh, let's see if we can boot this up. (Windows error honking) Uh, yeah PNCRT.dll was not found. I don't know what that is, I don't know where that's supposed to live in the file system. I could probably run a search and see if I can find whatever the frick that was. Let's pull up our dog friend. Hello, I forgot your name. I really forgot your name, I'm so sorry. Oh, look at that. Right there, system32. We get to dive into that folder. Yeah, let's make a copy of this into here and lemme guess, it's gonna find another file that's missing. Is owned by no application, okay. Um, okay now I don't know what that is. Oh shit! Whoa! Yo, it worked! Ha, ha! Oh wow, this, dude, back before I did serious stuff on a computer, I spent most of my life inside this program. Way before I played on Steam. I would play in RealArcade, this is where my stuff was. Yeah, right now it looks like it's just detecting the default Windows Pinball and all that stuff. 'Cause it's probably not gonna be able to reactivate any of the other things. Well let's see if any of these games will even launch. I have my doubts. Ah, Red Ace. Oh, shit! (rhythmic music) Oh wait c'mon. Work for me. Yes! It's bugging out a little bit, but it's here. It has our status, like we've finished these missions, holy crap, it remembers. Yeah I'm gonna switch out of that for a second and see if I can fix it up. Small rockets, what, no I hit end task, why are you bringing it to the foreground, dick? Yeah this program's not responding, gee, I wonder why. Okay, let's try that one more time. All right well guess we're just gonna have a crappy screen there. Oh, yeah! Click here if this page is displayed correctly, absolutely. Anyway, missions, yes. I'm gonna play the only mission I know how to do. I really sucked at this game. My brother was way better at this shit. (plane propeller buzzing) Okay, so we're the American biplane, there's a German plane there. (gun firing repeatedly) Sorry Germany, you're cool, this is World War II or something, so. (gun firing) (plane exploding) Oh! There we go. All right, I gotta go take out these guns over here. And you could right click and drop a bomb, I just blew up that tree, no, Mr. Beast is gonna hate me. Okay, here we go, we got a German guy. (gun firing) No! Whoa, shit I'm smoking, I probably should've dodged. I probably should've done something about that. Oh boy, here we go. Blow up these tanks. (bombs exploding) I think I got some tanks I gotta blow up. Mission Accomplished! Take a look at that. All right, I killed two Germans, 7% accuracy. (laughs) Yeah, yeah, yeah, yeah, I wasn't really playing that very seriously, now was I? Yes. Okay, what else we got in here? Yes, Thrillride Pinball, this was good, it was like a Hersheypark pinball machine. Yeah, I spent a lot of time playing this one. Yeah, okay, so this is what I was thinking would happen. At certain times, when you launch the game, it's not gonna reactivate, so it's like, \"Okay, you gotta go in the demo mode.\" You could buy the full game online but you probably can't get to the server anymore. It's probably nonexistent. But let's play the demo and see what happens. (laughs) Yeah, time remaining: 60 minutes. I remember being a little kid, and going, that was the Sierra guy, going like, \"Okay, we have to do all this stuff before the 60 minutes \"is up because then we have to buy the game, \"so we have beat it as much as we can.\" (pinball machine chiming) - 3D Ultra Thrillride! - [Krazy Ken] Yeah, oh dude! Oh man, I haven't played this in years! Holy shit. I mean, Space Cadet is great but this was, oh we're already in the Fun Zone, hell yeah. - Canyon River Rapids! - Oh yeah, I remember this shit. I've never been to Hersheypark though. My only experience was with this game. (laughs) - [Man] Here comes another one! - [Krazy Ken] Here comes another one! (laughs) - [Man] Here comes another one! - [Krazy Ken] Oh shit, I blew it. - [Man] The stopwatches will cut down on weight time. - [Krazy Ken] I'm sure they will. Oh, sinker! What was that! That was a bunch of bullshit! (upbeat music) - [Man] Get yourself. - [Krazy Ken] Uh oh, what'd you do? What'd you do? What just happened? Oh, I activated Sticky Keys because fricking asshole. (pinball machine chimes) Okay, I'm playing blind. Oh, that's nice. (pinball flippers clattering) That's beautiful, hang on. There we go. (pinball flippers clattering) Can I save a game? I dunno if I can. Well, I'll just have to abort it 'cause we do have to move on but that is incredibly fun. This is, oh it crashed. Platypus, this was one of my favorite shooters. All of the sprites are made from clay. Which I've never seen in a game before until then, which was awesome. Let's see if this loads, looks like it will. Oh yeah, that music. Hell yeah, oh shit. Oh shit boy, I'm getting hit with so much nostalgia now. It's all clay, even the fricking font is clay. Dude, this music was my jam. Here's the fun thing, I dunno if anyone knows the theme to Shadowfire, composed by Fed Gray, but a remix of it is used on the level select screen, it's pretty fun, listen. (uplifting music) (uplifting 8-bit music) Yeah. (laughs) Oh! I just died. Okay, yeah, well, yeah and I exploded into a nice fruity custard. It's been a long time since I've played this and these guys are a little harder to beat, there we go. Dude, I know scientists haven't cracked time travel yet, but I think I just did. This is how you time travel, you just feel nostalgic to the nth degree. Wow. All right, Space Cadet time, yeah, yeah, yeah, here we go, it's been so long. (pinball machine powering up) Yeah. When you hear that sound, shit's about to go down. (ray gun firing) 'Kay, how do I flip, there we go. (pinball bumpers popping) Get up the ramp, nope. Dude, you frick, piece of, what! There's like a cheat code thing. (pinball machine powering up) (ray gun firing) There it is! Yep. Yep, so we can just drag the ball around, yeah, it works! Yeah, we got the colors changed. Let's just roll through this thing as much as we want, up and down, up and down, up and down. Oh yeah, going up. (pinball bumpers popping) Going up again. Yeah, we can just bounce around all we want. If you type in \"hidden test,\" I think you need to include the space, I don't remember, before you deploy the ball, while it's loading up, you can just drag it around with your mouse. And then I think you can press a certain letter to get on the scoreboard. Oh, there it is, whatever I just pressed there, I just now got a billion points, so beat that. Krazy Ken, but then funny thing is, it doesn't put you in first place though. Because it knows. So what did I press? It was H I guess, I pressed H. Okay, so yeah, there you go. Oh, and now we're in fruit punch mode, this was not part of the demo. This is great, I got the system restored with Mac OS X Snow Leopard and Windows XP and the shit works. Just a heads up, even though that Catalina experiment failed, which again, if you haven't watched it, watch it, Even though it failed, Greg Hrutkay's setting me up with a dosdude mod, another Mac mini that should be able to run dosdude's Catalina Patcher, so stay tuned for a future episode where I tackle that and don't forget to tune in for the Windows 7 End of Life Installation Commemoration when that happens in January, 2020. But of course there's going to be a lot more fun stuff coming up before then too. This has been a mega awesome Installation Sensation and nostalgia trip, thanks so more for sticking with me, catch the Krazy, and pass it on. (Windows chiming) (upbeat music)",
    "transcript_keywords": [
        "Snow Leopard",
        "Yeah",
        "Windows",
        "Leopard",
        "Snow",
        "installed Snow Leopard",
        "time",
        "Mac",
        "Boot Camp",
        "thing",
        "Krazy Ken",
        "install",
        "long time",
        "Snow Leopard disc",
        "stuff",
        "Snow Leopard wallpaper",
        "shit",
        "back",
        "Mac mini",
        "Catalina"
    ],
    "transcript_entity_values": [
        "Bon",
        "Macromedia",
        "XP",
        "the 60 minutes",
        "Vintage Computer Festival Midwest",
        "Chuck O'Rear",
        "about another five minutes",
        "the Fun Zone",
        "Admittingly",
        "Windows XP",
        "two",
        "Installation Sensation",
        "BumpTop",
        "Beast",
        "a few seconds",
        "Windows Messenger",
        "Windows",
        "six",
        "Catalina",
        "Windows Pinball",
        "Fed Gray",
        "Installation Sensations",
        "Mm",
        "GUID",
        "Cover Flow",
        "40",
        "World War II",
        "one",
        "Windows",
        "5",
        "18",
        "iDisk",
        "Greg Hrutkay's",
        "Zune",
        "Space Cadet",
        "Flash Player",
        "Steve",
        "Spaces",
        "Apple File System",
        "11%",
        "Explorer",
        "American",
        "Installation Sensation",
        "Family Pack",
        "years",
        "forever ago",
        "7",
        "Kay",
        "Apple",
        "8",
        "Boot Camp",
        "Mac OS X",
        "Luna",
        "Mac",
        "Snow Leopard",
        "MobileMe",
        "Red Ace",
        "Safari 4",
        "first",
        "Microsoft",
        "these days",
        "NeXTcube",
        "17",
        "Apple Watch",
        "iTunes",
        "APFS",
        "Leopard",
        "about four minutes ago",
        "three",
        "a Family Pack",
        "Boop",
        "Hersheypark",
        "Aqua",
        "Krazy Ken Incorporated",
        "Krazy",
        "Chicago",
        "a house party kit",
        "slo-mo",
        "Snow Leopard",
        "the Boot Camp",
        "Sierra",
        "1080",
        "Windows 7",
        "today",
        "Germany",
        "Krazy Ken",
        "Canyon River",
        "18",
        "Clint",
        "Germans",
        "60 minutes",
        "Alt + F4",
        "Safari",
        "Windows",
        "Steve Jobs",
        "German",
        "iDisk",
        "the United States",
        "Game of Thrones",
        "up to 19 minutes",
        "Apple ID",
        "Catalina Patcher",
        "Disc Utility",
        "Hersheypark",
        "the Windows 7 End of Life Installation Commemoration",
        "five minutes",
        "Matt",
        "Lazy Game Reviews",
        "3D Dock",
        "next year",
        "Filmstrip",
        "Shadowfire",
        "eBay",
        "Mission Control",
        "about 30 seconds",
        "Luna",
        "Stack",
        "Mac",
        "Thecomputerclan.com",
        "Snow Leopard",
        "Macintosh",
        "Catalina",
        "Flash",
        "P5",
        "English",
        "MS Exchange",
        "Dashboard",
        "about 18 minutes",
        "January, 2020",
        "RealArcade",
        "7%",
        "LGR",
        "230.1.1",
        "Yo",
        "One",
        "five",
        "second",
        "Leopard",
        "NTFS",
        "the day"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "TIME",
        "LOC",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "TIME",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "FAC",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "NORP",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "TIME",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "GPE",
        "ORG",
        "LOC",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "GPE",
        "PERSON",
        "LOC",
        "DATE",
        "PERSON",
        "NORP",
        "TIME",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PERSON",
        "NORP",
        "ORG",
        "GPE",
        "WORK_OF_ART",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "GPE",
        "ORG",
        "LANGUAGE",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "DATE"
    ]
}