{
    "id": "ugtntRVMqFo",
    "title": "PLEASE be good! - Kwumsy P2 Pro Triple Monitor",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-06-19T16:59:12Z",
    "video_url": "https://www.youtube.com/watch?v=ugtntRVMqFo",
    "category": "Science & Technology",
    "tags": [
        "Mointor",
        "monitor",
        "display",
        "laptop",
        "portabl",
        "slidenjoy",
        "triple monitor setup",
        "moniter",
        "klumsy",
        "kwumsy",
        "triple monitor laptop",
        "razer",
        "tripel monitor"
    ],
    "views": 2237772,
    "likes": 84295,
    "comments_count": 2439,
    "description": "Get a 30 day trial and 50% off an annual plan with code LINUS50 at    Create your build at   I've been waiting for something like this for far too long. Getting work done on a laptop can be a pain with just one screen, but this $599 attachable display from Kwumsy/Ofiyaa allows you to have 3 monitors anywhere you can put your Macbook... or other 13.3-to-approximately-17-inch laptop.  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:18 Portabl/Slidenjoy/Valerie 3:11 Project Valerie 3:44 Kwumsy Unboxing 5:58 Plugging in 11:43 Adam's Critiques 12:22 Ofiyaa/Kwumsy 14:35 Outro",
    "description_links": [
        "https://share.epidemicsound.com/linustechtipsJUN22",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1438075-please-be-good/",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "(keyboard clacking) - This is not productive enough! (cat howls) (Linus sobs) (angelic music) What? By Zeus' beard. Three monitors in one portable package? My dreams have come true! Or so I thought. It's true that I've wanted something like this for a long time. And after seven years, a stolen Razer prototype, and a sleazy Kickstarter that has allegedly ripped off backers for nearly $650,000 and counting, someone finally did it! They finally stepped up to actually deliver what appears to be, on the surface, the ultimate road warrior productivity tool. But is Kwumsy just their name, or is the product kinda kwumsy too? Ah! I know it's not as kwumsy as this segue to our sponsor. Ah! - Build Redux. They make it easy to configure your new build with support guides to help you along the way, and they also offer competitive pricing as compared to building a PC yourself. So why not head to buildredux.com/linus and start your new build today? (upbeat music) - I'd forgive you for thinking that the Kwumsy P2 Pro Triple Monitor is a scam, because it wouldn't be the first. It's story time, ladies and gentlemen. Five years ago at CES, the team from Slidenjoy gave me a demonstration of their much-hyped Le Slide, and young, naive Linus believed that they were a legitimate company and he was excited to see the Slide come to market. Since then, Slidenjoy has missed every production deadline they've set for themselves, they've undergone a rebrand to Portabl, probably in an effort to cover up their troubled history, and they've provided precious little evidence that they've ever actually shipped anything to an end user. Oh, and it gets worse. Their Kickstarter page features years of complaints about delays, and on their website, we've got this review page with pictures of happy customers, except that almost all of them are taken with the founders in the same house slash office. This one's a duplicate. As for the independent media coverage, oops, none of those logos actually link anywhere, probably because any old coverage of these guys has been updated with warnings like this one. And they are still taking people's money and funneling it into viral marketing stunts on social media. How do we know? Because they stupidly reached out to one of our sister channels, TechLinked, offering us 20 euros per conversion. That's a pretty bad offer, considering how much they're obviously keeping. The cherry on top is they even admitted they have no stock of it, not even a demo unit, so that we could see in person what we were promoting. And it's because of buttheads like these guys that we're no longer able to cover crowdfunding campaigns. That takes important promotion away from honest people who are actually trying to solve problems for their users. Problems like not having enough pockets in your hoodie. WAN hoodies, now in stock in all sizes. LTTStore.com. (sighs) Scammers aside, Razer's Project Valerie was another cool attempt at this idea, but it was allegedly stolen from their booth at CES 2017, and Razer made it clear at the time that it was more of a proof of concept rather than a real product. That was then, though. This is now. Kwumsy's P2 Pro has its own sketchiness to overcome, like the fact that an apparently identical product from Ofiyaa also exists. But at least they managed to ship us one. So let's take a look at it. And here it is! We shot this out of order, so this is my first actual hands-on with this thing. Kwumsy P2 Pro. They got a bit of a kerning issue here. Um, it's more like the K-wumsy. Tri-Screen Notebook Expansion Screen. Presentation mode, portrait mode, triple-screen mode. It does exactly what those ripoff artists promised that their product would do. I couldn't help noticing it's really heavy. Ooh! Okay! It's 1080p, 60 hertz, 1000:1 contrast ratio, 16x9, 13.3 inches. Ooh! Okay. Comes in some kind of plastic leather carrying case. Oh, okay, this isn't packaging. This is just to cart the thing around with you. We've got a USB Type-A wall wart. This puppy is good for five volts, three amps, so it's a total of 15 watts. That'll probably be enough to drive both of these panels. A Type-C to Type-C. A dual Type-A to Type-C. This is a lot of cables. We actually have two of these Type-C to Type-C's. - What they did is to cover their bases. It's like, if you don't have USB-C power delivery, you might need two USB-C ports. If you don't have two USB-C ports, then you can use two USB-A ports- - And a USB-C port. Oh no, just two A's. - Or/and a USB-C port. - Oh, I see. Huh, for a rando product from a manufacturer I've heard of before, this is actually a surprisingly decent quick start guide. Oh, there's a MicroSD reader in here. Well, that's cool. Why is there a card in here? Is this just a placeholder? What? - No, that has data on it. - [Linus] Wait, this has data on it? - This is how they give you the display drivers. - You need drivers for it? - Kinda. - Should I try and hook this up and see what happens? - Yeah, let's do that. - Aw, boy. Uh, okay. Ooh! Got a little kickstand on there. You can adjust the angle like that. I know you mentioned this to me already, Adam. It is 13.3-inch compatible, specifically. 13.3 inches. No more, no less! - [Adam] Well, some more. - Some more? - You can make it a lot bigger. It supports up to- - Oh, you can make it bigger? - It supports up to some 17-inch. - Oh, I see! (gasps) I lied again. Look at that! All right, we got our one-cable solution, hopefully. So here's if we have power delivery. I'm hoping for power delivery here. Okay. Oh, P2 Pro. Oh, it's boot... Ooh, it's really dim. Do they advertise a brightness spec? - On the box it says 220 nits. - That seems optimistic. And this is the part where I'm supposed to figure out how to actually get it to operate, I guess, then. Because I do not see the SD card. I'll figure it out. And this has gotta be just a one-time thing. Okay. - But... - Ah! No, maybe the PD port is just for power in. Okay, I'm gonna assume that. Type-C then. Okay, I'm trying the Type-C port. How about now, buddy? Ooh! Okay, it's a little heavy. A little kwumsy, you might say. All right, my USB drive is here. Driver download address. (Adam laughs) Text document. - Just in the interest of time, I installed the drivers on one computer. They didn't do anything. - Oh, really? Oh, so how do I get it working? - Sometimes it's just a matter... Is that for sure a power delivery port? - I mean, this says SMI USB display. - And that's where the drivers would be, it's just SMI. You also don't need to use the SD card. They do have drivers available on their website, but they do take you to a Google Drive. - Okay, you say I don't need the drivers, but it's not working without the drivers. So I do need the drivers. - [Adam] Are you in a power delivery USB port? - Well, I don't know. - [Adam] Does it have a little lightning bolt by it? - No. - Maybe you should try both. - Try both? - Or it might just not work. Because they're a Chinese company and a small one, their documentation is very lacking. And also it's a niche product, so you don't hear many people going on forums trying to solve it. - Right. I definitely need that driver. Like it's showing up. And I'm prompted for a Windows 11... Oh! It's on all three screens! I didn't even notice. I was so busy being like, \"No, I don't want Windows 11 right now!\" Well, that's awesome! They're really dim. And they don't dim and brighten, which I didn't expect them to, to be very clear. - You adjust the brightness with the on-screen display. - Oh! - There's controls at the top. - Is that what the plus... Ooh! Ooh! I don't even understand what I'm doing here. - [Adam] Yes, the controls are pretty unintuitive. - Yeah. Wow, brightness does not seem to be actually changing panel backlight intensity. It seems to be adjusting the gamma. - [Adam] Yeah, that's the gamma. If you scroll down to the bottom of this menu. - Oh, it doesn't change. Is that the joke? Oh! Oh wait, eventually it does, hold on. Eventually it does. When you get into the last 20%, it does actually change meaningfully. How do I exit this menu? - You just wait for it to time out. They advertise 207 degrees of rotation, but that's coming from the back. - Right. - Which is super frustrating because this is really wide, and just bringing it in like 5, 10 degrees makes it take up so much less space. - The viewing angles are also not amazing. Hmm, these are not a matching 13-inch size, are they? Oh, actually, you know what I think it is? This is a 13-inch, but it's a 16:10, so there's just a little bit of confusion there. - That also explains why you're having a bit of a better experience. My laptop, because it's 16:9, this bezel ends up digging into the ground and making it so that I can't easily manipulate it, which is really frustrating. - 16:10 life, man. - Yeah, it's the good one. - You should've chosen better. - [Andy] Everything is so dim I can't really see. - Yeah. - Yeah, neither can we. There is a solution, actually, to the dimness. - Really? - But it's not clearly labeled in their manual. - Right. Why would it be? - It is on their website though. Now, when I was testing, I only got 93 nits for peak brightness. - [Linus] Uh-huh, which is clearly not right. - Yeah, they promised 220. I thought maybe it's 90... 90 plus 90 is 180, it's closer. - Getting there. - What you actually need to do is plug in both cables. - No! So it'll work with just one, as long as you're in the dark. - Yeah. - There we go! Two-cable solution. Not ideal, but not bad. I mean, it's certainly usable. Okay, cool, so I got my Excel over here. I'm, you know, managing my home assistant thing here. That is a frickin' lotta screen real estate for a laptop. Is it a little kwumsy? Yeah, and we haven't even tried to pack it up yet. - [Adam] You already made that joke! - I know, but it's a good... It's a funny joke. (Adam groans) When it comes time to pack it up... You know what I say about this? I say don't hate, because no one else is doing it better. This actually does not take that long to pack up. They've got a nice little... Some kind of, I don't know, like a suede/Alcantara... To be clear, I'm not saying it's either of those materials. It's probably something much cheaper. But they've got a thing on there, unlikely to damage the screen. Got this boy here. Nowhere to really stow all the cables you're gonna need. That's a bit of an oversight, but hey, realistically, you've got a bag you're carrying this thing around in with your laptop anyway. Yeah, late '90s form factor, but very 2020s real estate. - One thing to note is that this will not be easy on your battery. We tested it on our 17-inch MSI Creator, Z16P. - Yeah. - And it cut the battery by 33%. You lost like a couple hours of battery life. - With a laptop like that, if you weren't plugged in anyway, you were gonna have a pretty kwummy experience. - Linus isn't here yet, so I'm gonna use this time to air my grievances. These aren't damning, but something that manufacturers should consider if they make a V2, and please make a V2. I want this to be great. One: have the screens flip vertically so that I can close them into the case without having them exposed during transport. Two: increase the rotation of the hinge mechanism so I can bring the monitors in a little bit tighter. Three: a rework of the kickstand to be spring-loaded, and having locking points would be great. And finally, brushed aluminum is a fingerprint magnet. I don't like it. And hopefully, we can get better color calibration from the factory. That would be the cherry on top. Hey, Linus! We're ready for ya. - Great. The elephant in the room is, of course, the fact that there are two brands, Kwumsy and Ofiyaa, advertising the same lineup of products. They are actually a few potential explanations for this. They could both be rebranding a product from a third-party OEM. They could be sister brands that share products, kind of like if OPPO and OnePlus had two very similar or near-identical phones. Or one of them could be acting as an ODM. So that's an original design manufacturer, kind of like how Foxconn builds iPhones, but those are designed by Apple. And then it could be that that manufacturer is then secretly selling that other company's design out the back door. We don't know which of these situations is right, it's all speculation, but what we can say for sure is that Kwumsy has a pretty cool product on their hands, it is actually real, but the standard small-company disclaimers do apply here. The documentation, as we saw, is kind of lacking, and we haven't tested their customer service. But that's the risk that you take when you go with a brand that doesn't have an established presence in your particular region. But hey, at least they've made a better first impression than Slidenjoy, right? - Yeah. - Yeah! And I'm gonna make a first impression for you, with our sponsor! Epidemic Sound! Epidemic Sound provides high-quality, professionally produced music and sound effects for you to use. It doesn't matter if you're a video creator on YouTube or you need it for work at an agency. Epidemic Sound has a license to cover it. Sign up for their personal plan for any of your social platforms, or their commercial plan for any projects related to your business. You can choose from over 35,000 tracks and 90,000 sound effects that are all diverse and original, with new ones getting added every week. Got a specific beat, song, or vibe you're looking for? Epidemic's EAR feature lets you select specific portions of any track to search for music in their catalog that sounds similar to that sound you're looking for. So don't wait, sign up today using the link in the description for a free 30-day trial, and use code LINUS50 to get 50% off your annual subscription. If you guys enjoyed this, go check out our video on the xScreen, another kind of unique external display.",
    "transcript_keywords": [
        "Yeah",
        "Kwumsy",
        "product",
        "drivers",
        "kind",
        "Ooh",
        "TypeC",
        "USBC",
        "power delivery",
        "Sound",
        "time",
        "port",
        "thing",
        "USBC ports",
        "USBC port",
        "make",
        "power",
        "Pro",
        "Epidemic Sound",
        "USB"
    ],
    "transcript_entity_values": [
        "one",
        "16:9",
        "20 euros",
        "every week",
        "13.3-inch",
        "13.3 inches",
        "90,000",
        "One",
        "USB-C",
        "ODM",
        "iPhones",
        "seven years",
        "Andy",
        "annual",
        "Three",
        "five volts",
        "Foxconn",
        "the Kwumsy P2 Pro Triple Monitor",
        "three",
        "Slidenjoy",
        "YouTube",
        "Linus",
        "Razer",
        "2017",
        "years",
        "220",
        "Apple",
        "first",
        "nearly $650,000",
        "Portabl",
        "33%",
        "kwumsy",
        "60 hertz",
        "OEM",
        "Adam",
        "93",
        "third",
        "50%",
        "PD",
        "1080p",
        "Alcantara",
        "15 watts",
        "SD",
        "Zeus",
        "10 degrees",
        "Kwumsy",
        "13-inch",
        "Valerie",
        "a couple hours",
        "30-day",
        "TechLinked",
        "1000:1",
        "xScreen",
        "two",
        "OnePlus",
        "Excel",
        "16x9",
        "some 17-inch",
        "17-inch",
        "SMI",
        "Two",
        "Five years ago",
        "Chinese",
        "SMI USB",
        "207 degrees",
        "today",
        "2020s",
        "Ofiyaa",
        "OPPO",
        "over 35,000",
        "Windows 11",
        "180",
        "5",
        "Linus] Wait",
        "MicroSD",
        "90",
        "the last 20%",
        "a Google Drive",
        "USB",
        "Kickstarter",
        "CES",
        "Razer"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "MONEY",
        "ORG",
        "PERCENT",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "PERCENT",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "NORP",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "ORG"
    ]
}