{
    "id": "uGX5wgFCk7M",
    "title": "Could Windows 10 Drivers Keep Your Gear Working FOREVER?",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-09-01T18:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=uGX5wgFCk7M",
    "category": "Science & Technology",
    "tags": [],
    "views": 202638,
    "likes": 14364,
    "comments_count": 820,
    "description": "Get 50% off your first 3 months of FreshBooks when you sign up for a paid plan at   If Windows 10 is the \"last version of Windows,\" does that mean we can say good-bye to the typical driver problems that arise when you upgrade to a new version of Windows?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.freshbooks.com/techquickie",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Unlike the 1990s and 2000s, where we expected a new version of Windows every few years, Microsoft seems pretty set on making Windows 10 the last version of Windows ever, incrementally updating it instead of replacing it with an entirely new version. I mean, we've heard nothing about Windows 11 or Windows 2K20, right? But this raises an interesting question. Do you remember how, whenever you upgraded from one version of Windows to another, some of your older devices may have stopped working, and there wasn't a good way to get them functioning again? This is often because of the device's driver, the piece of software that allows your printer, or whatever, and Windows to talk to each other. It doesn't play nicely with a new version of the operating system, making it necessary for the device manufacturer to write a new driver and make it available, and possibly for you to know that and then seek it out. But here we are on the last version of Windows, so does that mean that the RGB Trackball you've had connected to your rig since people were arguing about the dress is going to work forever? Unfortunately, the answer is probably not. You see, although there does not appear to be a true successor to Windows 10 coming, some of the incremental updates have changed the operating system in significant ways, including under the hood. In fact, Microsoft itself doesn't even support some older builds of Windows 10, with major revisions now receiving fewer than two years of support before being considered deprecated. Users have also reported hardware problems after major updates, and Windows 10 has even received criticism for automatically removing programs deemed to be incompatible with new revisions of the operating system during the update process. So not only are some major updates almost like getting a new version of the OS anyway, Microsoft also appears to be exerting more control over what kinds of software Windows 10 will even allow on the same system. And it appears that this does include drivers. Although most machines will continue to receive Windows 10 updates as they're rolled out, Microsoft itself has come out and said that some systems could stop getting updated as time goes on, and one reason for this is if there aren't current drivers. And remember that most current device drivers are actually written by the device manufacturers, not by Microsoft. So, similarly to the days when we actually upgraded from, say, Windows XP to Windows Vista, yes, I use the word \"upgrade\" very loosely there, there may come a point in time where you'd have to stick with an older build of Windows 10 if you want to keep full functionality of your devices. But this is a lot trickier than keeping your old Windows 95 machine around to play \"MechWarrior 2\" because of how Windows 10 makes it extremely difficult to disable updates as long as you're connected to the internet. But why wouldn't device manufacturers be nice, and just release updated drivers? Well, the folks that make mice and scanners or whatever else are constantly updating their product lines and releasing new gadgets, and they'd rather put their time and effort into selling new products and supporting their latest offerings instead of writing drivers for older models that few people are using. However, the good news is that Windows 10 is a lot better at natively supporting many different models of hardware than Windows versions of yesteryear that often had a hard time recognizing products without a driver disk. Even if you have an older keyboard that you know and love that one day stops getting driver updates, the drivers built into Windows, or provided by a Windows update, should still provide core functionality. So it could get to a point where you can still keep your old gear, but maybe not all the bells and whistles work quite right. Kind of like your uncle's station wagon which is still going strong despite having a duct tape bumper. Big thanks to FreshBooks for sponsoring this video. Check out FreshBooks, the small business cloud accounting solution that lets you work anywhere with their mobile app and create professional-looking invoices in seconds on the go. You can even snap pictures of your receipts so you don't lose them, because who cares about physical stuff? Never miss an update either. See when a client has viewed their invoice, or when one is overdue. And new on the iOS app, you can track your mileage as you drive, so you can maximize your deductions at tax time. Get 50% off your first three months of FreshBooks at freshbooks.com/techquickie. So thanks for watching, guys. If you liked this video, give it a thumbs up, subscribe, and be sure to hit us up in the Comments section with your suggestions for topics that we should cover in the future.",
    "transcript_keywords": [
        "Windows",
        "version of Windows",
        "version",
        "Microsoft",
        "Windows versions",
        "pretty set",
        "updates",
        "drivers",
        "device",
        "Windows update",
        "Windows Vista",
        "older",
        "making Windows",
        "time",
        "operating system",
        "driver",
        "system",
        "software Windows",
        "update",
        "device manufacturers"
    ],
    "transcript_entity_values": [
        "your first three months",
        "one",
        "the days",
        "Windows",
        "Windows every few years",
        "Windows",
        "2000s",
        "seconds",
        "MechWarrior 2",
        "FreshBooks",
        "fewer than two years",
        "Microsoft",
        "Windows Vista",
        "Windows 10",
        "XP",
        "Windows 95",
        "one day",
        "the 1990s",
        "50%",
        "RGB"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "TIME",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "DATE",
        "PERCENT",
        "ORG"
    ]
}