{
    "id": "UH1qwWRJgXw",
    "title": "My NEW Gaming PC Build - AMD Ryzen 9 5950X & Radeon RX 6800 XT",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-11-21T17:15:59Z",
    "video_url": "https://www.youtube.com/watch?v=UH1qwWRJgXw",
    "category": "Science & Technology",
    "tags": [
        "amd",
        "gaming pc",
        "ryzen",
        "amd ryzen",
        "amd ryzen 9",
        "ryzen 9",
        "ryzen 9 5950x",
        "amd ryzen 9 5950x",
        "radeon",
        "amd radeon",
        "rx 6800",
        "rx 6800 xt",
        "radeon rx 6800 xt",
        "radeon 6800 xt",
        "amd 6800",
        "amd 6800 xt",
        "6800xt",
        "rx 6800xt",
        "amd 6800xt",
        "amd radeon rx 6800xt",
        "radeon rx 6800xt",
        "gaming pc build",
        "personal rig",
        "austin evans",
        "personal gaming pc",
        "amd pc build",
        "pc build",
        "computer build",
        "micro center",
        "microcenter",
        "rx",
        "xt",
        "5950x",
        "ryzen 5000",
        "this is",
        "the test drivers",
        "test drivers"
    ],
    "views": 1778645,
    "likes": 56657,
    "comments_count": 3158,
    "description": "Get a Free 32GB Flash Drive and 32GB Micro SD Card:  Get the best prices and best selection at Micro Center:  Micro Center Custom PC Builder:  AMD Radeon RX 6800 Benchmarks:    AMD Ryzen 9 5950X:  ASRock X570M PRO4 mATX Motherboard:  Corsair VENGEANCE RGB PRO 16GB (2 x 8GB) DDR4-4000 PC4-32000 CL18:  Samsung 980 PRO Series 500GB SSD:  EVGA SuperNOVA 850 Watt 80 Plus Gold Fully Modular Power Supply:  Corsair Crystal 280X Computer Case:  Corsair iCUE H100i ELITE CAPELLIX 240mm RGB Water Cooling Kit:  Corsair LL120 RGB Hydraulic Bearing 120mm Case Fan:  PowerColor Graphics Cards:   My new podcast @TheBackmarkers!  Our second channel @thisis!  My Twitch channel:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://rebrand.ly/jihkq",
        "https://rebrand.ly/fsyci",
        "https://rebrand.ly/3ofpv",
        "https://rebrand.ly/1vqb8",
        "https://rebrand.ly/79rdf",
        "https://rebrand.ly/qgp1b",
        "https://rebrand.ly/rxn1f",
        "https://rebrand.ly/tpzl8",
        "https://rebrand.ly/hnp34",
        "https://rebrand.ly/gjl2o",
        "https://rebrand.ly/enpra",
        "https://rebrand.ly/9g2om",
        "https://rebrand.ly/tiz05",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to our wonderful sponsor, Micro Center, where I'm about to embark on a gaming PC challenge. Tomorrow the RX 6800 and 6800 XT are launching, which means that I am going to be upgrading my personal gaming PC rig for the first time in a very long time. I'm going full AMD. Ryzen 9, 5950X and the 6800 XT. So let's go inside and begin our red future. That's the way- No, that's not the way to do it. The- - [Ken] That sounds grim. - [Austin] So this is what all the hype is about. The brand new AMD Radeon RX 6800 XT, with 16 gigs of GDDR6 memory, I can't wait put in my PC (upbeat music) tomorrow. Powering the system, I'll be using an 850-watt, EVGA SuperNOVA. This should be more than enough power for a Ryzen 9 and the 6800 XT. Cooling our Ryzen 9 processor, we have the brand new iCUE H100i CORSAIR Elite CAPELLIX. Now, not only does it have a 240-mil radiator, but importantly, it has that fresh new RGB look on the block. Which I think should look especially sweet, with all of our RGB throughout the system. So, do you have some memory for me by chance? I see 4000. Can I trouble you for that by chance? So, this is absolute overkill for a Ryzen 9. But, what? You clicked on the video for overkill. You didn't click on it for a boring town 5000. - Yeah, we can get a beige case from the back. No problem. - And when it comes to the motherboard, I'm gonna go with the ASRock X570M. Now, finding an X570 Micro-ATX board is not the easiest thing in the world. But the nice thing is, of course, we're not really losing any features, and I can load up with all the memory I want. For a case, we're gonna be using the CORSAIR Crystal Series 280X. We've actually used this case in a previous video before. But I really like working on this case, because it has a ton of room to hide your power supply and everything else in the back. So, to keep our RGB theme intact, we're gonna go with a set of the LL120s. Now, look, we've used these in a bunch of systems in the past. They are not only, probably, the best-looking RGB fans out there, but, importantly, fans to keep everything nice and cool. So when it comes to the SSD, the 980 PRO from Samsung has my name all over it. 7000 megabytes per second read speed. (upbeat music) - [Fan] No way! - I've been subscribed for like, the longest time ever! - Dude. - Can I get a selfie with you? - Of course. - (censored) Yeah. (both laughing) (upbeat music) - All right. It is launch day for the 6800 series and I am ready to build myself a brand-new gaming PC. So, of course, huge shout out to Micro Center, as always, for sponsoring our coverage. And specifically, if you haven't already gotten onboard with it, check out the link in the description. They're actually giving away a free 32-gigabyte MicroSD card as well as USB drive, and there's no purchase necessary. So, what are you waiting for? Just go, head into your friendly local Micro Center, maybe, get some parts but also, get your free stuff too. Whoo hoo hoo hoo. This is what I'm talking about. The Ryzen 9 5950X. That is gonna be- mm... I've actually not done a Ryzen 5000 build yet. The only compromise I had to make was literally just on the 500-gig 980 Pro. Now, there's no doubt this is the top dog on SSDs at the moment, however, I grabbed the very last one in the store. So I think at some point I may try to get another SSD but 500 gigs will definitely be enough to get me started for now. All right. - [Ken] We also have... - Oh. Right. I forgot about that, you know, the most important part of this entire video. Now, yes, of course, I could have waited a little bit longer for the 6900 XT, which is of course a more powerful card, but the price to performance on that one, I don't think is going to be as strong. As far as I'm concerned, the 6800 XT is going to be the sweet spot. It still has the same 16 gigs of RAM, very similar clock speeds, very similar across the board, except it has a slightly cut down CU count. But, I assume, obviously, not having tried the 6900 XT, that the difference won't be huge, and all the benchmarks, everything is sort of pointing toward this being a very close match, at least in gaming performance to the RTX 2080. 3080, 3080. I know my numbers. All right. Na, na, na, na, na, na, na, na, na, na, na. Oh, it's still in the package. (clears throat) Oh, that is some good foam. So, this case is pretty unique because, typically, when you're building a gaming PC, especially if you wanna try do something on the high end, you have two choices. You're either going to go for a very small ITX system, which there's certainly nothing wrong with that, or you go for a fairly large chassis. There's not a lot of, sort of, middle ground options. And for me, I want more than one PCI slot. So I wanna be able to connect something like a 4K capture card via PCI. But I also want to have something which is not going to be enormous, because I usually do keep my PC on my desk. So one of the nice parts about this system is you have two windows. You have one up front and we have one on this top. But on top of that, if you come around to the backside, you have this, I would say a basement but it's on the side. But you have this back area where you can put your power supply, you can load up drives, or importantly, hide all your cables. So I am not going to be giving you a full tutorial on how to build a gaming PC. I have done that many times. In fact, I actually did one earlier this year if you want to check it out, where we shot it actually at the Micro Center store. I will say the black and white color scheme is already- I'm already happy with it. Having some contrast, I think, is always important for a system, right? - [Ken] You're gonna have white RGB anyways, right? Or white LED? - I think so. We'll play around with it. I think I wanna go with, mostly, white on the RGB. All right, here we go. Time to install the Ryzen 9 5950X. But this should be pretty much, hands down, the best gaming, streaming and all-around badass processor that you can buy today. Now, I will, primarily, be using this for Google Docs. But secondarily, I will also be using this to stream as well. Now do I need- - [Ken] Wait. - Yes, I will be back to streaming. - [Ken] Really? - Part of the reason I haven't been streaming lately is because my personal PC has been taken apart, and I've completely redone my office so I had no desk or chair to stream with. But, stay tuned, subscribe, follow, Twitch, all that kind of fun stuff. So, of course, we're looking at 16 Zen 3 cores, a clock speed of up to five gigahertz, and we'll see how far we can overclock it. Again, keeping in mind, I'm not going to go crazy on it, but, you know, couple megahertz here, a gigahertz there. It never hurt anybody, right? - [Ken] Oh, there we go. - That is the move. 32 gigs. All four DIMMs loaded up, with the 4000 megahertz DDR4. (Austin sniffles) Ah! I love the smell of gigahertz in the morning. It's gonna be so good, I'll gigahert later. - [Ken] 'does that even mean? What does that even mean? That drink's been sitting there for 38 hours. - Tastes delicious. - [Ken] Is that mold or matcha? (Ken laughing) - I'm gonna ignore your rude comment and continue with my super cool gaming PC build. (screwdriver revving) That's not as far in there as I think it should be. Why is that not in there as far as it should be? - [Ken] Spacer, or... - But why was that already there? No, no, no, no, no. We're done filming. You can stop filming now. We're done. It's fine. I definitely didn't glue my SSD down slightly out of the position it should have been. Put the camera down. I definitely didn't just screw this up and I have to gently extract it. I slightly misaligned it, okay? These things happen. Sometimes, you slightly misalign it. - [Ken] Thank God, you're not trying to have kids, Austin Evans, (Austin mocking crying) are you? Maybe we know why you don't have them. (Austin laughs) - Big Yikes. Okay. What do we have in here? Oh my God, look at the size of that block. - [Ken] Oof. - That is huge. So, I gotta unscrew that. Nah, yeah, yeah, yeah. I have to unscrew that. Okay. (upbeat music) It's where we start playing dubstep. The kids like dubstep, right? You know, for the montage, it's like, (mimics dubstep music) And we get, like, the RGB lights in here. Kids love that. (dubstep music) (screwdriver revving) (dubstep music continues) All right. Here goes nothing. (dubstep music) (screwdriver revving) All right. So the system is an absolute mess right now. The power supply is technically out of the system, even though everything is connected. So let's see if we can actually get it to post or whether or not we're going to be sad boys. Here goes nothing. Whoo. That. That is some rainbow puke, if I've ever seen it? - [Ken] Oh, that block looks really nice. - [Austin] Damn. - [Ken] Wow. - [Austin] This thing is ridiculous. There we go. So, we have Ryzen 9 5950X, we have all 32 gigs of our memory. And, obviously, our GPU is up and running. I think we have successfully built a gaming PC. So, now, excuse us while we spend the next three hours cable-managing and RGB-tuning. And then let's take a closer look at my new gaming PC and see exactly how powerful an all-AMD setup can be in 2020, or 2021, by the time you're watching this video. And we're done with RGB-tuning. And so, the personal all-AMD gaming PC is complete, at least for now. So we spent most of the day getting this thing all sorted. So now that we have the cable management done, we have the RGB set to... surprise, surprise, white. Now, we played around with a couple of options. So, I mean, if we really wanna lean into the AMD side of things, we could set it to be all-red. This just looks like our murder PC and I don't really think that that's the style I want to go for. I personally think it looks really dope, just setting it all to pure white, especially 'cause it sort of gives you all that sort of look inside at the super clean build that we've done. Ryzen 9 5950X. We also have, of course, that 6800 XT, which aesthetically is the only thing that has a little splash of colors. Of course, you have the red sort of ring around it, as well as the glowing Radeon logo, that can't be changed. I personally think it's fine. Now, beyond that, let's actually take a closer look at how this thing performs. Surprisingly, exactly, no one: it is really, really fast. The 5950 X is, hands down, the fastest gaming CPU out right now. And it's one of the fastest CPUs, full stop. So especially when you put it alongside my previous build, which is using a 2080Ti, it is a significant step forward. And, of course, when you look at the price to performance against something like the RTX 3080, it's a little bit more complicated. So this card, if you can find one, because, of course, all these are out of stock right now, costs about $50 less than an RTX 3080, and pretty much matches it in gaming performance. It also has 16 gigs of RAM as opposed to 10 gigs of RAM on the 3080. But on the flip side, that 3080 has a ton of additional features. So it has much better ray-tracing support, so you're gonna get better performance there, as Nvidia's DLSS. And you also have a lot of the RTX-specific features, like RTX Voice and a much better encoding engine, which is important if you are doing streaming. So, of course, the game they're actually going to be playing all the time, is F1 2020. I have no doubt that this will be incredibly smooth and I will have zero problems. No doubt whatsoever. (upbeat music) Wow, that is so fast. Did you see how fast that loaded? Are you serious right now? Damn. So, with 200 frames per second, F1 is absolutely no problem here. And the nice thing about this system, is that no matter what I wanna do with it, I should have no problems, right? Actually, I really like this Alienware monitor. So, this was, actually, originally from BROKE vs PRO, I think. This is your setup for the flight sim video, right? - [Ken] Yes, you are taking my monitor. - Yes, I am. See, Micro Center likes me sometimes, too. So what can we say about this system? Well, I certainly have more work to do. So I need to not only optimize the fan curves, because it is a little bit loud right now, as well as, I might see about maybe moving that Rad up front. It might make more sense instead of having it in the top, 'cause I might have some cleaner airflow. But the main question is going to be, \"How well does this hold up long-term for my ultimate gaming personal setup?\" So make sure, subscribe to the channel for lots more about this wonderful, wonderful new build of my life. And again, huge thank you to Micro Center for sponsoring this video. Definitely, be sure to go check them out and all the parts I used, at the links in the description. Now, if you excuse me, I am going to go learn how to drive better with a controller. (upbeat music)",
    "transcript_keywords": [
        "Micro Center",
        "gaming",
        "Ryzen",
        "RGB",
        "system",
        "Micro",
        "Center",
        "thing",
        "gigs",
        "build",
        "time",
        "white",
        "video",
        "Micro Center store",
        "Yeah",
        "case",
        "AMD",
        "RTX",
        "nice",
        "gaming performance"
    ],
    "transcript_entity_values": [
        "first",
        "5000",
        "ITX",
        "two",
        "2020",
        "AMD",
        "XT",
        "four",
        "2080Ti",
        "one",
        "32",
        "240-mil",
        "a ton",
        "Ken] Oof",
        "AMD Radeon RX 6800 XT",
        "32-gigabyte",
        "Micro-ATX",
        "MicroSD",
        "GPU",
        "9",
        "the Micro Center",
        "4000",
        "2021",
        "Austin Evans",
        "38 hours",
        "launch day",
        "Alienware",
        "the day",
        "USB",
        "Ken",
        "Austin",
        "CU",
        "RTX Voice",
        "Nvidia",
        "7000 megabytes",
        "16",
        "500",
        "SSD",
        "PCI",
        "zero",
        "Twitch",
        "today",
        "Radeon",
        "AMD",
        "Rad",
        "X570",
        "10",
        "RGB",
        "6900 XT",
        "6800",
        "5950X",
        "9 5950X",
        "3080",
        "Ryzen 9",
        "SuperNOVA",
        "Tomorrow",
        "tomorrow",
        "CPU",
        "Ryzen",
        "CORSAIR Elite CAPELLIX",
        "ASRock",
        "EVGA",
        "RAM",
        "Samsung",
        "about $50",
        "3080",
        "the CORSAIR Crystal Series",
        "Google Docs",
        "Whoo hoo hoo hoo",
        "F1",
        "more than one",
        "4",
        "850-watt",
        "second",
        "Micro Center",
        "4000 megahertz",
        "200",
        "the RX 6800 and 6800 XT",
        "2080",
        "earlier this year",
        "up to five gigahertz",
        "the next three hours",
        "3"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "DATE",
        "PERSON",
        "TIME",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "LAW",
        "DATE",
        "DATE",
        "QUANTITY",
        "TIME",
        "CARDINAL"
    ]
}