{
    "id": "UhHoF924E6o",
    "title": "Sponsors should be SCARED - AnkerWork B600",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-02-02T19:19:20Z",
    "video_url": "https://www.youtube.com/watch?v=UhHoF924E6o",
    "category": "Science & Technology",
    "tags": [],
    "views": 555602,
    "likes": 21555,
    "comments_count": 1255,
    "description": "Thanks to AnkerWork for sponsoring today's video! Check out The B600 video bar at US:  UK:  DE:   Webcams are pretty standard to be built into laptops, but they usually use a bit rough and something to check the box for specs. External webcams are fairly popular today since they offer better quality, but we were always interested to see what's inside. Sorry AnkerWork, but we're cracking this one open!   Buy iFixit Pro Tech Tool Kit   Amazon:    Best Buy:   Buy Dell XPS 15 Laptop   Amazon:    Best Buy:    Newegg:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS ---------------------------------------------------   0:00 - I'm so sorry 0:25 - Unboxing 0:41 - Physical impressions 1:24 - Specs and resolution thoughts 2:05 - Webcam comparison impressions 3:45 - Trying out the light bar 4:07 - Ankerwork webcam adjustments 5:00 - Self-framing camera 5:14 - Conference call impressions 5:33 - Microphone impressions 6:23 - Speaker test 7:11 - Dissecting the AnkerWork B600 8:45 - Processing chips 9:30 - Camera module and sensor 10:18 - Outro",
    "description_links": [
        "https://ankerwork.co/B600US",
        "https://ankerwork.co/B600UK",
        "https://ankerwork.co/B600DE",
        "https://geni.us/dm2phVx",
        "https://geni.us/iEWVm",
        "https://geni.us/cTfvfro",
        "https://geni.us/e3ZWUBF",
        "https://geni.us/3p2Fjb0",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- I'm sorry, Anker! (man cries) - Today we have the AnkerWork B600. What is it? Video bar. It's basically just a webcam, but a pretty fancy webcam. They call it like, a studio all in one kind of thing. This video is sponsored by AnkerWork, and I agreed to do this on one condition. I get to take it apart at the end. So let's give her. (laughs) We have three of them, and one of them is not surviving the day. (box thuds) Oh, fancy! Look at this. Download the software. I already did. So it looks like that you get, a variety of different chargers. They didn't feel like localizing it for different regions, so you get a bunch of different options. Here we go! - [Man] Oh that's big! - Yeah, this thing's big! Look at this! It has this kind of like, I don't know what you call this, fabric? It reminds me of, what's that really stupid PC that HP made ages ago? They made an all-in-one that was like a trash can Mac, but covered in fabric. - [Jono] Yeah, Pavilion Wave! - [Host] Yeah, (laughs) I think it's hilarious! It has like a really satisfying heft to it though. It feels decent. There might be some aluminum in here. No, it feels like plastic. How much does it cost? 220 US. So the basic operation is you have a light bar that flips up like that. So it not only functions as a light bar, but also a privacy filter. So you don't have to worry about, people looking at you through your webcam when it's off. So in here you get a 2K sensor, that's 1440p, 16 by 9. That's way higher resolution, than your laptop camera probably is. Chances are it's like a 720P, maybe 1080P if you're lucky. What do you think the bit rates are Brandon, in like Skype? - [Brandon] Terrible! - Yeah, you're not getting 4k through that, but the better the image that you put in, the better an image you are going to get out, kind of no matter what. You also have four microphones in this. I don't quite know what the layout is, but I'm guessing two of them are to pick up your voice, and two of them are for noise canceling. Did you say there's speakers in this Jono? - [Jono] Yep. - Wow. I wonder if they're any good? First let's do a little baseline reading here. So here's our test. This is the XPS 15 webcam, and if it can't beat this, the video is not going up, because this laptop has a terrible webcam. It comes with this little like monitor clamp chummy, but also in the bottom it has a quarter 20 thread, so you can put it on a tripod or something like that. This is gonna be really big for my laptop. I feel like this is supposed to be used on a desktop. Oh geez. That's pretty good! (laughs) What a unit! That is beautiful! (laughs) - [Jono] I wonder if this will unlock Windows Hello. - Oh, I do wonder if it has Windows Hello. I didn't see it mentioned so I'm guessing not. I also don't know if I can test that either way, because this laptop has Windows Hello, and I think they'll get mad at each other. One unfortunate thing is that you have to have two USBs going into this. I'm guessing because this light probably draws, a little bit of current and the other one for data. I do appreciate that they included type C for this, but I do kind of wish they had a type C to A adapter. Yeah, Riley, take a look at this webcam! - [Riley] Huh? Is it 4K? (chuckles) - No, it's 1440P. - [Riley] Is it 8K? - It's definitely not 8K. You're asking the wrong questions here Riley. - [Riley] Why's it so big then? - It has a light bar. Oh yeah. Jeez! (Riley laughs) No one wants an 8K webcam Riley. Go away! - Speak for yourself! - (chuckles) It seems like that the Anker software and OBS, don't like each other very much, so set up your settings in here, close it, and then start streaming, if that's what you plan on using this for. Wow, that's a lot better than the XPS webcam. Like it damn well better be, it's $200 webcam as opposed to, one of the worst laptop cameras. But it is way better. So let's just start this light. Okay, that's not doing a whole lot. Can we turn off the lights? Yeah, so one tap on the side, turns it on and off. And there's a little slider in the center, that can change the brightness for you. So it looks like I can change the color temperature. Let's try blue. That's very blue, looks kind of odd. I personally like it right around there. It's a little bit on the warmer side but not too bad. Let's see what brightness does. Yeah, that's a brightness slider for sure. Now sharpness. Oh jeez! That's pretty scary. Let's just turn that down. Saturation. Looks like I got a bad spray tan now, if that's what you're into and going the other way I look like I'm dead! Cool! And finally, the contrast ratio. It's going here, yup. So I guess what we've learned is don't touch these sliders, because the auto settings are pretty good. Let's see here. We have a couple of different field of views. So 65 is kind of zoomed in. 78 is standard and looks fine to me. And finally we have self-frame. How good is it? Let's find out. I'm over here. (exclaims) Hello! Can you zoom in any more? Let's see. I'm gonna move over here. Aha! It is tracking me. Hey Jono, do you wanna do a real world test? - [Jono] Yeah! - How do I sound? - You're looking all sharp! Yeah, you look all sharp. I can see almost every strand of your hair. And behind you, the foam, I can see all the foam bits. - Yeah, your forehead looks super blown out. You need to get one of these. Come grab the other one! - [Jono] Do you sound the same anywhere in that room? - I don't know. Find out. So I'm going to speak, and then I'm going to walk around the room. So I'm gonna talk and keep on talking and walk around here, and continue talking and let me know, if that sounded just totally fine as I did that. - The Anker webcam would just kinda like start boosting the audio, so I can definitely hear that. - Okay. Now let's try it, with the one that's built into this computer. Does that sound different? - Yeah, I can definitely hear some sort of, I think the fans going. - Yeah, the capture laptop's really giving in. Can you hear me fine from over here? - [Jono] Yeah, I can definitely tell that you're far away. - Look, and I do have noise suppression just totally off in Teams, so this is all webcam and not Teams doing it. Sorry I'm getting distracted Jono, but I wanna do a little crab rave for a second. (upbeat techno music) This is better than a lot of laptops. I switched to the XPS speakers. (upbeat techno music) This is the sort of thing where like, it's obviously not as loud, or generally as good as the XPS 15 speakers, but they didn't do what a lot of small speakers do, and make it sound terrible. They could have easily make this twice as loud, probably by over driving the speakers, and having it just be a distorted mess. But instead it's like pretty clean. I'm guessing for conference calls, it'll be more than adequate. All right. Second unboxing! I'm sorry Mr. Webcam for what's about to happen to you, but I wanna have some fun. First thing, it appears that you can take this base off. Let's start with that. I have a bad feeling we're going to have to, do a little bit of cutting here soon. If there's a way to get in through here, that will be amazing, there we go. Oh, it's another quarter 20 on the bottom though! That's nice to see. I'm sorry Anker! (man cries) This is never going back together the same way. (drill whirring) Okay. So the back has a couple plastic clips and a lot of tape. It's actually kind of like foamy tape as well, so probably helps a bit with the sound of it. This just comes apart right like that. Oh, there's our speakers! Look at these. So they're packaged on either end, firing outwards I guess, which is kind of strange, but at the same time, like where else are you going to put them here. Got a little metal shield here. That's probably just for EMI compliance crap. So just making sure that this doesn't, put out random electromagnetic radiation crap, and doesn't accept it either. Oh, this also acts as a little heat spreader. So we're cooling these two chips right here, and this right here has a little bit foam on top, probably just to keep this clip in. This one right here is a USB interface chip. That makes sense. There's probably just to power management crap. We didn't need to cut the mesh. That was just unfortunate. Before you say it in the comments, I am not water cooling a webcam. So right here we have the Rockchip RV1126. Apparently it's a quad core that has 2.0 TOPS. I don't know what TOPS are. Oh, this is a RISC-V processor! That's sick! We did a video with them a while ago, and they're integrating their chips into a bunch of different stuff like this, where you don't necessarily need all the overhead of ARM or x86 chips and you just want to get an image off of it. It looks like this XMOS chip right here, is what is doing all of the AI processing. But it is super cool that they're doing the AI processing on chip instead of in their software, so it'll just work when you plug it in, instead of having to install Anker software for it to work, which makes sense. Do do do do There's the speakers. Now onto the star of the show though, let's take a look at the sensor. Here's the camera module. Crack it open. I wanna see how big the sensor is. We gotta go all the way. Yeah, so I just broke the lens off. It seems like that they attached it, just using a couple of bits of solder, which makes sense. It looks like at the back here we have the IR filter. Every digital camera is an infrared camera. You just need to filter that out, otherwise everyone looks super weird. It seems like this is a voice coil. You probably can't really tell, but the auto-focus is done by moving this in and out ever so slightly and I'm guessing it's done in a similar way to how a speaker works. And finally we have the sensor. Yeah, there it is! It's so little! Just powers the light, and the rest of this looks like it just goes towards the touch controls on the sides and the front. So there you go! Check out the AnkerWork B600 at the link down below. It looks like this or like this on the inside. Huge thanks for letting us take it apart guys. If you have another video that you want to watch, go watch the Walkcar, that was fun. (laughs) Fun to work for it.",
    "transcript_keywords": [
        "Yeah",
        "webcam",
        "kind",
        "speakers",
        "Anker",
        "bit",
        "light",
        "laptop",
        "XPS",
        "guessing",
        "Video",
        "big",
        "thing",
        "pretty",
        "lot",
        "good",
        "sound",
        "light bar",
        "Windows",
        "Anker software"
    ],
    "transcript_entity_values": [
        "65",
        "EMI",
        "Windows Hello",
        "webcam",
        "the day",
        "Anker",
        "15",
        "Webcam",
        "1440P.",
        "three",
        "One",
        "HP",
        "K webcam Riley",
        "4k",
        "one",
        "US",
        "4",
        "8",
        "Riley",
        "USB",
        "the Rockchip RV1126",
        "Mac",
        "OBS",
        "9",
        "Skype",
        "Today",
        "second",
        "ages ago",
        "Jono",
        "AnkerWork",
        "Second",
        "Walkcar",
        "Anker",
        "Brandon",
        "XMOS",
        "16",
        "two",
        "220",
        "Riley",
        "four",
        "200",
        "XPS",
        "First",
        "2",
        "20",
        "IR",
        "2.0"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "FAC",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}