{
    "id": "uhNFRYKRGco",
    "title": "How To Waste $40 on Amazon...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-05-01T16:22:14Z",
    "video_url": "https://www.youtube.com/watch?v=uhNFRYKRGco",
    "category": "Science & Technology",
    "tags": [
        "amazon",
        "tech",
        "gadgets",
        "unboxing",
        "gadget",
        "review",
        "cool tech",
        "2018",
        "on amazon",
        "smart gadgets",
        "new tech",
        "cheap tech",
        "laptop",
        "headphones",
        "audio",
        "microscope",
        "digital microscope",
        "is it worth it",
        "why does this exist",
        "how to waste",
        "austin evans",
        "toy"
    ],
    "views": 1395085,
    "likes": 29325,
    "comments_count": 1315,
    "description": "The best cheap headphones I've tried on Amazon:  Learn how to use a cell phone on Amazon:  Build the ultimate portable laptop desk on Amazon:  This handheld trackball mouse on Amazon:  A surprisingly cool digital microscope on Amazon:  The tiny Sphero Mini robot on Amazon:  Chippies robot dog toy on Amazon:   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://austin.tech/sr850",
        "http://austin.tech/cellphonebook",
        "http://austin.tech/connectadesk",
        "http://austin.tech/trackballmouse",
        "http://austin.tech/digitalmicroscope",
        "http://austin.tech/spheromini",
        "http://austin.tech/chippies",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "(paper slapping) (gasp laughing) - Hey guys, this is Austin. Wow I've never been interrupted that badly by construction before. And today we're were here with Mystery Tech Under $40. This is gonna be fun. Time for kids, Cell Phone Pros and Cons. Okay, hold on a second, what year is this from? This is from 2018? This is from 2018, this looks like a 1997 thing. Some people spend too much time on their phones. They talk, text, and play games all day long with few breaks. These people have what's known as cell phone addiction. I bet you're watching this video on a cell phone right now, aren't you, Jimmy? I will not post photos and video of other people without asking them first. I will ask my parents before I download a new app. Man, what practical and legitimate advice for, what I'm sure are eight year olds. (chuckling) I don't really know what to say. Ah, okay. Connect-a-desk, the desk that connects to you? Oh, what? (laughing loudly) Wait a minute, wait a minute, wait a minute. Hold on, hold on, hold on. $54.74, $54? That's not $40. To be fair, before shipping and handling it was $44. I'll give you a tentative pass there. I get my shoulders in here, and then put it over. Ready like, oh yeah, yeah, there we go. There we go, that's much more like it. I feel ready to use a laptop already. So let's say I want to use my laptop here, hands free of course. I'm just gonna open it up. Actually it's only really big enough for an 11 inch MacBook. This doesn't seem like the dumbest thing I've ever used. What's that? What is this? A trackball mouse, wait? There's no, whoa, whoa, (laughing) So it comes with a USB receiver. So I plug it into my MacBook here. What? Hold on, hold on, this is a game changer. So I've got, if you can see here, the trackball. So basically the trackball as well as an inside little click. It feels like the worlds cheapest HTC Vive controller. Look at that, this is really dumb. I don't know what I'm doing with my life at all right now. Wait headphones? Wait, this actually looks okay. So these are the Samson SR850 Professional Studio Reference Headphones. And at what, less than 40 bucks I hope? - [Ken] 40. - Oh exactly 40, okay. It's very plastickey, but they feel like they should cost a lot more than 40 bucks. Okay, okay immediately when I hear $40 on headphones my instinct is that they're going to be garbage town. But these actually sound pretty good, and especially for open-design headphones, they actually have a surprising amount of bass. - [Ken] They're actually $32. - $32! What a relative bargain. Alright you know what, 32 bucks? Dude, I mean this is a no-brainer. If you're looking for a decent pair of headphones, especially if you're on a budget, these are, that's legitimately surprising. And I know that it might be hard taking advice from a guy with a MacBook attached to his back, but trust me when I say, for 32 bucks you're not gonna get much better than this. Can I actually take this off now, or are there more things? Oh no, wait, digital microscope? Oh hey we've got a signal. Wow, that is a ton of detail. Huh! Now we've got the flux capacitor. Yo, this is actually pretty cool. I mean it's kind of useless, and I don't know why anyone actually really needs this? But whatever. The cool thing though was this app actually will allow you to take photos and video. So if you want to like snap a cool shot of the inside of your DeLorean, it actually does kind of work. At first I was like, awe, this is gonna be weird and like crappy, but no it totally works. And you can get really, really close. Like I'm just gonna, literally just put, like right on top of this. You can see like the individual pockets of rust. You also can not hold it steady at all. Alright for 40 bucks, it's a little bit of a novelty. It's a little bit weird, but especially if you do anything with super detail things, like models or whatever, this actually is kind of a cool way of being able to take pictures, video, sort of whatever the case is, with something that's gonna be really, really small. What is this? Sphero Mini, oh, I've actually played with Spheros before. We did the Cars thing. Rotate the white dot until the blue light on the robot is pointing at you. Alright, touch and drag to move. Whoa, okay that's fast. No, this way. Yeah there we go, yeah! Woo-hoo. Face drive, yeah I'd like to do face drive. How do you do this? Okay hold it near your face and use your facial expressions to drive, okay. Oh it does it, it does it. Wait, whoa, whoa, whoa. (chiming music) Wait, neutral, neutral, okay. (laughing) I guess this is a thing. I don't know, I mean, I'm sure some people are gonna think that this is really fun. I think with enough practice you could probably get better at it. (box thumping) Oh no, no! Didn't you, we already did this with the robot. The robot dinosaur? I don't, Pet me, I react to your touch. Let's go for a walk. (electronic barking) What? (laughing) Okay, no don't do that, don't do that. (robotic barking) Wait can you come forward? (electronic barking) Okay hold on, hold on, wait. Alright, oh. Chippy's mean, this is like angry chippy. (low barking) Terrible guard dog. So anyway, hopefully you guys enjoyed this wonderful look at toys, that you totally were expecting to find when you clicked on this video. If you want to find links to any of this stuff that actually is pretty good in this video, including those headphones, the link will be in the description. Anyway guys, thank you so much for watching, and I will catch you in the next one. Chippy will not catch you in the next one.",
    "transcript_keywords": [
        "Wait",
        "hold",
        "Austin",
        "whoa",
        "Cell Phone",
        "Mystery Tech",
        "headphones",
        "video",
        "Cell Phone Pros",
        "thing",
        "bucks",
        "yeah",
        "people",
        "Pros and Cons",
        "Phone",
        "Alright",
        "Cell",
        "cool",
        "Phone Pros",
        "Wait a minute"
    ],
    "transcript_entity_values": [
        "less than 40 bucks",
        "MacBook",
        "2018",
        "Sphero Mini",
        "MacBook",
        "44",
        "first",
        "USB",
        "40",
        "Cell Phone Pros and Cons",
        "Spheros",
        "Jimmy",
        "40",
        "Austin",
        "32",
        "40 bucks",
        "32 bucks",
        "second",
        "54.74",
        "54",
        "a ton",
        "eight year olds",
        "Yo",
        "DeLorean",
        "the Samson SR850 Professional Studio Reference Headphones",
        "a minute",
        "Chippy",
        "Mystery Tech",
        "more than 40 bucks",
        "today",
        "1997",
        "HTC Vive"
    ],
    "transcript_entity_types": [
        "MONEY",
        "FAC",
        "DATE",
        "PERSON",
        "ORG",
        "MONEY",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "MONEY",
        "GPE",
        "MONEY",
        "MONEY",
        "MONEY",
        "ORDINAL",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "PRODUCT",
        "ORG",
        "MONEY",
        "DATE",
        "DATE",
        "ORG"
    ]
}