{
    "id": "uKhySSs08tk",
    "title": "Dynamic ARP Inspection: Stop Kali Linux ARP poisoning attacks",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2020-02-11T16:42:19Z",
    "video_url": "https://www.youtube.com/watch?v=uKhySSs08tk",
    "category": "Science & Technology",
    "tags": [
        "kali linux",
        "kali",
        "arp",
        "arp inspection",
        "dynamic arp inspection",
        "ccna",
        "ccna 200-301",
        "address resolution protocol",
        "what is arp",
        "how arp works",
        "cisco",
        "ccnp",
        "mac address",
        "ccna training",
        "cisco ccna",
        "ccna study",
        "cisco certifications",
        "cisco training",
        "cbt nuggets",
        "ccnp training",
        "ccent",
        "ccna study guide",
        "how to study for ccna",
        "ine",
        "hacking",
        "hacker",
        "ethical hacking",
        "comptia network+",
        "comptia",
        "security+",
        "comptia security+",
        "vcp",
        "ine training",
        "new ccna",
        "cisco ccna certification",
        "linux",
        "gns3"
    ],
    "views": 38244,
    "likes": 1515,
    "comments_count": 82,
    "description": "DAI is now part of the CCNA 200-301 exam. You need to know both DAI and DHCP Snooping for the new CCNA exam. Kali Linux can be used to implement an ARP poisoning attack which can result in a man-in-the-middle attack to capture passwords. Stop ARP poisoning attacks by implement Dynamic ARP Inspection.   In a previous video I demonstrated how to use Ettercap and Kali Linux to capture usernames and passwords by poisoning the ARP caches of a Windows 10 computer and Cisco router. In this video I'll show you how to stop this type of attack.  ARP spoofing attacks and ARP cache poisoning can occur because ARP allows a gratuitous reply from a host even if an ARP request was not received. After the attack, all traffic from the device under attack flows through the attacker's computer and then to the router, switch, or host.  An ARP spoofing attack can target hosts, switches, and routers connected to your Layer 2 network by poisoning the ARP caches of systems connected to the subnet and by intercepting traffic intended for other hosts on the subnet.   It's so easy to hack badly configured networks using Kali Linux! Ethernet networks rely on protocols such as Address Resolution Protocol (ARP) to function, but they can be easily manipulated using Kali Linux. Make sure you have configured your networks securely! Otherwise, look at how simple it is to hack networks using Kali Linux running on a Windows 10 computer. Applications like Ettercap make hacking with Kali Linux super easy! It's important that you as a network professional know how to protect networks from hackers. Even the new Cisco CCNA 200-301 exam covers some of these hacking topics. Don't just learn the theory of hacking, learn how to hack practically.   In this Ethical Hacking with Kali Linux playlist, I'm going to show you step by step how to hack and protect networks. This is white-hat hacking, not black-hat -  in other words this is about teaching you Ethical hacking to help you better secure your networks!  In this video I'll show you how to poison the ARP cache of a Windows 10 computer and then implement a Man in the middle (MITM) attack so you can see all data sent between the Windows 10 computer and it's default gateway. In subsequent videos I'll show you how to hack other protocols.  ====================== Menu: ====================== Overview: 0:00 Enable DHCP Snooping: 4:33 Enable and verify DAI: 9:30  ====================== Cheatsheet PDF: ====================== Dynamic ARP Inspection:   ====================== Previous Video: ====================== Kali Linux: Hacking ARP:   ====================== CCNA content: ====================== Free CCNA content:   CCNA course:   kali linux Hacking Ethical hacking CompTIA Linux+ CompTIA Security+ CompTIA Network+  EVE-NG GNS3 VIRL Packet Tracer CCNA Cisco Devnet Associate  CCNP Enterprise CCNP Security CCNP Data Center CCNP Service Provider CCNP Collaboration Cisco Certified Devnet Professional Cisco Certified Network Professional  LPIC 1  LPIC 2 Linux Professional Institute LX0-103 LX0-104  XK0-004   Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #kalilinux #ccna #kali",
    "description_links": [
        "http://bit.ly/dynamicarp",
        "https://youtu.be/ns7TYxNcYBM",
        "https://www.youtube.com/playlist?list=PLhfrWIlLOoKM3niunUBTLjOR4gMt_uR_a",
        "http://bit.ly/2PmTVPD"
    ],
    "transcript": "- [David] Zebra, what are you doing? - [Kid] Hacking. - [David] Are you a nasty zebra? - [Kid] Yes. - [David] (laughs) Well done, zebra. Let's break some networks. In this video I'm gonna show you how to implement dynamic ARP inspection. Dynamic ARP inspection stops attacks such as ARP poisoning and man-in-the-middle attacks. In a previous video, which I've linked here and below, I showed you how to use Kali or Kali Linux, if you prefer, to implement a man-in-the-middle attack by poisoning the ARP caches of devices. We had Kali poisoning the ARP cache of a Windows device and a Cisco router, and then, implementing a man-in-the-middle attack where all traffic from that Windows host to its default gateway, the Cisco router, was routed or switched, in this case, through the Kali Linux host. So Kali was able to see all the traffic from Windows to the router and Windows to the internet as an example. We were able to capture Telnet passwords and HTTP passwords. You shouldn't be using clear text protocols in your network today. So you shouldn't be using protocols such as HTTP or Telnet. But if someone did use clear text passwords, I'd have visibility of those passwords and have visibility of the data, because all traffic is sent through the Kali Linux host, which, in this case, implemented a man-in-the-middle attack. We can stop that kind of nonsense by implementing dynamic ARP inspection. Dynamic ARP inspection requires either DHCP snooping or that you manually configure MAC addresses. The switch is basically snooping or listening in on DHCP requests from hosts or devices to the DHCP server, and then, is creating dynamically, when using DHCP snooping, a MAC address to IP address mapping to an interface. So it says, \"This MAC address, this IP address \"belongs on this interface.\" If you change your MAC address, that traffic is denied. And I'm gonna demonstrate that using Kali Linux in this video. So I'm going to show you how you can implement DHCP snooping, dynamic ARP inspection, and then stop Kali from sending traffic when it changes its MAC address. So we're gonna stop ARP poisoning attacks. Now, to make it easier, I've added this presentation below this video. This presentation shows you the network that I'm using, and then shows you how to configure dynamic ARP inspection. So I've got links in here to Cisco and other websites that give you more information, but I also show you how to configure both DHCP snooping as well as dynamic ARP inspection. So in this video I'm gonna show you in quite a lot of detail how this all works. Use the menu here to jump to a specific topic, if you want to. So I'm gonna show you how to set up DHCP snooping, but I've covered that once again in this video. So if you just wanna see the dynamic ARP inspection part of the video, then jump to the specific timestamp of interest. I've included this, once again, below this video. This presentation shows you how to set this up, how to verify it on a Cisco switch. Okay, but before we get started, if you enjoy these types of videos, please consider subscribing to my YouTube channel, please like this video and please click on the bell to get notifications. It really does help me with the YouTube algorithm if you subscribe and like my videos. So if you don't mind doing that, if you enjoy this content, I'd really appreciate it. Okay. So let me show you how to set up dynamic ARP inspection. I've been in your waters I thought you were my love I know one thing for sure Now, the first thing we need to do is enable DHCP snooping. Now, I've covered this in a lot of detail in a previous video. So all I'm gonna do here is copy and paste the commands into the switch. Have a look at this video, if you wanna look at a DHCP snooping video that discusses this in a lot of detail. Okay, so what I'm gonna do is copy the commands from this presentation and paste the commands on our switch. Now, in our topology, once again, we've got a Cisco router. This router is configured with a DHCP server. So let's view that first. Here's the router. Show run | begin dhcp. That just allows me to filter the configuration until the keyword DHCP is found. So there's the command. Here's my DHCP pool. You can see the network used is 10.1.1.0/24. Default router, or default gateway, is the local router, and DNS server is set to Google. The router has this IP address 10.1.1.254 configured on gigabit 0/0. So this interface is configured with the IP address, 10.1.1.254, and the router is allocating IP addresses to devices, and we can see that by typing show IP DHCP binding. We can see that two devices have received IP addresses. This is the IP address allocated to Kali Linux. This is the IP address allocated to the Windows computer. We can verify that, by using the command IP address on Kali. Notice there's the IP address allocated to the Kali Linux host. And on the Windows computer, I'll open up a CMD prompt, ipconfig. This is the IP address of the Windows computer. So the DHCP server has been configured, it's allocating IP addresses to the devices in the network. What we need to do now is configure DHCP snooping. On the switch, at the moment, no DHCP snooping has been enabled. So you can see that no DHCP commands have been enabled and we haven't enabled dynamic ARP inspection. Okay, so the first thing I'm gonna do is copy the DHCP snooping commands to the switch. So I'll paste those in. And you can see here that DHCP snooping has been enabled globally. It's been enabled for vlan one, we've disabled option 82, and the command show IP DHCP snooping shows us that DHCP snooping is now enabled on vlan one, no trusted ports have been configured yet. Now, once again, I've shown you previously how to configure DHCP snooping, and I've explained it in a lot of detail, so I'm not doing that here. Okay, the next step is to configure trusted ports. In my topology, gigabit 0/0 is a trusted port. Okay, so in my topology, gigabit 0/0 is the interface that connects to the router. The router is running the DHCP service, it's allocating IP addresses. We wanna trust this DHCP server, we don't wanna trust this Kali Linux host as a DHCP server. So back on the switch, I'm gonna paste those commands. Gigabit 0/0 is now a trusted interface. Show IP DHCP snooping. We can see that gigabit 0/0 is now a trusted interface. Now, we can also rate limit DHCP requests, to stop a denial of service attack. So I'm going to rate limit DHCP messages to 10 packets per second on gigabit zero one, which is the interface connecting me to the Kali Linux host. Again, I've explained that in a lot of detail, in the previous video. So I'll paste that in. Go to type conf t first, so try that again. There we go. So show run interface gigabit 0/0 . We are trusting this interface, we are not trusting this interface. This interface gigabit 0/1 is being rate limited. 0/0 is being trusted. Okay, now that I've configured DHCP snooping, I can configure dynamic ARP inspection. Dynamic ARP inspection is fairly simple to configure. What we're going to do is configure it to globally on the switch, by using the command ip arp inspection vlan 1. So conf t ip arp inspection, specify the vlan. In my example, it's vlan one, because all ports on the switch are currently configured in vlan one. Now, typically, in the real world, you wouldn't put your devices in vlan one. You would put them in a different vlan. Now, notice what's happening. We're already seeing invalid ARP messages, received on gigabit 0/2, that is, the Windows host. We are not trusting anyone at the moment. We are basically blocking all traffic. So the Windows host is trying to get to its default gateway, so it's trying to get to 10.1.1.254. There's the IP address of the Windows host, MAC address of the Windows host, trying to get to its default gateway and the traffic is being denied. We can see that as an example on the Windows PC. If I try and ping the router, it's not gonna work. Traffic is denied. And actually let me demonstrate this. I'm going to remove dynamic ARP inspection. So it's removed. And what you'll notice is the PC, the Windows PC, can ping the router, but what you'll also notice is the Kali Linux host can ping the PC, which we don't want it to do, and it can ping the router. So Kali can ping both the Windows PC as well as the router. But as soon as we enable dynamic ARP inspection, we basically break the network, because notice traffic from 10.1.1.2 to 10.1.1.100 is being denied, because now, when we try and ping say, the Windows host, the traffic is denied. Kali is not able to ping the Windows host, and it's not able to ping its default gateway. The Windows host can't get to its default gateway. That's a problem. We want it to be able to talk to its default gateway. So what we're gonna do is set gigabit 0/0 as a trusted port. That's the port connecting us to the router. So on the switch, interface gigabit 0/0, ip arp inspection. I'll just use question mark again. Trust. We're going to trust that interface. So show run interface gigabit 0/0. This command shows us that this interface is trusted for DHCP snooping as well as for ARP inspection. So now can the Windows PC ping the router? At the moment we can see that it can't, we're still getting a whole bunch of denies on the switch. Show ip dhcp snooping. Let's look at the bindings. Notice the problem: There are no DHCP bindings at the moment. We are relying on the DHCP bindings database to implement dynamic ARP inspection, We need to have the bindings in the database for dynamic ARP inspection to work. So we're constantly getting these denies at the moment because there is no entry in the DHCP snooping database. So I'm gonna type ipconfig/release, to release my IP address. And then I'm gonna type renew, to renew the IP address on the Windows computer. It's now been given this IP address. Back on the switch, show IP DHCP snooping binding. We can see that this MAC address has been given this IP address. And we can see that via DHCP snooping on vlan one, the interface where that host resides is gigabit 0/2. So, back on the Windows PC, can it now ping its default gateway? And the answer is yes, it can. So remember, because we're using DHCP snooping, the PCs have to request IP addresses, and those IP addresses have to be allocated through DHCP. We've got to have DHCP snooping listening in on the conversation, seeing that to the router allocates the IP address to the PC and then, because of that, the DHCP snooping databases bolt, and dynamic ARP inspection can leverage that database to permit devices. So again, on the switch, show ip dhcp snooping binding, we can see that this IP address was allocated to this MAC address on this interface. Now, Kali can still not ping the default gateway, because an IP address hasn't been added to the DHCP snooping database. So what I'm gonna do is edit connections in Kali. I'm gonna go to IP version four settings, disable the interface, go back, and get it to to use DHCP. ifconfig shows us that it's got its IP address, Show ip dhcp binding on the switch. You can see that this IP address has been allocated to this MAC address, which is the Kali Linux host. MAC address ends in 5a:00, which is what we see over here. So can the Kali Linux host ping the default gateway? Yes, it can. So on the switch, once again, show ip dhcp snooping binding. We can see that two IP addresses have been allocated to specific MAC addresses. Show ip arp inspection. So there's the command again, we can see that it's enabled for vlan one. So many packets have been dropped. Now in Kali, once again, ifconfig shows me that this is the MAC address of the host, ending in 5a:00. On the switch, show ip dhcp snooping database. That MAC address has been allocated to this IP address. Kali can ping, default gateway. Once again, that IP address, this MAC address. Now I'm gonna change the MAC address by using macchanger. Macchanger tells us that we can see the MAC address by using -s as an option, and then we can create a random MAC address using -r or -r. So macchanger -s ethernet zero. That's the current MAC address. That's the permanent MAC address. Scrolling up once again, that's the MAC address that we saw previously with ifconfig. So let's create a random MAC address. MAC address, we've been told, is now this. So ifconfig shows us that that is the new MAC address that we've been given. Random MAC address. Can we ping the default gateway? Answer is no, we can't. And we're seeing a lot of denies on the switch. You can't just create some random MAC address or try and implement ARP spoofing or ARP poisoning, because we've now got dynamic ARP inspection enabled on the switch. And I'll just stop the ping on Kali. The only MAC address that's allowed is that Mac address on interface gigabit 0/1. This MAC address is permitted on gigabit 0/2. So by randomly changing my MAC address, using macchanger, from this address to this address, traffic is now being denied. It also stops someone from using an application such as Ettercap to poison the ARP caches. So again, previously, I showed you how to use Ettercap, to poison hosts on the network. So if I try and scan for hosts now, that traffic is gonna be denied by the switch because of dynamic ARP inspection. I can't implement ARP poisoning by using Ettercap unlike previously, when I demonstrated it in this video, because we've got dynamic ARP inspection enabled. Okay, very long video once again, but hopefully I've shown you clearly how to set up a dynamic ARP inspection and how to test it. You can, once again, download this presentation, if you wanna have a summary of what we've done and you wanna keep this as a reference. Please consider subscribing to my YouTube channel. It really does help me. Please like this video and please click on the bell to get notifications when I post a new video. It really does help me when you subscribe, like, and click on the bell. I've been in your waters I thought you were my love I know one thing for sure",
    "transcript_keywords": [
        "DHCP snooping",
        "MAC address",
        "dynamic ARP inspection",
        "DHCP",
        "ARP inspection",
        "dynamic ARP",
        "Kali Linux host",
        "ARP",
        "Kali Linux",
        "MAC",
        "address",
        "Kali",
        "Windows",
        "Windows host",
        "snooping",
        "inspection",
        "random MAC address",
        "Linux host",
        "DHCP snooping binding",
        "show"
    ],
    "transcript_entity_values": [
        "first",
        "Ettercap",
        "0/1",
        "Cisco",
        "two",
        "four",
        "Windows",
        "gigabit 0/0",
        "10.1.1.0/24",
        "second",
        "YouTube",
        "Google",
        "today",
        "IP",
        "Kali",
        "David] Zebra",
        "Mac",
        "Ettercap",
        "one",
        "MAC",
        "82",
        "-s",
        "Gigabit 0/0",
        "ARP",
        "0/0",
        "Cisco",
        "Kali Linux",
        "DNS",
        "vlan one",
        "Windows",
        "DHCP",
        "10"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL"
    ]
}