{
    "id": "uKrzHtWYQpg",
    "title": "Six professionals review the Mac Pro",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-03-02T19:18:17Z",
    "video_url": "https://www.youtube.com/watch?v=uKrzHtWYQpg",
    "category": "Science & Technology",
    "tags": [
        "mac pro",
        "mac pro review",
        "Mac review",
        "2019 mac pro",
        "mac pro 2019",
        "2019",
        "mac pro unboxing",
        "unboxing mac pro",
        "apple mac pro",
        "mac pro apple",
        "apple",
        "mac pro 2019 review",
        "mac pro hands on",
        "mac pro impressions",
        "hands on",
        "impressions",
        "first look",
        "mac pro 2020",
        "2020 mac pro",
        "final cut pro",
        "adobe",
        "software",
        "hardware",
        "display",
        "screen",
        "specs",
        "price",
        "battery life",
        "pc",
        "desktop",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "google",
        "iphone",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 667271,
    "likes": 15428,
    "comments_count": 1123,
    "description": "Apple's Mac Pro is not a single product. There are no stock configurations aside from the it-has-to-start-somewhere $5,999 base setup. Customers can configure almost every Mac Pro to order, all the way up to a top spec with a 28-core Intel Xeon W processor and two AMD Radeon Pro Vega II Duo GPUs that hovers near $54,000. Reviewing the new Mac Pro has been an interesting challenge.  Read the full review here:  And the Apple Pro Display XDR review here:   Vox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. For more information, see our ethics policy here:   Order at Apple:   Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "http://bit.ly/3afJKDw",
        "http://bit.ly/2wiac0F",
        "http://bit.ly/2TQsqjB",
        "https://fave.co/3aeW6M8",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "(upbeat techno music) - All right, we're finally doing it. We're reviewing the Mac Pro and the Pro XDR display. The Mac Pro is Apple's new high performance modular Mac tower for pros. Pro pros, actual professionals. This isn't Air Pods pro, fancier and more expensive. This is pro. You're gonna use this thing for making TV shows, producing music, building apps, stuff where you need all the power you can get. And the back story is that Apple basically forgot about this market for a long time. In 2013, it announced the previous Mac Pro, the round computer that we affectionately called the trashcan. It didn't update it forever and then after a lot of consternation about the future of the Mac, Apple admitted in 2017 that is had gotten the thermal design wrong and was gonna start over. Then we waited for another two years and now we've got this Mac Pro, the big dog, the most powerful Mac ever made. It's basically what people were asking for, it's a big tower, it's modular, you can spec it with a variety of processors and graphic cards, it's got a bunch of slots, a headphone jack, you can basically do anything with it. And let's be honest, the Mac Pro has actually been out for a little while and a lot of our friends out there on YouTube have been testing it. And all those videos are great, but that means to add to the conversation, we've gotta do something a little bit different. And then there's the problem, which is that the Mac Pro is endlessly configurable. You can buy the base model for $6,000 or you can spec it all the way out to $54,000 with a 28-core processor and two dual GPUs. So just picking a Mac Pro to review is a challenge. There's no way to pick a single configuration that's best for everyone, but we have an advantage. The Verge is part of Vox Media, and we know a lot of people here who work on fancy media projects. Just a couple floors below us, there's an entire team of people making Netflix and Hulu shows. We've got huge daily podcasts that come out, people here work on print magazine design, and of course The Verge's own art and video teams make illustrations and motion graphics for our site and YouTube all day long. So, we called everyone and asked them to use the Mac Pro and the Pro Display XDR to do their jobs. - Hi, my name is Murilo Silva I'm the director of post production technology here at Vox. - Hi, I'm Estelle Caswell, I'm a senior video producer at vox.com. - I'm Stevie Remsberg and I'm an art director at New York Magazine. - My name's Grayson Blackmon, I'm Senior Motion Designer at The Verge. - My name is Noam Hassenfeld, I'm a reporter/producer for Today Explained, which is Vox's daily podcast. - I've been building and maintaining post production facilities for about 16 years. Before I was here at Vox I was at a facility that did all the color work for \"Game of Thrones.\" - I've worked on the Netflix \"Explained\" series, but you probably know me from my music series \"Earworm,\" on Vox's YouTube channel. - The winner is the most feared song in jazz explained by Vox. - [Grayson] There was a time where if you watched TV, you probably saw a commercial I worked on. - All right, step one, we still have to configure a Mac Pro. - We wanted a machine that we will realistically use in our day to day. Specs are only half the story here because like most people, we also have to stay within a price range that makes sense for our business, which in this case was about $17,000. We felt 16 cores at 3.2 gigahertz was a sweet spot in terms of price performance for Adobe Premiere and After Effects. And of course, the dual Radeon Pro Vega two video cards to help crunch those GPU effects. At the price point we selected, we should be able to handle heavy editing workflows, raw footage in real time, and pretty decent color work in Resolve. We kept the RAM pretty modest, but did invest in an Afterburner card, which we probably won't use very much, but we really wanted to see how it performs. - So, that's our Mac Pro. Spoiler alert, we also bought a Threadripper PC to compare it to. One, two, three. We'll get back to that. So, how does this thing perform? - [Stevie] This is not faster than it would take me to do on my computer, just FYI. I use a 2019 iMac. I'm a heavy user of InDesign, Photoshop and Illustrator, and I dabble in After Effects if I'm attempting to make a GIF. It didn't feel faster at all. I was working off a server via VPN, so it's possible that was slowing things down, but I got the spinning ball often. I mostly just worked in InDesign and Photoshop as I normally would, but honestly, my current setup works fine for what I do. I rarely experience any issues with slowness. - Currently, I use a 2019 iMac and I mostly work in Premiere Pro and After Effects, though sometimes I dip into Logic and Photoshop. In After Effects, previewing comps with just a handful of effects can be laggy, so typically, I preview comps in a half or a quarter quality when I'm trying to work super fast. I was hoping that when I tested out the Mac Pro, I wouldn't have that issue, but I ran into the same problems that I do on my iMac at home. Like if I move a shape, all of a sudden, the picture will go from super clear to like incredibly pixelated. And the only way to get rid of that is to render the scene and play it. And the fact that it happened on this computer is pretty crazy. - I use a 2017 MacBook Pro. I have to work pretty fast on \"Today, Explained.\" Sometimes I only get a couple hours to turn around a project. But, I don't think the Mac Pro would help me do my job any better than I currently do it. All the programs that I use run just as fast on my current computer as they do on the Mac Pro, so there's really no point in getting a Mac Pro for me at my current job. But, if I were working on a much more intensive, maybe lush project with a hundred, two hundred tracks, I think the Mac Pro could make a difference. - At The Verge, I work on a late 2015 iMac. Womp, womp. I work primarily in Photoshop, Illustrator, After Effects and Cinema 4D. Deadlines are one of the biggest factors for me. Rendering can take a really long time, especially when working in 3D. I didn't notice any playback slowdowns, so in that regard, I guess it's much faster than my normal workstation. We created an animated illustration using Cinema 4D that we would have otherwise been unable to make. Having 32 threads meant that rendering using the CPU was much faster than my old iMac. The biggest thing was the individual apps themselves would be slow. In Photoshop, I tried to save a PNG and it took forever. Illustrator was also slow. Finding a use case that really pushed the GPUs was a challenge, especially because at the time I was using the computer, none of Adobe's software was optimized to use them. - Did you catch that? None of Adobe's software was optimized to use the GPUs. That's it. That's the big story with the Mac Pro. The hardware is way, way ahead of the software support. Those GPUs are really fast, if you can light them up. The Afterburner card seems really fast, if you work in ProRes and Final Cut Pro. Otherwise, you do get the benefit of having so many more CPU cores, but for a lot of people, it just didn't feel that much faster because the software we use just isn't ready. I mean, look, we tried to edit the review that you're watching right now on our Mac Pro using full res 4K video files in Premiere instead of lower res proxies and it dropped frames. I went and asked Adobe for a timeline and they basically told me they don't have one yet. And that's gonna be true for a lot of software, not just Creative Cloud. Apple hasn't had Pro machines at this class for a long time and people haven't built software for 'em. So, if you live in Apple's pro apps and use their formats, it'll be faster but that's not the case for everything else. Hopefully that will change, but it's gonna take a while. The other problem is that the Mac Pro runs macOS Catalina, which is a little messy. It also killed support for a bunch of older 32 bit software and required upgrades for basically everything else. If you've got a bunch of Legacy Photoshop plugins, or some weird little app that makes your workflow go, it might just never work. That's not a big deal if you're a single creator, or you run a small shop and you can be flexible, but for a bigger production house like ours, it gets complicated pretty fast. We have to make sure that everything still works together, we have to make sure we can move projects between people and machines. We generally have to pick stability and reliability over having the latest thing. A lot of things stop when something breaks around here. Now, I don't wanna overemphasize this, software updates are just a fact of life. I just wanna point out that the Mac Pro is not drop it in and go faster. It was more like drop it in, update the apps, see what broke, fix that stuff, upgrade some other stuff and then maybe go faster. I think most places are gonna buy one or two first to test to see how things go, and then they'll decide to place a big order. That's effectively what we're doing just on camera, and I think it's gonna take us a while. To be honest, it's kind of what I expected. What I wasn't expecting is that not everyone loved the display. (upbeat techno music) Apple made a huge deal out of announcing their Pro display XDR, the company's new 32 inch 6K LCD that can hit 1,600 nits at peak brightness. It's a local dimming LCD, so the back light is composed of 576 blue LEDs that can be individually dimmed or even turned off. That allows Apple to claim a million to one contrast ratio using certain industry standard test patterns, and to make a bunch of comparisons to vastly more expensive OLED reference displays. All of that is to say the Pro display XDR is very big, very beautiful, very bright and costs $5,000. We also have the option of $1,000 stand, which is very confusing because it does this. $1,000 monitor stand shouldn't do that, but whatever, you can just buy a different stand. The important thing is that Apple more or less promised that this display would be perfect. It's not. - [Grayson] The XDR display is one of the best I've ever worked on, but that comes with a lot of caveats. The falloff and brightness on the edges, even when you're on access with the monitor is very noticeable to me, no matter what application I'm working in. Viewing full screen video content is less jarring, but it's still there. - The 6K res monitor is sharp, sharp, sharp. It's not one of those improvements where you have to make an effort to notice it. It's very obvious when you lay eyes on it that this is a really dense display. Sadly, my biggest first impression was that the off angle viewing and the display was just incredibly inaccurate, even at the slightest angle. It's so dramatic, that when you're standing right in front of it, it looks like there's a vignette effect over the whole thing. Having worked a lot with the Sony X300s that Apple compared the displays to when they announced them, it was especially jarring to see how the Apple displays stacked up to Sony in real life. This is not a display that I would ever buy as a reference monitor for serious color work. It's not bad, it's a really pretty display, but the off viewing angle color is just completely off. - Now, I'm an admitted fan of Apple's displays across the board, and at the launch event, I was really impressed with the display and with the people I met who worked on it, and I've really enjoyed looking at our review, even. But we're definitely not the only people who've noticed these issues. So, I went back and talked to Apple a few times, and they told me that the off access color shift and aluminum strop is normal. I think it's way better than the competition, but it's there, and it's basically inherent to how LCDs work. Apple also told me it's not really trying to replace that $43,000 Sony OLED reference monitor, that's the standard they're happy to be compared to, but their goal was to hit a more accessible price point so more people could use a display of this caliber. Now, that feels like a little bit of a change in tone to me. Like, Apple's trying to manage some expectations, but it's also true that this display exists in a category of one. Think about it this way. Out of the box, the Pro Display XDR comes set to a mode that Apple says is suitable for home and office use, but isn't perfectly color accurate. If you wanna use it for reference color work, you have to switch it to a mode that limits brightness to a thousand nits and is only recommended for use in a controlled lighting environment. There just isn't another display out there with that range that can be used for Excel all day in one setting and calibrated HDR color work in another, but that puts Apple in a hard spot. It has to convince the people who are just fine with their cheap work monitors that the $5,000 price tag is worth it and to convince the people who are picky enough to spend $43,000 on a reference OLED display that the drop in quality isn't that noticeable. To be honest with you, I have no idea how that's gonna go. It seems like this display is going to be more controversial than I ever expected. What I do know is that you should go look at the Pro Display XDR for yourself and make a decision because either way, you might be surprised about how you feel. (upbeat techno music) All right, I've made you wait long enough. Let's race this thing against a PC. Tell me about this PC. - So, I specked out a PC, that if you came to me right now and said I need to buy a powerful machine for the kind of work you do here at Vox, this is what I would get. It's got a Threadripper 3970X, which is fairly new. We're one of the first people to get it, which is exciting. It's 128 gigs of RAM and a dual RTX 2080 Ti. - And it's got fans 'cause I mean I can hear those fans from here. - It does have fans, it's a little warm. - [Nilay] So, that's our PC workstation. It is very much a get what you pay for situation. We spent several thousand dollars less than our Mac Pro for a faster processor with more cores, but this thing is one of the ugliest PCs I've ever seen inside and out, and it's super loud. The Mac Pro is virtually silent no matter how hard you're pushing it, but our PC sounds like a vacuum cleaner from the instant you turn it on. (computer whirring) But in terms of bang for the buck, the PC came in cheaper and faster, which, well, that went exactly how you'd expect. - We're gonna be running a bunch of benchmarks. We're gonna be doing some generic GPU and CPU benchmarks, a lot of Premiere benchmarks and Resolve benchmarks. And then the most fun one, in my opinion, is the Cinebench, which is just a really nice visual race over who can render Cinema 4D 3D scene with pretty realistic lighting the fastest. - All right, a classic Mac versus PC bake-off. On three, ready? - Ready. - One, two, three. Let's go. Oh yeah, the PC jumps out to an early lead. - Ah, there you go. Look at those 100% threads. - There we go. The Mac's at 100%, but that has twice as many cores. - Yeah. - So PC is done. Mac's coming right along behind. All right, the Mac is done, you got a score of 6,849 points and the PC is more than double. - It's twice as many cores, pretty new processor, a application that uses multi-threading to its maximum, it's something that Adobe Creative Cloud probably won't do and we'll find out in our testing. In GeekBench, the PC also won, and that was for both CUDA versus Metal and OpenCL versus OpenCL. For Premiere benchmarking, we used Puget and the results were mixed. The PC was better for most things, but the Mac did have an advantage in a few of the categories. We couldn't run After Effects benchmarks on the Mac Pro because we kept getting errors, so at the end of the day, the PC kind of destroyed the Mac in every category except Premiere applications that weren't really utilizing the full power of the Threadripper. (upbeat techno music) - So, what have we learned here? Well first, Adobe. Adobe go faster. Second, it's great that there's a Mac of this caliber again. It's exciting to see Apple back in the game talking about performance. It's cool to see the company trying big ideas like that Afterburner card, and it's amazing to hear people like Grayson say the extra power means they're trying to make things they wouldn't have attempted on slower machines. That's all great, but make no mistake. Apple is definitely playing catch-up. It's left the pro market so ignored for so long, that this machine is kind of a reset of the entire ecosystem. So all the hardware is there, the software just isn't yet. If you're working in one of the handful of apps and workflows this machine is designed for, it'll scream. But if you're not, it'll take a minute for developers to unlock its potential, and that'll be awesome. What I'm worried about is that, well, that's what we said about the last Mac Pro, the trashcan. - Of course, it's early and Apple includes two GPUs on every Mac Pro for a reason, so that developers will take advantage. But until they do, the overall speed advantage of the Mac Pro over the last generation, or even a high-end iMac isn't all that obvious. - Yeah, that didn't go so well. But this new Mac Pro is more expandable, more modular and seems way more in tune with reality. It's definitely less risky. Now, we just have to wait. Hey everybody, I wanted to hit some of the most important stuff about the Mac Pro and XDR display in this video, but there are a ton of little things we weren't able to fit in. That's all on our written review on theverge.com so hit the link in the description and check it out.",
    "transcript_keywords": [
        "Mac Pro",
        "Pro Display XDR",
        "Pro",
        "Mac",
        "Pro Display",
        "Pro XDR display",
        "Mac Pro runs",
        "Apple",
        "Pro pros",
        "previous Mac Pro",
        "display",
        "Display XDR",
        "Air Pods pro",
        "Apple pro apps",
        "work",
        "Apple pro",
        "people",
        "XDR display",
        "Apple displays",
        "Pro XDR"
    ],
    "transcript_entity_values": [
        "2013",
        "28",
        "6,000",
        "3.2 gigahertz",
        "128",
        "three",
        "Adobe Premiere",
        "576",
        "iMac",
        "the end of the day",
        "Grayson Blackmon",
        "CPU",
        "Hulu",
        "Vox",
        "43,000",
        "jack",
        "Noam Hassenfeld",
        "One",
        "1,000",
        "6",
        "Puget",
        "Estelle Caswell",
        "YouTube",
        "K res monitor",
        "about 16 years",
        "Vox Media",
        "RAM",
        "macOS Catalina",
        "Second",
        "Metal",
        "GPU",
        "iMac",
        "Today",
        "a late 2015",
        "Verge",
        "Mac",
        "2017",
        "Photoshop",
        "Excel",
        "daily",
        "a half or a quarter",
        "Murilo Silva",
        "Cinema 4D",
        "32",
        "The Mac Pro",
        "Stevie Remsberg",
        "InDesign",
        "Netflix",
        "first",
        "several thousand dollars",
        "Threadripper",
        "a ton",
        "Premiere",
        "Today",
        "LCD",
        "the Mac Pro",
        "Radeon Pro Vega",
        "the Mac Pro",
        "a million to one",
        "this Mac Pro",
        "Premiere Pro and After Effects",
        "a hundred, two hundred",
        "100%",
        "Adobe",
        "Cinema",
        "about $17,000",
        "4",
        "our day to day",
        "2019",
        "the Pro Display XDR",
        "1,600",
        "Grayson",
        "another two years",
        "5,000",
        "a minute",
        "the Mac Pro",
        "Final Cut Pro",
        "OpenCL",
        "6,849",
        "one",
        "Mac",
        "Apple",
        "only half",
        "a couple hours",
        "a Mac Pro",
        "Cinebench",
        "the Mac Pro",
        "Mac Pro",
        "MacBook Pro",
        "54,000",
        "Air Pods",
        "New York Magazine",
        "XDR",
        "Afterburner",
        "two",
        "thousand",
        "32",
        "all day",
        "Vox",
        "ProRes",
        "32 inch",
        "Sony",
        "GeekBench",
        "VPN",
        "Mac",
        "Creative Cloud",
        "Adobe Creative Cloud",
        "CUDA",
        "16",
        "Game of Thrones"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "LOC",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "FAC",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "PERSON",
        "LAW",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "MONEY",
        "GPE",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "MONEY",
        "TIME",
        "ORG",
        "FAC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "LAW",
        "ORG",
        "EVENT",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART"
    ]
}