{
    "id": "ULd_sxplvf4",
    "title": "How To Buy The \"Best\" Laptop!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2015-06-19T06:14:02Z",
    "video_url": "https://www.youtube.com/watch?v=ULd_sxplvf4",
    "category": "Science & Technology",
    "tags": [
        "budget",
        "gaming notebook",
        "best notebook",
        "best price",
        "price",
        "cheapest",
        "best",
        "value",
        "under",
        "under 800",
        "under 1000",
        "gaming",
        "Notebook (Product Category)",
        "minecraft",
        "Video Game (Industry)"
    ],
    "views": 506237,
    "likes": 10547,
    "comments_count": 982,
    "description": "Some tips on buying a notebook when you're on a tight budget. Enjoy!  Music: FILI - Smooth Rides Intro track: Robotaki - Raton Laveur  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it goin' guys. This is Dave 2D, and this is a video on how to purchase the \"best\" notebook when you're on a budget. So, I often get emails or messages about people asking me what the best notebook is right now, or which of this short list is the best notebook for me. And the truth is, no one knows what the best notebook is for you better than you do. So just to get this out of the way, this isn't like a top ten list of the cheapest notebooks or anything, it's more of a guide on how to purchase the notebook that best suits you. So, the first thing you need to figure out is what you plan on using your notebook for. I mean, what specifically, do you use it for. Now the standard response is \"oh I do a bunch of things like web browsing, email, game programming, app programming, photo editing, video editing, you know, gaming, 3D rendering...\" And like, 99% of the time this just isn't accurate. There are very few people in this world that actually do all these things off of one machine. So, figure out what it is that you'll being doing, and more specifically, what apps or games you want to run. And you'll often find that you won't need as powerful of a machine as you thought you did. So if you're a student or going to college for engineering, or architecture, or com-sci, speak to students in older years like the sophomore year, and ask them what programs they're running on their computers. Ah, and if you're into like music production or something, try to figure out what production suite you're going to be working with. Because once you figure out what apps or games you want to be running, it's a lot easier to figure out what things you need to focus on, and what features you can kinda cut out. Now most people don't need particularly powerful notebooks. They use them for school, and work, and media consumption like YouTube, or Netflix, and maybe some light photo editing and gaming, and I would classify this as normal use. And most programmers actually fit in here as well. You can code most apps or 2D games with very light hardware. Your compile times might be a little slow, but there's tons of successful apps and games that were coded using really slow computers, and you can do it too. So for a normal user, what kind of specs are we looking for? In terms of your CPU, don't give it too much thought. Even like a Core M, or an Atom on the Surface 3, those things are sufficient to run normal tasks. And the graphics cards: same thing. Don't worry about it, It really doesn't matter. Any notebook purchased in 2015 can play some light games using the integrated graphics, so you're good. Now for memory, it depends on how many programs and tabs you want open at a time. Anything from two to four gigs is sufficient. You can comfortably get by with four gigs, even in Windows 10, and it's actually pretty hard to make use of 8 gigs, even in app or game development. Now if you're on a tight budget as a normal user, the one area I would still focus on is the drive. Get something with an SSD or install your own because this will make your computer feel faster than any other upgrade that you would put at it. Again, if you're a normal user, don't worry about the CPU, Don't worry about the graphics, don't worry to much about RAM, just get a fast Soild-state drive. If you do some heavy photo editing, or if you do a lot of digital illustration, or if you're an amateur video editor making YouTube videos, hardware is important. The type of footage you work with affects the calibre of hardware that you need. So at the most basic level, you want to pick up as many CPU cores as you can and as much RAM as you can fit into your budget. If it's 1080p footage you're working with, dual-core CPUs are good. i3s are good, and i5s are great. You just want multiple cores to process stuff concurrently. Now, 4K footage is kinda gnarly to process on two cores. You can work with it, but quad-core i7 chips are significantly better. So if it fits your budget, go for a quad-core. Now for the graphics card, if you work with the Adobe Suite, like with Premiere or After Effects, you don't really need a graphics card. They help, but integrated graphics chips in 2015 are pretty respectable for video editing, so don't sweat it. Now for RAM, 8 gigs of RAM is comfortable for 1080p footage and it's usable for 4K footage. But aim for 16 gigs if 4K footage is your thing. In terms of drives, SSD's are very useful, but they're not required. You can always add an external SSD like the UASP enclosures like I mentioned in a previous video, I'll put the link up here. But those are some things that you can add after you've purchased the notebook. So a quick recap. For video or heavy photo editing on a budget, focus more on CPU cores, RAM, and an SSD if you can afford it. Don't put too much thought into the video card. It may seem counter-intuitive to skimp out on a video card for video editing, but really, it's not that important. The last group of users are gamers. If you plan on playing a lot of games on your notebook then you're in this group. And depending on games you want to play, your requirements will vary, but in general, the GPU is king here. The better your GPU, the better your performance. Now the bad news is, a lot companies charge really hefty premiums for dedicated video cards. Apple comes to mind. But the good news is, you can still find some really great deals on gaming notebooks. You just need to do a little digging and be patient. Now for RAM, when you're on a budget, try not to get more than 8 gigs of RAM. Anything more than that, you're not using in most games, and if you have to, the other thing you can kinda have to chince out on is your drive. SSD's are awesome for system snappiness, and load times for apps and games, but it has almost no effect on frame rates in games. So if you can get yourself a better graphics card by sticking with 8 gigs of RAM and using a regular hard drive, I'd do it. A better graphics card is invariably gonna make your games run better. And you can always upgrade the drive later down the road. So for gamers, get a beast video card because that's most important, don't worry too much about the CPU, dual-cores are fine, don't burn money on RAM, and if you need to, sticking with the standard disk drive is OK. The last thing I want to talk about is pricing and brands. Now if you noticed, I haven't talked about any specific models or brands so far. And the reason is this: the best value for a notebook is gonna come from big volume brands like Dell, or HP, or Lenovo. The big volume guys that sell a ton of notebooks every year, and their pricing is normally \"on sale\". But once in a while, they have some real sales, like really steep sales, and stuff just goes on like 30, 40, 50% off. And that's where the money is. I did a review on the Alienware 13 a few months ago, and that thing was priced at 1500 dollars. Now, it was a reasonably well-speced notebook. It played games pretty well, and it was reasonably well-built, but it was really overpriced at 1500 dollars. And then a few weeks later, after my review came out, it dropped down to 1200 bucks, and then a month and half later after that, it dropped down to 900 dollars. And at that point, it was a pretty good pickup. So the seemingly obvious conclusion is this. Figure out exactly what you want your notebook to do, so you can kinda determine what features you need to focus on, and what features you can kinda get rid of. And then purchase your notebook from a big volume seller like Dell, or HP, or Lenovo, when their stuff is a really big sale like right now. So in terms of actual recommendations, it's pretty tough to get give one, just because the prices for these things fluctuate a lot, and there's literally hundreds of configurations and options that you can kinda tweak to make a notebook fit your needs. But if I had to choose some favourites right now... Alright, for normal users, the Lenovo G50-80 which you can get for around 400 or 500 dollars if it's speced well, the 15 inch Dell Inspiron 3000 which is also around 400 or 500 bucks depending on how you spec it, and I also like the Asus F555 which is a little bit more expensive, but I think the build quality is slightly better on that one. And for all of these, just make sure you're getting the newer Broadwell chips so you can take advantage of the newer intergrated graphics cards. For gamers, there's two that kinda stick out right now. The Lenovo Y40-80, it's 800 bucks and it plays games pretty well. Or if you want something that's a little more durable, but quite a bit beefier, the Alienware 13. It's currently at 950 dollars, but I think that will go up and down a little bit, and eventually it'll hit 900 dollars again. For 1080p edits, the top pick for me right now is the previously mentioned 800 dollar Lenovo Y40. Now, just look at this thing. The amount of tech that they're delivering for 800 dollars is crazy. Now for 4K video edits, I would recommend the Lenovo Y50, which comes in at around 1100-1200 dollars for a 4K screen. I know normally wouldn't recommend a 4K screen for any kind of budget oriented notebook purchase. For one, they drain batteries quicker, you need better support and hardware, and it's just more expensive. But, if you want to edit 4K videos, you kinda have to pay the price. That's the end of this video, hope you guys liked it and if you have any questions, comments, type below. Again, I'm always open to helping you guys out, just ask away. And yeah, hope you guys learned a thing or two. It's been nice, and I'll see you guys next time. Oh! I forgot to mention. I'm running a Mac. Please don't hate, I haven't switched over to the dark side or anything. I wanted to give El Captian a little more screen time, just to kind of use it more so I can give you guys my thoughts on that. Alright!",
    "transcript_keywords": [
        "notebook",
        "games",
        "RAM",
        "video",
        "kind",
        "graphics",
        "thing",
        "Lenovo",
        "graphics card",
        "dollars",
        "CPU",
        "card",
        "SSD",
        "things",
        "video card",
        "editing",
        "gigs",
        "budget",
        "figure",
        "guys"
    ],
    "transcript_entity_values": [
        "950 dollars",
        "Broadwell",
        "the Alienware 13",
        "2D",
        "Dell",
        "two to four",
        "Lenovo G50-80",
        "Lenovo",
        "4",
        "the Adobe Suite",
        "Dave",
        "HP",
        "1500 dollars",
        "a few weeks later",
        "40",
        "CPU",
        "GPU",
        "800 dollars",
        "30",
        "ten",
        "one",
        "Apple",
        "99%",
        "Premiere or After Effects",
        "16",
        "YouTube",
        "UASP",
        "more than 8",
        "around 400",
        "the sophomore year",
        "a ton",
        "El Captian",
        "Netflix",
        "two",
        "2015",
        "SSD",
        "first",
        "1100-1200 dollars",
        "Soild",
        "four",
        "a month and half later",
        "800 bucks",
        "Lenovo Y40",
        "RAM",
        "Windows 10",
        "Atom",
        "older years",
        "800 dollar",
        "hundreds",
        "Mac",
        "a few months ago",
        "500 dollars",
        "1200 bucks",
        "900 dollars",
        "Asus",
        "8",
        "500 bucks",
        "50%",
        "1080p"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "MONEY",
        "LOC",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "EVENT",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "MONEY",
        "MONEY",
        "WORK_OF_ART",
        "CARDINAL",
        "MONEY",
        "PERCENT",
        "CARDINAL"
    ]
}