{
    "id": "uMATo2qiscY",
    "title": "Trying the World's Thinnest Laptop",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-01-10T18:18:08Z",
    "video_url": "https://www.youtube.com/watch?v=uMATo2qiscY",
    "category": "Science & Technology",
    "tags": [
        "ces 2018",
        "ces",
        "laptop",
        "acer swift 7",
        "acer",
        "notebook",
        "tech",
        "thinnest laptop",
        "swift 7",
        "gadgets",
        "austin evans"
    ],
    "views": 624690,
    "likes": 15440,
    "comments_count": 1038,
    "description": "The Acer Swift 7 claims to be the world's thinnest laptop but are the tradeoffs worth it? The Razer Phone Transforms Into a Laptop:  Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "https://www.youtube.com/watch?v=o2P6wVJiBNw",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. Today, I'm here at CES 2018 with what is the world's thinnest laptop. This is the Acer Swift 7. Now, if you remember, I actually did a video about a year ago on the previous version of this laptop, which was at the time the world's thinnest laptop. However, 10 millimeters. (laughing) No one wants to use a laptop that's anywhere near that thick, so this guy brings it all the way down to nine millimeters. To put things in context, all you need to do is look at the ports. So, the thickness of the USB-C port is pretty much the thickness of the laptop. And of course, with a laptop this thin and light, you do have to have some trade-offs, and the ports are actually where that begins. So, on here, we're really just getting a pair of USB-C ports in addition to that headphone jack. However, because you have something that's so thin and light, I'm willing to make some sacrifices. Even though it is very thin, they actually didn't really sacrifice on the flexibility of the chassis. So, if I really try to twist it in my hands here, it really doesn't do anything, which is nice. The last thing I want is my laptop to snap in half in my bag because it was just a little bit too thin. Now, as you would expect, the Swift 7 is hardly the fastest laptop in the world, but it still does have a 7th Generation Core i7 processor paired with eight gigabytes of RAM, as well as a 256-gig SSD. Now, because it is so thin, it is going to be the Y-Series processor, which does mean it can be fanless. However, this is actually the only config of the laptop. There's no additional RAM, SSD options, anything like that. What you get is what you get with this guy. For the display, it has an actually surprisingly large 14-inch panel with a 1080p resolution. And while the screen itself based on first impressions looks pretty decent, what's impressive is that it is a touchscreen, and that really shouldn't be impressive because it's 2018 and all laptops should have touchscreens, but there you go. As you would expect, there are some quirks here. So, something I immediately noticed is that the backspace key is shared with the delete key up top, which is a little bit hard to get used to. And you also share the Caps Lock with the tilde key. But for the most part, the keyboard actually feels pretty good. Even though there isn't a ton of travel, it's actually pretty easy to get used to. The trackpad is also interesting. So, on the surface, it actually is not bad. So, you've Windows Precision drivers and the actually tracking seems fine. The problem is is that there's actually no click, so when you actually go to do it, you have to just tap it, which I actually don't mind on a lotta track pads, but it is a little bit weird to have essentially no sensation when you actually go for a full click on this guy. One thing that does legitimately separate this from a lot of other laptops right now is that it has a built-in LTE connection. So, the model I have here doesn't have it working just yet, but the idea is that you will have a nano SIM slot on the side of the computer where you just put a SIM card in and switch between networks fairly easily, which, especially for something that's this thin and this portable, does make a lotta sense. We also have a 720p webcam onboard. So, you guys can judge the quality for yourself, but one thing is, as with a lotta these ultra-portable laptops, the webcam placement being on the bottom is less than ideal, unless of course you wanna get some wonderful nose selfies. Do people take selfies on laptops? So, while it might look like an ordinary laptop, this is actually being powered by the-- All right. So, because it is such a thin laptop, the speakers are hugely loud, but it does sound decent. I'm actually not totally sure where they're coming out though. Oh, it looks like on the bottom here. One thing you're really not giving up though is battery life. So, the Swift 7 should last for around 10 hours or so on a charge. And on top of that, it does also support a fingerprint sensor for Windows Hello. The Acer Swift 7 will be available in late-March for $1,700. So, yes, it is absolutely pricey. But considering just how thin and how nice the hardware is, for some people, if you really want the best in portability, it's not bad. But of course, what do you guys think about the Swift 7? It's definitely not going to be for everyone. Let me know in the comments below and I will catch you in the next one.",
    "transcript_keywords": [
        "laptop",
        "world thinnest laptop",
        "thin",
        "Swift",
        "Austin",
        "Acer Swift",
        "thinnest laptop",
        "laptops",
        "world thinnest",
        "Hey guys",
        "thin laptop",
        "thing",
        "world",
        "pretty",
        "ports",
        "guys",
        "guy",
        "USBC port",
        "USBC ports",
        "USBC"
    ],
    "transcript_entity_values": [
        "about a year ago",
        "half",
        "2018",
        "7th",
        "256",
        "first",
        "RAM",
        "Windows Precision",
        "USB",
        "jack",
        "1,700",
        "10 millimeters",
        "Austin",
        "Today",
        "eight gigabytes",
        "one",
        "the Acer Swift 7",
        "Generation Core",
        "14-inch",
        "SSD",
        "1080p",
        "the Caps Lock",
        "Windows Hello",
        "nine millimeters",
        "One",
        "late-March",
        "LTE",
        "around 10 hours"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "LAW",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME"
    ]
}