{
    "id": "UnKiU-YA-lQ",
    "title": "Peloton Tread -- is it worth it?",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-12-27T18:38:01Z",
    "video_url": "https://www.youtube.com/watch?v=UnKiU-YA-lQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "peloton treadmill",
        "tread",
        "bike",
        "peloton",
        "treadmill",
        "interval training",
        "5k",
        "review"
    ],
    "views": 784531,
    "likes": 12376,
    "comments_count": 1341,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- He knows I don't have a treat, so he's not gonna listen. Come on, fist bump, Mattie. Mattie, everybody's watching, and this is super embarrassing. Can we paw? (lighthearted dance music) That's not, you're not doing it. Today, we're in my gym. Yes, I know, it's probably shocking to a lot of you, the fact that I have a gym. When did I actually do anything fitness related? And in 2019, I definitely want to get more into fitness content, but don't worry, I'm not gonna be going away from tech. I wanna mix fitness and tech, because it has been something that I'm so passionate and so interested in, and this past year, you may see behind me, this is the Peloton Treadmill, and I saw this at CES, and shortly after it was announced, they had pre-orders. So I just got this maybe a month ago, the pre-orders finally shipped, and I've been wanting to make a video about it. But anyway, we're here, it's here, and I wanna show it to you guys. And this gym is still a work in progress, so just, there'll be another video on that later. You may be familiar with the Peloton bikes, and I am not a huge fan of riding bikes, at all, but when I saw they had the treadmill, I was like, this is my time to shine. Because one of the things that I did love about Peloton is they have live classes, but with the bike version, you could take live classes, and you could also do things not on the bike. You could do floor exercises. They have various boot camps. So that same thing applies to the treadmill. So here are some live classes. You can click Count Me In if you plan on being at that class, but one of the best things that I like about this is you don't actually have to be here, present for the live classes. They have a whole list of video on demand things, so these classes that are live, they're then archived, and you can take them later. I will say that the interface is not the best, and it kind of drives me insane, especially as a designer, and coming from doing interfaces, and things like that, I'm like, why would you do this? But all that aside, the treadmill's incredible. This screen is huge. Some of the prototypes that I saw were very small versions of this, but this is like an iMac that is on a freaking treadmill. This is just absurd. So here's my calendar. This is the last one that I did. This was on the, let's see. Okay, I did the 20-minute Rock Fun Run. This was actually a digital one. I was traveling, and they also have an iPhone app, so I did this run digitally. So here, this was a 45-minute intermediate boot camp. That was my leaderboard rank. So it gives you your distance, your elevation, the calories that you've burned. This is the heart rate. The one thing that I will say is they only have a one-size-fits-all heart rate monitor, so this one doesn't actually fit me very well. So I was kinda struggling to actually get it to connect. Unless it is tight across your chest, it doesn't give you an entirely accurate read of your heart rate, so I was having some trouble with this. But for the most part, when it does connect, it does seem to be pretty accurate. What I love about that is it will help you get some more accurate calorie readings. So what's cool is this was half class on the treadmill, and then the other half was on the floor, so you kinda did weighted things. I got an achievement. Man, I love achievements. This is my personal best. So now I'll give you guys a little walk-around this thing here. So there's the incline. Okay, well, now I'm going up. Is it going up? I feel like it's going up. It's going up. It went up (chuckles). So here's you're speed knob. Move it forward, that goes faster. Move it back, goes slower. And this is a button, and the button will also adjust one level up. But I wanna show you guys an actual class. Lemme take this incline back down. These are cool. I didn't actually click through here. This will take you on a road to a 5K. This is a boot camp. It's a two-week training program. The 5K is six weeks. I honestly really, really, really like this thing a lot, and this is, by the way, not sponsored. I bought this. I pre-ordered it, and here we are today, talking about it. So you can go through here. You can pick different instructors, 'cause I feel like after you guys go through this, you're gonna find some of your favorites. Let's do an arms and shoulders boot camp. My heart rate monitor is not connected, but if I did wanna connect it, I would just put this on, and it would connect through Bluetooth. This is basically a huge Android tablet. - So how you guys doing? - I'm doing great! - And welcome. I hope you're ready for experience-- - I'll start my Apple Watch. I hate that I'm wearing makeup and I'm on a treadmill right now. I just wanna say that this is my biggest pet peeve, is wearing makeup and working out. (instructor shouting) This thing's really loud. Okay, so speed knob (clicks). Oh, god, okay, 4.5. We're going, and this was actually a live class in New York, so the studio that she's in is in New York, and this was a live class. There's actually people in it, and if you're ever in New York, you can go to the Peloton studio, and take a class. What does she want me to do? Oh, god, I didn't hear what she said. I didn't hear what you said. What did you tell me to do? She said to do something. (chill electronic music) This is the actual class. This was once live, but this is one of the video on demand ones that I chose. And as you guys can see, over here, I'm not doing so well, because I stopped. I am currently in 19th place, and these are all people that have taken this specific class before. All of your data is all based here. You can close that to hide it. I also like that they have the track list here, so you can see what the music is that they're playing. Since I'm cheating, because I'm making a video, I'm gonna get my weights ready, because she's about done, to be on the treadmill. I think my favorite part about this is the fact that you feel like you are actually in a class with people, and you kind of are interacting, but you're not, really. You're still alone and you can choose to do whatever you want. (instructor shouting) (treadmill playing music) - I am 23rd. But this is why I really like this a lot, because you're on the treadmill, you do the running, but then there's also strength training, as well. I should've picked lighter weights. I think you guys get the point. It's a treadmill, but you could also do things on the floor. But I love what Peloton has done with this, and I love what they have done for fitness in general, because it does make it seem like it is a community thing, and I am so excited about this. I will put a link in the description if you guys wanna check it out and get more information. These are pretty expensive, but compared to other treadmills. I'm not really sure what these are called, but it's kind of like a slatted treadmill, and this is so much easier on your knees, and when you're running. And a lot of these treadmills that I priced out, that are at the gyms that I usually go to, are like 10,000 to 12,000 dollars, but this runs you about 4,000. It does have the integrated computer. There's literally a computer attached to this thing. But I love it. It's been so much fun to use, and I'm looking forward to doing more classes on this. But I'd love to know from you guys. What do you guys do to stay fit? Do you run, do you hike? Do you do any sort of martial arts? I would love to know in the comments below. And if you don't do anything, join me this year in trying to get our lives together, because it's been a struggle this past year. But finally I feel like I'm getting to that point where fitness is a priority, and I'm super excited for the future. So come join me, and I will see you guys later. But I gotta go take a nap, because (laughs) I'm tired. I already did a big four-mile hike this morning, and then I did yoga after, and I don't know. I think I did too many activities. - [Tyler] Okay, have a good sleep. - Bye-bye (laughs)! Oh, that doesn't actually sound very good (laughs). I was like, yeah, I'd love some more milk. No, absolutely not. (chill electronic music)",
    "transcript_keywords": [
        "Treadmill",
        "guys",
        "live",
        "love",
        "things",
        "thing",
        "live classes",
        "class",
        "Peloton",
        "classes",
        "fitness",
        "live class",
        "video",
        "Peloton Treadmill",
        "kind",
        "heart rate",
        "Mattie",
        "York",
        "rate",
        "heart"
    ],
    "transcript_entity_values": [
        "one",
        "New York",
        "Rock Fun Run",
        "CES",
        "two-week",
        "this morning",
        "this past year",
        "iPhone",
        "Today",
        "Peloton",
        "10,000 to 12,000 dollars",
        "four-mile",
        "4.5",
        "about 4,000",
        "Bluetooth",
        "5",
        "half",
        "20-minute",
        "19th",
        "45-minute",
        "Mattie",
        "today",
        "this year",
        "iMac",
        "2019",
        "the Peloton Treadmill",
        "six weeks",
        "Android",
        "Apple Watch",
        "a month ago"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "TIME",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "DATE"
    ]
}