{
    "id": "Up0Qzk3ks_A",
    "title": "This Gadget Scans Color From Anything!",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-09-28T18:30:54Z",
    "video_url": "https://www.youtube.com/watch?v=Up0Qzk3ks_A",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "nix",
        "nix pro",
        "nix pro color",
        "color sensor",
        "color",
        "cool gadgets",
        "cool gadget",
        "best",
        "2016",
        "apple",
        "iphone",
        "iphone 7",
        "video",
        "cool",
        "smartphone",
        "innovation",
        "invention",
        "android",
        "inventions",
        "things",
        "samsung",
        "futuristic",
        "test",
        "amazing inventions",
        "new inventions",
        "amazing",
        "iphone 6",
        "apple iphone",
        "awesome inventions",
        "phone",
        "galaxy",
        "future",
        "galaxy s7",
        "cool inventions",
        "apple iphone 7",
        "iphone 7 plus"
    ],
    "views": 7159508,
    "likes": 100251,
    "comments_count": 9117,
    "description": "(   ) --- Today's Mystery Video -  Nix Color Sensor (USA Link) -  Nix Color Sensor (International) -   This is the Nix color sensor. It samples the color from everyday objects. Simply download the app hold the sensor close to any object and boom! Your'e hit with a digital representation of that color.  From the manufacturer -  Nix Pro Color Sensor Scan, Save, Share, and Compare Color with the Nix Pro Color Sensor! Simply scan any surface, save it to your smartphone or tablet, and match it to our app library. Features - Super easy to use. You'll be up and running in minutes. - Incredibly accurate. The Nix Pro blocks out all ambient light for a precise match every time. - Raw color values. Export your color data to .csv file - Wireless.Via Bluetooth Smart (4.0) - Supported. Backed by the best team in the industry. We eat, sleep, and breathe color. Use any color system The Nix app can convert between any digital or physical color system. Want to know what color a flower is in HTML or CMYK? Or what color your walls are in brand name paint? The Nix Pro can do it. Match to more than 10,000 colors in our app library, including leading paint brands like Benjamin Moore, Sherwin Williams, Behr, and more! Best in-class accuracy Swatchbooks and smartphone camera apps are greatly affected by ambient light and shadows. The Nix Pro's patented design blocks out all ambient light, allowing built-in LEDs to provide maximum accuracy in all conditions. Each Nix Pro order contains 1x Nix Pro Color Sensor Hardware 1x Micro USB Charging Cable 1x Microfiber Carrying Pouch Free lifetime access to the Nix Android and iOS apps. Compatibility Compatible with iPhone 4S and above, iPad 3rd Generation and above, and iPad Mini. Compatible with Android devices with BLE 4.0, and operating system 4.3 and above.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/MjETHULN2U0?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://amzn.to/2dtRrNW",
        "http://geni.us/OjnA",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "I got something cool today! That was like, a loud, chair move, chair sound. Today, I got a cool one for you! Seriously! Pay attention! Expand the attention span, 'cause this one, might change the game. It's called Nix, color, sensor. What this thing claims to do is to take any color in the real world, And turn it into a digital representation, there's an app, that goes with this thing, and shows you the digital color palette, as extracted from the real world object. Do you see where I'm going with this? Real world things, made digital. Maybe I should just show you. They sent this over to me. ''This, is not pink.'' Oh, my goodness. Here it is. Nix Color Sensor, nice little packaging, Made in Canada! Made of maple syrup. Oh, it's got this little quote on the side. Quote: ''Poets say science takes away from the beauty of the stars, mere globs of gas atoms, I, too, can see the stars on a desert night, and feel them. But do I see less or more?'' What does that even mean?... This includes one Nix Pro Color Sensor, one microfiber carrying pouch, One micro-USB charge cable, And you can get the app to go with it on either Google Play or the Apple App Store. How do I crack this baby open? Though... Oh... A flat micro-USB cable, word up. What an unusual shape. I assume the sensor is in here, I'm gonna place it on something so it picks up the color. appearently. Right about now you're thinking, ''Who is this even for!?'' Interior designer, illustrator, creative person. If you need to quickly sample, the real world, I said, hey, I need to match that right there; that's what I'm looking for; this is the way to do it. To set this guy up, it's all about some micro-USB. Download the app. It's the terrible Wi-Fi... *laughs* I have a light now! Connect, baby. Found it! Okay, I got some things to scan over here, of course! Mountain Dew Maybe you want to paint your bedroom, with Mountain Dew Orange! The pink, tiny Posh phone! A pool ball. We're about to take a ride on the color train! And you're invited. You're not. Yes, Jack's invited too. I know it's going to ruin the trip for everyone else, but Three minutes in and he's gotta go pee already. The man's got no bladder! It's all that silica gel; HE'S DRYIN' UP FROM THE INSIDE! I'm gonna line this up . . . scan it Look at tha . . Look! Yes!! Now, of course, your screen is gonna represent it a little differently, but that's the digital version What does it say? Rgb, Cmyk, Hex? Whatever you're working in, it's all represented right there I can tweet out that color, I can save it It's magical! I'm gonna scan this guy OHHH! Look at this orange! Ooh I got the pool ball! Oh ho ho ho, Mountain Dew green! Wait, I gotta get the lighter part of it yeah that might be more Mountain Dew to me Can I scan my hand? *Chuckles* What if I'm tryin' to coordinate the outfit and I'm like: \"I gotta get pants exactly this. . .\" Lets. . . is this dangerous? Should I be scanning my head? Too late. . . Ooh! Gotta get the gray hat! Oh, I don't need to be plugged in So now I'm just. . I'm just walkin' around the place, phone in hand, BOOM scan, BOOM scan Ooh, THAT is Starbuck's green Go and grab any color you might need for your project and be inspired Everybody knows Ferrari red With the Nix, you're real quick BOOM Ferrari red, take it with you And who's better than you?",
    "transcript_keywords": [
        "Mountain Dew",
        "color",
        "real world",
        "Nix Color Sensor",
        "Color Sensor",
        "Nix Pro Color",
        "scan",
        "Nix",
        "Dew",
        "real",
        "sensor",
        "Pro Color Sensor",
        "Mountain",
        "world",
        "app",
        "cool today",
        "digital",
        "Mountain Dew Orange",
        "BOOM scan",
        "BOOM"
    ],
    "transcript_entity_values": [
        "Starbuck",
        "Ferrari",
        "Three minutes",
        "One",
        "Jack",
        "Nix Color Sensor",
        "Wi-Fi",
        "Connect",
        "Canada",
        "the Apple App Store",
        "Nix",
        "Rgb, Cmyk, Hex",
        "Nix Pro Color Sensor",
        "Today",
        "Mountain Dew Orange",
        "Google Play",
        "one",
        "ho ho ho"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "LOC",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON"
    ]
}