{
    "id": "UPczvNHyvfE",
    "title": "How to choose between a phone and a camera",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-07-13T15:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=UPczvNHyvfE",
    "category": "Science & Technology",
    "tags": [
        "sony",
        "sony zv-1",
        "sony zv 1",
        "sony zv1",
        "zv1",
        "zv1 sony",
        "sony camera",
        "sony digital camera",
        "sony xperia",
        "sony xperia 1 ii",
        "sony xperia 1",
        "xperia 1 ii",
        "sony phone",
        "sony cameras",
        "which would you choose",
        "camera",
        "phone",
        "phones",
        "cameras",
        "which to buy",
        "how to buy",
        "processor",
        "dieter bohn",
        "selfie stick",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 250872,
    "likes": 6997,
    "comments_count": 522,
    "description": "The Sony Xperia 1 II or the ZV-1? If the most important thing on a new phone for you is the camera, what if you just bought a camera instead of a new phone? In this episode of Processor, Dieter Bohn compares the Sony Xperia 1 II smartphone and the Sony ZV-1 \"vlogging\" camera. They're designed for different things, but looking at them together can teach us something about how to choose our technology.  Read Dieter's full review of the Sony Xperia 1 II:   Why your phone is not a tool:   If you buy something from a Verge link, Vox Media may earn a commission. Seeour ethics policy:   Buy the Sony Xperia 1 II on Amazon:  Buy the Sony ZV-1 on Amazon:   0:00 Intro 0:54 Heres a question 1:28 Sony camera world 2:23 Sony Xperia 1 II phone 3:38 Sony ZV-1 camera 5:56 How is the ZV-1 has a vlogging camera? 7:39 Back to the Xperia 1 II 8:59 Photo examples 9:24 Hi Vjeran 10:56 Answering the question  Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/3j1rXFc",
        "https://youtu.be/fkcO8kvVOGo",
        "http://bit.ly/2TQsqjB",
        "https://amzn.to/2BReZcK",
        "https://amzn.to/2W6YSOU",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- For a few years now, I've been saying this thing. If the most important part of a new phone for you is the camera, maybe instead of buying a new phone you should think about buying a new camera. I've been thinking a lot about that advice since I started testing these two Sony products. This is the Sony Xperia 1 II smart phone, and this is the Sony ZV-1 vlogging camera. And both of these are excellent devices if you're looking for a really specific thing. But if you're just looking for the best smartphone or the best pocketable camera, I don't think either one of these would be my first pick. But they are worth talking about because they come from a different world than we're used to and it's one that can teach us something. You know what it's like to live in Apples iPhone world or Google's Pixel world, or even Samsung's Galaxy... World? Galaxy world? Sure. But there's a Sony world too, and living in it for a while has clarified how I think about cameras. So, here's a question. What can we learn from Sony world? (relaxed electronic music) So, I just have to tell you that this video has been super hard for me to make. This is probably my third attempt at doing something with one of these devices and I think it's because my brain is just chock-full of little details and observations and opinions, so, instead what I decided to do is we're gonna have a full review of each of these devices up on theverge.com, but it's way too much for a single video, or even a couple, and so instead, I wanna talk about Sony world, or more specifically, Sony camera world. See, Sony is a monster in mirrorless cameras, they're really good at shooting far-cam video, and some of them are great all-rounders. So, I'm using a Sony a7 III right now, before that I was using an RX100, there's a whole ecosystem around them and, Sony cameras also have quirks, like impenetrable menus and unique color science, but generally they're really well regarded. And so, the Sony Xperia 1 II is Sony's attempt to take a smart phone and put it inside that camera world. You might know that Sony already makes great camera sensors, your phone right now might even use one, but historically, Sony's phone cameras have been kinda, meh. So the Xperia 1 II's big idea is to make Sony's phones work a little bit more like Sony's cameras. Okay, so I actually should tell you a little bit more about each of these devices and I'm gonna do it really fast. Normally these would be the whole review, but I've got other things to talk about so, buckle up. (he sighs) Here we go. Sony Xperia 1 II is the sequel to the Sony Xperia 1, duh. It is Sony's attempt at making a super flagship 5G phone and it costs 1,200 bucks in the U.S., where it doesn't support 5G for bad reasons. Whatever. Sony likes making these super tall 21 by 9 aspect ratio screens, and I actually kinda dig it, even though this phone is a little bit too big for me. I think the overall aesthetics are really clean and really nice. Sony also checks a lot of rare feature boxes, this is a 4K OLED screen, there's a fingerprint sensor on the power button, there's a real, honest-to-God shutter button, there's a headphone jack, there's Micro SD card slot expansion, there's dual front facing speakers. It runs Android pretty well, it's a relatively clean install, Sony's cleaned some stuff up, but the whole point of this phone is the camera system. And there, Sony is focusing, aha, on a familiar Sony camera interface, but most of all, a 1 over 1.7 inch 12 megapixel sensor which is pretty big for a phone. This thing can focus 60 times per second, it can shoot 20 full resolution images per second, it can focus on your eye, or it can focus on your pet's eye. (he sighs) Yeah. Okay, now, the Sony ZV-1 vlogging camera. It is basically an RX100 with the optics, the zoom, and ND filter of the mark 5, but with the faster focusing, updated one inch sensor and video processing capabilities of the mark 7. However, Sony finally made the right kind of flip-out screen that you want for vlogging, but they replaced the magnesium body with plastic, they got rid of the electronic viewfinder, they got rid of the focus ring, and they got rid of the flash and in replacement of those, you get a better three mic array microphone. You get a tally light which shows it's recording, and you get a hot shoe. Plus there's a couple of neat pre-set options, it has a background de-focus button that automatically sets the aperture to its most open to blur your background, and it has a product focus button that turns off face priority so it can focus on the product you're showing the camera and not just lock onto your face. Oh, and it's only 800 bucks, which is 400 bucks less than the RX100 mark 7. Oh, and you get a free dead cat! That's what they call the thing that keeps the wind from hitting your microphone, it's called a dead cat, I don't know. Camera people get to have jokes too, okay? That might be the fastest I've done any spec run down of a gadget, much less two in a row, but I think we did it. And, if you live in Android world, you maybe heard this Xperia description and you thought to yourself, ah, that's interesting, tell me more about the camera but I don't know if it's worth 1,200 bucks. Probably not, and you're right. But, maybe the second explanation of this camera was gibberish to you. But if you live in Sony camera world, you heard that explanation and you now know exactly what the ZV-1 is, what it can do, and whether or not it'll work for your needs, you might know that, yeah, you need interchangeable lenses, or maybe you just wanna have a B cam, or you just want something that's this powerful, that can do this much, that fits in your pocket. Or maybe it was all gibberish, I mean, that's totally fair. If I hadn't spent the last 10 years learning how Android phones work, or the last three months on a goddamn crash course in Sony camera so I could shoot video during a lockdown, it might've been gibberish to me too. The point here isn't necessarily all the individual details of the specs, what I wanna talk about in this video is, what they mean for how you actually end up using these cameras. Okay, so I'm gonna do this, I'll turn on the background de-focus. Ooh. Okay, how is the Sony ZV-1 as a vlogging camera? I actually think it's kinda stupendous. I admit this is a parts bin camera, it's basically an RX100 with a bunch of customizations made for vlogging, but I love the RX100. But there are some limitations here to know about, so, the widest that this lens can get is the equivalent of 24 millimeters, which isn't quite wide enough to comfortably hold the camera out to point at your face unless you've got it way out on your arm like I do now or, use a selfie stick, my arm is actually already kinda tired right now. It also props in a little bit if you have image stabilization on and so, if you're gonna get this thing, you've really gotta get a selfie stick in order to do proper vlogging with it. But, other than that, in terms of simplicity and in terms of not having a ceiling for when you wanna learn to do more professional stuff, this thing is great. I mean, look, this thing is wildly capable as a camera. It has basically all of the same features and options as my a7 III there, but it's in a $800 package that fits in my pocket. And I also love this product showcase feature which basically turns on a bunch of settings that are already available on other Sony cameras, but it simplifies it to one button, so it turns off face priority, so if I put something in front of the camera, it'll focus on the closer thing to the camera instead of to my face, and then it'll focus on my face again, and then on this thing, and it does it really fast. Now, I do have to use this camera a little bit differently that I would use an a7 III, or even how I'd use a phone to do vlogging, and I want you to hold that thought about using cameras differently because it's super important. But right now, let's get back to this Xperia 1 II. See, the Xperia has this hot shit, big sensor that can do eye auto-focus and focus really fast and shoot fast Birch photos, but the standard camera app is kinda, meh? The pictures it takes are okay, but they feel a little bit lifeless. But that's part of Sony's game here. It knows that it can't hang with Google or Apple or maybe even Samsung when it comes to image processing, so instead it just kinda skips that for the most part and gives you the option to use it more like a traditional mirrorless camera with the Pro Camera app and the Cinema Pro video app. The interface with the Pro Camera app even looks a lot like Sony's big camera interface, see? Now also, I've got some photos, here's an example. You can see that there's motion blur in this night photo. So what I did is I set the the ISO so that the shutter speed was slow enough so that I could get the motion blur while still capturing the rest of the scene just like I wanted, like you might on a DSLR or whatever. Your standard night modes on a Pixel or an iPhone, they just won't do that. And Sony even sort of tries to make it feel like a real camera, you've got a real shutter button here and you can choose between the lenses by looking at their millimeter equivalents. Now look, I know you can probably get similar results using a manual camera app and one of those other phones, but the other thing that Sony does here is less post-processing, because it's trying to maximize capture speed. So, again, you can shoot a 20 frames per second burst and it wants to get that saved to your disk as quickly as possible so you can just get that action shot. So when I was trying to figure out what I wanted to say about these cameras, Vjeran, who's editing this video and shooting the B roll, actually, say hi, Vjeran. - Hi. - Vjeran said something that struck me as both obvious and actually kind of profound. Here, just tell them, Vjeran. - Your overall approach to photography changes depending on which camera you use. - Which, duh. Different cameras can do different things and so you adjust your shooting style to those cameras' capabilities. But also, whoa, you're gonna be making different art. The things you make are going to be different based on the tool or, you know, based on the instrument, that you're using. I've actually got a whole video about that tool versus instrument thing, We'll link it down in the doobly-doos. So, for example, this shot that I'm using right now with the a7 III to shoot this video, it looks fine, but I think it looks pretty bad when I try and replicate it with something like the ZV-1. However, can't hold the a7 III out like this for very long 'cause it's heavy. And then on top of that, however, I don't always have this camera or that camera with me and so this camera's with me all the time and so I can make something else. The music you make is different depending on what instruments you use. Duh, but, the pictures you make depend on what kind of camera that you're using, and it's not just a spectrum from good to bad, it's different kinds of pictures. So, the thing about the Xperia 1 II is the kinds of pictures that it's good at are not the kinds of pictures that I want to take with a phone, I mostly shoot my phone in full auto mode and the full auto mode pictures out of the Xperia 1 II are good, but they're not $1,200 good. And as much as I'm impressed at how this thing can take action photos, it's just not what I wanna do with a phone. Which brings us all the way back to the advice from the beginning of this video. If all you want out of a new phone is better photos, you should maybe think about spending your money on a standalone camera instead of getting a new phone. And, after living in Sony's camera world for a while, I still think that's good advice but a little bit differently now. What I think you should be doing is spending more of your time thinking about what kind of photos and videos you want to make first. And then see what kind of gadget will help you make them. Hey, everybody, thank you so much for watching, I'm sorry I didn't get into all the details like for example, this screen doesn't work with polarized sunglasses, which is real dumb. And this screen, they say it's like 90 hertz equivalent refresh rate, but it's actually 60 and they do motion swiveling, which is weird but fine. Anyway, we'll talk a little bit more about that stuff down in the comments, but I'm also, of course, gonna have full reviews, again, at theverge.com.",
    "transcript_keywords": [
        "Sony",
        "Sony camera world",
        "camera",
        "Sony camera",
        "Sony Xperia",
        "Sony phone cameras",
        "Sony world",
        "Xperia",
        "phone",
        "cameras",
        "world",
        "camera world",
        "thing",
        "Sony big camera",
        "make Sony phones",
        "kind",
        "Sony camera interface",
        "video",
        "familiar Sony camera",
        "Sony attempt"
    ],
    "transcript_entity_values": [
        "Xperia 1 II",
        "Android",
        "one",
        "third",
        "Sony Xperia 1 II",
        "Apple",
        "three",
        "only 800 bucks",
        "the last 10 years",
        "ISO",
        "DSLR",
        "Google",
        "Vjeran",
        "the mark 5",
        "60",
        "5",
        "90 hertz",
        "a few years",
        "20",
        "Apples iPhone",
        "the mark 7",
        "1 over 1.7 inch 12 megapixel",
        "Xperia",
        "this night",
        "1,200",
        "Samsung",
        "ND",
        "two",
        "jack",
        "24 millimeters",
        "Micro SD",
        "4",
        "800",
        "9",
        "1,200 bucks",
        "21",
        "the last three months",
        "Sony",
        "second",
        "standard night",
        "first",
        "RX100",
        "iPhone",
        "Xperia",
        "400 bucks",
        "U.S.",
        "Xperia 1 II"
    ],
    "transcript_entity_types": [
        "FAC",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "FAC",
        "TIME",
        "MONEY",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "TIME",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "GPE",
        "MONEY",
        "GPE",
        "PRODUCT"
    ]
}