{
    "id": "uPXXTCZRID0",
    "title": "BlackBerry 'Mercury' Hands On",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-01-04T16:16:04Z",
    "video_url": "https://www.youtube.com/watch?v=uPXXTCZRID0",
    "category": "People & Blogs",
    "tags": [
        "blackberry mercury",
        "blackberry priv",
        "blackberry passport",
        "blackberry dtek 60",
        "ces 2017",
        "blackberry phone",
        "blackberry 2017",
        "blackberry dtek 70",
        "mrmobile",
        "michael fisher",
        "qwerty phone",
        "best keyboard phone",
        "keyboard phone",
        "keyboard phone 2017",
        "mercury blackberry",
        "qwerty blackberry",
        "phone with keyboard 2017"
    ],
    "views": 601985,
    "likes": 9303,
    "comments_count": 917,
    "description": "Three things you need to know about the new BlackBerry: it's at CES 2017; MrMobile went hands-on; and it's so new it doesn't have a name. Actually there are a few more details to be had (including the fact that this is almost certainly the \"BlackBerry Mercury\" all you QWERTY lovers have been whispering about for months) ... but for the rest of the scoop, you'll need to dive on in to MrMobile's hands-on with the new BlackBerry!   [SUBSCRIBE]     [AUDIO NOTE]  MrMobile is often ... well, mobile. So he can't always record video voiceover with his studio setup (an AKG C414XLS in a sound booth, if you were wondering). On the road, I record with a Zoom H2n Handy Recorder in the most acoustically sound environment I can find  usually a hotel room.   [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"Hit The Floor\" by Gyom, available at Premium Beat:    [SOCIALIZE]         [IMAGE CREDIT]  Custom thumbnail by Jose Negron, Mobile Nations   [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.premiumbeat.com/royalty_free_music/songs/hit-the-floor",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Narrator] We've been down this road before, more than once, but let's lay it down again real quick. Yes, there's a new BlackBerry. Yes, BlackBerry still exists, but this one is built by a company called TCL, and yes, there's still a market for it. At least, that's the hope. From CES, I'm Mr. Mobile, and this is the new BlackBerry. My problem with the last two TCL-built BlackBerries is that they didn't have any of BlackBerry's traditional DNA. They were basically tweaked versions of the same reference design that produced the Alcatel IDOL 4. The new device, which is so new it doesn't even have a proper name yet, is different From the soft touch back cover to the reassuring weight in the hand to, yes, the physical QWERTY thumb board, this isn't a phone you're gonna mistake for anything but a BlackBerry. Its industrial design doesn't quite live up to the zenith of the company's glory days, the early Bold family, but gets close. On the pre-production model I handled, key travel and feedback was good, maybe a little better than on the Priv from 2015, and the space bar contained a hidden fingerprint scanner, which I think is a clever move. Also, I'm happy to report that you can still use the keyboard as a trackpad to navigate the interface, one of my favorite innovations from back in the BlackBerry Passport days. The software on this demo device is such an early build that I'm actually not allowed to show most of it on camera, but at least some core aspects of the BlackBerry Android experience are here, like the hub that aggregates all your messages into a single inbox, and also the DTEK Security Suite that TCL hopes will make this phone appealing to enterprise types. I'm hearing there's also at least some kind of consumer advertising plan, but it's hard to imagine many normal folks buying a BlackBerry in 2017. We can expect the company to push the security angle heavily, positioning itself as a secure alternative to Apple and Samsung, and if this device manages to fix the build quality issues and software slowdowns I saw on the early Priv units, maybe BlackBerry can keep on chugging. Given the success that hardware partner TCL has had with the Alcatel brand, it'd be a mistake to take your eye off BlackBerry now. This will be Mr. Mobile's first BlackBerry review when it's made available later in the year, folks, and I'm really looking forward to it. Subscribe to Mr. Mobile on YouTube so you don't miss that and all the other crazy mobile tech dropping at CES 2017. Till next time, thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "BlackBerry",
        "real quick",
        "Mobile",
        "BlackBerry Passport days",
        "TCL",
        "BlackBerry traditional DNA",
        "company called TCL",
        "DTEK Security Suite",
        "Alcatel IDOL",
        "BlackBerry Passport",
        "BlackBerry Android",
        "company",
        "BlackBerry Android experience",
        "early",
        "device",
        "CES",
        "quick",
        "Alcatel",
        "Priv",
        "road"
    ],
    "transcript_entity_values": [
        "2017",
        "BlackBerry",
        "the BlackBerry Passport days",
        "Samsung",
        "Priv",
        "Apple",
        "later in the year",
        "YouTube",
        "BlackBerries",
        "Mobile",
        "first",
        "two",
        "Bold",
        "CES",
        "the DTEK Security Suite",
        "Alcatel",
        "2015",
        "TCL",
        "one"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "EVENT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL"
    ]
}