{
    "id": "uRdAQU-tJTQ",
    "title": "It's like a Razer blade, but almost BETTER! - Schenker Vision 14",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-03-13T18:39:41Z",
    "video_url": "https://www.youtube.com/watch?v=uRdAQU-tJTQ",
    "category": "Science & Technology",
    "tags": [
        "Gaming",
        "Performance",
        "Schenker",
        "XMG",
        "Intel",
        "NVIDIA",
        "RTX",
        "3050 Ti",
        "Upgradeable",
        "Repairable",
        "Razer",
        "Blade",
        "Laptop",
        "PC",
        "Webcam",
        "Can this beat Razer?",
        "Are Razer Laptops no longer great?"
    ],
    "views": 547217,
    "likes": 17751,
    "comments_count": 722,
    "description": "Learn more about CORSAIR's NEW iCUE 5000T RGB Case at   Schenker is an interesting brand. They have taken everything great about Razer laptops; thin, reasonably powerful, and configurable. And, they have given you the ability to upgrade it on your own too. But is it worth paying more for one?  Check out the Schenker Vision 14 at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - Small, thing, and powerful? 0:12 - Unboxing 0:51 - Exterior first impressions and overview 1:51 - Sponsor - Corsair! 2:24 - Display specs 3:07 - Webcam impressions 3:30 - Keyboard and trackpad impressions 4:03 - Speaker impressions 4:23 - Display impressions 4:44 - Performance profiles 5:06 - Laptop specs 6:06 - Gaming performance impressions 7:50 - Screen wobble 7:56 - Weight impressions 8:35 - Taking it apart 8:51 - Battery life 9:06 - Upgradeable and repairability thoughts 10:11 - Overall thoughts 10:25 - Configuration and Price impressions 12:16 - Final thoughts",
    "description_links": [
        "https://go.corsair.com/0JXEPR",
        "https://lmg.gg/N8Mlf",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- There are loads of super fast laptops that are large and hot. But this one right here is hopefully fast, and it's definitely small and nice looking. This... Straight from Germany is the Schenker Vision 14, and it looks pretty awesome. Let's move the laptop outta the way for a second. What else do we have in here? A USB stick. That's nice. It probably has their drivers and stuff on it. And some Intel Core badges. I kind of appreciate this, honestly. These are the sort of things that I normally just take off. So they give you the option. As for the charger, it's a barrel plug. Boo. And it's, oh, it's 90 watts. So you at least have like a decent excuse if you're delivering over a hundred watts to use a barrel charger. Whereas in this, I just wish they did type C. Oh wow, it's small. This thing's tiny, look at it. Look at how thin this thing is. The fun thing about it is that this comes with the RTX 3050 Ti. So although that's not, like, blow away, incredible ultra graphics sort of stuff, you're gonna be able to play real actual games on this. Okay, so first of all, what do we have for IO? So we have a full size SD card reader right there. Love to see that. We also have USB Type A and USB Type C. So this one has display port 1.4, but it's not Thunderbolt. Oh, also headphone-microphone combo jack. Around the other side, we have Thunderbolt three, another Type A, and HDMI 2. Now on one hand, I do wish it was 2.1, but on the other, you have two display port 1.4 connectors, so you can get a high quality signal outta that. Looking at the size of this thing, that's really impressive. That's kind of all that you want. Initial impressions are very favorable. Took in some inspiration from Razer and their Blade. Do you know what's also pretty awesome? Our sponsor today, Corsair. Thanks to Corsair for sponsoring this video. Corsair's 5000T RGB case features distinctive contours and 208 individually addressable RGB LEDs. It comes pre-installed with three Corsair LL 120 RGB fans, and includes a smart controller for fan speeds for up to six fans and dual lighting channels for multiple RGB components. There's also removable front and roof mesh airflow panels and two tool-free hinge side panels. The Corsair 5000 T is available now. Check it out at the link below. I'm impressed with these guys. Good job on the design, Schenker. Even this keyboard feels like it's from Razer. The first thing here, this display is both very good and very strange. So the resolution is 2880 by 1800. So that's 16 by 10, and it's at 90 Hertz. It's pretty smart, in my opinion. I see this not so much being a laptop that you are going to be a gamer on as one where you want a nice light laptop that you can take around and do stuff that just so happens to be good enough for gaming. Oh, cool. So you can download different color profiles here. So we do have Windows Hello facial recognition. That is awesome. Easily the best way to get in and out of your laptop. Well, I don't know how you used to get it. Whatever. One thing I do want to look at, though, is the webcam. It looked pretty awful in that little preview there. So we'll just confirm that now. Yeah, this is pretty bad. This is not a great webcam. I don't know, if we change the lighting up a little bit. Yeah, this webcam sucks. What doesn't seem terrible, though, is this keyboard. So I... This keyboard is pretty good. It's not the best that I've felt. It kind of reminds me of older Razer keyboards where they have this real like defined snap. I'm not personally a fan, but I know Linus absolutely loves it. Oh, the track pad is good. Especially once you remove the plastic film, of course. So in my review guide, I don't have information on the track pad. So I don't know if it is glass topped. It's hard to say, it could be. But either way, it feels great. The tuning out of the box isn't terrible, which is kind of rare. Those are terrible. Those are some of the worst speakers I've heard in a laptop in a long time. (upbeat dance music) Okay, we'll switch over to the Dell. (upbeat dance music) It's... Not even close. That's just... So looking at these two displays, the XMG holds up way better. Or I guess Schenker, same company, whatever. It isn't quite as, like, vibrant and generally good as the XPS, but it's a matte display. The colors seem to be broadly accurate. It looks like it's a tiny bit warmer. But at the same, can you tell much of a difference? Before we boot up the game, let's make sure it's in the right mode. We have two options here. Should we go for Enthusiast or Overboost? Overboost? Okay. Also really cool, they have a silent mode here, and they let you select the maximum decibels of the laptop, which is really sweet, like I just turned it on, immediately the fans turned off. Overboost, oh, Fan Boost. How loud is it? That's loud. Actually, that's not too bad. Okay, so for the hardware that we have in here, the CPU is an Intel i7 11370H. Terrible name, but fine CPU. Realistically, don't buy it with that in it. Wait a couple months. 12th gen is coming. Get 12th gen when it comes out. This is a 35 watt TDP CPU. So that will put us in like the Intel P series SKUs that are coming out soon. So that will get you probably four cores like we have here, and then an additional eight efficiency cores which will just make your multi-core stuff way better, and also 12th gen has better battery life as well. So I would just wait. Aside from that, we have 32 gigabytes of RAM, one terabyte Samsung 980 Pro. That's a wicked SSD. WiFi 6. And of course the RTX 3050 Ti. This laptop as a whole has a 90 watt TDP. 50 Watts of that can be given to the 3050 Ti, or kind of all of that can be given to the CPU depending on what kind of a task you have. At 1080P medium, we're currently getting 30 FPS. So if you plan on building a massive castle in \"Valheim,\" you can, you just need to accept 30 FPS. Let's see here. So if I turn off screen recording, does that help much? No, not really. Okay, yeah, so 1080P, low and \"Valheim\" seems to get us about 50 FPS. I would say it's acceptable, but not mind-blowing. In \"Doom\" here, it seems like we're having a much better time. So this is a 1080P on medium details. Looks like we're getting right around 90 FPS or so. Oh geez, what's on the go here? I don't know if it's just stuttering or what, but it's not very fun. Yeah, like this just feels off. Yeah, I think the problem that I'm having is just screen tearing. I wonder if turning VSync on will help. I never use that, but like, yeah, so I'm getting some stuttering. We can see that in the performance metrics here. Let's just turn on more of them. It seems a lot better than I turn VSync on. It's really weird. I don't normally think of that as something that you should do, but it did help make the frame times make more sense in this. So, cool, I guess. Oh, screw off, dude. I'm on easy mode. You're not gonna be able to kill me. Maybe you can. Basically, what that experience is saying is that if you want to have a good gaming experience on this laptop, you can just expect to put in a little bit of work. It's the kind of thing where it's not very big. You're going to have trouble with the thermals and you're going to have trouble with the amount of power available. As long as you go into it knowing to expect, like, to have some compromises in your visuals, I think you're gonna be fine. Like, we are playing \"Doom Eternal\" on 1080P medium settings. One thing that I haven't mentioned yet, but has been annoying me, is the amount of screen wobble. It's not like a deal breaker, but wish it was a little bit stiffer. Okay, so just before I take it apart, I wanna go over again, how much of a feat it is how light this thing is. So this is only one kilogram, or about 2.2 pounds, compared to the XPS 15, which is like 4.4 pounds. It's literally double. And this right here, you do only get four CPU cores. And the XPS also has a 3050 Ti, but you can't really use it for gaming because of the 4K display, that's kind of slushy. It's just not a great gaming experience. You can just huck this thing in your bag. There's enough resolution that you can easily use it as like an actual work machine. It's like pretty sick. Let's take it apart, actually, now. Damn, guys, this is quite impressive. This whole chassis appears to be magnesium. That is wicked. That's how they got it so frigging light. It also means it might be very expensive. I haven't looked at the pricing yet. We'll do that in a second. So for the battery, we get a 53 watt hour jobby. I don't wanna make any claims about the battery life on this. I would hope for what, like six hours probably. I have nothing to base it on besides my own experience. What is very impressive though, is that this machine is not only super small and light, but it's very upgradeable. So look here. We have our battery, battery can be easily taken out, fully replaced. SSD right there. Super easy. Two RAM slots. Frigging wicked. Upgrade your RAM, super simple. I would probably in that case, configure it with 16, knowing that if I need 32, I can just slot it in later. Before I say that the upgradeability on is spectacular, we just want to go a little bit further, 'cause if the track pad and the keyboard are replaceable then it's like A plus. Oh nice, I did not have to take off the cooler. I'm not 100% sure that the keyboard is replaceable. Nevermind, perfect. Okay, awesome, so if we look under here, you can see some screws. So that means that our keyboard is replaceable as long as you can get replacement parts. Same with the track pad. I'm not going to take it out, just 'cause it requires taking out the battery as well. It's not a difficult job. But it's very easy to see that it is screwed in here, so you can replace it if you need to. So overall I am very impressed with this thing. I kind of expected it just be a Razer clone, but it's actually kind of its own thing by making it lighter and, well, it is less powerful, but you don't really need a 3080 in a little gaming laptop. Let's see if the price makes sense, though. Okay, configure. So our starting price is 1,249 pounds. Or is that euros? That's euros. Okay, so the starting price of this guide is $1,365. Is that the one that you want, though? So that gets us our 16 by 10, 90 Hertz display. You know, the 3K one. We do want the GeForce RTX 3050 Ti, and that's 350 euros. Ouch. Oh, so an upgrade from an i5 to an i7 was included in the price of that 3050. We do need at least 16 gigabytes of RAM. It's an additional 40 euros. You can get even more expensive, faster RAM. One terabyte. That's of a 980, so if we wanted to go to the 980 Pro, like we had in this one, that's an additional 85 euros. I don't think it's necessary. Although if we wanted to go WD, we could save 40 euros. So again, very nice that you have all of these options. I was a little bit confused why there was just this space right here, when there could have been a bit of extra battery, but it seems like that you can put another M.2 drive there. So we probably would be fine if we just wanted to get one of these 500 gigabyte SSDs and then upgrade it later. That's awesome. Keyboard. Bunch of options. Are there any RGB ones? No. Can't even call it a Razer clone, then. Okay, yeah, you wanna spend the a hundred bucks for Windows. Guess how much this little Schenker logo here costs you? - [Emily] How much? - Minus 29 euros. You need to pay them to take it off. So our total config of what I think you should buy is just under 2,000 euros. What is that in USD? $2,100. So that is very comparable to an XPS 15 with similar specs. That's kind of rough. How much is a Blade 14? Okay, yeah, we have a problem here. The Blade 14, with, it is only a 1080P display. It's not 16 by 10. But you get a 3060, 144 hertz, one terabyte SSD, 16 gigabytes of RAM, and that's $2,000 US dollars. So for the Vision 14, they do have a saving grace, and that is the weight. So the Blade 14 is just under four pounds, whereas the Vision 14 is 2.2 pounds. That's a big difference. So if you're willing to, you know, sacrifice some gaming performance, get a much better display, for using, for like office tasks and such, it's kind of compelling, especially given that you could get pretty much a similar configuration except a 3050 Ti instead of a 3060. Oh, the 3060 is so much more powerful though. I hope you've had a great old day. Yeah, I guess what you value in your laptop is up to you to decide. So thanks for watching. Hit Like, get subscribed, and just have a great day. I don't know, say hi to Emily. - [Emily] Hi.",
    "transcript_keywords": [
        "thing",
        "kind",
        "laptop",
        "Yeah",
        "display",
        "pretty",
        "RAM",
        "euros",
        "RGB",
        "keyboard",
        "Razer",
        "Corsair",
        "USB Type",
        "Good",
        "large and hot",
        "CPU",
        "bit",
        "battery",
        "gaming",
        "type"
    ],
    "transcript_entity_values": [
        "1080P",
        "Schenker",
        "Razer",
        "1.4",
        "4",
        "USD",
        "USB",
        "Doom",
        "90",
        "Corsair",
        "4.4 pounds",
        "Doom Eternal",
        "up to six",
        "about 2.2 pounds",
        "Windows",
        "32 gigabytes",
        "208",
        "50",
        "90 watts",
        "10",
        "30",
        "500",
        "a hundred watts",
        "Linus",
        "1,365",
        "RGB",
        "Dell",
        "today",
        "16 gigabytes",
        "Valheim",
        "53 watt hour",
        "15",
        "Hertz",
        "5000",
        "just under 2,000 euros",
        "14",
        "980",
        "3080",
        "Vision",
        "WD",
        "the 980 Pro",
        "first",
        "two",
        "144",
        "the Schenker Vision 14",
        "3050",
        "XPS",
        "3060",
        "SD",
        "Boo",
        "2.1",
        "CPU",
        "1080P",
        "Emily",
        "30 FPS",
        "SSD",
        "Samsung 980 Pro",
        "350 euros",
        "RAM",
        "at least 16 gigabytes",
        "one",
        "a great day",
        "Intel Core",
        "second",
        "just under four pounds",
        "USB Type C.",
        "about 50",
        "35 watt",
        "only one kilogram",
        "Schenker",
        "Razer",
        "CPU",
        "3",
        "Germany",
        "GeForce",
        "Intel",
        "100%",
        "three",
        "One",
        "32",
        "an additional eight",
        "14",
        "40 euros",
        "5000",
        "a couple months",
        "six hours",
        "IO",
        "Corsair LL 120 RGB",
        "90 watt TDP",
        "$2,000 US dollars",
        "1800",
        "XMG",
        "2880",
        "an additional 85 euros",
        "16",
        "VSync",
        "USB Type A",
        "2.2 pounds",
        "Razer",
        "2,100",
        "12th",
        "four",
        "11370H. Terrible",
        "HDMI 2",
        "Two",
        "a hundred bucks",
        "RGB",
        "an additional 40 euros",
        "1,249 pounds"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "QUANTITY",
        "NORP",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "DATE",
        "TIME",
        "GPE",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "QUANTITY"
    ]
}