{
    "id": "URvnPM20nNc",
    "title": "Samsung Galaxy Unpacked 2023 in 10 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-02-01T20:22:54Z",
    "video_url": "https://www.youtube.com/watch?v=URvnPM20nNc",
    "category": "Science & Technology",
    "tags": [
        "Samsung galaxy unpacked",
        "Samsung galaxy unpacked 2023",
        "Samsung galaxy unpacked biggest announcements",
        "galaxy s23",
        "Samsung galaxy s23",
        "Samsung galaxy s23 plus",
        "Samsung galaxy s23 camera",
        "galaxy book 3",
        "Samsung galaxy book 3",
        "s23 series",
        "s-pen",
        "galaxy s series",
        "nightography",
        "50 mp camera",
        "200 mp camera",
        "galaxy s23 ultra",
        "samsung galaxy s23 ultra",
        "samsung galaxy s23",
        "unpacked",
        "samsung galaxy",
        "samsung",
        "tech",
        "the verge"
    ],
    "views": 223260,
    "likes": 3943,
    "comments_count": 627,
    "description": "Samsungs new S series lineup is here. The S23 and S23 Plus have adopted the floating camera design of the Ultra, making for a much more cohesive trio this time around. The S23 also comes with a new 200MP camera. Plus, a look at Samsungs Galaxy Book3 which now has a 120Hz AMOLED display, RTX 4050 (or 4070), and 13th-Gen Intel chips. Heres everything you missed. #Samsung #SamsungUnpacked #Technology   Read more:   00:09 S23 Ultra Camera 01:42 New Camera Features 03:43 S23 Lineup Battery and Chips 05:38 Galaxy Book 3 Ultra 07:45 Galaxy Book 3 Pro 360 08:13 One UI 09:42 Price and Availability  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:",
    "description_links": [
        "http://bit.ly/3HqGkQL",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv"
    ],
    "transcript": "- Welcome to Galaxy Unpacked 2023. - The power of Ultra comes from our best hardware working hand-in-hand with our most innovative software. The Galaxy S23 and S23+ bring you a 50 megapixel Wide Camera. - The Galaxy S23 Ultra packs 200 million pixels in the main Wide Camera. When lighting is low, 16 pixels combine into one larger pixel to capture more light, resulting in brighter photos. In standard lighting conditions, the pixels combine into groups of four through our new tetra-squaring process, resulting in higher quality, 50 megapixel images. We've made it easier to auto-focus with Super Quad Pixel. By using four adjacent pixels to detect differences from left to right and top to bottom, it allows the camera to auto-focus faster because it has more points of reference. With Super HDR, you can capture a wider range of light and dark tones in your videos, with more accurate colors, 12-bit dynamic range spectrum of colors, and 4K Super HDR technology at 60 frames per second to both the rear and front cameras for the very first time. It's all made possible by the new Advanced Sensor on the Galaxy S23 series. You can now film in 8K at 30 frames per second with a wider angle, for a more cinematic feel. We've also enhanced the camera to absorb 2.5 times more light than before, giving you brighter footage. Pro video mode gave our directors the ability to meticulously change their camera settings, for focus, white balance, ISO and more. And with Clean Preview, they were able to remove the UX when monitoring takes, which means they could frame every shot with ease. This is a new feature added to Camera Assistant, our app that allows you to choose and adjust a range of camera settings, from activating faster shutter to auto lens switching. Some of my favorite GIFs that I receive, or I find online, are low resolution. With GIF Remaster, I can sharpen each frame to enhance the quality of GIFs that somebody else created. Astro Hyperlapse allows everyday users to capture the starry night sky with professional quality. And with Expert Raw, users can get detailed metadata for more creative control. We're also introducing multiple exposures and Astro Photo to Expert Raw. - [Narrator] Optical image stabilization, or OIS, is a technology that helps increase the steadiness of your footage. On the Galaxy S23 Ultra, we've doubled OIS' capabilities to increase the area in which motion can be offset. This OIS hardware works alongside Adaptive VDIS to analyze and subdivide your movements and to recognize light conditions around you. A dedicated new image processing algorithm separates noise and details by performing multi-frame processing with AI, which combines multiple images across frames to reduce noise. With our improved night solution, the image sensors on the Galaxy S23 Series work to minimize visual noise and an AI-powered ISP algorithm enhances object details and color tone. This makes snapping a photo at night easier and for portraits, AI Stereo Depth Map is able to detect individual objects. It can even separate a person's glasses from the background of your photo, so the details of your portrait are crisp and clear. - The Galaxy S23 series has a powerful battery, while maintaining the smartphone's compact form. The Galaxy S23 and S23+ have 3900mAh and 4700mAh, respectively. For the S23 Ultra, we've maintained the 5000mAh battery without increasing the device's size, even with the larger camera. We've improved the cooling system on the Galaxy S23 series, so your smartphone can regulate its temperature while maintaining powerful performance, so you can game or stream music and videos for even longer. We've worked closely with our partners at Qualcomm to optimize the Galaxy experience with the brand new Snapdragon 8 Gen 2 For Galaxy. The newly designed CPU micro-architecture boosts the processing abilities of the Galaxy S23 series by about 30% compared to last year. The CPU has eight cores, five dedicated to high performance and three for high efficiency. We've optimized our highly efficient MPU architecture, that balances performance and power, by about 49%. And this year, the most significant improvement is the optimized GPU, which is approximately 41% faster and designed for power users. - Our new GPU also enables a Ray Tracing module that makes your gaming experience more immersive and lifelike. Here, you can see two sets of gameplay. On the right, you can see the visuals enhanced by Ray Tracing. Look at the lights and reflections. The in-game lighting, reflections and shadows are even more realistic, so you get a PC-like gaming experience. The entire Galaxy S23 series, Base, Plus and Ultra, now feature screens with a peak brightness of 1750 nits. We're bringing the power of Ultra to our PCs. Introducing the Galaxy Book3 Ultra. - With a full-glass display, a slim bezel and a much wider touch pad. And even though it's thin, it has multiple ports, so you don't need to carry around a USB hub. The Galaxy Book3 Ultra is equipped with the latest 13th Gen Intel Core processor. You can choose from the Core i7 or i9, and it's powerful H-series CPU can support up to 45 watts for high performance. Combine that with the NVIDIA RTX 4070 Laptop GPU and you have the strongest CPU and GPU in the Galaxy Book series. There are also two new Pro models. The Galaxy Book3 Pro 360, for those who want the benefits of a tablet and a PC in one and the Galaxy Book3 Pro, for everyday performance. The Pro and Ultra lineups bring our impressive dynamic AMOLED 2X displays to our PCs for the very first time ever. The Galaxy Book3 Ultra features an expanded, 16 by 10 ratio. With a new, crisp 3K display, that means it's optimized to view more content. The Galaxy Book3 Ultra's 120Hz refresh rate and new GPU provide an incredible gaming experience. The studio-quality microphone has AI noise cancellation, so your voice can be heard with no distractions. Instant hotspot makes it quick and easy to connect to your phone's mobile network. No need to retype your password, it's just one click. And now, you can continue browsing the recent website from your phone, right on your PC. With Multi-control, interactions between devices is super seamless and even simpler to control, all from one single point of input. You can even copy and paste across displays. And with Second Screen, you can turn your tablet into a second display for your PC, to make full use of your PC, phone, and tablet all at once. It's easy to transfer uncompressed RAW images. Once paired through Expert Raw, images sync automatically to the Galaxy Book3 Ultra. With a flexible two in one form factor, the Galaxy Book3 Pro 360 brings you multiple ways to use your PC. It has touchscreen and S Pen capabilities, and with nearly zero S Pen latency, you can have a true to life, pen on paper experience. - We designed these PCs to offer powerful performance, through GPU and CPU enhancements, the bright and accurate colors of our dynamic AMOLED 2X display and a multi-port design. - With One UI, you can truly make your smartphone your own by selecting up to 15 photos and videos of your favorite memories for your lock screen. Every part of the lock screen can be customized, so it looks and feels how you want it to. Smart Suggestions helps you personalize your experience even further, by recommending apps and actions when you'd usually use them. Like, when you put in your Buds2 Pro, Smart Suggestions will remember that you usually listen to Spotify and pull up a custom playlist. Maintenance Mode limits access to your personal data. When your phone is being repaired, customer service staff won't be able to see your messages, gallery or files. It also keeps all the apps you've downloaded private, like banking apps. When you turn on Maintenance Mode, you're the only person who can turn it off by using the verification method of your choice. One UI 5 combines privacy and security controls into one streamlined dashboard, so you can see security status and potential fixes in one place. Being productive comes easily with upgraded Samsung Notes. You can share a work in progress or co-edit in real-time. And for even more collaboration, edit Samsung Notes together in Google Meet. - The Galaxy S23 Series will come with One UI 5.1 and we're excited to announce that One UI 5.1 will be rolling out to more Galaxy devices soon. Galaxy S23 series will be available for pre-order starting today. Pricing starts at $799, with the S23+ at $999 and the S23 Ultra at $1,199. The S22 will be available in the US starting at $699. You can also pre-order the Galaxy Book3 Pro series today, with the 16-inch Book3 Pro starting at $1,249 and the Book3 Pro 360 starting at $1,399. Or pre-order the Galaxy Book3 Ultra on February 14th, starting at $2,199. - Thank you so much for being part of this Unpack. I will see you again soon.",
    "transcript_keywords": [
        "Galaxy",
        "Galaxy Unpacked",
        "Ultra",
        "Pro",
        "Galaxy Book series",
        "series",
        "Camera",
        "Wide Camera",
        "Super Quad Pixel",
        "GPU",
        "megapixel Wide Camera",
        "Expert Raw",
        "Super HDR",
        "CPU",
        "Galaxy experience",
        "main Wide Camera",
        "Galaxy Book",
        "Unpacked",
        "preorder the Galaxy",
        "Super"
    ],
    "transcript_entity_values": [
        "about 30%",
        "ISP",
        "S Pen",
        "three",
        "ISO",
        "nearly zero",
        "5",
        "CPU",
        "Adaptive VDIS",
        "approximately 41%",
        "UI",
        "200 million",
        "One",
        "50",
        "Gen Intel Core",
        "Clean Preview",
        "The Galaxy Book3 Ultra",
        "50 megapixel",
        "about 49%",
        "799",
        "S Pen",
        "February 14th",
        "Ray Tracing",
        "4700mAh",
        "1,399",
        "GPU",
        "the Galaxy Book3 Pro 360",
        "The Galaxy Book3 Ultra's",
        "USB",
        "Super Quad Pixel",
        "Qualcomm",
        "Samsung",
        "Google Meet",
        "Galaxy",
        "12",
        "Galaxy S23",
        "the Galaxy Book",
        "this year",
        "Base, Plus and Ultra",
        "AMOLED 2X",
        "first",
        "Snapdragon 8",
        "10",
        "699",
        "last year",
        "the Galaxy Book3 Pro",
        "30",
        "AI",
        "Astro Hyperlapse",
        "Wide Camera",
        "Wide Camera",
        "US",
        "8",
        "45 watts",
        "the Galaxy S23 Series",
        "1,199",
        "16-inch",
        "the Galaxy S23 Ultra",
        "4",
        "Astro Photo to Expert Raw",
        "120Hz",
        "second",
        "2,199",
        "five",
        "1,249",
        "one",
        "four",
        "999",
        "2.5",
        "UX",
        "today",
        "Spotify",
        "eight",
        "60",
        "3",
        "Advanced Sensor",
        "15",
        "2023",
        "two",
        "K Super",
        "Maintenance Mode",
        "Core",
        "the Galaxy Book3 Ultra",
        "1750",
        "Notes",
        "NVIDIA",
        "3900mAh",
        "16",
        "The Galaxy Book3 Pro 360",
        "Second Screen"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "MONEY",
        "EVENT",
        "DATE",
        "PERSON",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "EVENT",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "FAC",
        "WORK_OF_ART",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "EVENT",
        "MONEY",
        "QUANTITY",
        "EVENT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "EVENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}