{
    "id": "URxSoHpwIz8",
    "title": "Is Chillwell Portable AC a Scam? (Yes, Here’s Why) - Krazy Ken’s Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2023-06-29T14:59:45Z",
    "video_url": "https://www.youtube.com/watch?v=URxSoHpwIz8",
    "category": "Science & Technology",
    "tags": [
        "Is Chillwell Portable AC a Scam? (Yes Here’s Why) - Krazy Ken’s Tech Talk",
        "Chillwell",
        "Chiller Portable",
        "Chillwell Portable AC",
        "Swamp Cooler",
        "Blaux",
        "Arctic Chill",
        "Scam",
        "Chillwell Scam",
        "AC Scam",
        "Evaporative Cooler",
        "HVAC",
        "Air Conditioning",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Tech",
        "Comedy",
        "Humor",
        "Funny",
        "Computer Clan",
        "Air Cooler"
    ],
    "views": 1023477,
    "likes": 28101,
    "comments_count": 3491,
    "description": "Go to  to get a 30-day free trialthe first 200 people will get 20% off their annual subscription! You can support this channel on Patreon! Link below It's summer again (in this hemisphere) and the scammy AC ads are spreading! Today, Krazy Ken debunks a new one and it is AWFUL!  Quick Power System scam   Watch the first scam AC episode   Patreon!    Watch more tech scam-busting!   Enjoy these tech flops   Buy my Wallpaper Mega-Pack!    Follow me on Twitter   Facebook   Shop for cool stuff on my store   Hey! I have a Discord    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Special thanks to Brainiac Brent for helping me research and film this episode! Another thanks to my friend Dave for some additional A/C b-roll.  UPDATE: I ran the Keystone AC energy test again and it read 1,278 wattsmore than shown in the episode (716 watts). I'm not sure if the meter was freaking out earlier, or if the Energy Saver button on the AC did that.  Pixel Peeper 3000 Voiced by Ele (@WraithesGame on Twitter)  Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear I use   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  00:00 Introduction 00:37 Video Ads Overview 03:00 Video Ads Breakdown 08:28 Web Presence 11:30 Purchase Process 12:38 Physical Product Overview 16:01 How Do These Products Work? 17:27 Testing the Scam With Science! 18:53 Testing the One, True Claim? 19:50 Legit Chillwell Alternatives  #KrazyKen #ComputerClan",
    "description_links": [
        "https://brilliant.org/computerclan",
        "https://youtu.be/B4G7iHK3jp0",
        "https://youtu.be/GQdtfRHJTHQ",
        "https://Patreon.com/KrazyKen",
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1riKzQK3dHt6c9_6D2lVwr78",
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1rjrzxzjt_6iGeYS0jiBBZfq",
        "https://thecomputerclan.com/megapack",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Man, it's hotter than Ryan Gosling's abs right now. Not that I would know anything about that. Good thing I received many annoying marketing emails and text messages about this industry-changing, portable AC. Yeah, that'll cool me down, right? Sponsored by Brilliant.org. (upbeat music) Hey everyone, how are you all doing? If you're new here, welcome. My name is Krazy Ken and the Chillwell has been spreading around the internet like crazy because in certain parts of the planet it's summer. So the advertisers are taking advantage of that. And I'm curious to see how the Chillwell and the revolutionary tech inside of it works. So let's start by dissecting the video ad. The ad uses an AI voice throughout. It starts by saying how to escape the heat if you don't have an air conditioner. This only takes five minutes. There's a genius way you can cool any room in 90 seconds and it costs almost nothing and it's taking over the U.S. market like crazy. And it was created by a genius college kid named Martin from Phenix and he just destroyed the billion dollar AC industry. He designed this AC invention after budget cuts left his school with a broken \"air kin\" system. - [AI Male Voice] With a broken \"air kin\" system - [Ken] And the classrooms got up to 95 degrees Fahrenheit. And when the students begged to get it fixed nothing changed. So Martin took matters into his own hands. Thanks to his gift of engineering, he was able to reverse engineer aircon units and he was able to create a perpetual cooling loop, which recycles the coal that's generated so that none of it goes to waste. So then Martin brought the invention to class and he cooled the room from 95 degrees to 65 in two minutes while using 90% less energy than regular AC systems. Then the word got out and investors lined up and an AC company approached Martin for the rights and Martin said no and he was expelled three days later. Martin then went off on his own and partnered with other engineers and mass produced the new invention called Chiller Portable or is it Chillwell? - [AI Male Voice] It's called Chillwell. - [Ken] Then they show it's slowly blowing a plastic bag. Nice? Then they claim Chillwell's cooling capabilities are simply unmatched by regular AC systems. And it's all thanks to Martin's brilliant cooling technology which passes water over a precision engineered cooling element. And they claim it's 98.7% cheaper to run than standard air conditioning. Just fill it with water and plug it into USB and boom it works in rooms up to 400 square feet in size. People all over the world are using Chillwell. So the company is giving it away at a huge discount. - What my advice - What did he say? - What my advice - Okay. It's time to join the smart urban revolution. Do I dare ask what a smart urban revolution is? - It's time to join the smart aircon revolution. - Oh, they meant to say aircon. Okay, I get it. Those words are so easy to mix up. Anyway, click the link and get your 50% discount. The price can increase at any moment. And that's a wrap. Wow, just when I thought scam ads couldn't get any more stupid. We get this. There's lots of things wrong, so let's break it down. Like typical marketing material, this ad starts with a pattern interrupt to grab your attention and normally that's okay, but this is a very dishonest pattern interrupt 'cause it starts off sounding like it's gonna teach you something like a tutorial or a how-to video, but they never revisit that scene. That's right, the ad lied to you. A huge recurring problem in all these fake AC ads, especially on the websites is actually the use of the initialism AC. What these ads truly mean by AC is air cooler, not air conditioning. They're totally different things but they use the same letters. And why are they different? We'll discuss that soon. The next problematic claim is Chillwell cools a room in only 90 seconds for something that's this small with a tiny fan inside of it, I think that's highly improbable and I bet the people that wrote this ad don't have a basic understanding of physics because they use the buzzword perpetual. Nothing in physics is free. Nothing can stay hot forever. Nothing can stay cold forever. Nothing can spin indefinitely. There's always outside forces you have to deal with. And for more on that, I talk about this stuff in my quick power system episode. Check it out, it's a good one. But nevermind that! Let's talk about the H2O delivery system and Hydro-Chill Technology! The ad talks about a precision engineered cooling element that water passes over and that's how the rapid cooling is possible. But they show an animation of a scroll compressor. This ad just wants to sound smart and look cool. I bet there's not actually- I turned it on by accident! These advertisers are just trying to sound smart and look cool. A scroll compressor is in any normal air conditioner. Well, some type of compressor is, they're not always scroll compressors. But anyway, you don't put water in them, you put refrigerant in them. That's how a normal air conditioning system works and I'm willing to bet this tiny cube doesn't have a scroll compressor in it but we can take a look at that later. Oh, and coal? You recycle coal with this product? Indoors with no ventilation? That's unhealthy. Now there is one claim that's probably true. Chillwell uses 90% to 98.7% less energy than regular AC systems. That sounds like a reasonable claim because there's not much happening in this box in the first place. I'm willing to bet my life savings on it. $3. But you know what, I do have a 14,000 BTU air conditioner that we can test this against. So just to add that to the test list. So now we come to my favorite part of these scam ads. The fake backstory. The ad tries to sell us the idea of this genius student, Martin who invented this AC device. And when he turned down the AC company acquisition he was expelled from school. So now he's positioned as the hero and corporations and schools I guess are positioned as the bad guy in the story. For starters, who would expel a student just because he turned down a business offer when the business and the school likely had no affiliation. That just sounds like bad writing, big plot hole. The bigger problem with the story is it doesn't exist. So if the advertisers are sharing this fake story and there's no disclaimer about it whatsoever, how can we trust any of the other claims they make? But how can I prove that it's fake? Hmm. - [Pixel Peeper] Hello Ken. I have conducted an analysis of the video ad. - Pixel peeper, show me what you got. - [Pixel Peeper] I identified a watermark in the footage. - Pixel peeper 3,000, enhance image. - [Pixel Peeper] Enhancing. Beep boop boop boop boop beep boop. Result. SRF1, a TV channel owned by Swiss radio and television. - Scan the frames from the video and reverse search the images and then cross-reference them with the SRF search query. Man, I sound so smart when I say that stuff. - [Pixel Peeper] Most of this footage is from a SRF doc video about a brilliant mathematician Maximilian Janisch. - Boom, we got it. Thanks, Pixel Peeper. - [Pixel Peeper] No problem, that will be $4,000. - Oh, just one second. Oops, I disconnected your power. How did that happen? Anyway, this fake backstory steals footage from SRF and misuses Max's identity under the name Martin. All in a crappy effort to sell overpriced AC products. The scammers used a perfect subject because Max is popular enough to be featured in a well-made documentary, but not too popular where a typical consumer could identify him. Could you imagine the scammers trying to do this with someone famous? - [AI] This brilliant engineer dropped out of Reed College and flipped the $100 billion aircon industry in its head. - Well, that seems legit. I mean, I've never seen that guy before. All right, I'm just kidding. I know it's Steve Ballmer. Another thing I noticed, this AC product looks nothing like the Chillwells I've seen online nor does it look like the one I have. So maybe there's multiple versions of Chillwell? And I found it weird that the subtitles called the product Chiller Portable but the voice narration called it Chillwell. So there's some confusion here. There must have been a rename of the product at some point. More inconsistencies equals more red flags. Now I know what some of you're thinking. Ken, isn't that just a swamp cooler or evaporative cooler? Yeah, in principle, you're right, that's how it works. But in reality, it barely even passes as that and you'll see why soon. Now let's look at their web presence because I've seen these guys pop up everywhere. The first web ad I saw for Chillwell says I can make any room ice cold. And this air cooler is taking ${region.capitalized}$ by storm. Mm, I just love that city. It's so pretty in the summer. Also, the picture shows Arctic Air branding, not Chillwell. So who is stealing from whom here? In addition, I've seen several advertorials that claim this genius startup is turning the $135 billion dollar AC industry on its head. I've said it before but I'll say it again because it's important. These advertorials can be misleading. They look like news articles but they're really just ads trying to sell you something. Usually there's a disclaimer at the top and usually there's a disclaimer at the bottom. So always exercise caution. My favorite marketing webpage is this Instant AC Anywhere page. It boldly claims that Chillwell can compete with high-end ACs, but without the high price tag and it can cool any room in under five minutes. Five minutes, huh? That's not as fast as the two minute claim in the video ad. And the scammers value this thing at an insane $178. I'm sorry, but if you pay $178 for one of these things, you are a giant sucker. I'm just kidding. We're all humans. We all make mistakes. I just wanted an excuse to use this prop. So that brings me to Chillwell's actual product sites. And yes, I said sites plural because I found two websites where you can buy the product. GetyourChillwell.com shows a completely different product than what we've seen earlier and it claims it can cool in 30 seconds flat. Why is the design different but the name is the same? My theory is this is Chillwell 1.0 because in other marketing materials I see them say 2.0 next to the name and it has a different design. And weirdly enough, within the last three weeks, all the images on this website were updated to reflect the newer product. So perhaps it was just an old neglected website and it needed to be updated but because that site seemed outdated at the time, I didn't buy anything from there. Instead, I bought a Chillwell 2.0 from a website that a bunch of advertorials linked to, consumerreviewsguide.com. This site claims you can get winter weather with the push of a button, simply put water in and let it rip. Let it rip, is this a Bey Blade? Oh, and I can't wait to try out friendly cooling technology whatever the (beep) that is. Also, I'm sorry, anonymous woman but if you're hot enough or you need an air cooler maybe you should take off the jeans and the long sleeve shirt! Also, this review caught my attention. Andrew says the filter uses silver to kill germs in the air. Look, I know silver can be used in antimicrobial applications, but none of the marketing materials or websites or anything mention silver in the filter for the Chillwell. So if none of that information was public, how did that reviewer know about it? I just can't take it anymore. I need to test one of these things out for myself. So you know where I'm going with this, right? I went ahead and bought one. The purchase page offers up to a four pack deal valued at an insane $553. And what's even more insane is within the last three weeks they upped the value price to $615. I guess inflation is really coming down hard on the AC industry. Anyway, because I'm not a giant sucker, I just purchased one for $90. Yep, that was still painful. Oh look, a post-transaction upsell and another and another and another, and another, and another. Stop! Just, just stop! Just shut the- Thankfully it actually arrived quickly. So we can try it out and I can finally find out what these two circles are on the front. Like they look like eyeballs or something. Oh wait, I don't know if I can continue. The manual says people with limited physical, visual, or mental abilities or lacking proper experience or knowledge should never use Chillwell without supervision. Do I lack mental abilities and knowledge? Whoa! Bust this- Oh (beep)! So we'll just do- Ah (beep)! Oh no you don't! No, nah, it'll be fine. The Chillwell features three fan speeds and two snowflake settings. Oh, those are the cooling buttons. Okay, let's see here. Oh, oh, they're misters. Those are the, what do they call 'em? The the cooling jets. Weeee! This is, this is great. Oh, that's gonna suck in a humid climate. Chillwell also has a built-in battery and lights with different color and brightness settings. It charges over a USB-C and it has a built-in handle. On top is a door covering the water tank. You can pour water in here and insert ice and the cooling cartridge, which they recommend you freeze before inserting so it can help cool the air better. Now I've been playing with the Chillwell for about a half hour and I gotta say it's quite a bit better than the Blaux that I looked at a couple years back, especially with the convenience of a built-in battery. But it's still kind of a piece of crap and it's definitely not worth $153. Also, the website keeps claiming how portable this thing is but there's warnings in the manual that say you can't carry the unit when it's filled with water and there's no drain on here. So once you fill it, you have to evaporate all the liquid before you can move it and I would believe the manual to an extent because the fan inside of here and the front of the vent are really close to the max fill line so if the water tilts forward or back a little bit it's gonna go into the fan or pour out the front. Genius engineering, 10 out of 10. Imagine having four of these lying around your house. You have to go around and fill them all up all the time. The water tank isn't that big, it'll last you about two and a half hours. And on top of that, if you want the cooling- Stop turning on all the time! If you want the cooling cartridge frozen, you have to constantly refreeze them and swap 'em out all the time. And because you can't move the unit you have to take this drippy mess out and transport it back to your kitchen all the time and it's just a freaking mess. Oh, and guess what else? There's no scroll compressor in here. Another lie. And for some reason the door says do not remove filter during use. What's gonna happen? Am I gonna blow up? Hmm. Hang on. I made a new discovery. This thing was made by Ontel Products Corp and the product name is Deluxe Portable Air Cooler. I don't see- Oh, it's leaking. Oh, I hate this thing so much. See, it's just a mess. Anyway, I don't see any mention of Chillwell branding anywhere on this thing. Good gravy. And from the looks of it, Ontel doesn't sell these things on their website at least not anymore, but they sell lights and Star Bellys? Okay. And from these Google reviews, it sounds like customers are not happy with Ontel's air cooler products. Yeesh, I'm sorry guys. Well, hopefully what I'm saying now can help prevent other people from accidentally buying this POS 9,000. So before I test the Chillwell to see if those reviews are justified, I want to quickly circle back to the swamp cooler/evaporative cooler terms I talked about earlier. I hear the term air cooler often used interchangeably with swamp cooler and that's acceptable and these are appliances that consumers can purchase for their homes and they're much bigger than these tiny Chillwell things. Much more effective too. The term evaporative cooler can also be used interchangeably. Different regions call the hardware different things. But ultimately, how do these things work? Big or small? Well, it's not like a normal air conditioner. They use evaporation. When water evaporates, the surface it evaporates from cools because heat energy is drawn from the surface and escapes with the vapor. This is a reason why we sweat. It keeps our bodies cool. As for portable swamp cooler appliances, these consist of a fan, a reservoir, pump and pad. The pump draws water from the reservoir and drips it through the pad, keeping it wet. When the air passes through, evaporation occurs, which cools the pad. A fan draws air through the cool pad and blows it out the other side, cooling the room. You need to vent the air outside otherwise moisture will build up in the room. This isn't necessary for air conditioners because they remove moisture from the warm air they draw in. Different types of swamp coolers have different cooling capabilities. Some are made for large spaces and some truly only work for temporary desk use. Despite what the fishy advertisements say. You'll notice an instant cooling effect if you put your face right in front of it because you're getting the mist and you're getting the cool breeze from the fan but that's nothing special, that's certainly not enough to flip the $135 billion dollar aircon industry on its head. So now I must tackle the boldest claims and answer the big question, is the Chillwell competitive with an actual real air conditioning unit? My hypothesis says no, but we need to prove it with science. For this test, I escaped my lair and found a 13 by 12 foot room with an eight foot ceiling. I heated the room to 84 degrees Fahrenheit with an Intel MacBook Pro. Just kidding, I used a Blaux space heater. For scientific control, I let the room cool for 30 minutes and I took temperature readings at the two and 30 minute mark. Two minutes in, the temperature was still at 84, 30 minutes in it dropped to 82. Then I filled the Chillwell with water and inserted the cartridge which I previously wet and froze. I placed the Chillwell on the opposite end of the room, further from the thermometer to try to measure the room's temperature more accurately. Then I turned the Chillwell under the max turbo setting and let it run. After two minutes, the temperature was the same, 84 degrees. Hmm, that's just a wee bit short of 30 degrees but hey, what's a few degrees between friends? We're not friends. And at the 30 minute mark, the temperature was 81 degrees. So after a half hour, the Chillwell only cooled the room by three degrees, and two of those degrees were natural as we saw in the control. So really the Chillwell only cooled the room by one degree. And I noticed it was really humid, which felt really muggy and icky in 81 degree temperature. But that kind of makes sense, right? I mean, it is a swamp cooler. So no Chillwell doesn't come anywhere close to a real air conditioner's, cooling capabilities but there might be some redemption here. Remember I said the Chillwell ad had possibly one true claim, the 90% to 98.7% energy savings? Well, let's test that out now. I'll use my Sense Monitor to measure my real air conditioner and a Kill A Watt to measure the Chillwell. My 14,000 BTU Keystone air conditioner draws 716 watts on max settings and the Chillwell draws 8.7. Do the math and we'll see Chillwell uses 1.21% of the Keystone's draw, resulting in 98.76% less wattage. Wow, I don't know how that number came so close to the ads claims. I guess the advertisers did a similar test or maybe it's just a big coincidence. Either way, it's amusing but that's not really saying anything because the Chillwell doesn't actually cool that effectively. So it doesn't need to draw that much power. So it's not worth the money. If you need to cool your house and you don't have central AC or a wall AC, there are portable air conditioner options you can get. But for the sake of floor space and efficiency, I recommend getting a window unit instead. And if you're in a hot, dry, climate and air conditioning doesn't fit your needs, there are window evaporative cooler products as well. Some of these units can be a little bit more expensive but trust me, they are worth it. They cool much better than these puny little things. So don't waste your time with them. And besides, you're already cool enough in my book. Wow, that was corny. It's true. I did say you should ignore the Chillwell but you shouldn't ignore strengthening your brain muscles so you can understand how real technology works in the real world. And regardless of application, I think learning how to learn is an imperative skill and that's why I wanna show you Brilliant.org. Brilliant has thousands of interactive courses about computer science, neural networks, programming and more. And since you're watching me I assume you're into tech right? Then The How Technology Works Course is perfect for you. No joke. One time I was so immersed in a lesson I was up past midnight learning about video compression which is a crucial technology you're using to watch me right now. - [Woman] Ken, it's getting late, come to bed. - Not now, babe. I'm learning about macro blocks! You can try Brilliant Free for 30 days. Simply visit brilliant.org/computerclan. And if you're one of the first 200 people to visit that link you'll get 20% off your annual subscription. And when you do that you're also supporting the Computer Clan so thank you very much. Catch the crazy and pass it on. (upbeat music) Do not remove filter during use.",
    "transcript_keywords": [
        "Ryan Gosling abs",
        "Chillwell",
        "Ryan Gosling",
        "air",
        "air cooler",
        "air conditioner",
        "hotter than Ryan",
        "Gosling abs",
        "claim Chillwell cooling",
        "cooling",
        "cooler",
        "cool",
        "Martin",
        "room",
        "water",
        "air conditioning",
        "things",
        "product",
        "air cooler products",
        "Chillwell cools"
    ],
    "transcript_entity_values": [
        "Brilliant.org",
        "84 degrees",
        "Chillwell",
        "$100 billion",
        "1.21%",
        "Bust",
        "two",
        "two and 30",
        "8.7",
        "2.0",
        "eight foot",
        "20%",
        "Martin",
        "a couple years",
        "Steve Ballmer",
        "Five minutes",
        "Mm",
        "615",
        "the 90% to 98.7%",
        "30 minutes",
        "Ontel",
        "four",
        "one",
        "Star Bellys",
        "84",
        "12 foot",
        "the smart aircon revolution",
        "3,000",
        "Max",
        "Chillwell",
        "82",
        "Swiss",
        "98.7%",
        "a few degrees",
        "50%",
        "Chillwell 2.0",
        "13",
        "Bey Blade",
        "153",
        "Chillwell",
        "up to a four",
        "Chillwell 1.0",
        "max",
        "GetyourChillwell.com",
        "98.76%",
        "84 degrees Fahrenheit",
        "Google",
        "AC",
        "30 minute",
        "first",
        "the summer",
        "90%",
        "SRF1",
        "two minutes",
        "a half hour",
        "billion dollar",
        "summer",
        "three",
        "The How Technology Works Course",
        "USB",
        "U.S.",
        "Ken",
        "two minute",
        "81 degrees",
        "up to 400 square feet",
        "Blaux",
        "95 degrees to 65",
        "90",
        "Arctic Air",
        "14,000",
        "Chiller Portable",
        "the last three weeks",
        "Sense Monitor",
        "90 seconds",
        "30 days",
        "SRF",
        "about two and a half hours",
        "553",
        "Krazy Ken",
        "three degrees",
        "under five minutes",
        "Martin",
        "thousands",
        "three days later",
        "10",
        "Chillwells",
        "3",
        "watts",
        "Deluxe Portable Air Cooler",
        "the Computer Clan",
        "Hydro-Chill Technology",
        "Two minutes",
        "81 degree",
        "annual",
        "five minutes",
        "200",
        "Pixel Peeper",
        "4,000",
        "Chillwell",
        "178",
        "$135 billion dollar",
        "30 seconds",
        "90% to 98.7%",
        "Phenix",
        "winter",
        "Keystone",
        "Ryan Gosling's",
        "30 degrees",
        "the smart urban revolution",
        "Blaux",
        "9,000",
        "only 90 seconds",
        "Ontel Products Corp",
        "716",
        "One",
        "Andrew",
        "95 degrees Fahrenheit",
        "second",
        "about a half hour",
        "Maximilian Janisch",
        "Intel MacBook Pro",
        "Reed College"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "PERSON",
        "DATE",
        "PERSON",
        "TIME",
        "PERSON",
        "MONEY",
        "PERCENT",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "FAC",
        "CARDINAL",
        "NORP",
        "PERCENT",
        "QUANTITY",
        "PERCENT",
        "FAC",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "ORG",
        "TIME",
        "ORDINAL",
        "DATE",
        "PERCENT",
        "ORG",
        "TIME",
        "TIME",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "NORP",
        "QUANTITY",
        "MONEY",
        "LOC",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "QUANTITY",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "QUANTITY",
        "DATE",
        "TIME",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "TIME",
        "PERCENT",
        "GPE",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "TIME",
        "PERSON",
        "ORG",
        "ORG"
    ]
}