{
    "id": "uth__0g2an8",
    "title": "No more FIRES?!? - NZXT H1 V2",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-02-08T16:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=uth__0g2an8",
    "category": "Science & Technology",
    "tags": [
        "NZXT",
        "H1",
        "PC",
        "Case",
        "SSF",
        "Small Form Factor",
        "Fires",
        "Issues",
        "Spark",
        "ShortCircuit",
        "PC Building",
        "Does the H1 cause fires still?",
        "Did they fix the problem?",
        "The case almost ruined NZXT"
    ],
    "views": 500247,
    "likes": 18262,
    "comments_count": 761,
    "description": "Get 20% OFF + Free Shipping @Manscaped at    NZXT's H1 had a rocky lifespan with potential fires due to a faulty design at the PCI-e riser. Well, they fixed it now with the NZXT H1 v2 by designing a new PCI-e riser from the group up, and it's a little bit larger that can fit 3000 series of GPU. So hopefully, this one doesn't spark flames.  Check out the NZXT H1 v2 at   Buy Intel i7-11700k CPU   Amazon:    Best Buy:    Newegg:   Buy ROG Strix Z590-I Gaming WiFi 6E LGA 1200   Amazon:    B&H Photo:   Buy Trident Z Royal DDR4 3600 CL18 (2x16gb)   Amazon:    Newegg:   Buy Crucial P5 M.2 500GB   Amazon:    Newegg:   Buy ASUS ROG STRIX NVIDIA GeForce RTX 3090 White OC Edition   Amazon:    Newegg:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS ---------------------------------------------------  0:00 - Beefcakes needed 0:25 - Unboxing 0:54 - Disassembly 1:26 - Layout impressions 2:03 - Sponsor - Manscaped! 2:25 - Assembly 7:25 - Small form factor PSU thoughts 8:13 - PC build thoughts 8:22 - I/O port placement impressions 8:47 - Powering it on 9:12 - Troubleshooting 9:43 - Full assembly impressions 10:19 - PSU draw impressions 10:54 - Cooling and noise impressions 11:25 - Final thoughts",
    "description_links": [
        "https://manscaped.com/CIRCUIT",
        "https://lmg.gg/yrvrv",
        "https://geni.us/BywKZ",
        "https://geni.us/28d1GXD",
        "https://geni.us/VA21",
        "https://geni.us/Bsd77i",
        "https://geni.us/yZsZq",
        "https://geni.us/JGzvx7",
        "https://geni.us/zRhKTf",
        "https://geni.us/PlTAc",
        "https://geni.us/BpDKq",
        "https://geni.us/Vye7vds",
        "https://geni.us/7A50G",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- I wanna see a beef cake in this. Geez, this is a big... (beep) this is the NZXT H1 version two. And it has the improvements you'd expect in a, you know, generation of case design. More GPU support, more power supply wattages and more cooling and also less fires. You normally don't expect that to be a selling point but it is so let's get into it. Okay, I guess it's one of those cases where they put all the things you need inside of the case. Is this a case that we use to make the Noden Xbox one PC. Oh, okay. Yeah, this sure looks like an Xbox, but a lot bigger. This thing's 400 bucks, 350 when you're not in the US because tariffs to be clear for 400 bucks, you are getting the case, the cooler and the power supply. So it's not like that's just the chassis. Pull to remove back metal panel. (clicks) Okay, so that's off. Does this come off? (metal clanks) As you can tell, I don't have experience with this case. That's step three. What's step two? Oh, we already did step two. What was step one? Were we supposed to do a step one? Oh, step one, pull this off. Aha, now does this slide up? Oh yeah. Wow who would've ever thought that reading the instructions would be useful. There's our box. Oh, that is pretty nice having a power supply that's built in. Cause all these cables I am guessing are about the right length for where they need to go. Apparently for the GPU, we get eight millimeters more of height, which I'm guessing you can probably fit a three slot card in here depending on just how tall it is. And 19 millimeters of more length. So 30 series cards should be good. Oh my God. That's not much space for the motherboard. Look at this. So I'm going to cheat a bit and use the manual. You're saying boo Jono, but I want this to be done. (chuckles) Mandscape's new performance package 4.0 kit is designed to contain everything you need to make grooming below the waist easy. It includes an updated lawnmower 4.0 with its wireless charging. Weed whacker nose trimmer for the tricky areas. Plus some other goodies like the crop preserver and crop reviver sprays for deodorizing and toning. Get 20% off plus free international shipping using the link in the video description. Remove screws pointed by arrows and lift open. Okay, I can do that. We've got a nice 140 fan here and a reasonably enough sized radiator. It's not gonna give you the most performance possible. Wow, who would've thought that reading the instructions makes everything way easier. Today, it would appear that we're going with an i7-11700K and also an X590 board from ASUS. So this is going to be a really fast little system. You can probably also overclock the beans off the memory on this. When you only have two Ram slots you can run them a lot faster than if you have four because of reflections in the signal and crap. Anyway. Maybe we'll try that. All the screws are in here I am guessing. For Ram, we've gone with Trident Z Royals 4,600 C18. So this is probably a brutally expensive kit of Ram. It's also really dirty. So it appear that the motherboard goes in this way. So your IO is at the bottom. That's going to be kind of nice for easily making all of your cable management look good but it's gonna really suck when you wanna plug something in. I was afraid for a second that I had to attach the cooler mounting beforehand, but no you have access from the back so you don't need to worry about it. Do you remember how it was like reading the instructions? Yeah, that lasted about 10 seconds. Now, one reason to attach the cooler mounting before you go into the case is that this is super awkward to get at. Thank you, logistics. That sounded kind of sarcastic, but logistics are awesome. They picked all the parts for this PC. For storage, we're going with half a gigabyte crucial P5 M.2, that's a little bit under spec but we do rate up here have two, two and a half inch drive base. So we could add additional storage later pretty easily. (clicks) SSDs slot right in. Motherboards in, I could attach the cooler right now but I think it's wiser to attach all of the cables first and especially stuff like don't miss your like front panel and so on. I really appreciate how they've pre ran all these cables to the spots where they're going to go. I don't have to worry about the routing of the CPU power connector. It's just there. It's already managed in. This is always the problem with small form factor cases. Just getting your hands in there. The final bit to plug into the motherboard is the PCEI riser. Now this one right here is Gen four, which is awesome because if we use like, you know, a Gen four motherboard gen three ones don't work, but we'll just be flaky. It's a huge pain in the troubleshoot. Also, this one's been designed specifically for this case and solves the problem that the last generation had where the 12 volt plane could be shorted to, you know, ground and burn your house down. I shouldn't say that as a positive, but yeah, this one apparently is safe. (bell rings) (group cheers) Finally for this side, installing the cooler. This is once again, really tight. There we go. For tightening down your CPU, I always recommend going like half tightness on all of them go around in kind of like a a cross and then a cross again pattern. And that way you just avoid, you know putting a whole bunch of pressure on one side and having a thermal paste kind of squish out. For the GPU, we're going with the Founders Edition 3080ti. This thing is obscenely fast. It's also obscenely expensive and it's kind of small for how powerful it is. Okay, Let's have a bit of a gander here. (upbeat music) Yeah, I don't think that's gonna work very well. So the problem is this fan is blowing out directly into your drives. Now they have included, and this is an upgrade for this generation, a 92 millimeter PWM fan in the back. So that should help getting some of that out. But quick trip to the warehouse has netted us a nice little upgrade. Instead of our 3080ti, we have its bigger brother. This huge fricking mass of 3090, if it can cool and almost more importantly power this, I'll be quite impressed. Geez, this is, this is a big... (beep) Oh, I love this. This is so great. (laughs) It's all GPU. One thing to note is that small Form Factor power supplies are not as good as full fat power supplies. Andy learned this the hard way. - [Andy] Yeah, I blew up mine. - Andy's... - [Andy] It was windows updates though. - Windows updates what killed your PC? - [Andy] Yeah. - Geez. Yeah, 'cause the problem that you run into is not that these small form factor power supplies can deliver the current, it's that they can't deliver it really fast. So these 30 series cards have really bad habits of like having super are quick spikes and then they come down and if you have big caps, it's not a big deal, but in small Form Factor cases where you can only have smaller capacitors, you can blow it up or just shut it down. Ideally have it shut down. Yeah, that was really fast, actually. Barely looked at the instructions and we're done in what? Like that was under an hour. Okay, apparently 40 minutes according to Andy. Now on a normal computer case, you plug in your USB, something like that. Here you plug in USB by doing that. I feel like one of those stupid infomercials people struggling with something that should be easy, plugging everything into this 'cause it is actually kind of difficult. Okay, bets that she just works first time. - [Andy] 80%? Hey. - Okay, all the lights are promising but there's nothing to suggest this shouldn't be working. Like none of the lights on the motherboard are on that I can tell. Oh, I think I found it. I think I found it. Okay. I've discovered the culprit. Right in here, CPU not getting power. Hey, it worked. So I swap up the Ram and the GPU, but guess what the problem was? The fricking display port cable. Now I think this is NZXT's fault. You'll see that the way the GPU's in the slot, our display port cable connectors are kind of squished. So I'm suspicious that our display port cable just wasn't going in all the way. And that's why we didn't have a signal. Are you not booting? Like what's on the go here. Oh you absolute piece of.. (beep) We did it, she works and it looks pretty great, actually. Now we get to do the best part of this video. (sticker rustles) Oh. This thing looks like an absolute beast. I love how it's just like half of it is GPU. The packaging of this machine is really great. Oh yeah. And the problems that we're having were just stupid motherboard stuff. It was trying to get the CPU to go to gigahertz which didn't work most of the time. But sometimes it did, which is why we couldn't figure it out. Well, I could do the nice thing to this computer and you know, just play some games on it or something and be like, oh yeah, cool, no, we're just going straight to Prime95 and FurMark at the same time. If it survives that, it'll survive games. No problem. This is not being very kind. So 180 Watts on the CPU, GPU is at, oh 400 Watts. Excellent. So we have like 150, 180-ish Watts to go until the powers supply conks out. Good job at not NZXT. That's good. Wow, that is kicking off some heat. This is, it's also kicking off some noise. Holy Frig. We've been doing this for three minutes and the temperatures seem to be about leveling out. So CPU 80 degrees, GPU at 74. I'm guessing it would still climb up until about 80 and who knows where exactly it's going to land but that's going to be very GPU dependent. I'm a little bit disappointed with the power supply fan and how loud it is. But at the same time, like we're pulling 600 Watts consistently here. Overall though, I'm quite impressed. The temperatures didn't get out of control and like it's a 3090 and 11700 K, that's a lot of power for a system of the size and just did it. Going in and tweaking the fan curves would probably be able to bring the temperatures down a bit. And overall I like it. Nice, simple little build and I think it looks great. Yeah and no more fires, geez. So huge thanks for watching this video. Hit like, get subscribed. If you wanna check out this case, there should be a link in the video description and maybe go watch the friend in ST10 video. I think that's what it's called. It's mechanical calculator proofed in an excellent job writing it. Great video.",
    "transcript_keywords": [
        "GPU",
        "Yeah",
        "power",
        "case",
        "small form factor",
        "CPU",
        "power supply",
        "kind",
        "form factor cases",
        "Form Factor power",
        "form factor",
        "beef cake",
        "step",
        "motherboard",
        "small form",
        "problem",
        "bit",
        "nice",
        "video",
        "Ram"
    ],
    "transcript_entity_values": [
        "half",
        "three minutes",
        "X590",
        "three",
        "One",
        "80%",
        "H1",
        "80 degrees",
        "74",
        "US",
        "20%",
        "Ram",
        "one",
        "92 millimeter",
        "USB",
        "180-ish",
        "Gen four",
        "PWM",
        "3090",
        "Watts",
        "Andy",
        "Today",
        "150",
        "second",
        "Trident Z Royals",
        "Watts",
        "P5",
        "11700",
        "350",
        "600",
        "about 10 seconds",
        "IO",
        "PCEI",
        "19 millimeters",
        "Jono",
        "40 minutes",
        "first",
        "180",
        "two",
        "Ram",
        "4.0",
        "four",
        "GPU",
        "Noden Xbox",
        "30",
        "eight millimeters",
        "12 volt",
        "about 80",
        "Mandscape",
        "C18",
        "Xbox",
        "CPU",
        "NZXT",
        "ASUS",
        "FurMark",
        "half a gigabyte",
        "400 bucks"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "GPE",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "FAC",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "LOC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "GPE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "MONEY"
    ]
}