{
    "id": "uuiWJomwmWo",
    "title": "I was excited for this... - BOOX Note Air",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-04-24T19:22:01Z",
    "video_url": "https://www.youtube.com/watch?v=uuiWJomwmWo",
    "category": "Science & Technology",
    "tags": [
        "BOOX",
        "Book",
        "Tablet",
        "E-Ink",
        "Reader",
        "PDF",
        "Drawing",
        "Stylus",
        "Note taking",
        "Sarah",
        "Unboxing",
        "Note Air"
    ],
    "views": 1353972,
    "likes": 63231,
    "comments_count": 4614,
    "description": "The BOOX Note Air is an e-ink device that is primarily meant to be used to read books and make notes on them, but it states it's a tablet and that you can create works of art on it as well. Not sure if it's iPad level, but Sarah decides to take a look to see what you can do with it. Also, she has two cats and a dog, so pardon the shed city.   Buy BOOX Note Air E-Ink Tablet On Boox.com:  On Amazon (PAID LINK):  On Newegg (PAID LINK):  On Best Buy:    Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/2JYMW",
        "https://geni.us/6dj8Mzw",
        "https://geni.us/fQdvh",
        "https://geni.us/yEVHv",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Hi, Jono. (laughing) - [Jono] Hello. - Hi, audience. (laughing) - Today, I'll be checking out the Note Air by BOOX, they have sent us this E Ink drawing tablet to check out and I am really excited to unbox it, so let's get started. So as a graphic designer and illustrator, I've been using a iPad Pro during most of my profession, drawing things like the ABC book for lttstore.com. But I want to see if this E Ink drawing tablet would be a good alternative to the iPad for those who simply cannot afford it since it is very expensive. Too expensive Apple. So, I'm going to initially take a look at the, oh, I guess this is just protective film, there's no manual. So, I'm just going to push these aside for now and I'm going to take a look at the tablet. As a graphic designer, I do love the matte black and spot gloss that you see here. Wow. It also feels embossed, which is pretty cool. I love packaging, sometimes it makes or breaks whether or not I buy a product, so, this one is pretty cool. - [Jono] Packaging nerd. (laughing) All right. Wow, I'm going to take it out of here. So here's our tablet. It looks quite nice. I will take the sleeve off of it. - [Jono] Wow, you're so careful with everything. (laughing) - Yes, I'm the most gentle person alive. - Okay. - What is she doing now? What, what? (rattling) - [Man] It's in. - Okay. (laughing) - It's in. - It also comes with a screen protector, which I'm not going to bother putting on because I'm gentle. We also have the warranty card, cool, don't need that. We're definitely not going to break anything today. And I believe this is the charger and the stylus by the icons that are on the top of this packaging box. Okay. Ooh, there's the stylus, it feels nice. I would say it's not as nice as my Apple pencil but for the price of this product, it's definitely workable. - [Jono] What's 'workable' mean? - Feeling wise. So it feels... A little thicker than what an average pencil or pen would feel like, but compared to the iPad pencils, it's pretty similar. I believe it clips on to charge, I might be wrong, but, not there, there we go. So it looks like our little E Ink tablet is USB-C charged. - [David] Throw it behind you. YOLO. (David laughing) - Yeah, somebody else is cleaning that up. And it looks like our tablet also came with a cover. I'm not sure about this little red piece right here, kind of throws me off, but whatever. Yeah, it's cute, you can carry it. If you need to carry your tablet case around, I mean, sure, why not? Ah, you can buy this dope ShortCircuit shirt from lttstore.com. Case feels pretty premium, it feels like a book, which is kind of cute. I don't know what the, oh, this is for holding the stylus. Let's pretend that doesn't exist right now. Or I will install... (laughing) My tablet to it's case. They're, oh, are they magnets? - [Jono] Yeah, those-- - Oh, they're magnets. Okay, so, I'm just going to take the protective film off. (humming) Nice. (laughing) Oh, it doesn't feel like it does much really. Okay, what are the point of, what is the point of the magnets then? Maybe that's... No, this would go on the front, right? Cause it looks like it holds the stylus. It's a mystery. (clanging) - [Riley] What that stripe on the back? - Just a design choice that I disagree with, but-- (Riley laughing) - [Jono] Looks like a book. - I guess that's their point, but... - [Riley] I guess so, but you can't draw on books. - No. - [Jono] You can. - Well. - [Riley] You're not supposed to, you'll go to jail. (laughing) - This is a 10.3 inch E Ink tablet with a 5.8 millimeter thickness. And it charges with USB-C as we saw previously when we were looking at the charging cord, the button is also on the side and there's speakers, which is pretty cool. So, I'm just going to put it back in the case now and we're going to turn it on. It's weird that it's black and white, it feels like it should be colored but it's not, that's one of the downsides of this product. So, the screen resolution is 1872 by 1404 which offers us a 227 dpi screen. We love an easy to follow set up and this is one of them. Now we will calibrate the stylus, let's see how this goes. - [Jono] Draw a happy face. - Oh, I will. (Jono laughing) The first thing that I noticed with the stylus the first time that I touched it to the tablet itself is that the tip is quite fine. With the iPad pencil in comparison, this is way finer, which is actually quite nice. At first glance, we have a couple of options here and the one that I am most excited about is drawing which I don't see here anywhere. Oh, wait. Okay no, it's not that. Let's check out each thing individually and see how we like it. So, first we have library where I guess you can add books. The Note Air offers connection to Wi-Fi networks that are 2.4 gigahertz and 5.0 gigahertz. So, I'm just going to connect to the Wi-Fi and we can get going. Books. - [Jono] Ooh. - So many books. (laughing) Why does it say banned books? (Jono laughing) - [David] Yeah, lets go there. - [Jono] I wanna see what the books are. - I'm feeling naughty you know. (laughing) - [David] Gonna report you to HR. - I'm sorry. I'm not a fan of the smoothness of this scrolling. - [David] 2 Hertz. - Yeah, it, the hertz hurt. But with that being said, there's quite a large variety of books here including vintage and classic, animals, happy surprise, whatever that's supposed to mean. - [Jono] Are you in the banned books section? - No, that's not part of the book section. So we have our book here, it looks very scanned in, but that's not what matters, what matters is the text and the text looks good. It looks extremely clear. I feel like this would be an enjoyable experience for those who read. I haven't read a book in a while, so I don't know. Or for university students who feel like they need to mark-up books to take notes, or mark-up important facts or pieces of text, this could actually work really well. Okay, so to change pages you can also use your finger, you don't have to use the stylus. And, for people who enjoy type faces, you can also change the text. - [David] Nerd. - [Jono] Font nerd. (laughing) - Whoa, there are 36 pages of fonts which for a font nerd like me is pretty awesome. - [David] Sarah, what's your favorite font? - [Jono] Gotta be Comic Sans. (grunting) - No, not Comic-- - [David] Papyrus. - Yeah, Papyrus, no, no, no. I use Montserrat a lot, that's a good font. Google font, you can download it yourself. So I guess with the notepad, this is also the drawing pad, can I call it drawing pad instead? I guess this tablet isn't necessarily directed or marketed towards people who illustrate just because it's not really a realistic circumstance to use this to illustrate things for say, ABC books. With that being said, let's check out what kind of illustration options it does offer. So for colors, since this tablet doesn't have any RGB colors but only offers grayscale, it does give you quite a few options to choose from. You have black, dark gray, medium gray, and light gray so you can kind of differentiate between tones. So we also have text boxes. Typing with the stylus is kind of uncomfortable but it's uncomfortable with the iPad too, so I'll give them that. Oh, maybe with the lasso tool, let's see. It won't move. Oh okay, there we go. Oh, it's just so, this is not fun. Oh no, it doesn't shrink the text box, it shrinks the text box and the text. I hate when that happens in illustrators so this is not, not good, whatever. Well, I'll give them the benefit of the doubt, this is called notepad and not drawing pad so it's probably more for notes and less for drawing. I'll draw quick little, little dinosaur here. Yay, let's give him some spiky hair here and come down to, okay, oh wow. He's a very old wise dinosaur. It's a Linusaur, oh my gosh. (chuckling) He kind of looks like Dumbledore, Dumblesaur. Okay, wait, we're going-- (laughing) Oh, we can also adjust the thickness of the pen I believe, okay actually, it has approximately or it actually has 20 different line widths which is nice and you can also change the brush pen. So the stylus seems to adapt to pressure and angle which is kind of cool. I say this every time, but let us know if you want this cool shirt. It doesn't pick up my hand touching the screen when I'm drawing which does happen sometimes when I am using the iPad and it can be quite annoying, so this is nice. Oh, it saved the file for us, look at that cute little mini version of it. (laughing) Speaking of storage, we have 32 gigabytes to fill up with music, books and documents, as well as we can download applications because this is compatible with Android 10. So speaking of apps, let's check out what we can download. Oh, let's see what music. We can add folder to playlist. Nothing is happening, is it just because I'm not waiting, or? It says fetching songs and then there's no songs that are being fetched. - [Jono] Oh my God, are you actually on YouTube? - Yeah, in black and white. (Jono laughing) This is vintage YouTube. Oh, the frame rate is just so bad. It feels like I'm watching a vintage film. There's no volume option, unless I'm just dumb. Here's the perfect time to introduce this, This product has a gravity thing or it's supposed to have a gravity thing, but it's not. (rattling) This is really intimidating with Linus' face staring at me while I'm trying to figure this out. Bluetooth, wait, volume. Okay, I added volume. I don't know how I got to this page, but it's a miracle. Oh, auto rotate, there we go. I turned it on now. (cheering) We figured it out. It's perfect. Okay, that zoom wasn't too smooth. - [Jono] Oh. (laughing) Yeah, it's literally like hard. - It literally looks lie you're trying to touch Linus' face. (laughing) - And... There you go. - [David] (indistinct) - Yeah. I'm really good at creating art. Vintage crab rave. (laughing) (Crab Rave playing on Note Air) - [Jono] Whoa, that's pretty decent. - Dare I say, the speaker is the best part of the tablet. That was worth it, that made the whole thing worth it. So the speakers seem to be great, and another awesome part about this product is that you can change the brightness and that means you can use it anywhere. Is this product an affordable alternative to the iPad? Absolutely not. Did I find it easy to use? No. - [Jono] It has good speakers though. - Yeah, it does, you can listen to Crab Rave all day. I guess the battery life is great in comparison to the alternatives, but for now I don't think I would recommend this product. That's all. (laughing) Cool, well, thank you for watching my first time on Short Circuit. I really hope you enjoyed and catch you next time, I don't know. (laughing) I just noticed this. It says like a tablet, unlike any tablet. And that's right, you can play Crab Rave in black and white.",
    "transcript_keywords": [
        "tablet",
        "books",
        "Ink drawing tablet",
        "Yeah",
        "stylus",
        "drawing",
        "feels",
        "text",
        "book",
        "Ink tablet",
        "pretty",
        "Jono",
        "guess",
        "iPad",
        "nice",
        "cool",
        "kind",
        "product",
        "Ink",
        "Ink drawing"
    ],
    "transcript_entity_values": [
        "Crab Rave",
        "iPad",
        "David] Papyrus",
        "the Wi-Fi",
        "Hertz",
        "all day",
        "Riley",
        "Crab Rave",
        "20",
        "Google",
        "Linusaur",
        "5.8 millimeter",
        "Apple",
        "Papyrus",
        "2.4 gigahertz",
        "YouTube",
        "David] Gon",
        "10.3 inch",
        "David",
        "32 gigabytes",
        "Jono",
        "David] Sarah",
        "Montserrat",
        "1404",
        "first",
        "YOLO",
        "iPad Pro",
        "David] Nerd",
        "Short Circuit",
        "USB-C",
        "hertz",
        "36",
        "RGB",
        "Dumbledore",
        "Linus",
        "2",
        "ABC",
        "1872",
        "227",
        "today",
        "Wi-Fi"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "FAC",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "LOC",
        "DATE",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG"
    ]
}