{
    "id": "UUq3TOweAjA",
    "title": "The BEST Tech Gifts Under $500!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-12-17T19:18:04Z",
    "video_url": "https://www.youtube.com/watch?v=UUq3TOweAjA",
    "category": "Science & Technology",
    "tags": [
        "Tech Under",
        "Tech Gifts",
        "Gift Guide",
        "Oculus Rift",
        "Gaming",
        "Gaming PC",
        "Nintendo Switch",
        "Panasonic FZ80",
        "Tech Under 500",
        "Tech Under $500",
        "Holiday Gift Guide 2017",
        "tech under 50",
        "best tech",
        "2017",
        "top tech",
        "cool tech",
        "gadgets under",
        "best tech under 50",
        "apple",
        "tech under 25",
        "tech under 100",
        "tech",
        "cool tech deals",
        "gadgets under $50",
        "best tech gifts",
        "futuristic",
        "review",
        "jonathan morrison",
        "best",
        "android",
        "gadget"
    ],
    "views": 422997,
    "likes": 7370,
    "comments_count": 424,
    "description": "Check out the special Oculus Rift discount!  3 of the Best/Top Tech Gadgets & Gifts Under $500. Enjoy!  The BEST Tech Under $50 - Holiday Gift Guide!   Oculus Rift:  Nintendo Switch:  Custom Nintendo Switch LED Dock Setup!  Nintendo Switch Pro Controller:  Panasonic FZ80 4K Camera:   Background music via Epidemic Sound:   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "http://bit.ly/2mPapn3",
        "https://youtu.be/6XXX8ejQfXg",
        "http://bit.ly/2mPapn3",
        "http://amzn.to/2zjpami",
        "https://youtu.be/_VHmZu1rDB8",
        "http://amzn.to/2AYSBMG",
        "http://amzn.to/2B2i9bW",
        "https://goo.gl/rMbhQL",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Today's video is sponsored by Oculus Rift. Yo, guys. Jonathan here. The holidays are here, and today we are looking at three awesome tech gifts, all under 500 bucks, and kicking off that list is the Oculus Rift. So if you've been looking to jump into the VR world like my boy Ralphy, it is more affordable than ever, and speaking of that, the Oculus Rift is currently on sale for 379. Not sure how long that's gonna last, but if you're interested in scooping one up, I will drop a link down below. Now, inside the box, there is so much stuff packed inside, everything you could possibly need apart from the PC itself, from an X-Box controller to an Oculus remote, down to the double freaking A batteries. Now what's cool with this is you can either play sitting down or standing up. Myself, I prefer the freedom of standing, but the choice is totally up to you. Now the Oculus headset itself is kind of badass. You have a 2160 by 1200 resolution, so that crazy VR view you're scene is super sharp, super crisp. And you have a built-in headset, which kind of puts the cherry on top of that super immersive experience. What I love about this is the flexibility. So if you're worried about your room size, or if you have enough space, you can take those censors and move them so they can perfectly complement your set up. (chuckles) Ralphy just tore that guy apart for those curious. As you could see, those gaming controllers are not only a ton of fun. They are really responsive and kind of just take that gaming experience to the next level. You will, of course, need a Oculus... You will, of course, need an Oculus compatible PC, which I'm sure my buddy Austin Evans has built about 500 of those. So I'll drop a couple links of those down below. And again, remember: this is currently on sale for 379, so if you wanna scoop one up, make sure you jump on it fast. So, next up, keeping that gaming theme going, the Nintendo Switch is hands down one of the hottest pieces of tech of 2017 and would make an amazing gift. Now, what I love about the Switch is the flexibility of being able to play either handheld or docking it to a TV. Honestly, most of the time, you're gonna find yourself playing handheld. But having that option is a beautiful thing. Now, back when the Switch initially came out, a potential reason not to buy one was a lack of games. But now that time has passed, that is completely not the case. You, of course, have game of the year, Legend of Zelda: Breath of the Wild, Mario Kart 8 Deluxe, Splatoon 2, and of course, Super Mario: Odyssey, which is amazing. So what's kind of a little awesome bonus is those Joy-Cons will also double as a second controller, just in case you want to play with a friend. Speaking of Joy-Cons, they actually work really well and make for a surprisingly awesome kick-back gaming experience. But if you need something a little more traditional, or a little more serious, you can also scoop up a Pro Controller, and I'll link some of the best down below. Now a couple months ago, these were nearly impossible to find. They were sold out everywhere. But since then stock has slowly improved. I think Amazon should have them, but if you wanna find one locally, I've had luck at Best Buy and also Target. Now last up, this camera almost doesn't seem real for the price. The Panasonic FZ80 is currently on sale for 350 bucks and will shoot 4K video up to 30 frames per second. So with this, you have an 18.1 megapixel censor, and a ridiculous 20 to 12 hundred milimeter zoom. Now granted, yes, that is optical zoom, but the fact that you have that at your disposal for that price is crazy. So if you wanted to pick up a camera to shoot 4K videos, whether it's for YouTube, or just to shoot for fun, this is a fantastic starting point. Really, the way you gotta look at this camera is kind of the all-in-one everything camera, which is a great starting point, but the one potential downside is you're not gonna be able to upgrade the lens later. But really, for that price point, it shouldn't really be an issue. The touch interface is great. You have built-in WIFI, and it's gonna be a pretty solid stills camera. And again, yeah, smart phones, they do a great job with photos and video these days, but the idea here is that it's gonna get you into that photo and video world. It will get you familiar with the controls, the interface, and more importantly, put you in that different frame of mind when you're shooting video. Aside from that, thank you guys very much for watching. Hopefully you enjoyed the video. If you did, and you are feeling awesome, make sure you go hi-zen tosh on that 'like' button. Again, everything featured in this video is linked down below. This is Jonathan and I will catch you guys later.",
    "transcript_keywords": [
        "Oculus Rift",
        "Oculus",
        "video",
        "Rift",
        "kind",
        "super",
        "camera",
        "Oculus headset",
        "Switch",
        "gaming",
        "make",
        "awesome",
        "Oculus remote",
        "controller",
        "Oculus compatible",
        "sponsored by Oculus",
        "sale",
        "gaming experience",
        "guys",
        "experience"
    ],
    "transcript_entity_values": [
        "Target",
        "2017",
        "18.1 megapixel",
        "2160",
        "the Nintendo Switch",
        "these days",
        "Super Mario: Odyssey",
        "379",
        "Oculus",
        "Joy-Cons",
        "4",
        "the year",
        "The Panasonic FZ80",
        "Pro Controller",
        "30",
        "YouTube",
        "Legend of Zelda: Breath of the Wild, Mario Kart 8 Deluxe",
        "the Oculus Rift",
        "the Oculus Rift",
        "Ralphy",
        "second",
        "about 500",
        "three",
        "Splatoon 2",
        "Best Buy",
        "one",
        "500 bucks",
        "Austin Evans",
        "350 bucks",
        "Switch",
        "Amazon",
        "1200",
        "today",
        "a couple months ago",
        "Oculus Rift",
        "20 to 12 hundred",
        "Yo",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "WORK_OF_ART",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON"
    ]
}