{
    "id": "uutpyRhKNko",
    "title": "This is Elon Musk’s key to Tesla’s future",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-11-30T15:00:43Z",
    "video_url": "https://www.youtube.com/watch?v=uutpyRhKNko",
    "category": "Science & Technology",
    "tags": [
        "tesla",
        "elon musk",
        "tesla gigafactory",
        "tesla model 3",
        "gigafactory",
        "tesla battery",
        "factory",
        "tesla factory",
        "tesla solar panel",
        "tesla elon musk",
        "tesla production",
        "elon musk tesla",
        "test drive",
        "model 3",
        "electric vehicle",
        "factory tour",
        "electric vehicles",
        "elon musk interview",
        "model x",
        "tesla model x",
        "tesla motors",
        "whats inside",
        "now you know",
        "hands on",
        "driving",
        "spacex",
        "elon musk twitter",
        "tech industry",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "apple",
        "google",
        "iphone",
        "review",
        "verge",
        "the verge"
    ],
    "views": 3748589,
    "likes": 58126,
    "comments_count": 2707,
    "description": "Elon Musk's Gigafactory is arguably the most important thing that Tesla makes. The 1.9 million-square-foot factory in Sparks, Nevada, is only 30 percent complete, but its already on track to make 60 percent of the worlds lithium ion batteries  and Tesla plans to build more Gigafactories around the world. The Verge took a look inside.  Host: Sean O'kane Producer: Phil Esposito Director/Editor: Christian Mazza Drone/Camera: Becca Farsace Audio Engineering: Andrew Marino Design Director: William Joel Executive Producer: Eleanor Donovan Editorial Advisor: Elizabeth Lopatto Director of Audience Development: Ruben Salvadori Social Media Manager: Dilpreet Kainth  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Listen to our podcasts:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- For the last year or so, the story of Tesla has been all about the Model 3 and understandably so. Elon Musk basically staked the entire viability of his company on being able to make as many of these cars as possible, and there were times where that bet looked pretty risky. - Temporarily shutting down production. - Way behind on the production. - Production problems. - See which production issues to sort out. - Welcome to production hell. - But now Tesla is, more or less, beyond a lot of those challenges. So we came out to the desert to see the most important thing that Tesla makes, what Elon Musk calls. - Giant machine that builds a machine. - This is Tesla's Gigafactory. (upbeat funk piano music) It's ideal for him. It makes everything that Tesla sells: batteries, home storage, solar panels, and of course electric cars. That size is truly massive too. When it's finished, the first Gigafactory will be the biggest building in the world by footprint, and the second biggest by volume. It's large enough to house 107 NFL football fields or 93 Boeing 747s, and currently makes about 3.5 million battery cells per day. - [Chris] As you can see, never a dull moment here, always a flurry of activity. - [Sean] That's Chris Lister, the vice president of the Gigafactory. - We designed this Factory with first principles in mind, making as few of moves as possible, positioning lines as close to the loading docks as possible, using automation to our advantage, using gravity to our advantage. We built this with the end in mind of being a net-zero facility. We'll have over 200,000 solar panels on the roof when this is all completed. It'd be the largest array of solar panels anywhere. If you look at the parking lot, that will all eventually be production space for something, whether that's growth of Model 3, whether that's future products, whether that's more cell production, whether that's energy products. There's a ton of different options that we have but we have the land to do it, and we have the products to support that. - Tesla has clear goals for a complete Gigafactory but it's still very much under construction. And while the company has said it wants to finish the factory in the early 2020s, it's easy to see that there's a lot more work to do. You see, while Gigafactory 1 is all about the Model 3, Tesla doesn't actually build that car here. The building is essentially split into two parts, part of the Gigafactory is leased to Panasonic, who, if you didn't know, makes the cells that Tesla uses in its battery packs. The rest of the Gigafactory is used to build the drive unit for the Model 3. That's the battery pack, the electric motor, and a few other things, like the inverter. That all gets packaged up and shipped to California where the cars are actually built. (upbeat funk music) Tesla still leans really heavily on this factory here in Fremont California to make the Model X, S, and assemble the 3. In fact, every Tesla that's on the road today comes out of this factory. If Tesla ever wants to reach that ultimate goal of full vertical integration, it basically needs to move everything that happens here into the Gigafactory. And, frankly, there are a lot of elements of that idea of vertical integration already happening here. Tesla does everything from cut metal from rolls of aluminum to stamp out pieces for the cars to making the seats, basically everything that goes into making a car, other than some parts of the battery, happen inside these walls. - [Jat] These are the batteries coming from Gigafactory. - Oh, yeah. - Right? They come in on a rack that is designed for automation, and it gets placed onto this and gets transferred over through the FlexDecks. - [Sean] That's Jat Dhillon, who's the head of manufacturing for the Model 3. - So automation, we're looking for everything. We obviously want to improve efficiencies across the board. We take, in fact, ergonomics as well. Any of the areas where you have a lot of complexity around getting to certain fasteners, we want to be able to automate those cells because that does create ergo challenges for the production staff. For Model 3, we chose to go highly automated but when you go with advanced automation like this, it can be really good benefit if it works out but there are times when you can overdo it and have too much automation. (upbeat music) - [Sean] Tesla didn't have the right balance when it first started making the Model 3, and that turned into one of the biggest challenges the company faced when it was building that car. In theory, building the Gigafactory from the ground up was supposed to give Tesla the freedom to draw the perfect factory from scratch but the delays in Model 3 production show that even Tesla doesn't get everything right in the first draft. that's potentially concerning considering the company needs to make many more Gigafactories if it wants to fulfill its mission: accelerating the world's transition to sustainable energy. - We can declare victory when every single car on the road is a Tesla, and we can declare victory when every home has Powerwalls and a solar roof that we've made. We'll continue to build out. We'll continue to expand into other markets, whether that be Asia, whether that be Europe, whether that be just different parts of the world that we've not been able to touch up to this point. - Tesla's going to need way more Gigafactories, and it's already working on that. Gigafactory 2 is in Buffalo, New York, and is completely dedicated to the company's solar products. The real expansion starts in China. Musk and Tesla recently signed a lease to build a third Gigafactory outside of Shanghai. China is the world's biggest market for electric cars on pace to sell around one million of them in 2018 alone. And while Tesla already has some success in China selling its cars there, building them and selling them locally will help them work around problems, like soaring tariffs as a result of the ongoing trade war. The same ideas apply to Europe where Tesla's fourth Gigafactory is likely to wind up. And beyond, Musk has said he wants a dozen or more Gigafactories around the world. These are all very high ambitions but Tesla still has a long way to go and there are definite growing pains as the company scales towards Musk's grand vision. (upbeat guitar music) The Gigafactory is many things: It's impressive. It's kind of awe-inspiring. It's definitely enormous. But there's only a couple things happening there. Tesla's only making a few of its products in that gigantic building. That said, maybe that doesn't matter right now, Tesla has bought itself some breathing room by getting Model 3 production onto relatively solid ground, but there are many other products in the Tesla pipeline, like the Model Y SUV, the Tesla Pickup, the semi truck, and the second-generation Roadster, so the idea of the Gigafactory is crucial to the company in a much bigger way than any of those individual products. (upbeat funk pop music) Thanks for watching. We spent a couple days in the Gigafactory, so if you have any questions about what we saw there or what's going on with Tesla, ask in the comments below and we'll try to get to your question. And if you haven't, be sure to like and subscribe.",
    "transcript_keywords": [
        "Tesla",
        "Gigafactory",
        "Model",
        "production",
        "Tesla Gigafactory",
        "Tesla fourth Gigafactory",
        "company",
        "cars",
        "products",
        "Musk",
        "Tesla makes",
        "Elon Musk",
        "building",
        "Factory",
        "Tesla Pickup",
        "solar",
        "lot",
        "car",
        "makes",
        "making"
    ],
    "transcript_entity_values": [
        "Gigafactory 1",
        "the Model 3",
        "New York",
        "Chris",
        "Gigafactories",
        "Jat Dhillon",
        "Musk",
        "the early 2020s",
        "93",
        "Model 3",
        "today",
        "Tesla",
        "Panasonic",
        "107",
        "2",
        "California",
        "Europe",
        "around one million",
        "fourth Gigafactory",
        "Model Y SUV",
        "Powerwalls",
        "Shanghai",
        "Model 3",
        "Boeing",
        "3",
        "Buffalo",
        "Musk",
        "Gigafactory",
        "Fremont",
        "two",
        "a couple days",
        "about 3.5 million",
        "Elon Musk",
        "200,000",
        "747s",
        "NFL",
        "Sean",
        "the Gigafactory",
        "the last year or so",
        "China",
        "second",
        "2018",
        "Chris Lister",
        "Asia",
        "first",
        "a dozen",
        "FlexDecks",
        "a ton",
        "Gigafactories"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "GPE",
        "PERSON",
        "NORP",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "LOC",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "GPE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "ORG",
        "GPE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "GPE",
        "ORDINAL",
        "DATE",
        "PERSON",
        "LOC",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON"
    ]
}