{
    "id": "Uw6OsPUbR7I",
    "title": "The WEIRDEST Products at Costco",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-08-03T18:20:52Z",
    "video_url": "https://www.youtube.com/watch?v=Uw6OsPUbR7I",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 220211,
    "likes": 6540,
    "comments_count": 193,
    "description": "Seriously, who is going to Costco to buy these?! Tech We Wish Would Come Back:  The WEIRDEST Custom Keyboards:  Ranking the WORST Controllers of All Time:  Do(n't) Buy the Pixel 6a:  The WEIRDEST Products on GameStop:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Hello and Welcome 0:20 TruGolf Golfing Simulator 1:11 BigHorn Executive Vault 2:30 Rooftop Car Tent 3:51 Italian Monstrosity Pizza Oven 5:16 72 Pound Cheese Wheel 6:01 a KILO of that good stuff.. (feat. dinosaurs) 7:17 Ham on it (with this stand) 8:18 Wine, Fancy 9:02 That Chair from WALL-E 9:59 Seven Person Spa 10:27 Six-Person Sauna (Kick one out from the spa) 11:14 Laser Hair Growth Helmet 12:05 15-Foot LED Tree 12:46 What do you think?",
    "description_links": [
        "https://youtu.be/zIj2tK2lJOI",
        "https://youtu.be/hzX6AOx0Pk8",
        "https://youtu.be/xJBcNbS-uTM",
        "https://youtu.be/ispKYlu6Xq0",
        "https://youtu.be/m5CzFyt_fMA",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- Are you familiar with the phrase butts to nuts? - Hello and welcome to this is we've already looked at some of the weird products that Costco sells, but even we have our limits on what we are willing to spend. We went through Costco's website and looked at the dumbest products they sell. Everything we're looking at is at least $7. Let's see the first one. Okay. The true golf is the 10 series. Is wii sports, golf simply not realistic enough experience for you. Are we supposed to guess how much? - Yeah. Do know actually how much - But I, I know how much this one cost. - It was like, 13 grand? - Yeah, It's like 13 to 14 grand 1399 which you can get my vehicle a 2019 Nissan Sentra. Look, are you trying to sell my car? - I am certainly not going to judge anyone who wants to put down some big dollar bills. - I'm gonna judge you. - On a similar no, no. You know, golf is a real sport. Allegedly. I am here to approve grandpa of buying your new golf simulator in your retirement home. That apparently is gonna be 20 feet long and 13 feet wide. - Moving on to the next one. The big horn iron work 63 cubic foot executive vault, 85 minute fire rating. You can light this bad boy on fire for 85 minutes. - That's actually a long time though, for a safe not that I am a safe aficianado or anything but I am a, a house burning aficionado. Sadly. The problem though is if you look at this this looks cheapie to me. It doesn't look real, it looks like, like fake aluminum on the outside. - It looks like a movie prop from an old Western. So this thing weighs roughly the same weight as a 2019 Nissan Sentra at 12, 1250 pounds. Who's going to Costco. - Yeah. - And just put in their little cart - Yeah. - like, oh, I got my I got my guacamole. I got my, my, my chicken bake and I got my - Golf simulator. - My 1200 pound save. I'm gonna go with $1,250. - No, no - I'm gonna, I'm gonna say one pound, - No way. - one pound per buck. - I'm gonna say it's $3,000. - 66 99. - What? Well you could get at 2007 Chevy Tahoe for 67 57 apparently. You know what, though if you're a big horn executive, Matt you don't care about 6,000. - I'm clearly a little horn. - You spend $6,000 to wipe your butt at the country club. So clearly to keep your executive gun - I'm paying $6,000, someone else better be wiping my butt at the country club, the car tent. Okay. So I've stayed in one of these. - What's the weight limit on a car tent, because I'd be a little afraid of - It's enough for me. So - Basically you could put this on most cars. I assume it replaces like the roof rack or it mounts to the roof rack - It mounts to the roof rack. - And I feel like we're not pitching this thing property. - Okay. So I'm gonna give you, I'm gonna give you the sales pitch. Why do we need a Subaru car tent? - Do you wanna go camping, but like - No - not on the ground where all those bugs are. Sometimes there's bears and other animals but you know what there's not? - You know bears don't know how to climb up cars. - They don't, they don't know how to climb up cars. But also with the car tent, you get the added bonus of pretending like you're in that tree Fort. If you want that memory back, the car tent is for you. I guarantee you right now that anyone who's ever bought this owns a Subaru - Or a 4runner in Washington, the home of the cost company it's based in Seattle, I think, or the Seattle area. I I'm relatively confident. - Make sure you subscribe to this is because we always tell you where the origins of company names go - Like gold star - Lucky gold star. I'm gonna go 42 78 - 4,000. - Yeah. - $1,200. - It's 2199. - I'll take the point for that. Aaron. Can I have a point? I'm not, I'm not demanding it like Matt always says can you please gimme a little point graphic? I appreciate it. - I am demanding a point moving on to the next one. Next up we have the Forno Venetzia. - Wait wait wait wait no no no - I'm Italian I can't pronounce that. - No, you gotta do that one again. The what? - The, the FORO Pronto outdoor wood burning pizza oven. When the moon hits your eye, like a big pizza pie. - Oh good lord - It's this oven. - But hang on no, no, no. We're not even talking about this oven yet. The FORO Venicia sounds like a fake bunch of Italian words that some marketing agency came up with. - I'm gonna guess this monstrosity is - Expensive cause it's huge. - $1,250. - No, no, no - One buck per pound. - No, no, no, no, no. This is gonna be $3,000. - Austin is pretty spot on it's 27 99. - Do you not go to the cost company? - Can I, can I, can I let you in on a secret? - Oh no. - I've never - What? - Ever - What? - been - Don't finish that sentence Matt - To a Costco. I've had Costco pizza, but someone has already has always - They brought it home to you. You didn't go and actually experience it live. - Correct - I get the concept of it, but like I've never been to a Costco. - Here's the thing. Imagine sitting in line for 30 to 80 minutes to save $5 on your gas. Once you go inside, are you familiar with the phrase butts to nuts, your butts, to nuts with your fellow Costco shoppers, your banging carts. Someone's always in the middle of the aisle. Confusedly trying to figure out if they need to go left or right. And blocking about 11 people from walking through. And while you're in line they're gonna ask you if you want a credit card, a - 72 pound Parmigiano Reggiano cheese - Wheel cheese - Shipped in from the same pallets as the pizza oven. This is imported from Italy, it's extravagant and rose - Twenty four months old - Gave it five stars and said very tasted. - How long Matt would it take you to eat 72 pounds of Parmesano Reggiano? - It. It really depends. - Okay. - How sad am I? I think I can knock that out in an afternoon. I'm gonna say this is 4 99, - 4 99 oh. That's all my that's a lot of money, that's a lot of chedda - $499. - I'm gonna just say 600. I, I don't know. - You're both way low balling. It is is $949. - Oh wow. Moving on to the next one. We have Plaza Osetra Caviar, one Kilo. It includes thermal caviar tote and two custom large mother of pearl spoons. - Did you know the sturgeons is one of the closest relatives to dinosaurs. - You know so are pill bugs. - Thats fair - Matt did you just agree with no pill bugs haven't evolved since like before dinosaurs dinosaurs didn't turn into the little tiny pill bugs - They have big ones. - Yo, imagine a dinosaur size pill bug. Aaron, please have Photoshop. I will say, I think I tried caviar once and it was salty and nasty and I didn't like it. Maybe I'm just not fancy enough. - No, I'm thinking this is gonna be like $10,000. - Yeah because a normal size like one ounce of caviar I wanna say was like 90 bucks or something. - Yeah. Like - I don't think it's that much but I think it's gonna be a lot. I'm gonna say it's - But this includes a, a mother of Pearl spoon. - $2200 is my guess - What? - 2,200. - No, I'm I'm I'm sticking with my 10 - Austin spot on it's 2000. - Matt has never visited the cost company. - Yeah. - He doesn't know what he's talking about. That's what he should subscribe to Austin Evans. I'm actually gonna now just hijack every this is video. Matt's not wrong on the Austin Evans channel. So if you want some high quality entertainment subscribe to Denki - What? The, the Jamon Iberico - The Jamon Iberico Bellota ham leg with stand and knife. - Each pig freely roams on a minimum of two and a half acres each. - This is like the Costco gift you give to someone who you don't really like, but you want their inheritance one day. - This looks like a prop that you'd put in a butcher shop or a restaurant. - Can I take a guess? - Yeah - I'm gonna say it is $218. - I wanna say $85. - What? Matt, you are a God damn lunatic - 90 bucks - $90. I think you're too low. - You know how Matt you know how you were suggested to double it? It is four 20 baby - Four 20. - You have to be high to order to get this thing. - My fancy is Supreme Doritos Locos tacos - I would say my fancy is that I I've recently made the switch from craft Mac and cheese to Velveeta. I got, yeah guys, I make that. I make that shells and cheese money now. - Oh no, not wine - Sloan Estate Bordeaux blend 2017. This uninhibitedly rich and extraordinary pure wine is beautiful, raw expression of our terrier. - Terrier Can I actually propose a revolutionary idea for this one? Should we consensus vote on this? Because I don't think either of us have any idea, it's gotta be expensive. And honestly it's probably they charge per fancy word. - I'm gonna say $9,600. - Whoa. Okay. I'm not gonna agree with you at all on that. Are you locking that in? - No. I'm gonna say 3 25. - I'm gonna say $700. - It is 579. - Oh that's actually pretty close in between us. Yeah. Our consensus could have worked if we would've just met in the middle. The Kyota Nokori M980 Syner-D massage chair This is a full length neck to glutes massage. It has feet rollers and reflexology, a touchscreen tablet remote and voice command. True fit body scanning and foot rest extension. Because don't you want this chair to scan your body? - Help me out because you didn't go to college. Didn't you say if you had gone to college, you would've studied reflexology. The - You talking about - Sharper image does sell one of these. That's why I think I got this one on. - Okay. Go for it. - Go for it. - $4,500. - I'm gonna say $9,000. - It is $8,000. - What are you guys doing? - They sell $12,000 massage chairs the bigger and the more like pisony air bags. - You can get that one chair That's got the monitors that come down - No no you're not gonna be just like - What if you combine the two - Ew don't do that. You're supposed to relax. You're not supposed to play Fortnite on your massage chair. - Evolution spas, seven person spa. This thing weighs 800 pounds empty. - How much is a hot tub though? - I'm saying I'm gonna say 9,000 for that - Nine thousand Oh, this seems a little high to me. I think you can probably get a hot tub for like three grand. - Matt. You are spot on. It is literally 9,000 - Matt. If you properly take care of your hot tub, i'll come hang out. If you're one person hot tub - That would be a one and a half person. you're still gonna come visit me? - How big is the half? Cause I, I might - I got a lap. - Ooh. The Dynamic La Sagrada six person ultra low EMF FAR infrared indoor sauna. Okay. - So one of the people that you hung out with probably your stinky cousin is not gonna be allowed to be in the sauna. - My question is why is it ultra low EMF, FAR infrared? That just seems like some wibbly wobbly like sweating. I get EMF and ultraviolet therapy. - It's vibrating the stress away. - You're vibrating my stress away. We gotta make a guess. How much is the dynamic Lagrata six person sauna - 12,000. - Woo. I'm gonna say this is $6,000. - It is 5,000. - What? - I'm just realizing Costco makes me feel poor. - Yeah. If you have a receding hairline like someone sitting next to me, I restore professional. The 2 82 laser hair growth bundle. Are you one of our frequent commenters? You're probably molding it's hands free, lightweight. and there's 282 medical grade lasers and LEDs to stimulate hair follicles. So your head's gonna be gorgeous. Expect to see visual results and a fuller hair in roughly three to six months which is roughly three months past return. - The return policy. My gut is that this is absolute nonsense. - I think it's snake oil - But I will give this a very generous benefit of the doubt that it actually does something. But I don't think this could be that expensive. - I'm gonna say this gonna be $282. Okay. That's pretty cool. One, $1 for every for every LED for the buck - 969 - Jesus Christ. You could buy, just buy a wig at that point. - 15 foot pre lit radiant micro LED artificial Christmas tree. Do you consider yourself to be a festive individual? - Yeah - The fact that 15 foot definitely puts it in a category of only rich who shop at costco are gonna buy it. On top of that, the fact that it has 6,000 LEDs and they are micro LEDs. I've seen some trees that come pre lit but this is a whole other level. I'm gonna say, Matt this is gonna be a $1,800 Christmas tree. And I think I might be undershooting that - I'm gonna say, because this is 278 pounds, which is I'm gonna say this is 1200 bucks. - Austin was like dead on it is 1799 - Like what - What if we go to BJ's Matt? Would that make you feel better? - Can I get to Pizookie? - Thank you very much for watching this episode of this is. Make sure to subscribe and Ringling that dingling bell to be always kept up to date with Matt's latest Costco shenanigans. And until next time, good - Get good. I don't have my inhaler. Where's my inhaler.",
    "transcript_keywords": [
        "Matt",
        "Costco",
        "Yeah",
        "car tent",
        "car",
        "Matt latest Costco",
        "golf",
        "big",
        "Make",
        "Austin",
        "pound",
        "Nissan Sentra",
        "tent",
        "pounds",
        "point",
        "thing",
        "give",
        "sell",
        "guess",
        "person"
    ],
    "transcript_entity_values": [
        "The Kyota Nokori M980 Syner",
        "6,000",
        "499",
        "Aaron",
        "1250 pounds",
        "27 99",
        "three",
        "10,000",
        "15 foot",
        "roughly three to six months",
        "2",
        "579",
        "9,000",
        "66 99",
        "85 minute",
        "278 pounds",
        "Italian",
        "9,600",
        "One",
        "1",
        "Bordeaux",
        "12,000",
        "Denki",
        "3 25",
        "Jamon Iberico - The",
        "4 99",
        "5,000",
        "Parmigiano Reggiano",
        "4,500",
        "2200",
        "1,800",
        "one ounce",
        "2000",
        "2017",
        "Lagrata",
        "Matt",
        "67 57",
        "282",
        "13 feet",
        "Austin",
        "2,200",
        "20 feet",
        "12",
        "700",
        "costco",
        "Fortnite",
        "4runner",
        "first",
        "1200 bucks",
        "1,250",
        "10",
        "Sentra",
        "90 bucks",
        "1200 pound",
        "Ringling",
        "5",
        "9,000",
        "Italy",
        "85 minutes",
        "85",
        "Washington",
        "one pound",
        "Austin Evans",
        "6,000",
        "Christmas",
        "Pearl",
        "about 11",
        "Fort",
        "13",
        "Tahoe",
        "Velveeta",
        "2199",
        "2019",
        "218",
        "63 cubic foot",
        "roughly three months past",
        "five",
        "Costco",
        "Plaza Osetra Caviar",
        "Twenty four months old - Gave",
        "about 6,000",
        "chedda - $",
        "Austin Evans",
        "one",
        "Subaru",
        "949",
        "1799",
        "72 pounds",
        "30 to 80 minutes",
        "six",
        "Austin",
        "800 pounds",
        "at least $7",
        "1,200",
        "3,000",
        "half",
        "Nissan",
        "42 78 - 4,000",
        "two",
        "8,000",
        "Pizookie",
        "282",
        "one Kilo",
        "Seattle",
        "four 20",
        "BJ",
        "Parmesano Reggiano",
        "90 bucks - $90",
        "2007",
        "600",
        "Mac",
        "Supreme Doritos Locos",
        "seven",
        "two and a half acres"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "MONEY",
        "PERSON",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "TIME",
        "QUANTITY",
        "NORP",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "GPE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "DATE",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "ORG",
        "MONEY",
        "MONEY",
        "GPE",
        "TIME",
        "MONEY",
        "GPE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "LOC",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "MONEY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY"
    ]
}