{
    "id": "UXB9bnuyZb4",
    "title": "The Most Tech I've Ever Seen in a Car!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-05-19T17:59:11Z",
    "video_url": "https://www.youtube.com/watch?v=UXB9bnuyZb4",
    "category": "Science & Technology",
    "tags": [],
    "views": 14637893,
    "likes": 679313,
    "comments_count": 7190,
    "description": "The BMW i7 is sick. Also subscribe to @forrestsautoreviewsofficial!",
    "description_links": [
        "https://www.youtube.com/@forrestsautoreviewsofficial"
    ],
    "transcript": "What's up guys? my name is not forest but this ugly car behind me is the most tech i have ever seen in a car. So this is bmws full-size fully electric i7. It is longer than a cadillac escalade so it's got a lot of room for tech inside despite looking kind of like a squinting pig. So inside there are screens powered by wireless, android, auto, and carplay. There's sensors up here so you can do this to change the volume. There's also a wireless charger here. Their speakers everywhere including in the doors there's a headrest one and there's woofers in the seat so you can feel the bass. But also the driving sounds are composed by hans zimmer. But what you really want to be is definitely this backseat. So of course, you've got a wireless charger here in front of some hidden cup holders. There's a hidden usb c port, but there are screens in each of the doors where i can change modes. And if i hit theater mode, it puts up all the shades, including the back in the roof and drops down a 30-inch, 8k touch screen so i can watch videos and strategically place microphones all around the car. Hey, bmw, open my shade. It just opens mine and none of the others also subscribe to forest he does. He's way better than me!",
    "transcript_keywords": [
        "wireless charger",
        "wireless",
        "guys",
        "car",
        "tech",
        "tech inside",
        "inside",
        "fullsize fully electric",
        "screens",
        "charger",
        "ugly car",
        "forest",
        "doors",
        "including",
        "change",
        "hidden",
        "bmws fullsize fully",
        "fully electric",
        "fullsize fully",
        "bmws fullsize"
    ],
    "transcript_entity_values": [
        "bmws",
        "30-inch",
        "hans zimmer",
        "bmw",
        "cadillac"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG"
    ]
}