{
    "id": "UXyS-xofGNM",
    "title": "Kali Linux Windows 11 App with GUI and sound // Updated simple steps for 2022",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2022-02-20T15:34:12Z",
    "video_url": "https://www.youtube.com/watch?v=UXyS-xofGNM",
    "category": "Science & Technology",
    "tags": [
        "wsl 2",
        "wsl2",
        "kali linux",
        "kali linux install",
        "windows subsystem for linux",
        "how to install wsl 2",
        "setup wsl 2",
        "wsl 2 install",
        "wsl2 gui",
        "wsl2 sound",
        "kali sound",
        "set up wsl 2",
        "linux wsl 2",
        "upgrade to wsl 2",
        "wsl",
        "windows subsystem for linux 2",
        "wsl 2 ubuntu gui",
        "setup wsl2",
        "kali linux wsl2",
        "WSL",
        "wsl2 windows 11",
        "wsl2 kali linux",
        "wsl2 tutorial",
        "wsl2 install",
        "wsl kali linux windows 11",
        "wsl kali linux",
        "wsl kali gui",
        "wsl kali install",
        "windows 11",
        "install kali linux on windows 11"
    ],
    "views": 445692,
    "likes": 11250,
    "comments_count": 868,
    "description": "It's now easier than ever to install Kali Linux on Windows 11 using WSL2.  // MENU // 0:00  Introduction 1:27  WSL installation 3:42  Ubuntu installation 4:17  Install Kali Linux 5:35  Install Kali Linux GUI using Win-Kex 7:15  Start WSL2 Kali Linux GUI  // COMMANDS // In Windows Powershell: wsl --install  In Kali WSL:  sudo apt update sudo apt install -y kali-win-kex kex --win -s  // DOCUMENTATION // Download link: Kali WSL Documentation:   // SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // MY STUFF // Monitor:  More stuff:   // SPONSORS // Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  wsl wsl2 microsoft wsl microsoft wsl 2 windows 11 windows11 windows 11 wsl windows 11 wsl 2 wsl 2 kali linux kali linxux install kali linux windows 11 kali linux wsl wsl kali linux microsoft wsl microsoft wsl 2 linux microsoft microsoft linux   Disclaimer: This video is for educational purposes only. I own all equipment used for this demonstration. No actual attack took place on any websites. Only use the tools demonstrated in this video on networks you have permission to attack.  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #wsl #wsl2 #kalilinux",
    "description_links": [
        "https://www.microsoft.com/en-us/p/kali-linux/9pkr34tncv07",
        "https://www.kali.org/docs/wsl/",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://amzn.to/3yyF74Y",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "- In this video, I'm gonna show you how to run Kali Linux as an app within Windows 11. Notice if I search within Windows for kali I see it as an app within Windows 11, click on that. I have Kali up and running. And the great thing here is I can start a GUI directly within Windows. So by using kex, I have Kali running as an app within WSL on a Windows 11 computer. I can exit full screen here as an example. Notice there's Kali running as an app. And notice I can go to YouTube. (upbeat music) And notice I can play videos with sound using Kali Linux or Kali Linux if you prefer within WSL on a Windows 11 computer. Let's see how long it takes me to get this application up and running on this computer. Now before we continue, please consider subscribing to my YouTube channel. Please like this video and click on the bell to get notifications. I upload a whole bunch of ethical hacking as well as other types of videos to my YouTube channel. So without further ado, let's get started. Now in this example we're gonna get Kali up and running with a graphical user interface so it won't just be CLI, we'll have a full graphical interface running within Kali Linux within WSL on a Windows 11 computer. Now on the Microsoft website, we told that we need Windows 10 version 2004 and higher or Windows 11. In this example, I'm using Windows 11. So I can install WSL on this computer and then install Kali Linux with a graphical user interface. So the first step is to install WSL and we can do that by simply running PowerShell as an administrator. So you need administrator privileges to install the software. So here we have PowerShell, command is simply wsl --install. And by simply typing that command, we should be able to install WSL. You can see the Virtual Machine Platform is being installed. You can see WSL is being downloaded. So the Kernel is being downloaded. It's installed. GUI app support is being downloaded. WSL now supports GUI apps. So you can run an application such as Chrome within Linux but it acts as an app, seamless app within Windows. Now by default, WSL will download and install Ubuntu. So that's the default Linux distribution that's installed when you install this version of WSL. But we'll install Kali Linux using the Microsoft store. Very simple installation. So we told that WSL has been installed, all we need to do now is reboot the computer. So I'll do that. So all I'm gonna do is shut down the computer so restart it. And when that comes back again we should have WSL up and running. Computer has come back and I can log in. We told that Ubuntu is being installed. We need to create a UNIX user account. Now the user accounts in Linux have nothing to do with Windows but I'll create a user account of let's say David. I'll specify a password, specify a password. So there we go. We've got Ubuntu up and running. Uname -a shows us that we've got a Ubuntu running within WSL on a Windows 11 computer. It was as simple as that to get a Ubuntu up and running. But now what we wanna do, is we wanna go to the Microsoft store and I wanna search for kali Linux, so there's the app. Now on the Kali website, if you go to their main website kali.org/get-kali/. Specify WSL. We told we can go to the Microsoft store and that will just redirect us back to that page. So I can say Free Get, and then it opens up the Microsoft store and allows me to get to the software. So you can use either of those methods to get the software from the Microsoft store. So software is now downloading. So that's installed. We can click open now. We can see that it's been installed. We are asked for a username. So I'll just use the same username that you get with the OVA, so Kali Kali, there we go we are installed. So uname -a we can see that Kali Linux is installed within WSL on a Windows 11 laptop but now we wanna get the GUI. So the way to do that is on the Kali website, click GET KAlI WSL and then look at the documentation. We're gonna get Win-Kex that's the software that we wanna install. And we simply gonna type one command. All those other commands are not needed. We simply need to type this command to install the software. But before we do that, we're gonna do a sudo apt update. So I'll clear the screen here. Sudo apt update, put in my password. That's now updating the references. And then I can simply type that command sudo apt install kali-win-kex and that's now downloading and installing the relevant software. So the documentation at the time of this recording on the Kali website is incorrect. These are the steps that you need. WSL has been updated so you simply just use the command wsl --install to install it. And then you get Kali from the Microsoft store and then you type just one command and you'll have the GUI. So this will take a while to install depending on how fast your internet connection is. So speed the video up at this point. We need to choose a keyboard I'll just use the default of US. Software is now being installed. So there you go. That's installed. Next step is to decide which mode you wanna use. Win-Kex supports three modes. We'll take the first mode, which is kex --win -s which starts it in window mode with sound support. So note I've got Ubuntu running and I've got Kali running. What I'll do here is simply type that kex --win -s command you have to put in a password, so I'll put in a password here. I'm not gonna use a view only password. So the view only password is not set. And there you go. You can see I've got Kali running on my Windows computer. So just to make the point, I'll start Firefox and I'll go to YouTube. And what I'll do is start a video. Now please note what I'm sharing here is educational purposes only and to make you aware of the problems with this zero day attack... So notice I've got sound. I can play YouTube videos. I can connect to the internet. Now one big tip, use F8 to see options such as exiting full screen. So if I exit full screen you can see that I'm using TigerVNC to connect to Kali but I've also got my Ubuntu CLI here and I'm running Windows. So I'm running Kali as a virtual machine if you like lightweight with virtual machine within WSL on my Windows computer. So again don't forget F8, that gives you options, as an example to disconnect, if you click here, you can log out as well. And notice I'm out of Kali, back in the CLI now. I can start kex --win -s to start that session again. So I'll just press that again. So there you go. I've now shown you how to get Kali running within WSL on a Windows 11 computer. Once again there's Kali, here is Ubuntu. I can close a Ubuntu down, I can log out of my session and then close this down. And notice the great thing is, I can simply search for Kali within Windows and I have it as an app and I can start the GUI directly within WSL on a Windows 11 computer. (glitch sound)",
    "transcript_keywords": [
        "Kali",
        "Kali Linux",
        "WSL",
        "Windows",
        "install Kali Linux",
        "Kali running",
        "Linux",
        "running",
        "Ubuntu",
        "install",
        "install WSL",
        "Microsoft store",
        "computer",
        "Microsoft",
        "KAlI WSL",
        "Kali Kali",
        "installed",
        "GUI",
        "Kali website",
        "app"
    ],
    "transcript_entity_values": [
        "Microsoft",
        "YouTube",
        "first",
        "Linux",
        "Kali Kali",
        "three",
        "Win-Kex",
        "Kernel",
        "Windows 10 version 2004",
        "Chrome",
        "WSL",
        "kali",
        "KAlI WSL",
        "zero",
        "UNIX",
        "YouTube",
        "kex --win -s",
        "kex --win",
        "David",
        "kali Linux",
        "Kali",
        "one",
        "Linux",
        "wsl --install",
        "Windows 11",
        "GUI",
        "Kali Linux",
        "PowerShell",
        "F8",
        "kex",
        "Windows",
        "CLI",
        "YouTube",
        "Firefox",
        "US"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "GPE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "GPE"
    ]
}