{
    "id": "Uz1l3BhKCiA",
    "title": "Time to get more money! - Samsung Odyssey Neo G8 Monitor",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-07-14T17:30:20Z",
    "video_url": "https://www.youtube.com/watch?v=Uz1l3BhKCiA",
    "category": "Science & Technology",
    "tags": [
        "samsung",
        "gaming",
        "monitor",
        "gn8",
        "odyssey",
        "g8",
        "games",
        "pc",
        "rgb",
        "linus",
        "tech",
        "tips",
        "short",
        "circuit",
        "high end",
        "best",
        "forza",
        "doom"
    ],
    "views": 1196335,
    "likes": 34567,
    "comments_count": 2343,
    "description": "Thanks to Samsung for sponsoring this video! Learn more about the Samsung Odyssey 32\" G85NB Gaming Monitor at   Samsung sent over their new Samsung Odyssey Neo G8 for Linus to check out and it is impressive, but is there even a computer that can take advantage of its high specs?  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Truly mesmerizing  0:18 Unboxing and specs 1:04 Aesthetics and ports 1:50 Simple install 2:09 Testing swivel/tilt/pivot/height adjustments 2:33 Andy loses it 2:51 Setting up 4k 240hz 3:34 Checking out the monitor settings 5:07 This baby gets BRIGHT! 6:16 Time to game!  6:40 Gaming impressions - Shadow of the Tomb Raider 7:53 Gaming impressions - DOOM Eternal 8:50 Gaming impressions - Forza Horizon 5 9:48 Testing smart input switching 10:51 Final thoughts 11:12 Outro",
    "description_links": [
        "https://displaysolutions.samsung.com/gaming-monitor/odyssey",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "(dramatic music) - Yes, monitor. I shall do your bidding. Hook you up to a fast gaming PC, you say? Yes, yes I will. Here's a good one. What's the difference between my dream monitor specs, and the specs of the Samsung Odyssey Neo G8? Absolutely nothing. Get it? (crickets chirping) Okay, but seriously. Samsung sponsored this video. And once again, (box thumping) I would've done it anyway, because this thing looks absolutely amazing. 4K, 240 Hertz, one millisecond response time, with an IPS type panel. HDR 2000. Wait, sorry. 2000 nit peak brightness with a mini LED backlight, with over 1100 local dimming zones. This promises to be the gaming monitor. Ooh, that's a tight curve. This is 32 inches, 1000R, which means it is designed for that gamer posture. Got to be right here. Full immersion ladies and gentlemen. Coming around back there's lots to talk about. Starting with their Odyssey aesthetic, including RGB lighting, along with inputs. So we've got display port. We're going to need that for 4K, 240 Hertz. And two HDMI ports, that are capable of smart input switching. So as soon as the device fires up CEC style, it can grab that input and switch over to it. We've also got an integrated USB hub with two type A ports and audio jack. As well as a 20 volt DC power in, and some of the most understated marketing that I think Samsung has ever done. On the one hand, they're like, \"Linus, you got to mention the quantum mini LED, and quantum HDR 2000.\" And on the other hand, they're like, \"Yeah, it's a color display unit.\" It's not technically wrong. I just think marketing would rather talk about quantum matrix technology. Pretty simple install process. You just put this puppy in here, right. And screw it in. And this is fun. If you don't want to use the included stand, you've got a VESA bracket included in the box, which is kind of a necessity for curved monitors, like this one. - [Jono] That's a nice screwdriver. (Linus laughing) - Thanks. Someday it will be available on LTTstore.com, someday. Ooh. Got your height adjust. Got your swivel. Got your tilt. Oh, wow. Look at that. You got pivot too. Very nice. Very nice. I can't say that I would be that in to. Oh, okay. It can go almost straight at the bottom. So it's kind of like. Wow. It's a little, it's like it's lording over me. Yes, monitor. I shall I shall do your bidding. Take that Andy. Always remove the peel. Otherwise, may be fire. Also, is this a 140 wat power brick? - [David] Wooo. That's your G rating baby. - That's a lot of power, but what do you want? It's crazy powerful. Assuming that it'll turn on at some point. Oh no, it's not a joystick. It's buttons down here. Okay. Well that's fine. That seems to work pretty well. Okay. Hey, there we go. I mean, viewing angles on this are not bad though. The first thing we need to do though, is find out if the 240 Hertz selection is there. It is not. I have no idea what's involved in running at 4k, 240 Hertz. Like to my knowledge, there's nothing else that approaches this, in terms of bandwidth. Comes with a DP 1.4 validated cable, supposedly. It says 8K on it. Oh yeah, maybe there's like an overclock mode that you have to enable. Oh, refresh rate. (graphic blipping) Oh, well there's your problem. Let's play around in the OSD a little bit here. We've got support for adaptive sync. It's freesync premium certified. And let's see, also G-SYNC compatible. Very nice. Oh, that 240 hertz is so smooth. Oh, how's haloing around the mouse? Out of the box I can see the cursor doesn't have the full brightness on the dark areas of the screen. But they opt to dim the cursor, rather than blow out the black areas around it, which is probably a smarter move. That's always going to be a challenge when you're using full array local dimming. But unless you use full array local dimming, you're not going to be able to hit like, 2000 nets peak brightness. It's just not possible. You can set it to an ultra wide aspect ratio and just have PERMA black bars. Now, obviously that's something that you could do in your display driver, but for those of you who are not comfortable, or not familiar tinkering around in there, it's just a couple of clicks in the OSD. And you can watch in like a 21 by nine, more cinematic aspect ratio. Personally, I wouldn't do it this way, but it's there. Show a virtual aim point on the center of the screen. Here's the cheat button. - [David] Hell yeah. - You're welcome. There's front lighting. Oh, there it is. Okay. That's not too distracting. All right. All right. And then the back is quite a bit brighter. Oh, I had thought this would be RGB, but this is just an accent piece. Okay. That's cool. Then if you turn on Core Sync, it'll match the color of the back with the color of the content on the screen. So it'll kind of light up the wall behind you. I would say it works best with a white wall. So if you don't have one, then probably not going to be the greatest experience. But hey, you might have a white wall. I'm at 35% brightness in a lit studio and this is bright enough. (Linus chuckling) This thing might be actually insane. I don't think I have ever seen anything like that before. - [Jono] Whoa. - This is bananas bright at a hundred percent. Let's go to something bright, but somewhat reasonable. Maybe like 65, 65. How do you feel about that, David? - [David] That looks fantastic. - That looks, it does look fantastic, don't it? Normally your calibration report is a slip of paper in the box, but apparently Samsung has just built it right into the display. Which kind of makes sense, from a workflow standpoint at the factory. Local dimming, here we go. Auto? Automatically turned on and off, based on whether the content is HDR. That's actually really smart because I wouldn't necessarily want to use local dimming and SDR. This has enough innate contrast that you wouldn't really need it. I suspect what PC AV mode is doing is it's using either zero to 255 values for black. Or what is it? 16 to 235. And that just is dependent on the device that you have plugged in. So if you're to plug in something like a Blu-ray player, you might actually switch it over to AV mode. That's pretty much it. Other than that, it's time to experience this thing. Overcooked. (everyone laughing) Just kidding. I want something with HDR. So, oh cool. Samsung gives the option to update software on USP device. That's something that's not actually that common on monitors, and that's a really good thing. Maximum luminance, 100%. And we are barely making it above 120 FPSs. This is almost as fast as it gets. Hey, but if you want to be ready for the rumored next gen GPUs that are coming out. (dramatic music) Oh, the experience is definitely better on access. I had said the viewing angle seemed pretty good. Mm, if you want the best color reproduction, you're going to want to be right in front of the monitor. I wonder if that's one of the reasons that Samsung went with a curved display. That looks really good. (Linus scoffs) Here it was like, \"Yeah, it looks okay.\" But I'm also at like, \"What, what is this, maybe a 25, 30 degree angle off the screen?\" Too smooth. There's no such thing as too smooth. This is just the right amount of smooth. Actually we could get smoother. It is really smooth though. Like even doing just an endless camera rotation around. - [Jono] Ew, I can't look at that. - Like that. (Jono laughing) - [Jono] Cool. - Wow. That is crazy. And we're only running it like 140 FPSs. (bell dinging) Okay. Let's try something else. Is \"Doom Eternal\" on here? Before we get that launched though, check this out. Those pointers are super sharp. They advertise a one millisecond response time. So I shouldn't be surprised, but it's really sharp. 190, 190. - [David] Not good enough. - Even from this angle though. Man, this game looks really good. (gunshot cracks) That's crazy. (upbeat music) Well, that was a miscalculation. (group laughing) Oh my God. That looks good. Samsung specifically wanted me to mention their anti glare. So that's a good thing to have. (David chuckling) - What? It looks awesome. I wouldn't care if it had the most glare in the world. Man, that looks good. And without resorting to vivid mode nonsense, or anything like that, it just looks fricking awesome. Man, do we have Destiny on here? - [Jono] No. - Oh, that's too bad. I'd love to see Destiny on this. Gorgeous game in HDR That's the kind of thing that a monitor upgrade like this does. It's like, you take experiences you've already had, and then you just have them anew with a completely different level of visuals, right? It's like upgrading your GPU from entry level to like a new performance GPU . Going back and playing games with all the eye candy turned on. Like that's what it's like. Okay. 240 and \"VSYNC\" off. Are we still at 90 frames per second? How does that even make sense? I mean, it's a good looking game. Say what you want about the arcade feel or whatever else, but you cannot criticize how this game looks, especially on a good monitor. (Linus squealing) (men clamoring) Okay. Hey look, two of the same character model, like right next to each other, you think they'd have logic for that. - [David] It doesn't matter. You're driving by them. - [Jono] Yeah. - [David] What kind of monster pauses and looks the crowd in \"Forza?\" - Well, these two are right next to each other. I mean, come on. The last thing I want to see is the intelligent input selection. Let's go ahead and plug in this station of play. I'm trying to remember which button is the on button. David, help me. Brighter. - [David] No, opposite. - Definitely bright enough. So let's try if I unplug HDMI. Do I have this featured disabled or something? It's worth mentioning that it supports HDMI 2.1. The HDMI 2.1 branding is all messed up right now, but basically like the the 48 gigabit per second version. Oh, auto source switch plus. Oh, is not available. It's off by default. You have to plug in two things to turn it on. Okay. I'm going to plug in display port. Display port has been connected. And. (fingers snapping) Boom. Very nice. All right, now let's power down the PlayStation. Does that even do that? Here we go, David. You ready? - [David] Yep. - Beep. (upbeat music) (record scratching) (dramatic music) (bell dinging) - [All] Hey. - All right. And all it'll cost you is everything. $1500 US dollars. - [David] Woo. - What do you want? 32 inches 4k, 240 Hertz. If you can afford the GPU to drive it. Well, there's one of two options. Either, you've spent all your money on a GPU to drive it, or you can afford this, no problem. And you can definitely afford to subscribe to \"ShortCircuit.\" Thanks again to Samsung for sponsoring this video. The G8 is coming soon. Available across various regions throughout June. And you can learn more at the link down below. Thanks to you for watching it. (upbeat music)",
    "transcript_keywords": [
        "good",
        "Samsung",
        "thing",
        "Hertz",
        "monitor",
        "Samsung Odyssey Neo",
        "display",
        "HDR",
        "local dimming",
        "kind",
        "Yeah",
        "display port",
        "good thing",
        "GPU",
        "HDMI",
        "nice",
        "local",
        "dimming",
        "smooth",
        "Hey"
    ],
    "transcript_entity_values": [
        "one millisecond",
        "1000R",
        "Destiny",
        "USP",
        "100%",
        "Hertz",
        "65",
        "1.4",
        "1100",
        "Odyssey",
        "4",
        "CEC",
        "4k",
        "USB",
        "8",
        "30 degree",
        "90",
        "one",
        "June",
        "240",
        "32 inches",
        "Doom Eternal",
        "Andy",
        "DC",
        "David] Wooo",
        "OSD",
        "nine",
        "AV",
        "second",
        "255",
        "190",
        "David",
        "Samsung",
        "G8",
        "32 inches 4k",
        "35%",
        "Blu-ray",
        "Jono",
        "48",
        "$1500 US dollars",
        "20 volt",
        "240 hertz",
        "first",
        "21",
        "VSYNC",
        "Forza",
        "16",
        "two",
        "120",
        "240",
        "SDR",
        "GPU",
        "a hundred percent",
        "RGB",
        "Linus",
        "235",
        "VESA",
        "25",
        "2.1",
        "jack",
        "140",
        "PlayStation",
        "Core Sync",
        "zero",
        "2000"
    ],
    "transcript_entity_types": [
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "PERSON",
        "GPE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE"
    ]
}