{
    "id": "uzWjFj2ArNc",
    "title": "DJI Ronin SC review: a gimbal worth buying",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-08-12T14:00:16Z",
    "video_url": "https://www.youtube.com/watch?v=uzWjFj2ArNc",
    "category": "Science & Technology",
    "tags": [
        "ronin sc",
        "dji",
        "ronin",
        "dji ronin sc",
        "ronin s",
        "gimbal",
        "camera",
        "camera gear",
        "review",
        "ronin review dji review. hands on",
        "first look",
        "drone",
        "film maker",
        "action",
        "action camera",
        "skateboarding",
        "skateboarding videos",
        "camera setup",
        "camera videos",
        "specs",
        "price",
        "cost",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "mkbhd",
        "apple",
        "google",
        "iphone",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 170651,
    "likes": 2283,
    "comments_count": 147,
    "description": "DJI Ronin SC isnt just a smaller version of the Ronin S. Its an entirely new gimbal built specifically for mirrorless cameras. It comes in a smaller package, packed with same old and some new features, but also with a price tag of $439 that might discourage someone. Can it justify the price?   Learn more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2KvqpnG",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "It's time for a Ronin SC review, which means you're about to see a lot of these. (chill bass music) Okay, before we go back to more sample footage, let's go through some of the things that you need to know up front. This is DJI's third gimbal. It's not a successor to Ronin S, per say, but a newer, smaller sibling to the Ronin S, specifically built for mirrorless cameras. It comes with some unique features and, yes, some compromises. (groovy rock music) Gimbals used to be the kind of accessory reserved only for professional video makers. It was the sort of thing you'd consider spending money on, but often end up investing in something like a new lens. I know I would. For $440 or $540, which includes a few extra accessories along with the Focus Motor, you get a gimbal that will satisfy most people's needs as long as those people aren't Fuji users like myself. I'll get into that later. But my first issue is not a Fuji-specific problem, but more an issue with the payload. I'm using my Fuji X-T2 with an ultra-wide 8- to 16-millimeter lens, which, mind you, is a heavy, bulky lens. It just doesn't work that great. And you can see that from this footage here. It's not perfectly stable, but you can still make it work. And if you add a battery grip to your camera, it doesn't work at all, despite weighing in at 3.5 pounds, way under the recommended 4.5-pound payload. And I don't think this is due to sheer weight, but rather that the camera with the grip attached to it simply sits too tall for the gimbal. You could add and include a lens support to distribute the weight more evenly, but it actually doesn't fit with that setup. Plus, the eye cup just gets in the way of the gimbal. Another thing that will get in the way of the gimbal is if your camera has a tilting screen. The point is, you should definitely take a good look at your gear before picking your ideal gimbal. But switching to other lighter lenses and filming with the Ronin SC was a blast. At 2.7 pounds without a camera attached, it's easy to use for a longer period of time. You can also use it with one hand. It's basically designed for that, but I tend to leave the tripod legs attached and hold on to it for added support. Still, depending on which camera you use I used my Fuji XT-2, Sony A7S II, and EOS R you could run into some issues if you don't balance it perfectly the first time. That was mostly the case with the EOS R, as you can see from some of the time-lapse videos I tried. There are a total of three standard filming modes. There's pan and tilt follow, there's first-person view, and a 360 roll. You can adjust the speed and deadband for each of those and smoothing forward the 360 roll. And I do love using that feature. The one thing that is hard to pull off is to get it perfectly straight once you complete the full rotation. And I do wish you could make it spin faster. There are three presets for speed and the custom one, but this one was a bit too slow for the shot right here. Overall, build is fantastic. The handle feels nice, button layout makes sense, the Focus Motor feels smooth, although it has a short travel and sometimes feels a bit too sensitive. It has a black matte finish, which does get scratched up easily, but it still looks good, although that's less important than a few nifty engineering tricks that Ronin SC has. First one is the ability to lock all access. It helps with balancing the gimbal and also with transporting it. The battery also detaches and makes it even more portable. DJI says the battery will last 11 hours, just an hour under what the Ronin S had. That will largely depend on how well you balance your gimbal and if motors have to work extra hard to keep the camera steady. And for my testing, 11 hours sounds about right. It'll easily last you for more than a day's worth of filming. The last little thing that I like is that DJI added a little clip on the camera plate. So next time you put the camera on the gimbal, you don't need to rebalance it again. All those things do make for an enjoyable filming experience. (relaxing downtempo music) As I mentioned, the Ronin SC comes with a bunch of other features you can access through the app. There's stuff you'd expect, like shooting panos or time-lapses, but there are also a few that you won't find anywhere else. So let's start with Active Track. If you're familiar with DJI drones, you probably recognize this one. It basically lets you lock on to a target, like a car or a person. In order to make it work on the Ronin SC, you have to touch your phone on top of your camera and that's where things got a bit tricky. Balancing the phone on top of the camera wasn't an easy task. The whole setup just felt very flimsy. I tried a few different lenses to make the setup lighter, but I wasn't having a lot of luck. That said, the app was tracking well, but the gimbal had issues changing directions and trying to keep up with the subject. But I still feel like I wouldn't use this feature that often unless I really needed to do something specific. The second new feature is called Force Mobile, and it's wild. What it does is tracks the movement of your phone, reads the gyroscope data, and mimics that onto the gimbal. It works surprisingly well, but it's also the kind of feature I'd rarely use. Still, if you're shooting with a bigger crew, you can come up with some fun shots to pull off. I'm just not that creative. And it's worth noting the gear, which enables remote movement control, usually costs upward of $1,500, like DJI's own Force Pro, so props for making that accessible. Lastly, the Ronin app is also really good. It's stable, it connects to your gimbal almost instantly, it has a lot of customizable options, it has user profiles, too, and it's just simple to use. But if you're a Fuji user, a lot of those features won't work since both the Ronin SC and the older Ronin S don't actually support Fuji. So things like time-lapses, motion lapses, and panos just won't work. DJI tweeted that they're working on it, but no clue when that'll be available. So if you're like me, and all those 12 other Fuji shooters, you're going to be bummed about this one. Even without being able to take advantage of all those features, I still kept my Fuji on it for most of the week. I just love filming with that camera, and I genuinely love using the Ronin SC, too. It's small enough to bring around, and it just feels like a piece of gear that'll last you for years to come. If you're only interested in getting stable shots and nothing more, you can probably save a few bucks and look for other options, like the Zhiyun or the Moza. But if you want a gimbal that's almost as care-free as it gets, built like a tank, and packed with fun features that'll actually push your creativity, this is the one to get. (chill downtempo music)",
    "transcript_keywords": [
        "Ronin",
        "gimbal",
        "camera",
        "Fuji",
        "DJI",
        "work",
        "features",
        "make",
        "Ronin SC review",
        "filming",
        "Focus Motor",
        "things",
        "thing",
        "feature",
        "lens",
        "feels",
        "time",
        "lot",
        "Ronin app",
        "Focus Motor feels"
    ],
    "transcript_entity_values": [
        "last 11 hours",
        "Active Track",
        "one",
        "third",
        "Ronin S",
        "three",
        "4.5-pound",
        "Force Pro",
        "more than a day's",
        "EOS",
        "the Focus Motor",
        "2.7 pounds",
        "the Ronin SC",
        "a few bucks",
        "DJI",
        "16-millimeter",
        "Force Mobile",
        "Focus Motor",
        "years",
        "just an hour",
        "440",
        "540",
        "12",
        "Zhiyun",
        "Ronin",
        "3.5 pounds",
        "Ronin SC",
        "Sony",
        "second",
        "the Ronin S",
        "first",
        "11 hours",
        "the week",
        "1,500",
        "First"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "TIME",
        "DATE",
        "MONEY",
        "ORDINAL"
    ]
}