{
    "id": "v0QkafslnrM",
    "title": "Data Recovery Services",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-06-09T17:43:24Z",
    "video_url": "https://www.youtube.com/watch?v=v0QkafslnrM",
    "category": "Science & Technology",
    "tags": [],
    "views": 454216,
    "likes": 26094,
    "comments_count": 1371,
    "description": "Thanks to DriveSavers for sponsoring this video! Use code TECHQUICKIE to get 5% off DriveSavers receovery services at   How does data recovery work, and how should you go about trying to get your data back?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/4SrK",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- So picture this, you're firing up your PC for another day of hard work, or slacking off at work, and nothing happens. I mean, the computer turns on, but instead of getting to the operating system, you get some kind of recurring error message about your storage. Then it hits you, your hard drive or your SSD is dead, and the data is about as accessible as the Ark of the Covenant, but all might not be lost. You can still send your drive off to a data recovery service, so that your tax documents, personal photos or saved games aren't lost to the ether. But how do you even get started with that? Well today we're going to tell you how and we'd also like to thank our friends over at DriveSavers for sponsoring this video. First things first, if you use a professional service, it probably won't take a super long time to get your data back if it is indeed recoverable, but it also won't be a matter of a couple of hours before you can breathe again, either. If you can afford rush service and your recovery job ends up not being very complicated, it could be turned around in as little as a day, but you may also end up waiting around a week so keep your expectations reasonable. If you only need logical data recovery, the process tends to be quicker. So this is when a drive is still in good shape physically, but you've lost your data due to something like a problem with the operating system or an accidental format. However, if you have a physical issue, like a head crash, you may be waiting around for longer since they'll probably have to take your drive apart, possibly in a cleanroom environment, and repair the drive, just enough so that there can be a chance that you can get some of that data back. But how do these processes work? Let's first talk about logical data recovery, which for example you might need if there's a problem with the master file table, which serves as kind of like an index or a record of the physical locations that each file occupies on your disk. Issues with the MFT can result in your computer simply not knowing where to find the data, even though it's still on the disk. So, that can often still be recovered with tools that use strategies like bypassing corrupted file system infrastructure, or scanning the data manually and then putting it back together using signatures that are common to certain file types. Physical recovery is obviously more complicated. Of course, if the drive is very badly physically damaged, there might not be anything even the best data recovery companies can do. But if that isn't the case, recovery companies do have a variety of tricks up their sleeves. It could be repairing or replacing the drive's circuit board, you could move the disk platters to a new drive, a tricky proposition because of how close the read and write head has to be the platter surface, and even a drive that suffered a head crash, where the head actually impacts the disk, it can partially be salvaged by physically moving the head out of the way before attempting to read any data on whatever good parts of the platter are left, Though it should be noted that the area directly under the crash is often unrecoverable. If we're talking about SSDs, the company might actually have to remove the NAND flash that stores the data and transplant it to a new board with the original controller chip. And then for corrupted firmware, which also counts as physical failure by the way, the data recovery company might have to repair or rebuild the firmware to access your data, which can add additional time, and sometimes data can be unrecoverable, even if there's no physical damage, as is the case of a hard drive that's overwritten with zeros, or an SSD where the trim command has been run. You can learn more about those things here and here. Now that you have an idea of how it works, how do you go about picking a service provider? Well one thing to keep in mind is that reputable places will often provide some kind of results-based payment structure. You ever see those lawyer commercials where they say, you don't pay if we don't win. Well, a good data recovery place also shouldn't be billing you if they can't get your data back. So look out if they try to charge you large amounts of money that you'll be on the hook for regardless of whether anything is actually recovered. And on that note, make sure you get a quote in writing before signing anything. Also make sure that your provider has comprehensive security protocols in place. They should be protecting your data, and getting rid of any copies that they have once the recovery process is complete. And of course, like anything else, read reviews and make sure there aren't an inordinate number of complaints about a particular company because they took two months and all they could recover was a big folder of Linus face memes. For example, not that I speak from personal experience. Thanks to DriveSavers for sponsoring this video. They're a San Francisco Bay Area-based company that's been around since 1985 and is authorized by all the major drive manufacturers. They offer data recovery on all kinds of devices, hard drives, SSDs, RAID arrays of the aforementioned, NASes, thumb drives, SD cards, if it holds data, they can save it. They even do phones. All their operations are in a single data recovery lab, and their data recovery advisors are available 24/7 with access to their engineers at all times meaning fast turnarounds if you're trying to save critical data. They have the largest ISO-five certified data recovery cleanroom on earth, and they offer advance quotes, free evaluation and free shipping. If they don't recover any data, you don't get charged. So if you want to be as close to certain as you can be that you're going to get your data back, send it to DriveSavers first before you send it somewhere else that might attempt a recovery and mess it up so even they can't get it at that point. That's actually something we should have mentioned in the main body of the video. One of the key important things for data recovery is if you don't know what you're doing, don't do anything, send it to a pro. Anyway, use the code techquickie to get 5% off DriveSaver services at the link below. Thanks for watching guys, like, dislike, check out our other videos, comment with video suggestions if you want to see a Techquickie topic in the future. and don't forget to subscribe, and follow.",
    "transcript_keywords": [
        "data recovery",
        "data",
        "recovery",
        "drive",
        "data back",
        "logical data recovery",
        "data recovery service",
        "data recovery company",
        "good data recovery",
        "back",
        "data recovery place",
        "head",
        "physical",
        "data recovery companies",
        "hard drive",
        "service",
        "logical data",
        "data recovery cleanroom",
        "offer data recovery",
        "hard"
    ],
    "transcript_entity_values": [
        "Techquickie",
        "1985",
        "One",
        "one",
        "NASes",
        "another day",
        "as little as a day",
        "a couple of hours",
        "San Francisco Bay Area",
        "MFT",
        "DriveSavers",
        "DriveSaver",
        "first",
        "zeros",
        "NAND",
        "5%",
        "two months",
        "ISO-five",
        "Linus",
        "SD",
        "First",
        "around a week",
        "today",
        "SSD"
    ],
    "transcript_entity_types": [
        "GPE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "TIME",
        "LOC",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG"
    ]
}