{
    "id": "V3rFryvsHts",
    "title": "The best $250 phone you can buy in 2018",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-07-30T13:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=V3rFryvsHts",
    "category": "Science & Technology",
    "tags": [
        "motorola moto g6",
        "motorola g6",
        "moto g6 review",
        "motorola",
        "motorola moto g6 plus",
        "g6 plus",
        "moto",
        "android",
        "moto g6",
        "moto g6 plus",
        "phones",
        "phone",
        "smartphone",
        "smartphones",
        "mobile phone",
        "mobile phones",
        "best mobile phone",
        "best smartphone",
        "best android phone",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "how to",
        "diy",
        "mkbhd",
        "marques brownlee",
        "apple",
        "google",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge",
        "samsung"
    ],
    "views": 179285,
    "likes": 3455,
    "comments_count": 492,
    "description": "Looking for a great phone for under $300? We tested out a ton of different options to find out which one is the best. Motorolas Moto G6 stood out far above the rest  heres why.   Subscribe:   Here are some links to the products you saw in the video: Note: we sometimes place affiliate links directly to the best deals in our video descriptions, so we may earn a commission if you buy something.  Moto G6:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://amzn.to/2poIvg2",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- You used to have to spend $600 dollars to get a good, even usable smartphone but that's far from true anymore. Now, there are a ton of great phones below that price and you can even find some great phones below $300. I've been testing a bunch of them and one stands out clearly above the rest and it's only 250 bucks. That's the Moto G6. First thing, the Moto G6 does not look like a $200 phone. I actually find that it strikes one of the best balances between shape and size out there. The phone has a 5.7 inch full HD display with an 18:9 aspect ratio that nearly fills the front of the phone. It's a really great size if you're like me and read a ton of articles on your phone. I'm browsing Twitter and the Web all the time. On top of that, it's just a really good screen. Now, it is an OLED so you don't have those perfect blacks that you get from a top of the line phone and it's not always on. But, I really like the color tuning on this phone. I even like it better than my own Pixel 2, which cost nearly twice as much. The colors look both richer and more accurate to my eyes. The phone also has this nice curve on both back edges and it isn't too wide, Even though you have this big screen, it's actually really easy to hold and doesn't look or feel like a big phone. (energetic music) Motorola doesn't change Android too much either and that's a good thing. This is very close to stock. And where Motorola does make changes, they are anywhere from inconsequential like adjuster to shrink the screen down for one handed use to slightly helpful like an option to keep the screen on while you're looking at it. And if you don't like those changes, you can actually turn all of them off, which is great. Software performance is about as good as you're gonna get in this price range. In general, I didn't run into any issues when using phone day-to-day. Scrolling is smooth and apps and webpages loaded quickly. I suspect that over time, it probably won't stay as fast as a more expensive phone. But right now, it's smooth and snappy and that is not something every other sub $300 phone can say. The one major downside on this phone is its cameras. The rear camera is slow to fire so I sometimes miss shots and while you can get nice images out of it when you're in bright daylight, darker settings deliver mushy or noisy photos. The front-facing camera isn't much to get excited about either. Now, you really can't get a better camera than this without spending a lot more. But it's still disappointing that you have to forgo quality on what, for myself and a lot of other people, is a key part of a phone. There are a bunch of other little things that I love on this phone. For one, it has a headphone jack. Everybody loves that. It also charges over USB-C, which is easier to use than micro USB and a lot more modern. Pretty much every other phone at this price is still on micro USB. The G6 also has a fingerprint sensor. It's on the front instead of the back, which is not my favorite position, but I got used to it. You can even take advantage of the sensor by using it to control the entire phone with gestures. That lets you remove Android's on-screen buttons and free up screen space. (upbeat music) Aside from a few flaws like the camera, there's very little lacking on this phone that separates it from something twice its price, which is pretty incredible. Like I said, performance will probably be a longer term issue, but there are no problems as it stands today. Now, if you're in China or India, you do have a lot of other options at this price point from companies like Xiaomi and Oppo, but many of those phones aren't available in the U.S. The other budget phones that do make it to the U.S. just don't hold up. They're often missing key features like a fingerprint sensor or support for 5 GHz WiFi, both of which the G6 has. Motorola also sells two other variants of the G6. The G6 Play, which costs $50 less and the G6 Plus, which costs $50 more. The G6 Plus has a slightly better camera and is a bit faster, but it's a little bit bigger in a way that I don't like quite as much. The $200 G6 Play is a bit slower and thicker with the worst screen but I got its battery to last me through three days which is pretty amazing. So if you're looking even cheaper, that's worth considering. But by far, I think the best choice below $300 is the regular Moto G6. It doesn't just check all the right boxes, it actually impresses on a lot of them. Every time I pick up the G6, I'm surprised at just how good a budget phone can be. Hey, thanks for watching. If you like this video, you should check out our new channel Verge Science. I really love the video they just put up about graphene. You can check all their stuff out at YouTube.com/VergeScience.",
    "transcript_keywords": [
        "phone",
        "true anymore",
        "usable smartphone",
        "screen",
        "Moto",
        "phones",
        "great phones",
        "camera",
        "good",
        "lot",
        "price",
        "great",
        "Motorola",
        "time",
        "Pretty",
        "sensor",
        "bit",
        "check",
        "Android",
        "micro USB"
    ],
    "transcript_entity_values": [
        "Android",
        "one",
        "Xiaomi and Oppo",
        "$600 dollars",
        "USB",
        "today",
        "G6",
        "the G6 Plus",
        "5.7 inch",
        "5",
        "three days",
        "300",
        "50",
        "Verge Science",
        "two",
        "jack",
        "Pixel 2",
        "The G6 Plus",
        "only 250 bucks",
        "Motorola",
        "G6 Play",
        "Moto G6",
        "below $300",
        "India",
        "China",
        "USB-C",
        "200",
        "18:9",
        "Moto",
        "U.S.",
        "a ton",
        "First",
        "Twitter"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "MONEY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "GPE",
        "GPE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "GPE",
        "QUANTITY",
        "ORDINAL",
        "PERSON"
    ]
}