{
    "id": "V6kJOXr3HzA",
    "title": "How to Build an Off Road Wheelchair (From 2 Electric Bikes)",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-10-18T13:52:39Z",
    "video_url": "https://www.youtube.com/watch?v=V6kJOXr3HzA",
    "category": "Howto & Style",
    "tags": [
        "Off Road Wheel Chair",
        "wheelchair",
        "how to build wheelchair",
        "accessible chair",
        "accessible",
        "handicapped",
        "handicapable",
        "Electric Wheelchair",
        "DIY Wheelchair",
        "Bike Chair",
        "Quad cycle",
        "Cambry Kaylor",
        "JerryRigEverything",
        "Outdoor Wheelchair",
        "Extreme Wheelchair",
        "Disability",
        "spinal Injury"
    ],
    "views": 944934,
    "likes": 28518,
    "comments_count": 1939,
    "description": "Watch Cambry ride her Off Road Wheelchair for the first time HERE:   Building this fully electric wheelchair was super fun, and surprisingly simple. A few bars of metal tied into the already naturally existing supports and holes on the bike makes for a great seat supports. This Off Road wheel chair has a top speed of 20mph and a range of about 20 miles.  The bikes I used cost about $1400 each, So after factoring in the $50 dollars worth of metal and random odds and ends, the whole thing cost about $3000 dollars to build. Which is less than half the price and twice the performance of other off road wheelchairs on the market right now.    See the new 'off road wheelchair HERE:  Check out Cambry's instagram here:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   Customize your own Tesla Here:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:  Music is from HERE:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/H3_mVryqXpU",
        "https://youtu.be/vuMg0QwKAGI",
        "https://www.instagram.com/cambrykaylor/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://ts.la/zack10701",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://share.epidemicsound.com/pcGGf",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So I met a girl a couple of weeks ago who is in a wheelchair. Now, wheelchairs are great for pavement and flat surfaces, but not so much for off-road adventures. I secretly built this off-road wheelchair by tying 2 electric bikes together with a seat in the center kind of like a chariot of sorts. It goes 20 miles an hour, with a range of about 20 miles which is pretty cool. And this video shows how I put the whole thing together. If I were to build it again though, I would get bikes that have a suspension in the rear as well as the front, so it has a smoother ride while off-roading and going over curbs and stuff. Let's get started. [Intro] So behind me I have two normal electric off-road bikes with the super big fat tires, and we're going to try to combine these 2 bikes into an off-road pod racer, chariot of sorts type contraption. A contraption where someone can sit in the center between the two bikes and still be completely stable. So the goal here is to preserve as much of the structural integrity of the bikes as possible...trying to leave them in pretty much the same condition as they are right now, since a lot of planning probably went into the design of these bikes and we don't want to change too much of it. We want the rigidity, the safety, and the security that is already naturally built into the frame. We just want to modify it a little bit. Okay, so one of the structurally sound points of the bike is right where the pedals intersect with the frame. So we're going to use that as one of the strongest points for this chariot pod racer thing we're going to make. So I've cut this bar. We've already removed the pedals, and we're going to stick this right between where the pedals used to be. It falls apart just like that. So even with just that one bar in between where the pedals used to be, this is already super solid. The thing I'm excited about is that the brakes are still intact on the rear and the front and the front shocks are still intact, so it still should operate as one bike would, except for we have two. [Sawing noises] [Welding noises] So those tacks should hold it in place just long enough to situate it on the other side of the bike. So let me show you where we're at with the bikes. We just finished welding up the seat frame which is going to be the perfect size for the current cushion she has on her wheelchair. Made sure that was the right size. So luckily the seat's resting on the back of the frame, and then it can just rest forward. And I want the seat to be slightly elevated back, so when she's driving around, she's not going to slowly slide off the front of the seat. So it's going to be raised up a little bit. We have that bar down there. So that should be the perfect distance to keep her on the seat while it's moving and for her legs to go downward towards the middle of the front wheels so we know that this bar is secure where the pedals used to be. We have this all-thread bar right here stuck through the bottom brackets, all the way through the bar, screwed in with some massive washers, a locking washer, and then a nut. And that will keep it tight the whole time she's on the bike. So you can see the excess of the all-threads sticking out on this side. Obviously we'll cut this off before we finish. We're just making sure that it's all in place while we finish fabricating the seat. So far I'm pretty pumped that it's turning out. I think it's going to work. [Welding sounds] It's pretty cozy for me. Should fit Cambry pretty well. Right now, only one bike is turned on. We have the seat all welded into place. The steering wheels aren't tied up in tandem yet, but I think we have that figured out. But right now I need to hide the bikes because Cambry's coming over. Ha ha! This is awesome! No way! It's working! And that's just with one bike motor moving right now. So stoked. This is awesome. Okay, so the bikes are strapped together. We have the seat basically built. We don't have the leg extensions yet. We want to figure out the steering just in case we have to tie into the metal for the seat. We think we have it though. There's a little hole in the front of the shock where a light is supposed to go. We're going to use that hole and drill in this angel bracket. It's kind of like something you'd hold up a shelf with and we're just going to cut one of these sides off, have it extend out, and then attach the two with the metal bar. That way, the front wheels are locked together, so if you turn one, the other turns with it, and they won't bind up while you're driving. [Sawing and drilling sounds] Right here, we went with the bolt right through the top, and then a washer, then the metal bar we just drilled through, with another washer right between them, the stabilizer right here, you had another washer, and then a locking nylon nut between them all. Then when we tilt the steering wheel back and forth, both tires turn in tandem. We have the front bar in that ties the front two wheels together, so they turn in tandem. And we have the seat, and the next thing we're going to work on is the leg rest. Now, initially I thought that she would be able to sit here and then extend her legs like she's laying down, but that would block the wheels from turning, so there would be like a metal cage right here, and so she wouldn't have a very tight turning radius. And I feel like it's way more important to have a tight turning radius, so we're going to drop her legs straight down. So her legs are almost at a 90 degree angel coming off the seat and dropping straight down to rest on the foot rest. [Sawing and welding sounds] So this is how the steering is normally, but if we take it and turn it, drop it down and rotate it backwards so it's parallel with the wheel itself, and then tighten it down with these bolts right here. Then the wheel will turn when the steering wheel is parallel with the tire. And with the throttle right here and right there, she can control both the motors independently of each other while she's driving, and her field of view is still wide open. We're just getting rid of all the stuff we don't need on the handle bars, like the little bells, and also the gear shifter because we don't need that because no one's going to be pedaling on this bike. [Sawing sounds] Okay, so we have both the handle bars cut off the front which turned out pretty sweet looking. We have the cable wrapping around the side. Looks pretty minimalist. The computer still sits very comfortably right there on the inside of the handle, with the power switch and the brake, which can just be accessed with your thumb. But now it's time to work on the back. So I've taken a look at her wheelchair and I'm going to kind of design the same little footrest thing we were using before, take that, and put it right here on the back about 11 inches up, which will clear the tire just barely, and then come down here on the other side. And then probably use some flat plate along the sides and the bottom to keep everything secure, and for somewhere to put her pad when she's off-roading on this bicycle. So I am definitely not a professional welder by any means. But welding is actually pretty cool. With welding, we're running electricity through this metal. So we have a ground right here, we can clamp it anywhere to our work of art that we're constructing right now. And this gun right here spits out a little bit of metal each time I pull the trigger. And it's part of what conducts the electricity and helps melt the metal together and adds a little bit of metal to the joint that we're making. It's pretty solid. I can move the whole bike with it, but I'm not going to put a lot of pressure on it yet. Once we pull this out of the bike frame, I'm going to solidify all of the welds we've made, and then I'll put the bike back together for some testing. This is all the metal for the seat...the frame anyway. We're going to put a metal plate over the top. The back is at a slight angle towards the rear, but that's fine because the seat is also a slight angle up just a tiny bit...which you can see a little better right here. The seat is up and the back is just barely tilted back a tiny bit. [Welding sounds] So this is the back of the chair. I've added some straps from the back to the base. This is where she will sit. And then down here at the bottom, we want to support the leg structure. So I'm going to take this bar, and put it right behind these two for a little added support. And you'll see what that looks like when it's back on the bikes again. Is that supposed to be on fire? [Welding sounds] Yes! Woo! [Drilling sounds] She is ready for a test ride. We got the foot thing in place. I'll still clean up my welds a little bit later. And then we have the side of the chair bolted into the frame back there with that little u-bolt,which keeps things super secure, especially at high speeds. Which, since this thing is capable of 20 miles an hour, being structurally sound is a good thing. Okay, so far it's holding my weight 200 pounds right there on the foot rest. Not too shabby. It is cozy! Okay, okay. Both computers are on. Oh yeah! Yeahhhh! Okay, this is the coolest thing I've ever made! Both brakes work. Probably find something to do a parking brake at some point. I think it was a success. Okay, so I dismantled the bike one last time so we can powder coat the seat. Powder coating is a type of really really thick paint that gets cooked onto the surface of the metal to make it look, you know, a little bit more professional than kind of what we've been doing here. The metal fabrication can probably be fit to any size, even a double-wide, if the metal is rigid enough. It's hard to say without trying it out for sure. It'll be fun to see what you come up with. Hit that thumbs up button, and if you ever end up building one of these off-road wheelchairs...go karts for yourself, I want to see it. Cambry had no idea I was building this bike, so her reaction to receiving it was pretty fun. I'll link that video up here and down in the video description as well so you can watch that. Maybe you know someone who could use this, or you just want a sweet looking go kart for yourself, it's pretty fun and powerful. Feel free to share this video. Thanks a ton for watching. Hit that subscribe button. And I'll see you around.",
    "transcript_keywords": [
        "seat",
        "bike",
        "bikes",
        "metal",
        "back",
        "pretty",
        "bar",
        "front",
        "thing",
        "bit",
        "frame",
        "put",
        "offroad",
        "metal bar",
        "wheels",
        "met a girl",
        "girl a couple",
        "couple of weeks",
        "weeks ago",
        "pedals"
    ],
    "transcript_entity_values": [
        "200 pounds",
        "a couple of weeks ago",
        "two",
        "about 11 inches",
        "90 degree",
        "20 miles an hour",
        "one",
        "about 20 miles",
        "only one",
        "Cambry",
        "2"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL"
    ]
}