{
    "id": "v71vugKdkO4",
    "title": "Unboxing the smallest GAMING PC you can buy! - Intel Ghost Canyon NUC",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-04-15T23:45:45Z",
    "video_url": "https://www.youtube.com/watch?v=v71vugKdkO4",
    "category": "People & Blogs",
    "tags": [
        "Intel",
        "NUC",
        "Ghost",
        "Canyon",
        "Processor",
        "Sodimm",
        "Mini",
        "Small",
        "System",
        "Gaming",
        "2070",
        "Nvidia",
        "Graphics Card",
        "Extreme",
        "Kit",
        "Modular",
        "DIY",
        "Hands on",
        "CES 2020",
        "i9",
        "9980-HK",
        "64GB Ram",
        "M.2 NVME Drives",
        "Wirelss",
        "Gigabit LAN Dual",
        "Thunderbolt 3 Port"
    ],
    "views": 1920789,
    "likes": 51471,
    "comments_count": 4265,
    "description": "Linus gets his hand on Intel's newest NUC, the Ghost Canyon! He does go a bit beyond the regular unboxing...  Check out the Intel Ghost Canyon NUC System at       Buy Intel NUC Systems: On Amazon (Paid Link):     On BHPhoto (Paid Link):      On NewEgg (Paid Link):      Buy iFixit Pro Kit: On Amazon (Paid Link):  On NewEgg (Paid Link):     Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://geni.us/0kHz",
        "https://geni.us/Ym2Cx25",
        "https://geni.us/hfYTV",
        "https://geni.us/ZGz0",
        "https://geni.us/jZEK",
        "https://geni.us/DHBUB8d",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- I remember the first time Intel showed me something, kind of like this. It wasn't the same as what the NUC 9 Extreme Kit ended up being, but it was, sort of like a, modular computing concept, that I think probably led us eventually to here. So this is my first hands-on with this thing. They actually showed off some designs using the compute unit back at CES of this year, but I didn't go. And I am very excited to take a look at it, assuming I can figure out how to get the bloody box open. Ah, there's a seal. These guys can be very, very, good at packaging when they want to be. (bangs clips) Listen to that, it's like, metal clips in here. Let's open it up. And after peeling off all those layers, we are left with, that. A full-fledged gaming machine, that is not much bigger than a graphics card enclosure, in fact, most of the external Thunderbolt GPU enclosures that I've used, are actually smaller than this. Truly impressive isn't it? What else is in here? Power cable. And, Intel flashlight. Oh, okay, there's a blacklight mode. (clicks light switch) If you need to find where your cat peed, or whatever. Now this is just the unboxing, your gonna find the full review over on the Linus Tech Tips channel. So, I have done zero research leading into it, which means I'm just gonna read off the box for you. It's got a Core i9 9980-HK processor, it's got two memory slots, so you can put DDR4 memory up to 64 gigs in here. It actually supports up to three, M.2 drives, so you could run a bunch of like, RAID zeroed, high speed SSD's in this thing if you really wanted to. It's got, Intel Wireless, two gigabit LAN ports. That's interesting, it's got dual Thunderbolt ports. The power supply input is right down here at the bottom, so it's got what looks like one of those more, server type, slim, long power supplies. And then over at the front, hey, SD card reader, and a couple more USB type A's, so that's a total of six. Tick that. MacBook Pro. Enough chit-chat. Let's crack this thing open. Gotta monitor my own audio. At home unboxing stuff. Oh, okay, so there's my cooling module for the top, so that looks like two slightly low profile, not super slim, but slightly low profile 80 millimeter fans. This one's got a little protective grill over the top of it, I wonder why that, oh yes, okay. That's because, right underneath that, there's a power supply connection into the graphics card, so just in case, it were to, I dunno, come up or whatever else, it might get jammed in the fans, that'll keep that out of, out of the way. And then this is cool. There's ah, these nice little, contacts over here that handle power for the fan, with just like a little splitter PCB right here. So that way, the fans get plugged in simply by sliding this cooling module forward, very cool. Hey, got em. Oh wow, this is actually a surprisingly painless disassembly process. So you just pop this up, that gives us access to the graphics card. So I'm not sure what's in here, it's an RTX of some sort, based on the size of the card, I'm gonna guess like a 2060 or something like that but, we're gonna get that popped out anyway. Now let's pop up this side. Eh, also simple. And that, right there, is the compute module. So, part of the shtick behind these compute module based products, like this gaming NUC, is that, with almost no tools or expertise whatsoever, you could actually upgrade the graphics card, or, the entire like, PC-ness of it really, cause there's a 500 Watt power supply down there and then, that's it. The rest of it is just a case. So everything else about it that makes it a computer, is actually just pre-installed on this little board here. So, let's see how simple it is to get up. So I'm gonna release this, this PCI Express, (shouts excitedly) connection right here. And then theoretically, it's just like, (rattles unit) hello? Oh. I will need one more tool, I will need a little, pokey, pryey thing. There we go. That's out, that's out. Okay, so we can go ahead and remove the PCI Express power connector, and then on theory, this is just gonna slide out for me right? So you can see my USB three front panel connector got a little bit in the way there but, not too too bad. Hey there we go, okay, that was, that was pretty simple. Wow, this is a 2070? It weighs next to nothing. No offense to ASUS, but that is one cheapo feeling 2070 right there, that they got themselves there. (laughs) There's my graphics card. And this is the compute module do-dad. I'm sure there's an easier way to do this, but I'm just gonna force it a bit. There we go. All right, so there's what is probably our front panel connectors, things like, front audio, front USB, all that good stuff. What actually even is that? So we've got this large heat sink down at the bottom that seems to be over an M.2 slot. Now the thing about M.2, is that yes, it's for SSD's. but also it just happens to be just a PCI Express PHY four interface. So there's no real reason, why you couldn't put anything you want in it. So let's see what's in there. Oh sick. This is a 380 gig, Optane 905P. That, would explain, why it needs this beefy AF freaking heat sink on it because, that is not your moms SSD. So then, what have we got? We've got PCIe 16x interface. Presumably, some kind of, um, PCI Express blitting logic built into this board or something because we've got a 16x slot for the GPU, that's gotta be only like 8x. We've got a 4x slot, and then we've got another 4x slot for that M.2, so I would guess that is electrically 8x. 80 PLUS Platinum power supply from FSP. All right. So let's set aside that for now. And focus our attention on this guy. Shall I take the cooler off it? Yeah I guess I might as well take the cooler of it, right? Yeah let's do it, okay. Who am I talking to to? Nobody. (hip hop style music) You just gonna, come apart for me there bud? Wow this config that they sent to the reviewers is loaded for a freaking bear here. So you got a single-blower cooler on this thing, that's because the CPU that it's using, is actually based on one of their mobile chips. (laughs) Now their mobile chips these days, can suck back power, pretty good. We've seen them well over their rated 45 Watt TDP's, but they are still more efficient pound for pound than the desktop chips. So it shouldn't be that much of a surprise but, I mean here it is, there's just this one blower fan, and then this, small, what looks like a vapor chamber with an aluminum heat sink on it, to handle cooling for the CPU. And then you're gonna have some incidental air flow from this blower fan, that's gonna provide some cooling too. Here's a populated M.2 slot, so that's a One terabyte Kingston KC200, and then there's another M.2 slot right here, and then we've got a couple of SODIMM slots that have ah, 16 gigs of RAM each, in the reviewers config anyway. Which we are gonna take advantage of, there will be a full review on the Linus tech Tips channel, in the next little bit. Um, but, this is just kind of the unboxing and first impressions. But one thing I did wanna cover before I leave you guys, is just how incredibly small this thing is. So this is an AUROS external GPU gaming box that they released, I don't know, must've been a year ago or, something along those lines. It's got a GTX 1080 in it, so, pretty darn impressive little machine, and it connects to a laptop via Thunderbolt 3. Now back when this was first released, this was real impressive, cramming a power supply, a Thunderbolt interface with the associated chipsets that are required for that. And, a graphics card into a box this size. But let's take a look at the outer enclosure, actually here, we'll look at the inner enclosures. For the NUC, and this. Now this is smaller, but it also contains only a graphics card. Check this out, their actually, not that dissimilar in terms of their width. freaking cool. Now, thermals and acoustics, that's a question for the full review. Bottom line the idea here, is that you've got a complete computer, that not only can have the graphics card quickly a easily upgraded, but can even have the entire computer-ness, quickly and easily upgraded, on a PCI Express 16x interface. So that as new GPU's come out, you could replace that. And as new CPU's come out, or new platforms come out with new features that you care about, you could go ahead and replace that. It's got like, some fixed IO, because the front is sort of, you know, prefab, there's nothing you can really do to replace that. But the rear is all totally modular. So whatever they could put on a dual slot PCI backplate, they could theoretically put in the NUC. Hopefully you guys enjoyed this unboxing and first look. Make sure you subscribe to ShortCircuit, and also make sure you check out Linus Tech Tips for the full review.",
    "transcript_keywords": [
        "graphics card",
        "PCI Express",
        "Extreme Kit ended",
        "card",
        "Power",
        "Linus Tech Tips",
        "time Intel showed",
        "Extreme Kit",
        "power supply",
        "PCI Express power",
        "PCI",
        "graphics",
        "thing",
        "slot",
        "Express",
        "PCI Express PHY",
        "Linus Tech",
        "Tech Tips",
        "front",
        "time Intel"
    ],
    "transcript_entity_values": [
        "CES",
        "Linus Tech Tips",
        "the NUC 9 Extreme Kit",
        "Core",
        "NUC",
        "a year ago",
        "GTX",
        "Thunderbolt",
        "Intel Wireless",
        "Intel",
        "IO",
        "three",
        "380",
        "AF",
        "8x",
        "One",
        "RAM",
        "Thunderbolt",
        "one",
        "USB",
        "Kingston KC200",
        "this year",
        "64",
        "2070",
        "SODIMM",
        "Thunderbolt 3",
        "Watt",
        "16x",
        "2060",
        "the Linus Tech Tips",
        "80",
        "Thunderbolt GPU",
        "LAN",
        "first",
        "these days",
        "PCI Express",
        "FSP",
        "16",
        "two",
        "1080",
        "80 millimeter",
        "NUC",
        "four",
        "4x",
        "GPU",
        "500",
        "45",
        "AUROS",
        "MacBook Pro",
        "PCI",
        "Linus",
        "ShortCircuit",
        "SD",
        "six",
        "CPU",
        "PCB",
        "ASUS",
        "Optane 905P.",
        "9980-HK",
        "zero",
        "SSD"
    ],
    "transcript_entity_types": [
        "ORG",
        "WORK_OF_ART",
        "LAW",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}