{
    "id": "v8HY38VDRS8",
    "title": "Facetime on Android, BABY!",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-06-08T01:47:58Z",
    "video_url": "https://www.youtube.com/watch?v=v8HY38VDRS8",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Apple",
        "WWDC",
        "iOS 15",
        "iPadOS 15",
        "macOS Monterey",
        "Homekit",
        "Facetime",
        "Facetime Android",
        "Facetime Windows",
        "Universal Control",
        "iCloud Plus",
        "watchOS",
        "keynote",
        "Worldwide Developer Conference",
        "WWDC 2021",
        "WWDC21",
        "Tim Cook",
        "Craig Federighi",
        "web app"
    ],
    "views": 445464,
    "likes": 28975,
    "comments_count": 973,
    "description": "Check out the new Drop x Sennheiser PC38X at    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      Timestamps: 0:00 thank u for watching 0:08 Apple WWDC 2021 1:26 Dell to fix disabled RTX 3070 cores 2:21 El Salvador to adopt Bitcoin? 3:16 Drop PC38X Gaming Headset 3:56 QUICK BITS 4:04 Apple fixes M1 SSD issue 4:23 Google changing after settlement 4:53 Stadia on Chromecast with Google TV 5:20 Nest Hub browser 5:48 Jeff Bezos IN SPAAACE  NEWS SOURCES  WHAT WHAT? DONT CARE   Facetime  Focus   IDs   iPadOS  iCloud plus  Universal Control    CORE EXPERIENCE Dell will fix disabled cores on RTX 3070 laptops      REPUBLIC CREDITS NO GOOD HERE President of El Salvador wants to make Bitcoin legal tender       QUICK BITS  BUT ITS NOT A NEW MACBOOK Apple fixes M1 Mac SSD wear issue      THE LAW WON Google actually changing ad platform because of France antitrust settlement     STADIA. STILL A THING Chromecast with Google getting Stadia June 23rd    BACK TO THE FUCHSIA Google Nest Hubs have a browser and keyboard now    BROZOS BEFORE HOZOS  Jeff Bezos flying to space in his own rocket     ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:   #Apple #WWDC #Facetime",
    "description_links": [
        "https://dro.ps/tl-pc38x-21",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://www.youtube.com/watch?v=0TD96VTf0Xs",
        "https://www.theverge.com/2021/6/7/22522889/apple-facetime-android-windows-web-ios-15-wwdc",
        "https://twitter.com/TechLinkedYT/status/1401953508945920000",
        "https://appleinsider.com/articles/21/06/07/apple-wallet-will-support-ids-and-drivers-licenses-in-ios-15",
        "https://ca.finance.yahoo.com/news/ipad-os-15-wwdc-2021-multitasking-widgets-update-175058732.html",
        "https://www.macworld.com/article/348153/icloud-plus-privacy-security-account-recovery-legacy-contact-homekit-paid-storage-tiers.html",
        "https://www.gsmarena.com/apple_releases_macos_monterey_with_universal_control_and_shortcuts-news-49501.php",
        "https://www.kitguru.net/channel/generaltech/matthew-wilson/dell-to-update-alienware-m15-laptop-after-users-discover-disabled-cores-on-rtx-3070/",
        "https://www.reddit.com/r/Alienware/comments/nqrfgh/software_issue_or_dell_selling_reduced_core_rtx/?sort=new",
        "http://forum.notebookreview.com/threads/official-alienware-m15-ryzen-r5-owners-lounge.835745/page-19",
        "https://linustechtips.com/topic/1345168-el-salvador-wants-to-make-btc-legal-tender/",
        "https://twitter.com/nayibbukele/status/1401335885497524226",
        "https://www.bbc.co.uk/news/world-latin-america-57373058",
        "https://linustechtips.com/topic/1345320-apples-new-macos-update-reportedly-fixes-ssd-wear-issue-on-m1-macs/",
        "https://www.tomshardware.com/news/apple-fixes-ssd-wear-out-reporting-issues",
        "https://www.reuters.com/technology/french-watchdog-fines-google-220-mln-euros-abuse-market-power-ad-business-2021-06-07/",
        "https://www.nytimes.com/2021/06/07/technology/google-france-antitrust-ads.html",
        "https://www.eurogamer.net/articles/2021-06-07-stadia-finally-adds-chromecast-with-google-tv-support-this-month",
        "https://www.cnet.com/news/google-stadia-heads-to-chromecast-with-google-tv-android-tv-devices-on-june-23/",
        "https://9to5google.com/2021/06/07/google-nest-hub-max-keyboard/",
        "https://9to5google.com/2021/06/07/google-nest-hub-max-keyboard/#jp-carousel-431287",
        "https://arstechnica.com/science/2021/06/jeff-bezos-says-he-will-fly-into-space-next-month/",
        "https://www.instagram.com/p/CP0MSOqnYEo/?utm_source=ig_web_copy_link",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Look, do you need to know about what kind of tech stuff happened three times a week? - [Male] Yes. Yes. Yes. - Okay. Apple's worldwide developer conference kicked off this morning with a keynote, which itself kicked off with a number of skits about how developers thought it would kick off. But for me, the real kickoff moment was when Apple announced that Android and Windows users could join FaceTime calls now through a browser. - [Male] Bye bye zoom. - I'm never using it again. Now we're not good enough to have an app, but web apps are actually great. And in fact, Apple has forced some innovation here by blocking game streaming apps from the iOS app store. So they had to make web apps so you don't even need an app anyways, web apps are great. Other stuff that was announced, include focus modes which are basically customizable do not disturb profiles. Apple Wallet, supports IDs like driver's licenses now and iPad iOS is getting home screen widgets and better multitasking. iCloud plus is a new subscription that will provide a VPN burner email addresses and more storage for home kit enabled security cameras and universal control on the new macOS Monterrey lets you drag content from an iPad to a Mac, to another Mac even with the same mouse. Very cool stuff to be sure Apple. But I was under the impression that we were gonna see a new Mac book today. So you know what? I'm not buying any of these free software updates for my Android phone and windows computers. I'm hurt. Dell has been dealing with complaints after people who bought the companies Alienware m15 R5 discovered that the laptops RTX 3070 had a handful of CUDA cores disabled. And by handful, I mean 512. So I mean, it depends on your, my hand can't hold that smaller than average. That's a Linus joke. The mobile RTX 3070 is supposed to have 5,120 cores but the ones in these laptops only had 4,608. What is this? A poor people's laptop. Apparently this was an actual error and not a shady attempt by Dell to skimp on performance or power draw. Although it might still be that I'm not Dell. I can't say. - [Male] I'm Dell. - Hi, I'm Dell. Regardless Dell has said it's an issue with the notebooks V BIOS and will be issuing an update to fix the problem soon. Try installing macOS Monterey see if it helps. And cryptocurrencies have had some real ups and downs lately, but one person who hasn't lost faith in the dream is the president of El Salvador. James Stripe. - [Male] I see (Riley laughing) - You're crypto guy, right? That's why I said that. Do you know about him? - [Husky Male] He's scrappy. - Is he? - [[Husky Male] Scrappy Yeah. - Oh, I didn't know that. Apparently this guy's sketchy. I didn't know this when writing the story, keep it in mind. All right. He's drafting legislation that would make Bitcoin legal tender in the country, which would make the central American country, the first in the world to officially adopt a cryptocurrency. If the legislation gets backing from Congress the president says, 'it could open up financial services to the 77% of Salvadorans who don't have bank accounts.' I am now skeptical of this proposition. 'And make it easier for Salvadorans living abroad to send remittances back home which make up around 20% of the country's GDP.' So there it is. Maybe he just wants the money. Who is this guy? Now it's time for quick bits brought to you by the drop PC38X gaming headset made in collaboration with Sennheiser. It's got the same open back design from the PC37X, but with certain enhancements. The drivers, they've been re-tuned for higher fidelity and better frequency response. - [Husky Male] Enhance. - Driver impedance? That's now a 28 ohms bro. - [Husky Male] Enhance. - For use with gaming controllers and other low power devices. The headband? - [Male] Enhance. - Head suckers a new knit mesh that offers less heat retention and better comfort. Get a better headset that is- - [Male] Enhanced. - By the drop PC38X today at the link below. (male mumbles off screen) Oh, okay sorry. Stepped on your toes. Oh you weren't ready for the quick bit's. Oh no! A couple of months ago, some Mac users noticed the SSD in the M one Macs was undergoing a significant amount of wear that looked like it would shorten the drive's life. Well, Apple has now fixed the issue without ever acknowledging the problem. I guess they didn't think we'd catch them. Well, we did team and now you're in big trouble unless you fix it. Wait a second. Google has actually agreed to change the way it conducts its ad business after being forced to pay a fine of $268 million as part of a settlement over antitrust charges in France. It's the first time a lawsuit like this has actually made Google agree to change the way it does things and so I guess France should keep suing them. (male speaks in foreign language) Why did this lawsuit work? I mean, I guess French people can be kind of intimidating with their striped shirts like disorienting. It's like, ah, waving a bag at you. This isn't racist. (male speaks in foreign language) Google's finally bringing Stadia to the Chromecast with Google TV and while the amount of people cheering about this will be quite small, it's interesting to see mostly because the lack of Stadia support was a pretty weird emission when the new Chrome cast launched. I can almost feel Google's finger hovering above the shutdown Stadia button. They press the make Stadia better button this time but there, - [Male] It's an itchy finger. - However it's like the meme. We can put a meme in this show, right? In other Google product update news, the company's Nest Hubs smart home devices are finally getting an actual web browser and an onscreen keyboard instead of relying entirely on vocal interaction with the Google assistant for web searches. Ah, so this is why they installed Fuchsia OS on these things. They said it was gonna be the same at UI but I guess Fuchsia always comes with a little treat. They'll install it on other things. There'll be like a little thing you didn't expect. Little cat mini game. And Jeff Bezos. Bezos, Bozos is going to one up Elon Musk by taking a flight on a blue origin rocket with his brother. Not Elan's brother Jeff's brother. The richest man on earth is going up on July 20th. And I guess I, I hope he comes back. - [Male] He's never coming back right? - He's going to live on his private moon base. (male mumbles offscreen) (Riley laughing) That would be a great twist to this. Hey, I definitely hope you come back on Wednesday for more tech news because we're done here. You did great. You know, same thing next time. And we'll have this thing in the bag. (soft music) Really appreciate it.",
    "transcript_keywords": [
        "Dell",
        "Google",
        "Apple",
        "web apps",
        "Mac",
        "make",
        "web",
        "make web apps",
        "apps",
        "Stadia",
        "guess",
        "back",
        "stuff happened",
        "tech stuff happened",
        "app",
        "time",
        "home",
        "great",
        "people",
        "Apple Wallet"
    ],
    "transcript_entity_values": [
        "5,120",
        "A couple of months ago",
        "iPad",
        "French",
        "Stadia",
        "FaceTime",
        "Fuchsia",
        "Jeff Bezos",
        "iCloud",
        "4,608",
        "PC37X",
        "macOS Monterrey",
        "three",
        "the 77%",
        "France",
        "CUDA",
        "Riley",
        "one",
        "Google",
        "Chromecast",
        "Bezos",
        "3070",
        "Windows",
        "Congress",
        "second",
        "Elan",
        "Sennheiser",
        "American",
        "Jeff",
        "Chrome",
        "around 20%",
        "Macs",
        "Nest Hubs",
        "Alienware",
        "Apple Wallet",
        "James Stripe",
        "first",
        "28 ohms",
        "Salvadorans",
        "Google TV",
        "July 20th",
        "Android",
        "Elon Musk",
        "Wednesday",
        "El Salvador",
        "$268 million",
        "Mac",
        "512",
        "Bitcoin",
        "this morning",
        "Linus",
        "VPN",
        "iPad iOS",
        "Monterey",
        "Dell",
        "Apple",
        "today",
        "Fuchsia",
        "SSD",
        "UI"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "NORP",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "QUANTITY",
        "NORP",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "GPE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "NORP",
        "TIME",
        "PERSON",
        "ORG",
        "PRODUCT",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "ORG"
    ]
}