{
    "id": "vBnpGIZK9R0",
    "title": "Surface Laptop Studio Impressions: Windows 11 With a Twist!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2021-10-05T23:31:38Z",
    "video_url": "https://www.youtube.com/watch?v=vBnpGIZK9R0",
    "category": "Science & Technology",
    "tags": [
        "surface laptop",
        "surface studio",
        "surface laptop studio",
        "mkbhd",
        "MKBHD",
        "Microsoft Surface",
        "Microsoft Surface Laptop Studio",
        "Windows 11"
    ],
    "views": 3750512,
    "likes": 106266,
    "comments_count": 3924,
    "description": "Microsoft Surface Laptop Studio That shirt!  The Verge's Windows 11 Review:   Tech I'm using right now:   Intro Track: Jordyn Edmonds  Playlist of MKBHD Intro music:   Laptop provided by Microsoft for video.  ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://youtu.be/UnlqKXijyY4",
        "https://www.amazon.com/shop/MKBHD",
        "http://smarturl.it/jordynedmonds",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "- Hey, what's up? MKBHD here. And this laptop is kind of trying to be three things at once. Kind of. (upbeat music) So this is the Surface Laptop Studio. It's the Studio version of the Surface Laptop or the laptop version of the Surface Studio. I mean, it's both. Either way, it's an interesting idea, it's not completely unique, but it is kind of curious now to see this in Microsoft's own Surface lineup. We've been so busy with so many other reviews that this is the first time I'm really getting to check it out, but here we are. So the idea is you have three different modes with this form factor. You have the standard laptop setup. Then you have the halfway folded down easel setup, where you're covering the keyboard but you still have a trackpad and the touch screen. It's called Stage Mode. And then you have a completely folded flat tablet set up, all in one device. I guess it's like a three-in-one. So the idea is pretty cool, but every time I see something like this, my first thought is always, \"Okay, what do you use each mode for?\" So of course the laptop mode, that's the most familiar, right? It's the Surface Laptop Studio for reason. It's perfectly capable of that. You've got a 3 x 2 aspect ratio like other Surface devices, which is really nice for taller applications and multitasking in Windows 11 here. And then when you pull the laptop towards you, and wanna put it in this sort of easel position, you sort of pop the bottom of the laptop out from the magnets and then, it naturally sort of wants to land on some more magnets in this 45-degree position, in this easel stand mode. It's the only angle that you can set it up at. Now, this always happens, whenever I go, \"Well, who would wanna use something like this? I mean, it's cool that it can do it, but who would use it like this?\" And then everyone who does use it like this comes out of the woodwork and loves to explain exactly how. But I'm just gonna say from my own use of laptops, there's only a couple reasons I would want a laptop to be folded over covering the keyboard but still having the trackpad like this. So it is a touch screen, and of course you still have access to the trackpad, but yeah, the way it's sitting kind of reminds me of an iPad in a folio case. This is fine for watching videos or watching movies, also gaming with a controller, which I've seen a lot of in there as with this guy, and any touch-first apps. Now there are Android apps coming to Windows 11 and those don't work as of yet, but they should be in an update soon. But if you do have touch-first apps, they'll work here. The screen also definitely wobbles a lot less and feels much more sturdy at this sort of anchored angle as you touch the display with your finger. But, also, yeah, there aren't that many touch-first apps that I use, and I'll get more to the app situation in a second. Anyway, lastly, you can just pop it open and fold it completely flat, and it's a tablet. It's not necessarily as fun to hold and use like an iPad or even a Surface Pro, but when it's totally flat, there's a tablet. This would be your full-time touchscreen interaction, and where a lot of your use of the new Surface Slim Pen 2 would come into play. It doesn't sit totally flat, but from what I hear, a lot of artists would like it to be slightly prepped up because it's easier to sketch on like that. So the idea, I really like, I think it's pretty cool. You could even maybe get away with watching a video not at perfectly 45 degrees if you want it to. But, yeah, you might've heard of the Acer ConceptD or the HP Elite Folio. This is more of like this Surface refined version of those ideas. But even at that, I've noticed this version does have some weird build quality issues. So, of course, when this thing is in full on laptop mode, the screen portion is a bit thicker than a normal laptop. It's way better than previous Surfaces where the whole computer is up top, but you can see it's still thicker than a normal single screen because it's two layers instead of one for the hinge mechanics. And that's fine; you barely ever have to look at that. But the air gap around the outside of this display, I noticed, is very inconsistent. I can see little gaps all the way around the screen that I just wanted to squeeze shut. I thought that was really odd. But the rest of the hardware is pretty solid. It's the magnesium and aluminum casing that's very rigid. And if we're being kind of honest, it looks a bit like a Double Decker MacBook Pro type thing. So the silver is the only color, and it's got this top level, which is pretty slim, and it's the full width all the way around and has all the ports. Then the bottom piece here is a smaller inset, but it obviously gives it much more internal volume. So when it's just sitting on a desk, it kind of gives this illusion of a thinner laptop that's kind of hovering slightly off your desk, depending on your lighting. Honestly, I don't mind it. I do hate the ports layout, though, on this thing. For all the positioning as a creator-focused laptop and something creative professionals will use, it's like a MacBook Pro. Every creative professional I know, I think all of them, use an SD card for something at some point. No SD card reader on this laptop. And then there's only two USB-C ports on the side here with a Surface Connect Port and headphone jack on the other side. Now I'm happy to say that those two USB-C ports are Thunderbolt 4. That's awesome for data transfer so my SD card reader dongle will be fast as ever, but that leaves one port left for a mouse or any accessory I might use. Not amazing. But the rest of the design and fundamentals are definitely here, especially with just the hardware. It's very rigid. Even the keyboard itself is pretty nice. So there's just a tiny bit of board flex, but the keys themselves are very clicky and well laid out. I haven't gotten a chance to test the battery yet since I haven't had it for long enough, but I have noticed the trackpad is really nice. This is something I was hoping to see more of with Windows 11 and more well optimized Surface devices, and I am very impressed with the trackpad's responsiveness and the haptic feedback. Honestly, it's on MacBook level for me. It's reached that level, which is especially helped by the fact that the display is also 120 hertz. Love that. Even the webcam is pretty good. It's only 2 megapixels, but it's 1080p. So I guess I'm only saying this because of how low the standards have been set, but, hey, it's really quite decent with colors and exposure. I will say, though, the one let down was definitely the speakers. Not a whole lot of room to have great speakers in this anyway, but there's no grills anywhere. It sounds to me like the sound is coming from the keyboard and from the side vents. Either way, there's almost no bass. If you care about good speakers on a laptop, this ain't it. But anyway, Microsoft has this laptop starting at 1,599, and that's kind of where it starts to fall apart a little bit. Because, first of all, I don't think you'd ever want this spec without the dedicated GPU. So that means you're looking at at least $2,100 and that'll get you the Core i7, 16 gigs of RAM, half a terabyte of SSD, and the NVIDIA GeForce RTX 3050 Ti. And again, haven't had it for very long, haven't even run any benchmarks, but we know that's a decently capable CPU and GPU. But in the AMD world, there's stuff dramatically outperforming this, and even the GPU is not super powerful. The one upside is if you do wanna go the external GPU route, which some people do with their laptop, you do have Thunderbolt 4. But, yeah, this doesn't have the highest end specs in the world. So, one of my favorite Surfaces ever was Surface Laptop 3, the matte black version. And whenever I would consider using a Surface Book or something else that would sort of convert into a two-in-one, the question was always, \"Okay, am I gonna use the tablet version? Am I gonna use the laptop version? Is it worth getting something slightly worse at each to have both?\" So then this Surface Laptop Studio has a slightly different proposition, which is in the name. You've probably heard about the Surface Studio by now, the all-in-one desktop PC that tilts down dramatically into this easel position for all kinds of pen art and drafting and things like that. So this laptop brings that third form factor on the go, but unlike the desktop, tilting it down like this immediately covers the keyboard, which probably makes the new Slim Pen 2 a pretty mandatory accessory if you're gonna get one of these. Now, again, if you know me, I'm not the greatest artist in the world, I'll admit, but I can still appreciate a good responsive pen. And while this definitely isn't Apple Pencil levels of responsive, it is very usable, and it adds some interesting features like a small vibration motor in the pen to simulate the feeling of writing on actual paper. Which I don't know if it feels exactly like paper so much as I can feel the pen vibrate a little bit when changing directions. And it sort of feels like it adds a bit of a texture with certain tools, but nevertheless, it really works well with this laptop. It's got the shortcut button, it's got the side button, and whenever you're done using it, you can just snap it underneath the front lip of the laptop where it charges and lives with a very strong magnet. You basically just slide the pen in upside down, and it is strong, and it is not going anywhere. You kind of have to peel it back off. Now, here's the fun part. If you do slide it in the wrong way, right side up, it kind of misses the laptop, then all you got to do is just lift it up and it snaps into place. It's very satisfying. So look, there's gonna be a ton of new Windows 11 machines, laptops coming out over the next weeks and months, and they're all gonna have different focuses. Some will have much better performance than this one, some will have better screens, some will have more ports, of course, but the theoretical advantage to the Surface one is support, this design, and the Pen. Windows 11 has treated me pretty well for a couple of days with the new start menu and the new animations and window controls for multitasking. I like those a lot. Also, I noticed the touch targets get slightly larger and a little further apart when it detects that you're going out of laptop mode, but it's also got a lot of weird quirks and missing UI features. I would highly recommend watching The Verge's full Windows 11 review video on their channel. I'll link it below since I generally don't do desktop OS reviews. But, yeah, they cover a lot of stuff. And as Windows 11 improves, this whole laptop will too. So I didn't get this laptop expecting to recommend it to most people. It's obviously for a smaller group who will find this easel thing useful or who will find this pen useful. But I'm also glad it exists. Where else are you gonna find a laptop with a design like this, with a double Decker layer to it like this, and with this cool hinge? It's just a lot of cool stuff going on. So that's been it. Thanks for watching. And definitely get subscribed here if you haven't already to be among the first to see what is coming up. You're not gonna wanna miss it. Catch you guys in the next one. Peace. (upbeat music) Hey, What's up? MKBHD here. And this laptop... (pen clatters) Hey, What's up? MKBHD here. And this laptop... (pen clatters) Oh, it didn't. And this laptop... Oh-oh, and this laptop is trying to be... And this laptop... (pen clatters) And this laptop... (pen clatters) Hey, What's up? MKBHD here. And this laptop... (pen clatters) (man laughs)",
    "transcript_keywords": [
        "Surface Laptop Studio",
        "laptop",
        "Surface Laptop",
        "Surface",
        "Laptop Studio",
        "Surface Studio",
        "laptop mode",
        "Surface Slim Pen",
        "kind",
        "Studio",
        "Pen",
        "Windows",
        "lot",
        "Surface devices",
        "pretty",
        "laptop version",
        "Surface Connect Port",
        "Mode",
        "Surface Pro",
        "version"
    ],
    "transcript_entity_values": [
        "45-degree",
        "three",
        "Stage Mode",
        "Surface Laptop 3",
        "the next weeks",
        "one",
        "iPad",
        "3050",
        "a couple of days",
        "Thunderbolt 4",
        "only 2 megapixels",
        "a MacBook Pro",
        "Windows 11",
        "third",
        "Core",
        "UI",
        "Android",
        "the Surface Laptop Studio",
        "The Verge's",
        "half",
        "first",
        "USB-C",
        "MacBook Pro",
        "3",
        "Windows 11",
        "at least $2,100",
        "the Surface Laptop",
        "the HP Elite Folio",
        "SD",
        "NVIDIA",
        "this Surface Laptop Studio",
        "Microsoft",
        "Slim Pen 2",
        "45 degrees",
        "1,599",
        "GPU",
        "months",
        "Acer",
        "Thunderbolt 4",
        "MacBook",
        "120 hertz",
        "second",
        "the Surface Studio",
        "RAM",
        "CPU",
        "Apple Pencil",
        "a Surface Book",
        "jack",
        "only two",
        "16",
        "two",
        "AMD",
        "Decker",
        "SSD",
        "2",
        "Surface"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "EVENT",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "WORK_OF_ART",
        "LAW",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "FAC",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}