{
    "id": "vBquse_KAdI",
    "title": "One Year Solar Update! - Is Do it Yourself Solar worth it?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-04-20T13:15:02Z",
    "video_url": "https://www.youtube.com/watch?v=vBquse_KAdI",
    "category": "Howto & Style",
    "tags": [
        "Solar",
        "solar panels",
        "DIY solar",
        "how to install solar",
        "is solar worth it",
        "is solar green",
        "solar energy",
        "tesla solar",
        "tesla roof",
        "residential solar",
        "grid tied solar",
        "what is solar energy",
        "off grid",
        "solar power",
        "diy solar generator",
        "one year update",
        "does solar work",
        "are solar panels worth it",
        "diy solar",
        "Anker",
        "Powerhouse",
        "PowerhouseII800"
    ],
    "views": 2082442,
    "likes": 80415,
    "comments_count": 4347,
    "description": "Today is the one year update on my Solar Panels! Grab your Anker Power House II 800 HERE:  ($100 Discount Code: JRE1750111) Installing my own solar panels was something I wanted to do for a long time. Its an expensive first investment, BUT has pretty incentivizing long term payout. Plus... its healthy for the planet. Win win win. The install video is here:   HERE is the $250 dollar discount for your own DIY Solar Kit:   HERE is the $100 dollar discount for Tesla Solar:   Solar panel energy payback time:   Attempt any DIY project at your own risk. Follow local code. Working with electricity can be dangerous.   Get my razor knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://ankerfast.club/3fs23Lt",
        "https://youtu.be/jSa1tvrrFZg",
        "https://www.solarwholesale.com/jerryrigeverything",
        "https://ts.la/zack10701",
        "https://www.recgroup.com/sites/default/files/documents/wp_-_recs_leading_energy_payback_time.pdf",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "[Music] So today marks one year since I've installed these solar panels on the roof of my house. Today we're going to see how much energy they've produced and see if solar is really worth it. We'll see if they really are the magical black rectangles that can take the sun and turn it into free energy. Cuz, I mean, saving the world with green energy is pretty great. But, saving money is also pretty great. And making money is even better. So one very quick and easy way of harvesting the power from the sun. If you're not ready to go for a whole home system just yet, here's one of these guys. This is a Power House II 800 from my channel's sponsor Anker. It's a monster of a battery and has the ability to charge up with a portable solar panel. It's a more portable system of course, but it's got enough battery to charge your smartphone 55 times, or keep a mini fridge powered for about 10 hours. The Power House II 800 has 11 independent ports on the front that can all be utilized at the same time, without sacrificing power to the others. You can see the incoming and outgoing power consumption right here on the screen. The Power House II is portable, durable, and can charge up pretty much anything with a plug. And it won't cost an arm and a leg. Anker's been kind enough to give us $100 off of this guy with a link down in the description. It's great for apartments, RVs, or renting, since we know whole home solar is more of a long term gig. Speaking of which, let's get started. [Intro] So to recap, behind me I have an 8 kilowatt system installed on my roof. And don't let the weird words like kilowatt throw you off, it's just an easier way of saying 8,000 watts. I installed them myself to save money. There's a company called Solar Wholesale that sends you a giant kit with everything you need, including the hardest part, which is all the instructions and paperwork that you need to file and get a permit from your city, which most cities are going to require. You know how some DIY projects are easier with instructions? Well that's what this kit does. It included a plan set that was specifically designed for my house and made the whole process quite a bit easier. I'll be talking a lot during this video, but remember everything that I mentioned will have links in the description. The installation process took a couple guys and about a weekend to install. But we started down here at the roof by putting in these rails which are adjustable and can fit any size panels. Then we plopped the panels on top, and then each of the panels are connected to little micro inverters with all of the electrical cables running to this box right here, which puts it down inside of my attic. The micro inverters are what change the power from DC, which is what the panels create, into AC, which is the alternating current that my house can use. The AC wires are thinner and easier to work with. And then that power running down into my attic comes out here in this junction box, which ties together the two arrays that I have installed. An array means a section of solar panels, and to maximize my roof space, I wanted to have two sections. But every house is going to be different depending on your layout and how much solar you actually want. Then where the two panels combined, it comes down here to this junction box where both arrays are joined together. And then over here we have a manual disconnect. Remember, this is a scissor switch that I can just flip and it disconnects the solar panels from the rest of my system. And this is also where the solar lines run into my house into the breaker panel. And I'll let you watch the install video to see how this part was done. Basically the inverters from underneath the panels, with those wires running through the roof and down the outside of the house, are connected into this breaker box with this breaker here, and are feeding my house with that solar energy. And then, of course, we have an app that shows how much energy my panels are producing throughout the day. You can see here in the morning when the sun just comes out, and then we peak over here right about that 8,000 watts. Remember, my system is an 8 kilowatt system. So you can see on this day it was pretty sunny, we made quite a bit of energy. If we go back a day...this day was a little more cloudy and we made about half as much energy because anytime clouds pass over the solar panels, they are unable to see the sun and don't make as much energy. And over here we have the kilowatt hours which is what the energy company uses to calculate how much energy you produce and how much energy you use. And that's how we're going to calculate how much money my panels have saved me. Here in Utah it's about 10 cents per kilowatt hour. Every city and every state is going to have a slightly different price for that kilowatt hour of energy. So you're going to have to look yours up and see what it is, unless, of course, you live in Texas...nobody knows what's going on in Texas. Another thing to keep in mind is that all of my panels are facing south, meaning they are always facing the sun. If your panels are going to be mounted in an area where they are only facing the sunrise or the sunset, they are going to be making significantly less power than if they were facing the sun the entire time. Another question I've gotten a lot about the solar panels is how often do you have to clean them. And in the past year I've only cleaned my panels one time after a massive dust storm. I should probably rinse them off a little more often because the cleaner they are the more efficient they are. I didn't get any footage of me cleaning my own panels, but my buddy Dan has solar on his house and he just connected a hose to a brush attachment and you can wash them from the ground. It's pretty simple. Another question I get is how much maintenance is there on the panels after they've been installed. And that one's easy, there is zero maintenance. I have not touched a single wire on this setup since we finished a year ago. Now the wires underneath the panels are supposed to be all tucked up touching the roof, and after the past year, some of them are dipping down a little bit. So I should probably get in there and just zip tie them up to the panels again. But other than that it's a set it and forget it type of situation. Now that we've discussed the panels, how they work and how to calculate the savings, let's get into the numbers a little bit. So last year I paid $13,300 for this setup. There was a federal and state tax incentive that I did take advantage of, which brought my price down to $8,243. That 26% federal tax credit is still in place right now and valid till 2022, which means that you too can still take advantage of it. And you might be thinking to yourself, 'Hey Jerry, that's a lot of money, but is it worth it?' And the answer is yes. Last year I calculated that my system would make about 12,000 kilowatt hours worth of energy, which, since energy here in Utah is about 10 cents per kilowatt hour, would save me about $1,200 in electricity And I was a bit conservative in my estimate just in case we had a lot of cloudy days or a lot of snow throughout the year. The amount of energy we were actually able to reduce is actually a little bit more. In the last year we were able to generate about 13,140 kilowatt hours worth of energy, which is enough energy to drive an electric car around the globe twice...assuming cars can drive on water. I averaged about 34.7 kilowatt hours of energy production a day. And since my local price for that kilowatt hour of energy is about 10 cents, I ended up saving $1,314 on my electricity bill. About. And spread out over the course of the year, it's daily savings of about $3.60, or about $100 a month. How long will it take my panels to pay themselves off entirely. Well remember, they cost about $8,000 after the government incentives. Assuming everything stays the same, my panels will pay themselves off in a little over 6 years...well 5 years now since it's already been a year. And that might seem like a long time, but remember these panels are guaranteed to retain 80% of their energy producing abilities for the next 30 years. And after those next 6 years are up and my panels are paid off, it's like I have a little employee just sitting on my roof making me an extra $100 a month for the next 25 years. Rise and shine. The sun is up and it's time to get to work. And I mean, saving the planet is pretty cool and all, but free money is also pretty cool, and I'm making the sun my employee. Now you'll probably see someone who hasn't watched this far in the video leaving a comment saying solar panels take so much energy to create that they'll never actually be green. And that might have been true 20 years ago, but since solar panels are being adopted so widely across the globe, the process of manufacturing them is becoming extremely efficient. Anything made on a large scale or at quantity becomes much cheaper and efficient to produce. So solar panels made now only take one to two years to offset the energy it took to produce them in the first place. So solar panels are still most definitely green. Someone asked what I would do differently if I had to start all over again. And I do wish I had more panels, but I've used up all the convenient real estate on my roof available. I didn't really want to get into the sunrise or sunset facing panels just because they don't make as much as the panels facing directly towards the sun. And eventually I do want to add a battery system because right now any extra energy I produce during the day flows out to the grid and then I get 90% of that energy back at night since the grid is acting like my battery. Every city and state is going to be slightly different with how they handle the excess energy. Some will even pay you for your extra. But, Utah just stores it and gives 90% of it back. The problem with batteries right now is just that they are super expensive and not cost effective to install...for me, anyway. Fun little tangent...the average home in the United States uses about 28.9 kilowatt hours of energy every single day. So if you do the math, a 100 kilowatt Tesla battery, you know, inside of an electric car, can power a home for almost 3 days. And I'm pretty sure eventually electric cars, instead of just taking power from your home, will also be able to give it back. That will be the real game changer. We just need our buddy Elon to allow vehicle to grid connectivity. One of the reasons my solar panels were so inexpensive is because I did install them myself. And even with a kit from Solar Wholesale, it was a massive undertaking, but still doable. To sweeten the deal a little bit, I'll leave a $250 discount for Solar Wholesale down in the video description. But if getting on your roof and installing your own solar panels isn't your thing, Tesla was one of the lowest bidders when I was pricing out other options. And I'll leave a $100 discount for Tesla Solar as well in the video description. It's a little bit more expensive because someone is installing it for you, but someone is installing it for you. But shop around. Solar's booming all over the place and there might be cheaper options. I'll probably pin some yearly updates down in the comments below so you can check out my energy production and savings. As well as, you know, 29 years from now I'll make another follow up video to see if my panels are still at 80% capacity...you know, the longest durability test ever. So hit the subscribe button so you don't miss that one. And the links for everything I talked about today are also in the video description, everything from that simple Power House all the way up to a house size do it yourself solar kit. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "solar panels",
        "panels",
        "solar",
        "energy",
        "house",
        "Power House",
        "power",
        "kilowatt",
        "year",
        "kilowatt hours",
        "years",
        "Solar Wholesale",
        "roof",
        "sun",
        "pretty",
        "system",
        "bit",
        "solar panels made",
        "portable solar panel",
        "day"
    ],
    "transcript_entity_values": [
        "a little over 6 years",
        "29 years",
        "two",
        "5 years",
        "100",
        "zero",
        "the United States",
        "250",
        "first",
        "a year",
        "a year ago",
        "13,300",
        "about 12,000 kilowatt hours",
        "Tesla Solar",
        "the last year",
        "the day",
        "about $1,200",
        "the next 30 years",
        "every single day",
        "The Power House II",
        "the year",
        "about half",
        "Jerry",
        "almost 3 days",
        "AC",
        "55",
        "night",
        "the past year",
        "90%",
        "daily",
        "Elon",
        "Tesla",
        "last year",
        "8 kilowatt",
        "Utah",
        "one to two years",
        "one",
        "the next 25 years",
        "2022",
        "that kilowatt hour",
        "Solar",
        "80%",
        "Instagram",
        "1,314",
        "about $8,000",
        "about 34.7 kilowatt hours",
        "this day",
        "DC",
        "DIY",
        "about 10 cents",
        "11",
        "one year",
        "about 10 hours",
        "about $100",
        "20 years ago",
        "an extra $100",
        "One",
        "26%",
        "Twitter",
        "Anker",
        "days",
        "Texas",
        "kilowatt",
        "about $3.60",
        "about 28.9 kilowatt hours",
        "us $100",
        "about 13,140 kilowatt hours",
        "Last year",
        "the kilowatt hours",
        "8,000 watts",
        "8,243",
        "today",
        "those next 6 years",
        "Power House",
        "Today",
        "Dan",
        "Solar Wholesale",
        "100 kilowatt"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "GPE",
        "MONEY",
        "ORDINAL",
        "DATE",
        "DATE",
        "MONEY",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE",
        "PERCENT",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "QUANTITY",
        "GPE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "TIME",
        "ORG",
        "PERCENT",
        "ORG",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "DATE",
        "GPE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "TIME",
        "MONEY",
        "DATE",
        "MONEY",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "DATE",
        "TIME",
        "QUANTITY",
        "MONEY",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY"
    ]
}