{
    "id": "VD7mTsFZ3g8",
    "title": "I'm gonna need a bigger desk! 4K HP Envy All-in-One Unboxing",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-09-22T22:32:26Z",
    "video_url": "https://www.youtube.com/watch?v=VD7mTsFZ3g8",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 1154731,
    "likes": 28528,
    "comments_count": 1709,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and today we are unboxing the HP Envy all-in-one. And the box is actually too large to put on the table so it's right here. A huge thank you to HP and Intel were partnering with me on this video. Let's get into the unboxing. Oh boy! Oh boy! This display is huge, it's 31.5 inches and it is 4K, which is super exciting. (cardboard scraps) (mellow music) (boxes thump on table) (polystyrene scraps on cardboard) Look at that! Ooh! Hey, can you just let me be like? (upbeat music) Wow. Okay, the box was huge. This display is huge. It has a built in speaker. And the thing I'm most excited to try out, is this little bottom mount right here. You guys, it's a wireless charger. Brilliant! (plastic crinkles) Okay, this is still. (laughs) It's still taking up the whole desk, it's so huge. I'm gonna put it on this little side table and see how that works out. While I unbox the rest of these accessories. (mellow music) (cardboard scratching on desk) Ach, I love when batteries are included. (unwrapping noises continue) (box bangs on the floor) (plastic crinkles) Oh, this is nice. (keys clacking) I love having a full keyboard. I use the number pad, so much more than I ever realized when I don't have one. I always go (finger thuds) Also has this little tray, I feel like that would be kinda cool to put your phone or a book. Oh yeah! Oh that's prefect. I love this so much because when I'm doing live Streams and stuff, I like to actually have the chat on my phone. (plastic crinkles) We've got our mouse. Also Bluetooth. I do like, that this has batteries, you can also get rechargeable ones, if you like. But I do like that this doesn't have any cables. You don't have to charge it, you can use it just like this, no cables, no nothing. This is fantastic. In you go. (plastic clicks) Well that's it. (mouse slides on desk and keys clack) (fingers click on mouse) I'm doing business. (keys continue to clack) Hey, Justine, what are you doing? Business! We're got one more box. (box slides across desk) (cardboard scraps and plastic crinkles) Oh this is, this beefy power adapter. (plastic crinkles) Oh! Has memory card reader. Thank you. Thank you. Thank you! Let's get this thing set up and talk about some specs. This features 32GB of RAM, 1TB solo stage hive and NVIDIA GeForce, GGX 16 50 graphics card. It has a 10th Gen intel Core i7, 2.9GHz processor. That redefines what's possible in a thin and light computer. SSD is with intel obtain memory deliver the best real world performance compared to non-SSDs. It has easy access to the ports. A built in powerful Bang & Olufsen speaker and wireless charging. There's a pop up privacy camera, it's 19 20P, with an 88 degree wide angle field of view. And a microphone that is only enabled when it's in use. This display is amazing. It's a 4K, 31.5 inch display, with wide color gamma HTR, UHD and anti-reflective coating. Basically, this thing looks incredible. (upbeat music) So, I've been using this computer for the past couple of few days and I absolutely love it. One of the things that I'm most excited about is this pop-up camera. I use this to do video calls, I also used it to due a test Stream. Everything all-in-one. Microphone, video. Am I live now? I need to move some stuff around in the background. I tried to hide it all. You guys are seeing it. Hold on a second. (notification music sounds) Oh what you all. That scared me! Now Streaming live. We've got our chat here, everyone's excited. And I haven't Streamed in a while, so they are probably like what are you doing, where are you? (laughs) (mellow music) This is now going to be a permanent part of our podcast set. We've been looking for a solution to be able to record our audio, have a screens that we would be able to see our notes and a way to bring in audio and video of our guests. So because this is able to be moved around, we have a little desk set up in front of our podcast desk. So I can have this set up at an actual desk when I'm doing work or playing games. And then just pick it up and move it in front of the podcast desk. It's so great because this Stream is so huge that we're able to see the screen, see our guests and I can actually hit record. We can see our notes and keyboard and mouse, matches the podcast desk. So my sister and I, can both search for things while we're talking because this is wireless. So we're able to have no cords or wires and it looks neat in the video potion of the podcasts, as well. You can't see it right here because it's off camera and if you listen to audio, you can't see it. But I'm doing a video, this review for this HP all-in-one computer. It's amazing and we have it sitting right next to the camera. It's like a huge screen, so if we want to search for something, we've got a little mouse, we've got a keyboard. - Yeah this is great, though our notes for today, it basically just says podcast, episode 12. And then it's completely blank. (laughs) So we don't have many notes. (upbeat music) - There's so many little details that I love about this computer. The fact I can just. (phone thumps) Oh, look my phone's charging. Such a great idea! They really did put a lot of thought into some of the smaller details. Like even this base is like a nice wood finish. And there's some little accents around here to just make it look really pretty. The speakers are incredibly loud. I was very shocked when I first tested it out. Let me find some royalty free music for you guys, so you can get a little demo. (upbeat sting music) Even though it's loud. Stuck in my mind - There isn't much distortion, so it still sounds really good. (laughing) So the next thing I know - So loud. Held you in my arms and asked you what we should do What should we do - There's nothing I love more than a good royalty free track. (mellow music) Podcast episode 13, this is cool cause I share this with my sister and she'll be able to also make edits and know, so for the next episode of the podcast, we'll be, way more prepared. It's great because the SD card slot is right here on the left. In addition to a headphone port and there's an easily accessible USB port over here on the right, as well. So I'm gonna edit myself a nice photo, for Instagram. This was so fun, I wanna go back and edit this. This is a raw image. Add a little grain to it. Yeah, that looks cool. Here's one of me and my sister. Oh yeah. That's cool. Here's another one of us. Let me save this. So I can post it on Instagram. We also got some really cool drone shots. I mean this monitor just looks amazing. It's so crisp. (mellow music continues) What a fun trip. This does have a anti-reflective screen. Which is really nice, especially if you're working in places with a lot of sunlight. We have a lot of studio lights in here right now, so you might be able to see a little bit of reflections. But having this on here, does get rid of a lot of them. And here's our podcast that we recorded. So it's really great because we're able to just have this off to the side and I'm able to see everything that's happening. There have been some times, when we were recording before that we weren't sure we were actually recording because I wasn't able to see. So now this monitor is so huge, if we are not recording I'm gonna know about it. [Recording] Interesting. I just burped, I, you were like just said something well look at this. Look at this. - I'll put a link in the description where you can check out all of the options for the HPNV32. I do have a specced out version, do depending on where you do get this, the configurations may vary. But this thing has been so amazing. I've been using it for some many different things. Gaming, podcasting, editing photos. And the screen just really does look incredible. Guys, have any other questions about this or anything I talked about in this video, feel free to leave them in the comments below. Again a huge thank you to HP and Intel for sponsoring this video. You guys are awesome and I will see you all in the next video. (upbeat music) Oh! Ho ho ho! That was actually shocking I did it!",
    "transcript_keywords": [
        "huge",
        "Envy allinone",
        "video",
        "podcast",
        "Envy",
        "love",
        "guys",
        "podcast desk",
        "desk",
        "thing",
        "put",
        "great",
        "Intel",
        "cool",
        "display",
        "screen",
        "set",
        "notes",
        "lot",
        "computer"
    ],
    "transcript_entity_values": [
        "SSD",
        "Stream",
        "Intel",
        "88 degree",
        "second",
        "intel",
        "12",
        "one",
        "HTR",
        "Justine",
        "Streaming",
        "TB",
        "32",
        "HP",
        "4",
        "Instagram",
        "16 50",
        "13",
        "10th",
        "the past couple of few days",
        "19 20P",
        "Stream",
        "Bang & Olufsen",
        "RAM",
        "31.5 inch",
        "SD",
        "2.9GHz",
        "today",
        "31.5 inches",
        "first",
        "Ho ho ho",
        "UHD",
        "USB",
        "NVIDIA GeForce",
        "1",
        "GB",
        "Ach",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL"
    ]
}