{
    "id": "vDnMiwlDlog",
    "title": "The Weirdest One Yet?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-05-23T19:40:55Z",
    "video_url": "https://www.youtube.com/watch?v=vDnMiwlDlog",
    "category": "Science & Technology",
    "tags": [
        "iphone case",
        "iphone",
        "iphone cases",
        "case",
        "cases",
        "iphone 6",
        "iphone 6 case",
        "iphone 6s case",
        "iphone 6s",
        "iphone 6 plus case",
        "iphone 6s plus case",
        "6s plus",
        "6 plus",
        "best iphone case",
        "apple",
        "tech",
        "technology",
        "unboxtherapy",
        "unbox therapy",
        "iphone 7",
        "iphone se",
        "iphone 5",
        "iphone 5s",
        "in1",
        "in1 case",
        "multi tool",
        "in1 iphone",
        "review",
        "unboxing",
        "iphone 6s plus",
        "best",
        "6s",
        "smartphone",
        "new",
        "samsung",
        "test",
        "android",
        "apple iphone",
        "phone",
        "galaxy",
        "plus",
        "vs",
        "apple inc. (publisher)",
        "apple iphone 6s",
        "gadgets",
        "s7",
        "top"
    ],
    "views": 1564193,
    "likes": 30067,
    "comments_count": 1853,
    "description": "TODAY'S MYSTERY VIDEO -   IN1 Multi Tool Case for iPhone -   I've looked at many strange iPhone cases over the years but the IN1 multi tool case may be the weirdest yet. It combines tools in a similar fashion to a swiss army knife, except in this case they live inside a phone case. The model featured here works with the iPhone 6, iPhone 6 Plus, iPhone 6s and iPhone 6s Plus.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/AWCfN8OmSvE",
        "http://amzn.to/1TTrswm",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys? Lew here back with another video and today I've got a weird kind of case. Well, you've seen a few different weird cases. This one might take the cake, though as they say. Do they say that? \"Take the cake\"? The champion takes the cake? gets the cake. Everyone else, what do they get? Pie? You're not here for pie ice cream or cake. You're here for tech and gadgets and that's what we've got for you today This case is like a Swiss Army knife in the form of a case. Look at this thing! In one case! It's all in one case! Get it? They make this for the iPhone 6, 6 Plus I think they even make it for the 5, I don't even need this knife If you're kind of a gadget head, Inspector Gadget type that was one of my favorite shows growing up, it's probably why I got into this business in the first place. You never wanna be caught off guard without your tools here, you have tools. Woah. You = Awesome Us = Grateful. That heart's a little weird. Does the shape of that heart makes you feel uncomfortable, Jack? Alright, we have an iPhone, what is this? a 6S Plus? That's it! Instant handy-man right there. You're some kind of secret agent-type dude. Ready for anything Oh, you need me to pick a lock? I got you. So it's a little bit thicker than I expected if you know what I mean, it is not crazy, you are just holding a bunch of tools in it You still have access to all your ports on the bottom. Let's check out some of these tools Woah, is there a technique here that I'm missing? Holy fingernail! Issues That one comes out easily, maybe it's a thumb. Yeah, it's a thumb. I didn't realize how much stronger the thumb scenario-- What is this? A toothpick! I love it! Mmm... Stimulating the gums. They say you're supposed to stimulate the gums, Jack! What else do we got? OK What is this guy all about? Woah! That's a pen! That's a pen, Jack! Look at that! Emergency pen! I need this one when I'm filling out forms in an airplane and stuff. Flathead screwdriver? Phillips? 'Mini-little Phillips. That's good for opening up gadgets. and then some bigger boys. What is that? Is that a file? Looks like a file. Woah! Tweezers! This is seriously like a Swiss Army knife in a case. Oh! Yes! Little scissors! Yeah! Woah! You can do it! They work. Uh, a bottle opener? That's a bottle opener. Right? Get that on there. Pop it open. 'Just noticed that it also appears to have a stand on it. Look at that. Well, yeah. This-- Why not? I mean, we got all the tools in there. Let's put a stand on it. You're at lunch now, you've got Unbox Therapy on the phone. You're in between-- pretending you're MacGyver. Remember MacGyver, Jack? In one multitool utility case, for the dude who never wants to be caught off guard, you'll always have the answer with this case, no matter what the question. Oh, ****.",
    "transcript_keywords": [
        "case",
        "cake",
        "Jack",
        "Woah",
        "Swiss Army knife",
        "Swiss Army",
        "tools",
        "weird",
        "Army knife",
        "kind",
        "knife",
        "pen",
        "weird cases",
        "Yeah",
        "thumb",
        "Swiss",
        "Army",
        "gadget",
        "Phillips",
        "Inspector Gadget"
    ],
    "transcript_entity_values": [
        "MacGyver",
        "the iPhone 6",
        "Lew",
        "today",
        "first",
        "Flathead",
        "Swiss Army",
        "Phillips",
        "iPhone",
        "Phillips",
        "5",
        "Inspector Gadget",
        "Jack",
        "one"
    ],
    "transcript_entity_types": [
        "ORG",
        "EVENT",
        "PERSON",
        "DATE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL"
    ]
}