{
    "id": "VdV8DMtxdzo",
    "title": "You Don't HAVE To Use Windows...",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-04-28T17:41:53Z",
    "video_url": "https://www.youtube.com/watch?v=VdV8DMtxdzo",
    "category": "Science & Technology",
    "tags": [],
    "views": 552162,
    "likes": 25530,
    "comments_count": 2295,
    "description": "The first 200 people who head to  will get 20% off their annual premium subscription of Brilliant.  What are some operating systems other than Windows, Mac, and Linux?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://brilliant.org/techquickie/",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Windows, macOS or Linux, if you use a desktop or laptop computer, you're probably using one of these three operating systems. But, did you know that they don't have the market completely cornered? There are in fact alternatives you can use on your PC right now. ReactOS is a good place to start if you're a Windows user and don't want to dive into something completely unfamiliar. It started all the way back in 1996, and was intended to be a clone of Windows 95 with \"react\", referring to how the project was meant to be a reaction to Microsoft's market dominance. ReactOS looks and feels a lot like Windows and has much of the same functionality. Many Windows applications run on it without needing extra layers of emulation. (suspensful tone) Hold on a minute, if it's so much like Windows, wouldn't Microsoft try to shut it down due to copyright infringement? Well the folks behind ReactOS avoided running afoul of the law using a technique called clean-room reverse engineering. Basically, they're taking the code apart, looking at it and then writing their own code, which is based on it, but not the same. One unattended side affect of this approach is that ReactOS exists in perpetual alpha state with features several generations behind the current version of Windows, along with very shaky hardware support. But it's free, so if you only needed it for some basic tasks and you have a deathly allergy to Linux, it might be worth checking out or maybe not. I think Microsoft hasn't gone after it, because they just don't see it as a serious threat. Up next, let's talk about Haiku, free and open source, it's not a Japanese poem based on BeOS. BeOS was an operating system originally designed for power PCs CPUs. The same ones Apple used before 2005. The idea was to have a media editing optimized OS intended to run on the Mac. One small problem though, Apple decided not to buy BeOS's parent company so instead the project was modified to work on Intel and AMDX86 processors instead. By this point though, they had a much bigger problem, Windows had already dominated the X86 space. BeOS was ultimately bought by the same people who brought you the Palm Pilot, who also did not do much with it. So Haiku was born, yay! An open source reimplementation of BeOS that's still being updated to this day. Haiku is currently in beta and might not be a bad option if you're looking to accomplish simpler tasks with it. There are a number of apps written specifically for it. You can download from a dedicated package manager, similar to desktop distributions of Linux. Despite it's circa 2000 retro look, it can render modern web pages properly if you're looking just to browse the web. Hardware support is hit or miss, but it runs on even low spec systems, so it's quite light weight, just like a real Haiku. To wrap up today's episode, we've got FreeBSD, based on the Berkeley Software Distribution, that is where the got the BSD from and also the name of my new hippie rock band. The original BSD was based on Unix, a famous OS developed in the early 70's, that gained popularity due to it's portability. And it could be used on different types of hardware configurations which was uncommon at the time. BSD ended up becoming common to work stations and later FreeBSD became a popular open source descendant that's much more than just an alternative desktop operating system. In fact, iOS, macOS and the software for the newer version of the Play Station, all incorporate large amount of FreeBSD's code base. There are a couple of other places you might have seen FreeBSD or even used it before without knowing it. Both FreeNAS, a free network storage operating system with ZFS support and pfSense, which you can use to transform your commodity computer hardware into your own network router are based off FreeBSD. And although FreeBSD has tons of other application, you can still use it as a desktop operating system. And it's a lot more refined than Haiku and ReactOS, for whatever that's worth. Now your Nan isn't going to be installing at anytime soon. It doesn't even come with a graphical interface by default, but that doesn't mean that you're completely out of luck if you're a novice. There are FreeBSD based solutions, such as FuryBSD, name of your sex tape and GhostBSD that come with their own GUIs. Is there another alternative OS that you're interested in? Let us know in the comments, and we'll see if we can cover it in a future episode. Now, if you'll excuse me I've got an urge to get my HD DVDs and Betamax tapes. Brilliant's mission is to help people achieve their learning goals. So whether you're a student, a professional brushing up on learning cutting edge topics or just someone that wants to understand the world better. You should check out Brilliant. Set a goal to improve yourself a little bit everyday. Brilliant makes that easy with interactive explorations and a mobile app that you can use on the go. Check out their new course introduction to neural networks, where you can learn about the feedback processes that underlie the most cutting edge artificial intelligence technologies. Learn through a game that challenges you to find a key in a messy room, guided by feedback that helps you adjust your strategies, similar to a real digital neural network. If you want to build your problem solving skills, then get Brilliant's premium to learn something new every day. Brilliant's thought-provoking math, science and computer science content helps guide you to mastery by taking complex concepts and breaking them into bite-sized, understandable chunks. First 200 people to head to Brilliant.org/techquickie will get 20% off their annual premium subscription. Well thanks for watching guys, get subscribed and I'm off to apparently get HD DVDs.",
    "transcript_keywords": [
        "Windows",
        "operating system",
        "FreeBSD",
        "Haiku",
        "based",
        "ReactOS",
        "Brilliant",
        "desktop operating system",
        "BeOS",
        "operating",
        "Microsoft",
        "Linux",
        "Windows applications run",
        "system",
        "market completely cornered",
        "BSD",
        "Windows user",
        "Microsoft market dominance",
        "desktop",
        "laptop computer"
    ],
    "transcript_entity_values": [
        "iOS",
        "the Play Station",
        "the Palm Pilot",
        "Betamax",
        "Intel",
        "AMDX86",
        "three",
        "One",
        "BSD",
        "BeOS",
        "one",
        "circa 2000",
        "BeOS",
        "20%",
        "this day",
        "2005",
        "Windows",
        "Windows",
        "Japanese",
        "200",
        "FreeBSD",
        "Microsoft",
        "Linux",
        "annual",
        "1996",
        "the early 70's",
        "BeOS",
        "Windows 95",
        "the Berkeley Software Distribution",
        "Nan",
        "Mac",
        "a minute",
        "FreeBSD",
        "Apple",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PERCENT",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "DATE"
    ]
}