{
    "id": "VeLKqjvmFvQ",
    "title": "Mi Mix Drop Test - How durable is a Ceramic Phone?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-11-17T13:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=VeLKqjvmFvQ",
    "category": "Howto & Style",
    "tags": [
        "Mi Mix Drop Test",
        "Xiaomi Mi Mix",
        "Drop test mi mix",
        "Mi max drop test",
        "Ceramic drop test",
        "Ceramic phone",
        "how durable is the Mi Mix",
        "Drop test",
        "Xiaomi",
        "Mi Mix",
        "Ceramic Xiaomi",
        "Ceramic phones damaged by drop",
        "JerryRigEverything",
        "bezel-less phone drop test"
    ],
    "views": 2779075,
    "likes": 35033,
    "comments_count": 2346,
    "description": "The Ceramic Xiaomi Mi Mix is the first ceramic phone that I have tested on my channel. Considering I have tested almost 50 phones already, it makes me curious to see how this one handles life. The Mi Mix passed my normal durability test with flying colors... But can it withstand a normal drop? I start with a 6 inch drop, move up to one foot, and then 2 feet (knee height) to see what kind of damage gravity can inflict on the ceramic body.   If the phone cracks at knee height... what would a pocket height drop do to it?  Mi Mix TEARDOWN is HERE:  Mi Mix Durability test is HERE:   This video was filmed mostly with a Samsung Galaxy S7 Edge. A Google Pixel was used for Slow motion along with an iPhone 7 plus.  My favorite flexible tripod:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/m5MkZC1uRZY",
        "https://youtu.be/_CZj-l9MJmg",
        "http://amzn.to/2fZz80H",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "[Intro] So I dont normally do drop tests on my YouTube channel but today Im going to make an exception. Its not that I dont like breaking phones quite the opposite in fact. I love breaking phones. Its just with drop tests theyre so unpredictable and it really just depends on how the phone drops. But since this Mi Mix is made of ceramic, an entirely new material that I havent tested before, Im curious to see how it holds up against the drop. As we saw from my previous durability test, this ceramic is a level 8 on Mohs Scale of Hardness; almost impossible to scratch with every day objects. But lets see how it holds up to a drop. In front of me I have the Mi Mix in completely 100 percent working condition. I have the Google Pixel right here and the iPhone 7 Plus and Im going to drop the phone right there in the middle. Im going to start with the drop test just a couple inches above the ground, probably about 6 inches, and just drop it straight back down onto the ceramic. Three, two, one. (Boom shakalaka) [Classical Music playing] And there is not even a mark on the back of this phone or the front. Right now were about a foot above the ground. Im going to drop it in three... two... one... (The sound of my wallet cringing) [Classical Music playing] So even with a foot drop onto concrete, were still at no scratches on the front or the back. So Im going to try something new. Im going to sit here on this bench and absent mindedly put my phone on my knee and then Im going to stand up and let the phone fall off onto the ground. [Classical Music playing] That one hit hard right on the corner, since it was resting on my knee. Lets see what happens. Oh that corner looks bad. So you can see the corner right there. There are pieces completely missing out of it because of that ceramic. Its so hard and so brittle that the chunk flew right out of it. And then we have two cracks going all the way through the length of the screen from corner to corner pretty much. So from that top right all the way down to the bottom left. So the phone is still working but the corner of the phone is definitely destroyed purely because of the brittleness of the ceramic. There are also two huge cracks running diagonally along the length of the screen, but even if I can replace the screen, the frame of the phone is a goner. Its kind of a bad idea on Xiaomis part to put two super brittle objects, glass and ceramic, right next to each other with no buffer between them. If they would have even put a thin layer of rubber or some kind of cushion between the two, at least the screen wouldnt have cracked, just the frame would have damage. So today we learned that the phone can be permanently damaged and disfigured from a super small, 2 foot fall. The easiest way to prevent this kind of damage is either to never drop your phone, or put your phone inside of a case. Yeah, a case will cover up the beautiful ceramic, but your phone will be a little bit safer. My Instagram followers got to see a preview of this drop test before the video went live on YouTube. So if you want to stay ahead of the curve, follow me there. And hit that subscribe button if you enjoy seeing technology reviewed from the inside. Thanks for watching! Ill see you around.",
    "transcript_keywords": [
        "drop",
        "phone",
        "make an exception",
        "ceramic",
        "drop tests",
        "drop test",
        "corner",
        "breaking phones",
        "phone drops",
        "test",
        "screen",
        "put",
        "love breaking phones",
        "Scale of Hardness",
        "Mohs Scale",
        "Mix",
        "phones",
        "ground",
        "front",
        "back"
    ],
    "transcript_entity_values": [
        "100 percent",
        "just a couple inches",
        "today",
        "two",
        "Xiaomis",
        "three",
        "the iPhone 7",
        "about 6 inches",
        "YouTube",
        "one",
        "2 foot",
        "YouTube",
        "Three",
        "this Mi Mix",
        "about a foot",
        "8",
        "the Mi Mix",
        "Instagram"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "TIME",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "FAC",
        "ORG"
    ]
}