{
    "id": "VeLvdE8lNW4",
    "title": "The Odd History of the SD Logo",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2019-01-21T15:09:02Z",
    "video_url": "https://www.youtube.com/watch?v=VeLvdE8lNW4",
    "category": "Science & Technology",
    "tags": [
        "SD",
        "secure digital",
        "memory card",
        "toshiba",
        "super density disc",
        "SDHC",
        "SDXC",
        "SDUC",
        "flash memory",
        "SD card"
    ],
    "views": 1094818,
    "likes": 48126,
    "comments_count": 2359,
    "description": "You can support this channel on Patreon! Link below    So, whats the deal with the D? Why is it all, disclike? Last I checked, SD cards werent any sort of disc. Whats going on? In this video, we find out.  Links n stuff  Technology Connections on Twitter:   The TC Subreddit (I promise I do go there sometimes)   The DVDs success over Laserdisc   LightScribe:   You can support this channel on Patreon! It has been amazing what Patreon has done for this channel, but also for me (your dorky host) personally. Through the support of people just like you, Technology Connections has become my job and I am so excited and thankful for it! If youd like to join the fine folks in a pledge to help the channel grow, please check out my Patreon page. Thank you for your consideration!   And thank you to the following Patrons! Jib Systems, Lars Kuur, Alan Nise, Matt Dancer, Andrew Rosenwinkel, Fran Rogers, Tero Janhunen, Bob B, Mike Noe, Alan Smith, Philip Cosgrove, Joshua Doades, Andreas Lunderhage, Ennex The Fox, LEONARD PEZZANO, Steve Kralik,  , Hank Eskin, Kirill Polstainen, Felix Winkelnkemper, Christopher Lawhead, BoostCookie, 98abaile, JustWusky, Dan Jones, Exilis, Till Bockemhl, Owen O Byrne, Project A118, Charles, Sebastian Sparrer, timeslapsey, George Stamoulis, Paul Moffat, Linh Pham, Laria, Michael Greb, Max, Alessandro Robert Nilsen, Ryan Benson, fussel, Brannan Barber, Jonathan Haas, Neil Forker, Vincent Beetle, Warmo, James Pinakis, Bruce Davis, Conor Kileen, Johnni Winther, Marke Hesse, Brian M Knoblock, Sean Sandercock, Robert Wolfanger, Cannon Fodder, Andre van Soest, lululombard, Nicholas Boccio, Armando Fox, Nelson, bluegoose, Kajico, Jason Hughes, Eli Krumholz, Angelo van der Sijpt, William Evans, Philip, Martin, X39, Richard Lantz, Dustin Crain, Gideon Rigger, Oliver Lee, AJay Janschewitz, Lennart Sorensen, Mitch Radoll, Viorel, Betsy Ecklund, Reachan Kekeis, Loh Phat, Vivian Pypher, Torin Zaugg, John Donaldson, Brandon Whiting, Robert Tait, Zachary Hazlett, Nathan Blubagh, Joel, Peter Stewart, Liam OFlynn, Russell Brower, Brannan Barber, Patrick Barry, Tyler, Robin Johnsen, Brian Wolman, Deryn Rouge, Ed Green, Eric, Phia Westfall, Markus Schumacher, Besenyei Adam, Colin Grimshaw, Mats Svardal, Shannon Potter, Jeremy Hastings, Mark Wayt, Jose Miguel Castillo, Matthew Reynolds, Andrew Mertzenich, John Lavalle, Dave Howlett, Matthew E. Cooper, Sonic the Anonymous Hedgehog (nice), Guilherme Vieira Dutra, Lee Tustain, Nathan Bruer, Lauren Hahn, Scott Rowland, Will Wren, Weird shortwave listener, kalleboo, Colin Hill, William Gray, Vaughn B., Sven Slootweg, Braden McDorman, Stephen Bank, Matthew Walster, Julien Oster, Joseph Dufour, Dr. Bjoern Bieber, Anders Enger Jensen, Phil Sowers, Juan Molinari, Jake Hickman, Trae Palmer, Ray, Robert McCullough, Gary Hampson, Lennart Rosam, Chris Wallace, Matt Shea, PJ Gunasekera, Justin Teixeira, Charles Zilinski, Aaron Helton, Michael Holmes, Reto Jost, Ken Schafer, Thomas Beaver, AwesomeGuy64, Trey Harris, Benjamin Kier, Fredrik Grufman, Peter Pfundstein, Carlos V, Wilhelm Screamer, Jeffrey Frasure, Mat Stu, RYAN NGOGLIA, R_T, Harald E. Westlie, Charlycobra, Thomas Kolanus, Jeff Bigs, Brett Morgan, Isabell Reine, William Kisley, Daniel Johnson, Jesse Kempf, Tyler DeWitt, Reemt Rhmkorf,Jack Nichol, Robin Rattay, Mikko Wilson, Bruce Justyn, Timothy Honiss, Rae McIntosh, Mathieu Vignau, Justin D, Adam Zawisza, Thomas Ausweger, Kyle Joynt, Matthew Holder, shawnski, Max Barnash, Microfrost, MrSonicOSG, William Bevans, rusty shakelford, Tim Alston, Mitch Schenk, Burak Laciner, Juan Oliveras, Charles Ball, Robert Holt, Mikhail Lavrentyev, Mike Bird, Vance Vagell, Emmett Ray, Michael Shaffer, Tianyu Ge, blaluu, Taylor Martin, Racecar378, Steve Trambert, Sputnik  Dont see your name?  Dont worry!  To keep this little perk alive, the $5 patron shoutout is now on a rotating basis!  If youre not here, you should be here in one of the next two or three videos.  If youve slipped through the cracks, dont hesitate to send me a message via Patreon and Ill fix it!",
    "description_links": [
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://youtu.be/cvwuAKi1ZB4",
        "https://youtu.be/40hJStzsBm8",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "In todays world of rapidly developing technology, there are an ever-increasing number of technical standards and formats. And every time a new format is created, its creators suddenly find themselves tasked with figuring out some way of distinguishing this format from all the other ones. Now, often times you can use simple physical characteristics, but that doesnt necessarily indicate what the format is. For example, compact discs and DVDs look virtually identical, and while an eagle-eyed person obsessed with technological trivia can figure out the differences soon enough, it helps to create some sort of logo. This logo isnt just there for identification purposes, either. In its traditional use, it signifies compatibility with the technical specifications of the format. For example, the venerable VHS cassette. This mark isnt simply descriptive. It appears on all videocassette recorders that use the VHS specifications, it appears on all videocassettes that use the VHS specifications, and it doesnt appear on cassettes or recorders that dont use the VHS specifications. So, even though a quarter of a century passed between the manufacture of these two machines, because they both have that little logo on it, we can rest assured that a recording made with this machine will play on this machine, and vice versa. And thats the point to these labels. Every format has some sort of mark for compatibility. The Compact Disc logo indicates compatibility with Compact Disc players, and if I might add I think that this logo is starting to dip into the retro-cool category. Something about it is just a delightful mix of futuristic, retro, and wholesome... *stares off into distance and gets distracted* Anyway, yes this logo would get little additions underneath it to distinguish all the various versions of CD that eventually came about, but youll find this Compact Disc mark on any player designed to play them. Just match up the symbol on the disc with the symbol on the player and youll be sure of compatibility. Same goes for DVD. Does this disc have the DVD logo? Well, so does your player. Same goes for USB. Do you see the pitchfork of knowledge? Then thats a USB device. Of course, thunderbolt over USB-C (along with power delivery) is making this increasingly more confusing but lets hope we get that sorted soon. And while were at it, thanks to Pioneer and their near-complete dominance over the format, we call these things Laserdiscs without realizing that LaserDisc, and in particular this logo, is what Pioneer decided to brand their players and discs following the Laservision videodisc standard. Guys, Im trying to demonstrate the usefulness of these symbols and here you are mucking it up. The designers (and patent holders) of whatever system were talking about create these symbols not only to demonstrate compatibility for the benefit of consumers, but also to enforce it from manufactures and collect those sweet, sweet licensing fees in the process. [ upbeat promotional music ] Do YOU want to manufacture compact disc players? Sweet! Just pay us an exorbitant fee, and then well give you the knowledge you need to build your CD player! Then, well charge you a few dollars for each player you make, and then, and ONLY then, can you put our coveted little logo on it! It does protect consumers, I guess, but most importantly it makes us MONEY! And it wasnt just players. As recently as 2001, Sony and Philips were collecting royalty fees for discs, too. At that time, Philips got 1.8 cents per disc, and Sony got 1.2 cents per disc. That might not seem like much, but considering how many copies of albums were being sold, thats still plenty huge. For example, Linkin Parks debut album Hybrid Theory sold 27 million copies worldwide, meaning that Philips made nearly half a million dollars, and Sony raked in $324,000. So while this little logo may seem like a simple compatibility mark, it was also a serious money maker. But now we come to the meat and potatoes of this video; SD cards. I think its safe to say that SD has come to prominence in the removable flash media market. And just like all the other standards both flash and otherwise, SD uses a logo to both ensure and enforce compatibility. SD stands for Secure Digital, although I prefer to think of it as Super Dope and the SD Association is who makes the rules. The SDA is way less in it for the money, as they are a nonprofit group and only charge $2,500 to join. As far as I can tell, they dont assess a fee to their members on a per-manufactured-card basis to use that logo. Their self-described function is as follows: The SD Association establishes the technical and specification standards for SD memory card applications, continuously promotes SD as the leading industry standard, and encourages the development of digital A/V, wireless communication, and digital networking products that utilize the many unique benefits of SD standards. Fun stuff. But, about that logo. Why is the D in SD... a disc? Im fairly confident that this isnt a disc, but Ill ask my sources. Is this a disc? No, its not a disc! Is this a disc? Yes all signs seem to indicate that this is indeed not a disc. Well, that settles it. Two out of two sources agree that this is not a disc. So, um, why is there a disc in the logo? Well, you know how sometimes a company announces that theyre gonna develop a thing, and then they put a lot of R&D effort into developing the thing, but it turns out that another set of companies is ALSO developing a thing, and now youve got a situation of two competing things? [crickets chirping] That happened in the developmental stages of DVD. Philips and Sony were backing an updated version of their very own Compact Disc, which they called the MultiMedia Compact Disc or MMCD. Meanwhile, all of these other manufacturers were backing a different kind of disc. That disc had a different name from MultiMedia Compact Disc. See, what makes DVDs able to store more data than a CD is that the pits are packed more densely. This new disc had a greater pit density than a CD. In fact, you might say its density was kinda super. It was a super density disc. SD! Toshiba designed this logo for use in the never realized Super Density disc. Ive mentioned this before in my video introducing the DVD and its murder of Laserdisc, but the creation of the DVD standard hinged on the aforementioned companies coming to an agreement on which format to use. This agreement was in large part forced by computer companies, who envisioned using this standard for data storage, and who didnt want to pick sides and wind up on the wrong one. [crickets chirping] When the companies agreed and morphed the competing standards into the one, the only, the glorious DVD, suddenly Toshiba had this useless logo that they designed sitting around. And, rather than be wasteful about it, they slapped it onto a new flash memory standard. Sandisk and Matsushita partnered with Toshiba, and the Secure Digital format was born. Just to add to the trivia, SD was essentially just a modification of the earlier MultiMediaCard (MMC), but support for DRM was added as part of its specifications. It is likely (though I have not confirmed it) that its name was chosen because it was designed to fit within the Secure Digital Music Initiative, which was essentially the record industrys last ditch effort to try and get tech companies to move away from MP3s and into a more locked down standard. It didnt work, but the name stuck anyway. From my perspective, it looks very much like Toshiba, having created this logo, set out to make a new memory card standard, and the Secure Digital Music Initiative just sort of fell into their laps. They designed it to work within that initiative, and if music were to be distributed on cards, it might be helpful to put a disc in the logo because, you know, thats what music used to go on. Anyway, regardless of what exactly transpired, we do know for sure that this logo is a leftover. Perhaps youve never even noticed that the D is an optical disc. I didnt until I first read about it. And to be fair, many designs dont put the little lines through the D so its harder to make the connection. [Ding] But now that we all know, we can laugh at the follies of the past, and be thankful that the standard endures, with one unifying logo letting us know everything we need to. [sigh] Jeez guys, how many more revisions are you gonna go through? Wont you ever be satisfied! Isnt half a terabyte on your fingernail enough!? I mean really, weve got 4K TV now, how much more data are we gonna need? Why dont you just-- Thanks for watching, and I hope you enjoyed this little explanation of the mysterious disc in the discless format. Its not so much mysterious as much as it is a hand me down. The remains of a project long ago abandoned, but which ended up being useful after all. If a little thematically inconsistent. As always, thank you to everyone who supports the channel on Patreon, especially the fine folks you see scrolling up your screen. With the generous support of people like you, Technology Connections has changed from my weird little hobby to my actual job! And Im very grateful for your support. If you would like to support the channel with a pledge of your own, and get perks like early video access, occasional behind-the-scenes footage, as well as the inside scoop on the latest projects, please check out my Patreon page. Thank you for your consideration, and Ill see you next time! incomprehensibly smooth jazz [Sigh] I got about half-way through the script before I realized that the camera wasnt recording... and its a shame because there were some great bloopers in there. To my surprise, while going through DVDs to show the logo, I discovered that Disney DVDs dont actually use the official DVD logo. They use their own Disney DVD thing, which makes me wonder just how they made/make their DVDs. Are they correctly licensed and the DVD association (now One-red) just lets them use their own logo? I cant imagine Disney isnt being above board, but I wonder just how their own logo fits into the whole DVD ecosystem. Ya know? Thats prolly not a good use of that tense, and I didnt even write it so, like where did that come from? Thats a great question, Bertie. Pioneer decided to call these things Laserdiscs without realizing [really long pause] no. No (more ominously). And just like all the other standards, both flash and otherwise, SD-- people and their road rage, and interrupting my videos, just calm down people. The SDA is way-- eugh. The SDA-- Distinguising this formblabelleughth",
    "transcript_keywords": [
        "Compact Disc",
        "Disc",
        "logo",
        "Compact Disc players",
        "Compact Disc logo",
        "DVD",
        "MultiMedia Compact Disc",
        "compact",
        "Secure Digital",
        "DVD logo",
        "format",
        "Compact Disc mark",
        "super density disc",
        "VHS specifications",
        "Secure Digital Music",
        "DVDs",
        "Disc players",
        "standard",
        "manufacture compact disc",
        "Digital"
    ],
    "transcript_entity_values": [
        "USB",
        "27 million",
        "324,000",
        "Super Dope",
        "SDA",
        "Disney",
        "Laserdiscs",
        "DRM",
        "SD",
        "2,500",
        "a few dollars",
        "Sony",
        "two",
        "about half",
        "Laservision",
        "Super Density",
        "Sandisk",
        "MMCD",
        "the DVD association",
        "Patreon",
        "Bertie",
        "Pioneer",
        "SD",
        "VHS",
        "first",
        "Compact Disc",
        "one",
        "4",
        "Technology Connections",
        "Hybrid Theory",
        "2001",
        "The SD Association",
        "Toshiba",
        "the SD Association",
        "Secure Digital",
        "One",
        "a quarter of a century",
        "Two",
        "USB-C",
        "1.2 cents",
        "Linkin Parks",
        "1.8 cents",
        "the MultiMedia Compact Disc",
        "K TV",
        "The SDA-- Distinguising",
        "nearly half a million dollars",
        "Philips",
        "Compact Disc",
        "Matsushita"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "GPE",
        "MONEY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "MONEY",
        "LAW",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG"
    ]
}