{
    "id": "vgA4sUoKtAQ",
    "title": "Galaxy Note 20 and 20 Ultra: two very different phones",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-08-05T14:00:30Z",
    "video_url": "https://www.youtube.com/watch?v=vgA4sUoKtAQ",
    "category": "Science & Technology",
    "tags": [
        "samsung galaxy note 20",
        "galaxy note 20",
        "galaxy note",
        "samsung galaxy note",
        "samsung galaxy",
        "samsung",
        "galaxy",
        "note 20",
        "note",
        "note 10",
        "note 20 hands on",
        "note 20 first look",
        "hands on",
        "new samsung galaxy",
        "new samsung phone",
        "samsung galaxy phone",
        "new galaxy note",
        "samsung phone",
        "samsung galaxy note 20 event",
        "samsung galaxy event",
        "galaxy event",
        "event",
        "samsung event",
        "galaxy note 20 event",
        "note 20 event",
        "what to expect",
        "verge supercut",
        "technology",
        "gadgets",
        "tech",
        "verge",
        "the verge"
    ],
    "views": 498478,
    "likes": 9785,
    "comments_count": 958,
    "description": "Samsung's Galaxy Note 20 and the high-end Galaxy Note 20 Ultra are here. The Galaxy Note 20 Ultra is a spec beast with 5G, a huge screen, and a 50x zoom camera. The regular Note 20 is less impressive but still expensive. It starts at $999.99 while the Ultra is priced higher. Both are available for preorder and their release date is August 21st, 2020.  Learn more:   If you buy something from a Verge link, Vox Media may earn a commission. Seeour ethics policy:   Order the Galaxy Note 20 and Note 20 Ultra at Best Buy:   0:00 Intro 0:38 Similarities 1:10 Color options 1:39 Displays 2:26 Hardware 3:30 DeX, Wireless, S pen & more 3:58 Camera 5:20 Video 6:00 Battery life 6:15 Storage & Price 6:47 Remember when 7:30 The Note 20 Ultra though 7:51 Outro  Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/3i8si7Y",
        "http://bit.ly/2TQsqjB",
        "https://bit.ly/2PpWFdV",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "(smooth jazzy music) - So this week I spent an hour and a half with the Note 20 and the Note 20 Ultra, which we usually think of as Samsung's most souped up, powerful devices. But what became very clear to me wasn't the differences between this year's models and last year's models. It was the differences between the two models this year, and how in my mind, only one of these devices really earns that, oh gee, this is the most powerful phone, Note title. Let's get into it. (upbeat music) First, these phones do share some common features. So let's get those out of the way. The Note 20's both have S pens, of course, they both have a power button and volume markers on one side, they both have USBC ports on the bottom, and Samsung claims that both now have 25% brighter screens at peak brightness. And both devices come with Snapdragon 865 Plus processors, and they both support full 5G with both sub six and millimeter wave. But when it comes to pretty much every other hardware spec, their differences start to show. So the Note 20 comes in mystic bronze, mystic gray, and mystic green, while the Note 20 Ultra comes in mystic bronze, mystic black, and mystic white, that's right. I only saw the mystic bronze color of both of these phones, which is the only color they share. Now they have this great matte finish on them, and Samsung says that's, you know, gonna take away from all those fingerprints that we usually get on these phones. But I mean, for me, I film a lot of these phones, so I'm just happy that it's not like a straight mirror looking back at me for once. Now, let's talk displays. The Note 20 has a 6.7 inch FHD plus flat screen with a slight bezel and center hole punch camera, while the Ultra rocks a 6.9 inch WQHD plus edge screen with almost no bezels and a smaller camera hole punch. The Ultra also supports an adaptive 120 Hertz refresh rate, but only at HD plus resolution. Now personally, I'll take the 120 Hertz, even if it means a lower resolution, because well, a higher refresh rate is way more noticeable to me than a screen resolution. Am I the only one that's like disappointed by the 60 Hertz screen on the S 20? I mean like, 2020, this one's a thousand dollars. Should probably have 120 Hertz refresh rate. Maybe it's just me. Now looking at the Note 20 and the Note 20 Ultra, they look different. I mean, aside from the Ultra being physically bigger than the Note 20, the Note 20 is a bit more rounded on its top and bottom corners, and the rounded corners of the screen really drive that whole more rounded design home. And for the first time in this line, that design really differentiates the two models. But I mean, let me know what you think, but I always really dug the squared off look of the Note line. I mean, for starters, it looked more like a notebook. Gotcha. But also that edge display really hides the rails of the phone in such a nice way. It was kind of weird to see a Note looking like it belonged in the S line, but more on that later. Anyhow, both devices certainly still feel bulky with the Note 20 weighing in at 193 grams, and the Ultra coming in at 208 grams. Couple that weight with the size and well, with my small hands, it was almost impossible to do anything with just one hand, but that's standard for the Note line and me. Both devices, of course, support DeX, and this year they're getting the wireless glow up. So you'll be able to use DeX wirelessly with anything that supports Miracast. also Samsung Notes will sync with Outlook's One Note, and the S pen in these devices has the same accelerometer and gyroscope for motion controls, but with some new gestures. I didn't have a whole lot of time to test these out, so you'll have to tune into our full review in the coming weeks for more on that. But by far the most noticeable change in the Note line this year is it's camera array, and dudes like, staring at that camera array staring at you is intense, like camping. I can't help myself! Get it, like in tents, like camping, like tent. Let's run this down. Both phones have a 10 megapixel F 2.2 front facing camera. So the Note 20, you've got a 12 megapixel F 1.8 wide, a 64 megapixel F two tele with a hybrid 30 X zoom, and a 12 megapixel F 2.2 ultra wide. That's all fairly standard stuff. Now on the Note 20 Ultra, you've got an 108 megapixel F 1.8 wide, a 12 megapixel F three tele with five X optical zoom using this like sick Periscope design, and the Samsung space zoom going 50 X, and finally a 12 megapixel F 2.2 ultra wide. There's also a new laser auto focus sensor that comes as a welcomed improvement to the slow focus issues that totally plagued the S 20 Ultra's cameras. I can't wait to test that 50 X zoom out though, like, I couldn't really test it in the first look environment I was in because I simply wasn't far away enough from anything to see if it actually holds up. But overall, these cameras offer a wide variety of lens options that at this point we've come to expect from flagship phones. On the video side, both phones support four K 60 on the front facing camera, and around back they do eight K 24. And if you're a monster, they'll do eight K 30, but remember, you're a monster. I'm just so excited to put this camera to the test. I mean, every time a new phone comes out, I'm like, let's shoot a movie on this thing. And I have this series called Full-Frame where we talk anything and everything cameras. And I legitimately built a camera in the last episode. So if you didn't see that go watch me struggle. But also when I'm shooting Verge videos, I have totally taken to using phone footage in them. So eight K is a welcomed resolution for all the punching in I do. Pow, pow. Battery should hopefully not be a problem with these devices. Both have 45 watt fast charging that can charge up to 50% (Correction: The Note 20 and Note 20 Ultra support 25w charging) in a half hour, with the Note 20 using a 4,300 milliamp hour battery, and the Ultra coming in at 4,500 milliamp hours. The Note 20 Ultra comes with 128 gigabytes of storage with 12 gigabytes of ram for 1,299.99, or 512 gigabytes of storage and 12 gigabytes of ram for 1,449.99. The Note 20 is available with 128 gigabytes of storage and eight gigabytes of ram for 999.99, 999.99, 999.99, nine, nine, nine, nine, nine, nine, nine. (laughs) With pre-orders for both devices starting on August 6th, and shipping beginning on August 21st. So the Note 20 line, do you remember when the Note line was legitimately so souped up, it was fire? - And out of that stunning recall of Samsung's Galaxy Note seven. - [Announcer] Some of them were overheating and even catching fire. - I'm sorry, I just can't talk about a Note without thinking about the Note seven, but it also had decent specs, and well, that's the Note 20 Ultra, minus the fire, I hope. Now it just seems like Samsung uses this line to make minor fixes to the S line and add an S pen. I mean the Note 20 is almost spec for spec an S 20 plus, with actually a bit smaller battery and fair, the S 20 only has a Snapdragon 865, and not 865 Plus processor, but the Note 20 Ultra, that feels like a Note to me. I mean, those are the spec funds I expect to see in this line. So it seems like to me, if you're looking for the most specced out, bad-ass Samsung phone, the word to look for now is not Note, it's Ultra. Thanks so much for watching buds. I appreciate you, also, we're going to have a full review of the Note line coming hella soon, and we've got tons of coverage over on the site of everything Galaxy unpacks. So be sure to check that out. Anyway, be well, I hope that everyone around you is well, and that you are well, and that the world gets well real soon, and okay, that's it for me, bye buds.",
    "transcript_keywords": [
        "Note",
        "Note line",
        "Ultra",
        "Samsung Galaxy Note",
        "Samsung",
        "Samsung Notes",
        "line",
        "Note line coming",
        "camera",
        "devices",
        "phones",
        "mystic",
        "Galaxy Note",
        "ultra wide",
        "megapixel",
        "Ultra coming",
        "Hertz",
        "phone",
        "gigabytes",
        "Note title"
    ],
    "transcript_entity_values": [
        "193 grams",
        "Ultra",
        "DeX",
        "208 grams",
        "Miracast",
        "a thousand dollars",
        "865 Plus",
        "USBC",
        "the S 20",
        "the S pen",
        "only one",
        "this week",
        "Ultra",
        "4,300 milliamp hour",
        "4,500 milliamp hours",
        "30",
        "four",
        "eight gigabytes",
        "nine",
        "25w",
        "nine",
        "6.9 inch",
        "sub six and millimeter",
        "the coming weeks",
        "WQHD",
        "August 6th",
        "eight",
        "128 gigabytes",
        "year",
        "60",
        "5",
        "120",
        "August 21st",
        "2020",
        "Samsung Notes",
        "999.99",
        "20",
        "Hertz",
        "K",
        "FHD",
        "Samsung",
        "F 1.8",
        "F two",
        "F three",
        "25%",
        "two",
        "up to 50%",
        "Galaxy",
        "1,299.99",
        "a half hour",
        "12 megapixel",
        "this year",
        "64",
        "Outlook",
        "50",
        "an hour and a half",
        "6.7 inch",
        "five",
        "10 megapixel",
        "first",
        "45 watt",
        "F 2.2",
        "Galaxy Note",
        "512 gigabytes",
        "last year's",
        "1,449.99",
        "seven",
        "Full-Frame",
        "12 gigabytes",
        "First",
        "108 megapixel"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "NORP",
        "ORG",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "EVENT",
        "EVENT",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY"
    ]
}