{
    "id": "vgAtnNST7pg",
    "title": "The most POWERFUL MacBooks are HERE! M1 Pro and M1 Max!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-10-19T11:00:34Z",
    "video_url": "https://www.youtube.com/watch?v=vgAtnNST7pg",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 344191,
    "likes": 14035,
    "comments_count": 1259,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine from 2021. I promise you haven't accidentally clicked on to an old iJustine from the past I know this white wall may have thrown you off, but I'm actually in the process of moving to a new studio. So this is currently my temporary setup, but it's not what we're going to talk about today. Because today we are talking about the apple event that just happened and oh my goodness. So much was packed into this event. It wasn't even that long of an event. It was barely even a month ago that Apple released the new iPhone and then the new Apple watch. But guess what? This year is not over yet, Apple has announced a bunch of new things today. The biggest news from this event is that Apple has now released two new versions of their M one chip and two new MacBook pros. There were also a bunch of other announcements in the world of music, a new Apple Music plan, new colorful HomePod Minis and something that I'm extremely excited about. A brand new upgrade for the AirPods, not the AirPods pro the third generation of the AirPods. Also side note, before we really get into things during this event, Tim cook was actually, he was in a field. It looked like he was like all alone, just hanging out in front of Apple campus. But like John and Johnny and Craig, they're all inside, hanging out inside Apple campus, all comfy cozy. And then it looks like he's out there on a safari, like in the weeds. I didn't even think anything of it until I saw a couple of people on Twitter mention it. I was like, you're right. Why is he standing in some some tall high grass. So honestly Apple, like if you need someone to come by and mow your grass, like I would be happy to do it because I feel like I am going to need to take out a few extra jobs to pay for this fourth quarter of our new Apple gear that you all just dropped on us from the heavenly Apple gods above. So these new third generation of AirPods is actually a huge upgrade. I am such a huge fan of the original design of the AirPods. So when they announced this, I honestly was like freaking out because I still use my original AirPods. There's a new design, it's a new ergonomic shape, shorter stems. And they brought over the four sensor from the pros to these AirPods for more control. Now, both the case and the AirPods themselves have a new IPX for sweat and water resistance. And there's a new skin detect sensor. So they'll be able to sense if they're actually in your ear as opposed to a pocket or just sitting on a desk. It's also kind of interesting to note that the AirPods pro only have the IPX four rating on the earbuds themselves, not the actual case. So these brand new generation three AirPods, the case and the bugs themselves, are both IPX four rated. Now, as far as sound quality goes, they have this all new low distortion drivers that produce better base and cleaner highs, but they also now support Adaptive EQ, which they first introduced with the AirPods pro. So depending upon your environment, your ear shape, it will change the way that the audio sounds to make it as accurate as possible. Now, the case itself actually got a big upgrade, which now supports Mac safe and wireless charging. It will give you four full charges, in addition to the six hours of listening time on the new AirPods. Now this is a pretty big upgrade, but they are keeping the price the same at $179, and the second gen AirPods are getting a discount and will now cost $129 Now the AirPods pro are also now getting a max safe case, but the price is still staying the same at $249. There were some more music related announcements, including a new subscription plan for Apple Music and some new colorful HomePod Minis. Now I was a little bit confused about the voice plan when they first announced it it's half the price of the normal plan, but it basically limits you to only using voice commands with Siri to play music. So you won't be able to browse the Apple Music library on any of your devices. You won't be able to save the songs or make playlist, and it does not include support for spatial audio or lossless audio like the other plans. And it won't let you play audio on third party speaker systems like Sonos. That does seem like it's a lot of restrictions. If you think about it, this is only $4.99 a month, and this might be one of the least expensive streaming plans out of all of the streaming products out there. This could be the perfect plan for a lot of people who just want a casual listening experience. Plus you're still going to get the ad free access to Apple Music, radio 24/7 as well as hundreds of brand new mood and activity playlist. And I actually didn't even realize this, but I don't think that I ever even used the Apple Music app at all. I don't ever open it. I hardly ever use it. Most of the time I'm always asking Siri to just play music, to play nineties rock, to play a specific album, to play a specific song, a specific artist, or a lot of times I'll just be like, Hey, play a chill out playlist. So for scenarios like that, the voice plan is actually pretty perfect. That also would be pretty perfect to use with one of these new HomePod Minis. Now they didn't make any actual hardware updates, but they do now come in five colors. In addition to the white and space gray, you can now get a little HomePod in orange, yellow, and blue. Now I would have loved to have seen them do the entire iMac lineup color on these because that purple would have been in my shopping cart faster than you can say, \"M one max MacBook pro five\" five times fast. M one max pro, oh my god wait okay Let me think about this M one M one max pro Mac book M one it's a Mac book pro M one max pro shoot. Speaking of which let's move on to the new M one chips. Now we knew these new chips were coming eventually, but what we didn't know was what the final name would be. Now, Apple started this transition into using their own chips with the M one last year in the MacBook air, the 13 inch MacBook pro, and of course the MacMini. Now this M one 13 inch MacBook Pro is basically what I have run my entire business off of this past year. I have edited so many processor intensive videos on this. I've done massive 4k projects. I've even edited a bunch of AK videos on this thing. So to put that in perspective this year is the worst and one MacBook that they'll ever make. And it is the best MacBook that they've ever made. If that makes any sense to you. But what I'm trying to say is the thing is so incredible. And that was just making me get super hyped up for what the future of Apple Silicon was going to look like. VM1 was already pretty mind blowing with what it could do, but now they've officially announced these two brand new M one chips, the N one pro and the M one max, there is so much to talk about with these new processors, but the main takeaway is that this is a massive upgrade from the original M one with huge boasts in performance, but also massive improvements in power consumption. And when I think about the MacBook that I ordered, I ordered the specked out MacBook pro M one max, it's going to take me a while to figure out these naming conventions and not mess it up every single time. M one max MacBook pro completely specked out with an eight terabyte hard drive. I also expected out Lu 32 gigs of Ram. This thing is going to be so powerful that honestly, I think it might even replace my Mac pro. I can basically just dock it to my pro displays. You can actually link up three pro display XDRs, plus it has an HTMI out. So you'll even be able to hook up a 4k television to it. So that's a lot of action happening. I do only have two pro display XDRs, so I think that's probably good enough. I think we'll be good right there. On the M one pro you can only hook up two pro display XDRs, but again, you do have that HTMI out, which would be really great if you want to just sync that to a television or any type of monitor. Basically these chips are going to be insanely fast and the best part is they are powering two brand new, fully redesigned MacBook pros, and these look so awesome. I can't wait to check them out. They have bigger screens, smaller bezels, but there is also a notch. I know what some of your guys are thinking because I was reading your tweets and you guys were crying about the notch on the MacBook. And honestly, this MacBook could have a freaking hole cut out of the center of the display. And I feel like I would probably be more productive than five of my MacBooks previous to the M one I would still be more productive with half the string cutoff. So the overall design of this case is all new. There's an all new aluminum enclosure with new thermal design it's 16.8 millimeters thin and 4.7 pounds for the 16 inch and 3.5 pounds and 15.5 millimeters thin for the 14. This new design shape is actually kind of reminding me of those first MacBooks that came out in 2006. And that was actually one of the first MacBooks that I ever purchased for myself. And that's actually what I made a bunch of my first YouTube videos on. I used the eyesight camera that was built into that MacBook to make a lot of the first videos that I ever posted to YouTube. And speaking of a camera, they also made the upgrade to the FaceTime camera. It's now a 10 ADP camera, and it has a faster aperture for two X better low-light performance. The studio quality mic also got an upgrade with 60% lower noise floor that will make recordings sound much better. The speakers also got an upgrade with larger Wolfers and tweeters for deeper bass and cleaner highs. And of course, spatial audio is now supported on both models as well. And I'm sure some of you guys might be excited about this, but they did replace the touch bar with the standard function keys. I personally really liked the touch bar. I'm not sure if you're a fan, but if you are, let's do a little hands up in the comments. They didn't really make much mention of the keyboard. So I'm curious if it's going to be sort of the same style as the M one, because I know there's always so much drama about the MacBook keyboards. Also, Hallelujah. Apple has brought back the ports. Can we get a round of applause here in the studio? Anybody? Nope, just I'm the only one here? Cool, great. Well, let's add a sound effect. The new MacBook Pros now have three Thunder ball four ports, a full-size HTMI port, and they brought back the SD card slot. Now this is great, but I stopped using SD cards almost like two years ago. At this point. I now use all CF express cards. So this is really just more of, kind of like a, like a slap in the face. Like cool, Justine, we remember when you used to use SD cards and now you don't. I do actually sometimes still use SD cards. So I'm just kind of being a little bit dramatic. I'm actually pretty excited about this because there are times that I will just throw a few files on an SD card and I'll be able to just transfer those. And I won't have to look for a freaking dongle. I won't even need a dongle for an HDMI. I have Oh boy. I'm just thinking about the possibilities dude. I'm hyped. I'm so freaking excited. Now, in addition to the return of those ports that we just discussed, apple has also brought back freaking MagSafe charging. Okay. But this was where I was a little bit concerned because the second that I saw the MagSafe in the presentation, I was like, oh, wait a minute. Does this mean MagSafe is coming back, but wait, will I still be able to charge with USBC? Because there were times in the past where I had lost or forgot my MagSafe charger when I was traveling and then I'd have to go to the Apple store to buy it because it was like this proprietary MagSafe connector. So you still can charge them with USBC. So love that. The displays also got a huge upgrade. It is a liquid retina XDR display with a billion color support for promotion up to 120 Hertz display and peak brightness of 1600 nits. So before this event, I did see a bunch of rumors about the notch and it wasn't actually sure if they were going to go that route, but they did. So the notch is placed right in the middle of the menu bar, which honestly is unused space most of the time anyway. So I think everyone complaining about it just feels like they should complain about something because that's just what we like to do. We need something fun to complain about. So there you go have fun. You're going to be fine. Let's just take a deep breath. Let's get out our Apple credit card and let's not think about it. Let's just go shopping. So all in all the event was pretty exciting. I know so many of you guys have also been waiting for this update. I have had people message me like my close friends, family members who have been messaging me over the past year. Like I have some sort of insight information about Apple and I'm like, dude, I don't. I know nothing. I absolute, I don't. I know just as much as you do. So now I can go out to all of the people who were asking me over the past year when Apple was going to announce their new MacBooks and I can say you can go shopping now. I would love to hear from you guys though what would you like me to test out with all of these things that have been announced? Don't forget to subscribe, hit the bell. So you'll be notified when I post new videos and I'll see you guys in the next one. Bye-bye.",
    "transcript_keywords": [
        "apple",
        "Apple Music",
        "pro",
        "MacBook pro",
        "MacBook",
        "AirPods pro",
        "max MacBook pro",
        "AirPods",
        "Apple Music plan",
        "music",
        "pro display XDRs",
        "inch MacBook pro",
        "max pro",
        "pro display",
        "upgrade",
        "max pro Mac",
        "event",
        "max",
        "Apple Music library",
        "Apple Music app"
    ],
    "transcript_entity_values": [
        "IPX",
        "MacBook",
        "4k",
        "one",
        "32",
        "2006",
        "Twitter",
        "last year",
        "FaceTime",
        "60%",
        "five",
        "15.5 millimeters",
        "129",
        "Hertz",
        "iMac",
        "MacBooks",
        "YouTube",
        "HomePod Minis",
        "first",
        "Thunder",
        "Mac",
        "MacBook Pro",
        "MacBook pro M",
        "Sonos",
        "Tim",
        "MagSafe",
        "USBC",
        "MacBook Pros",
        "Craig",
        "MacBook",
        "HomePod",
        "YouTube",
        "the six hours",
        "CF express",
        "today",
        "third",
        "John",
        "pro M",
        "Ram",
        "120",
        "MacMini",
        "MacBook pro",
        "a minute",
        "1600",
        "second",
        "MacBook",
        "This year",
        "Apple Silicon",
        "Justine",
        "Adaptive EQ",
        "iPhone",
        "three",
        "eight terabyte",
        "13 inch",
        "Siri",
        "179",
        "SD",
        "this year",
        "this fourth quarter",
        "only $4.99",
        "10",
        "AK",
        "Apple Music",
        "a month ago",
        "Johnny",
        "almost like two years ago",
        "AirPods",
        "iJustine",
        "2021",
        "Apple",
        "14",
        "this past year",
        "the 16 inch and 3.5 pounds",
        "Lu",
        "XDR",
        "16.8 millimeters",
        "249",
        "hundreds",
        "four",
        "4.7 pounds",
        "half",
        "max",
        "the past year",
        "two",
        "ADP",
        "N",
        "one 13 inch"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "ORDINAL",
        "FAC",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "ORG",
        "DATE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY"
    ]
}