{
    "id": "vl86V77zOYs",
    "title": "NEW Apple Arcade games!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-04-02T16:51:28Z",
    "video_url": "https://www.youtube.com/watch?v=vl86V77zOYs",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 104774,
    "likes": 4436,
    "comments_count": 379,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, guys. It's Justine. And today we're gonna be chatting a little bit about the Apple Arcade update that is happening today or depending upon when you're watching this. It has already happened and it's out. I have been a huge fan of the Apple Arcade subscription service from Apple. It's basically a way to get a bunch of games every single month and also updates to some of their previous existing games. But this latest update is very, very exciting. You guys might remember, I think it was about a year and a half ago when the Apple Arcade actually launched. My sister and I went to Cupertino for one of their events and we got a chance to play games and hang out with other people. And obviously, being a huge Apple fan and also a huge fan of video games, being able to go to Apple to Cupertino, to the Steve Jobs Theater, and play games was like the coolest thing ever. And at that time I was thinking, \"Wow! This is like a once in a lifetime experience.\" And now, over a year later of really not leaving the house, it kind of makes me realize how incredible that experience was and how actually I'd have been a once in a lifetime experience. But I do hope one day, we can return to in-person events. Today's a big day for the Apple Arcade because they're launching not only a bunch of new games but they're also re-releasing some Apple Store classics. So, a bunch of games that you may have purchased like Monument Valley, Mini Metro, Threes!, Fruit Ninja Classic, Million Run, and a few others. And what's really cool is they're calling these the App Store Greats. So, all of these games that are highlights or have been previous hits in the App Store. You'll be able to get those, I was gonna say for free, but you're actually paying a subscription. But what's cool is in Monument Valley, for example, to get all of the levels, all of them will be unlocked. And all of this is unlocked with your Apple Arcade subscription. The other thing that I think is really exciting especially for a lot of people who played these types of games is the timeless classics like Chess, Backgammon, Crossword Puzzles, and even Solitaire. I mean, come on. Like they're timeless classics like *Babe Ruth did aimless appropriately. And then what makes Apple Arcade really fun is, of course, they do have some of the Apple Arcade originals. And there is one original that I am so excited about, freaking Oregon Trail. I grew up playing this game. So, the fact that it's now being re-released on the iPhone as an Apple Arcade classic game. I can play it on my phone. I can play it on my Apple TV. I can play it on my iPad. Is really freaking cool. A few other games that are launching in this update are Simon's Cat - Story Time, Star Trek Legends, and Cut the Rope Remastered which I'm very excited about this game because I absolutely loved this game before. And now it's all remastered in 3D and it looks beautiful. I remember being so obsessed with this game. I cannot wait to play again. And be just as obsessed all over again. There's SongPop Party, Clap Hanz Golf, Fantasian, Wonderbox: The Adventure Maker, and World of Demons just to name a few. Apple Arcade is available for 4.99 a month as a subscription but you can also get it bundled in with the Apple One subscription. But currently in the Apple Arcade there's about over I think 180 games, which is pretty substantial if you think about what you're getting for 4.99 a month. I have a couple of the games on my phone. Really the one that I really, really, really want to play is The Oregon Trail. Oh, my gosh. This is so crazy playing this. Here we are, March 6, 1849. We are lost. Aren't we? Yeah, we are. Oh no! Our wagon has fallen. David has a broken leg. Oh David, you're such a hot mess. You're always causing trouble. You think I remember how to play this game but I actually, I don't. Okay. Let's see. Do we want to treat Julia's fever or do we want to heal David's broken leg? Treat my fever. We don't need David. I'm Julia in this, and I'm being selfish. (laughing) Fix that up. Fix that up. All right. Our wagon is healed. Our money is going down significantly. Harris is joining our party. Oh, my God! We have a friend. This is incredible. Oh, David's broken leg. I should have probably healed his leg. Alfred is exhausted. Well, take a freaking nap Alfred. Hey Alfred, have a coffee sip. Wake up. Alfred is no longer exhausted. I wish it was that simple. Hunting ground. Oh, freaking do some hunting. Oh, you hate getting up early? Wham. When it was raining. Should I slow my roll? You guys got this. Come on. We got to pull through. Should I feed everybody or do they eat themselves? Not like eat themselves, but do they just get hungry and eat? This rainbow is definitely uplifting. I think, they feed themselves. My gosh, we healed his leg. He's not well. Oh, my God. Look at you guys lazy. Lazy. You guys are lazy bums. Ammunition? Oh, where the heck am I going to get ammunition at? Yep. I think that's probably enough right? Look how close I am. These are like some close range shots. Oh God. I'm terrible. I'm pathetic. I'm pathetic. Look at this. Can I carry that all back though? Is the question. I guess so. Oh, Harris. (moaning) How do I heal you? I don't have any medicine. I don't have anything. How do we get ourselves clean? Gosh, our oxen is tired. You need a doctor? Oh God. He's going to die. I hope he will too. Only 10 miles to go. Suck it up. David walked here on a broken leg. You're fine. God, look how disgusting we are. We don't really have any money. Oh, my God. He's throwing up. Oh, he is not well. He needs to go. He's not well. Okay, Harris. Have a good time. We have made it to independence. The very beginning. Oh, we got a guidebook. Do you want to jump straight into the main game? Oh my goodness. So, that was basically just the tutorial. We have so much more to do. Oh, my God! Give me some money. Appreciate it. Okay. Let's play Cut the Rope because this being one of my favorites. Let's freaking do it! Deliver candy. There we go. I mean, the game is so simple but it does get a little complex as you go. If you've played this game before. (cheerful music) Okay. I did terrible. I did a very poor job but we're going to do that again. Oh, shoot! I cut all of my ropes. I missed it. No! Yes! It's like the game is so simple yet. This way. Yeah. Oh, no. Now, I've messed up. (cheerful music) There we go. Nice. Look at all these levels. We're going to be so busy this weekend. Okay. Let's play another one. Let's play SongPop Party. This one looks really fun. Hi, I'm Amanda. Welcome to SongPop Party We're going to do is just a solo because riding solo, I'm riding solo. You can collect my data. I don't care just like essential. So, this is going to give me a copyright. Probably. Yeah, I know this. So, they play a song and then I'd say who it is. I did choose the easy one. I've never played this game before. It was actually really fun. I don't know. Oh, CPU missed it. I can't play any of these songs because they're all copyrighting but I'm doing really well. And I'm proud of myself. I just guessed because I knew it wasn't any of the others. Yay! Can you guys believe that I came in first. I beat a computer. So talented! Okay. Let's play Simon's Cat. And look he's in the pants. He's eating the food Your significant other does not enjoy your pet? Then it's time to go. And get that quick snack. So, it's time to do some gardening. This cat wants out. He wants his freedom. So, do I got to build a wall? Okay. I have a new task. I've got to fix the garden gate. So, a lot of games that I play normally are basically eight a play and eight a win. So, I end up spending so much money. So, games like this, especially through Apple Arcade. I don't have to like basically, pay to win. It's just a game, based off of playing a game. Oh, okay. What do we do? Oh my God. We're collecting. Oh gosh. These types of games. Oh, we're all in trouble now. Whatever happened to Justine? Oh, Apple Arcade released new games. She's never seen again. I love tile matching games. It's funny 'cause this is one of the games that I was like, Oh, I don't know if this is one that I'm going to be into. I fixed that gay dude. Oh, my God! We have a new neighbor. Oh, get it. Well, I want to play more matching. I want to keep matching things. Look at him cleaning. (upbeat music) Oh. Look at our beautiful clean yard. Oh, that neighbor's going to be like I'm going to come over for a barbecue. Oh. She also has a cat. Oh, boy. I see where this is going. I don't want to do any more spoilers for this game for you guys. But NBA 2k21 Let's do it. I'm not going to lie. I don't really remember the last time I played a basketball game. I also don't know anything about basketball. Should the Lakers play the Lakers? That's confusing. Play the Kings. I just thought, you know we would keep it in California, like a local gathering. All right. Here's our starting lineup. Do your stuff. Let's get out there. We got it. This looks really good. I wish I could put my face on somebody in the crowd. Okay. Here's our controls. Who is that? Is that me? What is my team? Who am I even? This is going to be an absolute tragedy. I'm just going, okay. Do I? Who am I even? Oh, I have to go somewhere. I got to do something. Okay. Here's the thing. Just get over there and just shoot. Be talented. (crowd cheering) Don't even know how to play basketball. So, this is really quite problematic. I know you don't want to. Hey! You did something wrong. Yeah. I don't know what you did. How am I supposed to know? Because I don't understand this sport. Did I hit people? I mean, in new Orleans, I can also say, Oh, my god. (faintly speaking) Okay. You take the ball and then I'm just going to pass it and hope that you can get that ball in. Oh really? I just want to hit, some of them because we're losing. Okay, dude. Let's take this ball, Pass it to our friend. Pass it again. And then we're going to shoot. I'm getting the sport down. I got this. Here's the thing, I actually played basketball in middle school. Was I any good? No. You know how short I am? I'm 5'3. You know how short I was probably in middle school. Get that. Oh my God. Oh, I got the ball back. It's almost like I'm starting to understand the controls. That was a really long pass, you idiot. Why would you ever do that? That's something that I even know is a bad idea. Oh. Oh. Okay. Wait a minute. No. No. No. No. We're going to keep going. Oh! Get that ball! Get that ball. Get that ball. Okay. Now we're going to stop before I get any worse. This is pretty fun considering I haven't played a basketball game ever and I don't even understand the sport. Well, thank you guys so much for watching. There were just a couple of games that I really wanted to test out here on Apple Arcade. I've been such a huge fan of Apple Arcade since it launched. It's really cool to kind of get a chance to play some of these games that are now available on the app store. And I got to play them here for you guys today in this video. I would love to hear from you guys. Do you have a Apple Arcade? And if you're using it for the past year what games have you guys been playing? And what are your favorites? I will see you guys in my next video. Thank you so much for watching. Don't forget to subscribe. Like this video. If you enjoyed it and hit the bell to be notified when I post new videos and that's it. I'll see you guys later. Bye (upbeat guitar music)",
    "transcript_keywords": [
        "Apple Arcade",
        "Apple",
        "Apple Arcade subscription",
        "Arcade",
        "games",
        "Apple Arcade classic",
        "play",
        "Apple Arcade update",
        "game",
        "God",
        "makes Apple Arcade",
        "Apple Arcade originals",
        "Arcade classic game",
        "Apple Arcade released",
        "Apple Store classics",
        "guys",
        "play games",
        "Arcade subscription",
        "Apple Store",
        "App Store"
    ],
    "transcript_entity_values": [
        "a minute",
        "Simon's Cat",
        "one",
        "Threes!",
        "Apple TV",
        "every single month",
        "World of Demons",
        "Alfred",
        "the Steve Jobs Theater",
        "a year later",
        "Apple",
        "Million Run",
        "Justine",
        "SongPop Party",
        "Chess, Backgammon",
        "Apple Arcade",
        "this weekend",
        "CPU",
        "David",
        "Hanz Golf",
        "NBA",
        "iPhone",
        "Today",
        "Oregon Trail",
        "180",
        "a Apple Arcade",
        "March 6, 1849",
        "Wonderbox",
        "Cupertino",
        "The Adventure Maker",
        "the App Store Greats",
        "5'3",
        "about a year and a half ago",
        "Julia",
        "iPad",
        "Wham",
        "one day",
        "Babe Ruth",
        "Harris",
        "Mini Metro",
        "Fantasian",
        "4.99 a month",
        "Amanda",
        "Apple Store",
        "eight",
        "Lakers",
        "today",
        "new Orleans",
        "the past year",
        "Crossword Puzzles",
        "California",
        "Simon",
        "the App Store",
        "the Apple Arcade",
        "Star Trek Legends",
        "Only 10 miles",
        "Fruit Ninja Classic",
        "Solitaire",
        "first",
        "Monument Valley",
        "The Oregon Trail",
        "Cut the Rope",
        "the Apple Arcade"
    ],
    "transcript_entity_types": [
        "TIME",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "FAC",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "FAC",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "GPE",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "GPE",
        "EVENT",
        "WORK_OF_ART",
        "FAC"
    ]
}