{
    "id": "vMmLdYBvEVg",
    "title": "Samsung Gear Sport / IconX 2018 Review",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-10-30T13:00:37Z",
    "video_url": "https://www.youtube.com/watch?v=vMmLdYBvEVg",
    "category": "Science & Technology",
    "tags": [
        "gear sport review",
        "iconx review",
        "gear sport vs gear s3",
        "iconx 2",
        "iconx 2018",
        "mrmobile",
        "michael fisher",
        "best smartwatch",
        "best smartwatch 2018",
        "best earbuds 2018",
        "samsung earbuds",
        "samsung wireless earbuds",
        "samsung smartwatch",
        "galaxy gear"
    ],
    "views": 440138,
    "likes": 8385,
    "comments_count": 459,
    "description": "Smartwatches are in a strange place right now. Android Wear is on more wrists than ever, but the software isnt the best; the Apple Watch is basically useless if you dont carry an iPhone; and old stalwarts like Pebble have been swallowed up by bigger fish to produce  well, whatever the Fitbit Ionic is. So when Samsung launched its newest smartwatch in September, I was excited for another contender from the company that brought us the excellent Gear S3  and it turns out you dont even need to be a fitness fanatic to appreciate it.   The Gear Sport is a smaller, sleeker, and (yes) sportier revision of Samsungs previous-generation smartwatches, with heightened durability and a boatload of new fitness features that help counter its slimmer spec sheet. Join me for a look at both products in my Gear Sport / IconX review, brought to you by Man Outfitters.   [SPONSOR]  MrMobile's wardrobe provided by today's sponsor, Man Outfitters. Visit this link for 10% off your entire order at ManOutfitters.com:      [SUBSCRIBE]     [ABOUT THE GEAR SPORT / ICON X REVIEW]  MrMobile's Gear Sport Review / Icon X Review was published following a week with a Gear Sport review unit and two Icon X review devices furnished by Samsung. The devices were used with a Galaxy Note 8. All units received at least one software update during the review period.   [MUSIC]  Green Fever by Flash Fluharty, available at Premium Beat:   Sensational by Cymatix, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "http://www.manoutfitters.com/MrMobile",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.premiumbeat.com/royalty_free_music/songs/green-fever",
        "https://www.premiumbeat.com/royalty_free_music/songs/sensational",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] Smartwatches are in a weird place right now. Android Wear is on more wrists, but the software is kind of a dog. The Apple Watch is basically useless if you don't carry an iPhone, and old stalwarts like Pebble have been swallowed up by bigger fish to produce stuff like this. So when Samsung launched its newest smartwatch in September, I was excited for another contender from a proven company. And it turns out, you don't even need to be a fitness fanatic to appreciate it. I'm MrMobile, and this is the Gear Sport review. Also touching on the Samsung IconX Bluetooth earbuds, brought to you by Man Outfitters. (motivating music) If you saw my hands-on from Berlin this fall, the Gear Sport hardware won't surprise you. The circle-on-squircle watch body, 20-millimeter watch band, and bright round AMOLED screen are all unchanged. I wouldn't say this is my favorite design of Samsung's, and it only just approaches the style of a traditional designer analog watch, but the Sport is good enough looking and it's on the small side, which is refreshing in a world of clunkers. That size carries some compromises though. There's no LTE, so the Sport is dependent on the phone in your pocket, or a WiFi connection for its smart features. Also, while Samsung Pay is still on-board, it only works at NFC-enabled payment locations. You can't spoof a magnetic stripe reader, like you can with the bigger Gear S3. And the battery size has also been cut relative to the S3 by 21%. Surprisingly, the Gear Sport still lasts longer than the big LG Watch Sport that normally graces my wrist. In the out-of-box configuration, the watch averages three days to go from full to empty. But, be advised that enabling that Always On Display to keep the watch face visible at all times will cut you down substantially to about two days between charges. If there's one area where Samsung really kills it in wearables, it's the interface. The Tizen software is zippy and the high-contrast approach makes navigating it very easy. The best part is the rotating bezel, whose mechanical ratcheting clicks are really addictive, especially if you're like five years old at heart. When you consider all the features crammed into this thing, it's impressive that it's this easy to navigate. Most of those features are for fitness. I especially like its automatic workout detection, which tracks my walks for me without me having to punch them in. That said, it sometimes gets confused. It interpreted a rousing round of Tetris in an arcade as bicycling, for example. And it also overestimates the number of calories I burn on a daily basis. So if you need more advanced or accurate tracking, you can take advantage of the Under Armour suite. Samsung has struck a deal with them where you get a free premium membership for a year if you buy a Gear Sport. There's also Speedo for swim tracking, which you can use even in the ocean, because the watch is certified for saltwater in addition to its mill standard and IP ratings. There are a couple of things not to love. Even though the wireless charging is based on the Qi standard, you can't recharge it using any old Qi charger. You need to bring along the pedestal that comes in the box. And that pedestal uses the older micro-USB port. So if you have a modern phone, you also need to bring along a non-modern charging cable. Progress, am I right? Alongside the Gear Sport, Samsung also let me try out a set of its new IconX earbuds for 2018. These are wireless in every sense with a special carrying case that provides one additional full charge. This one has the good sense to use USB-C. There are cool features here. Four gigs of space on-board, so you can transfer music right onto the buds and they don't need a phone or anything. They're rated for seven hours of listening in this mode. The more common use of course is streaming from a phone, but you can also pair the buds directly to the Gear Sport watch, onto which you can either load your own music or download your playlists to the Spotify app, which yeah, supports offline listening. In this mode, the buds are ready to last for five hours, and I have to say, it's just a stupid amount of fun to know that I'm streaming audio directly from my wrists to my ears with no phone in sight. I'm not really the target market for the IconX, so I didn't get as much use out of the built-in running coach or anything. But I do think it's cool that so much tech is packed into such a small package. On top of that, phone calls work very well. People said I sounded great. And I had no trouble hearing anyone. But like most buds, these do get uncomfortable after about an hour, and the function that's supposed to let them detect when they're in your ear doesn't work well. Several times I was listening to a podcast on a speaker and I'd pick up the buds just to move them across the table, but that motion would automatically wake up the connection and move the podcast to the buds. Very annoying. Also, you need to get into the habit of putting them back in the case when you're not using them. Just leaving them out overnight will result in a nearly-drained battery by morning, if you've used them much at all. Both of these products were designed for folks who need fitness gear first. But one of them pulls double-duty as a product even I might buy. That would be the Gear Sport. It's a great smartwatch, and even though it's steep at $299, I think it's definitely worth considering, especially given how narrow the field has gotten. And for the IconX, again I'm not really the target customer, but I do think it needs a bit more polish in the form of software updates in order to be worth the $199 Samsung is asking. Both are on sale right now. Some of MrMobile's wardrobe for this video was provided by Man Outfitters, an online specialty retailer of premium men's apparel and accessories. They carry the best products from the coolest brands, Patagonia, Columbia, North Face, Southern Marsh, and my personal favorite, Sperry Top-Sider. Oh and that analog watch I showed you at the top of the video, that is a Jack Mason Aviator Chronograph at Man Outfitters that I dearly love. That's just a few of the more than 50 labels in the Man Outfitters collection, and you get free returns and exchanges for a painless, risk-free shopping experience. For 10% off your entire order, go to manoutfitters.com/mrmobile and stock up for fall before all the best designs sell out. That link is down in the description. Until next time folks, thanks for watching, and stay mobile my friends. (offbeat music)",
    "transcript_keywords": [
        "Gear Sport",
        "Gear Sport watch",
        "Sport",
        "Gear",
        "Watch",
        "Samsung",
        "Gear Sport review",
        "Gear Sport hardware",
        "Man Outfitters",
        "weird place",
        "Watch Sport",
        "Sport watch",
        "Samsung IconX Bluetooth",
        "buds",
        "phone",
        "Apple Watch",
        "Man",
        "Outfitters",
        "Android Wear",
        "analog watch"
    ],
    "transcript_entity_values": [
        "Southern Marsh",
        "LTE",
        "Speedo",
        "more than 50",
        "Michael] Smartwatches",
        "about two days",
        "Tizen",
        "North Face",
        "Samsung",
        "Berlin",
        "Spotify",
        "IP",
        "299",
        "micro-USB",
        "morning",
        "2018",
        "10%",
        "199",
        "Android Wear",
        "20-millimeter",
        "S3",
        "a year",
        "Sperry Top-Sider",
        "daily",
        "iPhone",
        "21%",
        "first",
        "the Gear Sport",
        "polish",
        "USB-C.",
        "Four",
        "September",
        "five hours",
        "Columbia",
        "about an hour",
        "Gear S3",
        "Qi",
        "Man Outfitters",
        "Pebble",
        "LG Watch Sport",
        "The Apple Watch",
        "MrMobile",
        "seven hours",
        "this fall",
        "five years old",
        "NFC",
        "three days",
        "Patagonia",
        "one",
        "Tetris",
        "Man Outfitters"
    ],
    "transcript_entity_types": [
        "LOC",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "TIME",
        "DATE",
        "PERCENT",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERCENT",
        "ORDINAL",
        "EVENT",
        "NORP",
        "ORG",
        "CARDINAL",
        "DATE",
        "TIME",
        "GPE",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "PERSON"
    ]
}