{
    "id": "VmX1nIJL-m8",
    "title": "Sony A7s III Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-07-28T14:00:21Z",
    "video_url": "https://www.youtube.com/watch?v=VmX1nIJL-m8",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "sony",
        "a7siii",
        "a7s iii",
        "review",
        "hands on",
        "footage"
    ],
    "views": 741727,
    "likes": 24132,
    "comments_count": 1612,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(upbeat music) - This is the all new A7S III. 10-bit 4:2:2, 4K, 120 frames a second. An all new sensor, larger pixels for improved low light an all new redesigned menu system , incredibly fast auto focus, full HDMI output and more. (soft music) Hey, it's Justine and I'm so excited to be showing you guys today the all new Sony A7S III. This is the camera that we've all been waiting for. And guess what? We're shooting on it right now. (upbeat music) We have wondering around the park. I'm not even sure what we filmed but we've been trying to get a lot of cool shots. But it's so difficult because it is so incredibly hot out here, you can't last very long out here without getting some air conditioning. But this place is incredible. (upbeat music) A7S III has an all new processor, it's eight times faster than the previous gen A7S II. You can choose up to 10-bit 4:2:2 120 frames a second with this new faster processor. Sony is coming out with some all new CF cards, that will be able to handle the right speeds of 600 megabits a second. You'll need this when you're shooting in the new 4K S&Q setting. There's actually four card slots in this camera, there's two SD and there's two CF Express slots. What's great about S&Q is you can set the final output of what the frame rate you want it to be. So, say we want to shoot 140 frames a second and we want the final output to be 24 frames a second. This will automatically make that video file for you. And this is great because it saves so much space because that video is automatically rendered, but there is no audio. There's a few new 4K options to shoot in., we've mostly been shooting in 4K XAVC HS, which is HD 65, and has a much better compression. And this will give us smaller file sizes compared to XAVC S on previous models. What you shooting in, 120? - Yeah. - cool. Oh, crispy. - Wait, can you do audio on this? - Yeah, we are right now. - No way! - Look, the mic, it's on. As long as you're not on S&Q. - Oh, yeah. - So in S&Q it automatically will turn the clip into whatever frame rate you want. But if you shoot just 120 like this, you get audio. - That's cool. The really new and exciting mode though, is 4K XAVC S-I all intra. In this mode, it is shooting every single frame. In the previous modes, it skips a few frames and kinda merges everything together to make it look seamless. But this does not skip any frames. It shoots every single frame to give you the most crisp and perfect and smooth shots that you can get. This will also give you a much larger file size, so if you're not worried about storage or compression then this might be the mode for you. I think a lot of higher end productions are really gonna love this feature because it really is giving you the highest quality that you possibly can get from this camera. Do you know what this looks like and smells like? Freaking Chuck E. Cheese pizza. - Oh my gosh. - It smells like it, this looks. - I am so happy. - I'm shook. (upbeat music) And if you wanna get really crazy, this camera will actually shoot up to 16-bit raw, using an extra recorder. The recorder that we use all the time for pretty much everything that we shoot previously on the A7 III. We use The Atomos Ninja V recorder and this thing's amazing. just looking at some of the footage that we shot already on this camera just in 4:2:2 10-bit. I can't even imagine what the 16-bit raw is gonna look like. So today we decided to do a really fun hike to, Corona Arch. Do with that what you will. (soft music) Let's juggle on 120. Ready? (soft music) Oh! (soft music) Recording limits have long been an issue with a lot of these cameras. And it's not just Sony cameras, a lot of them do have recording limits mostly because of the heat issue. With this camera there's a new heat dissipating structure. So that helps the airflow and that also helps us not have a recording limit when you're shooting in 24 or 30 frames a second. There is about an hour time limit if you are shooting in 60 frames a second and about 30 minutes if you're shooting in 120 frames a second. But if you are recording that long and higher frame rates, what are you doing? This flip out screen has been so incredible for things like this, because right now I'm sitting on top of a van and it's kind of like a very unstable situation. The vlogging community has been obsessed with having these global screens. And for so long Sony for whatever reason has not had the flip out screen. Obviously a lot of people think that this is just something that vloggers need. No, I have been shooting a lot of nature stuff so trying to get like low shots, trying to get shots of Jenna, this thing has been so helpful. Be of course it's also super helpful to see yourself. - That's me! - I know. - Cute. - You cute! Oh yeah, that's cool. - And you know what? Dust. - This is dust resistant. We have improved dust improvement. (soft music) I did a test with all 10 of the built-in customizable picture profiles. I just used standard default what they have built-in in camera but these are fully customizable so you can change them to be whatever you want. S-Log2, S-Log3 will give you 15 plus stops of dynamic range. Being able to shoot 10-bit 4:2:2 internally and 16-bit externally raw is gonna be so amazing and so much fun to color grade. I can't claim to be the best at grading. But I feel like one of the things that's fun about this is we're gonna have so many more options and so much more range of color to work with. That'll definitely give you more flexibility. There's also 10 built-in creative color books and I don't ever usually use these but if you do, here's what they all look like. (soft music) So the sun just went down and it's starting to get dark very quickly. But one of the reasons that most people gravitate towards the A7S series is because of its low light sensitivity. But with this right now we're shooting with a 1.8 24 millimeter G Master lens. So this is allowing so much more light in that it probably looks like it's daylight. Sort of, no, yeah. Tyler shook his head yes. Base ISO is E and goes all the way up to 102,400 and from 40 to 409,600 in extended. This shoots 12 megapixels like the previous A7S II but the pixels are much larger on the new A7S III allowing much more light per pixel. And I'm so excited because tonight we're gonna try to get the astro shot. We've tried for the past several nights. The guys went out last night and stayed up. And we went the night before. So it's gonna be very dangerous over here. - Oh, that's a drop. - Oh my it is. So you can go around, like I was up there on that edge. (soft music) - [Both] Are you okay? Perfecting the perfect night shot is not an easy task. But tonight, we're here again to try to make this happen. And this time, we're using this app that our friend Curtis told us about, it's called PhotoPills. So it's pretty cool because you can actually use the phone and it's like AR and you can see in what time where the Milky Way is going to be. So we got the rocrow today as well. So we're gonna try to set that up, there's a lot happening. - It's gonna make sense, it's gonna look cool. - Ready? Put it in. - [Both] 123 team stars. - Is the camera okay? - Is your hand okay? - It's fine. (soft music) I can't really say that I was much help with astro because I've been sleeping. - So we probably have like a five second time lapse. - Oh my god. - But it's cool, it's cool. (soft music) - Low light has always been one of the main features of the A7S series. And with this that is no exception. I went on this trip with my sister Jenna and our friends Tyler and Jace and they are a little bit better at staying up a little later than I am, 'cause I definitely fell asleep in the van several nights. That's so cool. - It's pretty cool, I'm in there. - That's amazing. - Safe from all the bugs. - Guys, I'm very proud of you and I'm very impressed and I'm sorry for sleeping. - Yeah. (soft music) - In body stabilization on this camera is actually pretty good. For a lot of these shots we were using a lens that doesn't actually have any stabilization in it, so it was relying fully on the camera itself. We're using the 24 1.4 G Master lens and it just looks so crispy. We also have two new stabilization modes so they have an active steady and they have an active standard or you can completely turn those off. If you do choose the active steady, this is giving you a much more stabilized shot but it does crop in 10%. I'm so excited. This is something that I wanted to check out. I was doing some trail research yesterday and I saw one that said dinosaur tracks and petroglyphs, and you know what I said we go there tomorrow and now we're here. (upbeat music) Here it is. This is what we came here for. (upbeat music) The body of the camera is really similar to a lot of the other Sony Alpha lines. Even when we were shooting these product shots, I was getting a little confused as to which camera was which. So it does all kinda come down to the small details. The number one giveaway though is that flip out screen. It also has a new full HDMI port which I absolutely love. A lot of times these have the micro or the mini HDMI ports, and these can easily get bent or they're not easily accessible. There's been so many times where we've been out shooting and we do not have our mini or micro HDMI cables. So now you just rip full HDMI out of a TV and we're good to go. The input and output audio are directly next to each other and it has an all new electronic viewfinder. I typically don't ever use the viewfinder because most of the times I'm either shooting myself or I could have an external monitor that I can look at. But we've been using it so much out on this shoot because it's so bright, that being able to have that new electronic viewfinder, everything looks so crisp. I also love having the touchscreen be touched to focus. And the auto focus on this thing is so freaking fast. One of the reasons that I had to upgrade my A7S II to the A7 III, is the focus on the A7 II and this is not new information to anyone who has had one, is a little bit slow. They also redid the strap holder. So a lot of times when people would be filming with these cameras, you would hear these things dangling around, but they made them really stiff so they don't actually move at all. I also love that this has a USB-C port so you can use this for transferring data. You can also use it to power the camera. One thing that I really like about this camera is especially for us we're usually vlogging and kind of doing handheld shots very quickly and moving the camera around and with the A7S III it minimizes the rolling shutter significantly. So in this demo, you guys can see the rolling shutter difference. Now what you're looking for is the distortion of the image. So the new A7S III, as you can see here has a very clear image and nothing is getting distorted, where the other it looks a little wavy. This camera is something that a lot of people have been waiting very very patiently for and I'm so glad that we finally have all the details. And I'm so glad that I actually got a chance to take a look at this for you guys. And I can promise you you're not gonna be disappointed. A huge thank you to Sony for sending me and my sister out here with a review unit to be able to check out and share our experience with you. If you guys enjoyed this video, be sure to give it a thumbs up and don't forget to subscribe to my channel because I'll be definitely doing a follow up on this camera when I actually get one for myself. I have been loving it so much and I just cannot wait until September. I'll see you guys in my next video. Bye. Jenna do you remember what we did yesterday? - No. - When we rented a little tiny car and got stuck in a rainstorm and there was lightning and thunder and then we drove all the way back and had to return the car early only to find out that the car had a flat tire. So who would have continued going out? We probably would have been stranded. - Oh, that. - That. And then also I was filming in S&Q which doesn't have audio 'cause we were testing that out. So all the stuff that I was talking about telling you about the flat tire, we didn't get the audio. But the S&Q footage looks really cool. Then we went to the grocery store and I bought a little jacket for my yerba mate and a hacky sack. (laughs) It's up on the roof. Make sure we don't forget to get the sack before we leave. (soft music)",
    "transcript_keywords": [
        "camera",
        "shooting",
        "lot",
        "III",
        "frames",
        "cool",
        "Sony",
        "shoot",
        "shots",
        "frame",
        "HDMI",
        "guys",
        "give",
        "audio",
        "times",
        "time",
        "cameras",
        "Yeah",
        "full HDMI",
        "shot"
    ],
    "transcript_entity_values": [
        "K XAVC HS",
        "12 megapixels",
        "second",
        "One",
        "140",
        "one",
        "409,600",
        "24",
        "about 30 minutes",
        "Justine",
        "tonight",
        "September",
        "PhotoPills",
        "Sony",
        "Curtis",
        "4",
        "30",
        "16",
        "600 megabits",
        "Freaking Chuck E. Cheese",
        "the past several nights",
        "the Milky Way",
        "four",
        "S&Q",
        "24 1.4",
        "123",
        "CF",
        "10%",
        "HD 65",
        "K S&Q",
        "eight",
        "XAVC S",
        "today",
        "A7S II",
        "two",
        "five second",
        "60",
        "102,400",
        "Tyler",
        "10",
        "Jace",
        "1.8 24 millimeter",
        "40",
        "10-bit",
        "last night",
        "Corona Arch",
        "tomorrow",
        "about an hour",
        "CF Express",
        "Jenna",
        "120",
        "yesterday",
        "15"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERSON",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "EVENT",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "FAC",
        "DATE",
        "TIME",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL"
    ]
}