{
    "id": "vNj75gJVxcE",
    "title": "Power outlets are topsy turvy - but does it matter?",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2023-09-26T16:10:02Z",
    "video_url": "https://www.youtube.com/watch?v=vNj75gJVxcE",
    "category": "Science & Technology",
    "tags": [],
    "views": 1686368,
    "likes": 60598,
    "comments_count": 9986,
    "description": "The answer may surprise you!  Here's that follow-up I talked about at the end   Technology Connections on Mastodon:   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!",
    "description_links": [
        "https://www.youtube.com/watch?v=pmKL3pgPQhY",
        "https://mas.to/@TechConnectify",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Thats right, the electrical outlet we all know and put up with here in North America is usually installed upside-down. Some of you might be makinga face very similar to these right now, but the fact is this common orientation is starting to getsome pushback. Take a look at the packaging of new receptacles in the store. They nearly all showthe outlet with the ground connection on top of live and neutral. The markings on the receptaclesthemselves also imply that this should be the top. In fact for a while now there has been somethingof a pressure campaign, I guess you would say, to retcon whats normal and make youquestion reality. This manufacturer has clearly obliged - they even take care to packagethem with the ground connection at the top. The practice of treating the ground pin as the top of the receptacle supposedly began in hospitals. Why? Well, the common face orientation wetypically find is actually somewhat dangerous thanks to the many design flaws of the NEMAreceptacle and plug. Inverting the outlet certainly doesnt fix those flaws, but it doesreduce the risk of some possible calamities. So you will sometimes hear that this is technicallyincorrect, and that installing the outlet with the ground pins up is the proper way to do it. Theresjust one small problem, here: nobody cares! I dont care. Most electricians dont seem tocare. And I honestly think you dont need to or in fact should care. Thats right, thisis a debunk. While there is some truth to the idea that the ground-down orientation isnot ideal, and dont worry Ill show you why, there are many confounding issues here which makeadvocating for its inverse, to put it mildly, pedantic and/or paranoid. At least, in myopinion. If you suddenly woke up and found someone had turned all your outlets around in themiddle of the night, it would be irrelevant the vast majority of the time, maybe very slightly safer ina few extremely specific scenarios, and the rest of the time it would be supremely irritatingand, in fact, introduce some new risks of its own. The first order of business we have onthe agenda today is rules. Because there actually arent any about this. Perusethe National Electric Code all you want and you wont find a specific rule for howthis receptacle type should be oriented. There are plenty of rules regarding spacing along walls and what kind of outlet can be used in whatcircumstances but as far as how you wanna installthis guy in the wall? Totally up to you. Its so up to you that here in Chicagoland we like toinstall them sideways. Nearly every home Ive ever been in around here has em installed just likethis. And youre right, the hot blade is on top! Im not entirely sure why this is common here butit probably has something to do with the fact that all electrical work has to be done in conduituntil you get pretty far away from the city, so we don't get to just nail plastic wall boxes tostuds and run Romex around the place likethe rest of you can and for some reason thisorientation sticks around like deep dish pizza. Anyway, thats not important. What is importantis that there isnt a definite right or wrong here. And, on a gut level, you probably already knewthat. Just look at the test and reset buttons on a GFCI outlet. These words arent printed bothways just for grins and giggles, the manufacturer knows it could be installed either or indeedneither way. And in case thats not convincing, take a look at this fancy thing I found. Thisduplex receptacle features both orientations! Good luck picking just one. So. Whatsthe deal with the whole discourse, then? Why do some folks insist that weshould turn this frown upside-down? Well, there are two main reasons. Both of whichultimately stem from the fact that the design of this plug and its receptacle is bad. The bladesarent sleeved with any insulating material, and when the plug is partially inserted it becomes live despite the conductive blades remaining ever-so-touchable. Especiallywhen you have small fingers like a child does. Its not great. But! If the outlet were simplyrotated 180 degrees, the risk of accidentally touching the live blade as you insert orremove the plug becomes muchly mitigated! See, now the ground pin is on top, so itsa lot harder to get your thumb in there. Except well, two things. One, when I hold ontoa plug Ive usually got my index finger curled around the bottom. So if I were plugging somethinginto an outlet like this, my thumb might be a bit safer but I could still get zapped down below. Butperhaps more importantly not all plugs even have a ground pin, do they? For this plug it doesntmake a lick of difference where the ground pin is because its not there! So I dont really buyreducing shock risk from simply handling the plug as a reason to invert the receptacle. Its notthe most commonly cited reason to avoid the face orientation, and in fact Im having a hard timetracking down a solid source of that case being made but I swear Ive run across it before andbesides its a good lead-in to this side note: Side-note, there is a weird difference betweenthree-prong plugs and two-prong plugs that I hadnt really given any thought about until itwas pointed out to me. If you ever come across something with a very old power cord, youll findthat our plugs used to be much worse and outright terrifying. Look at the plug on this old taperecorder. Theres hardly any clearance between the metal blades and the plastic body, and thereisnt much of a grip to grab hold of, either. And Ive actually seen some even worse than this. Overthe years we made the two-prong plug at least a little bit safer by flaring the plastic body outtowards the end and adding this lip for even more clearance. But grounded plugs largely havent gotten that particular memo for some reason. This power supply cord has its plug blades barely any further from the edge than the 50year old tape recorder. And thats all kindsof weird! It has gotten a little better - this power strip's plug has a bit more meat around the blades. But it's still not quite as much as a standard two-pronger. I suppose maybethis makes them fit better into power strips (or maybe some other application would be messedup if the plug shape were modified to be closer to the two-pronged plug). Whatever the reason, itmeans that, ironically, cords meant to introduce an element of safety by way of groundingthe appliance theyre connected to often make the process of plugging and unplugging that appliance just a little bit spicier. However, holding the plug wrong and gettinga nice little shock from it isnt the onlyproblem we face. Theres also the issue ofpartially-inserted plugs and foreign objects. Again, this plug is bad, and even if nobodys had a shocking time of it and its inserted perfectly well, it can nevertheless become slightlydislodged. This plug is still reaching far enough in to make contact with the live conductorsin the receptacle, but look at all that room we have for things to sneak in there. Thingslike keys, or coins, or scissors, or knives. [metal clanging] Do you have any idea how many games of throw the knives at the wall have been ruined thanks to these terrible plugs? Its at least one. If a flat metal object manages to slip into this little crack, it can bridge those pins andpoof! [poof] Youve tripped a circuit breaker and made a nasty char mark on the wall. Or possibly,if things go terribly wrong, started a fire. Of course, outside of Boston, mostpeople dont play throw the knivesat the wall. But that doesnt meantheres no risk for the rest of us! Remember when I said this plugdesign is bad? Yeah, me too, but also - the wall plate design is bad. There are a few variations but the most basic wall plate for a duplex receptacle is heldon with a single screw which attaches right here. Wall plates are usually plastic these days, butthey havent always been. Metal wall plates used to be quite common, and theyre still used fromtime to time today. If the single screw holding it on backs out with time or in some other wayfails, the wall plate could fall onto the live and neutral pin of a partially dislodgedplug and short it out. Again, not good. But the risk of a short circuit isnt theonly problem. Imagine youre working on some sort of home improvement project and you whip out one of these bad boys. Now imagine youre taking a measurement of thelength of a wall, and youve got a boombox or something plugged into an outlet on that wallyoure measuring. You bumped the cord a little while back and didnt see that the plug became dislodged, and as you cast your tape to the wind - a tape that is metal, mind you. And droopy - it slipsin that crack and lands on the live pin. Ouch. Or, lets say youve decided to lean like, Idunno, a file or a square or a yardstick or something up against the wall next to an outlet. If it, too,suffers from partial dislodgement syndrome, that yardstick could fall onto thelive pin and become live itself. Say a prayer for the person who reaches to pick itup next. If only the receptacle had been rotated 180 degrees! Then the ground pin would be atthe top and even a loose plug would be less likely to start a fire or hurt someone in theseextremely specific scenarios Ive just described. Actually, when the ground pin is up top, the plugis less likely to become dislodged in the first place! The ground pin is longer and reaches deeperinto the receptacle in order to ensure its the first to make contact upon plug insertion and the last to break contact on removal. That makes it something of a pivot point. Ifits on the bottom, then a downward force on the plug will easily pull the shorter live andneutral pins out somewhat. But if its on the top, it takes more force to get it to budge. Plus, once it does budge, the other two pins are jammed right up against the receptacleface. Thus they remain mostly untouchable. Seems like we have a pretty solid reason toinstall these ground-up, right? Id probably never trip a breaker when playing \"throw theknives at the wall,\" a falling metal wall plate would simply land on the ground pin so no harm nofoul. And measuring walls with a tape measure and even leaning long flat metal objects against thembecome safer activities, too! Whats not to like? Well, you probably know what Im gonna say next. Not all plugs have a ground prong, Harold. ThisOne Weird Trick will do absolutely nothing for ANY of these scenarios weve gone through if theloose plug in question was one of these fellas. And thats a lot of plugs! The majority in mylife have only two prongs and I doubt Im alone. Aha! you say but why would you be againstreducing the risk in the circumstances in which it could be reduced? What exactlyis the problem with a ground-up outlet? Ill tell you what the problem is: They dont makevery good hamburgers. But also, its the mere existence of these: right-angle plugs. Maybe its a plug-intimer, maybe its the GFCI thing on a hair drier, maybe its a smart plug, maybe it's the venerable Kill-A-Watt, or a nice power strip, or an appliance cord, I have yet to encounter one of these whichdoesnt assume the ground pin will be belowlive and neutral (or, if its a polarized butungrounded cord, that the wider neutral blade will be on the left). Unless its fancy enoughto have one of those swiveling plugs, the cord would point straight up when inserted into an outlet with the supposedly superior orientation. This reason alone is enough to get me to say nahhh to the idea of flipping the outlet around. There are just far too many products out there whichwould become absolutely horrid to use. And not just from aesthetics, but from functionas well! Cable management is a lot harder when the cord just wants to flail about - and then this becomes a tripping hazard! Unless and until devices start getting shippedwith right angle plugs that support the ground-upreceptacle orientation, attempting to paint thisas correct is, to me anyway, utter nonsense. Luckily for us and our sideways outlets, right-angle plugswork no matter what! Heres how my computers power strip is plugged into the outlet under mydesk. Its a bit cheeky but its doin the trick. But wait! Theres more! Right-angle plugs greatlyreduce the risk of a cord getting dislodged in the first place. Our plugs only get droopy like thisfor two reasons: A) the receptacle is badly worn out and its not gripping the prongs well so overtime gravity pulls down on the cord and it pivots away from the wall and/or 2) they get bumped. A right-angle plug solves both of those problems by 1) being more difficult to bump into and B)the weight of its cord pulls straight down and thus it naturally hangs from this position withoutrelying much at all on the friction between the blades of the plug and the receptacle itself. It takesquite a strong downward yank on the cord just to get it to start backing out. Yet whenthe same cord is plugged into an inverted outlet, its trying to come out all on its own thanks to all its weight pulling it away from the wall. So if you ask me, right-angle plugs which assume the ground pin will be at the bottom are not only a reason to just ignore the whole upside-downoutlet argument, but right-angle plugs themselves are also a pretty good solution to theproblems inverting the outlet attempts to solve! Assuming, that is, they dont completelyoppose the orientation of the receptacle. Honestly, its awfully strange how most of ourpower cords just stick straight out from the wall a bit, isnt it? Seems like were justasking for trouble most of the time. Oh, and right-angle plugs dont even need to begrounded - heres an ungrounded extension cord with a right-angle plug. It stays flushwith the wall so is less likely to get bumped, and the weight of its cordwont try to pull it out. And yeah, the manufacturer put the cord at a 45degree angle so that no matter what orientation your receptacles happen to be, the cord isat least marginally well-organized. Plus it avoids issues with two of them being usedwith the same receptacle. If theres something you should be advocating for, I would say itwould be making the right-angle plugs the default. But maybe not this particular design. Or indeedseveral others. The main downside of right-angle plugs is that they are harder to use, especiallyto unplug. And, the slimmest among them make brushing against the prongs even more likely sinceyou kind of have to dig your nails into the sides for a good grip. Its actually quite strangehow much of a Wild West plug design is over here. These two variants are certainly the most commonthese days, but when it comes to right-angle plugs, anything goes apparently. Hes a replacementlamp cord plug and its wires go out the side! So, again, if theres something we oughta workon, Id say its getting the plug ducks in a row first. It might also be worth looking into sleeving the blades like many other countries do. Whether that can be done without breakingcompatibility with the installed base ofreceptacles is the real question, andI hope somebodys looking into it. In the meantime, dont get too hung up on the upside down or right-side up issue. As we see around Chicago, it's not even a binary. As ever, use caution when plugging and unplugging things from the wall. And now that youre awareof this issue (if you weren't already), hopefully youll look out for it. Although. I do just want to point out that Ispent 15 minutes throwing knives at the wall trying to slot one in, and although I cameclose, in the end I had to resort to movie magic and stage the thing. Take from that whatyou will. And if for some reason you feel you still cant trust yourself, why not pick up someof these? They work for children. For a while, anyway. Thanks for watching, stay safe out there,be reasonable, and eat your vegetables. pedantically smooth jazz Hey, just so you know theres gonna be aConnextras follow-up to this on tamper-resistant receptacles. They are now a code requirement fornew construction and I thought that they largely fix many of the problems we've been talking about but I did a sanity check and revealed that, uh, not all designs do so. Gonna talk about thatover on the second channel if youre interested. It would be irrelevant in the vast majorityof the time, oh. [frustration sounds] Good job, Steve, copying that. There is a weird differencebetween three plong bleuh I knew that was gonna be hard to say. Imagine youre working on [clears throat] blahbittybloobitybuddeh Imagine youre working on - Say a prayer for the next person who reaches to pick up the next what? But holding the plug wrong and getting a nice little shock from it isnt the onlyproblem we face. Some of them includea receptacle thats not cooperating. power strip is plugged into the outletunder my desk at home. Its a beet cheek OK, so hopefully we can put this issue to rest. Seriously, it irks me so much how apparently nobody considers right-angle plugs OR the fact that the \"fix\" doesn't do anything at all when two-prongers are in-use. In hindsight, the Chicago arrangement with neutral on top might be the best... But seriously, word to the wise, deep dish is for tourists, mostly. Look up tavern style. That's the real Chicago pizza.",
    "transcript_keywords": [
        "North America",
        "plug",
        "plugs",
        "rightangle plugs",
        "ground pin",
        "wall",
        "outlet",
        "cord",
        "receptacle",
        "ground",
        "pin",
        "rightangle",
        "top",
        "wall plate",
        "reason",
        "fact",
        "orientation",
        "live",
        "risk",
        "plug wrong"
    ],
    "transcript_entity_values": [
        "1",
        "50year",
        "North America",
        "GFCI",
        "Chicago",
        "two",
        "power strip",
        "NEMAreceptacle",
        "2",
        "Wild West",
        "only two",
        "today",
        "mylife",
        "at least one",
        "Romex",
        "Especiallywhen",
        "Boston",
        "first",
        "one",
        "180 degrees",
        "15 minutes",
        "these days",
        "Harold",
        "Perusethe National Electric",
        "One",
        "Chicagoland",
        "second",
        "Idunno",
        "heldon",
        "45degree",
        "andI",
        "three",
        "Steve"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "NORP",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "GPE",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON"
    ]
}