{
    "id": "vnNWor30zxg",
    "title": "Dyson Cyclone V10 Absolute Unboxing!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-03-06T17:03:42Z",
    "video_url": "https://www.youtube.com/watch?v=vnNWor30zxg",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "dyson",
        "cyclone",
        "v10 absolute",
        "unboxing",
        "testing",
        "review"
    ],
    "views": 651915,
    "likes": 9465,
    "comments_count": 1317,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, today we are unboxing something extremely exciting. I'm not sure if you guys follow vacuum news or not, and if you don't, you probably should start, because, it's actually my favorite pastime, I'm not even joking. Which makes this video even more exciting for me, because Dyson partnered with me to unbox one of their brand new vacuums. This is the Dyson Cyclone V10 Absolute. So, thank you so much, Dyson, for sponsoring this video, 'cause, I swear, this is like a dream come true. And if you've ever used used a cord for a vacuum, you might know that the suction power of these is not usually comparable to some of the upright corded ones. Well, that's where this is replacing everything. Because, this basically is replacing it. Why is this not me, this is about to be me. I just feel like I'm moving the box around. I'm not really doing anything. So, this is thing has been completely all redesigned. There's a bigger bin, which means, more cleaning. (hums excitedly) Wow! Oh my goodness. You guys. I don't know if you've ever unboxed a new vacuum before, but it is really exciting, especially if you have a dog. Granted, my dog doesn't shed, but he brings in basically everything that he can find outside, inside. I feel like I'm gonna need a bigger table. Let's open all of these things. We've got brushes. Can just, just get out everything. Oh, there's two different attachments! Wow, I... So hype. Oh, yeah, this is a dust rail. This is what I'm talking about. Okay, I think I got everything out. Digital Motor V10, it spins up to 125,000 RPMs to create 20% more suction. 20% smaller and half the weight. Wow. Tell me your secret. This is me, this is my future. This looks like it's a wall mount. Here's the directions. This here is instructions on how to mount the little charging dock. Looks pretty simple. Here is our charger. If you already have a V7, or a V8 you can also use those attachments with this new V10. This is one of the docking stations. So you can run the cord up through here, so it makes it super easy to charge. I still can't believe how light this is. (brief whirring) Whoa! I was not ready for that. Turn you down. Let's take a look at some of the attachments this comes with. So, this is one of the fluffy attachments, which you can see here. It's really fluffy. And you can use this if you're picking up bigger things. I've never used one of these before, so I'm super excited to try this out, 'cause this is something that you can use if you have big chunks of something that you need to pick up, like, some spilled cereal, for example, or, I don't know, anything that I happen to make in my kitchen. I can't wait to try this out. Oh, this is like a little mini. A little mini attachment for handheld use. Look at this. Okay, let's open this guy up. I think that I officially know that I'm an adult when I'm super excited about a vacuum. Let's take a look at this thing and see if we can get it all set up. My sister is gonna be so excited. I'll be sitting on our couch at her house, and she's vacuuming around me as I'm eating. I'm like, just leave me alone. Charge fully before use. Alright, I will do that. Oops, sorry, hit my camera. But I want to get it all set up and just see what it looks like before we charge up. (clicking and knocking) Look at this. Wow. (whirring) Oh, yeah! This is a beautiful sight! I know I'm supposed to charge it first, but I got to try it out. (whirring) Look at that. Now I'm... Now I've got a mini vacuum! (whirring and grinding) Oh, boy. Oh, I'm already picking up dirt. I wanted you stay clean, I'm sorry, but that's what you're for. You guys want any more information about the Dyson Cyclone V10 Absolute, I will put a link in the description. I'm gonna go charge this thing up, and then, we're gonna give it a test around the house. (upbeat, bright pop music) Oh, boy. This is the moment that I've been waiting for. Finally time to test this out. I also rigged a GoPro onto this, because, you know, why not? The GoPro is up, here you guys are, I'm filming at 60 frames a second. 4K, so you guys can get some really great slow-mo shots. So, I haven't put anything down on this carpet. This is just a week or so worth of of not-cleanliness. So, let's give it a clean, and I'll see what we got. (high-pitched whirring) (upbeat, bright pop music) Um, these are some Salt and Vinegar chips that I had the other day. Another problem with having a black carpet and blonde hair. It's all over. (high-pitched whirring) (upbeat, bright pop music) Jenna actually was using this one today. She was cleaning her car out. And this is the fluffy one, and it's my favorite. I've got a pretzel here. Let's just put this on the floor, shall we? Mm, pretzels. Okay. (clacking) Let's see if it can handle these big guys. (high-pitched whirring) Whoa! This is on, like, the low setting, and they're just... They're magically gone! Let's go get some more snacks to put on the carpet. Oh, this is so fun. I missed. Hmm, doesn't matter. So, we've got a few more attachments, and we're gonna try each one of these out, on a little bit of a mess, and see how they handle it. (dull knocking) Oh my gosh, I hate it. I'm so disgusted, I hate this so much! Even though I'm not necessarily the most organized person, I really don't like messes, even though my house sometimes is a little bit messy. It still drives me absolutely crazy. And, this, right now, I can't, I hate it, I'm so disgusted by it. We got to clean it up. (high-pitched whirring) (upbeat, bright pop music) I'm so happy. I'm gonna go clean the rest of my house now. I clean the carpets a lot, look how many crumbs this thing sucked up. Look how much I was missing. (clacking) (upbeat, bright pop music)",
    "transcript_keywords": [
        "Dyson Cyclone",
        "unboxing something extremely",
        "Dyson",
        "guys",
        "vacuum",
        "extremely exciting",
        "Hey guys",
        "attachments",
        "charge",
        "clean",
        "guys follow vacuum",
        "Wow",
        "exciting",
        "thing",
        "Dyson partnered",
        "put",
        "house",
        "bigger",
        "carpet",
        "super"
    ],
    "transcript_entity_values": [
        "60",
        "half",
        "20%",
        "Mm",
        "Digital Motor V10",
        "4",
        "second",
        "one",
        "the Dyson Cyclone V10 Absolute",
        "first",
        "Dyson",
        "GoPro",
        "125,000",
        "today",
        "just a week",
        "two",
        "Jenna"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "FAC",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON"
    ]
}