{
    "id": "vNtoxmwplw4",
    "title": "The Xiaomi 14 Ultra, which has an amazing camera, gets even better with this photography kit.",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-03-14T18:34:13Z",
    "video_url": "https://www.youtube.com/watch?v=vNtoxmwplw4",
    "category": "Science & Technology",
    "tags": [
        "xiamoni 14 ultra",
        "xiaomi camera kit",
        "photography kit",
        "xiaomi 14 ultra photography kit",
        "xiaomi",
        "xiaomi 14 ultra",
        "xiaomi 14",
        "xiaomi 14 ultra unboxing",
        "xiaomi 14 ultra review",
        "xiaomi 14 ultra camera",
        "phones",
        "tech",
        "the verge"
    ],
    "views": 87597,
    "likes": 3464,
    "comments_count": 49,
    "description": "One of my favorite phone accessories of 2023 just got an update. The Xiaomi 14 Ultra, which has an amazing camera by itself, gets even better with this photography kit. The kit comes with a case that features a grip with a shutter button, a zoom lever, and a handy customizable dial.  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "One of my favorite phone accessories of 2023 just got an update. This is the Xiaomi 14 Ultra, which has an amazing camera by itself but it gets even better with this photography kit. There's a special case and a grip and when you put them on the phone, you have a bona fide camera. The grip has a shutter button, a zoom lever, and this handy dial you can customize. This year's version has a bonus feature, a battery. The last version had a tiny battery that only powered the grip. This one has a 1500 milliamp hour battery that can give the phone a little power boost. You don't even have to take the grip off to charge the phone either. Plug it all in and it'll charge the phone first and then the grip second. This shutter button is great and I love this dial but honestly, my favorite thing about this grip might be the wrist strap. It's just so handy. Every phone needs a wrist strap. That is my hot take. Thank you for coming to my TED Talk.",
    "transcript_keywords": [
        "phone",
        "grip",
        "favorite phone accessories",
        "phone accessories",
        "battery",
        "update",
        "Ultra",
        "Xiaomi",
        "accessories",
        "camera",
        "TED Talk",
        "shutter button",
        "wrist strap",
        "favorite",
        "amazing camera",
        "strap",
        "version",
        "photography kit",
        "shutter",
        "button"
    ],
    "transcript_entity_values": [
        "second",
        "first",
        "year",
        "2023",
        "One",
        "1500 milliamp hour",
        "14"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL"
    ]
}