{
    "id": "VrCPrVI5dCA",
    "title": "The Pay-To-Win Gaming PC",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-01-16T18:00:34Z",
    "video_url": "https://www.youtube.com/watch?v=VrCPrVI5dCA",
    "category": "Science & Technology",
    "tags": [
        "pc",
        "amd",
        "nvidia",
        "seasonic",
        "pay-to-win",
        "gaming"
    ],
    "views": 2424372,
    "likes": 80349,
    "comments_count": 3748,
    "description": "Thank you Seasonic for sponsoring todays build. Learn more about the PX1300 and other Power Supplies here:   High refresh monitors, force sensitive keyboards, and even gamer goo. These are all the things that are supposed to enhance your performance in gaming. But do they? We put our money where their mouth is by testing out a true Tryhard PC.  Discuss on the forum:    Buy a Seasonic PX1300:   Buy an RTX 4090:   Buy an Intel Core i9 13900KF:   Buy an EVGA Z790 Dark KIngpIn:   Buy a Kit of G.Skill Trident Z5 RGB 32 GB:   Buy an Acer Nitro X 390Hz:   Buy a ROG Swift 360HZ PG27AQN:   Buy a Zaunkoenig M1K Mouse:   Buy a Wooting 60HE Keyboard:   Buy an Elgato Stream Deck Pedal:   Buy a RE20 Broadcast Mic:   Buy a Sennheiser HD 800 S:   Buy an ASUS ROG Rapture GT-AXE16000:   Buy a Herman Miller Embody:   Buy some Gamer Goo:   Buy some Ghost Gamer Drink:   Purchases made through some store links may provide some compensation to Linus Media Group.    GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 2:30 Peripherals 6:41 Speed and Luxury 7:19 A Few Extra Tweaks 7:47 You Call THIS a Computer? 9:12 The REAL Test 10:45 These are All Legal 11:56 Aim Lab 12:45 The Verdict 14:07 Outro",
    "description_links": [
        "https://lmg.gg/ZP4sm",
        "https://linustechtips.com/topic/1481829-the-pay-to-win-gaming-pc/",
        "https://geni.us/RDBnC4",
        "https://geni.us/5gTS",
        "https://geni.us/ibbH",
        "https://geni.us/AO1T",
        "https://geni.us/jw8Ni",
        "https://lmg.gg/mfzr2",
        "https://geni.us/rUmFBCD",
        "https://lmg.gg/t5aKa",
        "https://lmg.gg/4abx0",
        "https://geni.us/xkZfp",
        "https://geni.us/nihUIi9",
        "https://geni.us/rp8r",
        "https://geni.us/EAGqoHl",
        "https://lmg.gg/5mWUa",
        "https://lmg.gg/6zvof",
        "https://geni.us/C91p0",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "A high refresh rate monitor, a carbon fiber gaming mouse, a force sensitive keyboard, money. Everyone knows that these are the things that you need to be a great gamer, or that's what PC companies want you to think. Razer, Logitech, Nvidia, they all want you to feel like you need to spend big to win big. But do you? To find out, we built the most tryhard PC setup possible, buying into every single claim, frame, and mind game that PC hardware manufacturers pitch. And we're gonna see how much of an edge we really get compared to the average PC, which parts are actually worth splurging on and which are a total waste of money, you know? Let's talk hardware. Naturally, we gotta start with the best. The beastly Intel Core i9-13900K and the behemoth Asus ROG Strix 4090, because frames win games. We've proven it, and these two pretty much always get the most frames. To manage all that power and heat, we've gone with the fractal torrent, equipped with a 420 millimeter, nice, AIO from Corsair, seven 140 millimeter Noctua industrial fans, and three NFF12s at the bottom of the case for fresh air to our GPU, which we then exhaust through the front mounted radiator where we've removed the dust filters entirely for better airflow. Finally, we swapped out the stock retention bracket for a thermal grizzly bracket to give us a few more degrees of cooling on the CPU. And up in the attic lives our power supply from Seasonic, who sponsored this video. We chose their PX1300 because it's 80 plus platinum certified and so even at 20% load, this thing will be at worst 90% efficient. And all their new PSUs in the PX lineup come with a 12 volt high power connector. So you don't need this stupid octopus adapter when you put in the 4090. For the motherboard, we are using the EVGA Z790 Dark Kingpin, a motherboard specifically meant for extreme overclockers. Notice that the RAM has been moved up to the top of the board. This is specifically to reduce the distance from the CPU to improve the timings. We've used the onboard utility to overclock our CPU to 5.8 gigahertz across all cores for that extra oomph, you know? And of course, we have ample fast storage in the form of 10 terabytes worth of PCI express Gen 4 NVMe SSDs. Okay, now for peripherals. Our guiding light is latency reduction. Latency is the time between input and eventual output and is the enemy of good gaming. Every single piece in this setup is focused on reducing the time between targeting the enemy and seeing his head replaced with a thin red mist. The biggest source of latency in your system is likely going to be the display. A typical 144 hertz gaming display introduces a whopping 6.94 milliseconds of latency. Compare that to the 390 hertz of the Acer Nitro X, the fastest monitor on the market today where each frame is displayed for just 2.56 milliseconds. This nets us a nearly 4.38 millisecond reduction. That is, if you can run your games that fast. In scenarios where performance is CPU limited, like we are, preventing us from running all of our games at 390 frames per second, you might want to consider the Asus ROG Swift PG27AQN, which is 1440p and 360 hertz, meaning you can trade 30 hertz for extra image clarity. We have both here, but to reduce GPU overhead, we'll be unplugging our second monitor while gaming. And for peripherals, the Azzoun Konig M2K, okay, this is the M1K, but they were all out of M2Ks and this uses the same sensor and switches, so for our purposes, it works. At just 24 grams, you are basically holding nothing. This mouse doesn't waste time with side buttons or even most of the mouse. What it does have is two clicks and a scroll wheel, or well, the M2K has a scroll wheel, and 8,000 hertz polling rate, which means that your inputs will be delayed at most, 0.125 milliseconds, eight times faster than other Pidley Gamer's 1,000 hertz polling rates. And if you simply cannot stand the shape, then maybe recommend the more normy Razer Viper 8 kilohertz. While it does come in at nearly three times the weight of the Azzoun Konig, it has the same polling rate and sensor, and it is a lot easier to buy. We're using a glass mouse pad for maximum slidedge. Feels like you're moving on nothing at all, nothing at all, nothing at all, damn sexy Flanders. Our keyboard is the Wu Ting 60HE. What makes this so special is that each switch is actually an analog input, meaning we can do things like partially push our keys down to walk rather than run. And we can set our actuation point to 0.1 millimeters. A typical key switch actuates at around 1.5 to two millimeters into the keystroke. So that takes about five milliseconds more for that key press to register just by the force of the action alone. By setting our actuation points so much higher, our key presses will register 15 to 20 times faster than the competition, just 0.25 milliseconds. The catch is that our keyboard only has a thousand hertz polling rate, meaning that the average latency will still be one millisecond. The only way we could improve this is if the next revision adds 8,000 hertz polling. What makes this actually the best for gaming is that it's an optical instead of a mechanical switch, meaning there's no debounce delay at all. So as soon as you unpress a key, it's instantly unpressed. To ensure that no inputs get lost in the high polling rate fray, we plugged our devices into different USB controllers on our motherboard. You can use your motherboard manual to see which ports are managed by each controller. Oh wait, there is one other input that we forgot to talk about, our foot pedals. We can't afford to move our fingers away from those WASD keys, so we got Elgato's Stream Deck foot pedals to quickly and easily map some of our less time-critical inputs to, things like reloading or taunting. The polling rate on this is not nearly as high as we would hope, but we might be able to overclock the thing for a little bit lower latency. That's a whole other can of words. Finally, we have our audio solution. For the clearest comms, we went with an ElectroVoice RE20 with the Dynamite preamp connected to our Audient EVO interface. For the front end, we went with the Sennheiser HD 800S for its incredible sound stage, which allows us to pinpoint the footsteps of our enemies with ease. Oh yeah, and we even got the ultimate gaming router, the ASUS ROG Rapture, a quad band gaming router that has tweaks to optimize network traffic for gaming. Oh, and naturally, we have the Herman Miller Embody gaming chair for maximum ergonomics and comfort. We also made some tweaks. We disabled background processes like Windows Defender, which is always a good idea. We've disabled Wi-Fi on the motherboard to reduce EMI and CPU interrupts. We've turned on multi-core enhancement, set windows to GPU accelerated scheduling, and ultimate performance power plan, set XMP on, and we've given our CPU and GPU a slight overclock to get a little bit of extra performance. We aren't pushing too hard as stability is paramount for the sweaty, tryhard gamer. Okay, enough theory crafting. Let's see if all of this is worth it by testing it with real gamers. And by gamers, we mean Linus. Sup? No, wrong one. Oh, get out of here. We're gonna compare our two setups. This is the most average gaming PC. We've made one upgrade, a 144 hertz monitor. Sure. We're gonna compare that to the full tryhard setup. The sweatiest gaming PC. Absolutely. Get your bearings here, enjoy it, play a game with the most common peripherals, the typical kind of experience. A desk mat from lttstore.com. Is there anyone else on this map? Am I, is there supposed to be people to fight or what? Get out of here. There's no bots. What the hell, Jake? Okay, just press escape, go start a bot match. Or you can play a real match and see how you do. I never used to feel like the G502 was heavy. It's kind of heavy by today's standards. I use a G Pro wireless at home and it's a lot lighter. Okay. Oh, shoot. Wow. Okay. That was probably the heavy mouse. That was probably because of the heavy mouse. No, no, no. Oh, shoot. No, come on, come on. Ah, shoot. Oh, shh. No. Ah, come on. No. Hold down tab. That's where you are on the leaderboard. Well, you know what? It's hard. See that? He was at the very bottom. It is hard. Yeah, it's hard. What if we could upgrade your game? All right, let's try the upgrade. All right. Welcome to the tryhard setup. 999 frames per second. This is the mouse? Yes. It weighs about 23 grams. Wow. Okay. And we have you equipped with the wooting 60 HE. Whoa. This is like a hair trigger keyboard. Because it's an optical and analog switch, you can set the actuation point as high or as low as you want. I've set it to 0.1 millimeters so that the moment you want to make an action, you go. It also has rapid trigger. So the moment you relieve any pressure from the key, it just stops sending a signal. You don't have to wait for it to cross back over the actuation point again. Wow, that's pretty cool. What is this doing here? That's for your comms, for your team. That's okay. And also we equipped you with the best headphones you could find for sound stage. Okay. I should definitely try without sound first for apples to apples here. Is this a 390 Hertz monitor? It is. It's the fastest monitor currently on the market. Okay. Okay, got him. Come on, he's right there. What do you mean I only hit him three times? Okay, here, I have a solution. No. You're getting clammy ham. Do you need to use gamer goo? Which flavor would you like? And it comes in. Oh, I'm liking the weight of this mouse. I'm not liking the shape very much, but not gonna lie. Kinda actually feeling it. Okay, what's the gamer goo? Fine, stop swaying hands. We got different smells. I don't care what the smell is. We got orange, peppermint. We'll put some on your hands so you can improve your grip. It's kind of a shiny mouse. This is chaos. Also, we've brought you some Ghost Gamer Neutropics. What, I don't, that's stupid. So a nootropic, it's brain enhancing chemicals. These are all legal. What are you even talking about? I'm trying to enhance your performance, Linus. Well, it's not gonna do anything instantly. Well, I should've taken it 15 minutes ago, because that's the amount of time it takes for caffeine to kick in. That's the important thing to know about all of these. The actual thing that matters is the caffeine. So you can just dry scoop it right now if you want. Sure. I'm gonna get him some water. Oh God, he's gonna die. I'm fine. Very unpleasant, not recommended. Honestly, there's too much randomness with just people being flippin' everywhere in this tip. Okay. Let's go into Aim Lab. Just press Steam, it's right there. No, I won't. Oh my God, how do I even? Oh my God, I don't have a mouse wheel. I don't know how to use a computer without a scroll wheel. How do you actually? Well, the good news is that the newer version of this mouse does have a scroll wheel, but the company only makes a certain amount every year, and they ran out. They're like two guys, they're working really hard. Okay, all right, all right. I'm probably not gonna do very well. Oh yeah, I definitely feel sweatier. I'm a sweatier gamer for sure. Okay, 68% accuracy. So I am above average, barely. Which means that you'll probably be worse when you're not performance enhanced. But I should have more caffeine in my system with my heavy ass mouse here. All right, I got better. Okay, now you wanna come back and try this test over here? What did I get that time? Oh wait, I guess it's a different test. You had 45,000. Okay, all right, I'm familiar with the test now. Okay, let's try the sweaty setup. 49,297. That's it, that's an improvement. Yes, barely. Probably just me doing the test three times would account for that much improvement. But hey, 69% kill total, nice. Oh yeah, and just so you know, this computer, this whole setup, it's $11,000. This one is about, it's about 600. So that extra $10,400. It's probably better invested in some coaching. Yeah, yeah. Or practice. Practice, but that's not the point. Pay yourself to practice. But what do you think about some of these parts? Do you think that any of these actually make a huge difference? This is a huge difference maker for me. That's a fact. Yeah, oh yeah. Scores and tests aside, which are affected by a human element, what is the actual difference in latency between one system and the other? On this system, the average end-to-end latency, so from click to when you see something happen on your screen, that's 12 milliseconds. Really? Yeah, which is a lot faster than the average PC, which is 26 milliseconds. And yet I still can't really feel the difference between them. Ha, we are really at a point of diminishing returns here, aren't we? Especially when you consider human reaction speeds and stuff like that, is it around the 180 to 280 millisecond range? Yeah. You're talking about less than a 10th of your own human reaction speed. Right. But in the event where two people across the planet click at the exact same time, this system's gonna win out pretty much every time. Dammit, I haven't gotten all five of them a single time. Ah! If you liked this video, why don't you watch the one we did on the most average gaming PC, since that's really all you need evidently.",
    "transcript_keywords": [
        "carbon fiber gaming",
        "gaming",
        "mouse",
        "hertz",
        "fiber gaming mouse",
        "yeah",
        "hertz polling",
        "hertz polling rate",
        "polling rate",
        "CPU",
        "time",
        "gamer",
        "latency",
        "milliseconds",
        "Asus ROG",
        "polling",
        "carbon fiber",
        "average",
        "refresh rate monitor",
        "times"
    ],
    "transcript_entity_values": [
        "Elgato",
        "the M1K",
        "hertz",
        "1,000",
        "one",
        "PX",
        "normy Razer Viper",
        "two millimeters",
        "seven 140 millimeter",
        "Seasonic",
        "eight",
        "Corsair",
        "45,000",
        "EVGA",
        "GPU",
        "Audient EVO",
        "Pidley Gamer's",
        "just 24 grams",
        "Logitech",
        "10 terabytes",
        "three",
        "11,000",
        "10,400",
        "Linus",
        "Herman Miller",
        "Aim Lab",
        "AIO",
        "Intel Core",
        "G Pro",
        "49,297",
        "Gen 4",
        "M2Ks",
        "first",
        "Hertz",
        "6.94 milliseconds",
        "about 23 grams",
        "80",
        "EMI",
        "just 2.56 milliseconds",
        "XMP",
        "15 to 20",
        "5.8 gigahertz",
        "12 volt",
        "Flanders",
        "CPU",
        "just 0.25 milliseconds",
        "0.1 millimeters",
        "60",
        "12 milliseconds",
        "90%",
        "one millisecond",
        "420 millimeter",
        "ASUS ROG Rapture",
        "about five milliseconds",
        "the Azzoun Konig",
        "Razer",
        "30",
        "20%",
        "all five",
        "Sennheiser HD 800S",
        "Wi-Fi",
        "two",
        "26 milliseconds",
        "999",
        "second",
        "Jake",
        "WASD",
        "the Acer Nitro X",
        "69%",
        "15 minutes ago",
        "around 1.5 to",
        "today",
        "Wu Ting",
        "0.125 milliseconds",
        "4090",
        "Windows Defender",
        "Stream Deck",
        "PCI",
        "the M2K",
        "RAM",
        "8,000",
        "180",
        "G502",
        "390",
        "Dynamite",
        "Nvidia",
        "USB",
        "68%",
        "Asus ROG Strix 4090",
        "about 600",
        "thousand",
        "144",
        "Dark Kingpin",
        "Noctua",
        "nearly three"
    ],
    "transcript_entity_types": [
        "ORG",
        "FAC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERCENT",
        "TIME",
        "CARDINAL",
        "DATE",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}