{
    "id": "vSHBaHURLqU",
    "title": "Are Apple's M1 Macs THAT Good?",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-12-04T18:01:34Z",
    "video_url": "https://www.youtube.com/watch?v=vSHBaHURLqU",
    "category": "Science & Technology",
    "tags": [
        "apple",
        "silicon",
        "mac",
        "macbook",
        "m1",
        "x86",
        "cpu",
        "soc",
        "rosetta",
        "performance",
        "compatibility",
        "intel",
        "amd"
    ],
    "views": 352579,
    "likes": 16458,
    "comments_count": 1076,
    "description": "Learn through problem solving, and the first 200 people can save 20% today on Brilliant at   What should you know about the new systems based around the non-x86 Apple M1?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://brilliant.org/Techquickie/",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- A short while ago, we did a video on what we might expect from Apple's in-house silicon after it was announced this past summer. But now the first systems with the Apple M1, the inaugural chip in the new Apple Silicon series, are on the market. So let's take a closer look at how the chips perform, and the innovations under the hood that Apple hopes will make the M1 a home run. A cursory glance might make you think that the M1 is just a souped up mobile chip, as it is quite similar to the A14, in the current iPhone 12 lineup, with four high performance and four high-efficiency cores. And it has I/O controllers and built in memory that makes it more of a mobile system on a chip than a plain CPU. But Apple claims that it's the world's fastest laptop CPU. And early reviews actually show that this claim isn't really unfair, with many commentators gushing over its performance. But how did Apple pull this off without fundamentally changing the design from what it's using in its smartphones? Part of the answer is that Apple used a lot more transistors in the M1 than the A14, over 4 billion more according to the company. But while this may have boosted performance, the real secret sauce lies in how Apple's design, both in the A14 and the M1 fundamentally differs from x86, which is the architecture that AMD and Intel have been using for decades. Apple's philosophy was to make the chip much more parallel than conventional CPU designs. Both the M1's decoder which translates incoming instructions, and the execution units that actually process them, are wider, meaning they can accept more instructions at once. Additionally, the M1 can go significantly deeper with out-of-order execution, meaning that it can read ahead on the page and anticipate which instructions the program will need to have processed ahead of time to a greater extent to that of x86. Then you have the fact that the M1 features a lot more Level 1 cache than x86 processors, which is the fastest cache memory available to a CPU core. And because it's based on a chip originally meant for mobiles, it does all this while drawing significantly less power. But hold on a second, couldn't Intel and AMD just implement some of the changes themselves and catch up with Apple? Well, it turns out that might be quite a challenge as the x86 architecture has some inherent limitations. For example, AMD and Intel could just try and add more L1 cache, but it's extremely difficult to make decoders much wider than they are now on x86 chips, so, can't win them all. So does this mean that Intel and AMD are in huge trouble? Well, like any new impressive piece of tech, the M1 isn't without its weaknesses. You see, although early reviews have reported very impressive performance gains in first party apps that have been written for Apple Silicon, the M1's speed benefits in other applications have been more modest, as programs written for x86 have to be emulated, which introduces significant CPU overhead. And because the emulation process is imperfect, there have also been stability issues with a number of popular programs, even though they were written for late model Mac hardware. But Apple is betting that because developers who have large user bases on the Mac platform would like to keep it that way, those developers will adapt and come out with versions specifically written for the M1 sooner than later. This approach is more or less in line with Apple's playbook for other new products. They bring a new platform to market and then use their brand power to force developers to catch up, which is something that they hope will again happen with the M1. Ultimately, it's not hard to imagine offering a more tightly controlled App Store experience for Macs, with programs being specifically vetted for full compatibility with Apple Silicon, especially as we expect to see more of Apple's chips in desktop Macs down the line after seeing how powerful their first crack at a laptop processor has been. Now I'm in the mood for some apple chips with a side of peanut butter. You wanna learn something new, brilliant is the place to do it. Brilliant is a website and app that makes learning accessible and fun. Their approach is based on problem solving and active learning. It's about seeing concepts visually and interacting with them, and then answering questions that really get you to think. Their courses are laid out like a story and broken down into pieces that you can tackle a little bit at a time. There's no tests and no grades, you just pick a course based on what you're interested in, and then get started. And if you make a mistake, no big deal. Just check out the explanations to find out more. You can learn at your own pace, and there's really something for everybody, whether you wanna brush up on the basics of algebra, learn programming, or learn about cutting edge topics like neural networks. There's even some advanced stuff like differential equations if you're into that sort of thing. The first 200 people who head to Brilliant.org/Techquickie will get 20% off an annual premium subscription. So check it out. Thanks for watching guys. If you liked this video, give us like, give us a subscribe, and be sure to hit us up in the comments section with your suggestions for topics that we should cover in the future.",
    "transcript_keywords": [
        "Apple",
        "Apple inhouse silicon",
        "Apple Silicon",
        "Apple chips",
        "Apple Silicon series",
        "Apple inhouse",
        "short while ago",
        "past summer",
        "announced this past",
        "CPU",
        "chip",
        "inhouse silicon",
        "AMD",
        "Intel",
        "make",
        "silicon",
        "chips",
        "Apple design",
        "Apple claims",
        "Apple hopes"
    ],
    "transcript_entity_values": [
        "the Apple M1",
        "Intel",
        "20%",
        "A14",
        "second",
        "200",
        "this past summer",
        "annual",
        "App Store",
        "Macs",
        "4 billion",
        "first",
        "AMD",
        "M1",
        "AMD",
        "Brilliant.org/Techquickie",
        "four",
        "iPhone 12",
        "Mac",
        "CPU",
        "Level 1",
        "decades",
        "Apple Silicon",
        "Apple"
    ],
    "transcript_entity_types": [
        "FAC",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "LAW",
        "DATE",
        "ORG",
        "ORG"
    ]
}