{
    "id": "vsi3xRXryUA",
    "title": "2017 13\" Razer Blade Stealth - The Perfect Laptop?",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-06-23T17:18:38Z",
    "video_url": "https://www.youtube.com/watch?v=vsi3xRXryUA",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Razer Blade Stealth",
        "Screen",
        "13 Screen",
        "13.3 screen",
        "bigger screen",
        "xps 13",
        "versus",
        "best laptop",
        "best ultrabook",
        "best gaming laptop",
        "thinnest laptop",
        "thinnest ultrabook",
        "external GPU"
    ],
    "views": 993612,
    "likes": 15633,
    "comments_count": 1518,
    "description": "Dave2D review of the best laptop from Razer. They nailed it! Skins -  Stealth Here -  Blue SSD Here -   External GPU Video -    Music Credits: Background: Fili - H2O  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://dbrand.com/razer-blade-skins",
        "http://amzn.to/2tX2Jh7",
        "http://amzn.to/2kKatOh",
        "https://youtu.be/BOFZGCwoRmo",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going? Dave2D here and this is the 13 inch Razer Blade Stealth. And this is kind of exciting for a lot of people that know about this product, because when it launched it was a great product, but those bezels were extra thick and I guess Razer listened, so now we have this. It has the same external dimensions and finishes. It's got great build quality, one of the better built ultrabooks. The black finish is really nice, but I highly recommend putting a skin on the Stealth. I'm using the Black Dragon from DBrand and I know the skin looks nice and all, but the big thing for me is protection. A scratch on a black laptop looks extra ugly. I nicked my old one and it sucks. I'll link these skins below. Now, there is another color called gunmetal grey, it's a very muted look, it's all grey, there's no light-up logo and even RGB keyboard is gone, it's only white backlighting. I will take a look at the gray one in a couple weeks, but if you want RGB lights, you got to go with this one: the black version. The ports also haven't changed, there's one HDMI, two USB-A ports and a Thunderbolt 3 port, that's also used for charging. The internals look pretty much the same. The RAM is soldered on, again. But this time it has 16 gigs of RAM which is very roomy and something that a lot of enthusiasts were asking for. The SSD is replaceable, you've just got to remove the ribbon cable, again. But sadly, it's still using the PM951 drives, which have relatively slow write speeds at the lower capacities. It's not a terrible drive, it's just that there are so many better drives out there that they could have used, it's kind of disappointing. The battery size remains the same at 53.6 watt hours, but I'm getting less battery life. Running the same loop as usual, it's clocking in a little over seven hours. Still very good, but it's about 40 minutes less than the older model. And I think it's just because the screen is bigger, there's just a larger surface area to light up. Now speaking of screens, there's two screen sizes available: the older 12.5\" panel and the new 13.3\" panel. I have a strong preference for this one. It's got a great color gamut and the accuracy is also pretty good, after calibration. I do wish it was brighter, it's perfectly fine indoors, but especially with that glossy screen, it's not ideal for bright environments. But that bezel, it's shrunken down and it just looks so much better. I mean a lot of you guys have complained about the older thick bezels, and they did something about it which is awesome. Another thing they've changed is the trackpad. It seems to be the same size and it's got the same glass texture, the button mechanism feels slightly different to me than the older one. That one had a more pronounced click. But the tracking on this new one is so much better: Windows precision drivers, finally. I never loved the trackpad on the original Stealth. This new one is great. Performance is as expected. It's a KabyLake i7 and with 16 gigs of RAM, it will crush any kind of media consumption, work or school stuff that you throw at it. Video editing on 1080p footage will be pretty decent, if you have an external drive. 4K footage is going to be gnarly, but it's an ultrabook. Now, one of the things I need to make clear is that the Razer Blade Stealth is not a gaming laptop. I mean it's made by Razer, but it's not designed to play games on its own. It's running an HD 620, the integrated graphics chip from Intel and, I mean, you can play some light games and still get reasonable frame rates, if you turn everything down and play at the lowest resolution. But the Razer Blade Stealth was one of the first laptops to support external GPUs over Thunderbolt 3 and even in mid 2017, this is still one of the best setups for the job. I connected to the Razer Core running a GTX 1080 and it's a super easy hookup, it's basically plug and play. Now, gaming performance is really good, but like all Thunderbolt 3 GPUs, performance is going to be around 10 maybe 15% less than direct connection on a desktop, and remember, you want to use an external monitor for the best performance. Now, if you're interested in learning more about this particular setup, I'll put a link in the video description. Thermal performance remains the same, nothing is too hot, nothing's too loud. Razer did a pretty good job on this thing. So, obviously there's a lot of stuff I like about the Stealth, but for the sake of being thorough and for the people that just want to hate on something, there are a couple things I got pick at. First is the keyboard. I think it could be better, it hasn't changed since launch or at least not in any way noticeable to me, it's decent and I like the RGB lighting, but I wish it had a bit more travel on each stroke. And the functional markings still don't light up, so if you want to adjust volume or screen brightness in the dark, you've got to memorize wich keys to press. The speakers could also be better, I mean they're positioned well, I mean good stereo separation, and they look cool, but I just wish they had better audio quality. The 12\" MacBook and some of the HP Spectre laptops have better speakers, but that's about it, Razer took a really good laptop, fixed everything that people had to complain about it and we have this. There is however something that kind of casts a bit of shade on all this awesome stuff. The Razer Blade Stealth has actually been one of the best values ultrabooks on the market, which was weird because it's Razer and they normally have more premium pricing, but this one costs $1400 at the base model. I mean, it's significantly upgraded compared to the old one, but it's like 50% more expensive. So, with the new Stealth, I think they did a great job on it, it's pricey, but I think it's going to be a very popular device. It has the same great build quality as before, the 13.3 inch screen has very good color accuracy and the bezels are finally smaller, but it could be brighter. The RGB keyboard is spaced comfortably, but the keys do have a shallow stroke. The trackpad is glass again and tracking software is much improved this year. Inside, the KayLake CPU and the HD620 are quietly cooled and deliver strong performance for an ultrabook. The 16 gigs of RAM is soldered on. The included SSD isn't super fast, but it is replaceable. And the 53.6 watt-hour battery will last around 7 hours. So, should you get this thing? Honestly, if you just bought the old Razer Blade Stealth, I feel bad for you son, because this one is so much better. It is a lot more expensive, there's that, but if you're looking for an ultrabook and you can afford this thing, this one's really good, ok.",
    "transcript_keywords": [
        "Razer Blade Stealth",
        "Razer Blade",
        "Blade Stealth",
        "Razer",
        "Stealth",
        "good",
        "inch Razer Blade",
        "Blade",
        "great",
        "RAM",
        "Performance",
        "RGB",
        "thing",
        "black",
        "screen",
        "lot",
        "gigs of RAM",
        "Razer Core running",
        "RGB keyboard",
        "Razer Core"
    ],
    "transcript_entity_values": [
        "HP Spectre",
        "53.6 watt hours",
        "Thunderbolt 3",
        "13.3",
        "HD620",
        "HDMI",
        "the KayLake CPU",
        "4",
        "MacBook",
        "Razer",
        "a little over seven hours",
        "gunmetal grey",
        "USB",
        "one",
        "this year",
        "13.3 inch",
        "First",
        "12.5",
        "RGB",
        "16",
        "DBrand",
        "GTX",
        "Razer",
        "Razer",
        "1400",
        "around 7 hours",
        "the Black Dragon",
        "13 inch",
        "two",
        "3",
        "PM951",
        "KabyLake",
        "SSD",
        "first",
        "mid 2017",
        "15%",
        "53.6 watt-hour",
        "Razer Blade Stealth",
        "a couple weeks",
        "RAM",
        "The Razer Blade Stealth",
        "12",
        "Intel",
        "the Razer Core",
        "about 40 minutes",
        "1080",
        "50%",
        "1080p"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "FAC",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "PRODUCT",
        "PERSON",
        "MONEY",
        "TIME",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERCENT",
        "QUANTITY",
        "PERSON",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERCENT",
        "CARDINAL"
    ]
}