{
    "id": "VSMtrNml9G0",
    "title": "NEW Apple Store - Vienna, Austria",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-03-05T07:29:20Z",
    "video_url": "https://www.youtube.com/watch?v=VSMtrNml9G0",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "apple store",
        "vienna",
        "austria"
    ],
    "views": 238663,
    "likes": 9225,
    "comments_count": 915,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- So right now, we are in Vienna, Austria. And we are going to the Apple Store. This Apple Store just opened probably a week ago, and it's the first Apple Store in Austria, so this is really, really exciting. It's like so close, I can feel it. (upbeat music) (pedestrians chattering) There it is, look! There it is! Everyone's like, Justine, why are you going to Vienna? This is why I'm here, we are gonna go in. It's like I've never seen an Apple Store. My heart. (upbeat music) There are a lot of people in there. - Can I get you a picture of it? - Yes, of course I want to get a picture! I want like 500, can you do a whole photoshoot? - [Photographer] Yeah! - Okay. (upbeat music) We're gonna go in. This is a really, really big deal, because there's never been an Apple Store in Austria before. So this is the first one. This is actually the 501st Apple Store that Apple has opened. Okay, Jen. - [Jen] I don't want to do it. - Just hold it. You've just got to hold it. - Let's go. Where's our friends? - We have to find our friends, so we met a new friend, Daniel, we met him in Graz, and he works here at the Apple Store. - Where is he? - But first, let's take a look at the drones. Right now we're inside the Apple Store, and this could not be a more exciting moment. This is the first floor, we're gonna head up to the second one after we explore this. - Justine? - Yes! - Why are you here? - I'm here to go to the Apple Store. - Oh my God! - This is actually an 8k screen. So there's only two of these screens, and one is in Austria and the other one is at the main Cupertino Campus and here it is, 8k. - [Jen] I think it's bad for your eyes. - I'm sitting very close to it. Come on, let's go! (upbeat music) Welcome to upstairs. I'll have to check in in Swarm. If you guys don't know what that is, it's okay, because I don't think anybody uses it anymore, except me and Jenna. (customers chattering) So let's take a look out the window. From the second floor, here's the view. (customers chattering) - Hey! - Oh my god, hi! - How did you find us? I mean, surprise, we're at the Apple Store. - Yeah, okay, it's a big surprise. - Where else would you guys expect to find me? Here, at the Apple Store. I'm so excited! Congrats on the new Apple Store, this is very exciting. - It is so amazing, it's our first Apple Store in Austria and it opened, I guess, last week. - [Justine] Yeah. - And yeah, it is amazing, it's amazing. - We just got some inside info, we're not sure if this is 100 percent true, but it's rumored that these trees were imported from South America. Because there's really not much new construction here, this use to be an old Esprit building since they went bankrupt, then Apple bought it and then they remodeled it, and now it's beautiful. - [Jen] The trees. - But like, I don't know what to do now. Maybe I buy something, let's go shopping! - [Jen] You need anything? - Oh, yes I do. So, because I plan on coming back when it's not freezing, so that I can be here. - [Jen] Do you need that? - Look at this! I don't need that. - [Jen] Let me tell you what you don't need. - That was a mistake that I made. Where did I buy that? I got that at the South Hills Apple store? - [Jen] Yep. - [Man] Beep, beep, go racing car, backing up! - So self-checkout can only be used in Apple Stores within your home country. - [Jen] Good to know. - Good to know. It's real. It's real! This is a real wall. It's real leaves! - How do you water it? - I actually can't believe that this is a real plant! Okay, so I think I've completely exhausted every single thing that I could do here. So I think it's officially time to move on. But if you think I'm gonna stop filming until I actually leave this building, you're crazy, 'cause I'm not. Downstairs. Let's see it, back downstairs. Beautiful. Wowee. (upbeat music) But I'm wearing my favorite Apple Watch, so if I buy another one, it's just not gonna be my favorite. So, I think I made one purchase. I'm satisfied with it, now we can leave. Thank you. Another fun fact that I read online, is that they have over 150 employees and they speak over 44 languages. That's pretty impressive, 'cause I can barely speak one. (upbeat music) So now we're gonna go to the zoo, and this is one of the oldest zoos in the world. - The oldest zoo? - The oldest zoo, and we're gonna take the subway. Now, where I'm from in Los Angeles, our public transportation is awful. So that's right here? - Yep. So this one, is that one. - Oh my gosh, it's so pretty! Wow, everything is beautiful. (chill electronic music) Which one is still, this one? This one? That says still. - [Daniel] This one is sparkling water. - No, no, no, no. It's crazy, because at our Starbucks, everything is to-go, but they actually have real plates that you can eat here. There's places downstairs that you can sit. (chill electronic music) This is your subway? - Yeah, yeah, it's beautiful. - Okay, 'cause you go into a subway in New York and it's like a trash bin. This is beautiful. - It's an actual pizza wrap? - Yeah. - It's a normal subway! - No, we're at the mall right now! This is so nice. (laughing) Light! (upbeat electronic music) So when I was looking online, I downloaded a PDF map and there is a lot to see here. I don't think we're gonna be able to see it all because it closes in two hours so we're just gonna see as much as we can. See some animals. I heard they have panda bears here too. - Yeah. - Yes, oh my gosh. - Yeah, I love them. - We have to find them! - Pandas, elephants, if they have giraffes. (upbeat electronic music) Let's go to the Giraffen Park. - Ooh, Giraffen Park? - Am I saying that right? Giraffen? - It is Giraffen or Schlafen. - So not Giraffen. (laughing) Oh my goodness, this is so cool. (upbeat electronic music) Thank you. We're inside the panda area but I don't see, do you see it? - [Jen] Yeah, here's one there and there's one up there. - [Justine] I don't see it either? - [Jen] No here, outside. - [Justine] Oh, outside? - [Jen] Outside. - [Justine] How am I supposed to see that? - [Jen] I don't know, yeah, you just have to use your imagination. (calming music) - The cheetah was very close. So now there's a feeding happening over here. Looks like there's penguins and seals and polar bears. (upbeat electronic music) We've seen so many amazing animals but now we're heading into the rainforest area, so it's gonna be nice and tropical. Does that say humidity 80 percent? Oh no, I'm steamed up. You've steamed up too. - [Jen] We're in the rainforest now. I wanna get close. - So if you can't tell, the humidity in here is crazy and everything's getting steamed up. (otter squeaking) Oh my god, they are actually flying around. (water gushing) (people chattering) Oh my god, this is really scary. I think my lenses on the inside's steamed up. - [Jen] Yeah, I think mine is too. Shoot. - It's so humid. Oh wow! We made it into the elephant area and it is the worst smell I've ever smelled in my life. This is disgusting. - Feel like they're saying the same about you. - [Justine] I'm gonna act like you didn't say that. (upbeat music) Smile Smile Smile Smile Smile Smile Smile Smile - Erdmannchen! - Erdmannchen! - Oh, you're peeing! - He's peeing! - [Jen] Really? No way! I don't know! - He definitely peed. - He peed! - That was definitely a pee. Oh my goodness. (speaking in foreign language) I'm a gas station. We've been working on our German. Clearly not going so well. So now, oh shoot, now I forgot how to say it again. The castle? - The castle. (speaking in foreign language) - We're going there. Super excited about it. This pathway's so beautiful. I love it. (hip hop music) This would be so great to fly drones, but the drone laws in Austria are extremely strict. I was reading some article, they were talking about. You can get, like, six months in jail. I'm like, you know what, I think I'm gonna leave the drone at home. I don't wanna be stuck in Austria in jail. This actually looks like a college campus. This is crazy, we're on the other side now of the castle where we just were. This place is massive. We just called an Uber, so Uber's coming pick us up at the castle. I also just dropped my camera, so if it's not working, that's why. (hip hop music) Do you guys remember when we were in Germany? It was two summers ago, and this song was all we played, because it was on the top hits at the time. What did you say it was again? - The One Who is Always Laughing. (singing in foreign language) What a hit. - We should go quick. - Okay, they close at six o'clock. We're finding something to wear home on the plane because all the stuff that we have now is dirty. So is this like a popular brand here? What is this called? Naked town? - Naketano. - Naketara? - Naketano. Naked town (laughs). - I'm gonna be super comfy and super toasty on the plane. - Me too. And this is where we leave you, where we started, back at the Apple Store again. Time to go home and pack and we have an extremely, extremely long flight tomorrow, because we have a layover in London and then 11 plus hours from London back to Los Angeles. Thank you guys for watching, I'll see you in my next video. Bye, and thank you so much, Austria for an incredible time. And thank you to our new tour guides! Yay! - Bye! - See ya. (upbeat music)",
    "transcript_keywords": [
        "Apple Store",
        "Smile Smile Smile",
        "Apple",
        "Store",
        "Smile Smile",
        "Hills Apple store",
        "Austria",
        "Yeah",
        "Smile",
        "South Hills Apple",
        "Store in Austria",
        "Smile Smile Erdmannchen",
        "Giraffen",
        "beautiful",
        "real",
        "Hills Apple",
        "Apple Watch",
        "close",
        "Giraffen Park",
        "favorite Apple Watch"
    ],
    "transcript_entity_values": [
        "500",
        "the Apple Store",
        "second",
        "one",
        "New York",
        "the South Hills Apple",
        "This Apple Store",
        "the 501st Apple Store",
        "Justine",
        "Apple",
        "Apple Stores",
        "only two",
        "over 44",
        "11 plus hours",
        "last week",
        "South America",
        "Graz",
        "six o'clock",
        "Swarm",
        "over 150",
        "Giraffen",
        "Los Angeles",
        "the Giraffen Park",
        "Naketano",
        "100 percent",
        "Schlafen",
        "Daniel",
        "Jen",
        "Giraffen Park",
        "Starbucks",
        "two hours",
        "Austria",
        "Esprit",
        "Apple Store",
        "six months",
        "Cupertino Campus",
        "German",
        "8k",
        "first",
        "Jen] Outside",
        "Erdmannchen",
        "Wowee",
        "Germany",
        "Apple Watch",
        "two summers ago",
        "Naked",
        "Vienna",
        "a week ago",
        "80 percent",
        "tomorrow",
        "Jenna",
        "London"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "FAC",
        "ORDINAL",
        "CARDINAL",
        "GPE",
        "FAC",
        "FAC",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "LOC",
        "GPE",
        "TIME",
        "GPE",
        "CARDINAL",
        "PERSON",
        "GPE",
        "FAC",
        "ORG",
        "PERCENT",
        "GPE",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "TIME",
        "GPE",
        "PRODUCT",
        "ORG",
        "DATE",
        "FAC",
        "NORP",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "GPE",
        "ORG",
        "DATE",
        "PERSON",
        "GPE",
        "DATE",
        "PERCENT",
        "DATE",
        "PERSON",
        "GPE"
    ]
}