{
    "id": "VsNHrAzx5_w",
    "title": "Contactors: how we power the big stuff",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2023-04-24T17:26:55Z",
    "video_url": "https://www.youtube.com/watch?v=VsNHrAzx5_w",
    "category": "Science & Technology",
    "tags": [],
    "views": 1092881,
    "likes": 47938,
    "comments_count": 2741,
    "description": "I really hope this clicks for you. Links 'n' stuff: A card popped up for a video exploring the Ford Mustang Mach-E's battery pack contactors. Here's a link to that video - and you should absolutely subscribe to the Weber Auto YouTube Channel if you have any interest in the tech behind hybrid and electric cars!   Other videos of mine that clicky-things popped up for: Why Switches are Clicky   All About Thermostats   Electric Vehicle Supply Equipment (car chargers)   Technology Connextras (my second channel where stuff goes sometimes)   Technology Connections on Mastodon:   The TC Subreddit   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!",
    "description_links": [
        "https://youtu.be/sZHN3fjDtpc",
        "https://youtu.be/jrMiqEkSk48",
        "https://youtu.be/ZZC0SP02PqY",
        "https://youtu.be/RMxB7zA-e4Y",
        "https://www.youtube.com/@TechnologyConnextras",
        "https://mas.to/@TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "What do you do when you need to control an electrical device? Most of the time we use simple switches. Any device, be it a light bulb, desk fan, or toaster oven needs to be part of a complete breakfast sorry, circuit in order for it to work, so if we put a break somewhere in the circuit then its no longer complete and power cannot flow through it. And thats all that most switches do: a light switch like this is really just two weird little bits of wire that come together in the middle, and when the plastic toggle is moved to the off position, theyre pulled apart so power cannot flow through the switch anymore. Ideally that happens with a snap-action to minimize arcing, and thats why most switches make a clicking noise, but thats a topic for another video that Ive already made. But what if you want to control something big? A light switch can only break 15, maybe 20 amps of current, and theres a lot of stuff that needs more than that. Plus, sometimes you have to control something that runs at a higher voltage, or possibly even uses more phases. And what if you want to automate whatever it is youre powering with some kind of control system? Looks like youre gonna need a contactor. Contactors are the unsung heroes of industrial equipment control. Theyve come up a few times on this channel, but Ive never really explained what they are and why theyre so useful in so many applications. Time to fix that! Contactors arent something you typically find inside the home... except for that one just outside don't worry, well get there. A contactor does what it sounds like it does: it decides whether theres contactor not. Im sorry. This is a typical two-pole contactor for controlling single-phase loads. Notice that there are six electrical connections: we have two up top, two down below, and another smaller pair on the sides of it. If I pry this cover off the face of the contactor, at first glance what we find appears to be two large copper links straight from the top connections to the bottom connections, but looking from an angle reveals that the center section of copper is actually floating above the rest. Right now, theres a gap between the top and bottom terminals, so this contactor is open and power cannot flow through it. That floating middle section can move, though. If I push down on one of these little rectangles, the center links come into contact with the top and bottom links. When in this position, power can flow through the contactor. Normally, though, its not a finger that pushes the contacts together - that role is usually handled by an electromagnet. And thats what the terminals on the sides are for. Send the appropriate voltage to those terminals, and the electromagnet inside pulls down on the center section by way of these arches, which bridges the gap like so. [CLACK] A contactor in this state is often said to be pulled in, and when the cover is installed the recess created by the moving contacts provides a visual indicator of the contactors current state. When power is removed from the electromagnet, of course, we need the contacts to open back up. [THUNK] Thats done with not one, but three springs. The first is sandwiched between the two cores of the electromagnet and keeps them physically separated unless the magnet has power. That spring is pretty weak, though, so to ensure the separation of the electrical contacts happens very quickly, these additional springs between the arches and the center links become compressed when the contactor is pulled in. Once released, they provide an inertial kick by quickly flinging the arches away at high speed, and once theyre extended enough to catch the copper links, well they get yanked away and off the contacts just as quickly. Now, some of you might be thinking, Wait a minute. So this thing is just an overgrown relay? and to youd I say: yeah, pretty much. But there are some differences. For a start, most relays offer both normally open and normally closed contacts, meaning they might actually disconnect something from power when energized, or even switch power from one path to another. Often incorporating multiple sets of each contact type, relays can perform fairly complex switching tasks when combined with other circuitry. But a contactor is generally just a big power switch. And thats the other difference: relays usually arent designed to carry much current or handle high voltages, but contactors can and do - thats why its so bulky. The large gap maintained between the contact points when the contactor is open allows it to handle a maximum of 600 volts AC - much more than a typical relay. On top of that, the thick copper links inside allow this contactor to carry up to 50 amps continuously (or 40 amps if its not a resistive load). And on top of that, its contact points are designed to withstand arcing caused by much higher temporary current spikes, like the kind you encounter when switching on large inductive loads such as motors. Thats what the LRA figure is for - that stands for locked rotor amps. Induction motors, by far the most common motor type that this fella will control, pull very large amounts of current if the rotor cannot move - or is locked. (the rotor is the spinny bit) And whenever a motor is started from a stop, for a brief moment it will pull locked rotor amps - which is often several times what it pulls when at operating speed. As an example, the compressor in this air conditioner normally draws 12.8 amps at its rated load (thats rated load amps) but its locked rotor amp draw is 67.8. That really high initial current draw is the reason your lights dim for just a moment when your air conditioner switches on. Since this can handle a motor that might draw a whopping 240 amps at startup, it sure seems like a decent fit for controlling an air conditioner. And wouldnt ya know it, if we take a peek inside the electrical cabinet of this air conditioner what should we find but a contactor! And some other stuff, but dont worry about all that. This contactor is some kinda budget model that only breaks one leg of the circuit. Its built just like the one weve been looking at, but the right half of it has turned into a simple link permanently connecting the top and bottom. I can only imagine this is very slightly cheaper. Now, heres the important bit: the contactor, or more specifically the gap between its contacts, is literally the only thing keeping this air conditioner from running right now. Unless you bother to shut off the breaker to it in the winter time, the wires on the input side of the contactor are live at 240V all the time. And, since this has this weird bargain-basement single-pole contactor, that means every electrical connection in this device always has 120V potential on it. Neat! Anyway, if I take a high-tech insulated poking device and press in on the contactors pressy bit [BRRGSHSSWMMMMAHHHHHHHH] it starts right up. Weird, right? That contactor really is the only control mechanism in this air conditioner. Yeah, this is about as basic an air conditioner as you can get, so mediocre it cant be legally installed in the Southwest! But theres plenty of these machines out there. Really, its just two motors: a big one in the compressor, and a smaller one for the condenser fan. They both run directly from AC power, and the unit can only ever be on or off, so a simple contactor is all we need. [CLACK and then the air conditioner starting] But of course, something needs to turn that contactor on in order to turn the air conditioner on. What would that be? Well, did you catch that the contactor we've been looking at has a coil meant to run at 24V AC? That might seem like a weird choice, but that is in fact a very common coil voltage. See, although the air conditioner is effectively a standalone device with its own power supply, it needs to cooperate with the rest of the HVAC system its a part of. In this case, thats a gas-fired furnace, and the control board that operates the furnace just so happens to run on 24V AC. That is in fact the de-facto control voltage in the HVAC world. So, then, the furnace supplies power to the contactor when it wants the air conditioner to run, right? Well, only sort of. One of the main reasons HVAC systems operate at this low control voltage is that we can safely send it through inexpensive thermostat wire that snakes around wherever it needs to go. With a basic four-wire system, the furnace sends its 24V out to a thermostat which can then return it on one of the other three wires: one to signal a heating request, another for the blower fan, and the third for cooling. The furnace will respond accordingly to whatever signal it gets back. But when the thermostat sends a cooling call, although it does send 24V back to the furnace on the yellow wire, from there it goes right to the contactor outside. Take a look, Ive shut the power off to the air conditioner because what Im about to do is very not good for it. If I take the leads of a multimeter set to current (so basically a jumper wire) and do this heres whats happening outside. [rapid and loud clicking and clacking] What Im doing here is taking the 24V from the red wire and sending it back on the yellow wire. Once it makes it back to the furnaces control board, it becomes spliced with a second wire. This one is part of an entirely different run of thermostat wire that follows the refrigerant lineset of the air conditioner all the way outside. Once there, its wired to the contactors coil. All a thermostat does when it calls for cooling is connect these two wires together which sends power to this contactor which in turn sends power to the compressor and condenser fan motor. So it is in fact the thermostat which is in direct control of whether the air conditioner runs or not. Of course, the furnace is supplying the 24V AC, so without it the contactor wouldnt do anything. And this more modern furnace does pay attention to whether theres power coming back on the Y terminal so it can run the blower motor at a different speed between fan-only and cooling calls. But a lot of older systems had no idea whether the air conditioner was running or not. Thermostats generally send power on both the Y terminal and the G terminal when calling for cooling, and power on G will turn on the blower fan. So in older setups, as far as the furnace or air handler knew it was just supposed to be running the fan. It had no idea why. So by now, Im sure you get the point of having that contactor. It allows us to switch on the big and power-hungry air conditioner with a low-voltage signal wire controlled by a thermostat. But there are actually more benefits to this approach than it may seem. If you look closely at the thermostat wiring once it enters the air conditioner, youll notice that its not directly connected to the contactor. It actually heads inside to a pressure switch attached to the refrigerant lines. That switch is normally closed, but if the refrigerant pressure should get too high it will open and break the circuit powering the contactor. That will of course shut off the air conditioner, protecting its compressor from damage. More sophisticated systems might have multiple safety switches all arranged in series so that if any one of them opens, the contactor will, too, and thus power is removed from the compressors or whatever else. Without the help of a contactor, every one of those safety devices would have to break the full operating current of the motors - which is not only difficult for a switch to do, but would also require a maze of heavy-gauge wiring capable of handling the full load of the machine to stop by and run through every safety device. Anyway, before we get too far lost in HVAC trivia, I do want to go back to that current-handling ability of the contactor. Remember the locked rotor amps thing? Well, Ive got a fancy multimeter that can tell us the current spike that the contactor has to deal with. [unit switches on] Thats not quite as high as the LRA on the data plate, but 55.1 amps is still quite a spike! Thanks to the fast action of the contacts, though, hardly any arcing occurs. Hardly any isnt none, though, and already we can see pitting on the contacts. These dont last forever, and the need to replace a contactor here and there is certainly not out of the question. It could be much worse, though. If I use my high-tech insulated poking device, I can create some gnarly arcing - especially because right now the compressors rotor is in fact locked as it cant overcome the high pressure in the system right now. You can hear it humming but it's not turning. [abnormal buzzing and humming when contactor is pushed in] This is why modern thermostats might delay the startup of your air conditioner. The compressor needs some time for the refrigerant pressures to equalize or it may not be able to start. And if left powered on in this locked state for any length of time, that can damage the compressor as its motor windings will get very hot very quickly. The compressor usually has its own overload protection, so its generally not too much of a concern, and the circuit breaker protecting this circuit would probably trip before that even comes into play but thats annoying if nothing else so pretty much any electronic thermostat will enforce a delay period between the last shutdown and the next startup. But I said we wouldnt get lost in HVAC trivia. Of course, there are many other things one can do with a contactor besides just turn on an air conditioner. For a start, 24V is by no means the only option for the coil voltage. In fact, through the Magic of Buying Two of Them, I have a 120V contactor right here. This is nearly identical to the first one, but the coil runs on ordinary AC power. This could be useful to, say, turn on some high-voltage overhead lighting in a gymnasium or warehouse with an ordinary light switch. Or perhaps create some sort of mystery box for controlling whether a water heater has power or not. Im still not letting you look inside of there, though. There are plenty of contactors that have three poles rather than just the two you see here, and allows them to send power to large three-phase motors, like for instance exhaust fans in a commercial kitchen. With a 120V control coil, you could wire that contactor (or multiple contactors) up with the room lights to ensure that those fans run whenever the kitchen is occupied. And inside really big HVAC systems with three-phase compressors, youll find them there, too, though usually with 24V coils. Really, any time you need to control a big electrical device, a contactor is probably doing the gruntwork. And for really big motors, theres a subset of contactors known as motor starters. Those might be as simple as a conventional contactor which can monitor current flow and will shut down the motor if it exceeds a certain threshold. But it might also involve multiple contactors that can dynamically rewire a motor between two configurations. Really gigantic three-phase motors pull so much current from a stop that its effectively impossible to start them by simply applying power as normal. So instead, the motor is temporarily run with its windings wired in a star- or Y-configuration which limits its starting current at the expense of reducing torque. Once its up to a predetermined speed and it can safely run at its full power, the motors windings are switched to a delta configuration, and thats all done with some contactors and timers which form a star-delta (or Y-delta) motor starter. But why stop at just three poles? One of my favorite contactors is the answer to a question Ive long had: how do big buildings turn on so many lights at the same time? Think of, like, a hotel with a parking lot, exterior wall sconces, signage, bollard lights in pathways, and somehow all of those lights, even though theyre all over the building and cant possibly be on the same circuits, are automatically coming on together at dusk. Hows that happening? Well, with one of these gnarly contactors. You can have perhaps a dozen circuits all controlled by this thing, they dont even need to be the same voltage, and it can be hooked up to either a mechanical timer or a photocell. One of these might even control the lights in a large store or warehouse, allowing you to switch on dozens of kilowatts of lighting with just a single ordinary light switch. And that really gets to the heart of what contactors do. Like relays, they are electrically-operated switches that we can do pretty much anything with. But theyre just more focused on raw power-handling ability than they are speed or complexity. And while Ive talked about a few types that are out there, trust me there are plenty more. Take a look at speed control for locomotive DC traction motors if you want to see some wild contactor configurations. The role of the contactor is arguably changing, though. While this one is doing a fine job of controlling my air conditioner, the on-or-off nature of it is quite limiting. The compressor is just a simple AC induction motor, and with a contactor the only thing we can feed to it is raw 240V AC power at 60 Hz, so the motor will only ever run at the two speeds of high or off. But we are starting to see variable frequency drives proliferate into more and more air conditioning, heat pump, and refrigeration systems. Theyve been common on mini-splits for many years now, often marketed as an inverter compressor. And these systems allow us to spin the motors at virtually any speed we want by, in essence, creating our own flavor of AC voltage with fancy electronicals. Some might view this as a needless layer of complexity, but when we can spin the compressor (and fans) and any arbitrary speed, we can optimize the devices operating efficiency for any given load which can save a lot of energy. Yeah its not strictly necessary, but the operating characteristics of a refrigeration system change depending on the temperatures both inside and out. In this footage, it was only mildly warm outside and inside the temperature was actually kinda chilly. And with such a small load the air conditioner was only drawing about 7 amps. Keep in mind that its rated load, when including the fan, should be somewhere north of 13 amps. The compressor just isnt working that hard because the refrigerant pressures its fighting against are quite low. But because the compressor can only operate at full speed, its always trying to pump the same volume of refrigerant. Yes, its using less power than it would if it were really hot out since the pressures are lower, but it could be using even less to deliver the same amount of cooling if it could simply slow itself down. That would reduce pumping and frictional losses in the compressor, and we could even slow down the condenser fan because we dont need as much heat transfer. Over the lifetime of the air conditioner, theres a lot of energy being left on the table if you cant dynamically adjust for load conditions. And thats why this thing is only rated at 14 SEER while my cheap mini-split attains 19 SEER. Of course, the downside is that the VFD boards required for variable-speed compressoring are a lot more expensive than contactors. These things cost about $15 bucks retail, and a replacement inverter board is, uh, more than that. Its not impossible to design a very robust inverter board that should last the life of an air conditioner or heat pump, and Im happy to report that my cheap mini split is still pumping just fine after four winters now. But I do get the concern. In a similar vein, electromechanical contactors like these are starting to become displaced by solid-state contactors. Rather than rely on an electromagnet and physical movement of copper links, those devices use electronic components like transistors or triacs to turn the flow of power on and off. They are at least in theory more robust than an electromechanical device, but they are a lot more expensive and arent suitable for every application. It is effectively the same device, just with different technology inside of it, but it is interesting to note. However, just because we might be using contactors less as a means of control doesnt mean were giving them up altogether. Increasingly, we see them getting used as isolation devices that are mainly used for safety. As I talked about in my video on electric vehicle supply equipment, your standard AC car charger has a contactor inside of it to control whether the charge cord has voltage on it or not. That contactor is really the only active component in one of these chargers, and the incoming power wires get connected straight through to the charge cable when its pulled in. But this contactor shouldnt ever operate under load except in an emergency. It will close before the car starts drawing power, and a switch in the charger handle will signal to the car to immediately stop pulling current when you reach to unplug it, so the load will instantly drop off before the contactor opens. Its really only there to kill power to the cord when its not plugged into a car (or on the rare occasion it detects a fault). And actually, an electric cars battery pack has some very important contactors inside of it. When its not turned on, we want to be able to isolate the high-voltage battery from the rest of the car. Thats important not only for safety but also keeps the high voltage battery from discharging when the cars powered off (at least assuming the manufacturer has figured that part out) *cough* Rivian So, the batterys power output is run through some big, beefy DC contactors that can physically disconnect the battery cells from the packs power terminals. And those contactors are controlled by the cars low-voltage system. Electric and hybrid cars have a low-voltage system thats basically no different from an ordinary car. In fact plenty of EVs have a plain ol 12 volt lead acid battery in there somewhere, and that battery is what closes in the contactors inside the traction battery so it can send out its spicy voltage to all the spicy stuff and the car can fully power on. If you listen closely as I power on my car, you can hear those contactors clicking to life. [ka-chunk, followed by a buzz, some whirrs, etc] There are usually even more contactors, though, such as the pair that connects the battery pack to the DC pins of the charge port. You only want that to happen when the car knows for sure that its plugged into a DC fast charger, because having 400 (or even 800V) DC on these exposed pins is not a fun way to learn what a DC arc flash is. And depending on other components, there may be even more. When I plug my car in to charge, theres a short symphony of clicking that occurs as the car locks the charge handle to the charge port, the chargers contactor clacks to life, and the contactors inside the battery pack click to allow the onboard charger to juice up the pack's cells. [snap] [clicketyclack Ka-Chunk] [whirr] [thunk] [CLACK] And its not over until the disembodied lady sings. [seemingly from nowhere] \"Charging Started\" Anyway, Ive been going on for long enough. Who knew I could stretch a video on contactors past the 20 minute mark? Oh, who am I kidding, we all knew this would happen. Im really not cut out for this whole one minute video stuff. I am wearing shorts, though. Anyway, thanks for watching. flowingly smooth jazz But what if you want to control something big? Lll *cough* oops Or even switch power from one path to another. Often incorporating multiple sets of each compact tight [the line was contact type] Type! Thats why its so bulky. Bulky. I hope that sounded OK. Im not recording that again. The large gap. The large gap ma huh guboy It could be land somewhere and stop flying. [there was a bug in the room] Good golly willikers gee. ... it can safely run at its full power... Wrong! Thats not how the sentence worked. So I'm wondering how many people will have gotten the \"part of a complete breakfast\" gag at the beginning. Is that mostly an American thing? I can very much see that being the case. In case you don't know, breakfast cereal commercials usually say that at the end with imagery of a bowl of your Lucky Charms or whatever beside a glass of orange juice, maybe some bacon and eggs, basically acknowledging that the cereal really shouldn't be the only thing you eat for breakfast. And that's how my brain works!",
    "transcript_keywords": [
        "contactor",
        "air conditioner",
        "Contactors",
        "power",
        "air",
        "conditioner",
        "control",
        "motor",
        "contactors inside",
        "switch",
        "run",
        "compressor",
        "inside",
        "current",
        "motors",
        "car",
        "voltage",
        "device",
        "amps",
        "contacts"
    ],
    "transcript_entity_values": [
        "13",
        "19",
        "ma",
        "third",
        "half",
        "about 7",
        "800V",
        "Ka-Chunk",
        "a minute",
        "dozens of kilowatts",
        "American",
        "two",
        "120V",
        "HVAC",
        "400",
        "20",
        "six",
        "600",
        "12.8",
        "VFD",
        "14",
        "winter",
        "55.1",
        "20 minute",
        "60 Hz",
        "12 volt",
        "Lll",
        "LRA",
        "AC",
        "40",
        "up to 50",
        "67.8",
        "first",
        "one",
        "four",
        "many years",
        "dozen",
        "Y",
        "four winters",
        "One",
        "the Magic of Buying Two of Them",
        "DC",
        "guboy",
        "15",
        "CLACK",
        "240V",
        "240",
        "Southwest",
        "24V",
        "second",
        "Rivian",
        "about $15 bucks",
        "one minute",
        "That spring",
        "three"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "ORDINAL",
        "NORP",
        "MONEY",
        "TIME",
        "DATE",
        "CARDINAL"
    ]
}