{
    "id": "vTCT32S-9Ok",
    "title": "Connectix Virtual Game Station: The First Legal Emulator",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2015-09-01T17:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=vTCT32S-9Ok",
    "category": "Gaming",
    "tags": [
        "Connectix Virtual Game Station (Computer Emulator)",
        "Emulator (Software Genre)",
        "Connectix (Defunct Organization)",
        "PlayStation (Video Game Platform)",
        "Macintosh (Video Game Platform)",
        "Apple Inc. (Publisher)",
        "Bleem! (Computer Emulator)",
        "Software (Industry)"
    ],
    "views": 31451,
    "likes": 1046,
    "comments_count": 90,
    "description": "Let's take a look at a somewhat obscure PlayStation emulator that proved to be instrumental to today's gaming ecosystem -- and has the case law to prove it.  -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by BoxCat Games ( and Kirk Pearson (",
    "description_links": [
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "http://www.box-cat.com)",
        "http://jkirkpearson.com)."
    ],
    "transcript": "Hey everyone, it's Colin. How's it goin'? If you've watched many of my videos, you know that I'm interested in retro gaming. Now I don't limit myself just to console gaming. I enjoy PC gaming as well. And while flipping through my stack of CDs the other day, I rediscovered a piece of software that I forgot I had, but ended up being a pretty important part of gaming history even though not many people know about it. So today I wanna take a look at a piece of software called Virtual Game Station. It was released in 1999 by a company called Connectix, and it was only for the Mac when it first came out. What Virtual Game Station was essentially is an original PlayStation emulator. You install it on your computer, you drop in original PlayStation game, you launch the software... And off you go. It's as if you're playing an original PlayStation on your Mac. What's interesting is the software worked really really well. It's very smooth video, the sound is great, the controls are responsive, and it even offered support for external controllers, so I would always use it with my external Gravis USB gamepad, which... looks a bit familiar, doesn't it? It played the vast majority of PlayStation titles. There were, of course, some compatibility issues with some titles, and that's to be expected from emulators, but, overall, it worked exceedingly well. [ Music & SFX - Tekken 3 ] Now, Virtual Game Station was written as a legitimate piece of software that played by the rules. For example, it would only play original PlayStation discs. You couldn't stick a CD-R in there and play it. Also, it followed region coding for the game. So if you had an NTSC copy of Virtual Game Station, it would only play NTSC Playstation games. Of course, with time, all sorts of kind of modders and software hackers came out with patches for Virtual Game Station that allowed you to play backups of games and get around region lockouts. But the fact is that Connectix, who wrote the software, really tried to make this a legitimate product, and cross all their t's and dot all their i's. Unfortunately, that still wasn't enough to escape the wrath of Sony. They caught wind of Virtual Game Station and didn't like what they saw. They felt that it hurt PlayStation hardware sales, and... perhaps they were right. So, they took Connectix to court. What's really interesting is that... after a bit of a legal battle, Connectix *won*. The courts decided that Connectix really hadn't violated any copyright or patent laws in the process of creating Virtual Game Station. They essentially reverse-engineered how PlayStation worked and wrote their own code. Now at the same time, Sony was fighting a legal battle with Bleem!, who you may know as a company that wrote an emulator for the Playstation for the Windows platform. Now, even though Sony lost against Connectix, it decided to hedge its bets and continue its legal battle against Bleem. This was a pretty smart move on Sony's part because they knew who they were going up against. Connectix was a fairly big company. They'd been around since the late '80s. They have written a lot of very popular Macintosh software, so they had the legal wherewithal to defend themselves, whereas Bleem was just a startup, and they were still running on whatever money they had. And not long after the battle with Connectix ended and Sony continued to go against Bleem in the courts, Bleem basically ran out of money and in that case, Sony, by default, ended up winning. So what happened to Virtual Game Station in the end? Well, after Sony lost its battle against Connectix, it did the next best thing that it could do. And it went to Connectix and offered it a whole ton of money for the code and rights to Virtual Game Station, which Connectix actually took them up on. As soon as Sony got ahold of Virtual Game Station, it immediately discontinued the product, and with Bleem out of the picture at that point, that pretty much killed *all* of the legitimate PlayStation emulators that were being sold. That said, that court case against Connectix still has a bit of an interesting effect in that it set into motion the precedent that emulators, by themselves, are not illegal. As long as the emulator doesn't use any proprietary code or violate any patents, essentially, if it was completely reverse-engineered and is simply able to play the software, that it's very much more of a legal thing than it was an illegal thing. And this set the stage for a lot of future products, especially ones like today's retro third party consoles, like the Retron5. So, the next time you pick up one of those retro third party consoles or fire up an emulator on your computer, just think back to 1999, with a small little program that launched on the Mac... that let a few of us play PlayStation games. If you like the video, I'd appreciate a thumbs-up. Those help quite a bit. If you haven't already, please subscribe. Follow me on Twitter, it's at thisdoesnotcomp, and as always, thanks for watching.",
    "transcript_keywords": [
        "Virtual Game Station",
        "Virtual Game",
        "Game Station",
        "Game",
        "Virtual",
        "Station",
        "Connectix",
        "PlayStation",
        "Sony",
        "called Virtual Game",
        "Playstation games",
        "software",
        "NTSC Playstation games",
        "Bleem",
        "creating Virtual Game",
        "play PlayStation games",
        "original PlayStation",
        "original PlayStation game",
        "Colin",
        "games"
    ],
    "transcript_entity_values": [
        "USB",
        "third",
        "Virtual Game Station",
        "Sony",
        "PlayStation",
        "Mac",
        "the late '80s",
        "Macintosh",
        "Mac",
        "today",
        "Connectix",
        "Gravis",
        "first",
        "Virtual Game Station",
        "one",
        "Bleem",
        "Windows",
        "NTSC",
        "Colin",
        "Bleem",
        "Playstation",
        "Twitter",
        "Connectix *",
        "Bleem",
        "1999"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE"
    ]
}