{
    "id": "vU_S5a3lUMU",
    "title": "IKEA gone WILD - Bluetooth Party Speaker",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-03-10T22:20:15Z",
    "video_url": "https://www.youtube.com/watch?v=vU_S5a3lUMU",
    "category": "People & Blogs",
    "tags": [
        "IKEA",
        "teenage engineering",
        "sweeden",
        "sweedish",
        "home organization",
        "speakers",
        "bluetooth",
        "audio",
        "wireless",
        "assembly",
        "mobile",
        "battery",
        "subwoofer",
        "tweeter",
        "unboxing"
    ],
    "views": 1131841,
    "likes": 35190,
    "comments_count": 1930,
    "description": "Bluetooth speakers made by IKEA is not an unusual product for them, but is it any good?  Buy IKEA Frekvens Bluetooth Speakers at IKEA:   On Amazon (Paid Link):   Buy Bluetooth Speakers On Amazon (Paid Link):  On Walmart (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://lmg.gg/lKL4g",
        "https://geni.us/ob3Fizw",
        "https://geni.us/AxDBOq6",
        "https://geni.us/KMDQlA",
        "https://geni.us/hYwm",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- When I saw the press release for Ikea's new Frekvens collaboration with design teenage engineering, all lower case. I knew that I simply had to have it. What I didn't realize was that I was getting more than I bargained for. I ran down to the local Ikea, only one of which actually had the Frekvens' speaker and subwoofer in stock, and found that Frekvens is not just a couple of speakers, but it's like a whole lifestyle or something. It's like a party for my Ikea. So there's the Frekvens' light base I got four of those. There's these batteries, that I actually found in the home, like linens sort of area. There's this, which I'm super excited to show you guys. And there's a silver raincoat and a silver pillowcase. What? So here's the thing. No one at Ikea, whether it was staff or customers, seems to have any idea, what the hell it is, they are trying to accomplish with this lineup of products. On their product page, it's like the ultimate home party. I feel like this is one of those weird things that probably should have been like a Europe only launch, but then somehow managed to make its way over the pond. And us north Americans are just like, \"I'm sorry, what?\" The rain jacket is so much better, but unfortunately that particular piece wasn't in stock, neither was the lighting stand and the little like weird lights that had got this vine on their website for. What they did have in store though, is this. Oh my God. It includes a stencil. Holy crap. So what, so you can like stencil your name on it or like your party, your band or whatever. So this is great. Jono, can I hand these to you to finish assembling this thing? I'm gonna open up the Bluetooth speaker in the meantime, because there's a great story behind that box. The thing is I ran into this guy in the store and I was like, \"Hey, so this is something else, aye.\" And he goes, \"Yeah, I guess what the hell is it?\" Because the demo that they had set up just didn't really seem to make any sense whatsoever. And the box is completely nondescript. It's got this, which is whatever that is. Bluetooth. And then like design teenage engineering. There's no other information. It doesn't even say it's a speaker. So there it is. It's got a line in, subwoofer out, a line out, AC power in, power and pairing button. Oh wait, AC in and AC out. So you could like daisy chain it or whatever. It's got actually kind of like a nice industrial design to it. And then, Oh, okay. So that's weird. You have to pick what color you wanna buy, but they could have just as easily included multiple colors in the box, these don't look particularly expensive. Uh, not particularly amazing feeling volume dial, Got a tweeter and a mid-range speaker. I don't know if I have higher or lower expectations for this because it's Ikea. It's like a standard power cord on the one end. And then it's like a, got the like telephone coil on the other, but what's really weird is it's the same material. So they just like, I dunno, like heat treated it or something to coil part of it. Only at Ikea do they manage to have you assemble your own Bluetooth speaker. Got stickers on the bottom and then little nipples that go into the holes. So that should keep them on pretty good. Now, curiously, they've got spots for like foot nipples on the back of it too, even though the power goes in there. Okay. So here's my Braunit. Brow-Unit? Bra-Unit. I like bra-unit. Ikea needs to borrow from Amazon's frustration-free packaging concept. (Linus groans) It's like the strongest clear plastic tape in the world. So it recharges with a micro USB. And then it just goes in a little, something like. Schwamp. Goes on the nipple thing like that. Actually, that's weird. The speaker actually overhangs it a little bit. So whoever was doing the design, didn't account for the face plates. So I guess they just assume you're going with the naked look. That's fine. I can dig it. You ready? Aw (Jono laughing) Is that it? Is it just white? (upbeat music) Moment please. It's all bass. It's like literally all bass. Hold on, hold on. Yep. It's still all bass. In fairness, the level of distortion at max volume and the amount of sheer sound that is coming out of this thing, not bad actually. (upbeat music continues) Like, that is not a lot of distortion for a tiny 10 centimeter by 20 centimeter speaker. And we're just getting this party started boys. Because now we got the big kahuna. More Frekvens. So it seems like you're supposed to put them together with these little doodads and the included screws. So you can assemble your own thing. But curiously, you can't configure it into like a stereo setup because, Wait, there is a line out. Oh yeah. And there is a line in. But, oh, Hmp. I'm not sure if that's actually how they intend for it to be used. But anyway, there's a sub-out and we do get the cables required for that. Okay, so let's go sub-out and then we'll, you can daisy chain the power. Looks like there's sort of an expected configuration, probably supposed to put it here, I guess. No actual Bluetooth connectivity though. The Bluetooth connectivity seems to be expected to come from this. You guys ready for the sub-test? There's no separate volume knob for the subwoofer, unfortunately. So you're just, you're going to get whatever Ikea determines is best here. I lied. There is a volume knob on the back of the sub. It's just recessed. (upbeat music) Look at it go! It's walking around. So this open back design actually means that like the speaker, the sub moves a lot of air, actually. I wouldn't describe anything that we're listening to as 'great sounding,' by any stretch of the imagination. It is far too bass heavy, but if the objective of your Frekvens house party is to just make a lot of bass in a very small amount of space and have Bluetooth connectivity, it seems to me, you could do a lot worse than this. But could you do better? That's where the final product in today's video comes in. In my earlier story, I didn't actually include the best part of it. So when the guy asked, \"What the heck is it?\" He specifically asked, as a follow-up question, \"What the heck this was\" and \"what it has to do with a house party\" and much like the speakers, there was no explanation of what this product is anywhere on the packaging or in Ikea's merchandising in the store. So I had to look it up on their website. The answer may shock you. How sturdy is this table these days? (Linus groans) - [Jono] Hold on. - Hold on. It's, wait. (Linus drumming) I'm supposed to hit it. Oh, sorry, it goes behind me. - [Jono] Yeah. - Sorry. - [Jono] The center is like a base drum, and the top is like snare drum. - Okay. (drumming on wood) (Linus laughs) - That's the stupidest thing ever. Subscribed to ShortCircuit, so you don't miss more videos like this one.",
    "transcript_keywords": [
        "Ikea",
        "speaker",
        "press release",
        "Bluetooth",
        "thing",
        "Bluetooth speaker",
        "party",
        "Frekvens collaboration",
        "Bluetooth connectivity",
        "Frekvens",
        "weird",
        "design",
        "power",
        "bass",
        "Frekvens' speaker",
        "Hold",
        "line",
        "Frekvens'",
        "lot",
        "volume"
    ],
    "transcript_entity_values": [
        "Europe",
        "a house party",
        "USB",
        "Braunit",
        "north Americans",
        "Hmp",
        "Amazon",
        "AC",
        "max",
        "Frekvens",
        "Jono",
        "Ikea",
        "10 centimeter by 20 centimeter",
        "these days",
        "Bra-Unit",
        "four",
        "only one",
        "Linus",
        "ShortCircuit",
        "today"
    ],
    "transcript_entity_types": [
        "LOC",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "NORP",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE"
    ]
}