{
    "id": "vv1W0C920oE",
    "title": "The 43\" Mega Monitor - Size DOES Matter!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-09-09T20:02:29Z",
    "video_url": "https://www.youtube.com/watch?v=vv1W0C920oE",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "42",
        "LG",
        "Biggest Monitor",
        "best monitor",
        "best gaming monitor",
        "best console monitor",
        "best editing monitor",
        "sRGB",
        "adobe RGB",
        "ACER",
        "largest monitor",
        "43UD79",
        "4k",
        "HDR",
        "3840 x 2160",
        "computer",
        "TV"
    ],
    "views": 805568,
    "likes": 18222,
    "comments_count": 1187,
    "description": "The LG 43UD79 is a MASSIVE 4k IPS PC monitor for hardcore multi-tasking. It's gigantic but it's awesome! Available Here -   LG 4K Monitor 43UD79 -   Music Credits: Fili - Dollar for my thoughts  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2whpIE9",
        "http://www.lg.com/us/monitors/lg-43UD79-B-4k-uhd-led-monitor",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going? Dave2D here and behind me is a very large screen from LG it's their 43UD79 and it's literally a 43 inch screen. So on paper a really large screen like this seems kind of useless, right? I'm sure there's applications for commercial or professional use, but when you think about how large our regular screens are It does seem a little bit excessive. But here's the thing this thing is $700 and when you look at any review of this thing online from Amazon B&H wherever you go, people love this panel. People are replacing their thousand or $1500 screens with this thing It's like half the price So I thought I'd check it out Looking at photos or even videos of this monitor doesn't really showcase how large it is It really just does look like a normal-sized monitor. That's someone brought in to photoshop, grab the corners and just stretched it out It's a perfect scale model of a small regular monitor Now the build quality is good It's plastic but everything looks built well. There are four HDMI ports in the back, but only two of them are HDMI 2.0 And there's also only one DisplayPort There is a USB C connection so if you have a MacBook you can connect it up using one cable For both the display connection and for power. Now this isn't going to be a regular review This is more of just an experience of using this thing for a while because I only started using it for fun But I actually liked it so much This is probably gonna be my main monitor for a while Obviously its main feature is its size 43 inches is a lot of real estate Now I've connected computers to TVs before, but I've never used a monitor this big and the size is awesome You don't need to scale anything keeping Windows at 100% scale everything appears large and very sharp and working in Premiere is Unbelievable on the screen so currently I use a 30-inch ultra wide for my video editing, but this thing is better It's just more overall real estate and when I view the video in full screen I can see everything clearly The image quality is good. I measured it with a spider And I'm getting a hundred percent sRGB, and about 78% Adobe RGB The colors are accurate after calibration But you do need to calibrate it because the default white point is quite blue but once you do and you sort it out sRGB color space is great and just ideal for YouTube I tried out this monitor with the PS4 Pro And you have to tweak it a bit to get it to work you have to turn on this barrage setting called ultra HD deep color But once it's running 4k console gaming on a desk is so nice The size is awesome for immersion like I don't think it's great for competitive MLG gaming because you have to look around to see the full screen But if you're a console casual like me this thing is great The one thing I wish this monitor had was HDR support I mean 4k is nice, but 4k HDR is just that much better and with the increasing number of HDR capable games It would have been really nice the thing is if this thing supported HDR. It wouldn't be 700 bucks I think it'd be pushing like 12-1500 dollars Now the one feature that makes this monitor super special is The split screen. You can connect up to four devices and display them all at once now Here's the thing when I was setting it up I remember thinking this is kind of ridiculous like who's gonna need four screens on one display at one time right it seems really Superfluous, but once that thing's set up it is awesome So I connected my PC, a MacBook, a PlayStation 4 and a Nintendo Switch And this is just a demo right realistically I would probably only connect Maybe one console and maybe plug up a TV or something But whatever it is the possibilities are endless whether it's for work playing a ton of games multi boxing I don't know cryptomining, stock stuff whatever it is having four screens each of them being like full 21 inch images I think a lot of people are gonna find it useful now the one issue to this whole proposition is the sheer size of the monitor you need to have a large enough desk or a large enough workspace to actually sit this thing on there without it looking stupid or ridiculous because this thing is massive You can't really tell in the videos, but it's really really large So if you don't have a huge desk this might not work out for you, but if you do This is pretty cool. It also has a pair of speakers Which are way better than I thought they'd be they're clear, and they get loud. There's not much bass Which is kind of expected because there's no sub at least not a significant one But the audio quality in this thing is very good And I'm very happy editing videos or playing console games directly off those speakers And now you just don't need to have external speakers The last thing I should mention is that there's a remote which might seem a little weird because it's a monitor But once you start doing the split-screen stuff you can switch between the regular and multi-window really easily And you also get in volume control from speakers, but that's basically it. It's a pretty unique monitor I don't think it's for everyone obviously But if you're someone who can make use of its capabilities You have a lot of devices you want to connect up and view them all at once you want to be able to switch Between them really readily check this thing out. Okay, hope you guys enjoyed this video thumbs if you liked it! Subs if you loved it! See you guys next time!",
    "transcript_keywords": [
        "thing",
        "monitor",
        "large",
        "large screen",
        "screen",
        "HDR",
        "screens",
        "thing supported HDR",
        "full screen",
        "regular",
        "size",
        "connect",
        "console",
        "speakers",
        "regular screens",
        "videos",
        "video",
        "Switch",
        "regular monitor",
        "people"
    ],
    "transcript_entity_values": [
        "a 43 inch",
        "4k",
        "MacBook",
        "12-1500 dollars",
        "43 inches",
        "only one",
        "700 bucks",
        "HDMI 2.0",
        "one",
        "Adobe",
        "Amazon B&H",
        "DisplayPort",
        "half",
        "30-inch",
        "700",
        "up to four",
        "YouTube",
        "the PS4 Pro",
        "a ton",
        "21 inch",
        "about 78%",
        "100%",
        "thousand or $",
        "Windows",
        "Premiere is Unbelievable",
        "MLG",
        "four",
        "PlayStation 4",
        "a hundred percent",
        "1500",
        "LG",
        "Superfluous",
        "only two"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "FAC",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PERCENT",
        "PERCENT",
        "MONEY",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL"
    ]
}