{
    "id": "VVnGvlO56As",
    "title": "I don’t want to clean this. - Beatbot AquaSense Pro Spotlight",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-05-18T17:00:38Z",
    "video_url": "https://www.youtube.com/watch?v=VVnGvlO56As",
    "category": "Science & Technology",
    "tags": [
        "#Beatbot",
        "#AquaSensePro",
        "#RoboticPoolCleaner",
        "#PoolCleaner",
        "#PoolRobot",
        "Linus Tech Tips",
        "LTT",
        "Robot",
        "Cleaner",
        "Pool",
        "Gadget",
        "Tech",
        "Fun",
        "Outdoors",
        "Cleaning"
    ],
    "views": 1761447,
    "likes": 57999,
    "comments_count": 2661,
    "description": "Get the best price on a Beatbot AquaSense Pro and use code LINUSBEATBOT for an extra 2% discount! Official Website:  Amazon Store:   When Beatbot offered us their AquaSense Pro 5-in-1 Pool Cleaner Robot, we couldnt wait to get it in the water and see what it could do!  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:02 Unboxing 2:26 Test Drive 3:49 Foreshadowing 4:22 A series of unfortunate events 5:20 I think I'm gonna be sick 5:57 Let's be reasonable 7:55 All filled up 8:57 Guess who's back... 10:22 Back again... 11:05 What about the neighbor?",
    "description_links": [
        "https://bit.ly/3QGife5",
        "https://amzn.to/3UUJ4ha",
        "https://linustechtips.com/topic/1570718-i-don%E2%80%99t-want-to-clean-this-%E2%80%93-beatbot-aquasense-pro-showcase/",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "My neighbor's pool is nasty. Rotting leaves and sediment all over the bottom, a whole ecosystem of undiscovered microorganisms floating around beneath the surface, entire plants stretching out and making themselves at home. I think I might've seen a shark at the deep end. But just as I was about to bravely dive in and destroy another phone, Beatbot saved the day, offering to sponsor this video to show off their AquaSense Pro all-in-one smart pool cleaning robot. Thank goodness. I promised my neighbor that with this little guy's help, we'd have the mess sorted out in no time. Of course, that was before our pool contractor came and had a look at it and said, \"Sir, you realize that there are roots on the plants growing out of this pool, right? It's a robot, not a miracle worker.\" But hey, we're gonna give it a crack at it. Maybe the miracle was inside us all along. Let's take a closer look at the AquaSense Pro before touching it comes with a risk of cholera Comes with a quick start guide and user manual which is a chock full of certifications including IP68 water resistance The robot itself which is full of fun little gadgets and tricks VBOT says the AquaSense Pro is the world's first 5-in-1 intelligent pool cleaning robot It'll do the floor the walls the waterline and surface cleaning plus Optional water clarification with these little cartridges, although you don't have to do that What you definitely will need or at least we will is this debris collection slot that helps it skim anything along the surface and deposit It in the dual layer basket right here as well and this one's really cool as this second debris collection slot that both sucks up debris from the bottom and Helps the robot cling to the side of the pool as it uses its scrubbity toilet brushes here Sorry pool brush scrubbity pool Brushes to clean the surface rounding out the accessory package. We've got the charging dock This will go in your garage or in your pool house And it'll give the BeatBot enough juice for anywhere from two to three runs depending on whether it needs to go all the way Down to the bottom and hang out down there or if it can just float around on the surface and last but not least The hooker sometimes stuff goes wrong, and if you ever need to retrieve the bot this will be very helpful It's also good for fishing But enough chit chat, it's time to take her for a test drive. There is an app, but you're not obligated to use it There's physical buttons on the front for bottom, bottom and walls, complete clean and eco clean as well as a power button Now taking bets. What's gonna clog up first the basket or the propulsion jets? I'm gonna say propulsion jets. All right, then I'm gonna do a floor clean because it'll be using the treads. All right Cheater. Cheating is the best way to win. Good luck, buddy You did press the go button, right? What go button? Have you tried it? Hey! There we go! It's spitting water out the top. So I guess that's just to maintain its buoyancy? Yeah. Cool! We had wanted to put a GoPro on it for this, but they warned us that it's a pretty delicate balancing act having it at exactly the right level for the skimmers to work, so theoretically it should map first. Yeah. So it made it to the bottom, but my question is, does it have a sensor to know when the basket is full? Or is it just gonna like try and pick up all of this? It has 20 sensors, but I don't actually know what they do. Sick. Hey, it picks stuff up though, or at least shuffled it around. It moved it. Look, there's a clean spot. Yeah! Look at this plume! It's just spewing greed at the back of me. Beautiful plumage! I checked this footage from before, and you can't hear it up here, but the microphone picked it up, the Beatbot like \"I hate my life, I hate my life, I hate my life.\" It's like Collin, it doesn't complain, it's a robot. You know, if it kicks up enough sediment, we may not be able to find it. That's a good point. Is she surfacing? I thought it was, but... Oh, she's doing something! Oh no, she's- she's cruising, man! It's going along the edge. Oh, okay. I can see the little brushies going. Okay. I'd like to make it clear that everyone involved understands that this is not what this robot is for. We just wanted to see how it handled a worst-case scenario. Before it goes all the way into the deep end and we lose visual contact, should we hook it out and see if it's full? All right. Okay. Come here, little buddy. Oh shoot, I lost it! Oh no! Come back, little buddy! Oh no! And now I've kicked up all the- This pool pole broke in half! It's somewhere in this vague area. Can Cullen swim? I'm not sure. All I do know is I'm really glad I have the LTT HAT Pro with water- resistant treatment. LTTstore.com? Our problem is that water blocks any RF communication, so there's no hope of using the app to summon it back, and cloudy water blocks visual communication. So we have no idea where it is now. I mean, it's still doing stuff, but there's no way it would have enough capacity to keep picking things up at this point. It'll do its thing and come up eventually, right? Well, if it gets trapped in the weeds though. Oh, true that. And there's a shark down there still. I can see maybe the top third of the pole. Jordan spotted it guys. We got it. We got it. Oh, yeah. Yeah, we got it God She mad Wow, I think this stuff is too thick too much. It's just too much. It can't even collect things Because it's completely gummed up. Yeah, it was probably like that in like a minute. Yeah, that ain't right Realistically we expected all of that though. The AquaSense Pro is a maintenance robot It's not gonna be able to do anything for your busted up pool equipment So while we wait for the pros to turn this Titanic into a treasure courtesy of BeatBot He's gonna be helping with the restoration Let's take the AquaSense Pro over to my place and look at a more realistic reasonable scenario. Only problem is it's kind of too clean Mess it up boys, and don't tell Yvonne we did this. Oh God uh . Oh. Okay, that's probably a- Really? Well, now my hand's covered in glass. You threw glass in the pool? The pool guy gave me. What the hell? Didn't they just service this today too? A little bit. While Jordan gets the Chitus and clarifying agent kit installed, I'm just gonna poke around in the app a little bit and see what we can do here. And I guess we're not gonna do quick mode. Let's go ahead and do floor, wall, and waterline. We got these on the surface too. We should do surface as well. Okay, right. Thanks. Honestly, there's not really that much to configure. Once it's done, it'll give you a report on there as well about what it's done. Cool. Theoretically, that's it. We're good to go. Pro lights on. You wanna do the honors? This feels so wrong. Oh, we didn't even talk about what it's supposed to do when it's done. It's supposed to come back to kind of where it started and then park at the side so you can just grab it out. I guess we'll see. This is cool. Obviously, it's gonna disconnect if it goes below the surface, but right now it's got a Wi-Fi signal that's telling me exactly what it's doing. That's awesome. It's definitely doing stuff this time. We can see that it is picking up leaves, which is kind of cool. I mean, it might have been doing something last time. We just couldn't see it. I don't know if I can find the rhyme or reason to its cleaning pattern right now. Apparently it uses their clever nav navigation system with sonic sense sensors and intelligent path optimization, whatever that means. We're testing the obstacle avoidance by hooking that frisbee in there, so we'll see what happens there. And it has a different mode powered by a quad core arm CPU that handles irregular shapes and difficult transitions. It's got nine motors to run things and uses an S pattern for the floor, with an N pattern for the walls and water line, and an S pattern for the surface. All of that is in theory so far, though. Let's see how it does. So I think this means it wants to be picked up because it's full. Take a look at that. Oh wow. Once it came to the surface, it reconnected to the phone app, and it told us that it wanted the basket cleaned. So we've got that done, we're going to put it back in the water and see what happens. It looks like it wants attention again. So, it's telling us to clean the basket again. Still at half battery, that's pretty good. So it tells us it spent whatever amount of time on the floor. Cleaning was interrupted due to clogged filter basket. We're back on the surface again after another 44 minutes. So now we're right about two hours of cleaning time. Yep, that's gross again. We've got a good pile going there. We're starting to lose some daylight and we're not quite done. So I think we're just going to put this thing back on the charger and come back another day to finish up. We're also down to about 30% of our battery life. So this guy could use a little snack before we put him back in the pool. We're back. It's a much nicer day today. So we're going to throw the bot back in the pool and see what happens. BeatBot told us it won't clean stairs, but they didn't mention that it just seems to have trouble with the entire concept of stairs and it's getting hung up here. BeatBot does have a new multi-zone mode in testing that they say should enable the AquaSense Pro to handle big sets of stairs like these, but unfortunately it wasn't made available to us at the time of filming. it looks like it's just stopped on us here as far as we can tell the lights flashing red so we're going fishing it's giving another battery warning but let's just look at the cleaning record here 123 on the floor 44 on the walls hasn't managed to make the surface yet i don't know how they're claiming nine and a half hours of battery life in any mode here oh wow i think that's the fullest we've seen it there's actually a lot of leaves I will give it that we've given the AquaSense some time to recharge and throw it back in the pool unfortunately it's gone back to floor mode so at this rate we might get the surface of the pool cleaned sometime next year I should make it clear we have updated the firmware and followed all the directions properly it does its own thing when you put it back in the water BeatBot support gave us a little help with the app so we're going to get this thing going on just the surface this time what we have to do is unselect the ones we don't want And that's it, there we go At the end of the day or I guess days Wow, we've put the AquaSense Pro through quite the wringer and it picked up a ton of debris from the pool Far more than I would have really expected given its intended light pool maintenance every few weeks use case And as the bot gets more exposure to North American pools and beat bot pushes out updated firmware and apps We expect to see the AquaSense Pro to continue to improve over time So if you want to be along for the ride we're gonna have links And who knows maybe a promo code down in the video description In the meantime a big thanks to BeatBot and the pros at Mr. Pool Who have finally completed this incredible transformation of my neighbor's pool Can you believe Jordan that there's a tile mosaic bottom on this pool? I had no idea I didn't even know it was blue This thing's gone from terrifying to honestly kind of tempting All that's left is to put a bow on the AquaSense Pro and hope that it enjoys its new home Fingers crossed If you guys liked this video, maybe you'll like the one where we tried a lawn mowing robot That was actually one of Jordan's first videos. How do you get stuck with all these? Just lucky",
    "transcript_keywords": [
        "AquaSense Pro",
        "pool",
        "Pro",
        "back",
        "surface",
        "AquaSense",
        "pool cleaning robot",
        "time",
        "robot",
        "water",
        "Beatbot",
        "clean",
        "bottom",
        "Yeah",
        "floor",
        "put",
        "cleaning",
        "neighbor pool",
        "pool cleaning",
        "good"
    ],
    "transcript_entity_values": [
        "nine",
        "one",
        "second",
        "20",
        "Titanic",
        "first",
        "another 44 minutes",
        "BeatBot He's",
        "44",
        "Beatbot",
        "The AquaSense Pro",
        "Collin",
        "Beatbot",
        "AquaSense",
        "North American",
        "every few weeks",
        "nine and a",
        "Yvonne",
        "about two hours",
        "today",
        "the end of the day",
        "Pool",
        "two to three",
        "Down",
        "a ton",
        "BeatBot",
        "5",
        "AquaSense Pro",
        "the AquaSense Pro",
        "BeatBot",
        "mosaic",
        "CPU",
        "about 30%",
        "123",
        "third",
        "the day",
        "next year",
        "Chitus",
        "GoPro",
        "half",
        "frisbee",
        "Jordan",
        "Jordan"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "FAC",
        "ORDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "NORP",
        "DATE",
        "DATE",
        "PERSON",
        "TIME",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "PERSON"
    ]
}