{
    "id": "VVtQfsXLnSA",
    "title": "M1 MacBook Air is Faster Than You Think! (Real Tests) - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-11-18T18:00:11Z",
    "video_url": "https://www.youtube.com/watch?v=VVtQfsXLnSA",
    "category": "Science & Technology",
    "tags": [
        "M1 MacBook Air is Faster Than You Think! - Krazy Ken's Tech Misadventures",
        "Apple Silicon",
        "M1 Chip",
        "MacBook Air",
        "Mac mini",
        "Final Cut Pro",
        "FCP X",
        "Apple",
        "Mac",
        "macOS Big Sur",
        "macOS 11",
        "Intel",
        "iMac",
        "Universal (Software)",
        "Rosetta (Software)",
        "Photoshop",
        "Cheetah3D",
        "Benchmark",
        "Macintosh",
        "Computer",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Raw",
        "Reaction",
        "Tech",
        "Computer Clan"
    ],
    "views": 104285,
    "likes": 4328,
    "comments_count": 583,
    "description": "The M1 MacBook Air is the first part of Apple's transition away from Intel processors. Despite the criticisms about it being a \"phone\" chip, it's incredibly fast, power efficient, and cool. You have to see it to believe it, so check it out; Krazy Ken will be your captain for today.  Learn more about Apple silicon   Download our epic wallpapers   Get more Tech Misadventures episodes   Subscribe for more tech videos!    Like us on Facebook   Follow us on Twitter    Krazy Ken's Tech Misadventures - M1 MacBook Air is Faster Than You Think!  UPDATE: I have been informed that I was not holding a PowerBook 100 at the end, like I accidentally claimed. Yep! It's a 165c. The sad thing is I actually HAVE a 100, but I guess I didn't check close enough when I went on camera. Oops.   Patrons got to see this episode early (and in much higher playback quality). They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #KrazyKen #ComputerClan",
    "description_links": [
        "https://youtu.be/Tfg38JJA3oE",
        "https://thecomputerclan.com/wallpapers",
        "https://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "(beeping) - So when this is all stitched together this is going to be about a 750-megapixel picture being stitched together in a Rosetta app. Plenty of multitasking, only eight gigs of RAM, baseline configuration, I say that right when a GarageBand hung up. We're going to quit that. So GarageBand was just being a dick. (beeping) (upbeat music playing) Hey guys, how are you all doing? If you're new here, welcome. My name is Crazy Ken and today we're going to be taking a look at a Mac that has been rumored since 2011, an ARM-based Mac. Specifically, an Apple silicon-based Mac, the new MacBook Air with Apple's custom M1 chip. There's tons of hype and criticism about this computer going around the internet. So I'm really excited to try it out for the first time. And I'm also surprised at how many people have such strong opinions about this thing even though they haven't used it yet. It's weird how that works. Oh, pardon me, where are my manners. I should probably explain the goggles and lab coat. Well, this is an appropriate way to dress when testing out a new computer of this magnitude. So safety first. So here's the plan, I've devised a series of tests, real world tests, not benchmarks with numbers, actual usable tests which will put this computer's performance and thermal management through its paces. And remember, this thing doesn't have a fan. So I'm very curious to see how hot this thing actually gets. And it's the cheapest model, this is the cheapest MacBook Air you can buy which means all of the specs are using the baseline configuration. And throughout these tests, we'll be using a combination of native Apple Silicon-optimized universal applications, but we'll also be using some Intel applications which will be running with backward compatibility thanks to Apple's Rosetta technology. So we'll see how stable that is. So if you're ready and I know you are, let's dive in. And screw this (beep) I can't see. Whoa, it's bright all of a sudden, okay. Okay so I have my test files already loaded on the MacBook Air, but before we continue I want to test this new prototype invention. It's called a reaction camera, it's completely original, do not steal it, but when I do decide to sell it I see it being really popular in the gaming community and stuff like that. But anyway, I've been trying to avoid the M1 spoilers like crazy because I wanted to save my initial first reactions and impressions for this moment with you guys. So I have my comparisons on my ginormous new iPhone, this thing is a freaking cinder block, and I'm going to compare the MacBook Air to my iMac and MacBook Pro. A 2013 MacBook Pro and a 2020 iMac. So let's start with a 3-D render test. This will be done in a program called Cheetah3D, which will be running through Rosetta. I already booted it up once, but I didn't do anything else with it. So all of the settings are already set and it's going to be 1000 samples at 1080p. So let's see how fast this M1 MacBook Air can do it, this is my first test I'm ever running. Here we go, three, two, one go, render. And I pressed the wrong button. Okay, three, two, one render. Now we got it, here we go. We're already at 130 samples after 29 seconds, it's cool it's got its own little timer built in so that makes things a little bit easier. So on my MacBook Pro, it clocked in at three minutes and 57 seconds. That's again, a 2013 MacBook Pro, and on my 2020 iMac, it clocked in at 58 seconds. So let's see what this one clocks in at, we're about to pass 58. Look at that shiny logo, isn't that cool? So we're probably going to hit about just under three minutes. Throughout all the tests we do today, keep in mind this is the slowest M1 portable Mac Apple's ever going to make unless for some reason they went backwards. So yeah, this is going to be pretty cool. And the nice thing is it's quiet. On my iMac, it was a little bit loud, the fan on there isn't too bad but on my MacBook Pro it was significantly louder. On here, it's making no noise at all. Three, two, one, done. It clocked in even faster than my original guess. So that was 156 seconds. So definitely not as fast as the specked out iMac, but I think we all could assume that. But significantly faster than the older Intel-based MacBook Pro. That's the 3-D test. So what should we do next? Hmm, I wonder. I actually don't know, I have, we don't script things here, what are we talking about? Actually, sometimes we do but not today. Let's see, we have Final Cut Pro, I'm a video guy. That's a pretty important thing to me, let's see how well this thing can handle video-editing tasks. So there's a couple of things I want to test here. I want to test playback and I want to test an export, and then I want to test an HEVC conversion of that export. This is a multi-cam sequence with two streams of 4K ProRes, and as you can see, I'm just scrubbing this right now and it is not slowing down at all. I'm going to set the playback to better quality mode and play this thing. And this footage is actually from a recent episode, it was from the iPhone 12 Pro Max versus Black Magic episode. If you haven't seen it yet, it's from my other show, \"Crazy Ken's Tech Talk\" definitely check it out. But as you can see, dual 4K ProRes streams in a multi-cam sequence here, it is not dropping a frame, there's no noise 'cause, you know, there's no fans running. So now the real test, let's go ahead and export this thing. So we have it set to, we're going to do an H.264 export. Three, two, one go. All right so now we are timing this export and Final Cut will do this in the background, but if we want we can actually pull this little guy up here. And again, I have not run any of these tests before. You're witnessing them firsthand same as me, I'm witnessing this stuff firsthand. But it's already at 10%. My iMac and MacBook Pro we're actually really close in times. According to my notes, the iMac clocked in at three minutes and three seconds and the MacBook Pro clocked in at three minutes and six seconds. So I think that's just the way Final Cut like gradually ramps up the processor usage. I'm actually not sure about that, but those computers I know are very different in speed, but in terms of this export, they were actually about the same amount of time. But the big difference was, you know, the MacBook Pro's fans were a lot louder. Okay, we're about halfway done and we're at the minute and 52nd mark. So at this rate, it's going to be slower than even that 2013 Intel MacBook Pro. It's so weird not hearing anything where even newer MacBook Pros are like, (blowing) they're like jet engines. This thing is making no noise. That's just, that's crazy. 10% left, we're at three and a half minutes. 95. Oh, there (beep), okay, well, we're just jumping right to 100%. So that was quick. So three minutes 49 seconds. So only a little bit slower than the iMac and a little bit slower than the MacBook Pro by like, you know, about 30 ish, 40 ish seconds. So that's not too bad. So here's the exported file with all that footage in there. So now let's convert this to an HEVC file, which will have the same quality but it will be half the size. And without a dedicated encoder, HEVC conversion can be a pain in the butt. And if you don't know what I mean, I'll explain in five seconds. So three, two, one go. So we are now exporting with QuickTime here. On my iMac, this took 59 seconds. Now that has a T2 chip which has a dedicated encoder to work with this kind of stuff. On my MacBook Pro, this is where it's crazy. That thing doesn't have a dedicated encoder for HEVC. I had to cancel it because it was taking so long. It got up to one hour remaining and it just kept taking forever, the progress bar was hardly moving. So it was going to take over an hour on the 2013 MacBook Pro. But on here, holy cow, we're almost done. I gotta get back to my timer app, hang on. Oh my gosh, this is going to be faster than my fricking like specked out iMac, holy cow. Is it gonna make it? So close! If you can do it within 10 seconds, you will beat my like $3,000 fricking iMac, holy cow. And done. 56 seconds. It converted that file three seconds faster than my almost completely specked out like, it was like $3,500 something iMac. Holy cow. That's pretty cool man. Oh shoot. Oh, that's great. I gotta, I gotta cry. Let's take a look at the SSD speed and let's go ahead and run that right now. I usually let it go to the second cycle. So that's number one, number two. Oh wait, no, that's number one on each, sorry. I'm a little loopy, it's been a long eight months. Anyway, and, I'd say right about there, boom done. Okay so we have about two gigabytes per second write and about 2.6 gigabytes per second read, which is really great. The write is a bit slower than on my iMac, my iMac clocked in at 2.35 gigabytes per second write. So the iMac's a little bit faster there, but for the read, during this particular test, this cheap ass MacBook Air clocked in at 2.6 where my iMac clocked in at 2.49. So the SSD is pretty darn fast and I have no problem with that, that's a good speed right there, all right. So we'll close out of there. Now let's open up another Rosetta app, an app that is not optimized for Apple Silicon yet. It's in beta for Apple Silicon, but it's not officially out yet. Shotophop. And I'm going to run a script that is built in, it's an automation script or whatever they call it built into Photoshop that's going to take a bunch of pictures that I shot and stitch them together into a panorama. I shot 38 photos when I was at Apple Park and I'm going to stitch them into a panorama. So we're going to go to file, automate, and let's see here, photo merge. So when this is all stitched together, this is going to be about a 750 megapixel picture being stitched together in a Rosetta app. So let's open that in here, get our timer on standby. Here we go, three, two, one go. All right, so that is running the automation right now. So for what it's worth, on my iMac, this process clocked in at five minutes and 43 seconds. On my MacBook Pro, it clocked in at six minutes and 22 seconds. And again, it's a Rosetta app, it is not optimized for Apple silicon. So just the fact that this is working without like starting on fire is kind of cool. Oh my gosh, this is going really fast, and Adobe really isn't known for making the fastest software. Holy cow, it's already going into blending. Oh gosh, okay. Well we're at three minutes and 14 seconds. So if this can get done in under two minutes, it will officially beat my nearly specked-out iMac. Not embarrassing at all. Come on baby, you can do it. Four minutes 30 seconds. Come on, beat that iMac. Yay! Oh man. Oh dude, it might actually beat it. It's got like a little under 60 seconds left if it wants to beat it. Holy cow guys, there's the panorama, a 500, or excuse me, a 750 something megapixel panorama. Four minutes 49 seconds in a Rosetta app not even optimized for native Apple Silicon support. The cheapest baseline portable M1 Mac did that faster than my over $3,000 almost fully specked-out Intel iMac. I am super excited for Apple 'cause it's only going to get faster from here. Happy for them, sad for me. I'm going to go stress test the battery. Be right back. Holy crap, it's not even lukewarm guys. It's barely warm at all, my MacBook pro by now would have been like 20 times hotter. Okay so I'm continuing the battery stress test and, you know, I know some people were complaining about only eight gigs of RAM. I was never concerned about that. Everything is going to be so much more optimized on here, plus the RAM, it's unified memory so it's going to perform faster. So I was never concerned about eight gigs, I don't think a lot of people need to be concerned with it either. But you know, just in case people are, let's do some additional stress testing. So I just did that QuickTime conversion, Final Cut's running in the background. We still have you know, we're still running on battery here. Let's go ahead and open up Photoshop and run that script. And then while that's running, let's just open a bunch of stuff and let's render that. We can open up iMovie here, you can open up Motion, Preview, maybe Pages, Dictionary, Image Capture, GarageBand, the Home app, System Preferences, let's just open up all those at once. Like, yeah, I'm having no problems here. I can switch between everything, I'm not seeing any problems with only eight gigs of RAM here, while again, we're running that script in the background in a Rosetta app and rendering something in the background in another Rosetta app. Everything is smooth as butter still and I can easily multitask between things. And yep, it's using 6.2 gigs. So it has a little bit of memory free while it's running all this stuff. It looks like Photoshop is using the most, which doesn't surprise me, it's doing a lot of stuff in the background. I can switch to anything. I say that right when GarageBand hung up. Okay, that was awkward, we're going to quit that. But everything else is working, I don't know why GarageBand wanted to be a party pooper, that could have been some other issue but literally every other program is working just fine. So GarageBand was just being a dick. Nothing wrong here, let's open up a our frickin' Motion project, move our camera around. Like, dude, all this stuff is working. This is incredible, it's doing all this stuff in the background, plenty of multitasking, only eight gigs of RAM, baseline configuration. It's still running fine but it's still holding out pretty well. It says 100% even though we have these apps using significant energy. Final Cut's still in the background here, scrub a dub a dub, dual 4K streams, no problems at all. Rest assured people, if anyone was concerned about eight gigs of RAM not being enough, it's plenty. The RAM is faster, things are more optimized, even Rosetta stuff is working just fine. So I don't think you have to worry. if you want to upgrade, you can pay for the more memory but for a lot of people, I think this is going to be fine especially for just a cheap way to get into the Mac portable ecosystem. Tiny bit of lag there. I'm really stress testing it though, I have a lot of stuff open. You know, I'm going to show you the good and the bad. So there's like a little bit of stuttering there when you do certain things but like it's, it's still pretty solid. Let's open up a 4K movie. Scrubs just fine, taking a little bit to load up there. But again, this isn't even an Apple silicon-optimized app. And here we go, we're panning around this like 750 megapixel ginormous panorama here on a Rosetta app and it's working just fine with all this other stuff going on in the background. So I think it's safe to say this is a kick ass computer with its speed, operates quietly, it's cool, battery life still isn't budging, kind of speechless. Nice job Apple. I'm excited for the future, I'm excited to see what you do with the iMac and the Mac Pro. This is big. It's crazy to see how far we've come, right? Apple's first PowerBook, the PowerBoook 100 from 1991 and their latest MacBook Air notebook. This guy actually appeared in my other show, \"Crazy Ken's Tech Talk.\" It was in the 8-Bit Guy crossover episode. That was a pretty fun one, so go check that out too. But yeah, impressive. Honestly, I'm just blown away by this computer. And the best part is this is currently the slowest computer in the M1 series that Apple makes. Everything is just going to be faster from here, and this is first-generation stuff. Let me know what you think about the M1 Macs, and if you have any questions about them, feel free to drop a comment down below, I'll do my best to answer. I also have an M1 Mac mini coming, which has a fan in it. So supposedly, it's supposed to be able to run faster so stay tuned for a follow-up on that. But because I'm kind of crazy busy right now, I probably won't do a full-blown episode about it because I am working on a new tech scam busting episode with the highly requested Cardieo Apple Watch knock-off. So I've been pretty busy, but go ahead and follow me on Twitter 'cause I'll probably post some updates about the Mac mini there. And on a side note, if you want the wallpaper that I made there's a link in the description for that too. And hey, if you liked this episode, you know what to do. Thanks for sticking with me, catch the crazy and pass it on. (upbeat music)",
    "transcript_keywords": [
        "MacBook Pro",
        "Pro",
        "MacBook Air",
        "MacBook",
        "Apple",
        "Rosetta app",
        "iMac",
        "Rosetta",
        "test",
        "Apple Silicon",
        "Intel MacBook Pro",
        "Mac",
        "Final Cut",
        "Final Cut Pro",
        "MacBook Pro clocked",
        "minutes",
        "thing",
        "app",
        "Air",
        "stuff"
    ],
    "transcript_entity_values": [
        "59 seconds",
        "Rosetta",
        "Final Cut's",
        "Cardieo Apple Watch",
        "the M1 Macs",
        "the MacBook Air",
        "MacBook Pro",
        "750 megapixel",
        "the MacBook Pro's",
        "two",
        "3,000",
        "Final Cut Pro",
        "SSD",
        "3",
        "the MacBook Pro",
        "20",
        "up to one hour",
        "1991",
        "Crazy Ken's Tech",
        "six minutes and 22 seconds",
        "three seconds",
        "38",
        "one",
        "MacBook Pro",
        "a long eight months",
        "five minutes and 43 seconds",
        "2.49",
        "MacBook Air",
        "GarageBand",
        "Final Cut's",
        "2020",
        "under two minutes",
        "Black Magic",
        "Three",
        "Four minutes 30 seconds",
        "750",
        "Mac Apple's",
        "Crazy Ken's Tech Talk",
        "about 2.6 gigabytes",
        "Apple Park",
        "Apple",
        "156 seconds",
        "8",
        "HEVC",
        "2013",
        "Mac",
        "Apple Silicon",
        "the Mac Pro",
        "100%",
        "6.2",
        "the MacBook Air",
        "first",
        "4",
        "the minute",
        "Four minutes 49 seconds",
        "iMac",
        "100",
        "MacBook Air",
        "750-megapixel",
        "Final Cut",
        "Intel iMac",
        "GarageBand",
        "three",
        "29 seconds",
        "number one",
        "about two gigabytes",
        "M1 Mac",
        "the MacBook Pro",
        "Home",
        "Adobe",
        "Shotophop",
        "about eight",
        "58 seconds",
        "3,500",
        "three minutes and 14 seconds",
        "three minutes and 57 seconds",
        "PowerBook",
        "MacBook Pros",
        "40 ish seconds",
        "500",
        "today",
        "56 seconds",
        "Image Capture",
        "five seconds",
        "M1 MacBook Air",
        "Rosetta",
        "just under three minutes",
        "about 30",
        "58",
        "iPhone",
        "Twitter",
        "2011",
        "about only eight",
        "Motion, Preview",
        "K ProRes",
        "three minutes 49 seconds",
        "half",
        "1000",
        "my MacBook Pro",
        "over $3,000",
        "iMac",
        "10%",
        "over an hour",
        "three minutes and three seconds",
        "Mac",
        "Photoshop",
        "three and a half minutes",
        "1080p",
        "10 seconds",
        "T2",
        "12",
        "only eight",
        "RAM",
        "three minutes and six seconds",
        "130",
        "my MacBook Pro",
        "2.35 gigabytes",
        "2.6",
        "M1",
        "Intel",
        "second",
        "95",
        "a little under 60 seconds",
        "Crazy Ken",
        "Intel MacBook Pro"
    ],
    "transcript_entity_types": [
        "TIME",
        "NORP",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "FAC",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "TIME",
        "DATE",
        "WORK_OF_ART",
        "TIME",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "FAC",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "FAC",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "FAC",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "TIME",
        "MONEY",
        "TIME",
        "TIME",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "DATE",
        "TIME",
        "PERSON",
        "TIME",
        "PRODUCT",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "MONEY",
        "FAC",
        "PERCENT",
        "TIME",
        "TIME",
        "PERSON",
        "ORG",
        "TIME",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "PERSON",
        "ORG"
    ]
}