{
    "id": "vVVFAC2p2X8",
    "title": "THE $35,000 RACING SIMULATOR",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-10-15T21:15:34Z",
    "video_url": "https://www.youtube.com/watch?v=vVVFAC2p2X8",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "gtx titan",
        "racing simulator",
        "best racing simulator",
        "2016",
        "2017",
        "cool",
        "fanatec",
        "rseat",
        "maingear",
        "lg",
        "oled",
        "lg oled",
        "titan",
        "nvidia",
        "gtx",
        "racing",
        "simulator",
        "gaming",
        "video games",
        "race",
        "race simulator",
        "project cars",
        "dirt",
        "pc racing siumulator",
        "pc",
        "xbox",
        "xbox one",
        "forza",
        "playstation",
        "logitech",
        "thrustmaster",
        "g27",
        "driving",
        "cockpit",
        "drifting",
        "playstation 4",
        "games",
        "simulation",
        "gran turismo",
        "ps4",
        "sim",
        "best"
    ],
    "views": 5396542,
    "likes": 88840,
    "comments_count": 7003,
    "description": "This racing simulator consists of the following - 65-inch LG Curved OLED Display -  MAINGEAR PC -  GTX Titan Graphics -  Fanatec Wheel / Accessories -  RSEAT Seating and TV mounts -   This was a fun project. Always wanted to create a racing simulator and finally had the chance to put one together. This thing give you a serious rush, especially when driving an F1 car in Project Cars!  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/2ehutVH",
        "https://www.maingear.com/",
        "http://amzn.to/2dTsnP5",
        "https://www.fanatec.com/",
        "http://www.rseat.net/",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "That... This thing's been in development for a while okay?! It's a racing simulator But it's unprecedented Is it crazy? Yeah! Maybe! So am I... I love these OLED displays, call up LG I said \"Guys!\" \"Why send me one when you can send me three?!\" Power 'em up, juice 'em up GTX Titans times 3 System from main gear But the moment is now! The truth is here. Lemme break it down for ya. So, the displays. Obviously very big These are 65 inch TVs And the difficult part was figuring out just how to rig them up in such a fashion that would work I found these mounts here from a company called RC It allows for you to essentially manoeuvre displays of various sizes Now OLED, why OLED? What you end up with is incredibly vibrant colours Lots of saturation, it's a really nice viewing experience. If you want more information on that, go watch the original video. So once I got those things set up it was like alright, gotta drive these pixels. Well lucky enough I had the system from main gear also featured in a previous video It had a GTX Titan but it wasn't enough still for all these pixels so I had to go out then put a few more in there, beef it up a little bit The racing specific stuff - I looked around, I did a little bit of research I wanted something... I don't know just to be on the same calibre as the other components I looked beyond those logitech wheels and I moved up to a company called fanatic So whether you're playing Project Cars or you're playing Dirt When you're... At a high speed and trying to... It's fighting back against you like an actual steering wheel would Now this part on the front is called the rim This one is a replica from the Porsche 918 Metal pedals Brake, clutch And those are even adjustable if you wanna get crazy with it Now everything attaches to this seat. The seat makes it easy They make these in a couple of different configurations and colours, and this one is an asseto corsa special edition which is red and black Lemme jump in the seat and show you how it all operates Lets do a little... What do I look like, do I look like... Michael Schumacher, huh? So this game I'm playing right here, this is called Project Cars Kinda like a video game controller it allows you to navigate around I'm in practise mode right now there's so many different tracks to choose from including, of course The Nrburgring When it comes to cars I told you there's a lot to pick from street cars all the way up to F1 cars Le Mans style cars What you guys are noticing right here is the guideline on the track Green means you're OK at the speed you're travelling at Yellow is you better start to slow down a bit And red is you're coming in way too high So that's just a little explanation there I'll try and get it up to red. Lets see here so you see it starts to turn red? You need to brake, downshift... Anyway, it's essentially- here I'm crashing a million... multi-million dollar car you see you can do it in a simulator you can't do that in real life! It's a way of becoming more comfortable with the various tracks of course going into it you don't know what the approach looks like or the next turn looks like so as you're kinda becoming familiar with the track it's nice to have those indicators eventually you can turn that off on tracks that you're familiar with So there you have it! A peek at this thing that I built! I want to give a shoutout to LG for making this setup possible It's an open invite All you've gotta do is bring the pizza Bring the beer And you can have free reign Come over and drive a virtual version of a two million dollar car Sound like a deal? [English Subtitles by iVexusHD]",
    "transcript_keywords": [
        "Cars",
        "Project Cars",
        "OLED",
        "called Project Cars",
        "Project Cars Kind",
        "called",
        "playing Project Cars",
        "red",
        "dollar car",
        "GTX Titans",
        "GTX Titan",
        "GTX Titans times",
        "System from main",
        "tracks",
        "displays",
        "video",
        "bit",
        "OLED displays",
        "playing",
        "GTX"
    ],
    "transcript_entity_values": [
        "multi-million dollar",
        "Dirt",
        "Porsche",
        "Brake",
        "English",
        "two million dollar",
        "GTX Titans",
        "a million",
        "Lemme",
        "GTX",
        "LG",
        "logitech",
        "3",
        "65 inch",
        "RC",
        "Project Cars",
        "Green",
        "three",
        "Titan",
        "Le Mans",
        "Michael Schumacher"
    ],
    "transcript_entity_types": [
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "LANGUAGE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON"
    ]
}