{
    "id": "VWnhXr5sycg",
    "title": "Can your 240Hz gaming monitor do THIS?!?! - ASUS XG17",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-09-22T19:33:32Z",
    "video_url": "https://www.youtube.com/watch?v=VWnhXr5sycg",
    "category": "Science & Technology",
    "tags": [
        "ASUS",
        "James",
        "Unboxing",
        "Monitor",
        "Portable",
        "Gaming",
        "PC",
        "USB-C",
        "Thunderbolt 3",
        "Battery",
        "IPS",
        "240Hz",
        "Tripod",
        "Travel",
        "ROG",
        "Strix"
    ],
    "views": 594509,
    "likes": 24196,
    "comments_count": 1294,
    "description": "Join us in War Thunder for FREE on PC, PS4, and Xbox One:  Get an exclusive bonus using our link - thanks for supporting the channel!  Portable USB-C/Thunderbolt 3 monitors are not new, but one that is IPS, 240hz, and fairly color accurate is pretty new! Let's see what James thinks of the ASUS XG17 monitor.   Buy ASUS XG17 Portable Gaming Monitor On Amazon:     On BHPhoto:    Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://gjn.link/WTShortCircuit",
        "https://geni.us/x6y6p",
        "https://geni.us/rohFcQ",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- If 2020 has taught me anything, it's that the world needs 240-hertz gaming monitors, no matter where you might be, at home, at the office, at the home office. This is a portable monitor from ASUS called the ROG Strix XG17. The cool thing about it though is that it is an IPS monitor that has a refresh rate of 240 hertz, so it's an awesome gaming monitor that also is gonna have nice colors and good viewing angles. This package is the $600 one. This is a stand, magnetic. I'll check that out in a minute. This is something no one's gonna read. Oh actually, here we go. It's a color calibration testing report. These are always nice to have included. So they claim that with their testing equipment in the sRGB color space, they had 99.5% coverage of that gamut and a color accuracy of 0.54, a Delta E average. That's really low. This is the unit itself. Very light, very thin. This is a USB-C 2-type C cable. You can use that for power and video transmission and audio. And this is a micro HDMI cable. Normal HDMI on one side to my laptop or wherever, and then the micro HDMI side is gonna go into the device itself. And is that it? Here we go. Here's that little adapter that used to be nestled in the box. Yeah, it's just a USB type A to type C. And also inside this, this is basically like one of those boxes that you use to organize your pills by day of the week, but instead you've got a wall wart in here. 100 to 240 volts, output 5 volts. There we go. This right here, the last two things on the desk here are things that are optional for the extra $100 package. The $600 package. It is $100 more expensive. Let's see if this stuff is worth $100. First, you get a bag. It has a couple of different sections. There's some dividers in it. So it looks like you could put the monitor as well as maybe a laptop or some books or something in here. So okay, I would value this at maybe, I'd pay like 20 bucks for this. Then you got this. This is a tripod. This is a actually a kind of cool little tripod. This thing looks like it's gonna kill me, like it's gonna hug my face and implant eggs down my throat or something. This is a cool little design. It has height adjust. It has 90 degrees there. And you can lock that up there. I think you press this button to release it back down, and then suddenly you've got a club. This thing (laughs) you could kill a man with this thing. This thing's heavy, man. It has a disc at the top of it. That looks like a quarter-inch thread that I guess will allow us to attach it to here. Yeah, this is cool. It's got like this two-tone brushed finish on the back here. Mm. I think though that it has a special puck. Is that, there it is. You just screw on this one part. There, like that. That's cool, however, once that's on there, it kind of makes this less fun. Like now you've got this bump. Having it on here though, this configuration, I call it toilet mode. You just plop her on the ground between your knees and just look down at your game. Na This is an elegant little solution. Like if you plop this down, like, I basically feel like James Bond, like bam. You imagine putting that down on a coffee shop or like on the table of a train or something like that? That's pretty badass. Boom. How productive. Flatten that out. You can kind of have her right beside. Decent. So what's the valuation of this then? Let's say if I said that was $20, is this 80 US dollars? I don't know. It feels more like it should be like 40 or something. So 100 bucks for this extra package is kind of a lot, but I dunno, maybe they know that this is a niche product, so they just think people will buy it, I dunno. So let's look at your options if you didn't buy that and all you have is this smart cover. Okay, that seems like it goes there. Oh, this is cheating. I gotta take that off. This is if you're like way above it. It's actually okay like that, the angle I'm at currently, but you can't really get it to be straight up. Like that is, this is really precarious. It's gonna flip off of there. You could do this and then you can close it like so. Well, let's see how light it really is, 'cause you're gonna have to carry this thing around. On top of your laptop, 1,300 grams. There are keyboards that weigh that much. And don't forget, you might also if carry around this thing, another 640 grams which is the weight of a more like full-sized 10-key keyboard. So bear that in mind. On this side, we have the aforementioned micro HDMI port, we have a USB type C form factor, a display port, so it's the display port alt mode on USB type C. Then you have another type C that does not have display port, but it does support just charging. The display port one has charging and display port. This one's just charging, so you can charge this thing while you're running on HDMI, for example, which doesn't have power delivery. And then you've got a headphone jack. Up here you've got the power button and like volume rockers and just other OSD controls. And they feel reasonably tactile. - \"War Thunder\" is the sponsor of today's video, and it's the free-to-play online military vehicle combat game that's available on Windows, Mac, Linux, PlayStation, and Xbox with Crossplay. It features an incredible arsenal of more than 1,500 historically accurate playable tanks, aircraft, helicopters, and ships from the 1930s to the 1990s and massive combined arms battles on over 80 major battlefields from World War II to the end of the Cold War. So don't wait, head to the link below and start playing \"War Thunder\" for free. You'll also get an exclusive bonus. - All right, so I've got my laptop here. Admittedly, this laptop has a 300-hertz display on it, so I'm trying to figure out if that makes it the least likely pairing of these two, or is it actually more likely? So I've got it plugged in through the display port cable, and I also plugged it in through the, I plugged in the power cable to on a different port. Even though you can charge through just that display port port, it was just like super dead and not working. So I said, \"Screw it. I'm gonna shove as many electrons in this thing as I can.\" So here we are. It is, in fact, 239.964 hertz at 8-bit 1080p. And now if I actually look at one individual and track with my eye, then I can actually see the ghosting on it. And I can see some ghosting for sure, but it's pretty good motion clarity. The thing with this test is that little ship is designed to have elements in it that tell you how much blur is going on. So if this were a paused image, you can kind of see the little guy up here. He's got three green eyes. The ship has a white dots on the side and each of those dots is actually three dots per section of the ship. 240 hertz really helps a lot with clarity, even if it is a fast IPS panel, which doesn't have as quick of pixel response times as TN panels. Now this one specifically, it's kind of weird because usually a monitor is always gonna say it has one millisecond gray-to-gray pixel response times, but they actually advertise this one as having three millisecond pixel response times. And again, usually they get that most aggressive number from the most aggressive overdrive setting. So let's actually check out the overdrive settings now. Overdrive. Whoa, five levels. We're on three right now. I'm gonna say right now that three is probably what you would want most of the time, but let's just check it out anyway. Let's go to five. And huh. Actually don't see a lot of overdrive artifacts for five. Let's just go down to zero, see what that's like. Oh yeah. If I track over here one of these guys, and I change it while I'm looking at that individual, I can see the ghosting trail just gets a little longer when I turn off the overdrive. However, it doesn't actually introduce inverse ghosting or coronas when I hit level five. The overdrive isn't that aggressive. And maybe that's because they're just aiming for that three millisecond instead of a one millisecond response time number, because in other fast IPSs like from LG or even the 360-hertz monitor which we are just reviewing on LTT, when you put them on the fastest setting, you get those inverse coronas which have a distinctive look. And on here I guess they just didn't push it that hard, so they don't really have them as far as I can see here. That doesn't mean that I wouldn't see them in game, I might on that setting, especially at lower frame rates. Like if I left this on five and then I played a game, or I'm only getting like 60 FPS, then I'm driving the pixels harder than I need to. And you might see overdrive for no reason because this display does not have dynamic overdrive. This does not have that, so you're actually gonna have to choose which overdrive setting you want. If I'm playing a game that I just don't get that many frames in, then I would turn it down to zero, one, two, three, and if I'm running at 240 hertz, I think you could safely put this at setting five. Like it really looks fine. Why don't we take a listen to the speakers? (bright music) That sounds pretty bad. It's pretty quiet. I mean, the speakers are there. They're integrated into this front section. Like look how small it is. Obviously, they're very tiny speakers. They're probably like phone speakers. If you're on the go, you probably have headphones anyway. And it has a headphone jack, so use headphones. This is like a pretty robust OSD. This is like all the settings you get in a full desktop monitor, so that's pretty awesome. Adaptive sync/free sync, Game Plus you get all the cheaty things, crosshair. Game Visual is just their name for different picture modes like FPS mode, right, like color profiles, cinema mode. Pretty accurate colors. It's not like Best Buy saturated. So the last thing to talk about with this monitor is battery life. It has a 7,800 milliamp-hour battery, which they claim will get you around 3 1/2 hours if you are kind of blasting the brightness and playing it up to 240 hertz. Given that it is a 240-hertz monitor with like decent colors, IPS panel, it has a battery in it, is it worth at a minimum 500 bucks? Now that's the price range of like decent mid-range desktop gaming monitors. For $500, you can get a BenQ XL256, like the e-sports monitor that everybody uses. Those are 500 to $550. (sighs) That's gonna be, I mean, they're both 240-hertz monitors, and this might even have better color accuracy, but that one has DyAc, like the motion strobing, all the way up to 240. It's gonna be a higher performing e-sports monitor than this, but it's not portable. This I can take to a LAN party, probably gonna be the best monitor there. I just see this as being too expensive for a lot of people. Like who is gonna buy it? Because if you have a really high-end gaming laptop and you just wanna upgrade the screen, then maybe you're balling enough, like you already have a $3,000 laptop, you buy this balling peripheral screen. I guess that person's out there. I don't think creators are gonna buy it really because it's only 1080p. So maybe the price isn't an issue for the customer who's gonna get this thing. I don't know, but it seems pretty expensive to me. I really wish it was maybe like 400 bucks, especially when you're talking about 600 bucks. I gotta put it in this bag. And this bag is really soft. I wouldn't really trust it to protect the screen from major impacts that are on sharp points. Well, that's kind of a beefy laptop. You guys tell me, is anyone gonna buy this? Hit us up in the comments section. Thanks for watching \"Short Circuit\" today. This is the ASIS XG17. 5 to $600, depending on the package you get. 240 hertz. Someone's gonna buy it.",
    "transcript_keywords": [
        "home office",
        "thing",
        "monitor",
        "display port",
        "port",
        "ROG Strix",
        "display",
        "overdrive",
        "buy",
        "kind",
        "laptop",
        "pretty",
        "HDMI",
        "game",
        "office",
        "home",
        "micro HDMI",
        "hertz",
        "USB type",
        "War"
    ],
    "transcript_entity_values": [
        "5 volts",
        "500",
        "240 volts",
        "20 bucks",
        "three",
        "40",
        "one",
        "USB",
        "20",
        "another 640 grams",
        "BenQ XL256",
        "8-bit",
        "240",
        "90 degrees",
        "100",
        "quarter-inch",
        "500 bucks",
        "Game Visual",
        "one millisecond",
        "OSD",
        "World War II",
        "day of the week",
        "three millisecond",
        "LTT",
        "Crossplay",
        "0.54",
        "TN",
        "Windows, Mac",
        "80",
        "around 3 1/2 hours",
        "2020",
        "James Bond",
        "Linux",
        "LAN",
        "3,000",
        "7,800 milliamp-hour",
        "Short Circuit",
        "300",
        "IPS",
        "LG",
        "100",
        "240 hertz",
        "360",
        "10",
        "100 bucks",
        "only 1080p",
        "600 bucks",
        "5 to $600",
        "HDMI",
        "the Cold War",
        "DyAc",
        "two",
        "War Thunder",
        "500 to $550",
        "60 FPS",
        "600",
        "1,300 grams",
        "Game Plus",
        "more than 1,500",
        "80 US dollars",
        "Mm",
        "Xbox",
        "239.964",
        "First",
        "the 1930s to the 1990s",
        "2",
        "PlayStation",
        "ASUS",
        "five",
        "jack",
        "99.5%",
        "today",
        "zero",
        "400 bucks"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORG",
        "EVENT",
        "DATE",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "MONEY",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "TIME",
        "MONEY",
        "MONEY",
        "ORG",
        "EVENT",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "MONEY"
    ]
}