{
    "id": "vz-rpRYFhRo",
    "title": "Nvidia Said No.. I said YES! - The 1000W GPU",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-05-01T23:52:30Z",
    "video_url": "https://www.youtube.com/watch?v=vz-rpRYFhRo",
    "category": "Science & Technology",
    "tags": [
        "RTX 4090",
        "Volt Mod",
        "Elmor Labs"
    ],
    "views": 3422615,
    "likes": 100891,
    "comments_count": 2868,
    "description": "Check out VideoCom for free at  and use code LINUS for 50% off any paid subscription!  Check out the super slim Corsair K100 Air Wireless Keyboard:   Nvidia have removed software voltage control from their newer GPUs... but we can get it back!  Discuss on the forum:   Buy an ASUS ROG Strix GeForece RTX 4090 OC Edition GPU:  Buy an EKWB EK-Quantum Vector 2 FE RTX 4090 GPU Cooling Block:  Check out the ElmorLabs EVC2SE Voltage Control Board:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - A 1000W RTX 4090???? 1:00 - Limits to overcome 3:49 - Easy OC with GPU Twerk 6:15 - Probing and Soldering a 4090 7:35 - Volt Mod on Air 10:50 - 1000W BIOS 14:44 - Chiller! 19:29 - VideoCom 20:03 - Outro",
    "description_links": [
        "https://lmg.gg/VideoCom",
        "https://lmg.gg/k100air",
        "https://linustechtips.com/topic/1504302-nvidia-said-no-i-said-yes/",
        "https://geni.us/BDqVW",
        "https://geni.us/FmEEz",
        "https://lmg.gg/CvThC",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Oh my God. That's your notes for this video? - Oh no, I have a tiny bit more stuff down here. - The point is we thought R-T-X 40-90: pretty fast, but could it be faster? Good timing for that. We're going to be taking this 40-90 STRIX from its stock 450 watts of power consumption, all the way to a thousand watts. Then, we're going to be adding external voltage modification and chilled water cooling, thanks to our Thermo Flex 5,000 to see just how far this baby can fly. Fly, like this \"fly\" segue to our sponsor. - Corsair! Looking for a thin, high quality and portable keyboard? Well then look at this: Corsair's latest keyboard the wireless K-100 air. It's got hyper fast connectivity and all day battery life. It's cherry MX Ultra low-profile switches provide an ultra-responsive experience that'll fit your work or gaming needs. Check it out at the link below. - One of the coolest things about modern GPUs is their ability to dynamically boost their clock speeds in order to deliver the best possible gaming experience. But as you can imagine, they can't just boost infinitely. So there are three main factors that we need to overcome if we want to increase their performance. The first is the thermal limit. This, intuitively, is put in place to prevent your card from cooking itself in its attempts to run cyberpunk at 500 frames per second. That we're not worried about today, though, because one: this cooler is totally overbuilt. This card survived at 80 degrees in a thermal chamber. - It's frosting over already, Alex! - [Alex] Okay, I'm turning it off. - And two, by the time we're done, we're going to be running this \"Quantum Vector\" square GPU block on it. Our main focus today, then, is how to overcome the other two: the voltage limit and current limit. For voltage control, we're going to be using this cool little doohickey from \"ElmorLabs\". It used to be that through software, you could just adjust the voltage on your GPU, but then Nvidia went, (mocking whiny noises) I'm pretty sure that's exactly the email they sent out and made their partners lock down voltage control. Thankfully, with a relatively simple soldering job and a USBC connection to this board, that functionality can be restored. As for current, we were planning to do a shunt mod again, like we did with the 30-90; where we trick the onboard controller into thinking that it's putting out half as much power as it actually is. But this time, thanks to NVIDIA's control freak nature, it turns out we don't even have to. Floating around on the internet are modded one thousand watt BIOSes for the RTX 40-90. Whether these came from enterprising users or were leaked from manufacturers, we have no way of knowing. But we do know that at some point in the development process, the 40-90 was intended to be a much more power hungry card, so we kind of suspect the former. And as it turns out, you don't even necessarily need to have a matching card to flash these BIOSes. Users have reported taking a mismatched BIOS, flashing it to their card and it firing right up. So thanks Nvidia for making all 40-90's the same, I guess. Convenient. - Couple terrifying things about this BIOS: First of all, it removes temperature protections, which is - Oh really? - Yeah, absolutely terrifying. - We can just - Be super easy to cook it. - Yeah. And then Gary will come over here, murder us. - Yeah, and for another, obviously it removes the current protection, which exists for a reason. So A, our power connector to the board is only rated for 600 watts, not a thousand minus seventy five, nine hundred and twenty five watts. And for another, the VRMs on this board are, A, not designed to have a thousand watts going through them, and B, I don't even know if they're going to be cooled by the block. 'Cause this is also not designed with a thousand watts in mind. - Ehh, it's probably fine. - It's probably fine. Before we do any of that though, we need to establish our baseline performance, so that we know if anything we're doing is even helping. This is our results for F-122. - [Alex] What is interesting is we can see that the performance cap reason is just voltage regulation. That is what's holding us back. - [Linus] Okay. - [Alex] And our maximum draw was somewhere around, mm, - [Linus] 390. - Yeah, 390 watts. That's a lot of watts. - We could do better though. That isn't the only number we need, though. There is some performance tuning that we can do, without getting super sketchy. By firing up GPU twerk, really? Oh, \"tweak\". (laughter) That makes more sense. By firing up GPU tweak three, my vision's going, we can adjust our power target, turn down, in some cases, our GPU volts, no, we just crank it. Really? It has no \"down\"? By adjusting our power target, our GP voltage, our boost clock, and maybe we'll throw a bit of a memory over-clock on it? - Sure. - We should be able to eke out a little bit more performance in a way we would actually recommend replicating at home. - Our power target's now 120, that's as high as it'll let us go. Plus 200 on the core, plus 900 on the memory. I think it'll be fine. - The hotspot is the one we're particularly going to want to keep a close eye on because that's the one that, especially with so much power running through it, is going to spike extremely quickly in the absence of adequate cooling. I mean, it seems to be still working. Yeah, just let it do a thing. I mean, we can tell that the hotspot is the hotter one. Way to go. - [Alex] Yep. It's very not happy. Yeah, we clearly do need more voltage. - Yep. - Should we just, - Send it. - [Alex] Maybe it was our core clock. We'll adjust both at the same time. - Okay, here we go. Holy crap. - Yeah, it's nearly running at three gigahertz. That's pretty fast. - Okay, what are we limited by? Voltage. - Voltage. - Okay, if we want to get more clock speed, then we're going to need more voltage. - Oh well hang on one second. Okay, well I guess that test isn't valid anymore. I was just going to see, okay. A hundred percent, hit apply. Sure. Wow, that actually worked. Now we're drawing 430 watts. - [Linus] Okay! - [Alex] And the GPU clock's higher. - [Linus] Cool! - That was easy. - Based on the scaling we're seeing here, man, we might be able to go quite a bit higher! - [Alex] Maybe, or the card will just blow up. For just taking some sliders and going like that, we went from, - We just got 12% more performance. - Yeah, and like, our minimums went up by a lot. - That's awesome. - Yeah. - Overclocking, who knew? Let's go faster! - Before we volt mod this 4090, we need to make sure that we're actually modifying the voltages and not just some number on the screen is changing. To do that, we need to be able to probe this card. Now, I don't know exactly where we can find core and memory voltages, but I think there are some headers right here and if we just solder a couple wires to those, we are good. Let's find out what these actually do. What we're really concerned about here is the core voltage. It is just at idle, so it is currently 0.885 volts. That's what we're looking for. 0.89, oh yeah, probably it. - I don't know if you've watched previous attempts of Alex and I to try and solder a graphics card, they usually don't go too well. (frustrated shouting) - [Alex] It's such a bad soldering iron! - Dude, it's on! I'm not joking! - Then why's it so crap? - These are pretty terrible. - What are you going to do with those wires? - I was thinking I was going to solder them right there. - Oh, okay. - Yeah. - All right, that's probably fine. And then, like, what are you going to use to measure that? An Asilimus? Oh no. - [Alex] Yep, no one's getting lead poisoning today. - So I'm just going to hold it there for a while. It's the small things in life you gotta like, man. Okay, I think we're done. - Sure. There you go. - [Andrew] Beautiful. - So there's hot glue on it. - Oh yeah, strain relief. It's so, it's safe. The best part is we didn't quite do it right, so to look at the voltage, you need to probe one of these guys to get ground. But there it is, (distant laughter) 0.89 volts is what we're drawing at idle. So we now know that it works pretty good. - [Linus] And you're just going to drag that all over the back of the card like that? - That's kinda what I was thinking, yeah. We'll see if we can get to any traces and short it out and kill it. - You were moving, I can hold this. - It took a while, but the EVC two is working. It's the sort of thing where like, you know when you get something off GitHub and you have to install the software and the drivers, but for the drivers to work, you need a specific version of Java, which requires visual and all of that stuff. It took me a couple hours, but it's working! - Yeah, when he told me that he needed about half an hour, I told the guys over there no less than an hour. It has now been four. - [Alex] Yes. - Oh my god. It's not even bolted to the, Alex! - [Alex] Yeah? - You've only got four screws in it. - We can add more if you want, but then we had to have to add black plate. Eh, it's fine. It's fine. - Huh, oh, the system works. Okay, wonderful. We're at 0.89. - So this right here is telling you everything that's happening with the voltage controller at the moment. - Yeah. 1.05, Yeah, yeah. One point oh-ish. How accurate is this multi meter? Do I trust this or that? - You sorta don't trust either of them. - Sick. - Basically what we're doing here, so 0.06 whatever, you can see here, like before, we are voltage limited so you can go in here via offset. - [Linus] How about 0.05? - [Alex] Yeah, sure. - Okay and are we going to see this just, whoa! - Yep, that's, - Hello! You can see the board power draw right there. Boop! - There we go. That's the sort of speed we're looking for. - Wow. - Ooh, that's a lot of power draw! - [Linus] Over three gigahertz, over 500 watts. - 81 degrees Celsius and we're still voltage regulated. Oh, oh it said power for a second there, - Oh, it did! There it is. That little tiny green blip there. - I feel like if we give it just like, the tiniest bit more voltage, power is going to be our problem. - Hear you loud and clear! Okay, how about 0.065? - [Alex] Sure. - Now let's see, is it going to get, is it even going to impact it mid run? Yeah, see this is weird. The power draw goes up but the frequency doesn't. Oh, because we are power limited now. - [Alex] Yeah. - Wow, we're just shy of 600 watts sir. Should we do a run at 600 watts and see what we end up with, then? The GPU chip alone is drawing over 500 watts. - That's a lot of power for one of those little guys. - It's like unfathomable, right? - Ope, - [Linus] Those, damn. - [Alex] Yeah, - Let's get more power. - Alright, cool. - To flash your BIOS, it's actually pretty easy. What you need is \"Envy flash\", which is a little application here. You put that in the root of your thing. - Hold on. Can we just set the card back to default before we do that? - Yes. - Yeah. And I'm going to do that over here too. Okay. Before you update any kind of firmware, be it on your motherboard or GPU, you should return your entire system to stock settings and ideally you should be on a battery backup. If, for whatever reason, the power fails in the middle of a firmware update, it might survive. - It probably won't. - [Andrew] I can see Alex over your shoulder. - I've seen things survive. - With this GPU, it's a little bit less risky because we do have two BIOSes. So if we completely bork one of them, flip her over, other one still is probably good. Before you change your BIOS, you want to just make sure that the one that's on there you have saved. So just GPU-Z, click right there, saved the file. - Even if you never planned to roll it back, if you ever needed to RMA your card back to the manufacturer, for example, you would need to return it to to its stock configuration. Not that you're RMA-ing this, once you've soldered things to it, but if you didn't do that. - Now we can have a look at our BIOS. Wow. - [Linus] Wow. - [Alex] That's, - [Linus] That's something. - [Alex] Yep. - [Linus] We're in the matrix now, boys. Oh. - Oh wait, I think I, wait, stop. Oh, maybe it's fine. Now we maybe have the ability to murder this GPU if we so want. - Now we cook. - [Alex] I think 180 is where it was happy. Okay. - Firing it up. - Oh this is scary. - [Linus] Hold on, we can do the math here. It's at 14% of its TDP and the board power is 142 watts. - Okay. - Okay. It thinks it's a thousand watt card. You know Nvidia is going to lock this down with the next gen. Man, I remember when they were cool. - We're in kind of scary territory now as far as voltage goes. - Okay. And we're at 66 degrees and 480 watts. We got a result, but it's not going to be any faster. Yeah, 1-45. - [Alex] That's an improvement. - Oh! - That's a sizeable improvement. - Really? - Yeah, we started at 1-37. - Oh, all right. - Yeah. - [Andrew] Yay. - Cool. I mean, it was a rock solid 3.03 gigahertz. Didn't move. Are we going to run out of GPU twerk slider here? - [Alex] I doubt it. - [Linus] Okay, it's at two-ten. I'm going to give her another 20. One forty average. - That's fast. - Yeah, she's fast but she's not consuming power. How do we keep the card from kicking in its voltage cap? - We're not thermally limited though, something else is the problem. - It'll probably boost a little higher, just being cooler, but I don't think that's the issue here. - No. All right, I figured out what the problem was. Before we were only setting a voltage offset. Now I've halved the offset, but increased the VO command. So that seems to have brought our voltage to where, first of all, the computer is reading a lot more accurate and also I have got some very high temperatures. I turned it down a tiny bit, but yeah, thermal protection's not a thing on this GPU anymore. It's absolutely terrifying. So I'll just give this a tiny bit more. This might be fine, it might not be fine. I don't know. Let's see, tiny bit faster? I have to watch the hotspot temperature very closely, 'cause if that starts jumping up we just need to alt F-4 and get outta here. Oh, that is fast! 31-20, drawing 540 watts, not bad. I'm shocked how well this cooler works. FPS is the same, but that's about expected. I think we're about at the point, though, where if you go faster we need more cooling. So, water cooling time. Do you want to hear the most absolutely shocking thing, Andrew? - [Andrew] Yes. - I have not quite thought through how this GP is going to go in. (rock music) For whatever reason, our ground lead, here, doesn't seem to be working so I have this in continuity mode right now. Beeps, touch it to ground, does not beep. Before we put this in there, I want this to just work and not have to worry about this lead kind of falling off and ending up somewhere bad. (beeping) Kinda like that one right there. (rock music) - All right, I think we're all good to put it in, here we go. It's kind of sketchy. Something like that. Ha. Wow, this really isn't all that sketchy, but it sure as hell looks like it. I want to make sure that all of this is working perfectly, before I turn the system on. 'Cause if there's air bubbles in here, there is currently no temperature protection on the GPU, so it will actually just kill itself, if I'm not properly running water through it. Might as well top it up. Okay, GPU hotspot 17 degrees we're good. Heck yeah. One thing that I like to do, if you hit \"Windows control shift B\", like so, it resets your video driver, which can be quite helpful when you're crashing a video card a bunch of times. - Well, I think you did a fine job. - Oh, I know. Look at the safety straps. So secure - [Linus] Genius. I always forget about the capabilities of this chiller. She's chilly. - It's very good at its job. - Unfortunately, it doesn't really need to, because what we've discovered is that this RTX 40-90 and for that matter, pretty much all of them, is not thermally limited in any way. And in fact, it's not even really current limited, is it? - Yeah, no. - We solved the problem where we accidentally were applying a voltage rather than a voltage offset. But what we discovered is that, even though we were able to get the power consumption up, - Five-eighty, I think, is as high as I saw? - It doesn't impact performance anymore. - Yeah. - Unless, of course, we were to apply dangerously high voltages, but we're trying to do this somewhat responsibly. - I don't know, I had pretty dangerous voltages there and it doesn't go faster. - I guess the conclusion is two-fold then: One, there's definitely performance to wring out of the RTX 40-90, if only Nvidia would give us the bloody controls to do it; and two, they made the right call to ship it at 450 watts. - [Alex] Yeah. - Given how close the performance is to the 600 watt configuration. - This right here is probably as fast as it'll go. I played with the memory a little bit. You can get it going like a hundred megahertz faster, but at the same time I found that the actual scores went down. So I'm guessing that it was not quite stable. - You're riding that razor's edge. - Yeah, Nvidia GPUs will pull back clocks for a couple cycles if they think they're going to crash. And so even though the number will be higher, in GPU-Z, the actual score is lower. So, we're right at the limit. - At the limit of telling you about our sponsor. - Oh, first I want to see if we can hit the limit of our power supply. - Oh God. - We could give it a tiny bit more voltage. Get it up to about 580 watts. The CPU, even though we don't have like the direct dye cooler on it, we can get a pretty easy like 400 out of thanks to this guy. That's getting pretty close to the twelve hundred, not quite, - Okay, let's see how good of a power supply Corsair makes. - I wish you could get the CPU speed. - Oh wow, we're at over 600 watts on the GPU now. - Oh, yes. What's the hotspot temperature? 73. Okay, that's fine. - I think that's not hot spot. That's not hot spot. Hot spot's 95. - 95, oh, that's hot. - Will Smith, that is hot. - [Alex] How's our CPU doing? Six gigahertz. - [Linus] Casual. No! And the RGB turned off. - Do we call it? - Editor, please cut out the awkward pause while I was thinking of that. Just use a punch-in or something. Just like I'm going to call myself to tell you about our sponsor! (phone ringing) - VideoCom. Making a sales pitch to a prospective client? Working on a project for class? Let VideoCom help you turn your presentation into an engaging and memorable experience, with a bunch of features to spruce up your project such as per slide webcam embedding, annotations and team collaboration tools, making a presentation has never been more easy or intuitive. All of your projects can be saved to VideoCom's cloud which will allow you easy access between users and ensure your files won't be lost. Check out VideoCom at the link below for free and use code Linus for 50% off any paid subscription. - If you guys enjoyed this video, you might enjoy the last time we did this in an even sketchier fashion with a shunt mod. That one drew like, over 1200 watts, didn't it? - I don't remember. I think it could, but I don't know if it did.",
    "transcript_keywords": [
        "Yeah",
        "voltage",
        "GPU",
        "power",
        "watts",
        "card",
        "bit",
        "fine",
        "pretty",
        "performance",
        "Nvidia",
        "Good",
        "BIOS",
        "tiny bit",
        "thousand watts",
        "voltages",
        "Wow",
        "thing",
        "kind",
        "fast"
    ],
    "transcript_entity_values": [
        "webcam",
        "one",
        "31-20",
        "20",
        "500",
        "40-90's",
        "STRIX",
        "One",
        "about 0.065",
        "two-fold",
        "about 580 watts",
        "Java",
        "RGB",
        "Corsair",
        "Andrew] Beautiful",
        "GPU",
        "430 watts",
        "Asilimus",
        "14%",
        "a thousand minus seventy five",
        "FPS",
        "600 watt",
        "a thousand watt",
        "bork",
        "three",
        "0.89",
        "Linus] Casual",
        "Linus",
        "half",
        "400",
        "F-4",
        "first",
        "TDP",
        "17 degrees",
        "Andrew",
        "142 watts",
        "nine hundred and twenty five watts",
        "First",
        "GPU-Z",
        "watts",
        "a hundred megahertz",
        "Six gigahertz",
        "3.03 gigahertz",
        "0.06",
        "66 degrees and",
        "30-90",
        "CPU",
        "two-ten",
        "120",
        "VideoCom",
        "MX",
        "a thousand watts",
        "50%",
        "Andrew]",
        "USBC",
        "Gary",
        "twelve hundred",
        "three gigahertz",
        "four",
        "GP",
        "1-45",
        "A hundred percent",
        "K-100",
        "about half an hour",
        "all day",
        "about 0.05",
        "Alex",
        "Boop",
        "a couple hours",
        "540 watts",
        "0.885 volts",
        "GitHub",
        "81 degrees Celsius",
        "mm",
        "two",
        "390 watts",
        "F-122",
        "second",
        "RMA",
        "Will Smith",
        "EVC",
        "1.05",
        "0.89 volts",
        "one thousand watt",
        "today",
        "NVIDIA",
        "40-90",
        "ElmorLabs",
        "95",
        "4090",
        "Thermo Flex",
        "one second",
        "Five-eighty",
        "180",
        "73",
        "Quantum Vector",
        "12%",
        "390",
        "200",
        "VO",
        "80 degrees",
        "450 watts",
        "600 watts",
        "Nvidia"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "LOC",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "PERCENT",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERCENT",
        "PRODUCT",
        "TIME",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "EVENT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG"
    ]
}