{
    "id": "vZJzgvJX-1U",
    "title": "Aukey Backlit Mechanical Gaming Keyboard Review",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2017-01-24T16:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=vZJzgvJX-1U",
    "category": "Science & Technology",
    "tags": [
        "keyboard",
        "mechanical",
        "blue switch",
        "clicky",
        "tactile",
        "illuminated",
        "backlit",
        "gaming",
        "video games",
        "USB",
        "Aukey",
        "KM-G3",
        "LED",
        "Call of Duty",
        "League of Legends",
        "review",
        "This Does Not Compute"
    ],
    "views": 4828,
    "likes": 249,
    "comments_count": 29,
    "description": "Mechanical keyboards, especially illuminated ones, can tend to be expensive. At a price of about $60, though, how well does Aukey's KM-G3 fare?  Aukey KM-G3 product page:   -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by Epidemic Sound ( Intro music by BoxCat Games (",
    "description_links": [
        "https://www.aukey.com/products/rgb-mechanical-keyboard-with-blue-switches/",
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "http://www.epidemicsound.com).",
        "http://www.box-cat.com)."
    ],
    "transcript": "Hey everyone, it's Colin. How's it goin'? Backlit mechanical keyboards are awesome to use, but they tend to be pretty expensive. This time, let's take a look at one that promises a great experience, but won't kill your wallet. [ Music - Intro ] This is the KM-G3 from Aukey, which they kindly sent me to review. It's full size at 104 keys, yet offers a slim, frameless design. It's advertised as a gaming keyboard and has a clean, sophisticated appearance. The permanently-attached USB cable is about a meter long, and the flip-out feet are large, and give the keyboard a very stable feel. The G3 offers blue stem mechanical switches, which give a much more tactile experience than the rubber membranes on most keyboards. They make an audible click when pressed, which for some people, can improve typing speed and accuracy. The downside is that they can be a bit noisy. Here, have a listen: *Keyboard Clicking Sounds* The other major selling point for this keyboard is its backlighting. There's a multi-color LED underneath every key. The keycaps are double-shot molded, so the light can shine through the lettering, though I do find the font a bit hard to read. A number of lighting patterns are available to cycle through, or you can select a solid color, and the brightness and speed of patterns is customizable as well. As a nod toward being gaming-oriented, there are a few layouts specific to games like Call of Duty and League of Legends. Activate one and keys relative to the game will illuminate. This is, in some ways, a bit of a gimmick though, as you're limited to just the few titles listed and there's no way to reprogram those layouts. While in general, the illumination works well, it is a bit cumbersome to set up. Everything about it is controlled through the keyboard itself. There's no software to install. This means you have to use key combinations to cycle through the patterns, which can get tedious. And what's more, the owner's manual is difficult to understand, so I was left with the feeling that I needed to just keep pressing different key combinations until I found the setting I wanted. Overall though, the G3 makes for a competent, though basic, mechanical keyboard. At the time I'm filming this, it's available for about $60 US on Amazon. While there are a few frustrations, like controlling the illumination, I think it still manages to hold its own. And considering there are other mechanical keyboards out there with fewer features and higher price tags, I think the Aukey KM-G3 offers solid value. I owe a big thank you to Aukey for sending me a G3 to review. I'll include a link to it down in the description. If you like the video, I'd appreciate a thumbs-up and be sure to subscribe. You can follow me on Twitter and Instagram at thisdoesnotcomp, and as always, thanks for watching.",
    "transcript_keywords": [
        "keyboard",
        "Colin",
        "Keyboard Clicking Sounds",
        "mechanical keyboards",
        "keyboards",
        "bit",
        "mechanical",
        "Backlit mechanical keyboards",
        "Aukey",
        "key",
        "Keyboard Clicking",
        "offers",
        "Hey",
        "key combinations",
        "patterns",
        "Clicking Sounds",
        "keys",
        "League of Legends",
        "Call of Duty",
        "Duty and League"
    ],
    "transcript_entity_values": [
        "USB",
        "Call of Duty and League of Legends",
        "G3",
        "Instagram",
        "Colin",
        "Twitter",
        "104",
        "Backlit",
        "Aukey",
        "one",
        "about $60 US",
        "about a meter",
        "Aukey KM-G3",
        "Amazon"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "GPE",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "FAC",
        "ORG"
    ]
}