{
    "id": "W-krqeIwtpo",
    "title": "Testing Another YouTuber's Mouse - Pulsar X2 RFP Edition",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-04-02T17:54:16Z",
    "video_url": "https://www.youtube.com/watch?v=W-krqeIwtpo",
    "category": "Science & Technology",
    "tags": [
        "RandomFrankP",
        "Gaming Mouse",
        "Pulsar",
        "X2",
        "X2 Mini"
    ],
    "views": 1726887,
    "likes": 72213,
    "comments_count": 2850,
    "description": "Visit  and use offer code LTT for 10% off  Create your build at   Mouse reviewer RandomFrankP just released a mouse. Obviously he can't test it, so instead he gets the sphincter tightening experience of watching us review it.  Discuss on the forum:   Buy a Pulsar X2 Randomfrankp Edition Gaming Mouse:  Buy a Logitech G Pro Wireless Gaming Mouse:  Buy a Razer Viper Ultimate Wireless Gaming Mouse:  Check out the Razor Viper Mini SE Wireless Gaming Mouse:  Check out the Zaunkoenig M1K Gaming Mouse:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - Intro 1:04 - Build Redux 1:16 - Unboxing & Changes for RFP Edition 3:00 - Who is Pulsar? 4:05 - Mouse Drag Race 4:53 - Sensor 5:55 - Mouse Testing 8:50 - Why is the Model O2 a problem? 9:50 - The Subjective Experience 11:20 - Squarespace 12:03 - Outro",
    "description_links": [
        "https://www.squarespace.com/LTT",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1498323-testing-another-youtubers-mouse/",
        "https://lmg.gg/nXNc8",
        "https://geni.us/UaVaZl",
        "https://geni.us/4dO0f1",
        "https://lmg.gg/qwKJV",
        "https://lmg.gg/W7sY8",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Is it okay for a YouTuber to make a product in a category that they review? I say yes, but only if it's really, really good. RandomFrankP then is taking some big risks today. If his mouse isn't great, it means one of two things. Either he sold out and agreed to slap his brand on a product he doesn't truly believe in, or he never figured out it sucks and he loses all his credibility as a mouse reviewer. Meet the Pulsar X2 RandomFrankP Edition. Due to the obvious conflict of interest, Frank can't be here to review it himself, so instead he gets the sphincter tightening experience of watching us compare it to the biggest names in the game. The good news is that it is 72 times more precise than one of these name brand competitors. But the bad news is that based on his videos we are not sure that he knew that. So did he get lucky here? And if so, how lucky? Not lucky enough to cash this sweet check from our sponsor. Psst! You like gaming? Well, the folks over at Build Redux do too, and their mission is to help you build the gaming rig of your dreams. Just pick your parts and let them take care of the rest. Check out Build Redux at the link below to learn more. We don't normally spend much time on the unboxing experience, but for a YouTuber product, we consider it absolutely critical to nail it. And although it's not exceptionally fancy, removing this top cover is pretty satisfying, mostly because of the awesome RandomFrankP design on the mouse. This looks sweet, and it better because the paint accounts for over 6% of the weight of this mouse. Don't stress though. It sounds like a lot, but with a total weight of just 56 grams, it is still one of the lightest mice on the market. He cheated a little. This is the mini version, but there's a larger one that comes in at just 59 grams for those of you who prefer a palm grip. Also inside here we find a wireless adapter. Are you kidding me, Frankie? Nowhere to store it. Boo. There's a braided USB type C to A cable. Very nice, lightweight. And a trading card. Ooh, did we get a holographic one? Do you know? - [Crew Member] I don't know. - You don't know? (gasps) Does he have holographic ones? - [Crew Member] Signed holographic. - Signed holographic one. Frankie, seriously, it's me. Well, we know how that's gonna impact the review. Kidding, kidding, kidding, kidding. Along with the upgraded paint job, Mr. FrankP has also selected different switches for his version of the X2. He went with Huano Blue Shell Pink Dot switches and a TTC Gold Encoder for the scroll wheel. Which... (mouse clicking) that's delightfully satisfying, isn't it? At least, I hope you're satisfied because the ride is over now. This is where the RandomFrankP-ness of this mouse ends. But we've gotten ahead of ourselves a little bit here. Who the heck is Pulsar? Founded in 2020, Pulsar is a Korean company with impact-able as the keyword for the brand and \"affordable innovation\" as their motto. And that's about the entirety of the useful information on their about page. What I was also able to track down though was that they've been reviewed extraordinarily well by multiple publications. But can they stand up to our lab? For comparison, we chose three wireless gaming mice in the same price band, and we're immediately impressed by how much lighter the Pulsar was. The Model O2 wireless comes in second at a relatively bloated 68 grams. And this lightness of the X2 makes it feel nearly effortless to use. Outside of products that cost two to three times as much, this is the first flyweight class mouse that I felt that doesn't make some pretty brutal compromises. It also feels like Pulsar has unnaturally low friction on the mouse pad, but that might just be the inertia kind of screwing with me. So we're gonna put it to the test. X2 Mini RandomFrankP, O2 Wireless, G Pro. Man, I use the super light day to day, this one, it's quite a bit heavier. And then Viper Ultimate. Okay. Ready? Ooh, Viper Ultimate with the win. Ooh, RandomFrankP and Glorious. And there goes the G Pro. It's worth noting that regardless of these results, all of these mice feel great gliding across a pad. Sure, the Logitech might have a tiny bit more friction than the rest, but it is still an exceptional gaming tool. All four use PTFE feet, and if you aren't satisfied, there are companies, including Pulsar actually, that sell glass feet, so your mouse, regardless of which model it is, will slide better than any of these. For the sensor, Pulsar went with the Pixart PAW 3395, Pixart's current flagship that features 26,000 CPI sensitivity 50G acceleration and motion sync. Motion sync is a new feature that synchronizes when the mouse reads the sensor with the polling rate of the mouse, in theory making movement feel more consistent. In practice though, basically every high-end gaming mouse in the last couple of years has come with a functionally flawless sensor. So unless the makers were stupid enough to try to change the behavior of the sensor and then botch it, the differences should be negligible. Speaking of that, the Glorious Model O2. Glorious calls the sensor in this mouse the BAMF 2.0, but we couldn't help noticing that it has identical specs to the PAW 3395, and also very likely is the PAW 3395 just with some custom tweaks from Glorious to help them get to their claim to 110 hours of battery life. Which would be really impressive if it didn't come at a terrible cost. To evaluate sensor performance, our labs team mounted each of our mice to a robot that's programmed to move exactly, exactly two inches while the attached PC registers each count or dot from the mouse. In theory, if we move a mouse at 800 DPI two inches, it should return 1,600 counts. This test is useful for measuring both the accuracy and the precision of each mouse, with the precision being the one that's more important since accuracy only really matters if you're switching between mice. Along with his mouse, Frank also sent along a glass mousepad, so we ran all of our results on both the glass Superglide and the LTT mousepad. Lttstore.com. The Logitech, Razer, and Frank's Pulsar all performed at what I would consider to be S-tier, returning both precision and accuracy that are good enough we can confidently say, if you're missing your flick shots, it ain't your gear, bro. Now, of the three, the Pulsar did have the highest click latency. But at 5.9 milliseconds, we still consider that good enough for A grade. What wasn't good enough was the Glorious Model O2. A 16.2-millisecond click latency simply isn't acceptable on a gaming mouse at this price, or even a gaming mouse at half this price. More concerningly, the accuracy and the precision were both by far the worst in our field. So bad that we redid all of the results on three separate mousepads to verify that, yes, the Glorious Model O2 sucks. There is a single bright spot for it though. Strangely, the precision is quite good on the glass Superglide through some quirk of the sensor. But the accuracy was still terrible, and most people don't enjoy a glass mouse pad. Now, we wanna make it clear that all of our testing on the Model O2 Wireless was done on the latest firmware and software. There was a previous version that had connectivity issues. That's all been solved, but these test results go to show that they've taken this mouse from broken to bad. To confirm that we didn't have some Glorious-specific problem with our testing, we even grabbed the original Model O, a mouse that scored very well on ratings and TechPowerUp, but we got a new problem with that one. We couldn't get the original Model O to be recognized in software on three separate computers. - Yeah, it sucks. (laughs) It sucks. - And as it turns out, we're not the only ones with the problem. Since Glorious doesn't have older versions of their software on their site, we had to risk computer herpes by using a sketchy link online in order to get it working, which it fortunately did. But unfortunately for Glorious, the original Model O annihilated the O2. Which is very awkward. So on the whole, we're just gonna hard not recommend either the Model O or the O2 until Glorious makes some serious changes. But why are we talking about Glorious right now? Ah, because the O2 Wireless happens to be the first mouse that RandomFrankP reviewed since releasing his own mouse, and while he and I came to the same conclusions... - Do I recommend this mouse? No. - Don't buy it. We don't have the same reasons for it. And this is weird to me because the safest path he could have taken with this thing, especially given the proximity to his own product launch, would've been to criticize it for its piss-poor performance and then say, \"Don't buy it.\" But he didn't seem to notice the piss-poor performance. - [RandomFrankP] And for its overall performance, I personally had no issues. I know there have been some reports out there, I guess, of like the current software for people who got like reviewed units early and stuff that was causing some like lag or stutter, but my unit felt just fine. - Which kind of makes us wonder is the excellent performance of his co-branded mouse by design or is it just a happy accident? I mean, it's possible he just saw a lot of things he really liked from Pulsar and trusted them to do a good job, which frankly, pun intended, seems to have worked out for him. And what's definitely not accidental is the subjective experience of using the X2 Mini. Everyone who has touched it here, which includes Alex, our peripheral specialist for the lab, and me, loves the feel of this thing. I mean, we can't say for sure that your experience will mirror ours, but what we can say is that all three of us come from different mice as our daily drivers. And, thanks, Alex, have very different hand sizes. This is a darn nice ergonomic design. The switches feel great. The rated 70 hours of battery life had Alex using it all week without needing to charge it once. And all of this somehow happens without an influencer tax on the very competitive $95 price. So what can I say? Outstanding job, Mr. FrankP. But, Linus, you might say, are you just shilling for your YouTuber bro? What about that extra latency and the worst performance in your movement benchmarks? My response to that is, A, I don't know him basically at all for one thing, no offense. And B, I just wanna reiterate that three of our four mice here, were S-tier. And the deciding factor should be how it feels in your hand or how it looks on your desk as opposed to the 0.03% precision difference. Now, sadly, I can't yet pass these through the screen to you for you to experience for yourself. We don't have the technology yet. But what we do have is a link to where to buy them down below and this message from our sponsor. - Squarespace, do you think making a website's hard? Well, it is. But it doesn't have to be. With Squarespace, you'll have your website up and running in a matter of hours. Squarespace has award-winning templates that'll help you make your website stand out so you can say goodbye to drab, GeoCities-inspired hellscapes and say hello to this. Ah! Pretty. Plus, if you're interested in how your website is doing, they have built-in tools to help you find out what you're doing right and what you're doing wrong. Both our Linus Media Group and LTX Expo websites were built quickly using Squarespace. And if you ever get stuck making a website, they have a 24/7 support team ready to help you out. So head to squarespace.com/ltt and you can get 10% off right now. - If you guys enjoyed this video, why don't you check out the video on the 8,000 Hertz mouse? Spoiler alert: there's a point of diminishing returns.",
    "transcript_keywords": [
        "mouse",
        "Glorious Model",
        "Pulsar",
        "Model",
        "Glorious",
        "gaming mouse",
        "original Model",
        "wireless",
        "gaming",
        "sensor",
        "mice",
        "good",
        "RandomFrankP",
        "precision",
        "performance",
        "Build Redux",
        "mouse pad",
        "feel",
        "kidding",
        "Frank Pulsar"
    ],
    "transcript_entity_values": [
        "GeoCities",
        "Model O",
        "FrankP",
        "one",
        "just 59 grams",
        "second",
        "95",
        "800 DPI two inches",
        "68 grams",
        "four",
        "the Model O2 Wireless",
        "first",
        "TechPowerUp",
        "just 56 grams",
        "0.03%",
        "Linus Media Group",
        "70 hours",
        "Hertz",
        "Frankie",
        "the G Pro",
        "X2",
        "26,000",
        "Frank",
        "the O2 Wireless",
        "PTFE",
        "two inches",
        "10%",
        "daily",
        "16.2-millisecond",
        "Pulsar",
        "110 hours",
        "3395",
        "over 6%",
        "today",
        "TTC Gold Encoder",
        "two to three",
        "Alex",
        "Pixart",
        "Lttstore.com",
        "the Glorious Model O2",
        "the Glorious Model O2",
        "LTX Expo",
        "Logitech",
        "8,000",
        "Huano Blue Shell",
        "YouTuber",
        "O2 Wireless",
        "Model O2",
        "the last couple of years",
        "1,600",
        "72",
        "Boo",
        "Superglide",
        "LTT",
        "5.9 milliseconds",
        "FrankP.",
        "YouTuber",
        "three",
        "Viper Ultimate",
        "Build Redux",
        "YouTuber",
        "RandomFrankP",
        "all three",
        "Squarespace",
        "all week",
        "USB",
        "X2",
        "Linus",
        "50",
        "Korean",
        "two",
        "Model O",
        "half",
        "G Pro",
        "Razer",
        "2020"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "DATE",
        "QUANTITY",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "NORP",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE"
    ]
}