{
    "id": "W1XRLHP9sYI",
    "title": "What does Valve WANT??",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-02-17T01:29:59Z",
    "video_url": "https://www.youtube.com/watch?v=W1XRLHP9sYI",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Valve",
        "Steam Deck",
        "Steam",
        "Valve Steam Deck",
        "SteamOS",
        "iFixit",
        "repair",
        "Steam Deck repair",
        "Steam Deck iFixit",
        "upgrade",
        "upgrade Steam Deck",
        "Steam Deck specs",
        "Steam Deck SSD"
    ],
    "views": 519047,
    "likes": 31703,
    "comments_count": 796,
    "description": "Use code TECHLINKED16 for up to 16 FREE MEALS + 3 Surprise Gifts across 6 HelloFresh boxes plus free shipping at   Thanks to HelloFresh for sponsoring this video!   LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 it's a wacky kind of day 0:11 Steam Deck + iFixit 1:02 Nintendo closes Wii U, 3DS eShop 2:03 Disney Storyliving 3:05 HelloFresh 3:44 QUICK BITS 3:50 Android apps on Windows 11 4:18 AMD beats Intel's market cap 4:52 AMD FSR on Nintendo Switch? 5:27 Microsoft locks down AltspaceVR 5:57 run Windows 11 on Android 13  FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://bit.ly/3ekb5Zj!",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/qhX5j",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- Sometimes I think of the tech news as being like a little ball of sunshine that I can hold anytime I want and... - [James] Like that baby face in the sky from \"Teletubbies.\" - In my tummy. After Valve released a repair guide for the Steam Deck gaming handheld that was very clear about telling you not to attempt repairs, the company has announced a new partnership with iFixit- - [Riley] You fix it? - We all fix it! The company that's all about repairs, so I'm already confused. The partnership will see iFixit sell authentic replacement parts for the Steam Deck for those who want to directly go against Valve's wishes. iFixit also posted a teardown of the Deck console itself on their website showcasing how to do everything Valve said not to do. Turns out the process is pretty straightforward, except for removing the L-shaped battery. If you do that, Valve will be extra upset. - [James] You're a loser! (Riley babbles) (air horn blares) - This is just really hard news for someone like me to read. I take advice at face value. - [James] That's unbelievable. - When James tells me to do something- - [James] You bootlicker. (Riley slurps) - Nintendo has announced they are closing down the eShop for the company's Wii U and 3DS consoles, making it impossible to purchase any digital games for those platforms. - [James] There were so many letters in that sentence. - The more the better. Alphabet soup. (slurps) The shutdown will occur in late March, and understandably, many retro game fans are not happy about this given that many games made for those consoles are still unavailable to buy literally anywhere else, and Nintendo has this really annoying habit of cracking down on alternative ways to source and play their games. - [James] Hey, I bought a Wii U! There's dozens of us! - Get outta here! Interestingly, Nintendo seemed to anticipate this reaction and posted a really defensive-sounding Q&A entry, before deleting it, that imagined a user asking, \"Hey, doesn't Nintendo have an obligation to preserve its classic games by continually making them available for purchase?\" To which Nintendo replies, basically: \"LOL, no, buy our other games.\" - [James] No, you can buy them. They just... You can buy 'em again for full price! - Yeah, once we remaster them and release them on the Switch... - Two! - Successor. And great news for Disney adults... David. - [James] Grown-up princesses. - Disney's building a special utopia just for you. - [James] Dude, Disney adult sounds like... (sexy music) - It's a thing. That's right: Pop Culture the Company has announced master-planned communities under the Storyliving brand which will see Disney's theme parks division creating pristine, family-friendly towns complete with Disney staff that will incorporate storytelling somehow. Like you live here. The first community, called Cotino, will be built near Palm Springs with resort-style housing complexes, villas, condos, and a grand oasis with clear turquoise waters thanks to Disney's Crystal Lagoons technology. - [James] This is so dystopian! - I know! That's what I... It's exactly dystopian, but this isn't actually the first time Disney has tried this. Celebration, Florida was built in 1996 and its buildings are now dilapidated, with leaks and mold. That was before they owned Star Wars and Marvel though. This is gonna be completely different. - [James] The people who live there will be weird. I don't trust the men. - We promise you this. Now it's time for Quick Bits, brought to you by HelloFresh, the meal delivery service that's gonna give you some extra help with ending those New Year's resolution goals. Hey, nobody's perfect, but HelloFresh creates perfectly delicious step-by-step recipes every week, including low-carb Fit & Wholesome options and veggie ones too! Each delivery's got fresh, pre-portioned ingredients and recycled content packaging so you can eat healthier and more sustainably at the same time. Get tasty meals from HelloFresh delivered right to your door by going to HelloFresh.com and using the code TECHLINKED16 for up to 16 free meals and three surprise gifts. That's HelloFresh.com, promo code TECHLINKED16, in case you forgot already. The Quick Bits are here, so now we have to do what they say. Do not make eye contact. Microsoft has released some major updates to Windows 11 with the Insider build getting new touch gestures, Start menu folders, and live captions, but even more exciting: the Consumer build now has support for Android apps via the Amazon Appstore. Amazon app store What are you for What? I can't wait to play- Absolutely nothin' Oh, I see. I can't wait to play all my Amazon Appstore games that I play on my phone, but on my PC now. I don't do that. Do you do... Does anyone... Amazon? Raise a glass to AMD because this week the company's market valuation surpassed Intel's for the first time ever. That's largely thanks to Team Red's $35 billion acquisition of Xilinx, which was recently completed, but don't sleep on Intel, who's reportedly looking to acquire Tower Semiconductor for $5.4 billion. It's a lot less, but I think how it works is whoever buys the most companies wins, right? So should I... I should get a AMD chip in my PC, cause they bought... - [James] And a GPU while you're at it. Why not? - Throw it in there. It's easy as that. If a screenshot on the internet is to be trusted, and they usually are, the recently announced game \"Nintendo Switch Sports\" may support AMD's image-enhancing FidelityFX Super Resolution technology, even though the Switch runs on a Tegra processor made by NVIDIA! (James gasps) (Riley cackles) It shouldn't be surprising, actually. AMD has been very intentional about making a lot of their tech open source, but still, if this screenshot comes true, NVIDIA would have to live with the fact that AMD made their hardware perform better. That's so embarrassing. Help when you didn't want it? - [James] What are you, a little (rubber ducky squeaks)? - Microsoft has pulled a Facebook and will be requiring users of the AltspaceVR social app, which it acquired some time ago, to log in with a Microsoft account. They're also removing all open social hubs which reportedly enabled inappropriate behavior and harassment due to the lack of moderation. Dang. It sounds like real life, where I harass James daily. - [James] Ow! - Thankfully, allowing Microsoft and Facebook to moderate all of our metaverse experiences will make us so much more safe. Thanks, guys. And an Android developer going by kdrag0n has managed to tweak the virtualization feature in the Android 13 developer beta to run both Windows 11 and Linux on a Pixel 6. And yes, he did successfully run \"Doom,\" as is tradition. - As is tradition. - Mm. Unfortunately Android 13 doesn't support nested virtualization so you can't use Windows 11's Android app support to run Android apps in Windows on an Android. - [James] Aw! - I know. Which, again, I don't know why, but... But I do know why you would come back here on Friday: more tech news. The tech news will never let you down. It will always be there for you and make you happy. (giggles) I don't know what that is.",
    "transcript_keywords": [
        "Steam Deck",
        "ball of sunshine",
        "hold anytime",
        "Disney",
        "Android",
        "Nintendo",
        "Valve",
        "Steam Deck gaming",
        "games",
        "AMD",
        "company",
        "Deck",
        "Nintendo Switch Sports",
        "Android apps",
        "Windows",
        "time",
        "Microsoft",
        "Amazon",
        "buy",
        "Amazon Appstore"
    ],
    "transcript_entity_values": [
        "iFixit- - [",
        "Windows",
        "HelloFresh.com",
        "Fit & Wholesome",
        "the Amazon Appstore",
        "three",
        "Intel",
        "Valve",
        "Riley",
        "New Year's",
        "Tower Semiconductor",
        "Switch",
        "Doom",
        "Tegra",
        "Xilinx",
        "NVIDIA",
        "iFixit",
        "$35 billion",
        "Cotino",
        "every week",
        "Amazon",
        "James] Grown",
        "Nintendo",
        "Crystal Lagoons",
        "13",
        "David",
        "up to 16",
        "Microsoft",
        "late March",
        "Disney",
        "Quick Bits",
        "Wii U",
        "Amazon Appstore",
        "Super Resolution",
        "Friday",
        "James] Ow! -",
        "Linux",
        "James] No",
        "first",
        "1996",
        "AMD",
        "Team Red's",
        "AMD",
        "Facebook",
        "Florida",
        "$5.4 billion",
        "Nintendo Switch Sports",
        "Android",
        "HelloFresh",
        "dozens",
        "The Quick Bits",
        "eShop",
        "GPU",
        "the Steam Deck",
        "this week",
        "James] Hey",
        "Windows 11's",
        "Two",
        "Steam Deck",
        "Windows 11",
        "some time ago",
        "Teletubbies",
        "Riley babbles",
        "James] Dude",
        "James",
        "Storyliving",
        "Palm Springs",
        "Disney's",
        "Nintendo",
        "Deck"
    ],
    "transcript_entity_types": [
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "EVENT",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "GPE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "GPE",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON",
        "PERSON"
    ]
}