{
    "id": "w2KbwC-s7pY",
    "title": "Why Does the M2 Mac Pro Exist?",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-06-28T20:15:56Z",
    "video_url": "https://www.youtube.com/watch?v=w2KbwC-s7pY",
    "category": "Science & Technology",
    "tags": [
        "Mac Pro",
        "Apple Silicon",
        "Apple Silicon Mac Pro",
        "M2",
        "M2 Ultra",
        "MKBHD"
    ],
    "views": 2718212,
    "likes": 82422,
    "comments_count": 3227,
    "description": "In a world where you can get the exact same performance from a computer half the price... what's the point?  MKBHD Merch:   OWC 8M2 SSD:  (Warning: mine doesn't fully work out of the box and is waiting for a MacOS update to fully fix everything)  Tech I'm using right now:   Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://eshop.macsales.com/shop/ssd/owc-accelsior-8m2",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(mellow music) (logo blooping) - So Apple's done it. They finally completed their Apple Silicon transition. They said it would take two years, it took closer to three, but now every single Mac that was running Intel processors a few short years ago is running Apple Silicon from the top to the bottom of their lineup. And the very last one to get it was this one right here: the new Apple Silicon Mac Pro. And it got it in a weird way. So let's talk about it. So there's a whole lineup of Macs and the bottom of the lineup was the MacBook Air and the Mac Mini getting M1 and then M2. Just the the base smallest version of Apple Silicon on a chip. Already a massive improvement over the Intel machines. But then the further up you go, you get the MacBook Pros with M2 Pro. This is double the M2. Then the M2 Max is again double the M2 Pro. And at the top of the lineup is the new king of the hill, most powerful chip they make, in the New Max Studio, which is called the M2 Ultra which again doubles up the M2 Max. Literally, I mean it's two M2 Maxs fused together. This chip is absurdly impressive which shouldn't be a surprise. I mean the M1 Ultra was already awesome and it's what I've been editing on for basically the past year it's been out. But M2 Ultra is actually meaningfully better at a lot of stuff than that one. It's a solid 15 to 20% faster on single-core performance which is already excellent, taking it to the highest mark of any Mac ever. And it also benchmarked 15 to 20% faster in multi-core CPU performance, again, making it the fastest Mac ever tested. It got better scores in everything across the board. Geekbench Metal scores are up by 20% in the GPU department now that it has this new 76-core GPU which is the one I'm testing. And there are even certain software optimizations that improve workflows even more than expected. So the new Media Engine is a good one where it would typically excel mainly at parallel workloads. Like that's why you'd always see 'em talking about 22 8K ProRes videos at the same time or whatever it was. But it can now also point all of its cores at a single workload for those of us doing back-to-back exports instead of parallel exports. So the export time for a sample project I built with five minute ProRes video went down from a ridiculous 1:45, all the way down to a hilariously fast 57 seconds which is something like an 80% improvement. It's amazing. M2 Ultra is truly excellent. So then the Mac Pro would be the last Mac to get the Apple Silicon upgrade. And when it finally did, look, a lot of us hardware nerds were getting really excited about maybe something like a M2 Extreme which would once again double the M2 Ultra chip by fusing two together and being just something mammoth and absurd. But it didn't. It didn't. It's actually the exact same M2 Ultra chip in both the Mac Studio and the New Mac Pro. So the natural question that this begs is why would anyone buy the New Mac Pro? Like why would anyone in their right mind spend 3000 more dollars on a machine that gives you the exact same performance from the exact same chip in a much bigger, heavier machine? Well, I'll tell you why 'cause I am one of them, one of the few, I'll warn you, but one of the few people that will actually take advantage of some unique things about this new Mac Pro. But the fact is, yeah, most people shouldn't and won't get the new Mac Pro 'cause the Mac Studio exists. So what's the reason? Well, there are some smaller details that are potentially interesting about the new Mac Pro. Like for example, okay, it's the same chip in each, but hang on a second. They're dramatically different sizes. So maybe, the Mac Pro in a much bigger chassis with three gigantic fans at the front and way more space for airflow, surely there's a slight thermal advantage to getting the Mac Pro or maybe more sustained performance over a longer time before throttling. And technically, yes, I found that to be slightly true by only like a single-digit percentage in most cases and often by a rounding error. But I did do the Cinebench 10-minute stress test back-to-back three times each on the Mac Pro and the Mac Studio. And while the Mac studio dropped a tiny bit on the second run and the Mac Pro technically increased slightly with each run suggesting it wasn't near its limit yet, it wasn't really that dramatic. Like I've seen some people get maybe closer to 8 to 10% out of their tests but it's not an enough to spend 3,000 more dollars for more performance outta this machine, put it that way. But another thing is there is more I/O on the MAC Pro technically. I mean it doesn't have the SD card slot on the front, unfortunately, which is one of the most important ones. But it does have a new card at the top here with six Thunderbolt ports and two more at the front so totaling eight, which is two more than the Mac Studio. And it also has two HDMI 2.1 ports instead of one and two ethernet ports instead of one. So technically true, yes, but also you wouldn't spend $3,000 more on the Mac Pro just for that. I think people would get dongles for one extra port. But no, the real difference, the reason the Mac Pro exists is PCI slots. Like that's really it. Like the next time you see a comment or a a tweet or something of someone going, \"Why does the Mac Pro even exist when you can get the same computer in a Mac Studio?\" is because this one has PCI slots. That's the real reason. The Mac Pro has six open PCI expansion slots that the Mac Studio does not have, five of them, PCI Gen 4, the last one, a compatibility slot. It's kind of funny how empty it looks when you get it. Like you open this computer up and the entire thing is just air. (chuckles) The M2 Ultra is just under this cooler at the top, the CPU, GPU, shared memory, the Media Engine, Neural Engine, everything is just under there. And then there's just an expanse of room for all these PCI slots. And these PCI slots aren't even for video cards or GPUs at all actually, because as we know the GPU, which has up to 192 gigs of shared memory, is built into the Apple Silicon chip. So really all we're getting the PCI slots for is expansion slots, the pure dedicated expansion slots that a lot of pros in certain industries use a lot. Sound cards, I/O cards, storage cards, networking cards, that's it. So yeah, it is really specific and it will sound ridiculous to most people that it literally doesn't support video cards. Like you could pull a crazy AMD Radeon card out of the old Mac Pro right now and put it into this thing and basically nothing would happen. But also at the same time, most of the buyers of these Mac Pros are, you know, production studios, post houses, music studios, things like that. Those people already had desktops with PCI slots and they literally could not make a Mac work unless they made one with PCI slots. So that's who Mac Pro is for. It really is too bad though that technically this Mac Pro will be less versatile than the old one because there are people who would want to throw powerful GPU cores at certain applications whether it's After Effects or some 3D-modeling stuff, or Premiere even, that just can't do that with this one. It also doesn't work with, or apparently even need, the old Afterburner cards. So I don't know if you remember, the Afterburner cards in the old Mac Pro were basically these dedicated cards, a $2,000 video accelerator card, but apparently the M2 Ultra has enough power that it's the equivalent of like seven Afterburner cards. So that right there is the real power of Apple Silicon if you're shooting ProRes. But the more I think about it, just so much of this Pro machine stuff is specific to workflows and it's very difficult to build one computer with no expansion or upgradability or modularity at all that works with everyone's workflows. So there did need to exist a Mac that could accommodate some more interesting workflows. But like, I don't shoot ProRes, I shoot R3D, so I'm not gonna need the exact machine that's built super well for ProRes. For me, it's actually storage. Right here I'm holding OWC'S 8M2 PCI SSD. This is basically a PCI expansion card with a bunch of NVMe SSDs on it. So the max storage you can get built-into the Mac Pro is 8 terabytes. And it's pretty fast. It's 6, 7,000 megabytes per second read/write. Cool. But you can max out one of these cards at 64 terabytes and it will read/write at 25,000 megabytes per second, which is absurd. So that's a totally different level. This is what I'm gonna dump footage on. This is what I'm gonna back up to. This is going to replace my current external Thunderbolt backup which is where I was keeping all my old footage. It was sitting next to the Mac Studio plugged in and I'll still have plenty of room left over to work on and edit multiple video projects off of it at the same time. It's gonna be awesome for what I do, and I only need one, but also I fully acknowledge, and you should all realize, that most people don't need those specialized SSDs. That's why it looks crazy that this Mac Pro exists just on the website next to all the rest of the Macs. But most people should get this one. Mac Studio was kind of a revelation for Apple. It's offering their top-of-the-lineup performance for way less than the old top of the lineup. And that's why most people should end up getting that one. I do have one last thing though. I have a theory. If I know anything about Apple, it's that you can sort of predict the future pretty well based on the past. And this Mac Pro is a pretty classic lazy refresh from Apple, pretty similar to what they've already done. Like look at the MacBook Air. When they first went from the last Intel MacBook Air to the first Apple Silicon MacBook Air. They reused the exact same design and just moved the new chip on the inside for all the performance gains. Then the second generation of it got the redesign. Same thing with the MacBook Pro, right? They took the MacBook Pro with the Touch Bar and just reused the same design, new chip, and then the next generation got a redesign. So now this Mac Pro has just done the same first half of that transformation. It's the same exact chassis, more or less, as the Intel Mac Pro, but I can expect the next generation, now, I'm already thinking about the M3, and that's probably kind of unhealthy, but that's where my mind goes. That's just my theory. So anyway, now you know why the Mac Pro exists. Now you know why I'll have one on my desk. And I'll also leave you with this: there was no other place to put it in the review but I did realize that this Mac Pro does something kind of weird when you take the top halfway off when it's still plugged in. The old one didn't do it. So I'm just gonna leave you to it. Thanks for watching. Catch you guys to the next one. Peace. (Mac fans whir loudly) (mellow music)",
    "transcript_keywords": [
        "Mac Pro",
        "Mac",
        "Mac Pro exists",
        "Mac Studio",
        "Silicon Mac Pro",
        "Pro",
        "Mac Pro technically",
        "Intel Mac Pro",
        "Apple Silicon Mac",
        "Apple Silicon",
        "Mac Pros",
        "PCI slots",
        "Apple",
        "Mac Studio exists",
        "PCI",
        "Silicon Mac",
        "Studio",
        "Pro exists",
        "Mac Studio plugged",
        "Silicon"
    ],
    "transcript_entity_values": [
        "the MacBook Pros",
        "Apple",
        "the MacBook Pro",
        "this Mac Pro",
        "7,000 megabytes",
        "the M2 Pro",
        "2,000",
        "64 terabytes",
        "ProRes",
        "the Mac Studio",
        "Afterburner",
        "OWC",
        "first",
        "3,000 more dollars",
        "PCI",
        "the MacBook Pro",
        "57 seconds",
        "25,000 megabytes",
        "the Mac Pro",
        "76",
        "20%",
        "M1",
        "Cinebench",
        "M2",
        "the M2 Ultra",
        "one",
        "seven",
        "The M2 Ultra",
        "the same first half",
        "the MacBook Air",
        "Apple Silicon MacBook Air",
        "2.1",
        "the MacBook Air",
        "two years",
        "80%",
        "10-minute",
        "Apple Silicon",
        "two",
        "the Media Engine",
        "Premiere",
        "Mac Pro 'cause",
        "the MAC Pro",
        "three",
        "Macs",
        "The Mac Pro",
        "3000 more dollars",
        "the Mac Mini",
        "8 to 10%",
        "a few short years ago",
        "Mac",
        "the Mac Pro",
        "Thunderbolt",
        "eight",
        "Intel",
        "Geekbench Metal",
        "K ProRes",
        "Mac Studio",
        "15 to 20%",
        "SD",
        "Neural Engine",
        "192",
        "GPU",
        "the past year",
        "second",
        "Mac Pro",
        "Macs",
        "five minute",
        "the Touch Bar",
        "M2",
        "3,000",
        "PCI Gen 4",
        "8M2",
        "the New Max Studio",
        "Thunderbolt",
        "M3",
        "Media Engine",
        "the New Mac Pro",
        "five",
        "MacBook Air",
        "8 terabytes",
        "this Mac Pro",
        "Apple Silicon Mac Pro",
        "max",
        "AMD Radeon",
        "Mac",
        "six",
        "CPU",
        "6",
        "the M1 Ultra"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "LAW",
        "QUANTITY",
        "EVENT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "TIME",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERCENT",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "LAW",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "FAC",
        "PERCENT",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT"
    ]
}