{
    "id": "w3fKC1ZqnPE",
    "title": "I’m Switching to...",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2018-12-25T04:25:00Z",
    "video_url": "https://www.youtube.com/watch?v=w3fKC1ZqnPE",
    "category": "Science & Technology",
    "tags": [
        "Office Tour",
        "Setup",
        "TLD",
        "jonathan morrison",
        "Jellyfish",
        "LumaForge",
        "Jellyfish LumaForge",
        "Linus",
        "LinusTechTips",
        "Linus Server Upgrade",
        "Gaming",
        "Computer",
        "Apple",
        "Final Cut Pro X",
        "FCPX",
        "Final Cut Pro Editing",
        "Final Cut Pro X Tips",
        "How to Edit video",
        "Video Server",
        "Best Hard Drive",
        "Desk Tour",
        "Dream Desk",
        "tldtoday"
    ],
    "views": 485356,
    "likes": 8652,
    "comments_count": 764,
    "description": "The BIGGEST Office Setup Upgrade Ever! 120TB to be exact. 2018 Dream Office Tour!  Jellyfish by LumaForge:  How it works:   I edited a Dave2D video on iPad Pro!  How I edit videos backwards:   This is the new 2018 MacBook Air!   Which has the best smartphone camera?   The Definitive iPhone XR Review:  iPhone XR Unboxing & Impressions!:   TLD Behind the Scenes!  Mobile users:   Music via Musicbed:   My Audio Setup & Gear:   Instagram:",
    "description_links": [
        "https://youtu.be/ScTGvWhXwCw",
        "https://www.apple.com/us_smb_78313/shop/product/HM4P2LL/A/lumaforge-120tb-jellyfish-tower-4k-shared-storage-solution",
        "https://lumaforge.com/jellyfish",
        "https://youtu.be/QiPRnPXOvjc",
        "https://youtu.be/KxEVNs4SfoU",
        "https://youtu.be/ZUbo3q0f2t0",
        "https://youtu.be/oF5vWKfcaow",
        "https://youtu.be/i0JV95H1TDM",
        "https://youtu.be/Bat05NtQ4y8",
        "http://bit.ly/TLDBreakdown",
        "https://www.youtube.com/channel/UCDlQwv99CovKafGvxyaiNDA/join",
        "http://share.mscbd.fm/tldtoday",
        "https://youtu.be/v9hu-Avj2oE?list=PLq...",
        "http://www.instagram.com/tldtoday"
    ],
    "transcript": "- [John] (claps) Our blackboard's still cool. Here, guys, Jonathan here. Not too long ago did an office tour which debuted the shoe wall, but since then, there's been a couple of key upgrades. Specifically, one that might be the biggest upgrade ever. This is the Jellyfish by LumaForge. (upbeat electronic music) So hopefully, over the past couple of months, you've noticed a couple things, not only the increase in output of videos, but also the increase in quality of videos, and the only way that happens is by building an awesome team. So by now, some of you have probably made the Kevin Kenson connection to the point where some people think I'm stealing his set, and in actuality, it's actually part of one bigger project, Sun Squared Media, which branches out into TLD, my dumb face, and then Kevin Kenson, which is led by Matt, a.k.a. Matt's Macintosh, Rich Hype Beast Ho, and Mr. Andrew Espatman. And then we have finally started to build out the TLD team, instead of me being dumb and obsessive, and the first piece of that puzzle is Mr. JD Tech, and then roundin' things out, we are blessed with Mr. Fresh, a.k.a. Chill, a.k.a. Courtney, and young Stevie. Kinda float in between Kevin Kenson and TLD, and add their sauce to everything. Now recently with some of the bigger TLD projects, the iPhone reviews, the iPad Pro review, which should release sometime with air power, that is currently sitting around eight terabytes of footage. So my storage life was in complete chaos. I have a giant Pegasus drive, which is like 16 terabytes. I have 50 billion Samsung external SSDs. I even tried moving that entire iPad Pro review to an external LaCie drive that was like eight terabytes in RAID. But it was still slow, it was like pulling teeth, so everything was just like, out of control. Enter the Jellyfish by LumaForge, which has completely changed the game. This is packing 120 terabytes of storage. Now because of the RAID setup, 80 of that is usable. But the beauty is, is you have one blazing fast unit that connects to all of our computers through ten gig ethernet. In this case we have five iMac Pros, one 2018 Mac Mini, and the idea of not worrying about storage or messing with drives or transferring footage from computer to computer is so freaking awesome. So, it's about to get a little meta for a second. I'm gonna show off a couple things. One, it's the first time setting up the Jellyfish on this Mac Mini. And two, the idea is that we just shot a Kevin Kenson video, so I'm gonna import, organize, set up a Final Cut library, and then in a minute Matt can open it up on his iMac and begin the chop. So, yeah, that Linus server 5000 pro junior is cool. The problem is though, you need a bunch of Linus's and Terra's running around to operate it, and the idea here is that even though, yeah, it does work with Final Cut Pro X, Adobe Premiere, Resolve, to me it's kinda like the Final Cut of shared storage where, I've never set this up before on this Mac Mini. I'm gonna go to auto setup. Let it do its thing. Seconds later I'm gonna just pop in the password. And in a second we should see everything, which we do. So, prior to this we have two locations set up. One for TLD and one for Kevin Kenson's. So, with the Mac Mini, the idea behind this is supposed to be kinda like, the input organize station. So I'm actually going to mount both of these. And you have an option here, you can choose to just mount them every time, or you can set them up to mount every time, and we're gonna select auto. So with this every time you turn the computer off or restart it, these will auto mount every time, which is awesome. So for this particular project, we're gonna head over to the Kevin Kenson share. This is his predictions on the future of gaming. Head over to the projects folder. December 2018. Create a folder. 2019 gaming predictions. I'm going to first create an A-roll folder. (keyboard clicks) Gaming predictions, A-roll. I'm gonna hop over to this view just to make things a little easier. And there are better, and I guess, more secure ways we can do this in the future. For now, we're getting better every step of the way. Just by copying this way, so I'm gonna copy and paste that. And you can see, I mean, that is a crap load of footage that is copying pretty damn fast. And the idea that we're not only storing files and projects off one location, we are actively editing on multiple computers, which is bananas. So the A-roll footage is done. I'm gonna hop in and transfer the audio. Today is the 24th. Christmas Eve! So from there we're gonna launch open Final Cut Pro. And I'm gonna show you guys how we would actually set up an actual project in library to then begin the edit. So what I'm gonna do it head over to new library. We're going to look for that Kevin Kenson Jellyfish share. Jellyfish, Kevin Kenson, projects, December 2018. Gaming predictions. (keyboard clicks) So that is a library. And recently what we've found works the best is having each video project as a library. That way if someone wants to open it up on that computer, or this computer, we're not running into each other or stepping on toes. So for here go to rename this event. So from there, there's a couple things you wanna do as far as modifying your library. So that's actually, if you hop over to the top here. Go over to the modify settings tab and storage locations. We want to do two things. One, we're gonna change the media folder and create a new one in that folder where we organized everything. So we're gonna find that Kevin share. Projects. Gaming predictions. And we're going to make a folder called 2019 gaming predictions. I can't spell. Predictions. Uh, media. Next from there, we want to actually create a cache folder as well. Now, you don't have to do this part, but if we're going, like, the full organized route, this is gonna be the ideal way to do things. So we're gonna take one step back. New folder. 2019 gaming predictions. Cache. And then we're gonna change the motion content to in library. You can leave backups the same. And from there, we're good to import. Now there is one important thing you wanna do here. And that's to leave the files in place, because otherwise it's gonna copy it and duplicate. You're just not gonna wanna waste that much storage. In this case, because I already created that A-roll folder, I want to leave this key word marker checked here from folders. And that's gonna automatically create a keyword collection and keep things nice and organized. So up here we already have that Kevin Kenson share. We're gonna hop over to projects. Gaming predictions. Give me a little more space. We have the A-roll. And I'm gonna import the actual entire folder, because again, it's gonna create that keyword collection and keep things nice and tidy. Import selected. And you should see it's a really, really quick process because we're not copying anything over to the drive. It's already there in place. We're just kinda referencing things. So that's all done. I'm gonna go and I always drag this all the way here just because I like seeing everything in place. If I'm gonna be an extra nice guy, I'll actually sync the files for Matt, so he can just open them up on his iMac and start chopping right away. So we're gonna give this a name. Gaming predictions. We're gonna go to custom settings. We're gonna make this a 4k video. Kevin is not in two to one, so we're gonna leave it at 3840 x 2160. Okay. So first up, we're gonna actually sync these together, because the camera we shot on here does not have in camera audio. We're gonna do it the old fashioned way, and use the clap plus the waveforms. So in this case, I'm gonna actually have that turned off for audio synchronization. Look at there, eat it, drop it in the timeline. I'm gonna go to find Kev's clap point. Or actually it was Matt clapping in this one. Alright, so, marker one. Marker two. Drag these over. So we got those synchronized. - [Kevin] 2018 is quickly coming to a close, and while we had a lot of awesome games come out, on the hardware side things were... - [John] Alright, I'm gonna go one step above and beyond. I'm gonna be the double nice guy and start this color grade for Matt and see if that opens up. There's not a lot we're gonna do here. I'm gonna pull out a little bit of green. And there's actually a video that I did with Patrick over on the Lumaforge channel that kinda talks about the backwards way I edit and why I do that. So make sure you guys check that out. But we're not gonna do a whole lot. I'm gonna pull some green out, because we tend to have a lot of green things. The plants, the trees that come out. Everything in life is a balance, so it naturally adds a little bit of green. I'm gonna then add a little bit of warmth, in the midtones, which is skin. Cool off the shadows just a little bit. Not that much. And then from there I'm gonna go ahead and do what I kinda call like the V saturation, where I'm gonna pull it up on both the shadows and the highlights and then crank it down in the midtones because that's where the, kinda like the skin tones live. And this way, it's not gonna be like overbearing. That's looking pretty healthy. I'm gonna like, pull the highlights down a little bit. On the exposure, that's looking clean. Maybe I'll pop the red on his beautiful Christmas sweater a little bit. Bring that up. And overall I think that's looking pretty good. Maybe, you know, if you wanna be artsy, you can go throw in like a color curves, and kinda give it a little bit of like that, that luddy look. That's, that's too much. That's clean. I feel like that's good. So, there we go. Before. After. Before. After. - [Kevin] But if you look at the rise in of what's coming in 2019 and a little beyond that, there is a lot of stuff going on. - [John] Alright, so if I find this first cut for Kev. Because we were there we know this is the last. We got this like, beautiful smile. We'll figure a way to throw that in somewhere. - [Kevin] So we're gonna take a look at what hard news we have, what rumors have been circulating, and just what kind of theories people have about what these big three companies have in mind for the future of gaming. - [John] Sweet cut. Now the idea here is I'm gonna close this up and Matt should just be able to open it up on his iMac and finish the rest. - [Matt] Alright, so we're just gonna open this up. Projects folder. Gaming predictions. Hopefully this is where the magic happens. And uh, actually it's already in here. - It kept my grade. - [Matt] So, thanks to John my footage is already organized and I don't need to figure out the color grade. This shot turned out great. - [Kevin] So we're gonna take a look at what hard news we have, what rumors have been circulating, and just what kind of theories people have about what these big three companies have in mind for the future of gaming. - Just, it's cool we don't have to freaking pass t5 drive. - [Matt] No, yeah, I mean that, that alone is great. - What did the old process used to look like? - [Matt] Oh, it was a mess, so John would start working on a project, it would be on a drive, then he'd pass the drive to someone, then that person would lose the drive, then we'd restart the project, or there'd be conflicting versions of stuff out there. Yeah, it was a disaster. - [John] So with the work flow like that and the team we've started to build it has already paid off immensely. There have already been instances where I start a project on my iMac Pro, Courtney then opens it up on his iMac, does the basecut, I open it back up on my iMac Pro to finish it off, and the entire workflow is kind of amazing. The idea of being able to work on a video and then have JD work on a second video. Having Courtney and Stevie working on a third video, and then meanwhile the Kevin Kenson operation running completely independently rich on one video there, Matt on another video there.. You're talking like five videos being edited at the exact same time off one device. Which is like, mindblowing! Again though, what it comes down to for me is the convenience. I don't wanna tweak things, I don't wanna troubleshoot things. That's why I called it the Final Cut Pro x of shared storage. I just wanna make videos, like everyone else here does as well. So, hopefully you guys enjoyed the video. If you did, and you are feeling like being awesome make sure you guys go Linus Server Pro 5000 Jr. on that like button. If you guys wanna learn more about the Jellyfish, I'll drop a link down below as well. Thank you guys for watching, and I will catch you guys later. - I wake up, get views, and I make f***ing awesome Kevin videos. Had to go to Sprouts. Get that coconut milk. That's a little close there, John. Was that good?",
    "transcript_keywords": [
        "Kevin Kenson",
        "Final Cut Pro",
        "Kevin",
        "Kevin Kenson Jellyfish",
        "Kevin Kenson share",
        "gaming predictions",
        "Kenson",
        "Kevin Kenson video",
        "Pro",
        "Final Cut",
        "things",
        "Cut Pro",
        "Mac Mini",
        "gaming",
        "folder",
        "Matt",
        "Kind",
        "video",
        "predictions",
        "Cut"
    ],
    "transcript_entity_values": [
        "16 terabytes",
        "LaCie",
        "two",
        "ten",
        "the past couple of months",
        "Sun Squared Media",
        "Stevie",
        "iPhone",
        "this Mac Mini",
        "Final Cut",
        "24th",
        "4k",
        "2160",
        "Today",
        "Linus Server Pro 5000 Jr.",
        "One",
        "Jellyfish",
        "five",
        "iMac Pros",
        "TLD",
        "the Mac Mini",
        "luddy",
        "Linus",
        "Pegasus",
        "Matt",
        "iMac Pro",
        "JD",
        "John",
        "December 2018",
        "50 billion",
        "Fresh",
        "John] Sweet",
        "2019",
        "Rich Hype Beast Ho",
        "Patrick",
        "Final Cut Pro X",
        "Kevin Kenson Jellyfish",
        "5000",
        "Seconds",
        "Kev",
        "iMac",
        "the Final Cut",
        "JD Tech",
        "iPad Pro",
        "Andrew Espatman",
        "second",
        "three",
        "first",
        "Chill",
        "120 terabytes",
        "Kevin Kenson's",
        "Kevin",
        "one",
        "John] Alright",
        "Courtney",
        "Mac Mini",
        "Terra",
        "Kevin] 2018",
        "Samsung",
        "Lumaforge",
        "Christmas",
        "third",
        "Final Cut Pro",
        "John]",
        "LumaForge",
        "Kevin Kenson",
        "Macintosh",
        "80",
        "Adobe Premiere",
        "Resolve",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "FAC",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "EVENT",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORDINAL",
        "FAC",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON"
    ]
}