{
    "id": "W76JXaXx62w",
    "title": "WTF is a Jumping Sumo?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2015-08-03T19:02:01Z",
    "video_url": "https://www.youtube.com/watch?v=W76JXaXx62w",
    "category": "Science & Technology",
    "tags": [
        "jumping sumo",
        "jumping",
        "sumo",
        "minidrone",
        "parrot minidrone",
        "parrot",
        "mini drone",
        "drone",
        "jumping sumo unboxing",
        "jumping sumo review",
        "unboxing",
        "review",
        "tech",
        "technology",
        "parrot jumping sumo",
        "parrot jumping",
        "parrot minidrone jumping",
        "rolling spider",
        "minidrone jumping sumo",
        "parrot minidrones",
        "minidrone jumping",
        "parrot rolling spider",
        "rolling",
        "parrot rolling",
        "rolling spider jumping",
        "minidrones",
        "spider jumping sumo",
        "jumping sumo minidrone",
        "sumo minidrone",
        "sumo mini drone",
        "iphone",
        "android"
    ],
    "views": 2002100,
    "likes": 48263,
    "comments_count": 1781,
    "description": "Parrot Jumping Sumo -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/1UCayky",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up, guys? Lu here back with another video. And today we're checking out the \"Jumping Sumo\" which immediately wins for the best name of any product ever featured here on Unbox Therapy \"Jumping Sumo\" By the way, I'm roasting over here. This is an unusual drone because.. it doesn't fly. There's no fast spinning propellers. No, it jumps instead. I guess that could be dangerous in its own right, it jumps pretty aggressively it has a camera on the front and it rolls, it rolls around. It does these quick spins, what it has that the last pair of mini drone doesn't have is a live video feed on your device so you can see where it's going even when you're not where it is. Indoor-Outdoor, seven kilometers an hour/4.5 miles per hour. It can can jump up to 80 centimeters or 31 inches, way better battery life than those other mini drone I really wish these types of devices had that as as like a minimum. Of course, you get extra batteries We have batteries. Smartphone control just like the other mini drone but much different as I said you can get a better look at how it operates giant spring in there, adjustable wheels, stickers to make it look more aggressive than it already is. It's really nimble So, open it up. Here are those stickers I talked to That's stuck to the top there. Look I mean that's just I like the look of it. Look at it, harmless USB cable to charge it up. Obviously, micro USB these are some kind of replacement part. I guess this is like a pivot point. That's sort of where he jumps off of. It's a little pad there, anyway they give you a couple extras, I guess maybe that can wear out. Yeah, okay. Battery is on. Cool red eye balls, lights actually and the camera lens is here as well. Micro USB port for charging, power button on the top. Oh oh, hello there. All right let me get the app going. Whooo (surprised that it moves) *frozen* R2D2 style. Should start trying to connect right away from the app. Is this? Launch the app. Oh that connects really fast, look can you guys see that right there like he's looking at me right now. You can see we have some various controls here. Is this how you gonna drive it. Ooh Yes smooth and I may can. Ooh WOOW! Just landed that. He just Oh yeah. Hands down I like this guy what're we gonna do. Oh Oh Boom! You can do 90 degrees 180, now he sees me, now he sees you and me and you. It's all pretty quick We have a high jump, and we have a long jump, a quick no look, upside down, I guess a somersault, half a somersault. He's into yoga you know, now he can drive upside down. (drops it again) (and again) There's an animations tab you have spin, tap, slow, shake, metronome, undulation and a spring jump. Let's take it slow at first Oh my. Watch it. *whale call* What's that tap gonna do? Oh it's just a little He twerks, that's the the miley cyrus right here. Ok we got one more what. Oh! (and again) Okay, all right we got one more which is the spin jump now This could go well, this could go terribly wrong. Here we go. (and again) Yup, figured that would happen We're going to jump onto the table folks, right here. ALL DAY! You saw it. and now is it the jumping sumo or the pilot? Oh Look at him. See? Just perfect This drone is a lot of fun. Bang for your buck this guy bangs your buck. What're you guys laughing at? Oh look the he can be robot, insect or monster for his sound effects. All right so you can record video on this, you can take photos which will go straight to your to your phone. To record video also which is a hell of a lot cooler but here's the but, apparently you need a micro USB key. That's the only way to get this thing to record video. Oh yeah. All day.. so there you have it the \"Jumping Sumo\" It's around a hundred and forty bucks and as you can tell it's a lot of fun. Maybe you want to bug your siblings, follow him around jump onto them, you're probably not supposed to do that, lots of fun and much better battery life than the flying counterpart, the rolling spider as it was called. It's a pretty cool package and I'm not sure I'm not aware of anything else out there, that's quite like it. So, if you want to learn more, I'll have the links down below and other than that I hope you enjoyed this video if you did make sure to leave it a thumbs up. SUSCRIBE! If you're not a subscriber yet, leave your questions down in the comments. Hit me up on twitter if you want to. And thanks as always for watching I'll catch on the next episode. Later guys. ALL DAY! You saw it!!!",
    "transcript_keywords": [
        "Jumping Sumo",
        "jump",
        "micro USB",
        "Unbox Therapy",
        "USB",
        "video",
        "drone",
        "mini drone",
        "Jumping",
        "Sumo",
        "guess",
        "guys",
        "record video",
        "jumps",
        "mini",
        "lot",
        "Yeah",
        "battery",
        "micro",
        "app"
    ],
    "transcript_entity_values": [
        "miley",
        "SUSCRIBE",
        "Lu",
        "the \"Jumping Sumo",
        "today",
        "USB",
        "Micro USB",
        "90 degrees 180",
        "micro USB",
        "seven kilometers",
        "80 centimeters",
        "the \"Jumping Sumo",
        "around a hundred and forty bucks",
        "Jumping Sumo",
        "31 inches",
        "half",
        "Bang",
        "an hour/4.5 miles per hour",
        "one"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "EVENT",
        "CARDINAL",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL"
    ]
}