{
    "id": "W7OAJiRKbaQ",
    "title": "Vintage AppleCD 300 Setup (with Malfunctioning PowerBook) - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2018-12-18T21:07:46Z",
    "video_url": "https://www.youtube.com/watch?v=W7OAJiRKbaQ",
    "category": "Science & Technology",
    "tags": [
        "Vintage AppleCD 300 Setup (with Malfunctioning PowerBook) - Krazy Ken's Tech Misadventures",
        "AppleCD 300",
        "SCSI",
        "Vintage Apple Computer",
        "Vintage Mac",
        "Macintosh",
        "PowerBook",
        "CD-ROM",
        "Mac OS",
        "Mac",
        "Macintosh IIci",
        "QuickTime",
        "eBay",
        "Computer",
        "Tech",
        "Old Mac",
        "Old Computer",
        "PowerBook 5300cs",
        "Krazy Ken's Tech Misadventures",
        "KKTM",
        "Krazy Ken",
        "Funny",
        "Humor",
        "Comedy"
    ],
    "views": 37997,
    "likes": 901,
    "comments_count": 166,
    "description": "Krazy Ken bought an AppleCD 300 from eBay. Will it work? Was there a CD left inside? What treasures await this poor sap? Found out today.  Support the show and get in the credits   Want more videos like this?   Subscribe for more tech videos!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures #80 - Vintage AppleCD 300 Setup (with Malfunctioning PowerBook)  Krazy Ken is now on Patreon! Pledge now to help support the show and get an opportunity to be in the show's credits!   Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?   Amazon links are powered by the Amazon Associates Program.  #KrazyKen",
    "description_links": [
        "http://patreon.com/krazyken",
        "http://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://patreon.com/krazyken",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "[Krazy Ken] - Oh, look at that rendering. Oh, we're gonna be here all day. We should probably quit this before we die. Now, here's the fun part. How do we get this to work with this? Oh man, all I wanted to do was hook up the CD 300. Doesn't let me shut down. It won't let me shut down. (beeping) (upbeat theme music) Hey guys, how you all doing? Really? That's just great. You know what? I'm doing pretty great today too because my AppleCD 300 is here. I wanted to use it with that IIci in that other episode, but I couldn't. However, I now have the correct CN50 SCSI cable so I can hopefully daisy chain it to that other SCSI drive and use it with the Mac IIci in a future video. However, today I would like to test this with the cable it came with. This isn't exactly the cable that came with it, but it's the same type of SCSI interface. The smaller one that is more suitable for laptops. So I have a 5300cs here. And it's kinda wonky. It turns on right away when I plug it in. You don't even have to press the power button. We're in the future. Let's see, where's the power port? Oh gosh. There, plug it in and it just turns on. No effort required. So, I wanna let that boot up cause it takes a little bit. This is a caddy loading CD-ROM drive, and I have our test CD of Premiere 1.0 from that original Premiere episode quite a way back. And I would like to see if I can get CDs working on here with the external drive. So, lets give this thing some power. Plug it in, plug it in I have never used this before. This'll be the first time. It could explode. SCSI with the satisfying click we're about to experience. You know I just... Ah, shit. Hang on. I made a boo boo. I'm guessing I should not hot plug this thing. So I'm gonna have to wait for this computer to boot up and then I'm gonna have to just shut it right back down. Where's my screen? But the hard drive is going at it. I'm just gonna... Ah, shit. Can't even shut it down from there. All right, we're just kinda stuck. What the hell, man? What's going on with this PowerBook? It's like not showing anything. Yeah, it's not even letting me adjust display settings. (computer dings) Doesn't let me shut down. It won't let me shut down. I guess I gotta pull the power. (computer dings) Hang on. Well, I'd rather pull the power while the hard drive isn't doing anything. Nothing personal. Plug in the SCSI. Wow, this is a tight cable. Shit. OKay, so that itty bitty SCSI cable was just a little too tight so I did a switcheroo and the slack is now better. So, power on. We got a light. Can we eject from here? Oh, hey! Look at that! Whoa hang on. What the hell? Macintosh Performa CD. System software and other programs for the 5260 CD. Dude, did the guy I bought this from like accidentally leave a CD in there, or did he include it just because? That's awesome! We have System Software 7.5.3 on here. It's specifically for the 5260 CD, the Performa. But I'm guessing we can maybe make this work with other computers. But all right. Well I'll add that to my collection of system software. But yeah, this is a caddy loading disc drive. So we kinda pinch the front here and just lift it up, take the CD out. Take the CD out. Son of a... It's hard to do this vertically. There we go. So yeah, there's our caddy. I now have two of these. Well, that's awesome. So, yeah I guess we'll just put the included CD in there, close up the caddy, and then kinda like a VHS tape, this side faces up, you put it inside. Look at that. Call me new school, but I've never used a caddy loading CD-ROM drive before. That's actually kinda cool. Okay now let's boot up the 5300cs, which was refusing to boot up. Hello, I hope you work. (computer dings) Okay. Hope this thing works. It was seriously working like a couple weeks ago. Oh man, all I wanted to do was hook up the CD 300 but the curse just couldn't let me have my fun. We're now having a case of green light coma, or light coma or whatever they call that but yeah, it is actually an issue I've had it with this computer before and I remember looking it up. Yeah, the power light just stays on but the computer (keyboard clicking) doesn't actually turn on. So I believe the way to fix this is to reset the PMU, the Power Management Unit I think it's called. So all I was trying to do was reset the PRAM to maybe get the display thing to change and we got green light coma so lets see here. (computer dings) There you go. On this particular model, it's just a switch on the back. I believe that is the PMU reset. Okay, it's booting back up. Hopefully now it works. Take 5,003. Yeah, I think our display is dying here. I don't know if you can see all that flickering. It says welcome to Macintosh. It's trying to do something. You know a couple weeks ago my... Well this particular display did kind of freak out a bit. It went black and it had like some orange stripes on it, but I rebooted the computer and it was fine, but I guess now that it sat for a couple weeks it's just malfunctioning. Oh yeah. Oh, hang on. We kind of have it. There you go. We just had to jiggle it a little bit. And now it looks like it's frozen. I don't hear the hard drive doing anything. (sighs) All right reboot. (computer dings) Okay hopefully it now works this time. Oh yeah this is kind of coming back to me. Recently I have noticed these like lines showing up as well. So I seriously think there is some type of connection problem between the display and the board. I pushed the display downward and then it stared working better. But yeah you can see. The display is on it's last legs. Oh no. It's not moving again. Why? Is it the CD? Is like the SCSI device freaking out? Cause I don't want to plug it in while this thing is booted up. I don't think you should hot plug these things. In fact some of you told me I shouldn't even be hot plugging Apple Desktop Bus devices which yeah that was negligent, I didn't even know that I'm sorry. (laughs) But yeah if I shouldn't even be hot plugging ADB devices, I really shouldn't be hot plugging SCSI devices. Oh now it's continuing. Okay all we had to do was talk about it and then it just started working again. Okay well, whatever Macintosh. You do you. You do you. Now here's the fun part, how do we get this to work with this? I know CD support was introduced with system 7 and we're on 7.5 so, the support should be there. Let's try ejecting. And reinserting. And see if it does something. I hear it doing something. It's green. Okay so the question is, am I using this wrong or does it not work? I did buy it off Ebay so there's always the risk that something won't work. But it has a green light. It changes from amber to green. So it looks like it knows what it's doing but I can't seem to get it to connect to the computer. And just to verify I do have the Apple CD ROM extension turned on so yeah, at this point I don't know what's going on. So. I am hungry. I am going to take care of my empty belly. But then I will return. Hopefully with some answers from the Google machine and or the Ebay seller. And we'll go from there. Sit tight. Okay, so I decided to bust out the IIci again and hook up the AppleCD 300 with that other SCSI cable I was talking about earlier, the CN50. I don't have a monitor hooked up but the light changed color multiple times, so I think it actually loaded but I've gotta hook up a monitor to see first. I also tried this on a different PowerBook, but let's try this on the IIci. Let me just make sure I'm not seeing things. Oh hey, it won't let me eject now. So I think its actually mounted and we have to do it from the desktop. Okay let's hook up a mouse, keyboard, and a monitor. I busted out the trusty SyncMaster 2243BWX, it just rolls off the tongue, and let's see if this worked. Hey Performa CD. Oh man. Let's hook up a mouse. Mouse, mouse, mouse. Does anybody have a mouse? Just realized I'm not supposed to hotplug ADB devices but how can I plug something in to shut down the computer so I can not hotplug things? I don't know its just a big mess. (yells) I'm just gonna do it. Now I could use this really cool black Apple Desktop Bus Mouse II, but this is part of a special Mac computer. I don't wanna use it now. We'll have to get back to that later. Stick around. For now, I'm just gonna use this boring beige Apple Desktop Bus Mouse II. This guy, you'll see him later. Now I know you're not really supposed to hotplug Apple desktop bus devices. You techies have made that very clear, I appreciate the help but I have no way to interface with the computer to safely shut it down anyway. I know I shouldn't do that but to be honest, I've been negligently doing that for years and I might of broke something, but I can't remember. (laughs) Okay we need a... Actually this isn't working too bad. Aw crap, we need a good mouse pad. Anyway, let's bust this open. Yeah, shit! Hang on I've gotta move the track ball with my finger. This thing is not tractioning very well on my desk. About this CD. The Macintosh Performance CD contains copies of all the system software. This is awesome. So the CD drive works. I don't know why it wasn't working with the PowerBook, but it works with the IIci. Okay so I wonder. Hmm. If this CD drive is working, maybe we can finally complete the Premiere experiment and use Adobe Premiere 1.0. A native 1989 68K Macintosh hardware. That would be fun. All right, oh and I got a mouse pad. Edit like a pro, Final Cut Pro X, look at that. Coincidentally we will not be using Final Cut Pro X, we will be using Adobe Premiere one which came way before. However, they were both written by the same chief architect, Randy Ubillos, how fun. Okay, let's quit and there we go. It's like a little delivery like here you go, sir. Enjoy. I'm just glad this thing isn't having hardware issues. I guess it just wasn't compatible with either the SCSI cables, I tried two different SCSI cables though. None of them worked. Maybe that PowerBook just didn't have enough power. (laughs) So Premiere One inside the caddy. Close her up. Pop her in. Let's see what happens. If this does work, my idea of using this IIci as our petri dish for Adobe Premiere and other programs, is another step closer to reality. 6100, yes that's what I named the CD back when I was trying to get it to work with my Power Macintosh 6100 but that thing won't detect any hard drives or anything. I think the PRAM battery might be dead, at least that's what some of you guys suggested. As you can see .FSeventsD for demon I'm guessing, so that just shows you this was burned with some kind of Unix-y thing. This was actually burned on Mac OS X Leopard. And here's our files. Huh, I just realized... Wait, what the (bleep). I mean I have the picture files but do I have the, do I have the program? I don't know. Let's see if one of these pictures works. Yes, SimpleText opens up the picture files. I don't know the old Mac OS just had a text editor open up your pictures. I don't know why. That's just how it was. (laughs) Hey, there it is. There's my photo. I mean it's kinda dead there a little bit because of the limited color palatte but yeah, that's my photo of Cloud Gate in Chicago. Oh, look at that rendering. Oh, we're gonna be here all day. We should probably quit this before we die. It's also coming off of a CD. At like probably 2X speed over SCSI. Or two times speed. Anyway yeah, so there's pictures, I feel like we're missing something though. Did I seriously burn this CD without burning the fricking... I have a feeling that I forgot to burn the actual Adobe Premiere software to the CD. But we at least know one, the CDs that I burn with Leopard work, the Mac OS standard format is compatible, and two we know that the AppleCD 300 external SCSI drive works. So, that's the battle. Like, we won that. As long as I know those things work, that's fine I can burn more CDs. I bought a bunch of them, like 100 of them with a little carrying handle built into the case, it's pretty fricking awesome. Movie player. But yeah, I'll put Premiere on here and see if it works. That'll be in a future tech video log. Right now I just wanted to make sure I can get CDs working on this IIci and yeah, even with daisy chaining the CD drive on this Club Mac SCSI thing, like even with doing that it just worked first try. I'm actually pretty impressed. Okay, let's see if we can open up something here. Let's go to the CD. Untitled Movie let's see if that works. Oh hey, there's my face! I saw my face show up in the preview. I have never seen my face in such an old operating system before but I think we're about to. Oh my gosh. This is quality. This is quality right here like you've never seen before. That's really bad, wow. Yeah, um... Get info. I'm guessing this is just compressed with \"Road Pizza\". It probably won't tell me but, you know Apple video. The old original format four. Quick time. Wow, look at this. Super low resolution. Well, let's try playing it. There ya go, guys. Wow, okay so the movies work. That gives me some hope that this computer has enough performance to run Adobe Premiere. This is exciting. Okay, I'm calling this a win. I cannot wait to try out more programs, including Adobe Premiere on this Macintosh IIci, thanks to the help of this external CD ROM drive. So subscribe, stick around. I have so much more fun stuff I wanna show you. (computer beeps) Oh yes, and another rare Mac as well. A lot of cool stuff coming up. So thanks for sticking with me. More cool stuff to come, catch the crazy and pass it on. [Upbeat Techno Music]",
    "transcript_keywords": [
        "SCSI",
        "Adobe Premiere",
        "Yeah",
        "Premiere",
        "Apple Desktop Bus",
        "drive",
        "work",
        "works",
        "power",
        "SCSI drive works",
        "Mac SCSI thing",
        "mouse",
        "SCSI cable",
        "thing",
        "Apple Desktop",
        "kind",
        "Mac",
        "SCSI drive",
        "Macintosh",
        "plug"
    ],
    "transcript_entity_values": [
        "Apple Desktop Bus Mouse II",
        "SyncMaster 2243BWX",
        "IIci",
        "Adobe",
        "Randy Ubillos",
        "PMU",
        "Final Cut Pro X",
        "years",
        "5260",
        "Chicago",
        "7",
        "two",
        "Apple",
        "all day",
        "Adobe Premiere",
        "PowerBook",
        "Ebay",
        "Cloud Gate",
        "Macintosh Performa",
        "Mac",
        "Premiere 1.0",
        "Macintosh",
        "the Power Management Unit",
        "PRAM",
        "Mac",
        "300",
        "today",
        "1989 68",
        "Power Macintosh 6100",
        "5,003",
        "Krazy Ken] - Oh",
        "Premiere",
        "Google",
        "Mac OS X Leopard",
        "VHS",
        "the Mac IIci",
        "SCSI",
        "first",
        "four",
        "Performa",
        "7.5.3",
        "Mouse",
        "One",
        "SimpleText",
        "100",
        "Road Pizza",
        "7.5",
        "Apple Desktop Bus",
        "a couple weeks ago",
        "Club Mac",
        "Leopard",
        "2X",
        "K Macintosh",
        "a couple weeks",
        "Adobe Premiere 1.0"
    ],
    "transcript_entity_types": [
        "FAC",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT"
    ]
}