{
    "id": "W8snwlE93aE",
    "title": "This MUST be a Scam... \"Treasure Box\" Gaming PC",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-12-07T19:04:11Z",
    "video_url": "https://www.youtube.com/watch?v=W8snwlE93aE",
    "category": "Science & Technology",
    "tags": [
        "Dell",
        "refurbished",
        "treasure box",
        "used computers",
        "e-waste",
        "Gaming PC",
        "budget gaming",
        "budget pc",
        "recycled pc",
        "used dells",
        "optiplex",
        "optiplex gaming"
    ],
    "views": 2898651,
    "likes": 82679,
    "comments_count": 3671,
    "description": "Check out Vessi's Holiday Sale at  or use code LinusTechTips at checkout if you just missed it for 15% off plus free shipping to CA, US, AU,JP, TW, KR, SGP via their store online.  Get the best offer at  and right now you can save up to 40% through December 22nd!  Glittery Dells have been showing up on store shelves recently and we need to find out why! They're shiny, they're dusty, but are they worth the money?  Update on the warranty: We called up the support line for Advanced Skytech (Treasure Box) secret shopper style. There was no wait time to get an agent, and they walked us through every step of fixing the issue including sending videos to assist us. They were patient and helpful overall. Pretty pleased with how it went.  Discuss on the forum:   Buy an i7 Dell Treasure Box PC:  Buy an i5 Dell Treasure Box PC:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:47 What is the Treasure Box? 2:03 Opening it up 5:34 Software and Games 6:17 Is it a good value? 7:27 The TecDale PC 8:15 Inside the TecDale 9:17 Testing peripherals and games 11:06 Was the TecDale and TecFail? 12:08 Why do these even exist though? 13:37 Is this a good thing? 14:47 Conclusion",
    "description_links": [
        "http://vessi.com/LinusTechTips",
        "http://ridge.com/LINUS",
        "https://linustechtips.com/topic/1472528-lipstick-on-a-pig-%E2%80%93-%E2%80%9Ctreasure-box%E2%80%9D-refurbished-gaming-pc-review/",
        "https://geni.us/nuWV3wN",
        "https://geni.us/8RlQ",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- This glitter-bombed Dell OptiPlex, is not only a real product you can actually buy, but it's just a small part of an entire hidden in plain sight industry of refurbishers, who seem to be bulk buying retired office PCs, dazzling them up, and then offloading them to want to be gamers. I have so many questions right now. Are people actually buying these? Who are the companies building them? Is it possible, that they're a legit good value? And why is it taking so long, to tell you this message from our sponsor? - The Ridge, it's time to ditch that bulky wallet 'cause the Ridge Wallet can hold up to 12 cards, comes with a cash strap or money clip, and is available in tons of colors. Check them out at ridge.com/linus now and save up to 40% through December 22nd. - The Treasure Box, first popped up on our radar and a back to school flyer earlier this year, but other than having a little chuckle about the creative idea of throwing glittery lipstick on big computers to blow away dead stock, we didn't pay them much attention. That is, until we saw them in the next week's flyer, and the one after that, and the one after that. And then, upon further inspection we realized, these things are everywhere, in some shape or form. Amazon, Walmart, New Egg, Best Buy, some site called Ubuy, based out of the country of Jordan. Now most of them aren't explicitly marketed as, gaming PCs but given the aesthetic and the imagery, it's pretty clear what market they're going after. And truthfully, why not? We've shown multiple times that a castoff office computer with some strategic upgrades can be an unbeatable value for budget gamers. Maybe these are too. So to find out, we bought a couple of them, starting with the best Treasure Box brand unit that we could find. 4th Gen core i7, 32 gigs of Ram, a one terabyte SSD, RGB lighting, and a fully licensed copy of Windows 10, for the low-low price of just 300 US dollars. What secrets will we find inside your head? Yah! I actually really like the way they've done this finish. I assumed it would be like spray bombed or something like that, but it actually appears to be like almost like a grip tape type of texture. It looks pretty good in person. Oh, it's not sticking very well here, but you got to give them credit for being completionist about it. They not only do the top and front, but also the sides and bottom. Actually looks kind of sharp, doesn't it? Oh wow! That is the generic-st memory ever. Just bare dims, no stickers whatsoever with SK hynix packages on it. It even looks, like very clean, like almost too clean to the point, where they might even be sourcing this stuff new. That doesn't make any sense. I would think given that it's older, like there is so much used DDR3 on the market, that they wouldn't bother to source new sticks. But it might be as simple as they're just peeling the stickers off, whatever it is they happen to find, and then throwing them into genericize them, then why would they do that? Because then they would have difficulty claiming warranty from whoever they're getting these sticks from. What about our SSD? Okay, it may be a terabyte but it is, certainly nothing special KingFast. Not exactly, the leader in performance SSDs. Ooh, ooh! Hey, there we go. Ow mother- - You bleeding? - Oh yeah, it was here. And it was so sharp, that I didn't even slide. Be right back. This is great though. Even a cheap SSD can make a world of difference to the responsiveness of a system. The SSD that I paid in blood to identify turned out to be a KingFast F 10, one terabyte, not the world's fastest SSD. And because it doesn't have a DRAM cache, there are cases where it could actually end up being slower than a mechanical hard drive. But, with light desktop use, those cases would be few and far between, and it would be a substantial upgrade over whatever mechanical storage might have been in the system. Also, because many businesses shred their storage devices, when they donate or liquidate PCs, it's likely that there wasn't anything in here in the first place. Since we've got a better look at the motherboard now, seems like good time to look at that. There is a PCIe 16x slot down here that could be used for GPU expansion. But because this is a slim chassis, you'd be limited to cards that are half height but full length as long as, they don't have a bulky dual slot cooler that would interfere with your data ports over here. That's curious, there's an RGB strip in the front, but I don't actually see what's powering it. Oh wow, it's two separate RGB strips in there. Hey, wait a minute! The front of the case only has two cut outs for USB ports but the system itself has four. Oh crap, I just powered it on. They stickered over them. As best as we can tell, the only reason to do this, might be because there are versions of this chassis that only have two front USB ports. And this way they would only have to stalk one version of this front bezel sticker. But then we found listings for Treasure Box PCs, that do have all four ports cut out. So, we're really, really not sure what the deal is with that. Time for some USB port surgery. And ideally I won't cut myself again. This is a very sharp knife. JerryRig everything. lttstore.com. Brandon, just don't get too close to this, hey. - Yeah, sure. (laughing) - Oh, I nailed the second one though. Look at that, clean! Almost as clean as the windows install on the Treasure Box PC. I was actually really impressed to see that outside of VLC, and the games and applications that we've installed, this machine contains no blow wear like antivirus or freemium games, or anything like that. Does this ever load? Like is this. - No, I'm surprised it's still up honestly. - Unfortunately, this is about as far as we get, beyond light games from like 10 years ago. This thing is going to struggle to do pretty much any gaming. And given the marketing, there are almost certainly parents or grandparents who have ended up with disappointed kids, when their new computer can barely run Minecraft. But, if we adjust our expectations a little bit the Treasure Box is actually looking like, a pretty okay value. I mean sure, it's based on an older platform and it doesn't have the latest bells and whistles, like USB type C. But, as long as you're not trying to run applications it doesn't support, day to day the responsiveness of the system is actually pretty okay. Thanks to that basic SSD boot drive. Now you could build one yourself for cheaper. We ended up pricing out all the pieces inside for anywhere from 185 to $240, depending on promos and availability. But not everyone has the technical know-how or the desire to do that. And for peace of mind, it comes with a one year warranty. I had some doubts, about that warranty actually being honored, but if user reviews or anything to go by, these guys mostly stand behind their product. I would be interested to test that ourselves though. Can we give it a shot, maybe post a little note in the video description, with how it goes? - Yeah, we'll do that. - Okay, cool. But, as we showed before, these machines are everywhere, and not all of them come from that same company. Meet, ah! The TecDale PC. From TecDale. This one doesn't have a catchy name like Treasure Box but they've certainly gussied it up a little bit. We've got this what appears to be like a blue vinyl sticker, whatever this is. I guess we'll figure that out later. They've also added a like a, some stickers on the top. Oh, interesting! That's just to make the case look less scuffed and beat up. There's a little lip here. - Oh wow! - See there's a sticker and you can actually see the like beat up case center. I was wondering why they would bother to do that and they've got a cutout for where the original Windows color went? Huh! Yeah, hey, look at this. This side panel too. They actually vinyl-ed the whole thing. It's just way more subtle. Maybe there's treasure anyway. Now there's dust, that sort of, dead skin cell treasure. Only 256 gigs but this one was cheaper. I have never heard of Hajaan. Apparently that is a house brand for TecDale. They call this the most powerful SSD. I think not. We've got not one, not two, but three different types of RAM in here. I have no idea what the meaning of these two X's wiped into the dust are, but we've actually got a GPU in here. A GT 1030, not the most powerful thing in the world but it should manage CS: GO at the very least. More compact RGB controller, but oh, there's definitely RGB. Let's go ahead and fire this thing up. Not as nicely put together as the other one. But I got to say, even if it's only a GT 1030, it's probably going to make a pretty big difference to have a discreet GPU of some sort in here. Oh, that's cool. Look at that! RGB strip here and an Infinity Mirror RGB strip. Only 16 gigs of RAM this time. 3rd Gen processor, and only a 256 gig SSD. But, we also have a 500 gig of hard drive and this machine was only 300 Canadian dollars. It's not strictly advertised as a gaming PC, but it comes with this multifunctional RGB back lit gaming 3 in 1 combo. So, I think it's fair to say that CS: GO should probably at least launch on it. Oh wow! I have never seen a keyboard, whose RGB is controlled via remote before. There's a first time for everything. We're actually not a hundred percent sure of the price for this one, because since we ordered it the page has completely disappeared. And the guy who has the invoice, isn't here right now. So you're going to see an onscreen correction if I didn't get it right. What is this? Is this a, is this a USB thumb stick? Oh, this is a wireless dongle for what? Oh, it's wifi and Bluetooth. Yeah, there's the WPS button. Okay, that makes sense. Okay, yeah sure, that can go in the front, why not? Oh, that actually looks pretty cool. Not bad. And it turns out, that the remote is actually for the, oh wait, oh! for the, oh for that. Oh, okay. Wow, it's all RGB. Ooh! I do like the shiny lights. Ooh, this is not a good keyboard. In case you were wondering, but I'm getting, so I dipped to 30 there, felt it. About 60 FPS. I mean, it's, not the greatest gaming experience. Though in fairness, TecDale doesn't advertise this as a gaming PC, even though clearly that's their intent. And they do have a history of selling gaming PCs that are in the thousand dollars range and still use a GT 1030, meaning that, the gaming experience isn't going to be much better. However, yet again, it's not technically a terrible price. If you take into account things like, the legit copy of Windows, the ease of setup, and the warranty through whatever platform you purchased it on. This one would even be able to play some games at low to medium settings, without too much hassle. A fact that TecDale has included in the description without too much hyperbole. And because both of the machines we looked at, are using industry standard, or at the very least Dell standard parts, either of them can be maintained, or upgraded with better GPUs down the line, turning them into, surprisingly competent little gaming boxes. It's no wonder these things are so popular. But we still haven't answered the biggest question. Where are these things all coming from? China? India? No, Toronto, Ontario, Canada. That's right. Both, advanced SkyTech Global, maker of the Treasure Box and TecDale are headquartered within 20 minutes of each other, and a little bit farther down the street, you'll find HiTech Bay, yet another glam furbisher as we've started calling them. We can't be a hundred percent sure, why there's such a high concentration of these companies in that area but we do have a couple of guesses. First up, is that Toronto and its surrounding suburbs, is the business capital of Canada. So the regular supply of machines like this likely greatly outstrips the local demand, meaning that they can easily export them to other regions. Second, is that Markum in particular, is a tech hub that contains the Canadian headquarters, of countless big names like Asus, AMD, and oh also our friends over at Infinite Cables. Finally, one of the defining characteristics of the PC industry is the shameless copying that takes place between competitors. So my best guess then is that word about how effective a quick coat of paint or sticker as it were, got out pretty quickly leading to almost immediate copycat-ism. And given a little bit more time, I'm sure many more of these companies are going to be popping up near business hubs around the world. As an advocate for keeping e-waste out of landfills. I'm actually pretty happy to see these machines finding their ways to new homes. And, I also feel like it's worth giving a shout out to Microsoft's role in all of this. Every one of these companies claims some form of legitimacy by being part of the Microsoft authorized refurbisher program. SkyTech and Hitech Bay are both listed on Microsoft's website. And TecDale, we think is probably purchasing these licenses from a Microsoft authorized refurbisher member, which makes them legit. Now, none of that means that these guys won't take your money and run, when it comes warranty time. But overall, it seems like, there's a fair number of happy customers out there. And like I said before, I think that's a really good thing. To be clear, I don't think that Microsoft is providing cheap Windows 10 licenses to these guys out of the goodness of their hearts. Some money is probably better than the no money that they'd be making, if refurbishers did what they used to do and simply pirated windows. But legit Windows adds peace of mind for would be buyers keeping these things out of the landfills. And honestly, I doubt this program really moves the needle from Microsoft compared to the work it takes to maintain. So I'm glad they're doing it. The question remains though, should you buy one? Well, this is Linus Tech Tips. So obviously our first choice would be to cobble something together ourselves from handpicked used parts. But if you need a very simple PC that requires no knowledge to set up or build, and you don't have much of a budget, and maybe you need some semblance of a warranty, this could be a good choice. I would at least consider the extra hundred bucks for something brand new, like this unit from HP, even if it's just to ensure that I'll have support for future Windows updates. But Windows 10, still got a lot of life left in it. And in this price range, an extra a hundred dollars is a lot of money that could have been used for a GPU upgrade. I was expecting to dunk on these things for the somewhat misleading marketing, and, general cringiness of them. But given that they've basically just commercialized what we've been advocating for for years I guess I can't go too hard on them. At least not as hard as I go. Segueing to our sponsor - Vessi, do you ever struggle to figure out what to wear in unpredictable weather? Well, Vessi says, their shoes are a hundred percent waterproof, keeping your feet dry in the wettest of weather. There lightweight and easy to pack sneakers offer you reassurance, when the snow and rain start coming down. Putting them on and taking them off is super easy, and their shoes are made from cruelty-free products right down to the glue. And whether it's a rainy city or a rocky trail, the herringbone tread design is there to help stop you from slipping around. So treat your feet with Vessi footwear and save $25 with our offer code, Linus Tech Tips at Vessi.com/LinusTechTips. - If you guys enjoyed this video, you might enjoy some of the more detailed guides we've done on how to find, and buy a cheap workstation on eBay, and turn it into a sleeper gaming monster.",
    "transcript_keywords": [
        "Treasure Box",
        "bulk buying retired",
        "RGB",
        "Treasure",
        "glitterbombed Dell OptiPlex",
        "SSD",
        "Windows",
        "Box",
        "gaming",
        "Treasure Box PCs",
        "pretty",
        "plain sight industry",
        "RGB strip",
        "Microsoft",
        "entire hidden",
        "hidden in plain",
        "plain sight",
        "Treasure Box brand",
        "time",
        "USB"
    ],
    "transcript_entity_values": [
        "one",
        "Markum",
        "HiTech Bay",
        "500",
        "Vessi",
        "eBay",
        "Brandon",
        "SSD",
        "RGB",
        "WPS",
        "CS",
        "a hundred dollars",
        "Ubuy",
        "GPU",
        "Dell",
        "16x",
        "1",
        "AMD",
        "Ram",
        "TecDale",
        "three",
        "Canada",
        "Ontario",
        "December 22nd",
        "Canadian",
        "256",
        "Linus Tech Tips",
        "Microsoft",
        "half",
        "GT",
        "first",
        "25",
        "VLC",
        "First",
        "32",
        "Windows 10",
        "Amazon",
        "20 minutes",
        "Only 256",
        "Linus Tech Tips",
        "earlier this year",
        "Hajaan",
        "Minecraft",
        "an extra",
        "SkyTech Global",
        "185 to $240",
        "Windows",
        "four",
        "Ridge",
        "China",
        "HP",
        "4th Gen",
        "the next week's",
        "Infinite Cables",
        "Vessi",
        "SkyTech",
        "up to 12",
        "30",
        "3",
        "a hundred percent",
        "two",
        "one year",
        "Windows",
        "second",
        "up to 40%",
        "Hitech Bay",
        "Second",
        "Asus",
        "Treasure Box",
        "Toronto",
        "Dell OptiPlex",
        "only 300 Canadian dollars",
        "New Egg",
        "SK",
        "About 60",
        "RAM",
        "Walmart",
        "JerryRig",
        "Infinity Mirror RGB",
        "3rd",
        "Windows",
        "USB",
        "India",
        "just 300 US dollars",
        "10 years ago",
        "Only 16",
        "Jordan"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "LOC",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "GPE",
        "GPE",
        "DATE",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "MONEY",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "TIME",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "ORG",
        "GPE",
        "MONEY",
        "DATE",
        "CARDINAL",
        "GPE"
    ]
}