{
    "id": "w_dTXKhFWtE",
    "title": "Galaxy S8 Durability Test - Scratch, Burn, and BEND tested",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-04-19T15:32:33Z",
    "video_url": "https://www.youtube.com/watch?v=w_dTXKhFWtE",
    "category": "Howto & Style",
    "tags": [
        "Galaxy S8",
        "galaxy s8 plus",
        "samsung s8",
        "s8",
        "durability test",
        "s8 durability",
        "how durable is the Galaxy s8",
        "review",
        "technoligy",
        "cell phone",
        "mobile phone",
        "android",
        "iphone",
        "scratch test",
        "bend test",
        "iphone 7",
        "smartphone",
        "jerryrigeverything",
        "galaxy",
        "durability",
        "test",
        "bend",
        "burn",
        "scratch",
        "tested",
        "drop",
        "unboxing"
    ],
    "views": 8781890,
    "likes": 107872,
    "comments_count": 10064,
    "description": "Galaxy S8 Durability test is the review we have all been waiting for. The FREE 30 Day trial of Audible is HERE:   The Samsung Galaxy S8 is the newest flagship from Samsung, released in April 2017 this android smartphone has the top of the line specs and performance. But is it durable?! There is only one place on the internet to find realistic tests that pertain to every day durability and thats right here with JerryRigEverything. Watch with me as we put the Galaxy S8 through two years of abuse in just a few minutes.   It'll only hurt for a second.   Galaxy S8 Complete Teardown:   Cell Phone Replacement Parts:  Awesome Smart Phone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://www.audible.com/jerryrig/",
        "https://youtu.be/GRmY-4HKVIk",
        "https://goo.gl/8e9zgI",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "The Samsung Galaxy S8. My durability tests have become a rite of passage of sorts for every new smart phone that comes out, and this brand new flagship from Samsung is no different. Ill put it through a few years worth of abuse in just a few minutes. Ill make sure the phone can survive the test of time and see if the S8 is worth the investment for those concerned with durability. Lets get started. [Intro] This orchid gray color is the one lucky enough to end up on my desk; a new color variation for this round of smart phone. Its nice to see something different than the standard black, gold and silver that pretty much every manufacturer has. The phone is cold and solid feeling in my hand so were off to a good start. The scratch test is always first. My Mohs picks do a pretty good job of seeing how scratch resistant the screen is. Plastic screens, like the Galaxy S7 Active would scratch at a level 3. Last years Galaxy S7 Edge scratched at a level 6, which is pretty much the standard for smart phones at the moment. A sapphire screen would get into the levels 8 or 9 on the hardness scale, and Im working on getting my hands on one of those phones, but they are pretty rare. The good news is the Gorilla Glass 5 on this Galaxy S8 scratched at a level 6, so your normal keys and coins wont do any damage to this glass. There is no physical home button on the bottom of this screen. Aesthetically, it looks pretty sweet. Im a fan of the larger screen size taking up the whole front face. Looking at the earpiece is where I run into my first issue. Definitely a minor issue, but still something to think about. The speaker grill is recessed slightly below the glass surface which is a very interesting design choice. If it was protruding, like on the Galaxy S7, it would help protect the screen a little by not allowing the glass to rest directly on its surface if set face down. Or maybe if it was flush like the LG G6, at least it would look cool and uniform with the rest of the screen. But recessed under the glass is just asking for it to collect all kinds of lint and dust and other goodies from your pocketor even makeup off your face. Recessed isnt the most ideal design choice. The good news is is that the grill is made of metal, so when it does need to be cleaned out, its pretty secure and wont be falling out on its own like weve seen with some of the other phones Ive tested. One more thing is the speaker size. The S7 Edge that Ive been using for the past year is already pretty quiet, and the grill on the S8 is less than half of the size. So if they shrank the internal speaker inside of the S8, it would be a terrible move. Ill have to check that speaker size when I open up and tear down the phone tomorrow. The sensors, like the iris scanner and the 8 megapixel front facing camera are all covered by the same glass thats on the screen so my razor blade is not leaving any marks. Since the screen is harder than my razor blade. Now for the back of the phone. The back panel is made of glass and the Samsung logo is printed on the underside of the glass so theres no chance of removing it from this side. If we jump up to the flash and the focus sensors, they are also covered by this same glass rear panel. This is the first time Ive ever seen a glass covered flash on a phone; normally its plastic. It think that see-through window to the sensor is pretty awesome. If there was a totally clear version of the S8, I would buy it up in 2 seconds. My favorite gameboy was the clear one back in the day, and older-me hasnt changed a bit. Would you buy a clear phone? Let me know in the comments. The camera lens is also covered with glass and luckily my razor blade leaves no marks on it. Definitely scratch resistant. The Galaxy S8 has a subtle ring around the camera that protrudes ever so slightly. Its almost flush, but the ring is defiantly there. Its made of metal and hopefully if youre the type of person who walks around without a skin or a case, it will be enough to help protect that camera lens if you ever set your phone down. Now the fingerprint scanner. Off to the right of the camera, its definitely in a unique spot. It will take some getting used to. After heavily scratching this fingerprint scanner, I was able to set my fingerprint with no major issues. It still unlocked the phone almost every time. Without looking though, it was pretty hard to differentiate between the camera lens and the fingerprint scanner with my finger tip since they are pretty close together. Hopefully muscle memory will improve with time and Ill get better at it. Now its time for the hypothetical apocalypse test. The Galaxy S8 has a 5.8 inch super AMOLED display. Now in the past when I roast an AMOLED display with my lighter, like with the Galaxy S7, it will start to go white after about 10 seconds and never recover. But this Galaxy S8 lasted 30 seconds. The screen still went white but then completely recovered. Im happy about the success, but Im also all about second chances. But even after another 30 second round of flame, the screen had no markings. Definitely impressive. Speaking of apocalyptic scenarios, I talked Audible into giving a free book to every single one of my subscribers. So if dystopia novels are your thing and you like free stuff, I highly recommend Fahrenheit 451 by Ray Bradbury. Or another book called 1984 by George Orwell. Both of these books reshaped my entire way of thinking. And, well, thought provoking books are the best kind of books. If you use this link, audible.com/jerryrig, all lowercase, you get to keep the free book you download even if you decide not to use Audible after your free 30 day trial. Its a pretty good deal. Ill also include the link right below this video in the description. A burn proof phone would be incredible, but in order to make sure, I tried the flame test one last time. It was only then, on my third burn, that I was able to get a permanent mark on the screen. I would definitely certify this thing for a mild to moderate apocalypse. But with any extinction level events, youre going to need a little more protection. Now the sides of this phone are made from pure metal. Everything from the SIM card tray to the actual borders of the phone. The phone might look a little beat up at this point, but its still less violent than flying United. All of the buttons are made from metal. Even Bixby, our permanent new best friend that nobody asked for, is also metal. Down at the bottom of the phone we have the USBC port which I prefer at this point. The transition to USBC is pretty much mandatory on all flagships this far into the game. Theres also a headphone jack down here. You can charge your phone and listen to music at the same time. How ridiculous would it be if your phone couldnt do something basic like that. Another interesting thing about the Galaxy S8 is that the rear panel is structural; its embedded inside the metal frame instead of rest on top. I managed to permanently borrow the rear back panel of Whats Insides Galaxy S8 that we cut open a few days ago. It looks like the glass coloring can be scraped off from underneath the glass, leaving a cloudy clear surface beneath the logo. I think it looks pretty cool. That clear Galaxy should defiantly be a thing. It took several hard hits with my knife to destroy the back panel, and when it finally did crack, a spider web similar to the LG G6, where everything was still relatively intact. Much safer than the HTCU Ultra where the large un-laminated glass chunks were falling off all over the place. And now its time for the ultimate test of build quality, the bend test. Two years ago the Galaxy S6 was the first phone I ever did a durability test on and Samsung has never disappointed since when it comes to building physically solid devices. There is almost zero flex to this thing and more importantly no seals are being broken either so everything is still water resistant. Its nice that you can count on your phone even if an irresponsibly large amount of pressure is applied to both ends. The flashlight complained for a few seconds about the abuse, but other than that Id have to say that the Galaxy S8 is an incredibly well built phone and definitely a candidate for my daily driver. My Twitter and Instagram followers got a spoiler free preview of the phone before this video went live. So if you like seeing tech tested, follow me over there. And dont forget your free 30 day trial from Audible. For real, its free. With Audible you can read or listen directly from your phone so youll always have something productive in your pocket. Link is in the description. Ill see you guys tomorrow for the tear down. Thanks for watching! Ill see you around.",
    "transcript_keywords": [
        "phone",
        "Galaxy",
        "Glass",
        "pretty",
        "screen",
        "time",
        "Samsung Galaxy",
        "Ill",
        "test",
        "free",
        "smart phone",
        "Samsung",
        "camera",
        "pretty good",
        "phones",
        "metal",
        "thing",
        "good",
        "Audible",
        "back"
    ],
    "transcript_entity_values": [
        "1984",
        "the Gorilla Glass 5",
        "Samsung Galaxy S8",
        "USBC",
        "just a few minutes",
        "8 megapixel",
        "2 seconds",
        "the Galaxy S8",
        "9",
        "30 day",
        "no marks",
        "Fahrenheit 451",
        "The Galaxy S8",
        "8",
        "the Galaxy S7 Active",
        "5.8 inch",
        "Twitter",
        "Instagram",
        "Mohs",
        "Last years",
        "6",
        "tomorrow",
        "almost zero",
        "Galaxy S7 Edge",
        "S8",
        "the HTCU Ultra",
        "SIM",
        "the past year",
        "a few days ago",
        "a few years",
        "daily",
        "The S7 Edge",
        "the Galaxy S6",
        "first",
        "second",
        "the Galaxy S7",
        "30 seconds",
        "Samsung",
        "United",
        "un",
        "third",
        "George Orwell",
        "3",
        "G6",
        "One",
        "less than half",
        "Ray Bradbury",
        "Bixby",
        "Galaxy",
        "Two years ago",
        "Audible",
        "a few seconds",
        "one",
        "about 10 seconds",
        "the day",
        "LG"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "TIME",
        "QUANTITY",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "TIME",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG"
    ]
}