{
    "id": "Waabw_tp0LY",
    "title": "This PC is TERRIFYING - Intel Extreme Tech Upgrade",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-10-31T17:00:30Z",
    "video_url": "https://www.youtube.com/watch?v=Waabw_tp0LY",
    "category": "Science & Technology",
    "tags": [
        "intel",
        "12700k",
        "hardline",
        "copper tubing",
        "induction forge",
        "custom pc",
        "pc build",
        "tynan",
        "alex clark"
    ],
    "views": 3283580,
    "likes": 109617,
    "comments_count": 3898,
    "description": "Thanks to Intel for sponsoring this video! You can purchase an Intel 12700K at   Alex is hosting his first Intel Extreme Tech Upgrade, and we couldn't just make it easy for him. Tynan came ready to go with copper hardline tubing, a sick case and even an induction forge to make it all happen. Will these guys be able to make our most intense ETU yet?  Discuss on the forum:   Buy an 011 Dynamic Evo Case:   Buy an MSI MAG Z690 Tomahawk:   Buy an Intel 12700K:   Buy an EK Quantum Velocity2 Water Block:   Buy an EK Quantum Surface:   Buy a kit of Crucial Ballistix DDR4:   Buy a Sony A7000 Soundbar:   Buy Samsung 980 Pro SSD:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Because Intel Let Me 0:45 Invading the Space 2:37 The Parts 5:11 Linus Isn't Even Here 5:34 Starting the Build 7:54 \"Managing\" Cables 10:19 A Computer that Can Kill 14:19 Don't Try this at Home 18:37 The Hardline Tubing 20:50 The Door Behind the Door 21:55 Glam Shots 23:01 Outro",
    "description_links": [
        "https://geni.us/RPyj54U",
        "https://linustechtips.com/topic/1464562-this-pc-is-terrifying-intel-extreme-tech-upgrade-sponsored/",
        "https://geni.us/KhGhgHx",
        "https://geni.us/uBQD",
        "https://geni.us/RPyj54U",
        "https://geni.us/w899P0",
        "https://geni.us/1q8XzJ",
        "https://geni.us/ozet",
        "https://geni.us/UHuFf7x",
        "https://geni.us/srAv",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- When I got roped into hosting an Intel Extreme upgrade, I thought I'd just be building a computer. But unfortunately, no. It's for Tynan here, one of our Creator Warehouse engineers. So it's not just a computer, but it's a hardline watercooled computer using fricking copper tubing. Look at this. This is the hardest way to build a computer. Why did you do this to me? Not only that, this is a capacitor, with enough energy to not just murder you, but through you across the room because he built a freaking forge. You touch anything in here, you literally die. This is for melting steel to make swords. This is terrifying. Why have you done this? - Because Intel, let me. Thank you Intel for sponsoring this video. (Music) (Metallic thumping) - Before we get to your new computer, I want to take a look at your old one, because a pretty major part of the series is the host invades your space. Let's do that. What's your computer look like? - Oh good. Don't mind the dumpster fire. - I stepped on a screw. There's a lot of crap in here. Tynan. - Yes, it's like a fractal pattern. The closer you look at my piles of s*** the more s*** is in there. A mace. - Yeah. - I'm upgrading it. - Ah, so that's why you need the forge. - One of a long list of reasons. Yes. - I'm guessing this at one point in time was a 3D printer. - Yep. That was a maker bot that died a sad death. - And you're just holding onto the stepper motors, I guess. Makes sense. Do you have a wheel? - This is supposed to go to my dad at some point, but I haven't gotten around to sending it yet. - It's, I saw that you don't have a chair. Ugh. - I sit in all kinds of fun and weird positions on this thing. One of the classics is like super wide. - Sure. - Especially when all of the stuff was in here and I had literally no space. - And like. - Oh this. - So it's from Harman Kardon, and their smart assistant no longer exists. I tried to turn it into a dumb spot. It just didn't work. - Razor blade, just chilling. Cool, cool. - Everything is fine. - What's your computer? Is that like a 1080 or something? - No, that's actually a Titan. - Oh, like a Maxwell? - Yeah. It's not new but oh boy, does it still work pretty damn well. - Maxwell's kind of starting to show its age, like most stuff is good and then sometimes there's like new accelerators and it's just like, Nope. Dice all of the dice. All of dice. E w P. - Yeah. That's my partner's band. I'm making a nice little logo for them that lights up and looks all schwanky. - Also over here, I don't think the camera's seeing this yet, there's a a whole drum set, which I think is also your partner's, cuz she's way cooler than you. Is this a old timey scale? - This is my grandfather's is, was, was my grandfather's. So I'm gonna, I'm gonna clean it all up, and give it a nice new lease on life. It's very well built. - All right, let's build a pc. - I wanna do that. Let's get this case down, and start actually building this because it will take a while. - Yeah. How much of this do you have proved done? - An amount. - Oh there might be loose stuff in there. - Yeah, it'll be a problem. - It's fine. - For the case, Tynan went with the O11 dynamic from LianLi Evo. It's kind of at this point, sort of like the the basic f***ing cases cuz everyone uses it but also that's because it's a fantastic case. For the motherboard, you went with the Mag Z690 tomahawk from MSI DDR four. Why did you choose that? - I started this build quite a long time ago and DDR five was really expensive and really hard to get at the time - And this is a very nice motherboard, particularly when you pair it with a nice little 12700K so this has 12 CPU cores, eight performance cores, four efficiency cores and it's the K model which means that whether Z690 motherboard and a custom order cooling solution. This thing's kind frigging ramp. For the CPU block, we have the EK quantum velocity squared. Ek make such beautiful stuff. - Yeah, they really do. - EK 360 rad. This thing is a beast and apparently it is Ms Butt's special. That's really cool. Particularly when there's the copper later with this. Dang. Yeah. How much did you spend on fittings for this? - I think all of the water cooling stuff is like a grand and a halfish - RAM, We have Crucial Ballistix. This is 3,200, which is kind of slow. But also these micron chips are known to be really good over clockers or you can just do what I do and never worry about memory over clocking cuz it's a stability nightmare. - Probably, that one. - You want to first get the basics of the water cooling in. I know how to water cool a pc. That's super easy. - Sounds like a plan to me. - What's not so easy is you bought this wonderful Sony 7.1.2 soundbar, which I imagine works really well. How do you plan on attaching this to your wall. - Over there. - Or more so you are attaching this to your wall. I don't want to do that. Where are the other speakers? - So that is a standalone unit. It can have subs. - It says 7.1.2. - It has subs built into it that are up firing as well. - Subs. Someone here clearly knows about sound like this right here Looks like a good setup. - Yes. - Did you like, ask anyone, anyway do it. Do it. All these blocks are such a pain in the arse cuz you would screw them from the back, so you have to just like hold it. EK has such a fun combination of incredibly well thought out, easy things and incredibly difficult, very high skill things. For storage Tynan went with a 980. - Down she goes. - Here with a Samsung 980 Pro, fantastic drive. PCIE Gen four, so if direct storage ever actually becomes a thing, it'll be all good to go. If you are buying storage right now, I have heard that Intel Optane drives are really fricking cheap while they're trying to sell them all. That's just a pro tip for you. Oh, the way that they did the milling on this is so good. Like not only did they route out the bits in here, but they also added designs with it was RGB in it. Yes. - Yeah. Along the side. - That probably catches all of these two. That's gonna look so good. - This is the part where, I don't know if it's actually gonna fully work or not yet. - What? - Yeah, there's a fun complication for that coming soon. - Oh I see. - Yep. - Yeah, that's a, that's just a hard connection right there. - Yeah buddy. So now we're paying for my mistakes. - Okay, we're good. - Well we did it. I looked. On the prebuilds I did, I did leak test everything except for this really jank fitting. So fingers crossed - Is anything going here? - So option number one, is a mirrored piece of acrylic, option number two, a butchered mesh front panel. That was an adventure. - Let's go for the mirror. Unfortunately we didn't get this from Star Forge. There's no d*** and balls to go there. - It's not a f***ing d***! - Asmongold was so mad about that. - So mad. I know. It's so funny. - There are a lot of things that look phallic that that's a baseball bat. - He just rages like no it's no. - It's just a hammer. It's like Thor's hammer upside down. It has nothing to do with a d***! - Balls and it's not definitely just like helping our publicity here. - If you want this to be a d***, you have to try to make it a d*** - Before is gpu Tynan has gone with an RTX 3080 For The Win Ultra from E V G A. RIP F. This is the same graphics card that I have. It's fantastic. I absolutely love it. - And the dog is interested as. - Well. Here's the actual gpu. Oh you didn't go for acrylic, you went for the pure ace. - It looks sick. Also blocking this thing was a nightmare. - These GPS go really fast too. When you watercolored them, you don't even have to like over clock it or anything. It just sees the thermal headroom and just fricking goes. I absolutely love it when motherboards have the pre-installed IO shields cuz then you can't forget to install it. But there also is the problem that their tolerances sometimes stack. Our problem here is I currently have our IO shield lined up and although the IO shield looks good or about a quarter inch off on the screw holes here, here, here's how you do this now we just, it's, it makes the whole thing stronger. - Okay. - Yeah. It's like a rebar in a building where you have to prestress it. Now your mother board's pre-stressed so your entire chassis is all just way more stiff. Before I worry too much about getting all of the water cooling in there and having tubes in my way. I'm gonna worry about cable management, which is where this guy comes in. This is the SeaSonic Prime 1300. Now this is just incredibly overkill, which is much better than what other people like Andy and James did where they had their power supplies explode. Tynan's gone the other way and I'd say you're being kind of wasteful buying this but, or pretty clearly not making a price to performance machine anyway. - I prefer to just have a power supply that is good and over speced so I don't have to worry about it. And I've always done that for all my. - Builds. And you can also thief toll bolts off of it for your project. - I definitely have done that. Oh. - Wow. This got heavy fast. - Would you like a hand? - Nope. Bye. - I'm taking a stab at putting some holes in the acrylic plate so we can attach it to the case and not just have it floating around like one Mr. c**** Balls company. - I swear to God. - It's fine. It only went through the things that didn't matter. - Oh, doesn't even tight. - Sorry. I have, I have a fun, I have a fun note here. I have Cablemod cables. Oh yeah. - Oh my god. Okay, so let's just, let's just think logically about this for a second. Does it need to be this long? - Your first problem was assuming that I was logical about any part of this build. I also got a couple of different GPU cables cuz I wasn't sure which GPU I was gonna. - Get. The good news is the inch and a half that's on this side will look. - Pretty good. What? Yeah, that checks out. - You happen to have cable ties or zip ties or anything of that nature. - Somewhere. I'm a very organized person. Found them. Do you. - Have more. - Ruh-roh - I guess before I got too deep into cable management, we should add the fans in. Fortunately these fans have excellent cable management built in. They have just these contacts on them. So instead of having to run, you know, RGB and fan power for every single one, you used to do that for one of 'em and then they just look together. Something like, mm mm something like that. Cable management is nearly done and here is where having this much cable is going to become a little bit of an issue. - Oh my gosh. My fallback was I'd, I'd rather have too much cable than not enough cable, but I may have gone too far. I ready for having the second power supply space cuz otherwise we'd be boned. - Okay. I think we are ready to begin the water cooling bit of this. But before we do that, I wanna talk about what we did yesterday. - This is an induction heater or an induction forge. It takes power out of the wall, pumps it through a whole bunch of stuff, and then on the other side can get steel or other metals red hot or potentially melt them with enough power. For. - Very obvious reasons. We are not going to be using this in Tynan's one bedroom apartment. - No. - So instead we are no longer in Tynan's apartment and instead in the workshop. This thing is legitimately very terrifying. These capacitors right here, they're They're fine. You can, you can touch them. It's. - I wouldn't. - Yeah, don't could you can this guy, It won't just murder you. It will send you across the room as it murders you. How? Why, why not? Let's have a look at what you've built here over the past, what, five, six months? Eh? - Six months. - God, this thing's actually terrifying. There's. - A lot going on. This particular capacitor I had to buy from Israel, This is their smallest, one of their smallest versions. It can handle the entire power service to the lab. Oh. - So that's like considerably more than like the transformer we have for this entire. - Building. This is also extremely high frequency. - So how does an induction heater work? I put this piece of steel into this and it gets hot. But. - Why? One thing in metals, their electrons don't like moving around quickly or switching directions. What this does is kick kicks them back and forth really fast. - Intel powering your dreams. So how many volts are we talking here? - It's something in the neighborhood of like 200 amps and could potentially resonate up to like 400 volts depending on how it works out. - So it's more the amps that are Yeah. Having a fun time. Not the voltage. - Yeah, exactly. I'm not worried about it capping out really, really quickly. But this capacitor needs to be cooled. - That's cooled just by this soldered on piece of copper tube? - Currently? Yes. All right. So that is all hooked up and hopefully won't leak water right next to all of the high power electronics. I would probably recommend plugging into two different circuits for what we're doing right now. It's fine. Well, I have the breaker, which is currently on, I have this switch which is now on, but now this is a don't touch anything in here moment. This power supply, its entire job is to run the fans pump and the control electronics. I have it hooked up to another more different switch on the front. That is what actually turns on the main driving board and that's what starts everything going. I also have a nice display on the front, which you can't read if you're outside of the horrifically awful viewing angle. - So should we try and melt something? - All right. Chaison. I have no idea how much power it's drying. I should probably be in a different place, but it's. - Fine. It's not heating up a whole lot. It's at like 30 degrees right now. - This thing has an adjustable frequency and ideally it's matched to this coil. I'm pretty sure it's not. - So you turn that potentiometer that changes the frequency. Yes. And hopefully matches this. How do you know when it's. - Matched? When it pulls a lot of current at a given voltage. - Oh. So we're just looking for. - Oh. HOLY S*** Okay. What it peaked at like 16 amps or something very quickly. Another fun thing about breakers, if you hit 'em right at the number they're rated for, they take a really long time to blow. So I, I think we found the spot. I'm awake now. - Yeah, that's, That's working a lot better. Yeah. - It's now at a lower voltage and drawing more than twice as much. - Current? No, it's over a hundred now. That's, That's getting very hot. Very fast. It looks like 120. Okay. I need to And. - It's smoking. Oh yeah, we have problems. - Oh, that's really hot now. That's at a 346 degrees. That's kind of terrifying. All right Actually I'm gonna just hit that as we can do something really dumb. Plug it into the router. - Will this. - Blow up? It may break, but if it breaks, it did its job. So this is where we start treading into unproven grounds. - Oh, you haven't tested. - This. I actually tested that. The capacitors weren't gonna be over volted. They will not blow up. However, this part I have not tested. It's not gonna be very exciting at the first little bit I don't think. Hopefully. - All right. I'm gonna turn on Mr. Flir. What just happened? - It's fine. Everything is fine. These are really big capacitors when I plugged it in. There's enough power going into this that it sparked. - It's a good thing. We have the safety tape on there. Editor. Don't use this, but I am the one that assembled this cord. It's not rated for this. Do you see how bright this light is? - Alex's defense. This cable is fine because it's a current limit. The dangerous part is the fact this is a standard North American outlet. - Nothing did happen. - Hooray. That's a win. Okay. You get 291 volts, which means what? Well, when you rectify it out. Oh, so it's peak to peak. It's about a two x delta end of voltage. I have no idea how that's gonna scale with how much current this thing pulls. My goal here was to blow the breaker here and not on the wall. This breaker dies. I don't care. The one in the wall dies. We need to call an electrician. Don't replace your own breakers. - I thought you were just supposed to put aluminum foil in. - There. No, it's a penny. - That's why they stopped giving you pennies in Canada. - No, do not do that. - So you want us to have eye protection and you grabbed a face shield. - Why? I don't know what's gonna happen if this works way better than I think it's going to. And this steel just gets ridiculously hot really quickly. Okay. I just don't wanna risk it. Oh, that's a lot. - Oh yeah. That's working pretty well. - Oh my lord. It's already smoking. - 200. Wow. That's going up fast. - It is drawing 11 amps. - 11 Amps. Not bad. At. - 200 Volts. - 400 Degrees Celsius. By the way, we're not using stupid American units. I'm also gonna just have a little gander at the. - Inside. - Here. We, it's at 180 degrees right. - Now. It's smoking. Hmm. That smells awful. - Can we just air cool it? Like if we just put a server fan right here, do you think it would. - Oh, it would definitely help. I mean, my actual solution, six of them instead. What's happening here is I'm just pushing way too much power through it and it's generating a ton of losses inside of it in the form of heat. That is a fix for me later learning time. The reason you don't poke around in power supplies, and you hear this from everybody, is capacitors hold charge for a while. So if I turn this on the fuse blows. That's fun. Why did that happen? That's the voltage across the capacitors. It's not connected anymore. - Oh. - That's why people say do not open up power supplies. Cause a lot of them will actually have voltages close to this high in. - Them. In general, when I touch things, I don't want to get launched. - I don't know what I would want to touch less in here. - I would touch the fan. - Our. - Toid is currently at 114 degrees with the help of blowing matron. - Oh my god. - It's dropping, but it's not dropping fast. Honestly, I was hoping that it would cool it down a little bit better than that, but I think we should still run it. - When I plugged this in, it's hot, which means we're gonna have spark. - Exciting. - Ah, I hate it. Okay. Hopefully that worked. 291 volts. Okay, beautiful. Cool. We've removed all bunch of the safety stuff. I'm not as concerned about lighting myself on fire, so that's good. And on. - Oh, yep. That gets off pretty fast. - It tends to be pretty quick right at the start. And then once it hits a certain temperature of like glowing red hot, it'll skyrocket again. Destroying 1400 watts. - Wow. The bar's over 500 now. - Hey, the power's going up now. Two kilowatts. Holy schize balls. 16 amps. 17 amps 18. - Yeah, you might wanna turn it off. - It was drawing 24 amps. - The bottom of the tos really fricking hot. - Oh. - Yeah. I can see it's discolored. - 160 Degrees, which is concerning for sure. - It's hot. - But the bottom where the fan isn't getting it's 250. Oh. - Wow. Oh nope. That's a hundred percent the epoxy coating. - Yep. That is. - Actually, that's a lot of smoke. - That is just the epoxy turning black. - Thank you. Past Tynan and Alex. Let's water cool a computer. - This thing still smells like smoke by the way. - It's one thing you have to remember about hard line tubing is that it's hard. - As with most of these runs, it's designed to theoretically be. - Simple. The good news is since it's all running away so that the tubes can't really come out, he doesn't have to worry as much about the tubes coming out and it leaking because they physically cannot. One thing we forgot to do before we put the fill thing here, you probably should have pressure tested. - It. Yes. - Also, do you have distilled water? - No. Oh no. It's what the EK stuff's for. It's fun. - Oh wow. Look at this. Oh it fits. That's such a good fit. - Is it too good. - Of a fit? No, it's a perfect fit. - I'm actually legitimately surprised that there was not any waters spillage just now. Oh, okay. We probably don't want to turn on the system or do we care that much? - We don't, but we also don't have another power supply and I don't think this is gonna leak. - Oh my god, that looks so good. Oh, that sounds so terrible. Yeah, it's a bunch of air in the pump. - Yeah, that doesn't sound great. - On the bright side. I have another one. - Oh, nice. - Woo. If it's, if it's moving for the time being, I don't care. Oh, this is empty. Maybe with a PWM it won't be as bad. No, nothing is like actually spinning. Wait, how did we hook that up? - Wait. Yeah. - What? Wait. Hey. - Is this one on? - Yes. - I'm guessing we need this for your fans, which means for you to control RGB on them. You probably need to plug in this guy. - My payoff is just that it looks pretty. Oh, it doesn't need to work. - So good. Don't wanna hold these for a little bit. Oh, people are always so scared about getting water in their computers. That's fine. - Yes. I have spilled non-trivial amounts of water in this monstrosity. - What about we take that piece of acrylic out, wipe it, and then put it back in? So many things to get fingerprints on them. - That is good enough. Cool. All right. Now we get to move this beast. I'm gonna remove a dog door. There definitely wasn't 15 things in the way. Getting this PC in. - Here. That's good. It would've been pretty inconvenient if there's 15 things in. - The way. Eh? Kick a chair. Kick a ball. It's fine. Ow. It's really sharp. - Yeah. We're supposed to test this pc, but I have a question. Was there a door behind your door. - To have the drum kit functional there? I had to remove both of them. You'll notice that that door could not close. It's also inconveniently covering the electrical panel in here, so I really don't want to blow any breakers. It's fine. We have one fan spinning. Oh, that's fun. - That's fun. Turns. - Out you just have to install their software. - Do you wanna do the peels? - Oh hell yeah. Oh, you didn't put the screw in. I. - Forgot that. Yeah. I have to say though, this is a fantastic looking computer. Like of all the Intel upgrade ones, I think this is the best. Was. - Also a tremendous pain in the ass. - Yeah, there's no way. I don't want this, but I'm very happy it exists. Can you not wait to have 15% of your CPU just get used to buy RGB software. - And they ask you to install Norton? NO!!! (Hip-Hop Music) Before we close this out I want to go listen to your sound bar. I don't know if we told you, but he lost the mount for, That's why it's not on the wall. - The dog is very curious about the soundbar. Hmm. There's definitely a difference for the max. Max base. - Yeah, but it sounds so much better when it's on. Mid max is like, Do you have motion smoothing on? - Yes, I do. - Can't believe this. This guy works with Linus Tech Tips. What the hell? Please help your friends turn off motion smoothing. Your build's fantastic. Your other build's terrifying. I like your dog. Thank you. And tell. - Also go check out the Flow Plan exclusive where there's, Lord knows too much stuff that I spent building all of this crap. - Hit like get subscribed and if you wanna watch something else, maybe watch, I don't know. I guess my Intel upgrade. Sure.",
    "transcript_keywords": [
        "Yeah",
        "good",
        "thing",
        "power",
        "Intel Extreme upgrade",
        "Intel Extreme",
        "Tynan",
        "fine",
        "things",
        "computer",
        "fun",
        "water",
        "Intel",
        "pretty",
        "cable",
        "stuff",
        "lot",
        "hot",
        "Cool",
        "Extreme upgrade"
    ],
    "transcript_entity_values": [
        "one",
        "Norton",
        "IO",
        "American",
        "O11",
        "eight",
        "180 degrees",
        "One",
        "The Win Ultra",
        "RGB",
        "400 Degrees Celsius",
        "Max",
        "North American",
        "Evo",
        "Thor",
        "GPU",
        "Andy",
        "Cablemod",
        "120",
        "11",
        "1080",
        "Mag",
        "Canada",
        "Ms Butt's",
        "3,200",
        "Intel Extreme",
        "Intel Optane",
        "24",
        "yesterday",
        "Creator Warehouse",
        "Chaison",
        "30 degrees",
        "3080",
        "first",
        "PCIE Gen",
        "291",
        "Razor",
        "114 degrees",
        "PWM",
        "jank",
        "400 volts",
        "MSI",
        "Israel",
        "Titan",
        "Six months",
        "Harman Kardon",
        "160 Degrees",
        "Linus Tech Tips",
        "CPU",
        "six",
        "Star Forge",
        "1400 watts",
        "Intel",
        "Two kilowatts",
        "Sony",
        "IO",
        "four",
        "a hundred",
        "gpu Tynan",
        "Crucial Ballistix",
        "Alex",
        "16",
        "five",
        "a penny",
        "7.1.2",
        "James",
        "Tynan",
        "a hundred percent",
        "18",
        "15",
        "Maxwell",
        "346 degrees",
        "12",
        "15%",
        "DDR",
        "two",
        "EK",
        "five,",
        "250",
        "second",
        "7.1.2 soundbar",
        "17",
        "K",
        "980",
        "SeaSonic",
        "Flir",
        "the stepper motors",
        "Samsung 980 Pro",
        "six months",
        "200",
        "IO"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "LOC",
        "NORP",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "NORP",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PRODUCT",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "GPE",
        "PRODUCT",
        "DATE",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PERSON",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "GPE"
    ]
}