{
    "id": "wAuiV0B-Yvw",
    "title": "Pixel 4A review: $349 for the basics",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-08-03T15:00:27Z",
    "video_url": "https://www.youtube.com/watch?v=wAuiV0B-Yvw",
    "category": "Science & Technology",
    "tags": [
        "pixel 4a",
        "google pixel 4a",
        "pixel 4a review",
        "new pixel 4a",
        "google pixel",
        "pixel",
        "google",
        "4a",
        "pixel 4",
        "google pixel 4",
        "new phone",
        "google phone",
        "new google phone",
        "pixel review",
        "iPhone se",
        "apple iphone se",
        "apple",
        "iphone",
        "se",
        "apple iPhone",
        "iPhone se review",
        "live caption",
        "android",
        "price",
        "release date",
        "camera",
        "pixel camera",
        "processor",
        "how to buy",
        "5g",
        "pixel 5",
        "shipping",
        "coronavirus",
        "covid 19",
        "basic",
        "phone basics",
        "android phone",
        "hands on",
        "review",
        "technology",
        "tech",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 738631,
    "likes": 18026,
    "comments_count": 1529,
    "description": "Google's Pixel 4A is here, and has even announced the upcoming Pixel 4A 5G and Pixel 5. Today, though, we have a Pixel 4A review. Google has priced the Pixel 4A at just $349, which is $100 less than a 128GB iPhone SE. Even at that aggressive cost, the 4A delivers a best-in-class camera for photos. Will the slower processor hold up to years of use, though?  Read the full review:   0:00 Introduction 0:28 New Pixel phones 1:00 The most basic Android phone 1:24 Camera 2:46 Portrait mode 3:17 Video 3:59 Hardware 5:04 Other fundamentals 6:00 What its missing 6:34 Battery Life 7:20 Processor 8:15 Software updates 9:02 Flagship phones 10:19 Outro  If you buy something from a Verge link, Vox Media may earn a commission. Seeour ethics policy:   Buy the Google Pixel 4A on Amazon:   Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/30oc5Wc",
        "http://bit.ly/2TQsqjB",
        "https://amzn.to/3i4eUSo",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- This finally is the Pixel 4a, but before we can talk about the Pixel 4a, we have to talk about timing. This phone isn't shipping until August 20th, which is super late. Google says it's because the coronavirus kept it from finishing the final stages of design and manufacturing. But whatever, because this phone is coming up so late, Google knows that it could conflict with other phones that it's gonna release. So it's just going ahead and pre-announcing two other Pixel phones that are coming out later this year, it's pre-announcing the Pixel 4a 5G, which is gonna cost $499, and the Pixel 5 which is gonna cost, I don't know. And literally that's all we know about those phones, but right now we have the Pixel 4a and it only costs $349. And I would use it, it's really pretty good. It's just a little basic, there's no frills. There's nothing fancy on it, pike at all, but there's no weird software and it's not too big. This is actually the most basic Android phone that you can get. And there's nothing wrong with basic. (upbeat music) Okay, let's just give you the basics of what this phone is. I just said basics again. I'm gonna say basics a lot in this video, I'm gonna try and just turn that up down a little bit. We'll see how I do. The most important feature on a Pixel is either Google software or it's the camera, and you know what? Let's just do it right at the top. Let's talk about the camera. It is really good. There is a single 12.2 megapixel camera on the back with optical image stabilization and the front camera is eight megapixels inside this little hole punch here. Google's camera hardware is never really anything special though, because the focus is always on making better use of that hardware with computational photography. So I compared the Pixel 4a which costs $349 to the Pixel 4 which costs $800, it's a lot for a Pixel 4, and the iPhone SE which costs $400. And the results are that the Pixel 4a's photos are almost indistinguishable from the Pixel 4 in almost all cases. It is good in low light, it is good with night sight. It's good at HDR, it's pretty solid at zoom. And it has that super contrasty Pixel look. Now the iPhone SE does give some warmer colors, which some people like, but in general, I will take the 4a, especially in low light. Do I wish that Google had put a wide angle or a telephoto lens on the 4a? Well, yeah, but those secondary cameras are almost always worse than the main sensor, especially on inexpensive phones. So Google just left them out, but that does have one weird side effect. When you go into portrait mode on the 4a, it has to do this really aggressive 2x crop to make the portrait stuff work with the Pixel's math. Other than that portrait mode is what you would expect. It's not too great at the edges if you look too closely, but it's fine for Instagram. And speaking of math, there is no extra image processor on the Pixel 4a like there is on the Pixel 4. So images do take longer to process. If you take a photo and then jump right into the gallery, you're gonna have to wait a beat for the image to fix itself. The other thing about Pixel phones is that while their photos are great, their videos are not so great. If taking video is more important to you than getting great still photos, you might be better off with iPhone SE, but in general, I do still prefer these still photos of the Pixel than I do on the iPhone. Bottom line, this is a Pixel, which means that it has a very good camera. It is a $350 phone that can go toe to toe with cameras that cost like, I don't know, $1,200. That's still amazing. Now the rest of this phone isn't amazing like the camera, but the Pixel 4a does get almost all of the basics right. I know, I said it again. Okay, there's only one size. It's got a 5.8 inch screen with a hole punch and it's OLED at 1080p. There is a fingerprint sensor on the back and there's that one camera with a flash on the back, one camera on the front, and a headphone jack, hooray! As you can see just by looking at it, it looks pretty simple. It has a plastic body and it has Gorilla Glass 3 on the screen, which is kind of a throwback, we're coming up on Gorilla Glass 7. I don't know, whatever, it's really well-built, there's no flex to it. And maybe it's because it's the same size of regular iPhones have been all the way back to the iPhone 6. But if you don't like big phones, this feels like the size of phone. This feels like a really good size to me. You can get any color that you want as long as it's black. Google likes to use cute names for its phone colors, and it always calls the black ones just black. And yeah, this phone is available just in black. There is this neat seafoam blue-green power button though. The Pixel 4a also does a good job at a bunch of the other fundamentals. You've got stereo speakers on the earpiece here and one on the bottom, it's got six gigs of RAM and 128 gigs of storage. And actually that 128 is important. You can't expand it, but it is double what the base $399 iPhone SE has. So technically the Pixel 4a is 100 bucks less than the equivalent 128 gig iPhone SE. The screen quality on the Pixel 4a is fine. It used to be super rare to be able to get OLED at this price point, but that's changing a little bit. And I think this OLED looks pretty good, it's obviously not the best one that I've ever seen. The color skew a little bit warm in certain lighting conditions. But look, the bezels are relatively small. The Pixels feel fairly close to the surface of the glass instead of being weirdly set back like they can feel on other phones. (soft music) Now the phone is missing some stuff though. So for example, there's no wireless charging, which sure, but come on, that's like expected these days. Google also dropped a thing where you can squeeze it to bring up the Google Assistant. And I don't care. I don't miss that at all. You don't get fancy higher frustrate screens or multiple cameras or a water resistance rating. And that last one, that does kinda suck, but Google dropped all that stuff so that it could focus on the essentials and had to get those right. And I think that Google might might've gotten the most important, essential thing right, battery life. So there's really only two ways to improve battery life on a phone, put it in a bigger battery or make the phone draw less power. And I think Google tried to do both on the Pixel 4a. It has a 3,140 milliamp hour battery, which is small by today's standards, but it's still 300 milliamps more than the Pixel 4. And the Pixel 4's battery life, it's bad, but the Pixel 4a's battery life, well, it's not amazing, but it's fully acceptable. You should be able to make it through a full day. I'm getting around 4 1\\2 to 5 hours of screen time, which to me is enough. The other thing that helps with battery life is drawing less power. And the screen is a big part of that, so a 5.8 inch screen isn't huge, so that helps. But I think the processor inside the phone is the more important part. It is a Qualcomm Snapdragon 730G. The G stands for faster graphics. And I think this draws less power than a Snapdragon 865 with a 5G modem. This is also not a 5G phone, by the way. But does that processor make the Pixel 4a slow? I can see it, sometimes it happens to take a beat longer to open and sometimes scrolling in Chrome is gonna feel a little bit junky, but it's not terrible. And this phone feels a lot smoother than the Samsung Galaxy A51, which is like kind of in the same class here. Smoother is the key thing, because this is using Google's version of Android, which is super clean, super easy to get around. It doesn't have a bunch of extra crap that you don't want. Like these days Samsung is fully just putting ads in its software now. (sighs) Google is guaranteeing three years of software updates for the Pixel and I think this processor is really gonna be showing its age at three years, but it should make it. But if you compare that to the iPhone SE whose processor right now is a beast, it's gonna last longer and it's probably gonna get like five or six years of software updates. So that's something to keep in mind. So look, I know that basic is an insult, it means that it's common. That it's every day, but you know what? In your life, you need to have some simple things that are consistent and reliable. But what I'm saying is I would be very happy with this phone. And I don't know why anybody would buy a Pixel 4 when this phone exists and as for the upcoming Pixel 4a 5G for 500 bucks, me, I don't care that much about 5G yet and we don't know what other changes are coming to it officially, and as for the upcoming Pixel 5, honestly, all I can say is I really hope that Google changes up its flagship phone strategy this year. But wherever the Pixel 5 lands, it's going to be in a different market than this phone because the Pixel 4a is for the sub-$400 market. Here is another word that gets used as an insult, cheap. The Pixel 4a is cheap in terms of cost, but other than being a little, I don't know, plasticy, it doesn't feel cheap. Now it's not as fast as an iPhone SE. And it probably won't last as many years as an iPhone SE will, but it costs less and it has a really nice version of Android on it if you want Android. Look, at this price point, you just can't have it all. I've talked about that with the Samsung Galaxy A51, John just talked about it with the OnePlus Nord. Companies have to pick where their priorities are and Google picked the camera and then for everything else that just made sure that it hit a baseline level of quality. This phone is basic, but a lot of phones in this price range don't even get the basics right. The Pixel 4a does. Hey, everybody, thanks so much for watching. Speaking of cheap, hear that? There's a bird out there, I can't stop it. I bought a squirt gun, didn't work. I'm just doing my best, please subscribe.",
    "transcript_keywords": [
        "Pixel",
        "phone",
        "Google",
        "Pixel phones",
        "phones",
        "camera",
        "iPhone",
        "good",
        "upcoming Pixel",
        "basic Android phone",
        "Pixels feel",
        "battery",
        "basic",
        "basics",
        "screen",
        "costs",
        "battery life",
        "life",
        "Android",
        "Pixel math"
    ],
    "transcript_entity_values": [
        "five or six years",
        "100 bucks",
        "Android",
        "12.2 megapixel",
        "only one",
        "one",
        "Pixels",
        "499",
        "iPhones",
        "128",
        "3,140 milliamp hour",
        "a full day",
        "Pixel",
        "today",
        "300 milliamps",
        "John",
        "Google",
        "eight megapixels",
        "399",
        "only two",
        "six",
        "5",
        "three years",
        "the OnePlus Nord",
        "iPhone SE",
        "Qualcomm",
        "3",
        "1,200",
        "5.8 inch",
        "Samsung",
        "349",
        "2x",
        "two",
        "jack",
        "Samsung Galaxy",
        "4a",
        "Pixel 5",
        "Chrome",
        "350",
        "4 1\\2 to",
        "800",
        "400",
        "this year",
        "these days",
        "later this year",
        "Android",
        "500 bucks",
        "iPhone",
        "Instagram",
        "RAM",
        "August 20th"
    ],
    "transcript_entity_types": [
        "DATE",
        "MONEY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "NORP",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "EVENT",
        "ORG",
        "MONEY",
        "DATE",
        "MONEY",
        "MONEY",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "DATE"
    ]
}