{
    "id": "WbGaqJehEHw",
    "title": "LG G7 - The Phone I WANT to Love",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-05-02T14:00:08Z",
    "video_url": "https://www.youtube.com/watch?v=WbGaqJehEHw",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "LG G7",
        "vs",
        "camera",
        "AI",
        "ThinQ",
        "best phone",
        "best smartphone",
        "Samsung S9",
        "galaxy",
        "P20",
        "P20 pro",
        "samsung s9+",
        "pixel 2 XL",
        "pixel 2",
        "LG G6",
        "battery life",
        "speed test",
        "battery test"
    ],
    "views": 375122,
    "likes": 10686,
    "comments_count": 1015,
    "description": "LG G7 ThinQ review is coming but here are some early thoughts on the device. It has some of the best smartphone hardware in 2018 but the notch feels unnecessary to me.  LG G6+ on sale -   With a Snapdragon 845, a stunning 6.1\" QHD LCD screen, dual camera system with a wide angle lens, 3000 mAH battery, Boombox speakers and a high quality Quad DAC, the LG G7 delivers one of the best phone expereinces on the market in 2018.  Music Credits: Fili - Sunday Vibes  Photoshop Screen: Mikhail Sharov - Neon Nights (Need for Speed)  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2rfwrOt",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going, Dave 2D here. So the LG G7 was just announced and I was able to use this phone at a media event so I thought i'd give some just kind of early impressions on this phone But before I get into that I want to talk about the whole phone line as a whole I Have this love/hate relationship with LG's phones the very first Android phone I ever purchased was the G4 I absolutely loved that phone until it started boot looping and Even the refurb unit that I got to replace it also boot looped the G5 didn't love very much the G6 was also a great phone But this G7 was rumored or even reported to have been discontinued at the beginning of the year there were like Reports of this thing just being straight-up axed from LG's lineup, but here We are in mid 2018 and it's finally here now. This phone is gonna. Be really divisive because of one main feature It's the notch and I would even call it a feature It's like a physical characteristic some people hate it Some people are tolerant of it and maybe a small percentage of people like it, but the fact remains It's a notch and aesthetically speaking I much prefer devices that don't have notches There's a lot of phone companies out there that actually take advantage of the notch like the iPhone 10 it Requires a notch because there's just no bezel around the bottom and the top But on this phone the G7 does have a bottom bezel, and there's a bit of a top bezel So I feel like the notch wasn't entirely necessary it almost feels like they put this in just for aesthetics like they somehow thought that This would look good with a notch, Which I personally don't find that it does. So here's the thing there's a lot of Chinese phone manufacturers out there that put a notch on their 2018 phones Just so it could look like the iPhone 10 And I kind of get it for them because they don't have like design teams really and they just kind of go with whatever they Think is working out there, but not for LG. I don't think they needed to do it like LG's good with innovation They're really strong with innovation Why they like why are they doing this it bugs me that leads there, so yeah right off the bat? I don't like this notch, but the good thing is you can kind of hide it with their software So they have this feature in settings where you can basically turn the whole top of the screen black And it essentially masks the notch now in order for this to work That black has to look really black and fortunately it does because the screen is incredibly good It's a hundred percent DCI-P3 color gamut A thousand nits It's a very nice image the blacks look Super inky and the colors are really vibrant as well to the point where I thought it was an OLED panel But it is an LCD screen, so you don't have issues like OLED burn in It's definitely a nicer looking screen than the LG G6 I'd say it's very similar in appearance to the [Galaxy] S9 screen It's really nice, and it's also a 1440p panel the speaker is loud like really loud They claimed 10 times louder than some of the competitors, and I don't know where they're coming with that number, but it is loud It's using some resonance chamber designs, so it's supposed to amp up the bass levels and because it's an LG flagship They're sticking their quad DAC in here so if you're an audiophile you're gonna Love the headphone jack and that improved audio quality coming from that jack So they also have an assistant button on the side, and this actually launches the Google assistant You can't remap it, but you can turn it off It's kind of like how Samsung has their Bixby button But this launches a Google assistant. The camera uses two lenses again with one of them being a wide-angle lens And I've said this before in my previous videos But I absolutely love phones with wide-angle camera lenses as the secondary lens they're just much prefer a wide-angle Over a zoom Now I haven't spent enough time with this camera to give detailed opinions on it but it does have this AI feature where the camera tries to analyze the scene that you're looking at and then it will adjust the Camera settings to best optimize a shot. Now, It's very early stages of the software I wasn't able to test this camera thoroughly But the idea of it is pretty neat the other features in this phone like Snapdragon 845 IP68 waterproofing It's all gonna be very 2018 flagship feeling with your fingerprint sensor on the back and an iris scanner the batteries at 3000 milliamp hours is not particularly big But because the screen uses I think like 30% less energy than the previous version. I think that's pretty cool The battery life should be good But just don't expect it to be amazing or anything like that so early impressions of this phone the hardware is great It is an LG flagship, but they're always like pretty good with hardware. It's got some unique features I've really liked the LCD screen on it. It's probably the best LCD screen on the market It's got the wide-angle lens and really good audio quality from the DAC These are features that are relatively unique to the LG flagships now the notch is something that I feel like they could have done without I don't feel like it adds a lot to this phone But it is what it is the G7 has a notch now the most important thing about this phone Is this price tag and right now at the time of this video and at the media event they didn't reveal its final price So I can't really like give recommendations, but I will say this: the technology is good on this phone The hardware is good, and if it's priced well, I think it's a good option. Okay. Hope you guys enjoyed this video thumbs if you liked it, Subs if you loved it. See you guys next time",
    "transcript_keywords": [
        "phone",
        "notch",
        "good",
        "LCD screen",
        "screen",
        "Android phone",
        "absolutely love phones",
        "camera",
        "Dave",
        "kind",
        "phones",
        "Chinese phone manufacturers",
        "Chinese phone",
        "love phones",
        "feature",
        "love",
        "Google assistant",
        "LCD",
        "thing",
        "features"
    ],
    "transcript_entity_values": [
        "AI",
        "Bixby",
        "Dave",
        "G6",
        "3000 milliamp hours",
        "LCD",
        "one",
        "Samsung",
        "G5",
        "jack",
        "the beginning of the year",
        "Google",
        "DCI-P3",
        "2018",
        "G7",
        "two",
        "thousand",
        "mid 2018",
        "30%",
        "10",
        "OLED",
        "a hundred percent",
        "G4",
        "Chinese",
        "LG",
        "Android"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "NORP",
        "ORG",
        "PERSON"
    ]
}