{
    "id": "wbsxfgwtYoQ",
    "title": "MrMobile's Massive Thank-You Giveaway!",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-04-27T18:00:26Z",
    "video_url": "https://www.youtube.com/watch?v=wbsxfgwtYoQ",
    "category": "Science & Technology",
    "tags": [
        "giveaway iphone 7",
        "giveaway phones 2017",
        "giveaway tech",
        "giveaway 2017",
        "mrmobile",
        "mobile nations",
        "galaxy s8 giveaway",
        "lg g6 giveaway",
        "moto z giveaway",
        "leeco giveaway"
    ],
    "views": 139142,
    "likes": 13004,
    "comments_count": 3458,
    "description": "[UPDATE] Submissions now closed. Thanks for participating! Keep an eye on your inbox!  Set off the fireworks, mobile friends! MrMobile just hit the 100-video mark, and after less than a year weve also snagged some 350,000 subscribers! I thought those were milestones worth celebrating, so I wrote some of the biggest and best tech companies in the world to ask if theyd like to offer some prizes to the people who made it all possible (psst: thats you!). To my surprise and delight, most of them agreed ... and now youve got the chance to choose from over $10,000 in prizes! Everything from smartphones to tablets to mobile accessories to a 4K TV is on the table, so lets see how you can win some of it!   [SUBSCRIBE]  It's not required to win a prize, but I sure do appreciate every subscriber I get. Help me hit a million subs before 2017 is out!    [WHAT YOU HAVE TO DO]  Leave a relevant, positive comment on another tech YouTubers video, and send the screenshot of your comment to  mrmobilecontests@mobilenations.com. Then go to  click the \"Say Something Nice\" button in the widget, and enter the email address you used to send us the screenshot. ***You cannot win if you dont do this!***   [GET MORE CHANCES TO WIN]  That same widget at  has a whole boatload of options to give yourself more chances to win, so check it out!   [FOLLOW ME ON SOCIAL]  Also not required, but appreciated:         [WHATS UP FOR THE TAKING]  Check out the full list of giveaway tech at     [SPONSORS]  The MrMobile 100-Video Thank You Giveaway was made possible by the generosity of the below-listed companies. Please join me in thanking them!  Anker  AT&T  BlackBerry Mobile  eeco  Honor  Huawei  LeEco  Lenovo  LG  LDWest  Mobile Nations  Motorola  OnePlus  Plantronics  Samsung  SCOTTeVEST  Sennheiser   [RELATED LINKS: ANKER POWER PACKS]  PowerCore Fusion:  PowerCore Speed 10000:  PowerCore II 20000:  PowerCore 26800:  PowerLine II Dura:    [GOOD LUCK!]  Thanks also to everyone participating in the MrMobile 100-Video Thank You Giveaway! MrMobile would be nothing without your constant support, so I hope you enjoy this opportunity to spread some love, spread the word of MrMobile, and hopefully win some awesome technology! Best of luck!   [TERMS AND CONDITIONS]  The MrMobile 100-Video Thank You Giveaway opens for submissions Thursday April 27th and closes Thursday May 4th. No entries will be accepted after 11:59pm Eastern Time on May 4th. Winners will be contacted beginning May 5th.  This is a global giveaway, with the exception of specific items which can only be shipped to the U.S.  Winners will be selected randomly and notified via email. Once notified, winners will have 24 hours to reply with a choice of prize from the remaining available items on the giveaway inventory list. If a reply is not received within 24 hours, prize will be forfeit and another winner will be selected.  One prize per winning entrant. Winners will continue to be selected until the giveaway pile is empty.  No purchase necessary. Void where prohibited. Neither MrMobile nor Mobile Nations are liable for losses or damage due to shipping. Mobile Nations employees, contractors and partners ineligible for awards. Legalese sucks the fun out of everything. Stay Mobile, My Friends.",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://www.mrmobile.tech/contests,",
        "http://www.mrmobile.tech/contests",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mrmobile.tech/contests",
        "http://amzn.to/2n0gA3e",
        "http://amzn.to/2mWXfig",
        "http://amzn.to/2nXtgc5",
        "http://amzn.to/2n0eLTT",
        "http://amzn.to/2objd2j"
    ],
    "transcript": "- [Narrator] This time last year, the Mr. Mobile YouTube page was just a place holder. The subscriber and video counts tied, at zero. Ten months later, 350,000 people have subscribed, and more than 28 million have tuned in. That's an awful lot of Michael Fisher talkin' about gadgets, none of which would have been possible without all of you. So to thank you for staying mobile, I've hit up all these companies for free stuff. And, they actually sent it! And all you have to do to qualify for your chance at a slice of it, is to say something nice. This is the Mr. Mobile 100th Video Thank You Giveaway. So, we all know the reputation that YouTube comments have. It's a cesspool, right? But from the beginning, I've been fortunate enough to have a comment section that's actually a kind of cool place to hang out. So, for my first ever giveaway, I want to spread the love. To qualify for your chance to win any one of these prizes, all you have to do is this. Leave a positive comment on another tech YouTuber's video. It can be any YouTube video that covers technology, and your comment needs to be positive and relevant to the video. So, a single thumbs up emoji, or a \"Good vid, fan\" is not gonna cut it. Instead, I'm looking for, \"Hey, cool review, I love \"the cinematography\", or \"Great job with \"the jokes, I LOL'd!\" And finally, I need to know you did it. So, screenshot the comment. Send it to this email address, and bam! You're entered to win. I'll start drawing winners seven days from the date of this video, and as I pick 'em, I'll send you an email. So keep and eye on your inbox. You'll have a limited time to reply, telling me which prize you want from the pile, before I move on to someone else. And of course, early folks will have the choicest pick of awards. - He won that, it's a major award. - [Narrator] What are all those awards? Well ... - Hold on to your butts. - [Narrator] Smartphones. A Galaxy S8, or Iphone7. An LGG 6, from LG, and one from AT&T. Two ONEPLUS 3T's, in midnight black. High end phones from Huawei, and Honor. A Moto Z Force, with Moto Mods. The new Blackberry Key1, a LeEco Pro3. Holy Momo, there's a lot of phones, here! Also, Samsung's newest tablet, the TabS3. Lenovo's crazy futuristic Yoga Books, one in Windows flavor, and one in Android. Bluetooth headphones from Sennheiser and Plantronics. LD West original holsters. Gadget pocket packed hear from SCOTTeVEST. Battery packs from Anker, and others. And finally, a 55 inch, 4K TV from LeEco. - Oh my God! - [Narrator] I know, it's a lot of stuff. I just want to make sure you're feeling sufficiently thanked. And I'm getting new submissions from giveaway partners literally every day. So, there might even be more hardware on the list, by the time you see this. If you want more chances to win, you can have them. Just go to the link in the description, and follow the directions for more entries. That's also where you'll find all the fine print. Like, yes, this is a global giveaway. Except for a few items that we can only ship to the US. - Just one more thing. - [Narrator] I'm not making it a requirement to subscribe to Mr. Mobile on YouTube to win. That's how you get bots, Pam. But, and here's where I get a little earnest with you, I am trying to hit a million subscribers by the end of 2017, and frankly that's looking like a stretch right now. So please, like they say on MST3K, keep circulating the videotapes. Share every video you can, and ask your friends to subscribe to Mr. Mobile, for more mobile tech video every week. Until next time, thanks for your support. Good luck! And stay mobile, my friends. (pop music)",
    "transcript_keywords": [
        "Mobile YouTube page",
        "Mobile",
        "video",
        "Michael Fisher talkin",
        "YouTube page",
        "place holder",
        "Michael Fisher",
        "video counts tied",
        "comment",
        "mobile tech video",
        "YouTube",
        "Giveaway",
        "win",
        "time",
        "Mobile YouTube",
        "year",
        "holder",
        "lot",
        "video counts",
        "page"
    ],
    "transcript_entity_values": [
        "Huawei",
        "seven days",
        "Lenovo",
        "Sennheiser",
        "Anker",
        "LD West",
        "Ten months later",
        "Samsung",
        "every week",
        "YouTuber",
        "last year",
        "YouTube",
        "Yoga Books",
        "million",
        "Mobile",
        "more than 28 million",
        "TabS3",
        "US",
        "first",
        "Moto Mods",
        "4",
        "midnight",
        "Plantronics",
        "55 inch",
        "Moto Z Force",
        "zero",
        "Mobile 100th Video",
        "350,000",
        "the end of 2017",
        "LG",
        "Mobile YouTube",
        "K TV",
        "every day",
        "Two",
        "MST3K",
        "Windows",
        "Blackberry Key1",
        "Michael Fisher",
        "one",
        "Android",
        "LeEco Pro3"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT"
    ]
}