{
    "id": "WDshQZc2xBA",
    "title": "These things are SICK. - SNT Q25 FPV RC Car",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-11-24T21:17:19Z",
    "video_url": "https://www.youtube.com/watch?v=WDshQZc2xBA",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "vr",
        "fpv",
        "pov",
        "rc",
        "rc car",
        "car",
        "racing",
        "race"
    ],
    "views": 360596,
    "likes": 16073,
    "comments_count": 428,
    "description": "Check out the Nexode 300w Charger plus a ton of other UGREEN products at  and save up to 50% for Black Friday!  The ShortCircuit shelf is a beautiful place full of gadgets that we may or may not make a video on, but when Linus saw these AliExpress FPV RC Cars, he had to try them out. With a 480P first-person view, will Linus be able to beat Bell in a race around the office?  Buy a SNT Q25 FPV RC Car on AliExpress:   Purchases made through some store links may provide some compensation to Linus Media Group.  Check out LTTstore's Black Friday deals at:   Want us to unbox something? Make a suggestion at    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Small car, big fun 0:55 Unboxing and controller/goggles/car walkthrough 4:21 Initial driving impressions 5:32 Sponsor - UGREEN 6:04 Setting up FPV goggles 6:59 First-person Racing vs Bell 9:47 Overall thoughts and outro",
    "description_links": [
        "https://lmg.gg/ugreennexode300w",
        "https://lmg.gg/KOlMF",
        "https://www.lttstore.com/collections/black-friday-cyber-monday-deals",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "Ages 14 plus, well, I'm out. Just kidding. I am so excited for this. Meet the Q25 Series 240Z FPV car. I saw this thing on the short circuit shelf and I went, how has this been here for so long? I wanna try it. It's a 1-100 scale RC car. So teeny, tiny little thing that not only can you rip around in your living room for up to an hour, they claim, on a single charge, but it also includes, look at this. It also includes a tiny first-person view camera. So it might not have all the software fanciness of something like Mario Kart Live Circuit, but still, being able to rip around and tease your cats from an inch above the floor sounds pretty awesome to me. And there's lots of really compelling features here. 30 degree smaller turning radius, full proportional steering control, and working signal lights. All this can be yours for just $136.99, or depending on the bundle you buy, as little as $70. Although that only comes with the car and doesn't include either the first-person view camera, the goggles, or even the RC controller. What you do get is stickers though. Overall packaging seems pretty good. You got a quick start guide that shows you how to link to the car, USB-C charging cable, a key chain. All right. That's not a bad value package. Included controller from Sniklo. Good brand, good RC brand, Sniklo. Or at least I hope it's a good RC brand because that's the brand that made this whole thing. On here, we've got trim for steering. We've got light controls. We've got a little YouTube icon, settings icon, as well as, interesting, you can increase or decrease the power output of the car. Not this power output. This is for charging the car off the controller, which is super handy. And then an on-off switch. It looks like there's some kind of contacts down here for charging this on a dock. A C2C adapter for that charger I showed you guys before. And what appears to be just an 18650. Oh, there it goes. Oh, no. We've got three AAAs. That'll give us a higher voltage. That makes sense. You can put an 18650 in it? I don't speak much Chinese, but I think I can understand 18650. That is so cool. Oh, and there's a little threaded majiggy so you can put a monitor on the top of it, should you so desire. Oh, yeah, that'd be great for first-person view if you don't wanna wear the goggles. Hmm, these might be the least exciting part of this so far. But it does have an integrated screen. It's not the kind that you have to put your phone in. And this is neat. They've got a micro SD card slot so you can record your races. All right. Some antennas and stuff. Of course, the real star of the show is the car. This is not a true first impressions because I've already spent a fair bit of time driving these around, and that's why I'm so excited about this video because it's so much fun. But I saved something for today, and that is this. The first-person view 480p camera. I have only experienced teasing my cats with it from way up here, like some kind of chump. Now it's time to get in on the action. The pairing process for the car and the controller is very simple. You press the settings button, and then there's a pairing button on the bottom of here. Theoretically, that should all be working right now. Okay. But seriously though, guys, how cool is all of that lighting? Whoa, whoa, whoa, whoa, whoa. Brake lights. Ah, brake lights. Turn signal. Left turn signal. That is so cool. Wait, wait, what about the headlights? Headlights. Oh, there they are. But wait, there's more. Underglow, huh, huh? Oh, I can change the color, baby. Oh, man. I like this way too much. I think I'll go with purple. And this is really cool. To attach the camera, you pop off this little panel up here that definitely won't get lost. And it's little pogo pins. Magnetic. Wow, pretty secure too, actually. That's not bad. So just to show you guys what's up. Ooh, hey, buddy. Woo! She's fast, by the way. I would actually recommend, by the way, depending on your flooring, turning the power down to one level below maximum. I found that it was a little bit easier to control. Otherwise, she just burns out right out of the gate, at least on my wooden floors at home. So let's turn power up. Woo! Actually, this floor, it's handling really well on. Ooh, that trim, not bad. So as long as you accelerate a little bit more slower-like, then you should be in good shape, yeah. They make some pretty bold claims with respect to the performance of the car. Talking about its high-powered motor, its torque amplification, patented steering, 0.2 meter composite worm gearbox. Honestly, it's really fun to drive. And this is as someone who has dabbled in RC over the years. I wouldn't mind a little bit more grip on the tires, but I do think that's something you could fairly easily DIY yourself a solution to. But that's not why we're here. What I really wanna talk about is the FPV experience, which we'll have to wait for this message from our sponsor. Thanks to Ugreen for sponsoring today's video. They have a bunch of stuff on sale for Black Friday, like their Nexode 300-watt charger, which is fully equipped with four USB-C ports and one USB-A port, allowing you to charge up to five devices at the same time. I'm talking your phone, your tablet, your AirPods, your other phone, and your MacBook. Speaking of MacBooks, Ugreen claims that it can charge the 16-inch MacBook Pro from zero to around 55% in 30 minutes. So check it and Ugreen's other products out at the link below and save up to 50% for Black Friday. We're in uncharted territory now. Link to goggles, matching steps. Turn on the car power. The FPV camera starts to work. Power on the QG2 FPV glasses. Oh, we're gonna need some antennas first, I think. Woo! There's a composite video output. So if you wanted to go to an external recorder, you could. The light position on the back of the camera corresponds to the frequency A, B, C, or D. Oh, okay. So we're A, 5865, 5.8 gigahertz. Cool. Short press the glasses to correspond to the frequency on the car. Will it transmit to both? Because it doesn't seem to be an encrypted signal of any sort. I think it's just broadcasting. Nothing would prevent both of us from being tuned into this. Are you feeling motion sick at all? No, I love VR. Well, that's you. I guess we just press record and then it records. Yep, red light's on. Warning, the RC car FPV footage contains some flashing. Photosensitive viewers, please be advised. I am so excited right now. This is just the kind of thing that you see as a kid and you're like, oh, that looks so much fun. If only I had so much money that I could afford it and actual friends who could also afford it, you know? It's very nostalgic. The camera is such a low resolution. It's like playing a home movie from the 90s. Right? I'm not expecting much in terms of range out of this thing, but who knows, maybe I'll be pleasantly surprised. Oh, ow, dang it. Wow, this is really low to the ground. I feel like I am going ripping fast right now. Whoa, don't do spins, don't do spins. Yo, Andrew, what's up? Whoa, you got some tape over there. I'm stuck on the cable cover. No, no, I got you, I got you, I got you. Boom! Oh, no, no, I'm really done. Bah! Oh, no. This footage is like a horror movie. Oh, no. Oh, wow. It's really scary behind the sets. Okay, do the headlights make a difference? Um, I'm gonna go with no. CPU pillow, lttstore.com. I'm going under the console. Ah, this is so cool. Where you at, bro? Hey, there you are. Here we go, ramming speed. Oh, I missed. Ah! Bumper cars. Boom! Boom! Boom! Got him. Wow, it is dirty under here. Does anybody clean this? Oh, got him! No! Hey, where's my bailout, Glenn? I got you, yeah. Hey, no, no, hey, hey, hey, hey, hey! Oh, no! Hamster! Boom! Ha, ha! Woo! Victory donuts! Let's go. Boom! Ha, ha, ha! You know, 480p, the camera quality is not bad. It's a little rough on bumpy surfaces. I will say that. But the traction, you get some quick turns. And you know what? The distance is surprisingly good. Yeah. The fact that we can be ripping around over in, like, the build corner and still see what we're doing. And the latency, we didn't even talk about that. Honestly, very usable. Let's go see the short circuit set. Oh, oh, oh, boy. Okay, I'm definitely getting some cutouts now. Oh, oh, she got out. I think. Oh, oh, oh, my controls are cutting out. Nevermind my video feed. Yeah. Oh, oh, I got the video feed back. Oh, oh. It's like controlling a Mars rover, you know? It's a distant planet. I'm coming back, I'm coming back. I've got enough. I've got enough video feed to come back. Come on, baby. 140 US dollars, that's a lot to spend on something that I have no way of guaranteeing the longevity of. But in terms of the sheer fun value, there's no denying that this thing is freaking awesome. So we'll have it linked down below. Don't forget to subscribe to Short Circuit. See you guys later.",
    "transcript_keywords": [
        "car",
        "hey",
        "camera",
        "Whoa",
        "FPV",
        "good",
        "Boom",
        "cool",
        "thing",
        "power",
        "video",
        "firstperson view",
        "firstperson view camera",
        "yeah",
        "short circuit",
        "back",
        "circuit",
        "Mario Kart Live",
        "FPV car",
        "car FPV"
    ],
    "transcript_entity_values": [
        "AirPods",
        "Ugreen",
        "Glenn",
        "C2C",
        "DIY",
        "as little as $70",
        "Yo",
        "three",
        "18650",
        "Nexode",
        "Andrew",
        "140 US dollars",
        "30 degree",
        "one",
        "USB",
        "RC",
        "MacBooks",
        "RC",
        "around 55%",
        "0.2 meter",
        "up to 50%",
        "Ugreen",
        "D.",
        "240Z",
        "Mario Kart Live Circuit",
        "up to an hour",
        "first",
        "Chinese",
        "1-100",
        "FPV",
        "up to five",
        "FPV",
        "just $136.99",
        "5.8 gigahertz",
        "Ages 14 plus",
        "the years",
        "Black Friday",
        "four",
        "Mars",
        "30 minutes",
        "Short Circuit",
        "MacBook Pro",
        "5865",
        "Sniklo",
        "SD",
        "the 90s",
        "YouTube",
        "MacBook",
        "CPU",
        "16-inch",
        "today",
        "zero",
        "300-watt"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "QUANTITY",
        "PERCENT",
        "GPE",
        "NORP",
        "PRODUCT",
        "ORG",
        "TIME",
        "ORDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "DATE",
        "DATE",
        "EVENT",
        "CARDINAL",
        "LOC",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "QUANTITY"
    ]
}