{
    "id": "wezt4-ut5tI",
    "title": "You Can Build This Smartphone",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2017-06-18T15:05:52Z",
    "video_url": "https://www.youtube.com/watch?v=wezt4-ut5tI",
    "category": "Science & Technology",
    "tags": [
        "smartphone",
        "diy",
        "fairphone 2",
        "modular",
        "test",
        "review",
        "android",
        "phone",
        "tech",
        "unboxing",
        "austin evans"
    ],
    "views": 2561593,
    "likes": 45069,
    "comments_count": 2877,
    "description": "A smartphone that can be built like a PC - the Fairphone 2 is a DIY tech dream...for some. Is this the World's Smallest Smartphone?  Fairphone 2:   Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "https://www.youtube.com/watch?v=6gW7UqHyPyY",
        "https://shop.fairphone.com/en/",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. This is the Fairphone 2 and it is a fully-modular smartphone. What's different about this is unlike something like the Essential or the Moto Z, which is more about adding things to your phone to get more functionality, with the Fairphone, say something like the screen breaks or the camera is outdated. The idea is that you can literally just pop the screen out and put a new one in without having to throw away your phone. Open this guy up and we see the Fairphone itself, which actually looks really cool. So the idea here is that you should be able to very, very easily swap parts out. So not only can we take out the battery, but there are actually a couple of tabs on the bottom. So if we flip these back, in theory, I've actually done this before, but we can just pop the screen right off. Seriously, I just unboxed the phone and took the screen out in like eight seconds. With the screen gone, we can get access to several other modules. So up top here, we have the headphone jack as well as the front-facing camera. We have the main camera module here, and we also have the speaker as well as the micro USB cable on the back. So what's cool about the Fairphone is that there are seven different modules that you can buy. And so say something breaks or you just want to upgrade it, you can pretty much buy all of them on the Fairphone site. This might be the first time that I've completely taken a phone apart before I've even finished the unboxing. So with just a couple of screws, we have the camera out of the phone. So what they're doing here is they actually have these little pins that are on the actual camera itself. And I assume that these are the same pins that go on all of the other different modules to connect things. So that, I believe, is the Fairphone fully broken-down. So this is what I believe they call the core module. So inside here is where you have stuff like the CPU, the radios, all that kind of stuff. But when you look at it like this, it's a cool package. Once everything is put back together, you'll find that not only does it support dual SIM cards, but also a microSD up to 64GB. So the thing with the Fairphone is, it's not a flagship. It's reasonably decently-specced, but don't expect too much. The real novelty here is the fact that you can really just take the whole thing, tear it apart, put it back together, and you have a working smartphone. And we are up and running. So, the first thing that jumps out to me about the fully-assembled Fairphone is that it's a little bit chunky. This is definitely not the most slim smartphone in the world. But of course, most smartphones are nowhere near this easy to get into, so you do have some tradeoffs. Inside, this is rocking specs straight out of 2014. So it's rocking a quad-core Snapdragon 801 processor with two gigabytes of RAM, as well as 32 gigabytes of storage. This isn't that bad, but when you take a look at the benchmarks, it's definitely well behind a more modern flagship. Keep in mind though that the Snapdragon 801 was super high-end in 2014. Yes, that might not mean a whole lot three years later, but this is still going to perform just as well, if not better, than a lot of budget phones today. To be fair, the screen is pretty decent. So it is a five-inch panel with a 1920 by 1080 resolution. It definitely won't shame any current flagships, but considering that most of the specs of this phone are from 2014, it's actually kind of similar to the HTC One M8 in that regard. Good, but definitely a couple of years behind the times. It also has a 2,420 milliamp hour battery. That's fairly small for a smartphone these days. Now, I get it that the Fairphone is definitely not meant to be a spec monster. The real benefit here is the fact that it's modular. But, you're definitely giving up a fair few specs to get there. - [Ken] (chuckling), fair few specs. - Eeeeey! (laughing) This guy's also rocking an eight megapixel camera. So if we line up Mr. Bolido here, it doesn't look bad. It might not be the most punchy image in the world, but again, 2014 specs are kind of a trend with this guy. We also have 1080p video. It looks decent, but again, the camera here is really nothing to be that impressed about. Most importantly, we have a super-high resolution two megapixel front-facing camera for that awesome selfie action. Okay, well that actually looks a little bit crunchy, but you can take it apart. The real advantage of using the Fairphone 2 though is absolutely that modularity. So it does bring it a lot closer to something like a PC. Say if some part goes down, you can just swap it out, or in theory, upgrade it with something better when it comes out. And the parts themselves are actually not that expensive. So say you break the screen and you wanna replace it, it's only going to cost you about $100. Even something like the camera module is only going to cost you about $40 to get a replacement. So it's not exactly like you're going to break the camera very easily, but one of the big draws of the Fairphone 2 is that in theory, as new and better things like cameras come out, it's going to be fairly simple to just throw a new one in your phone. And that's really where the idea of the Fairphone 2 starts making a lot more sense. So what's a decent phone today, instead of throwing it away in a year or two when you're ready to upgrade to your next phone, imagine instead where you throw in a new screen when something comes out, a better processor, bigger battery. All of that kind of stuff should in theory give you a lot more life out of the phone. Unfortunately all this relies on the idea that Fairphone is going to continue making modules and continue supporting the Fairphone 2. That's obviously their idea, but until more stuff comes out, it's a little bit of a risk. And that brings us around to one of the bigger downsides of the Fairphone 2. Now only is it only available in Europe right now, but it's pretty hard to get your hands on. Once you do, it's not going to come cheap. This guy runs about 530 Euros, which in American dollars is like, 600? Actually, let me do that translation real quick, I didn't even think about. - [Siri Automated Voice] The answer is $592.74. - I'm gonna pretend I knew that. That's pretty much in full flagship territory. While the phone is cool and there's a lot of advantages, it's hard to justify that kind of price for it. To be fair, a lot of people on Twitter are really curious about the idea of a modular smartphone. So, let me know in the comments below. What would it take for you to buy a modular smartphone, Fairphone or otherwise? Let me know in the comments below and I will catch you in the next one.",
    "transcript_keywords": [
        "Fairphone",
        "phone",
        "camera",
        "screen",
        "lot",
        "Austin",
        "smartphone",
        "idea",
        "camera module",
        "specs",
        "modules",
        "kind",
        "back",
        "cool",
        "guy",
        "module",
        "fair",
        "Fairphone site",
        "pop the screen",
        "real"
    ],
    "transcript_entity_values": [
        "Europe",
        "600",
        "Bolido",
        "1080",
        "first",
        "RAM",
        "about $100",
        "like eight seconds",
        "2014",
        "jack",
        "USB",
        "32 gigabytes",
        "Twitter",
        "Austin",
        "2,420 milliamp hour",
        "about $40",
        "two",
        "about 530 Euros",
        "HTC",
        "Snapdragon 801",
        "these days",
        "one",
        "64GB",
        "Fairphone",
        "American dollars",
        "CPU",
        "1080p",
        "microSD",
        "eight megapixel",
        "a year or",
        "the Fairphone 2",
        "three years later",
        "592.74",
        "a couple of years",
        "1920",
        "One",
        "seven",
        "today",
        "five-inch",
        "two gigabytes"
    ],
    "transcript_entity_types": [
        "LOC",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "MONEY",
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "EVENT",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY"
    ]
}