{
    "id": "wF3nhile788",
    "title": "This could change Facebook forever",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-03-08T22:21:53Z",
    "video_url": "https://www.youtube.com/watch?v=wF3nhile788",
    "category": "Science & Technology",
    "tags": [
        "facebook",
        "privacy",
        "facebook private",
        "zuckerberg",
        "messenger",
        "whatsapp",
        "mark zuckerberg",
        "encryption",
        "data",
        "security",
        "instagram",
        "cyber security",
        "protection",
        "facebook news",
        "news",
        "business news",
        "tech news",
        "breaking news",
        "facebook features",
        "facebook marketing",
        "social media",
        "how to facebook",
        "casey newton",
        "the interface",
        "delete facebook",
        "facebook ads",
        "latest news",
        "interview mark zuckerberg",
        "algorithm",
        "encrypt",
        "computer",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "apple",
        "google",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 177737,
    "likes": 4277,
    "comments_count": 376,
    "description": "Mark Zuckerbergs new plan to pivot Facebook privacy means investing most of its energy into groups and messaging products like Messenger, Instagram, and WhatsApp. It also means Facebook could face new challenges if its real: making revenue differently, regulation, and getting banned from countries like China and Russia.   Learn more about this story here:   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Listen to our podcasts:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2UmWe4K",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Last year, we found out that for the past three years, Facebook had been deleting the messages of Mark Zuckerberg and some other executives and in the controversy that followed, the company promised that it would then allow all of us to do exactly the same thing. Imagine my surprise this week, when Mark Zuckerberg announced that he was going to lean hard into privacy. It's a lot of talk. It was 3,200 words in a blog post that Zuckerberg wrote. To understand what it all means, we're going to have to look at the big picture. So what did Mark Zuckerberg actually say in his blog post? He said he wanted to bring end to end encryption to all of Facebook's messaging products. That means Facebook Messenger, WhatsApp and Instagram Direct. One of the things that he says in his blog post is that encryption limits services like ours from seeing the content flowing through them and makes it much harder for anyone else to access your information. And once your messages are end to end encrypted, that means that no one from Facebook or the government will ever be able to understand the contents of your messages. The second major thing that was in the blog post was the idea that your messages should no longer be permanent. Zuckerberg speculated that in the future, your messages on Facebook would disappear by default, after a certain period of time. You could choose to keep them if you wanted to but just like on Snapchat, how messages disappear when you read them, if you wanted your Facebook to feel like that, all of a sudden, it could. So with those two ideas out there, Facebook says it is going to rally around privacy in a way that it never has before. If you've read a story about Facebook in the past year, chances are it was about a privacy scandal, whether it was Cambridge Analytica last spring or the biggest data breach in company history last fall. So when Zuckerberg says that privacy is now the most important thing to Facebook, a lot of people are skeptical. But let's say that you believe Zuckerberg, what would that mean for Facebook and the rest of us? Well, one of the things that he says is in the future, we're going to want the world to feel less like a town square and more like a living room, so less yelling in pubic, more talking to your friends. If that's true, it has a lot of big implications for Facebook. Number one, the news feed is no longer the most important part of the site. Think about what a big deal that is. The news feed is synonymous with Facebook. It's by far the biggest money making product at the company. If we're no longer looking at the news feed every day, Facebook is a much different business than it ever has been before. Today, Facebook makes it's money by effectively renting it's users attention to advertisers. In an encrypted messaging app, an advertiser can't see who you are or what you might be interested in, nearly as well as they used to be. Instead, Facebook wants to give businesses an opportunity to let us buy and sell things from within a Messenger or a WhatsApp. There's still a lot of details that need to be worked out. So, in a world where apps are encrypted, not only can advertisers not see into your messages, governments can't as well. If governments can't access the content of user's messages, they're going to have a lot to say about it. We've already seen countries like Vietnam and Russia pass laws requiring companies like Facebook to store any data that Facebook is collecting about their citizens locally, presumably so that they can more easily access that data. Facebook is now saying hey, our apps are gonna be encrypted, there's just not gonna be a lot for you to look into. And Zuckerberg speculates that Facebook is actually going to be banned in these countries. And then there's China. One of Mark Zuckerberg's biggest dreams over the years is that Facebook would become one of the few American companies to really be able to thrive in China. But now that the company is going to enable encrypted messaging, that seems impossible. So encryption has benefits. Advertisers can't target you, governments can't read what you're saying, there are some real drawbacks to conversation moving from the town square to the living room. It's going to be harder to know what people are saying about the politics inside their own country. We've already seen this in Brazil and India, two countries where WhatsApp is very popular. Misinformation has spread rapidly there, inside these closed groups and researchers have had a hard time keeping track of exactly what's being said. So one result of this encryption might be less visibility into the public discussion. It's trade-offs, all the way down. This all may come to nothing, but if it really happens, all of a sudden, Facebook is a very different company. When I say Facebook, you probably think news feed. In the future when I say Facebook, you might think a group text, you might think a small group that you're in and you might never visit the news feed at all. So how do we feel about the newer, more privacy friendly Facebook? Well, privacy has a lot of benefits. There are many of us out there who just wanna talk with our friends and our family and our co-workers, without worrying that whatever we're saying is going to come back to haunt us. The fact that Facebook is enabling a new way of doing that, is pretty exciting. At the same time, Mark Zuckerberg has a history of making grand pronouncements that never come true. Four years ago, he told us the news feed was gonna transform into video. Two years ago, he published a manifesto saying Facebook was going to build social infrastructure, whatever that means, and whether this new, private Facebook comes into being against some very long odds, is still anyone's guess. So what do you think, you all? Are you gonna be more likely to use Facebook once it's end to end encrypted anywhere? Let us know in the comments, and if you want to know way more about Facebook, did you know I write a daily newsletter about social networks and democracy? You can find it at theverge.com/interface.",
    "transcript_keywords": [
        "Facebook",
        "Mark Zuckerberg",
        "Zuckerberg",
        "Mark Zuckerberg announced",
        "Mark Zuckerberg biggest",
        "Mark",
        "messages",
        "lot",
        "end",
        "blog post",
        "Facebook Messenger",
        "privacy",
        "feed",
        "encrypted",
        "company",
        "blog",
        "post",
        "Facebook messaging",
        "years",
        "Facebook makes"
    ],
    "transcript_entity_values": [
        "Cambridge Analytica",
        "Brazil",
        "American",
        "Today",
        "this week",
        "one",
        "Four years ago",
        "Snapchat",
        "Instagram Direct",
        "last fall",
        "Mark Zuckerberg's",
        "Facebook",
        "the past three years",
        "the years",
        "daily",
        "Russia",
        "two",
        "the past year",
        "Last year",
        "Zuckerberg",
        "One",
        "Facebook",
        "3,200",
        "Facebook Messenger",
        "last spring",
        "India",
        "China",
        "WhatsApp",
        "second",
        "Mark Zuckerberg",
        "Two years ago",
        "Vietnam",
        "every day"
    ],
    "transcript_entity_types": [
        "PERSON",
        "GPE",
        "NORP",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "GPE",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "GPE",
        "GPE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "DATE",
        "GPE",
        "DATE"
    ]
}