{
    "id": "wfaehijVodQ",
    "title": "What's Inside a Clone Game Boy? | GB Boy Colour Teardown",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2016-09-06T15:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=wfaehijVodQ",
    "category": "Science & Technology",
    "tags": [
        "retro gaming",
        "video games",
        "Nintendo",
        "Game Boy Color",
        "Kong Feng",
        "GB Boy Colour",
        "teardown",
        "take apart",
        "electircal engineering",
        "LCD",
        "CPU",
        "RAM",
        "flash",
        "PCB",
        "This Does Not Compute"
    ],
    "views": 161834,
    "likes": 4221,
    "comments_count": 333,
    "description": "There are plenty of clone game consoles out there, meant to play your retro video games. Some may even look like the real thing. But what's inside?  -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by jimmysquare ( and Soulless ( Intro music by BoxCat Games (",
    "description_links": [
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "https://soundcloud.com/jimmysquare)",
        "https://soundcloud.com/element-42).",
        "http://www.box-cat.com)."
    ],
    "transcript": "Hey everyone, it's Colin. How's it goin'? The Kong Feng GB Boy Color is an interesting clone console, but considering advancements in technology over the years, it should be pretty simple inside. Or... is it? Let's tear it down and find out. [ Music - Intro ] Disassembly is pretty straightforward. Strangely, two of the screws are Gamebit, and the rest are normal Phillips. Perhaps a recap on this console is in order. It's a handheld that plays games from both the Game Boy and Game Boy Color, but also has a selection of Game Boy games built-in. Be sure to check out my review of this console for more details on what it *can* and *can't* do, and some of the compromises it makes. Be careful when lifting off the back cover because it's connected to the front by a couple of wires. These are for a microswitch located in the cartridge bay, which closes when a game is inserted. It's how this system knows whether to play the game off the cart, or load up the built-in games. More on this in a bit. The main board shows a revision date of November 2014, but as we go through the system, we'll see some considerably older parts. Needless to say, this system was *not* designed recently. On the bottom-right corner of the board is the power supply section. A voltage regulator and some passive components are used to provide the five volts some parts in the system need. Fittingly, the three volt DC input jack is nearby, which on my handheld, was soldered on crooked. Directly above the cartridge slot is where most of the magic happens. This quad-flat pack chip labeled \"A84P011\" is the main processor, meant to be a clone of the CPU used in the Game Boy Color. It has a date code of mid-2008, but since there's no data sheet, it's hard to know when it was designed. The chip directly above is the LCD controller. It takes inputs from the CPU and routes its outputs to the front side of the board through a few vias. This is likely another custom chip, as its part number didn't come up with any data sheets either. To the right is a PT2308 audio amp. It's a Class AB type and drives the headphone jack and speaker at the bottom of the handheld. The left and right channnels take different paths on different sides of the board, which is an... \"interesting\" design decision. A question I get asked about the GB Boy a lot is whether the link port works. Now, I don't have a cable to test it, but it *is* connected to a few traces, so I suspect it works just fine. Finally, to the left of the CPU is a IC that surprised me: a Sony static RAM chip. It's strange to see name brand components in these clone consoles. But I'm also curious as to why the RAM wasn't just built-in to the CPU package. It makes me wonder if the CPU isn't a direct copy of the original, rather than having been reverse-engineered. There's less going on on the front side of the board. These rubber membranes are very common for buttons in lots of electronics. They work by shorting the two halves of each contact when the black pad presses on them. The LCD screen connects to the board right in the middle through a flat-flex cable connector. The bail on the connector flips up to release it. We'll take a closer look at the screen a little later. This daughterboard at the top is the most interesting part of the whole system. The traces from it lead directly to the cartridge connector, which means it's *actually* a flash cart. The controller chip on this module uses a packaging type called \"Chip-on-Board.\" It's where the bare silicon die of the chip is glued directly to the circuit board. A machine connects tiny lead wires to the die, then the whole thing is encapsulated in epoxy. This is cheaper than packaging the chip separately and soldering it to the board, and sometimes companies also use it as a security feature. The epoxy is almost impossible to remove without damaging the die, which can keep competitors from copying it. Next to the controller is the flash memory, an eight megabyte chip by Macronix. This is where all of the ROM files for those built-in games are stored. This flash cart is separate from the main board, likely for two reasons: First, so that it can be revised or modified separately, and second, so that it's modular for use in other clone consoles. Both of these reasons saves the company money during manufacturing. Finally, let's look at the LCD. It's made by TPO Displays, and it's actually just a general purpose backlit TFT module. While looking it up, I found references to it also being used in some multifunction printers. It has a resolution of 480x240 pixels, and supports millions of colors. The most common question I get asked about the GB Boy Color is if its screen can be used in a legit Game Boy Color. The answer is no, and here's why: This display has a 40 pin ribbon cable, whereas the Game Boy's display uses 50 pins. Yeah, someone might be able to design an adapter, but the other problem is that the two screens aren't the same size or shape. This backlit one is wider and shorter and doesn't fit in the Color's display cavity. Overall, I was a bit surprised by this console. I figured it would've been a single-chip solution doing everything through emulation. Some of the engineering is pretty creative though, especially how the built-in games are essentially a permanently installed flash cart. Dare I say it, but this handheld gained a little credibility with me. The GB Boy Color is *much closer* to a true hardware clone than I was expecting. If you like the video, I'd appreciate a thumbs-up, and be sure to subscribe if you haven't already. You can follow me on Twitter and Instagram at thisdoesnotcomp, and as always, thanks for watching.",
    "transcript_keywords": [
        "Game Boy Color",
        "Game Boy",
        "Boy Color",
        "Game Boy games",
        "Boy",
        "Boy games builtin",
        "Game Boy display",
        "Game",
        "Color",
        "builtin games",
        "board",
        "Boy games",
        "games",
        "legit Game Boy",
        "chip",
        "CPU",
        "Colin",
        "Kong Feng",
        "system",
        "builtin"
    ],
    "transcript_entity_values": [
        "the Game Boy and Game Boy Color",
        "Gamebit",
        "the years",
        "Sony",
        "two",
        "eight megabyte",
        "Instagram",
        "the Game Boy Color",
        "480x240",
        "Kong",
        "mid-2008",
        "50",
        "GB",
        "Color",
        "Phillips",
        "TPO Displays",
        "LCD",
        "jack",
        "CPU",
        "40",
        "RAM",
        "November 2014",
        "Game Boy",
        "millions",
        "Macronix",
        "DC",
        "TFT",
        "Colin",
        "Feng GB",
        "five volts",
        "Twitter",
        "First",
        "second",
        "Game Boy Color",
        "three"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "EVENT",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "ORDINAL",
        "ORDINAL",
        "WORK_OF_ART",
        "CARDINAL"
    ]
}