{
    "id": "WFF0hvpfkWE",
    "title": "✨NEW✨ Microsoft Surface Pro X! Review and Drawing Challenge!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-11-05T15:51:24Z",
    "video_url": "https://www.youtube.com/watch?v=WFF0hvpfkWE",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "microsoft surface pro x",
        "review",
        "drawing",
        "illustration",
        "unboxing"
    ],
    "views": 425252,
    "likes": 9881,
    "comments_count": 673,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Today, we're checking out the brand new Microsoft Pro X. This thing is incredible. I got a chance to check it out while I was in New York at that press event. But today, we have it in hand, and we're gonna unbox and take a look. Guess I'll open it now. (upbeat music) Great, let's open up the Surface. Here we go! Oh, I love that they give us a little illustration here of USB-C, USB-C, power, plug, smile. So this thing is really light. It's about 1.7 pounds and it's a 7.3 mm thin. What I love about the Surface is it is a two-in-one. So I can use it as a tablet, but I can also use it more in a traditional sense, as a laptop. Look at how shiny. Doesn't smell like anything, I'm very disappointed. Put it in the review! Does not have a smell. Oh, I'm gonna smudge this up so quickly. This really fits my room's aesthetic. (beep) What?! - [Man] Order's ready. - Postmates. So let's turn this on, and see what else is in the box. Ooh, I love instructions. (gasps) This is actually something that I do love. Here is a SIM card injector. One of the great things about this is you can get an LTE plan, so you can basically have the internet wherever you go. Which is very exciting because I have a card right here that will allow me to have LTE access. And we're not quite there yet so, don't let me lose this. I just hit myself in the head. That's what I get for being reckless. Here's something you guys have never seen me unbox before. A Microsoft Surface power cable. Oh. Are you asking me questions? - [Cortana] I'm Cortana, and I'm here to help. - She just sounds like someone that would be my friend. Like she either is a friend or somebody that would just sit around telling me what to do all day. - [Cortana] Just select the little microphone icon towards the bottom of your screen. - Shh, silence, silence, silence. Let's open up the Surface Pro X keyboard before we get this all set up. I'm so excited to see this little stylus that they have. It's a new slim version. Just fits perfectly into the keyboard, which is such a great idea. Not only does it fit nicely inside of the keyboard, it also charges there. Yes, look at this. Ooh yeah! Oh not this. This one has a smell. It smells a little bit like... It is like a ziplock bag or something, maybe. You've ever smelt a ziplock bag? (sniffs) I think that's what that smells like. And here it is, our little flattened stylus. Put you back in your home. Okay, let's get this connected. Wow, it's like magic. And this just folds right up just like that. And you can use it as a keyboard. It's asking me to insert a SIM card. Yes, I will. Looks like it is located somewhere in the back here. Getting it on a little mousepad so that I could be gentle with my new friend. Let's get our ejector. Oh, that was nice! If only it was that easy to get out SIM cards on phones. In you go. And that's that. (gasps) I'm connected, I'm connected! SIM card is in. Now, we're just gonna finish this setup, and we'll continue on with this video. (upbeat music) This is the Surface Pro X. It's the latest two-in-one to join the Surface family, and it has a starting price of $999. It has a new processor that was co-developed between Microsoft and Qualcomm. It was based off their Snapdragon 8cx. Microsoft claims that it has three times the performance of a MacBook Air, including all-day battery life of around 13 hours. It also has fast-charge capabilities so you can charge up to 80% in less than an hour. You can choose between eight or 16 gigs of RAM, and storage options are 128, 256, and 512 gigs. I got the Surface all set up, I have my pen connected, I've also got my Xbox Elite controller connected. Because one of the things that I do love about the Microsoft Surface is that I can also game on it. Now obviously, you can't do crazy processor intensive gaming. But my sister and I, we tried playing Sea of Thieves on a video on her channel, and it worked out really well. And that was on the laptop. And right now, I'm downloading a few games to test out. One of the things that I love so much about Xbox and Microsoft is there is a lot of games that you can also play on Windows 10 and on Xbox. So, I'm downloading a few games to test this out, but of course, this is a touch screen. And I've been doing some research about illustrating. Now I myself, am not an illustrator, I'm not an artist, as you have seen by some of my previous videos of my drawing attempts. Have you seen anything better? Didn't think so. So I have an incredible artist, Cory Basil, who has been in some of my videos previously and doing drawing tests on the iPad. I'm going to challenge him to test out the Surface and see what he thinks as far as drawing goes. Obviously the iPad has a lot more apps available for drawing. But one of the cool things that I'm looking forward to testing out is Adobe Fresco. Adobe Fresco isn't available yet on the Surface, but I'm looking forward to checking that out because they said that they are configuring it to work very well with the Surface. So right now, I'm going to pass this off to Cory to do a quick illustration and see what he thinks about it. So while he's drawing on that, I think that maybe Jen and I should do another drawing challenge. What do you think? Do you think we should? Yeah, probably. - [Man] Uh, yeah. (laughs) - All right, drawing challenge it is. (upbeat music) So, I'm here with my non-professional illustrator, Jenna. - Hi, that's my technical name. - That's your title. - Title, that's really great. - We're gonna be doing a non-dominant hand drawing challenge. So I'm left-handed. You think that you're better at drawing left-handed? - I don't know. So when I was unboxing my Surface, I was like, \"Oh, I don't know, \"I'm really bad at drawing, whatever,\" and then I just started writing with my left hand, and it was actually really good. - Wow. - So I was like, did it take the Surface Pro X, or did it take me 30 years to realize that maybe I have some left-handed talent that we haven't tapped yet. - Maybe, we can find that out today. So we're gonna do a, obviously, a drawing challenge again. This is gonna be so fun. I had so much fun the last time we did this. I couldn't believe what trash I wasn't drawing. It's totally shocking. Maybe I'm right-handed. - No, because I've seen you draw before and you're oddly artistic. I am garbage. So I'm like, well it can't be any worse, so why not use the other hand and see what happens. - Okay. - Okay so we're gonna have Tyler, who's behind the camera. - Yes. - He's gonna text us an animal. Should I go first? Do you wanna go first? - Should we need rock-paper-scissors for it? - Okay. - Okay. Ah! (laughs) - Oh my god, snip snip. - So wait, now that I cut you, I will choose for you to draw first. - Okay, don't peek. - Don't let me know, 'cause I will definitely look and I-- - You're a cheater. - I know. When we play UNO, keep your cards away from me. - Ah, what does that even look like. - Keep your cards away from my eyes. Um, a snake? Pie? Wait, that's not an animal. Anaconda? Shark? Whale? Dolphin? Tuna? Salmon? Wait, it's salmon? - It's salmon! - Ah! (laughs) - I was even gonna like, really get into it, and draw the colors. This is the sockeye salmon. - I love sockeyes, especially, specifically, Alaskan sockeye salmon. Have you ever had it? If you haven't, then you should try it. This review of the Surface Pro X, - This was gonna be the sockeye salmon. - Is incredible. - I'm gonna make it a little bit thicker. - Okay, so I think that I have guessed the fish. - Okay, that was incredible. - I can't believe I guessed it. - I don't even get to draw like the gills, or like the other little-- - Wait a minute. - This is sockeye salmon. - Why is it green? - They're red and green. The Pacific salmon, I believe they're more like the silvery color. - Okay, wait a minute we need to look up what the Alaskan sockeye looks like, because I-- - I didn't say Alaskan. - Oh. - I said sockeye. - Okay. - Didn't say Alaskan. - You didn't. But I prefer the Alaskan salmon. - Oh gosh, undo. - Wow, there are a lot of salmon species. - See, do you see the red one that I was trying to draw? - Yes, I do. - Well, I guess I didn't really get to the red yet. - I normally just see the salmon on my plate. And yes, I know it's pronounced salmon, but I think it's so funny when people are like, \"Oh, I'm gonna have the salmon.\" - But they've got a little bit of green in them. - Yes. - See the sockeye, he's got green. - This is interesting. - He's like Christmas, ready to go. Okay well, that was not my best work. I was trying to give him a green face. - All right, well I guess it's my turn now. - Okay. When you have the keyboard attached, but you have it in this layout, and you go to type, you can write and it'll automatically just put it as text. - That's cool. - See, Jenna, Jenna, Jenna! - So I just typed that, and then it showed up right here. - Yeah, fun for all. - And hit save. That is really fun for all. All right, well now I'm gonna delete your masterpiece. I'm super sorry. Okay, we're gonna do something-- - A polar bear! - I didn't even freaking do anything yet. (laughing) - Okay. - A tiger. - I have not even stuck the stylus to the-- - It's a Slim Surface Pen. - Slim Surface Pen. But it's a stylus. - A snail. - Does this look like a snail to you? - (laughs) No. - I mean, let's be real. - You're using your left hand! Cheater! - Uh, all right. Let's start over. - This monster's already trying to cheat. I knew it, I knew it! - I forgot. - Okay. - Like I'm drawing the same exact thing that I just drew. - Doesn't matter. You have to play by the rules. A sign. - I almost fell off the chair. Do you know what it is? - Does it look like I know what that is? Is that a G? - Yes. - A G? - Okay, so I guess you're not getting it. Um, I'll start over. They will know. - A guinea pig? - No, they'll know when they-- - Now I feel dumb. - No, it's okay. - Panda? - Yup. - Bear. - It was the panda Pixel phone. - I didn't like what you said to me. (laughing) - All right, well let me just finish my drawing now. - The Pixel phone? - Well, because it has-- - Why would that be a panda? - It's the panda color. I could've just done this huh? Does that look like a panda? - It looks like a lemur (laughs). - You're so mean to me. - Did the panda melt? (laughing) - Yeah, this is the hairdryer. He's getting melted. Should I delete my YouTube channel now, or should I delete it later? Let me sign it. - It's not bad. You should've stopped with just the ears and the circle. - So this is weird because I feel extremely confident with my right hand. All right Jenna, well thank you so much for hanging out with me here. Now let's see what Cory's been working on. - Can't be anything worse than this. - So I'm back here with Cory. He's been working on an illustration here on the Surface Pro X. Hello. - Hey, how are ya? - I'm doing very well. - Good, good. - So, Jenna and I were up here trying to draw, and obviously, it's not something that either one of us are good at. But Cory, you're an illustrator, a painter, you've actually painted this for me, I commissioned this a while ago. - I did. - More on that later. I'm working on a really fun office tour video, so stay tuned. Well, we're talking today about the Surface Pro X. Obviously you do so much digital illustration on your iPad, so this is all new for you. - Yeah, very first time using this. You handed it to me, I don't know, three hours ago, and said, \"Here, have at it.\" I've never used the software, never used the pens or the Surface, and I gotta say I'm pretty into it. I didn't think I would be. I wanted to be, but I didn't think it was gonna happen that I would be like, \"Yeah, I'll stick to the iPad.\" But it was actually very exciting because there are things that I really like about this that are different from the iPad. I really like the pencil. Are we calling this a pencil? - I mean it's a Surface pen. - I think I'm used to calling it a pencil. - This is the newest one and-- - I think that's the style that I tried once on the Surface X? - The Surface Studio. - Surface Studio, yeah. And the thing of the bothered me kind of about this was this maneuvering tip felt, I'm not a big ballpoint pen artist. I do from time to time, but this felt very ballpoint pen. So then, I do a lot of work that's pastel and pencil oriented, and it just didn't feel right to me with that bouncy. I'm sure some artists do prefer this. This falls right in line with the Apple Pencil and that made the transition a little bit smoother for me I think, than these old style. - This is interesting. So this is the old, old, old style. This is the old new style. And then this is the new slim version. So that is interesting as it is a lot more like the Apple Pencil. - There is an eraser on the back of this, which is pretty fun and cool. A lot of times I like to take a screenshot mid process to either save for posting later, or just for reference so I can jump back to it, and trying to figure out how to get a screen grab on this since I've never used the Surface before. - I'm sorry, I should've told you. - Yeah. - You figured it out. - But I needed to just double click this, and it popped up. - That's cool. - Another cool feature. One of the things that I found out mid drawing that I thought was really cool, something that I didn't think I'd ever care about, the size is different than the iPad Pro. And it's really cool 'cause it feels more cinematic, it feels more 16-by-nine. It also feels more old-school sketchbook to me. - Oh cool. - I used to have the wire sketchbooks, and I'll flip it, and I'll hold it in my lap like this and draw, and I found myself doing that, like I used to draw. So I would be tucked in like this drawing and then I realize it was the size was different, and it's long enough to kind of, hit inside of there, anyway. - I drew a panda bear and then there's like a fish here. Does that have any reference to something that Jenna and I tried to a draw earlier? - I just heard something about a panda bear and a sockeye salmon, (laughing) and so naturally my imagination took over and thought, \"What could I do with that?\" I'm still working on it. - This is ridiculous though. I mean, I handed you this thing, you've never even touched it before, never even heard of this app, and you managed to draw this. Like this is so cool. Is that yoga mat? - Yeah, so the story is, he was on his way to yoga, he was doing so good, he had his routine down, but he was sidetracked by a bowl full of sockeyed salmon. I wasn't too familiar with Surface and what it has to offer for artists. Did a small bit of research, but decided to just jump in on concepts and give it a try. So if you have any recommendations for drawing apps. - Obviously, I mean you can download these same apps on any other Surface products. So, what I'm interested in is if any of you guys have ever used any drawing apps because I don't know. I really have no idea. And I think this was the one that a few people had recommended. So if there's anything else that you guys have tried out, let us know. Jenna and I were just using the Microsoft Whiteboard that's like built into it. We also were using Paint. - A little bit more work to do on this. The bowl is supposed to be full of fish bones because he's full. - Well, you can work on the fish. - Cool. I'll wrap it up. - And I will show you guys the completed image right after this. (upbeat music) So I wanted to test out the gaming, so I went into the Microsoft Store and found one of the top free games, and it's called Asphalt 8. I personally have not played it yet, but in the description, it said, \"350 million players can't be wrong,\" and then Tyler said, \"Well yeah, \"of course I've played Asphalt 8.\" I have not. So this is gonna be my first time. I'm now 350 million plus one. But the best part is I can hook up an Xbox controller. I'm using the new Elite controller. I guess I'm driving now. I'm an Asphalt 8 player. Oh my god, I'm incredibly talented. The drift is so sick. I've crashed my car again. Oh my gosh, am I gonna come in first? Am I gonna pass up this idiot, to be a champion of Asphalt 8? There's a really good chance. Did I hit him? I did. I'm so incredibly talented. 350 million players are absolutely not wrong. I can't believe how much fun I have been playing this game. I'm even more excited because I'm in first place right now. Look that's me, you. That's me, not you. That's me. Never forget. Hope you guys enjoyed this first look at the new Microsoft Surface Pro X. So far, I'm a huge fan. I absolutely love the new pen style. I love the fact that this thing is super thin, super light. Let me know what you guys think in the comments below, and let me know if there's anything else you guys would like me to check out here on my channel. And don't forget to subscribe, and I will see you guys in my next video. Bye! (upbeat music)",
    "transcript_keywords": [
        "Surface",
        "Surface Pro",
        "Microsoft Surface Pro",
        "Microsoft Surface",
        "drawing",
        "Surface Pen",
        "Salmon",
        "Slim Surface Pen",
        "Pro",
        "Microsoft",
        "Microsoft Surface power",
        "yeah",
        "Surface Studio",
        "Jenna",
        "sockeye salmon",
        "Slim Surface",
        "draw",
        "cool",
        "love",
        "sockeye"
    ],
    "transcript_entity_values": [
        "The Surface Studio",
        "Surface",
        "all day",
        "about 1.7 pounds",
        "a minute",
        "Xbox Elite",
        "one",
        "iPad",
        "SIM",
        "New York",
        "USB-C",
        "three hours ago",
        "350 million",
        "Microsoft Surface Pro X.",
        "256",
        "LTE",
        "the Surface Pro X",
        "Windows 10",
        "Surface",
        "Adobe Fresco",
        "three",
        "16",
        "16-by-nine",
        "the Microsoft Store",
        "between eight",
        "a Slim Surface Pen",
        "Microsoft Surface",
        "the Apple Pencil",
        "YouTube",
        "the Surface Pro X. Hello",
        "less than an hour",
        "Xbox",
        "the Surface Pro X.",
        "UNO",
        "the iPad Pro",
        "Cory Basil",
        "Microsoft Pro X.",
        "the Microsoft Surface",
        "30 years",
        "Pacific",
        "the Surface Pro X",
        "999",
        "8",
        "all-day",
        "Jen",
        "Cortana",
        "Elite",
        "the Surface Pro X",
        "7.3 mm",
        "RAM",
        "Snapdragon",
        "today",
        "Surface",
        "two",
        "128",
        "Jenna",
        "Cory",
        "Microsoft",
        "MacBook Air",
        "Asphalt",
        "Tyler",
        "first",
        "Christmas",
        "Qualcomm",
        "up to 80%",
        "around 13 hours",
        "512",
        "Alaskan",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "DATE",
        "QUANTITY",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "EVENT",
        "PRODUCT",
        "LOC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "LAW",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "LOC",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "FAC",
        "QUANTITY",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERCENT",
        "TIME",
        "CARDINAL",
        "NORP",
        "CARDINAL"
    ]
}