{
    "id": "wG0YLaM5VuY",
    "title": "Plantronics BackBeat Pro 2: Noise Canceling, Economy-Style",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-10-26T19:43:54Z",
    "video_url": "https://www.youtube.com/watch?v=wG0YLaM5VuY",
    "category": "People & Blogs",
    "tags": [
        "backbeat pro 2 review",
        "plantronics backbeat pro 2 review",
        "plantronics backbeat pro review",
        "backbeat pro review",
        "backbeat pro vs bose",
        "backbeat pro 2 vs bose",
        "bose qc35 vs backbeat",
        "mrmobile",
        "michael fisher",
        "best bluetooth headphones",
        "best wireless headphones",
        "noise cancelling headphones",
        "noise canceling headphones",
        "bluetooth"
    ],
    "views": 203743,
    "likes": 3562,
    "comments_count": 227,
    "description": "What if I told you that the people who built headsets for NASA also built a Bluetooth headset with insane battery life  and priced it cheaper than those Bose monsters I love so much? Well I'm telling you now. The Plantronics BackBeat Pro 2 wireless headset is here, and it's on store shelves right now for under 200 smackers. Find out if it's worth your ears in MrMobile's BackBeat Pro 2 review!   [SUBSCRIBE]     [ABOUT THIS VIDEO]  MrMobile's Plantronics BackBeat Pro 2 review was produced after two weeks with a BackBeat Pro 2 review device on loan from Plantronics. The headset was tested with a Nextbit Robin, Nexus 6P and OnePlus 3 in environments ranging from the MrMobile studio to an Amtrak train to a trans-Pacific flight.    [PRODUCTS IN THIS VIDEO]  Plantronics BackBeat Pro 2:   Bose QC35:   Nextbit Robin:    [ADDITIONAL LINKS]  Plantronics BackBeat 2 Review [Booredatwork]:   Apollo 13 documentary footage [20th Century Time Machine]:    [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"Overflowing\" by Score Squad, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/35",
        "http://mrmobile.tech/36",
        "http://mrmobile.tech/37",
        "https://www.youtube.com/watch?v=HkpWcJCXegc",
        "https://www.youtube.com/watch?v=xcRCBvOOMyc",
        "http://www.premiumbeat.com/royalty_free_music/songs/overflowing",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] Not everyone wants to spend $350 on a pair of headphones, and no one wants to do it twice. Take it from me. So if Bose is too rich for your blood but you still want active noise cancelling and a relatively portable package, Plantronics might just have the set for you, so long as you can put up with a few compromises. I'm Michael Fisher and this is the Mr. Mobile review of the BackBeat PRO 2. Okay, so there's a lot going on with this set, both functionally and in appearance. These aren't my favorite headphones to gaze upon. Just on one hand, we've got stippled matte plastic, textured silver plastic, glossy black plastic that scratches really easily, and this fake wood grain that feels as artificial as it looks. Now, if you pay a little more, you can get the special edition set that's finished in silver and comes with a rigid carrying case. I didn't take a look at those, but my friend Enobong over at Booredatwork did. Check out his review if you want a slightly different take on these. But whether you get silver or earth tone, the BackBeat is big. Of the four headsets I have in the studio from different manufacturers, these definitely feel like the biggest. And the fact that they don't fully articulate means you need more space in your bag for 'em too. Fortunately, Plantronics has been in the audio business for a long time. They've built headsets that NASA used during the Apollo program, so it knows audio. The BackBeat PRO 2 has a nice even sound stage, neither drowning in base nor ever getting shrill. I had the opportunity to use them on a recent trip to China. That's 19 hours of flying, spaced across two airplanes. Basically, the best noise cancellation test ever. The active noise cancellation cuts out plane and train noise significantly. It isn't as good as the ANC Bose uses on the QC35s, but then nothing is. Plantronics has also thrown in something called open listening. Flip the switch and you can eavesdrop on your surroundings, or just turn off noise canceling to save some battery. That said, you won't need to. Plantronics says these are good for 24 hours and yeah, I got every bit of it. You can take these literally halfway around the world on a single charge, listening to them about 75% of the time without even hitting a low battery warning. It's seriously impressive. Finally, there are some familiar conveniences. If you don't wanna use Bluetooth, you can plug these in with a three and a half millimeter cable and you can take calls in the headset too. One caller said I sounded a little distant, but it didn't stop either of us from being clearly understood. Also, there's a dedicated mute button here, which I love. In music mode, pull the headphones off and your song will pause. Put 'em back on and it'll resume, most of the time. Same goes for the play, pause and skip side buttons. They work most of the time. My review sets, I had two of them, were kind of flake-y and these features didn't always work. Also, the headset tended to disconnect sort of randomly, so I assume there's something weird with the pre-release hardware or software I tested. These are the problems you wanna watch out for during your exchange period if you spring for an actual retail version. If you do, you'll get a somewhat clunky, slightly homely headset, but one with outstanding battery life and pretty okay noise cancellation and sound for a lot less money than what they pay up in business class. There's a lot of headphones in this video, folks, and I've reviewed most of them. Check 'em out at Mr. Mobile's YouTube channel and if you dug this video, go ahead and subscribe while you're at it. Till next time, thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "noise",
        "Plantronics",
        "BackBeat PRO",
        "noise cancellation",
        "time",
        "Michael Fisher",
        "headphones",
        "set",
        "Mobile",
        "active noise",
        "plastic",
        "BackBeat",
        "silver",
        "headset",
        "review",
        "PRO",
        "spend",
        "cancellation",
        "Bose",
        "pair"
    ],
    "transcript_entity_values": [
        "19 hours",
        "ANC",
        "BackBeat",
        "Michael Fisher",
        "Bose",
        "the BackBeat PRO 2",
        "YouTube",
        "four",
        "Bluetooth",
        "China",
        "Booredatwork",
        "Mobile",
        "Enobong",
        "One",
        "The BackBeat PRO 2",
        "NASA",
        "two",
        "350",
        "Plantronics",
        "three and a half millimeter",
        "about 75%",
        "Apollo",
        "24 hours"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "GPE",
        "GPE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "TIME"
    ]
}