{
    "id": "wGcYjiUBwXA",
    "title": "Galaxy Z Fold 2 review: an extravagant success",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-09-09T13:00:22Z",
    "video_url": "https://www.youtube.com/watch?v=wGcYjiUBwXA",
    "category": "Science & Technology",
    "tags": [
        "Galaxy z fold 2",
        "galaxy fold 2",
        "fold 2",
        "fold 2 review",
        "review",
        "galaxy z fold 2 review",
        "z fold 2",
        "samsung fold 2",
        "galaxy fold",
        "samsung galaxy fold",
        "samsung galaxy z fold 2",
        "samsung galaxy",
        "samsung",
        "galaxy",
        "new samsung phone",
        "samsung phone",
        "phone",
        "foldable phone",
        "foldable",
        "folding phone",
        "foldables",
        "folding",
        "dual screen",
        "android",
        "windows",
        "display",
        "apps",
        "videos",
        "youtube",
        "full screen",
        "camera",
        "galaxy s20",
        "price",
        "specs",
        "how to buy",
        "technology",
        "gadgets",
        "tech",
        "google",
        "dieter bohn",
        "verge",
        "the verge"
    ],
    "views": 725341,
    "likes": 11391,
    "comments_count": 1037,
    "description": "Samsung's back with the Galaxy Z Fold 2. Good news: no durability drama! It's well-made, fast, and feels sturdy. Bad news: it's still super expensive at $2,000 in the US. In this review, Dieter Bohn breaks down all the pros and cons to this little tablet phone thing.  Read the full review here:   If you buy something from a Verge link, Vox Media may earn a commission. Seeour ethics policy:   Order the Galaxy Z Fold 2 at Samsung:   0:00 Intro 0:40 What Samsung fixed 2:27 Screen 4:32 Jelly scroll 5:12 Outer display 6:00 Big screen experience 8:25 Samsungs system 10:00 Specs 10:45 Cameras 12:06 Outro  Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/2FgGFcn",
        "http://bit.ly/2TQsqjB",
        "https://bit.ly/2QGZCqW",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "(upbeat music) - This is the Galaxy Z Fold 2. Technically it's the third because the first was never really released and so the second fold became the first fold, which makes this attempt number three for Samsung's idea of making a phone that unfolds into a little tablet. It is 2000 bucks, which is way too much to pay for what you get out of this thing. But having said that, I gotta tell ya, I feel like the third time's the charm, because I'm a little bit charmed. (upbeat music) There are two ways to talk about the hardware on the Z Fold 2. The first is to just talk about all of the things that Samsung has fixed from the original fold. And that list is actually quite a lot longer than I would have guessed. The main display here is made out of glass now, the hinge is way better and the cover display on the outside is actually big enough to use. They're all huge improvements over the original. So for example, this hinge now has eight cams that make it a little bit stiffer. There's elastic brushes on the inside to keep the dirt out. Now, when you close it, there is still a little gap on the inside, but Samsung has added some little bits to make that gap feel smaller. They've moved the magnets around a little bit, so there's still a satisfying (flip sound) when you close it. The edges overall are just a little bit square, the bezels on the inside are a little bit smaller. The whole thing just feels a little bit more professional. The tolerances are tighter and everything has been refined to the point where it really feels like a well engineered product instead of being a little bit loosey goosey, like the original one. Those cams hold the screen in place at different angles too, so you get some extra functionality there. Now I can't promise that this is gonna be more durable than your original Galaxy Fold, but it sure does feel stronger. And Samsung will provide a onetime screen replacement for 149 bucks if you happen to break it. Now, the other way to talk about the hardware in the Z Fold 2 is to just point out that it's still a really unfamiliar object to carry around for most of us. When it's closed, it is this super thick and super heavy oblong stick, remote thing. I don't care what your pockets look like, or what pocket you put this in, you're gonna feel it. it's just a weird big object. But when it's open, you get this very good, very big 7.6 inch screen. And there's a lot to talk about this screen, but I just want to start with the downsides kind of quickly, because I don't know, I think they're just the realities of what a folding glass screen has to be like in 2020, because physics instead of being straight up errors on Samsung's part. So even though this is Samsung's ultra thin glass here, instead of plastic, it is still covered with a plastic screen protector, and technically I'm told that you can go to Samsung and have them take this screen protector off, but honestly having it on here is for the best, but that does mean that it we'll pick up little dings if you're nailed hits it and it does feel like a plastic screen. Now the screen is also surrounded by a fairly thin plastic rail that you can't feel on the edges. There's even two little nubbins here that keep this greens from clacking together when he closed it too hard. Finally, yes, there is a crease in the middle of the screen and you can see it and feel it when you rub your finger over it. If you're viewing the screen at an angle and the light hits it just right, it's visible enough to be a little bit annoying, but straight on the crease pretty much disappears, like notches or hole punches do on smartphone screens. You get used to it and eventually you almost forget that that crease is there. Now having said all that, I don't want you to get the wrong idea. I think the screen is very, very good. It's only about 372 pixels per inch or so, but that's more than enough to make those pixels disappear. More important to me is this corner right here. There is no longer a big huge cutout for a bunch of selfie cameras, there is just this one little hole punch for a single selfie camera, which means you get the full expanse of the screen to work with and to watch videos on. But the most important thing that Samsung has done to this screen is put in a dynamic refresh rate. It goes all the way down to 11 Hertz and save battery life or all the way up to a high refresh rate of 120 Hertz. And what higher refresh rate screens do is they make it feel more like you're physically moving the pixels and that's here on the fold too but the most important part of it is that it significantly improves a big problem that I had with the first fold and that's jelly scroll. Pretty much all smartphone screens have this little difference in how quickly the pixels update from one side to the other when you scroll. But usually you don't notice it because on most smartphones it happens vertically from the top to the bottom, but the fold needs to have its little bits to drive the screen on the side instead of on the bottom, so you see it more often when you're scrolling. However, switching to 120 Hertz refresh rate cuts that difference way, way down. So it's really hard to see that jelly scroll unless you're really looking for it. Samsung has eliminated the problem by switching to a higher refresh rate screen. Now this outer cover display, it's not as technically impressive, it doesn't have a high refresh rate, but that's not really a big deal. I am wildly happy that Samsung made it the full height of the fold, which makes the screen actually useful. It's still really narrow though, so it's hard to type on but if you just use it for those quick phone things that you do when you're out and about and on a waiting in line or something, it's fine, but for anything else, I ended up opening it up to get the big screen. And that's the point, right? To have this big screen, to do big screen stuff like gaming or watching movies or reading or multitasking. So let's just talk about the big screen experience on the Z Fold 2, because the way that I would characterize it is mixed. Alright good stuff for us this time, Samsung has gotten the message that it's little tablets should have a tablet layout. So you can go into the settings and select that layout for apps, which means it's slightly fewer apps have that big blown up phone app look on here, but really only some of them do it when you hold it normally vertically like this. For the rest of them, if you turn it 90 degrees, you do get that nice tablet layout with multiple panes or tabs, or two pages in the Kindle app, or the whole tablet deal. Plus having a bigger screen for games and video is very, very good. If you are not watching it full screen, I don't know if picture and picture doesn't cover your other work, reading PDFs and docs and other things that are annoying to do on your phone are really nice here. Plus just a few apps like Microsoft for example, do support drag and drop between apps and multiple pains, but you really shouldn't depend on it being there. Android has always the go. There's also this feature that Samsung calls flex mode, see because the hinge is strong enough to hold itself up at multiple angles, Samsung has made some software tricks to take advantage of it. So for example you can start a video on the outer screen, flip it up to view it like that, then you can flip it over to view it on the top of the middle screen, and then you can open it all the way up to watch it on the big screen. A few other apps do things in flex mode like Samsung's camera app, but really not enough apps support it for it to matter that much. But do you know how you always hear the Android apps are bad on tablets? Yeah. Here's Facebook all stretchy and weird. And here's Twitter also all stretchy and weird, and here's Instagram, it doesn't even have a tablet mode. Neither does Lightroom. The whole situation is a little bit better than it used to be with Android apps on tablets, but that's not saying much. Now Samsung has an option where you can like change the stretchiness of phone apps if you want to but really the fix is to use Samsung's windowing system to tile apps and split-screen, or even like a three up layout. You pull this little dock here out to the side, it's like a drawer and then you drag out the app icons to where you want them on the screen. It works really well. You can even drag apps out into the middle of the screen to make them into little popup windows, that can then reduce down into a bubble. You can swap apps around and the pains with these little bars, you can even save combos of apps that you use often together so you can just open up both apps with a single tap. There's a small problem with the system though, notice that I said you use Samsung's windowing system, not Google's. Android is dumb about multi window systems. All of this multi-tasking stuff is something that Samsung had to build itself on top of Android, and it does work pretty well, but you can also hell that it's like a layer above what the system understands. Plus Samsung system is completely different from how LG handles multi windows or how Microsoft does it with the Surface Duo. But different companies doing multitasking in different ways, really shouldn't bother you too much. But what should bother you is that the core stuff that the operating system should understand just doesn't work like saving your window state when you switch between screens, or putting app pairs that you've got tiled together into the multitasking screen, when you switched to multitasking it just goes back to being a single app because Android doesn't know that you can have two apps open at the same time. Now, if you're adept with Android and you understand all of these different operating system layers, it's actually not too bad, but you shouldn't have to be that good in Android to understand how all this works. And even in the best cases if you're a nerd like me and you get all those layers of UI, you still feel like you're constantly rearranging or relaunching things to get the layout that you want. But even after all of that, I still loved this big screen. I love typing on it, I love reading on it, I love watching movies on it (indistinct), I love looking at Google maps on it. Having a big screen is great and it almost makes the awkwardness of this shape totally worth it. (upbeat music) Okay, let's do the classic phone stuff. Specs. It is fast, it has enough RAM to handle multiple apps at once, it's got 12 gigs. There's 256 gigs of storage, but that's not expandable, but that's fine. Battery life is good, but not amazing. You'll get a day for sure. I'm getting a little over five hours of screen time, but it's a big screen. And I have been pushing it pretty hard. There is 5G and maybe in a couple of years, you'll be glad that it's there but right now it's hmm 5G I don't know. There are two speakers, and Samsung says that they can replace a Bluetooth speaker and no, but yeah, they get really loud and they do sound pretty good, but I do wish there was a little base. Cameras, don't buy this for the cameras. There is a 10 megapixel selfie camera on the inside and also on the front, and they feel a little bit after-thoughty. They're really not that great. The main camera system consists of three 12 megapixels sensors, wide ultra wide and telephoto, they're tuned in the way that Samsung photos get tuned, which means that they're a little bit overzealous with brightening things up, but you're not gonna get any fancy zoom stuff or 8K video or even if I'm really honest results that are quite as good as say a Galaxy S20. I mean, I'm getting slightly better photos out of Galaxy S20, here's a couple of comparisons. Low-light performance on the Z Fold 2 is good. And I think Samsung has actually figured out low-light which I'm glad. Samsung says that in flex mode here it can pan and zoom on you when you're recording video, but the actually neat trick on this phone though, is you can hit this button right here and then use the good 12 megapixel cameras to take a selfie of yourself. You know those annoying people who take tablet photos at concerts? Well now you could be the annoying person who takes tablets selfies, do it, don't be ashamed, they're great. (upbeat music) So that is the Galaxy Z Fold 2. Should you buy it? No, it's $2,000! Only buy it if you want like a luxury phone or you want an extravagant techie thing. But do keep an eye on it because now that it's on its second, well third iteration, Samsung has done what Samsung does, aggressively improve the hardware to the point where it's genuinely great and done a passable job with the software. If the cost can come down and I'm looking at you, Samsung, and if tablet apps and multitasking and that whole interface can get better and look at you Google, then the fourth or the fifth iteration of this phone is gonna be super popular, like replace the note popular. And I think Samsung knows it too. They've hinted at a future version of this phone that's gonna have stylus support. I wouldn't turn that down, but I would rather see a price drop. (hands clap) Scared the cat. Hey everybody thanks so much for watching. If you're wondering how the Z Fold 2 compares to the Microsoft Duo or even the weird LG Velvet thing, I've made a processor video of that. You can go check it out.",
    "transcript_keywords": [
        "Samsung",
        "screen",
        "big screen",
        "Fold",
        "apps",
        "big",
        "bit",
        "feel",
        "Samsung camera app",
        "Android",
        "phone",
        "good",
        "app",
        "Samsung windowing system",
        "system",
        "screens",
        "Android apps",
        "tablet",
        "Samsung windowing",
        "Galaxy"
    ],
    "transcript_entity_values": [
        "11",
        "number three",
        "Android",
        "fourth",
        "third",
        "the Surface Duo",
        "the Z Fold 2",
        "a little over five hours",
        "three",
        "Galaxy Z Fold 2",
        "Twitter",
        "LG",
        "a couple of years",
        "2000",
        "Lightroom",
        "Google",
        "eight",
        "8",
        "120",
        "5",
        "2020",
        "90 degrees",
        "the Microsoft Duo",
        "Hertz",
        "the Galaxy Z Fold 2",
        "Samsung",
        "UI",
        "two",
        "2,000",
        "three 12 megapixels",
        "Galaxy S20",
        "12",
        "256",
        "Facebook",
        "12 megapixel",
        "second",
        "10 megapixel",
        "Microsoft",
        "first",
        "149 bucks",
        "Instagram",
        "only about 372",
        "RAM",
        "7.6 inch",
        "fifth",
        "LG Velvet",
        "Kindle",
        "Galaxy Fold"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PRODUCT"
    ]
}