{
    "id": "WGXrMpeG794",
    "title": "You’d Never Guess This Was A Smartwatch: Garmin Vivomove Luxe Review",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-01-04T01:11:13Z",
    "video_url": "https://www.youtube.com/watch?v=WGXrMpeG794",
    "category": "Science & Technology",
    "tags": [
        "garmin vivomove style review",
        "garmin vivomove luxe review",
        "garmin vivomove review",
        "best hybrid smartwatch 2020",
        "best hybrid smartwatch 2019"
    ],
    "views": 569099,
    "likes": 10144,
    "comments_count": 538,
    "description": "2019 wasnt a banner year for the traditional smartwatch. The Apple Watch Series 5 is only a slight improvement over the Series 4; the same mostly goes for Samsungs Galaxy Watch Active 2; and Googles WearOS is still very inconsistent ... to say the least. But 2019 *was* the year that hybrid watches finally got interesting.   For me, that started with the Fossil Hybrid HR and its innovative e-ink display  and with the Vivomove series, Garmin has taken it to the next level with better looks, better displays  and, higher prices. So how much would you pay to keep your smartwatch's brains hidden? Find out in the MrMobile Garmin Vivomove Luxe / Vivomove Style Review!   [PRODUCTS IN THIS VIDEO]  Garmin Vivomove Luxe [Amazon affiliate link]:   Garmin Vivomove Style [Amazon affiliate link]:   Rode Wireless Go Microphone [Amazon affiliate link]:   DISCLOSURE: The affiliate links above afford Future / MrMobile a small commission if you make a purchase. See Future disclosure policy for more details:    [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S GARMIN VIVOMOVE LUXE REVIEW / VIVOMOVE STYLE REVIEW]  MrMobile's Garmin Vivomove Luxe Review / Garmin Vivomove Style Review was produced following three weeks with a Garmin Vivomove Luxe review sample and a Garmin Vivomove Style review sample provided by Garmin. Devices tested with a Google Pixel 4. MrMobile does not produce paid or sponsored reviews; no company featured in this video was offered copy approval, and no compensation was requested or provided in exchange for this coverage.    [SOCIALIZE]       #garmin #garminvivomoveluxe #garminvivomovestyle #smartwatch #wearabletech #wearables",
    "description_links": [
        "http://mrmobile.tech/1NQ",
        "http://mrmobile.tech/1NR",
        "http://mrmobile.tech/1NS",
        "https://www.mobilenations.com/external-links",
        "https://www.youtube.com/channel/UCSOp...",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech"
    ],
    "transcript": "- Does this look like a smartwatch to you? Okay, how about now? If what you wanted your wearable tech is something that doesn't look like tech, well the new Vivomove watches from Garmin might be perfect for your wrist. (upbeat electronic music) Now I want to start by putting things into context. 2019 was not a banner year for the smartwatch. The Apple Watch Series 5 is only a slight improvement over the Series 4. Same goes for Samsung Galaxy Watch Active2 and Google's Wear OS is still very inconsistent to say the least. But 2019 was the year hybrid watches finally got interesting. For me that started with the Fossil Hybrid HR and its innovative e-Ink display. And with the Vivomove series, Garmin has taken it to the next level with better looks, better displays and higher prices. You might not have expected watches like this from a company known for its chunky fitness trackers but the Vivomove's Style and Luxe are the latest examples of the companies embracing the fashion and luxury segment, a pivot that I first took note of with the MARQ Captain I spent way too much money on back in the summer. For the high-end Luxe, you can choose between six band styles and three stainless steel finishes, including 18 and 24 karat gold and the crystal is domed sapphire. The mid-range Vivomove Style steps that down to Gorilla Glass 3 and the casing to anodized aluminum but that's available in four finishes and with four band styles. Each is rated for five atmospheres of water resistance and each will work with both Android and iPhone. Now I've worn mostly the Luxe for the past two weeks and stay with me 'cause both these things are true. I've gotten both fewer compliments on it and more compliments on it from other people than with any other smartwatch. Fewer compliments because few people notice it. At first glance the Vivomove is just a minimalist wristwatch with nothing on its face except the analog hands. There aren't even any pushers on the sides. But give it a sharp double tap and the hands move aside to reveal dual color OLED screens. They shine right through the watch face. A neat trick. The crystal becomes a touchscreen and you just swipe through the interface like you would on a proper smartwatch. See, on hybrid smartwatches I'm used to seeing monochrome OLED like Withings or monochrome e-Ink like Fossil or even no screen at all. Having a color display with enough resolution to render icons, it really elevates the experience. Makes it something I'd want to spend money on. And in some cases the hands will play along with the graphics like in the stopwatch or the timer or the battery meter. We've seen this elsewhere but it's especially well done on the Vivomove. Speaking of battery like most hybrid smartwatches, these do quite well. Whereas an Apple or Wear OS watch typically needs charging every one or two nights, I was able to get four to five days out of each of these before plugging them in. Like most smartwatches, these come with proprietary chargers, so don't forget to pack them if you go on a long trip. But the fact that you only need to charge them once a week means if you go on a short trip, you'll be fine. And it also means you can use these to track your sleep. Sleep, of course, is a big factor in calculating your health. Yes, these watches do vibrate your wrists to deliver notifications from your phone but Garmin's focus on fitness tracking is front and center in the app. Now I like a lot of what the company does here but it's also where the experience starts to stumble a bit. First of all, Garmin gives you lots of data but for those of us who aren't used to granular fitness tracking, I think companies like Fitbit present the data with more helpful context. So to me Fitbit is more understandable. And some basic features are bugging. Move, yeah, you see that? I just, I've been moving. I've been standing, I've been moving this whole time and I just got to move. I'm moving. Thanks. And it regularly misdiagnosis a walk as a run. And no it's not because I'm that out of shape. Other quibbles, notifications don't really have enough space to spread out. The illusion of this face wide display is kind of shattered when you see the panel borders here. There also aren't enough icon types to help me tell whether my buddy is texting me or Facebooking or Slacking, etc. And double tapping doesn't always wake the screen consistently. I kind of wish Garmin just given us pushers like it does on its other watches. And the wrist buttons will always be easier than touchscreens for me. And manufacturers of every kind, please, when your product is low on battery, don't program that product to buzz me every 15 minutes to alert me of that fact, vibrating and lighting up and further depleting the already low charge. I understand, I'll charge it when I can. Thanks. I wanna to call out one bright point in Garmin software before we move on and that's called Body Battery. Basically, the watch takes data points like your heart rate, your activity, your sleep quality, your stress levels, boils that all down into this clever metaphor of a battery. Almost like you're a droid that needs regular charging. Stress and activity deplete your power level while rest restores it. This would be even better if it factored in food consumption, which it currently doesn't. I'm hoping Garmin expands it in the New Year but it's a great starting point to better understand your health. And I look forward to seeing where it goes. Also one nice thing for women, period tracking is here, which keeps the Vivomove competitive with other wearables like the Fitbit Versa 2. Now at the top of the video I noted higher prices. The least you can get away with paying for the Vivomove Style is 299 or 249 if you wanna ditch the color screen. For something like the Vivomove Luxe, you'll be paying almost $500 for the model I tested. If features are what you're after, you can pay less for literally every major smartwatch on the market or pay 195 for Fossil's Hybrid HR I reviewed last month. But for those who want a great looking hybrid or those who've bought into the Garmin ecosystem, these are hugely encouraging. The fact that they also serve up solid battery life and a clever display technology, that goes a long way toward easing the sting of the price tag. And it makes me more excited than ever for the next generation of Garmin MARQ luxury watches. Hey, speaking of that, I've been sitting on this $1,800 MARQ Captain for about six months now. So let me know in the comments or on my socials if you'd like to see a proper review. I'd love to make it if you tell me you'd love to watch it. Now, I bought that watch but this review was made possible by two Vivomove samples provided by Garmin. The company did not receive a copy of this review in advance, however, which means they're seeing it for the first time right alongside you. Please subscribe and share this review if that's the kind of video you'd like to see more of on YouTube. Until next time, thanks for watching and stay mobile my friends!",
    "transcript_keywords": [
        "Vivomove Style",
        "Vivomove",
        "Garmin",
        "Watch",
        "Vivomove Luxe",
        "Apple Watch Series",
        "midrange Vivomove Style",
        "Vivomove Style steps",
        "hybrid",
        "Vivomove series",
        "Fossil Hybrid",
        "Luxe",
        "Samsung Galaxy Watch",
        "battery",
        "watches",
        "year hybrid watches",
        "smartwatch",
        "Vivomove watches",
        "Style",
        "Garmin MARQ luxury"
    ],
    "transcript_entity_values": [
        "the summer",
        "First",
        "Garmin",
        "Vivomove Style",
        "24 karat",
        "195",
        "Facebooking or Slacking",
        "Body Battery",
        "Fitbit",
        "Vivomove",
        "1,800",
        "Vivomove",
        "Apple",
        "the year",
        "249",
        "every 15 minutes",
        "YouTube",
        "Vivomove",
        "four",
        "Luxe",
        "last month",
        "Withings",
        "Garmin MARQ",
        "almost $500",
        "first",
        "18",
        "Fitbit Versa 2",
        "five",
        "Google",
        "Samsung Galaxy Watch",
        "two",
        "the Series 4",
        "299",
        "MARQ",
        "about six months",
        "six",
        "2019",
        "the New Year",
        "the Vivomove Style",
        "The Apple Watch",
        "Luxe",
        "Wear OS",
        "the past two weeks",
        "the Vivomove Luxe",
        "three",
        "one",
        "Android",
        "four to five days"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "TIME",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE"
    ]
}