{
    "id": "Wi8BwUh3XOk",
    "title": "What the last Blockbuster has that Netflix doesn’t",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-08-29T14:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=Wi8BwUh3XOk",
    "category": "Science & Technology",
    "tags": [
        "blockbuster",
        "blockbuster video",
        "last blockbuster",
        "netflix",
        "hulu",
        "amazon prime video",
        "netflix movies",
        "streaming",
        "streaming tv",
        "video shop",
        "video store",
        "video",
        "algorithm",
        "watch movies",
        "movies",
        "tv",
        "dvd",
        "vhs",
        "movies on netflix",
        "netflix series",
        "hulu live tv",
        "amazon",
        "movies online",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "marques brownlee",
        "review",
        "verge",
        "the verge"
    ],
    "views": 5478753,
    "likes": 139514,
    "comments_count": 16179,
    "description": "Did you know the last Blockbuster in America is in Bend, Oregon? In 2004, the company went from over 9,000 locations worldwide to exactly one in America. But in this streaming age, is there anything we can learn from Blockbuster? We traveled to Oregon to find out.  Host: Bijan Stephen Producer/Director: Phil Esposito Producer/Audio: Andrew Marino Video: Becca Farsace Motion Graphics: Keegan Larwin Supervising Director: Tom Connors Design Director: William Joel Director of Audience Development: Ruben Salvadori Social Media Manager: Dilpreet Kainth  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- The way we watch and discover movies has changed. We have Netflix, Hulu and just about everything right at our fingertips. But like everything online, there's an algorithm telling us what it thinks we want to watch. - You know our personalization learns from what you watch, how long you watch it, how quickly do you go to the next episode. - And while that can be helpful, it also us restricts to watching the same kinds of movies. But there was a time before the algorithm, when your movie selection was based on spontaneity, and word of mouth. And for most of us that experience came from Blockbusters. - Nobody has the movie I want. - In 1994, Viacom acquired Blockbuster for 8.4 billion dollars. And by 2004, Blockbuster had over 9,000 stores across the world. Now in the U.S., there's only one. We went to Bend, Oregon to see what we lost when algorithms replaced human curation. And how a small town became home to the last Blockbuster in America. (music) - So we are in Bend, Oregon. We're going to a big box retailer to watch the general manager hand-pick DVDs for the store, so that people can rent them later from Blockbuster. She has to go to the store because Blockbuster corporate doesn't exist any more. There's nobody sending them DVDs. - So full disclosure, we called the big box store before shooting here to get a location release. But out of concern for the Blockbuster manager, Sandy, the store didn't want to sign, because technically, what she's doing here goes against the retailer's policy. - Up, is probably the most popular one that I bought in here. We sell that one a lot, and rent it a ton. Wolf of Wallstreet, very popular. Leonardo DiCaprio, yes, Lord of the Rings, - Always - We sell this one constantly and rent it out all the time. - Sandy Harding is the general manager of Blockbusters, where she's been working for the last ten years. She knows which movies her customer want, and she can even identify a lot of them just by their voice when they call the store. She uses a service in Portland that sends them about 80 percent of their videos. And she shop for the rest every Tuesday morning. - You get the new ones online, it's the classic stuff that you can't always find, so they come in to see us because they know they can get it. - Sandy's basically doing what Netflix does, knowing what her customers want to rent and serving that to more people. I mean, that's business. But in the case of this store, there's a specific community in mind, which makes the whole thing more personal. - Oh shit, there it is. (laughter) I never thought I'd see that sign again. (music) It smells the same. it absolutely smells the same. Oh wow, I haven't seen any of these things, any of these cases, or any of these movies before. It's been so long since I've been in a DVD rental place like this is. There's just so much stuff. - There's a place for both. There's a place for Netflix and hulu and Amazon. And there's a place for this. And I think that we finally found that comfortable spot, and I think that people are starting to realize that coming in here, picking up a movie, walking around, talking about movies. Is something that people miss. - It's hard to find spaces where the point is discovering things, or the point is being around people who like the same things as you. The employees of this store care about movies, and more importantly, they care about sharing them with people. I mean, just look at this section of employee picks. It's updated regularly. - Promethius is a really cool sci-fi movie. It's actually based on the Alien series. Another one, Requium for a Dream is great. - The employee showing me around the store is Sandy's son, Ryan. - This is actually, completely edited on a software that is totally free for anybody, which is Divinci Resolve. - As we move towards these digital spaces, we lose the expertise of people like Ryan. You can walk down the isle and have a movie jump out at you. Or, you can ask someone for a recommendation. - You definitely walk in and you will be looking along the shelf, and the next thing you know you see something that might catch your eye. - It's not something that's just right on the screen. My kids can wander around and a lot of times, their picking out movies that wouldn't be as popular as others. - Some times I come in and I just want feel like seeing a movie and I don't know what it's going to be. And sometimes I walk out of here with, like five totally different genres. I was surprised to learn that we were the last one. - So while they are the last Blockbuster in the U.S., there was a time when they were an independent video store, before they were consumed by the corporate chain. - We converted in 2000 to Blockbuster. They made us an offer we couldn't refuse. We were in here being Pacific Video, being very happy, and they came to town and said, \"Well, we need more Blockbusters in this town, and we'd like you to convert, and if you don't, we're gonna put a couple more Blockbusters in.\" So... - Ken Tischer is the owner of this store, and has been since it was Pacific Video back in the '90s. - Bend is a great movie town, always has been. People were amazed when we had four stores. The population was only about 50-55,000. And they said there was no way that town can support that many stores, and yet it did. (music) - Bend is located three-hours outside of Portland. And it's small, it seems like everything is five-minutes away. The people here really care about their art. Downtown you'll find literally dozens of shops touting locally made products. There's a yearly film festival. And outside of that, there are three theaters, two of which are independent, that show features and shorts year-round. It's a town that takes pride in it's craft and it's community. - It's a real interesting town, in that it's relatively small, but people have such a love for the art form that all of us, including Bend Film, are able to do pretty well. - That's Todd Looby, who runs Bend's film festival. It's celebrating it's 15th anniversary this October. - I think the curation aspect is super important, like, you know, in a lot of Indie movies that say, came out in the '90s, there'll be the video store guy, like the Kevin Smith surrogate, who is the guy at the video store who's telling people what movies to get. The curating owns sections of the movies they love and want people to watch. So people are gravitating towards that experience. Some kind of curations, someone who they trust to tell them what to see. - People here really value these face-to-face interactions. It's the same with Sandy, the employees of the big box retailers around town know her. And so they let her buy DVDs from the store, even though they're really not supposed to. It's easy to see how this town is home to the last Blockbuster. (music) But most of us don't live in Bend. And while there are local video stores across the country, we need new ways to discover movies that are more accessible. Because most of us don't live near video stores either. But there are some companies thinking about that kind of accessibility. And they even hand-pick videos you can watch online. - Where we come from is a place of knowledge and passion, choosing films that we think are interesting and vital and important. Versus data that makes assumptions about well this is popular, so this should be popular too. You like this, so maybe you'll like that. To us that has no human quality at all. - Daniel Kazman is the director of content at Mubi a video streaming service that uses human curation to select it's movie catalog. - What we may see now, is just an increasing amount of channels. So Disney is about to launch their streaming service. Netflix is providing their original content, Hulu has their original content. But I think more valuable are the sort of channel idea, that it's more specialized. When you look at something like Shudder, which is a channel specifically dedicated to horror films, it's much more focused in terms of the programming that it offers. Curation, I feel like always needs to exist, hand-in-hand with a venue. Whether you're talking about a physical venue like a theater cinematek, or an online venue, like Mubi, Hulu or Netflix. (music) - Going forward, I think that technology can leave us somewhere in the middle. Somewhere between Netflix and the video store. But right now, streaming services seem to be more focused on improving their algorithms than diversifying your movie pallet. The internet should have made discovery easier, and maybe it did early on. But over time the open web has become much more closed, into Apps and feeds. Admittedly this Blockbuster and a lot of other video stores, still partly exist because of nostalgia. And sure, that will bring Instagrammers, and news teams to cover them as an oddity, but that nostalgia isn't what's going to keep this store in business. It's the loyal customer base that the employees here have cultivated over the years. This Blockbuster is a product and a part of the community here in Bend. And while we currently live in a world driven by algorithms, maybe we can find a way to bring a little of that on to the web. - Hey, thank's for watching, if you like this video, please subscribe to The Verge on YouTube. And if you like discovering new video games, check out our friends at Polygon, they have an excellent YouTube channel.",
    "transcript_keywords": [
        "Blockbuster",
        "store",
        "people",
        "video",
        "movies",
        "video store",
        "movie",
        "Bend",
        "town",
        "stores",
        "watch",
        "Netflix",
        "Sandy",
        "Viacom acquired Blockbuster",
        "Bend Film",
        "Pacific Video",
        "Hulu",
        "place",
        "lot",
        "popular"
    ],
    "transcript_entity_values": [
        "Leonardo DiCaprio",
        "Blockbuster for",
        "Ken Tischer",
        "only one",
        "over 9,000",
        "one",
        "The Verge on",
        "four",
        "only about 50-55,000",
        "Oregon",
        "Requium",
        "1994",
        "three",
        "Pacific Video",
        "Viacom",
        "morning",
        "15th",
        "2000",
        "Portland",
        "Disney",
        "five-minutes",
        "Daniel Kazman",
        "Mubi, Hulu",
        "dozens",
        "Hulu",
        "the years",
        "YouTube",
        "Indie",
        "Kevin Smith",
        "about 80 percent",
        "this October",
        "- Sandy Harding",
        "America",
        "Sandy",
        "two",
        "Tuesday",
        "Bend",
        "Divinci Resolve",
        "three-hours",
        "Amazon",
        "Bend Film",
        "Instagrammers",
        "Wolf",
        "Polygon",
        "five",
        "8.4 billion dollars",
        "Netflix",
        "Wallstreet",
        "Ryan",
        "the last ten years",
        "the '90s",
        "Todd Looby",
        "2004",
        "YouTube",
        "U.S.",
        "Bend"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORDINAL",
        "DATE",
        "GPE",
        "ORG",
        "TIME",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "NORP",
        "PERSON",
        "PERCENT",
        "DATE",
        "PERSON",
        "GPE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "GPE",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "GPE",
        "PERSON",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "GPE",
        "ORG"
    ]
}