{
    "id": "wKd_mGlQCrg",
    "title": "Zenfone 3 Deluxe Durability Test - an 'All Metal' Design? - Asus",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-01-04T18:45:45Z",
    "video_url": "https://www.youtube.com/watch?v=wKd_mGlQCrg",
    "category": "Howto & Style",
    "tags": [
        "Zenfone 3 deluxe",
        "Zenfone 3",
        "Zenfone",
        "Asus Zenfone",
        "How durable is The Asus Zenfone",
        "Is the Zenfone 3 durable?",
        "smartphone",
        "tech",
        "android",
        "technoligy",
        "asus",
        "zenfone",
        "zenfon",
        "delux"
    ],
    "views": 1333776,
    "likes": 23146,
    "comments_count": 1889,
    "description": "Current pricing on the Zenfone 3 Deluxe is here:  No matter how hard you try... accidents can happen to your cell phone. Its interesting to see how a smartphone can hold up against every day abuse. My tests simulate a few years worth of accidental abuse that could happen to any cell phone. The newest phone to fall under my razor is the Asus Zenfone 3 Deluxe.    Its interesting how hard phone manufactures will push an all metal design when their phone isn't all metal. The Samsung phone is a metal phone under a glass panel. And we don't call it metal. We call a phone by whatever material is on the exterior.   As long as phone manufactures are exaggerating material claims... Ill be here testing phones and calling them out.   Cell Phone Replacement Parts:  Awesome Smart Phone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/2j5kpl0",
        "https://goo.gl/8e9zgI",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/1R7Ltic",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "Starting the New Year off right with a popular phone from Asus. This is the Zenfone 3 Deluxe. I put brand-new phones through a series of durability tests to see what theyre made of, and how well they stand up to the test of time. The box of this phone is pretty phenomenal. Opening the lid exposes a very thin layer of brushed aluminum whose reflections direct your focus to the phone in the center. It looks like Asus is in search of something incredible. Have they found it with this phone? Lets find out. [Intro] My initial thoughts holding this phone is that it is pretty lightweight compared to my normal Galaxy S7 or iPhone, or even the OnePlus 3, and that makes me nervous because when assessing durability, weight is usually associated with quality. Lets start with the scratch test. I have a set of Mohs picks that tell me what the screen is made of. If the screen is plastic like the Galaxy S7 Active, or Droid Turbo 2, it will scratch at a level 3. Tempered glass, like gorilla glass, will usually scratch at a level 6. And harder materials like sapphire will scratch at an 8 or a 9. This phone scratches at a level 6 which means were working with tempered glass, like most other smart phones these days. The same front glass covers the 8 megapixel camera and then sensors. So those are protected and inside the ear slot the grill seems to be made of plastic or vinyl covering. So if you ever need to clean dirt of makeup out of this hole, dont go too deep or it can tear. Now heres the part I was super curious about. All over Asus website theyre claiming that this phone is an all-metal miracle and that it has PureMetal technology which is fine except for they have this TM thing right next to it which means that its just a trademarked phrase instead of an actual material. So I was nervous, but... [ Nails on a chalkboard ] the sound shows us that it is indeed metal. I thought Asus was going to pull an LG G5 and make a plastic sandwich and call it premium but they didnt. Thumbs up Asus, the back panel of the phone is definitely metal. [ The sound of my wallet crying ] If you squint your eyes real hard and use all of your imagination you can clearly see that this is a pony. Fingerprint scanners are usually made up of a different material than the rest of the phone, and that is the case with the Zenfone 3 Deluxe. This scanner seems to have a plastic coating on it which can get scratched pretty easily. I think we can all agree that this particular fingerprint scanner is scratched more heavily than could ever happen in real life with normal use. So lets see if it can still function. It still allows me to set my fingerprint and unlock the phone every single time I touch it which is pretty impressive. You definitely dont need to worry about damaging the fingerprint scanner on this phone. So far Asus has done a really good job with build quality. Even the camera lens is real glass so it wont be scratching on its own like a plastic lens would. Now when I come to the side of the phone, this is where I encounter my first issue. That satisfying metal-on-metal scratching sound that we all enjoy is nowhere to be heard. Only when I get deep enough through the thick layer of plastic do I see a glint of silver metal. Call it plastic, call it primer, whatever this layer is, youre hand is not touching metal when youre holding the phonewhich is absolutely fine if this phone wasnt so heavily marketed as all metal on their website. It does have more metal than the LG G5 though, which also claimed to be all metal. At least the back panel on the Zenfone 3 Deluxe is legit as you can hear from my razor. It is just the sides of the phone that are having an identity crisis. So now we know anytime someone tries to pull a trademark metal shenanigan, its not going to be real metal. Now there are 2 different versions of the Zenfone 3 Deluxe. The 5.7 version with an AMOLED screen, and a 5.5 inch version with an IPS LCD that was released a few months after the first version. Both are branded with the same Zenfone 3 Deluxe name and both have the same build quality and exterior materials. The IPS screen or the 5.5 inch lasted 8 seconds under my lighter but fully recovers. Now Ive had several people Tweet me about lighting their own phone on fire. This is a terrible idea. Even if the pixels do fully recover, there is still damage done to the oleophobic coating. That coating gets evaporated by flame so definitely leave the phone burning to a professional phone burner, like myself. Speaking of tests you shouldnt do at home, the bend test of the Zenfone 3 Deluxe is anxiety inducing. It appears to disobey the laws of physics. The screen stopped working for a second after the bend, but after turning it off and turning it back on again, we are back in business. Bending from the front of the phone yielded much sturdier results, I imagine because the glass inside of the frame kept it pretty sturdy and rigid. And while the metal is pretty disfigured, it can be mostly bent back into its original shape and continue on functioning just like normal. So as long as you are okay with plastic sides on the so called all metal phone design, this is a pretty solidly built phone. Good as new. Do you Asus should get a pass on calling this phone all metal? Or do you think phone manufactures should be more specific on what their phone is made of? Let me know in the comments. I test every new phone that comes out so make sure your notifications for my channel are enabled so you never miss out on a durability test. Instagram and Twitter are where Im active the most. And if youre mom catches you lighting your phone on fire ... you dont know me. Thanks for watching, Ill see you around.",
    "transcript_keywords": [
        "phone",
        "metal",
        "Asus",
        "Zenfone",
        "Deluxe",
        "plastic",
        "pretty",
        "Year",
        "glass",
        "popular phone",
        "test",
        "made",
        "screen",
        "back",
        "scratch",
        "Fingerprint",
        "real",
        "metal phone",
        "phones",
        "Galaxy"
    ],
    "transcript_entity_values": [
        "iPhone",
        "8 megapixel",
        "G5",
        "the 5.5 inch",
        "Asus",
        "the Galaxy S7 Active",
        "Instagram",
        "6",
        "5.5 inch",
        "Galaxy S7",
        "the Zenfone 3 Deluxe",
        "5.7",
        "8 seconds",
        "the Zenfone 3 Deluxe",
        "first",
        "Asus",
        "a few months",
        "second",
        "AMOLED",
        "8 or a 9",
        "PureMetal",
        "Droid Turbo 2",
        "these days",
        "3",
        "OnePlus 3",
        "Mohs",
        "the New Year",
        "2",
        "Twitter",
        "LG"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}