{
    "id": "wLmiWPHPqhU",
    "title": "OnePlus 7 Pro - Hidden Camera Durability Test! Will it Scratch?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-05-14T16:00:15Z",
    "video_url": "https://www.youtube.com/watch?v=wLmiWPHPqhU",
    "category": "Howto & Style",
    "tags": [
        "OnePlus 7",
        "One Plus 7 Pro",
        "OnePlus 7 PRo durability test",
        "Pop up camera",
        "smartphone",
        "hidden camera",
        "mechanical camera",
        "Best smartphone",
        "budget phone",
        "oneplus 7 pro",
        "bend test",
        "flagship killer",
        "OnePlus 7 pro camera test",
        "durability test"
    ],
    "views": 2932136,
    "likes": 92602,
    "comments_count": 6848,
    "description": "Lets durability test the OnePlus 7 Pro! Grab a dbrand skin for your phone HERE:  Mechanical cameras are pretty awesome. Yeah, it might be adding a ton of moving parts and hardware to solve a problem that doesnt really need solving... But it looks AMAZING. And I'm a huge fan of the additional features the OnePlus 7 Pro has added this year. The Triple camera setup on the back of the OnePlus 7 Pro is very tempting. In this video we will be durability testing the OnePlus 7 Pro, and seeing if the pop up camera can scratch, or what happens when the OnePlus 7 pro drops while the mechanical camera is open?   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://dbrand.com/pop-up",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "With the OnePlus 7 Pro, OnePlus is branching itself up into the ultra-premium flagship bracket, with crazy specs, motorized camera and internal 10 layer liquid cooling system. And a screen refresh rate that rivals even the gaming phones. It has me intrigued...but it is durable? There's no point in buying a phone if it can't survive every day life. OnePlus sent me the Nebula Blue version to check out. It reminds me of spotlights shining up into a foggy night sky. It's got a frosty matte finish. Will the OnePlus 7 be able to survive my durability test? Only one way to find out. Let's get started. [Intro] The first thing I noticed out of the box is the minimal bezels and no notch. OnePlus is calling this a fluid AMOLED and I'll get to more of that in a second. But if we take a look up here at the top, the way OnePlus managed to get rid of the notch was by moving the camera...like literally adding a motor and moving the camera so it pops out of the phone. I think it's pretty brilliant. If I push the camera back in manually, I get a little warning on the screen asking me to politely not do such things, and I'll obey for now, but I'll definitely be back. Let's start with the scratch test. With the large screen on the OnePlus 7 Pro, it's even more important that the glass remains scratch free. My Mohs picks help me visually see the difference between different types of materials. Normally metal objects won't be able to do any damage to a glass screen. OnePlus has been nice enough to include a legit plastic screen protector on the phone. I'll remove that so we can test the actual screen. Flexible AMOLED screens damage at a level 2. Plastic screens scratch at a level 3. Glass scratches at a 5 or a 6. And sapphire scratches at an 8 or a 9. Looking at the marks made by my Mohs picks, we can start seeing scratches at a level 6 with deeper grooves at a level 7. Very normal for smartphones these days that are using tempered glass. Up here at the top there is a small sliver of an earpiece. It feels like it's made from metal, and sitting just below the surface of the glass. The motorized front facing camera, which is only visible while the camera itself is enabled, pops out of the phone like a daisy in springtime. The 16 megapixel sensor is protected with a little circle of glass, which is good. It means it won't be getting itself scratched when sliding in and out of the phone. The front area surrounding the circular camera lens is made from plastic, but since it's not an essential or normally visible component, I'm not too worried about it. Just touching or tapping the camera won't make it retract. You have to apply about the same amount of force as it takes to smash a strawberry to get it to go in. The analogy might be a bit weird, but you understand where I'm coming from. The sides of the Nebula Blue colored OnePlus 7 Pro are made from metal, including the power button, and the triple slider, which I'm a fan of. We have the normal mode, vibrate mode, and totally silent mode. I think every phone should have a switch like this. The top of the phone exists. The surface of the mechanical camera slider is made from metal. You can see the silver glinting through after my scratches. The camera unit itself is also made from metal, minus the front plastic bit of course. Down on the left side we have a metal volume rocker and more metal running down the body. Unfortunately for us though, flipping the phone over to check out the base, there is no headphone jack. The SIM card tray, USB-C and loudspeaker are all covered in metal. It has a dual SIM card tray, with a slot on the front and back. Personally, I would rather have a SD card slot in here, but either way, it does have the red water resistant ring to help keep liquid out. The back panel is covered in Gorilla Glass 5, meaning the blue color and logos are all protected against scratches, just like the front screen. On the 7 Pro, OnePlus has the perfect trifecta of cameras: a 3x telephoto zoom 8 megapixel camera on the bottom, a 48 pixel main camera, and an ultra wide angle 16 megapixel camera up top. It's a pretty killer camera set up and I'm a fan of the extra features. This particular lens combination has everything. But what about the front pop-up camera? As we know, moving parts might pose a weakness down the road. OnePlus says the motor has been tested over 300,000 times, and I vote we put that to the test. Count with me now...one...two...three...just kidding. Even if we activated the camera 150 times a day, it would still take us 5 years to hit 300,000. OnePlus says that if the camera is opened and sticking up, but then slips from your hands and free falls, the camera will automatically retract in just a fraction of a second. And it looks like that is indeed the case. The distance between my camera and the desk is about a foot and a half. And by the time the OnePlus 7 Pro hits my hand, the camera is almost fully retracted. I'd say it would have time to fully retract itself in about two and half feet, or 0.6 meters. It's using the internal accelerometer and gyroscopes to figure this out. Let me know if you want to see a full on real drop test of this phone down in the comments...we can check my math. It's good to see that the camera is protecting itself like a turtle drawing it's head back into it's shell. The best protection against dropping though is not dropping it at all. One way to fix the smooth, slipper glass surface is with a textured skin from dbrand. The Hexagonal Swarm skin is one of my favorites right now, but they have all kinds of colors to choose from. Even Bulletproof Banana is still there. Plus the skins are pretty easy to change up and swap out whenever you want. I'll leave a link for you in the description. And thanks to dbrand for sponsoring this video. Yeah, the OnePlus 7 has some impressive features, but one of the coolest things about this phone is the display. Most smartphones, like iPhones and Samsung, have a 60 Hertz refresh rate, meaning that's how fast new images can load. The OnePlus 7 Pro has a 90 Hertz refresh rate, combined with a 1440p resolution. It's putting itself right in the same ballpark as some of the high-end gaming phones, especially if it has that impressive 10 layer internal heat pipe that OnePlus mentioned. I'll have to take a look at the insides for sure. You might be thinking to yourself, 'Wow, this Jerry guy is talking forever.' And you're right. The flame has been in place for a full 50 seconds with hardly any indication that the phone's been on fire. Normally, we get permanent burn marks after about 20 seconds. I highly recommend you don't take a lighter to your own phone though. It does melt away the oleophobic coating and I've had a few mothers mad at me for setting a bad example. Don't do this at home, kids. I'm a professional. OnePlus has added an under screen fingerprint scanner again this year. We can tell it's optical by the green light shining up onto my finger as I set the lock method. I'll take my deeper grooves level 7 pick to the glass just to make sure the fingerprint can't still function when the glass is damaged. And it looks like even with the scratches, the fingerprint scanner can still unlock. Not too shabby. My durability test is not complete without analyzing the structure of the OnePlus 7 Pro. Does the camera slot at the top make it weaker? The only way to find out is with a bend test. When bent from the front we get a subtle curve, but nothing catastrophic. And flipping the phone over to bend it from the back, we get no glass separation or kinks in the frame. The OnePlus 7 has held up well, and might just be one of my favorite phones so far this year. I'm a sucker for mechanical parts. I think the mechanical camera unit is going to look pretty awesome from the inside. The OnePlus 7 Pro clear version is gonna be epic. Hit that subscribe button, I've got some good videos coming your way. You can see what your phone looks like with a dbrand skin installed using the link in the description. Come hang out with me on Twitter and Instagram. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "camera",
        "OnePlus",
        "phone",
        "ultrapremium flagship bracket",
        "glass",
        "Pro",
        "screen",
        "metal",
        "front",
        "test",
        "liquid cooling system",
        "flagship bracket",
        "crazy specs",
        "cooling system",
        "ultrapremium flagship",
        "made",
        "scratches",
        "back",
        "megapixel camera",
        "phones"
    ],
    "transcript_entity_values": [
        "OnePlus",
        "The OnePlus 7 Pro",
        "The OnePlus 7",
        "8 megapixel",
        "3x",
        "6",
        "SD",
        "Instagram",
        "two",
        "5 years",
        "Glass",
        "Jerry",
        "Mohs",
        "about 20 seconds",
        "about two and half feet",
        "Twitter",
        "SIM",
        "7",
        "over 300,000",
        "10",
        "this year",
        "Hertz",
        "5",
        "90",
        "iPhones",
        "the OnePlus 7 Pro",
        "60",
        "300,000",
        "first",
        "second",
        "48",
        "8 or a 9",
        "Samsung",
        "these days",
        "3",
        "16 megapixel",
        "One",
        "0.6 meters",
        "the OnePlus 7",
        "Only one",
        "Nebula Blue",
        "150",
        "one",
        "OnePlus 7 Pro",
        "every day",
        "a full 50 seconds",
        "2"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "TIME",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "TIME",
        "CARDINAL"
    ]
}