{
    "id": "WLqny5ICmIA",
    "title": "Apple MagSafe Is Back - What You Need To Know",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2021-11-02T18:04:11Z",
    "video_url": "https://www.youtube.com/watch?v=WLqny5ICmIA",
    "category": "Science & Technology",
    "tags": [],
    "views": 434497,
    "likes": 17849,
    "comments_count": 613,
    "description": "Get 10% off all Jackery products with code LinusTechTips at   MagSafe is BACK on the new MacBook Pro lineup. How is it different from older versions?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Secretlabs Gaming Chairs:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  TechLinked:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.jackery.com?aff=27",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/SecretlabLTT",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/GMGLTT",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Aren't you tired of tripping over your laptop's power, cord dragging it off the table, watching it clatter to the ground, and then having to buy a new one or even worse, having your boss scream at you about it. Well, clearly Apple is tired of it as well. So they've brought back a new and improved MagSafe for their new lineup of MacBook Pros. And while the headlines were stolen by their new M1 Pro and M1 Max processors, the return of MagSafe is a pretty big deal on its own. In case you're not an Apple fan or you're just unfamiliar with MagSafe, the idea is that your computer's power connector is held in place magnetically instead of being plugged into a port. So the idea is if the connector is accidentally yanked, it just pops off reducing the risk of your laptop being pulled onto the ground, or even worse onto your foot. Apple actually got the idea from the magnetic connectors that you can find on some kitchen appliances, like deep fryers, although spilling a cauldron of hot vegetable oil can obviously have far more severe consequences than dropping a MacBook. But as we mentioned, Apple is bringing back MagSafe. It actually debuted all the way back in 2006, until Apple killed it off in 2017 with nobody knowing the real reason why. There've been a lot of suggested explanations. Apple may have wanted to transition to USB-C to allow a single port to transfer data and charge your device. They may have felt that MagSafe was too heavy and bulky, or they may have felt that it just wasn't as necessary as Apple transitioned away from spinning hard drives and towards solid state drives, which are much more impact tolerant if a cord drags your laptop off the table. The original MagSafe had other issues too, users frequently complained that MagSafe cables broke easily. And Apple also faced a lawsuit in Japan after an electronics manufacturer, alleged that the connector design infringed on its patents. Nonetheless, not only is MagSafe back, but it's better than ever. Probably the most noticeable thing is that it is faster in terms of charging. Now, as usual, Apple's not super into giving us specific numbers, but they do claim that MagSafe 3, the newest version we'll take the MacBook Pros from empty to half charged in only half an hour. And although MagSafe has a proprietary connector that will require a MagSafe to USB-C cable, the new wall chargers that the MacBook Pros ship with utilize USB power delivery 3.1. And since the cable is detachable, any charger that also supports that spec should charge the new laptops just as quickly, so long as it meets the minimum wattage requirements. The notable exception is the larger 16 inch MacBook Pro as that one needs a special 140 watt charger provided by Apple. However, with upcoming USB PD chargers supporting up to 240 watts, my fingers are crossed that even the beefiest MacBooks will eventually play nicely with third-party power bricks. And that's not all, Apple also says that MagSafe 3 connectors, feature more powerful magnets. So they should resist accidentally being yanked out while still being weak enough to detach if you do indeed trip over the cord. Especially since the new MacBooks are relatively large and heavy compared to their predecessors. Do keep in mind though, that if you lose your MagSafe cord, you'll need to pick up another one if you want to fast charge. As well, you can charge through the MacBook Pro's USB-C ports instead, they only support charging at slower speeds with a cable. But that satisfying snap sound, when you get to attach the magnetic cable, just might make you forget about the extra money you've spent. Maybe. - Jackery's Explorer 1500 Portable Power Station has enough juice to keep all your devices powered and connected. It's huge 1500 watt hour capacity and 1800 watt output rate allows up to seven devices to be plugged in simultaneously. It takes only four hours to recharge up from zero to 80% so check out the Explorer 1500 at the link below and get 10% off with the code LinusTechTips. - Thanks for watching guys like or dislike depending how you felt about it. Check out our other videos and comment if you have a suggestion for a future Fast As Possible, we would love to make your dreams come true. I know I would.",
    "transcript_keywords": [
        "Apple",
        "MagSafe",
        "tired of tripping",
        "MacBook Pros",
        "MacBook Pro USBC",
        "boss scream",
        "Pro USBC ports",
        "MacBook",
        "tired",
        "Pros",
        "Pro",
        "power",
        "Pro USBC",
        "connector",
        "back",
        "USBC",
        "cable",
        "cord dragging",
        "cord",
        "charge"
    ],
    "transcript_entity_values": [
        "MacBook Pros",
        "half",
        "MagSafe 3",
        "only four hours",
        "MagSafe 3",
        "2006",
        "the MacBook Pros",
        "M1 Pro",
        "140 watt",
        "USB",
        "zero to 80%",
        "Japan",
        "the MacBook Pro's",
        "M1 Max",
        "MagSafe",
        "MagSafe",
        "the Explorer 1500",
        "USB PD",
        "third",
        "2017",
        "16 inch",
        "3.1",
        "up to seven",
        "1800 watt",
        "10%",
        "1500 watt hour",
        "LinusTechTips",
        "only half an hour",
        "MacBook Pro",
        "USB-C",
        "MacBook",
        "Apple",
        "MacBooks"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "PRODUCT",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "QUANTITY",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "ORG"
    ]
}