{
    "id": "wOutZUel4WI",
    "title": "AirPods Max review: the good, the bad and a mic test",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-12-16T14:00:31Z",
    "video_url": "https://www.youtube.com/watch?v=wOutZUel4WI",
    "category": "Science & Technology",
    "tags": [
        "airpods max",
        "apple",
        "airpods",
        "airpods max review",
        "apple airpods max",
        "airpods max price",
        "airpods studio",
        "anc",
        "noise cancelling headphones",
        "the verge",
        "verge",
        "review",
        "airpods max unboxing",
        "airpod max",
        "tech",
        "technology",
        "active noise cancellation",
        "airpods pro",
        "new airpods",
        "$550",
        "apple over-ear headphones",
        "apple airpods",
        "apple headphones",
        "new apple headphones",
        "airpods pro max",
        "airpods vs sony",
        "sony mx 1000xm4",
        "bose quietcomfort 35 ii"
    ],
    "views": 368189,
    "likes": 11294,
    "comments_count": 1054,
    "description": "Apples AirPods Max are its first noise-canceling over-ear headphones. They have a stylish design, excellent sound quality, and unique features like spatial audio. But at $550, they also come at a very premium price thats way more expensive than competitors like Bose and Sony. Watch our whole review to see if theyre worth it for you.  Learn more:   If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:   AirPods Max -   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/37mfqIW",
        "http://bit.ly/2TQsqjB",
        "https://bit.ly/3mnL4dp",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- These are the new AirPods Max from Apple. And by now you probably know that they cost $550. So your first reaction might be, sticker shock. What business does Apple have making headphones that are so expensive? Well, it turns out there are actually a lot of headphones, even wireless ones, at this price and beyond. But Apple has plenty of competition to worry about, for less money, much less. And so this isn't a review where I'm gonna tell you that the AirPods Max are the best headphones for most people, because quite frankly, they're not. If all you want is a good and reliable set of noise canceling headphones, save your money and stick with something like Sony's 1000XM4s or the Bose Noise Canceling Headphones 700, which both cost at least $200 less. That said the AirPods Max will make sense for very specific people. Their design is top-notch. They sound awesome and they have features like spatial audio that you really can't get anywhere else, at least not quite like this. So let's dig into some reasons for and against the Apple AirPods Max. (gentle music) First up is fit and finish. And if there's one area that backs up that premium price tag, it's the build quality that Apple has pulled off. The AirPods Max have a stainless steel headband that's wrapped in this nice, soft material. And a knit, mesh canopy on top, does a good job of keeping all the weight, and I'll get to that later, off the top of your head. The rotating aluminum ear cups are attached by these cool telescoping steel stems that take a bit of effort to extend, but do a great job of staying in place wherever you leave them. The ear cushions are made from acoustic memory foam, with a nice, breathable mesh layer on the outside, that's really comfortable. They attach magnetically, come off easily when you want them to, and popping them back into place is really satisfying. (snaps) There are only two buttons on the AirPods Max. There's the digital crown, a much larger version than what you might be familiar with from the Apple watch, and a button that switches between noise-canceling and transparency modes. I've really come to like the crown for controlling volume and playback. You don't get the false inputs or missed swipes that can often happen with touch gestures. There is one very strange part to all this, though. The AirPods Max, don't have a power button. They turn on when you put them on your head and when you take 'em off, they go to sleep. Put them in the case and they go into an even deeper, ultra-low power state. Now I've left them out overnight with no case at all and they barely lost any battery, but I still wish Apple had been less Apple-like and just put a power button somewhere for simplicity sake. There are a lot of random cutouts for mics and sensors all around the AirPods Max. And behind those ear cushions are powerful, custom designed, 40 millimeter drivers. It all comes together in a package that feels sturdy, sturdy, sturdy. But I would steer clear of the silver color and go for something like space gray, or blue. These white ear cushions are already looking a little worse for the wear, after only a few days of wearing them. Of course, Apple sells replacements and different colors for $69 a pair. The second pro for the AirPods Max is sound quality. Folks, these headphones sound delightful. Apple has struck a mix between the highs, mids and lows. And there's a broader soundstage here than I get from my Sony's or the Bose cans. Now the base isn't gonna rattle your skull, but there's always enough to make whatever song is playing, shine just the way it's supposed to. Apple uses computational audio with the H1 chips in each ear cup and the many built-in microphones, to constantly measure what you're hearing from the headphones, and it adjusts EQ to account for how they fit on your head and seal against your ears. The company says it aims for a faithful reproduction of your music, but these are still tuned in a way that's geared toward casual listening. I would never call them neutral or flat. If I had to pick two words to describe the AirPods Max, I would say tight and refined. There's always just enough bass and the treble never sounds harsh. But a lot of you probably want to know whether the AirPods Max sounds so much better, as to justify their high price, and there's no great answer. It comes down to preference. If you're a nitpicky about audio, you'll notice how great these sound, but those Sony's are popular for a reason. And one of those is booming bass, where they can still beat out the AirPods Max. Other noise canceling headphones, like the Sennheiser Momentum Wireless 3, also give these a run for their money. Just like the regular AirPods, these AirPods Max work great for voice calls. So we put 'em through our usual set of microphone tests. So let's start the mic test with the Bose Noise Canceling Headphones 700. These are often on sale, especially during the holidays, but they usually go for around $350. All right, next up are the Sony WH-1000XM4s. These also usually sell for around 350, but over the holidays, they've been on sale for as low as 270, so they're a great deal and have really good noise cancellation. Third up, are the Microsoft Surface Headphones 2. These sell for around 250, so less expensive than the Sony and the Bose. And they have those style controls that we really love. Next up, are the Sennheiser Momentum Wireless 3. These sell for around $350. So pretty pricey, but they sound amazing. And finally, we come to the AirPods Max. Now, just so you know we've been doing all these microphone tests to my iPhone, through the Voice Memos app. So this is as good as these mics will ever possibly sound. Third in the pros column, is noise cancellation. The AirPods Max are neck-in-neck with both Sony and Bose, with how effectively they can quiet the outside world. They might even be better, but it's very close. They aced my tests at the coffee shop, on the subway, and just walking around Manhattan for a day. When you do need to hear what's happening around you, transparency mode sounds just as natural here, almost like you're not wearing headphones at all, as with the AirPods Pro. The fourth reason to consider these expensive headphones, is spatial audio. Just like the AirPods Pro, the AirPods Max, can give you an immersive, surround sound experience, on an iPhone or iPad when you're watching movies with supported apps like Apple TV, Disney+, and HBO Max. Since those devices have positional awareness from their built-in sensors, they send that data back to the headphone, so the sound is always right in front of you, even if you turn your head side-to-side. Now, special audio can't quite match a full Dolby Atmos 7.1 surround system. I mean, how could it? But once everybody starts traveling again, people are gonna love this feature. I just really wish it worked with the Apple TV, so you could make for your TVs crummy speakers, or just watch a movie in bed with your partner sleeping beside you. But for now, the Apple TV doesn't do spatial audio, just iPhone and iPad. The last big plus is that the AirPods Max are just easy. Like the regular AirPods, they pair to your phone, just by being held close together. And now they can automatically switch between an iPhone, iPad and Mac, depending on what device you're using at that moment, without you doing anything. If I'm paying $550 for headphones, I damn sure want that level of convenience. That said, the Sony, Bose and many other headphones let you pair with the two devices at the same time. So that might be enough flexibility for you. Especially if not every device you own is made by Apple. And now we come to the cons and first up is this case. If you can call it that, I think it's being generous. Look, this is a failure on every level and I don't know what Apple was thinking. Yeah, it makes the AirPods Max easy to recognized at a distance, maybe that was the point. But in terms of doing case things, it's a joke that offers nearly no protection for your big investment. I wouldn't feel good about throwing this into a packed bag. The ear cups could get easily scratched and something could poke through that mesh canopy. not to mention, the case quickly gets filthy. The situation is bad enough that it brings down the entire product. Everyone else gets this right and it's baffling to me that Apple could get it so wrong. I'd expect to see many third-party cases for the AirPods Max, very soon. Second con, no 3.5 millimeter jack. The AirPods Max only have a lightning connector. So if you want higher quality, wired audio, or to plug them in on a plane, you've got to get this $35 cable. I can live without the 3.5 millimeter jack, but to not include the cable in the box, at this price, that's just rude. Also it's worth mentioning that there is no passive mode on the AirPods Max. And what that means is when they run out of battery, they just stop working, even if you're wired. Speaking of battery, you get 20 hours with all the features turned on, like noise cancellation, which is good, but about 10 hours less than Sony. Another downside is wait, I said earlier that the mesh canopy does a good job of distributing the heft of the AirPods Max. They're not uncomfortable, but you always know that they're on. And if you move your head a lot, sometimes they shipped out a place from their own weight. These are definitely a leisure headphones meant for the couch, or for sitting at your desk. And eventually they will be great travel headphones, but they're not at all the kind of headphones you take running, or to the gym. (gentle music) The last reason to avoid the AirPods Max, for now, is unrealized potential. And what I mean by that is, most people are gonna be streaming Apple Music, or Spotify through these things. And that means you're limited to the same compressed 256 kilobits per second AAC files we've been listening to for years, in the case of Apple Music that is. Apple still doesn't offer a lossless tier. And I have to ask, if not now, when? I can plug it into my iPhone with a cable and get higher quality music from Amazon Music HD, or Tidal, than I can from Apple, itself. Meanwhile, Sony's headphones have LDAC, a codec that can wirelessly stream at near CD quality. So Apple is falling behind here. Now you can make all the arguments you want about how it doesn't matter, or how no one can actually hear the difference, but when we're talking about $550 headphones, the option to enjoy higher quality audio should at least be there. That was a lot I know, but hopefully that answers most of your questions about the AirPods Max. This is the company that defined an entire category with the AirPods and AirPods Pro. Nobody had really cracked true wireless earbuds before Apple, but this time Apple is late to the game. There are already some heavy hitters in noise canceling headphones. And the AirPods Max face an uphill battle at their price point. There's no world where I recommend these to the average buyer. Especially when the AirPods Pro offer a lot of the same features, for less. If you're the kind of person that knows you're gonna love these headphones, have at it. They sound killer for music and movies alike and they feel like they should cost even more money. But there are many of you that'll be perfectly happy just sticking with the tried and true options from Sony, Bose, Microsoft and elsewhere. At the very least, it's probably worth waiting for Apple Music HD, or a spatial audio on the Apple TV, or for God's sake, a better case. Hey, thanks so much for watching. You know, I was gonna ask, are you sold on the AirPods Max, or if money were no object, would you get something else? Regardless, it's almost 2021. Finally, I know. And so you can expect a ton more reviews as always, very, very soon. So, be safe, be sure to subscribe and be well.",
    "transcript_keywords": [
        "AirPods Max",
        "Max",
        "Apple AirPods Max",
        "AirPods",
        "Apple",
        "headphones",
        "noise canceling headphones",
        "AirPods Max sounds",
        "AirPods Pro",
        "Apple Music",
        "Sony",
        "canceling headphones",
        "AirPods Max easy",
        "Bose Noise Canceling",
        "AirPods Max work",
        "AirPods Max face",
        "Bose",
        "Apple AirPods",
        "noise canceling",
        "sound"
    ],
    "transcript_entity_values": [
        "the AirPods and AirPods Pro",
        "35",
        "Tidal",
        "HBO Max",
        "Apple Music HD",
        "one",
        "1000XM4s",
        "fourth",
        "Apple",
        "Mac",
        "third",
        "Second",
        "around 250",
        "about $550",
        "the AirPods Pro",
        "around 350",
        "the holidays",
        "Amazon Music HD",
        "AAC",
        "as low as 270",
        "only a few days",
        "the AirPods Pro",
        "the AirPods Max",
        "about 10 hours",
        "Spotify",
        "the Sony WH-1000XM4s",
        "only two",
        "at least $200",
        "the Sennheiser Momentum Wireless 3",
        "69",
        "around $350",
        "iPad",
        "Third",
        "years",
        "the Bose Noise Canceling Headphones 700",
        "Bose",
        "Apple TV",
        "the Microsoft Surface Headphones 2",
        "two",
        "AirPods Max",
        "H1",
        "20 hours",
        "AirPods",
        "Dolby Atmos 7.1",
        "LDAC",
        "Bose",
        "Sony",
        "second",
        "Manhattan",
        "a day",
        "40 millimeter",
        "the Apple TV",
        "EQ",
        "The AirPods Max",
        "Microsoft",
        "first",
        "iPhone",
        "3.5 millimeter",
        "almost 2021",
        "Sennheiser Momentum Wireless 3",
        "550",
        "First",
        "256 kilobits",
        "Apple Music"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "MONEY",
        "LOC",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "FAC",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "TIME",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "GPE",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "MONEY",
        "ORDINAL",
        "QUANTITY",
        "ORG"
    ]
}