{
    "id": "WOXcF4-Fj0U",
    "title": "Hack your water and electricity! Myth or Reality?",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2024-06-21T14:00:24Z",
    "video_url": "https://www.youtube.com/watch?v=WOXcF4-Fj0U",
    "category": "Science & Technology",
    "tags": [
        "ics",
        "scada",
        "industrial control systems",
        "cyberwar",
        "cyberwarfare",
        "cyber war",
        "cyber warfare",
        "osint",
        "ukraine",
        "hacking scada",
        "cyber security",
        "cyber attack",
        "cyber security course",
        "shodan hacking tutorial",
        "hacking",
        "cyber warrior",
        "info sec",
        "hacker",
        "hacked",
        "cybersec",
        "infosec",
        "shodan",
        "cisco",
        "gps",
        "SCADA",
        "SCADA Computers",
        "Industrial Plants",
        "Telemetry",
        "SCADA Network",
        "Networked SCADA System",
        "distributed SCADA systems",
        "SQL",
        "Data Acquisition",
        "What is SCADA",
        "RTU",
        "PLC",
        "scada systems",
        "talos"
    ],
    "views": 52613,
    "likes": 1257,
    "comments_count": 75,
    "description": "Big Thank You to Cisco for sponsoring my trip to Cisco Live and this video!  // Joe Marshalls SOCIALS // X:   LinkedIn:  Cisco Blogs:   Cisco Talos:    // Webpages REFERENCE //     // David's SOCIAL //  Discord:   X:   Instagram:   LinkedIn:   Facebook:   TikTok:   YouTube:   // MY STUFF //     // SPONSORS //  Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  // MENU // 00:00 - Coming Up 00:44 - Intro 01:30 - ICS (Industrial Control Systems) 04:47 - System Attacks 05:51 - GPS Example 10:13 - USA Attacks 13:52 - The Risks 15:23 - Careers 22:46 - Conclusion 23:16 - Outro  scada modbus ics industrial control systems cisco power plant power water water treatment ddos cybersecurity cyber attack cyberwar cyber security cyberwarfare cyber attack cyber war cybernews hack hacker hacking cyberattacks  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   Disclaimer: This video is for educational purposes only.  #cybersecurity #power #hacker",
    "description_links": [
        "https://x.com/immortanjo3",
        "https://www.linkedin.com/in/joeics/",
        "https://blogs.cisco.com/author/joemarshall",
        "https://www.talosintelligence.com/",
        "https://blog.talosintelligence.com/project-powerup-ukraine-grid/",
        "https://edition.cnn.com/2023/11/21/politics/ukraine-power-grid-equipment-cisco/index.html",
        "https://blog.talosintelligence.com/how-joe-marshall-helps-defend-everything-from-electrical-grids-to-grain/",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/@davidbombal",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "the fabric of civilization is everything that we do in industrial control system and or power grid or Wastewater management or water treatments or whatever right you will learn so much about that Tech and then you're going to realize a lot of it 90% of it it's the same stuff you see in IT right it's not that different but the implications are that much more severe if we don't have access to it and we're not able to protect it. I think that you know the movies depict like end of the world type stuff you know the hackers are going to get into the power system or into some system Everyone it's David Bombal coming here from Cisco live with Joe, Joe great to meet you. Great to meet you. So Joe just before we get into the interview you work for Cisco Talos is that right? Correct uh I am a uh senior security IoT strategist and threat researcher for Cisco Talos we're a extremely large threat intelligence research organization here inside of Cisco um and I focus specifically on critical infrastructure, Internet of Things sort of your non-standardized but still very much computers then the Securities that kind of go vulner that go with them yeah. But you come from a cyber security background rather than like a utilities background. Absolutely I I I uh I did some stuff with theod I was actually an operations guy but uh if you're an IT person you are a security person whether you like it or not and then I just sort of organically shifted into cyber security and uh IC stuff. Really excited about this topic a lot of people are interested in it ICS perhaps you can tell us what ICS is and I believe it's very fragile a lot of issues perhaps with encryption security stuff like that and under attack it seems. Yeah so ICS is industrial Control Systems they are so ubiquitous in our lives you wouldn't even know it they are the things that make water clean, that let the lights come on in a place like this that make Pharmaceuticals or let Aviation work or Maritime systems guide ships yeah they're they're just not something you would think about that's not your phone or mobile device or your PC that you're playing games on or or whatever that happens to be we know it exists because it's invisible and extends civilization to us and but it's such a ubiquitous thing because they're all computers too. Yeah you said offline it was developed in a different era right? If we were to take something like GPS our Global Positioning System uh for us old people we remember life before GPS telling us where we could go uh you then we had map quests where I could print out directions and then you know yeah yeah yeah while I'm on the the motorway going turn left here and you're like ah you know and now we have you know Apple Maps, Google Maps, Waze things to guide us right so like uh GPS is a great example we rely on it so much for everything especially in the power grid yeah space and it's built on 1960s technology from satellites. Yeah I mean it seems worse because correct me if I'm wrong but there's no encryption generally on ICS systems is that right? Yes um very very broadly though because there's very there a wide plethora of of of of systems and Integrations that exist across numerous vertical however the standardized protocols that are used are not encrypted um they were invented in an era where they didn't need to be and there are some bolt-on security mechanisms from vendors that can do that by and large I don't think the industry has largely adopted those those security controls for one reason or another um if it's broke don't fix it I suppose probably be the better way to say it yeah. And I mean people make the mistake well perhaps a mistake they put this on the Internet you go and Shodan and you just do a search you can just see a whole bunch of ICS Systems from around the world. Yeah one of my favorite hobbies is going on Shodan to see what I can find on any given day I found uh a substation uh uh near Buckingham Palace, I found waste treatment plants in Australia, I've found a lot of farms I don't know why but uh or a lot of cooling and heating systems and various buildings um you know if you know what to look for and it changes so much um that uh it's become kind of a little fun little hobby for me I guess but it's a strong illustrator that people are opening themselves to risk with systems IoT or Industrial IoT or ICS and they just they don't know they're doing it for the most part yeah. And I mean a lot of them don't have authentication right or just using default systems on on Shodan you you can go look up their default credentials on most vendor websites your more mature uh uh users and vendors are going to enforce some kind of security there's a lot of old systems there too these industrial control systems that we use so much they're meant to last a long time and because they're not cheap 10 15 even 20 years and 15 years ago how was cyber security as it related to Industrial Control Systems probably not good if anyone else like this doesn't seem like it'd be great um and that's kind of the long tale if you will certainly what you could find on Shodan. Now I you know not just Shodan that's not just a problem like hackers but there's nation states also attacking uh systems it seems it seems like these systems are under a lot of attack these days and I think you've got some great stories about that? If you take the situation like the conflict in Ukraine but global conflict in general everyone's taking notes, all right so uh you know uh you've had some significant cyber attacks out of Ukraine like the black energy attack and Destroyer not Peta watershed moments in cyber security history right and then you have other geopolitical entities looking at that and saying to themselves what's going right for me as as an attacker what's going right for them as a Defender can we do that for some foreign policy reason down the road as well yeah uh as above so below yeah um and and that's probably the primary concern I think that I have um is that unfortunately it's very difficult to separate you know nation state based attacks without the foreign policy intent of said Nation to impose their will upon another Nation um and it is very concerning yeah. You've got a really good example with GPS I believe could you talk tell us talk us through that it's that story? I had the absolute privilege to help the uh Ukrainian uh power transmission grid operator the bulk power you know the big lines you see help them with GPS resiliency because of the conflict they're using they and their adversary are using like a lot of electronic warfare jamming right jamming jamming and spoofing and things like that to to help protect their power grids um because they want to defeat missiles and drones and things like that unintended consequence of that is it's somewhat fratricidal it damages civilian infrastructure as well that relies on GPS one of which is the power grid believe it or not not where you are but when you are it's it's not widely known but in orbit these GPS satellites have atomic clocks in them oh and they broadcast like uh you know twice a minute you know depending where you are in the world the exact time down to nano seconds and you know for a a small hockey puck sized receiver you can and you know download that signal and and you would have incredibly accurate time and in power grids it's incredibly important to do that all over your country especially in the United States this is a global this is a global standard not just in Europe by having this synchronized time I'm able to understand the health of my electric grid and I can make adjustments as needed by having time stamps atomic time stamps on that data well when you lose GPS you lose those time stamps that's a problem because now all of a sudden your power dispatchers kind of flying blind yeah they don't know if a weather system has taken down something if a missile unfortunately has hit something they just don't know and we at Cisco were able to basically fix the problem with some of our our technology. You got to tell us the story because and I'll put a link below for anyone who wants to read more about it but you used IoT devices and like um rugged switches could you tell us a bit more? We did a total hack job so it we put smart people in a room well a virtual room and we said here is the problem the Ukrainians are having struggles keeping electric grid operating not because of kinetic conflict that's obvious yeah but because of you know the protective measures that are being used to protect them as well yeah we said what if we took one of our commodity industrialized switches so it's a it's a normal computer switch but it's temperature resistant moisture resistant it's me to go in like really inhospitable places electric substations for example right um what if we took the internal clock on that switch cuz everything has a clock inside of it and what if we were able to basically make the power transmission system that's used in Ukraine rather than look at the satellite look at our switch when the satellite goes away and it will the power system I didn't tell you this this is this is this is a this is an unfortunate consequence ICS Systems typically aren't designed for conflict zones I would imagine so they're not really they're not really architected for that and in the particular case of Ukraine their systems just didn't know what to do without GPS interesting so they would kind of go into a little bit of a panic and just shut down until the satellites came back and you know they could detect them and that was no no way as they say so I said what if we put a clock in there a really good one mind you yeah and you kind of make it think we're the satellite and we did that and it we actually were able to make some clock recovery enhanced algorithmic uh firmware updates inside of an ie 5000 which is one of our uh industrial I switches um and uh when the satellite goes away our switch steps seamlessly and says don't panic here is the time and we have to do it in micros seconds that's how good our clock is and we'll hold that time over for 2 to 4 hours however long it takes the the unfortunate the reality is is that you it could happen four or five times a day in Ukraine because of the conflict yeah yeah a bit bit humbling there but um the Ukrainians tell us it works like a charm they call them the Magic switches that's amazing yeah so it's nice to know that we're helping keep the lights on for that country. Yeah I mean it's amazing because like you think about actual missile strikes but it's not all the jamming that's causing the problems. It's always more complex than anyone thinks yeah that's the truth of it right like uh if I had never heard about it I would have never even known that it was an issue I'm a cybercity guy not an electronic warfare radio expert but uh we had to get smart really fast so> Joe I want to bring it back to the US you've got years and years in cyber security from what I'm reading in the news there are attacks against the us as well against ICS Systems so what's your advice is the sky falling do we have to worry you know the sky is falling the sky is is falling are you crazy give us the the real world expert opinion about you know what should be people what should people be doing how can we better secure our systems and so forth? Yeah i' like to say worry about everything panic about nothing, we have to address the reality that we live in a world uh a fractious conflict of a world right now where nations have conflicting geopolitical interests whether it's in Asia Pacific or in Europe or wherever it happens to be right the good news is this is that there are so many super smart cybercity professionals uh uh industrial control system Engineers who architect these systems to be incredibly resilient in the United States if a hurricane hits the southeast of the United States you know our Engineers have built a reliable rugged grid that can be repaired easy enough to keep the lights on for people or if it's a hot day or if a blizzard comes through in the northeast or nor Easter uh no hacker has been able to do the damage that Mother Nature has done to critical infrastructure right? I think you said it's like snakes and and rodents cause more damage than hacks right? Absolutely squirrels one enemy of every power grid right the the bad news is is that our adversaries are just aware of the fragility of certain things and they're smart and they're well funded they're motivated and they have strong technical Acumen and should a reason arise which would be a very bad moment in that I think global history yeah you know we have to understand that causing disruption causing uh uh uh any kind of inconvenience to water power, wastewater treatment, uh Maritime, shipping, Logistics, manufacturing, um can have ripple effects that affect other elements of our life here in the United States and maybe causes enough of a hindrance to prevent uh sort of a the response we want to do as a nation that is the eternal cat and mouse game that we're playing right now I think in the United States. I think that you know the movies depict like end of the world type stuff yeah you know hackers are going to get into the power system or into some system and it's going to you know cost millions of lives yeah is that is that a real threat. No uh I I don't believe so I I think the uh keep in mind this uh you know electric grids are designed to be very very resilient yeah but you do have to think about what's Pittsburgh versus a small town of 25,000 in the middle of Kansas right um who is the more well- defended who's the more well protected um it would take uh you know at that and also at that point it's an AC of War right I mean uh there's there's no way things have gone South very heavily if that's going to be the case y I think it's a bit of Hollywood uh uh uh Glam up if you will you know what I mean yep that we I have tremendous amount of faith in the expertise and the technology that we've done because we have shed this problem to the bone yeah I kind of feel like that's my vibe can't be complacent right oh yeah don't complacent. I'll give you I'll give you an example let's say that small town loses power because of cyber attack right nation state base uh somebody goes into medical distress and maybe they have an oxygen system and they're not getting power to it and it causes them to have a pulmonary issue and they pass away or something bad happens Covid taught us a lot about critical care with lack of Staff supplies or space well then now we have maybe actual fatalities attributed to an attack on a grid because so much life-saving care is attached to yeah us having power when we need it right it's really tough and it gets into a gray area that's very difficult for us to predict and to and to project to because we just don't know and frankly I hope we live in a world where we never have to know but that that that's getting into the real real deep unknown in my opinion. The movies are exaggerating it but there is a risk right? There absolutely is a risk um I I think it's table stakes you know uh uh cyber conflict is really weird it is a step below sending you know missiles and planes and tanks at people yeah where the reciprocity may not be armed conflict it may be a counter Cyber attack if you know what I mean right it is a cold hot War I it's very it's operates in this gray area where you know we don't have to put someone in harm's Way per se yeah but we are able to project our our our desires to an opponent and maybe that's our version of ICS attack or you know you had a God I hate to say the phrase stick that like in in Iran where that was basically what happened there so yeah yeah I mean stuxnet is the famous example that a lot of people talk about yeah I mean it sounds like it's happening all over where governments are are doing stuff like this I'm really glad to hear that it's your your opinion is it's not like the guy's going to fall tomorrow it's not going to fall tomorrow knock on wood you know don't want to jinx myself but I've traveled the world I've talked to so many people that are you know hard working Engineers cybercity professionals grid practitioners like myself they're so they're bright they're smart they care about their communities and they're working very hard to keep us all safe and enjoying civilization you know power comes on water is drinkable we're in Las Vegas so the air conditioning is working and I have a lot of faith in them and uh they know what the stakes are always be vigilant always be thinking ahead of the adversary um think like a bad guy every day. So let's talk about careers okay how many years you been doing this? Oh gosh um well I'm 45 this Friday congrats thank you very much uh I've been doing this since I was 20 I find to my astonishment that a quarter of a century has passed. Long time. Long time yeah so talk to your younger self or talk to the to people are interested in this; Is cyber security good field? Is ICS a good sort of net area in cyber security to get into? Yeah that's wow that's a great question I was not prepared for that one. If if I were to talk to my younger self uh first everyone I know that's done industrial control system Security in my opinion it's not linear which just kind of either you find it or it finds you yeah it's just one of those weird moments I was uh working for the dod and I was doing just operations IT stuff right and uh my local utility wouldn't take no for an answer for an interview and I went and interviewed with them and they offered me this this this job as a as a as a ICS IT OT architect and that was my first introduction to OT I didn't start off in it though right very nonlinear kind of way that I got into it which then led me to Cisco and to work at tallos yeah um if if I were to talk to my younger self and give some advice the advice I would give actually wouldn't be that technical okay um it would be have a good attitude; okay be easy to work with; yeah and be hungry be a forever student right when my team and I helped Ukraine I didn't know anything about electronic warfare, I didn't know anything about like uh missiles and drones other than that they were a thing right well we had to go eight layers deep to make sure that we were giving them a solution that would help them keep the lights on and that just doesn't happen by being casual about this like you got to be a hyper nerd you have to understand it and chew it to the bone those are the I hate to say like nerd version esque but these passionate dedicated people that that want to see us be safe and have you know the civilization and take care of each other ultimately what we do we lead with a heart so if I were to talk to my younger self develop the soft skills; keep advancing your technical skills; and your strong technical Foundation right you can't be an MSCE or CCIE if you don't understand how DNS works or how TCPIP works or God help us the OSI model or whatever right now I'm now I'm I'm going way back right but but but you know be humble; have a good attitude; be easy to work with; be hungry and it doesn't really matter what you're doing for a career if you could just do those things you will be always successful in my opinion and more so in a field like ICS security where if if you come with an open mind and you want to be taught that might be this crusty old lineman or this this director of OT operations that doesn't know anything about those cyber security guys but you know just say I'm here as a student and I'd love to learn more about this and then I can figure out how to help you keep you secure also protip I bribed my way in with donuts so I was the cyber security guy they're like oh gosh he's going to make my life miserable but I'm like but I've got donuts and I think after like the 10th time I did it they were like you're in the tribe stop bringing Donuts we're getting fat you know you're one of us now we'll tell you whatever you want to know. But it's a good career path right? Yes it's an excellent career path you will learn so much about what lets us enjoy our lives the hard work the the fabric of civilization is everything that we do in industrial control system and or power grid or Wastewater management or water treatments or whatever right like that you will learn so much about that Tech and then you're going to realize a lot of it 90% of it it's the same stuff you see in IT yeah right it's not that different but the implications are that much more severe if we don't have access to it and we're not able to protect it. But I have to question are their jobs? Yes absolutely they jobs that are either adjacent to operational technology which is you know industrialized IT if you will yeah um and there are jobs directly in that space I've had people who are power engineers who get into it I've had people who are cyber security engineers and they just took a really cool course at college and they got an internship with their local utility a lot of it can also be IoT based to ruggedize systems wireless modems and routers they they need application security and development stuff like that and then sometimes you just get very lucky and you can go work for utility um if they had see a cyber security professional that they want to grow and invest in and they go look we're going to expose you to some weird stuff that's what happened to me they took a leap of faith on me and so I'm learning about smart grids I'm learning about oil and gas I'm learning about all these interesting things and by having a good attitude being easy to work with and and being hungry and kind uh uh I was able to to to Really uh proceed down that path because there's so many places that need cyber Security Professionals oil and gas um any kind of any kind of petrol business utilities are kind of a natural given uh municipalities that do their own water power Unis are super underserved and need really smart people um waste water is different from water right so we have to treat toage we have to give you clean drinking water uh Maritime believe it or not is big so uh uh uh cyber security on what makes our economy work which is shipping um Aviation Security is is falls under that uh almost every pharmaceutical manufacturing Manufacturing in general uh which could be everything from the medication you take to uh you know getting spare parts your tractor if you're a farmer right because uh um understanding the fragility and the attacks on that system is so important I'll give you a great example yep I was talking to a major major Vehicle Manufacturer manufacturing obviously is operational technology and ICS right they make cars yeah and I said uh we're having a great meeting you know I'm I'm cutting jokes with them and they're cutting jokes with me the kind of meeting you want to have a good time with and it's it's going great and I said hey I don't get to talk to vehicle manufacturers as often as I like as a indulge me for a moment as a cyber security professional uh what happens if you can't make make your number one selling pickup truck for just one day yep just one day and I erased every smile in the room instantly I yanked the oxygen out of that room and everyone looked at me and very soberly said we are going to have a very bad day yep you know that could be a safety instrumented system that fails and causes God forbid a loss of life or an injury or to just the raw amount of money that business is going to hemorrhage because of the the impact to their operational technology and ICS systems that weren't able to function as resiliently as they wanted to and that means you need cybercity professionals both Technical and not technical to step in evaluate risk help suggest controls and work with plants and work with anyone in the OT space as a friend bring donuts and you will have wonderful success but they need those people they really really do they're looking for those people. Are you saying that there's a lot of companies looking for talent. Absolutely take your your core IoT security fundamentals active directory segmentation trust all those things and then you're going to sprinkle in well how does this business operate how does this manufacturing organization work yeah what's special Technologies are they trying to do um are they a utility are they water or whatever the case may be they're hungry for people like that who can bring in something new to that business and help either mitigate it through technical risk or work with Executives to help them understand the risk because there could be regulatory concerns behind it but it's a diverse field of cybercity professionals that are needed in the space and they're absolutely hungry for that they need talent and interest and um it could just be getting your foot in the door unfortunately I hate to say that it's not the easiest thing in the world because it's a big world and a big industry that we have but 100% it is uh and especially with the retiring Workforce y um there is an absolute demand I guarantee it. Joe we're out of time uh we have to wrap up but before we do can people reach you on social media as the can they reach you on Twitter perhaps or X as it's called these days. I'm on the twitters I'm on the LinkedIn uh I'm all over the I'm easy to find and I guess we can just give you the link and you can put it on your post is that cool yeah that's why I'll put the links below so reach out to Joe if you're interested in ICS and they can also ask you perhaps for some career advice? Absolutely anything I can do to to to to help others I'm I'm always in man. Joe thanks so much thank you brother really appreciate it. Appreciate you.",
    "transcript_keywords": [
        "yeah",
        "cyber security",
        "ICS systems",
        "industrial control system",
        "yeah yeah yeah",
        "Systems",
        "security",
        "yeah yeah",
        "ICS",
        "system",
        "power",
        "people",
        "control system Security",
        "control system",
        "cyber",
        "power system",
        "United States",
        "industrial control",
        "conflict yeah yeah",
        "kind"
    ],
    "transcript_entity_values": [
        "first",
        "CCIE",
        "10 15",
        "Australia",
        "these days",
        "South",
        "Las Vegas",
        "IoT",
        "Covid",
        "45 this Friday",
        "Unis",
        "Buckingham Palace",
        "Cisco Talos",
        "Magic",
        "Maritime",
        "Ukrainians",
        "Iran",
        "the United States",
        "Joe",
        "Cisco",
        "micros seconds",
        "Peta",
        "Logistics",
        "millions",
        "Control Systems",
        "90%",
        "Tech",
        "Hollywood",
        "10th",
        "Europe",
        "years",
        "eight",
        "15 years ago",
        "Industrial Control Systems",
        "2 to 4 hours",
        "Integrations",
        "Pittsburgh",
        "tomorrow",
        "Kansas",
        "ICS",
        "Ukrainian",
        "Easter",
        "every day",
        "100%",
        "number one",
        "Apple Maps",
        "1960s",
        "Ukraine",
        "Destroyer",
        "TCPIP",
        "Technologies",
        "ICS Systems",
        "Waze",
        "20 years and",
        "us",
        "one",
        "MSCE",
        "four or five",
        "Vehicle Manufacturer",
        "Nation",
        "Asia Pacific",
        "Aviation Security",
        "5000",
        "a quarter of a century",
        "25,000",
        "Cisco",
        "DNS",
        "Twitter",
        "OSI",
        "David Bombal",
        "US",
        "Shodan",
        "Wastewater",
        "Cyber"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "PRODUCT",
        "QUANTITY",
        "GPE",
        "DATE",
        "LOC",
        "GPE",
        "ORG",
        "PERSON",
        "DATE",
        "NORP",
        "FAC",
        "ORG",
        "PRODUCT",
        "ORG",
        "NORP",
        "GPE",
        "GPE",
        "PERSON",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "GPE",
        "ORDINAL",
        "LOC",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "GPE",
        "DATE",
        "GPE",
        "ORG",
        "NORP",
        "ORG",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "GPE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "LOC",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "LOC",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "ORG",
        "PRODUCT"
    ]
}