{
    "id": "WpQ8kcawAaQ",
    "title": "Moto G Unboxing + Water Test (2015)",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2015-07-31T15:04:46Z",
    "video_url": "https://www.youtube.com/watch?v=WpQ8kcawAaQ",
    "category": "Science & Technology",
    "tags": [
        "moto g",
        "moto g review",
        "moto g 2015",
        "2015",
        "3rd",
        "3rd generation",
        "moto g unboxing",
        "moto g water",
        "unboxing",
        "review",
        "motorola",
        "new",
        "new moto g",
        "3rd gen",
        "third",
        "android",
        "Android (Operating System)",
        "Phone",
        "Mobile",
        "moto g vs",
        "vs",
        "best android",
        "motorola moto g",
        "moto 3rd",
        "gen",
        "moto 3rd gen",
        "moto 3rd generation",
        "generation",
        "camera",
        "smartphone",
        "motorola moto 3rd",
        "hands on",
        "test",
        "liquid",
        "water test",
        "liquid test",
        "moto g liquid",
        "wet",
        "unboxtherapy",
        "unbox therapy",
        "tech",
        "technology",
        "Samsung",
        "Iphone"
    ],
    "views": 977269,
    "likes": 22525,
    "comments_count": 1548,
    "description": "New Moto G 3rd Gen 2015 -   - Advanced water resistance - 13 MP camera which includes a color-balancing dual LED Flash - 5-inch HD display - Gorilla Glass - Quad core processing - 2470mAh battery - MicroSD Slot - 4G LTE Speed  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/1Urp0sG",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Back in the lab again! What's up guys, Lew here, back with another video, and today, I'm excited to bring you the new Moto G, from Motorola. This was shown off yesterday for the first time, and now we have the retail packaging right here on Unbox Therapy. This is a very exciting device for a number of reasons, but for me the biggest one is the package, the overall value, what you get for your money. This retails for $179... Unlocked! So this device is actually... IPX7 water resistant. That means it can withstand immersion, in up to 3 feet of fresh water, (Don't get salty on it) for up to 30 minutes. If you drop it in your toilet, you're still good to go. Water damage kills a ton of phones. It ain't going to kill your new Moto G. It is a 5 inch HD display. So its 1080p. [Correction: 720p] Its got Gorilla Glass... for a little extra durability there. Got a new 13 megapixel camera on the back, and a 5 megapixel front facing camera, these are really interesting specs for this pricepoint. It's also got a relatively pure Android experience, Motorola calls it \"pure Android\". There are some Motorola pre-installed functions, though they are fairly lightweight and they don't really interfere with the overall OS. So inside the box, you are greeted with the device. First, it is LTE-capable, also that IPX7 that I mentioned before, 2500 or just under twenty five hundred mAh battery, microSD expansion. Now the back is a new material, its like, hear that? Does this make me a DJ? And there are some instructions here for removing the back part of the case. It's got this nice little dimple, it's a design touch that Motorola has been using for a while. Here you can see the dual tone flash, which is going to help with color correction. As we flip to the side, a volume rocker. Very slender, as well as a power / lock switch which is a different texture. This is really nice when you reach over on the side, you just know immediately which one is which. Fairly familiar design, headphone jack on the top, this is also protected from the elements so you don't need to use a flap. You know I'm not a big fan of flaps, same thing goes for the bottom where you have your micro USB slot. This one is also protected against moisture. There we go, very similar to the previous gen. There's your forward facing camera up top. Pulling off in the back of the device, you'll see there are a couple of rubber gaskets these protect the susceptible areas of the device. The micro SD card slot as well as the sim tray. This is the eight gigabyte model of the device, but who cares when you have that affordable microSD expansion. Let's check out the other items inside the box. Motorola charge brick, a little bit of paperwork... That's about it. New little intro screen here. Very Nice. One of the best things about various Motorola products that have released recently is that they have a very close to stock Android experience. This means two things: You're going to use Android, as it was intended to be used, but also you're gonna get updates faster than devices from manufacturers that put really heavy-duty skins on there, now the only alteration that happens is this Motorola specific icon here. You can have it gauge how you use the device on its own, do so automatically by adding places and activities and the settings that you might want on the phone... Given those set activities, you can also have it react to motion, for example, there is a chop twice feature which enables the flashlight. Oh, I'll just be here for a while. And then also twist for capture, simply by twisting your hand like that you can enable the camera really quickly. Ready set, oh! Booyah! Now notifications is another thing that Motorola has done well on this device, and previous ones where you can simply look at your display, tap it and see your notifications without having to turn on the whole screen, which can drain some of your battery life. Now this screen is 1080p. [Correction: 720p] Yes there are quad HD displays out there, however not usually in the 179 dollar range at this screen size. 1080p is really fine. [Correction: 720p display] Now the next big question is the camera, and as I said before it has been improved, it's now a 13 megapixel shooter on the back. Snap a few here. It's pretty quick. Front facing camera looks pretty high quality too. It will do 1080p video at 30fps. No 4K, but again, How dare you complain? The device is $179. Oh wow, that's like some kind of a inception situation there. There's me, there's me again, there's me recording me, and me recording me again. Alright so the package looks pretty compelling at this point, a hundred and seventy nine bucks, which really puts it in a class that's much different than the flagships that are out there as I'm sure you're aware, but you're still getting most of what makes modern smartphones good, including some things that aren't even on flagships, like that water resistance. So speaking of that water resistance, let's go ahead and test that theory. Why does this feel so exciting right now ? Ok, so before you do this, you want to make sure that that back cover is installed correctly. Alright. Oh my goodness... Still playing. Just dumped in there, half an hour. At up to 3 feet, this thing's surviving right now, it's playing video, and look at that, the screen is still functioning correctly. Shake it out a little bit. So there you have it, Motorola has put together a fairly compelling package in the new Moto G, and when you try to think about value, what you're getting for your money, I think this thing is going to be pretty tough to beat. Anyways, thanks very much for watching guys, if you enjoyed this content, make sure to leave a thumbs up down below, and I will catch you on the next episode. Later. (Laughter)",
    "transcript_keywords": [
        "Motorola",
        "device",
        "Back",
        "Unbox Therapy",
        "camera",
        "water",
        "Android",
        "screen",
        "Moto",
        "thing",
        "facing camera",
        "pure Android",
        "Android experience",
        "pretty",
        "things",
        "nice",
        "water resistance",
        "make",
        "facing",
        "megapixel"
    ],
    "transcript_entity_values": [
        "Lew",
        "Android",
        "1080p",
        "SD",
        "179",
        "up to 3 feet",
        "just under twenty five hundred",
        "today",
        "USB",
        "first",
        "First",
        "179 dollar",
        "jack",
        "LTE",
        "yesterday",
        "a hundred and seventy nine bucks",
        "Android",
        "two",
        "One",
        "Moto G.",
        "IPX7",
        "2500",
        "microSD",
        "Moto G",
        "eight gigabyte",
        "13 megapixel",
        "Motorola",
        "a ton",
        "5 inch",
        "5 megapixel",
        "half an hour",
        "up to 30 minutes",
        "Booyah"
    ],
    "transcript_entity_types": [
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "TIME",
        "PERSON"
    ]
}