{
    "id": "wthCfEhDuts",
    "title": "Wireless Charging That Doesn’t Suck - Qi 2",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2023-12-01T23:19:37Z",
    "video_url": "https://www.youtube.com/watch?v=wthCfEhDuts",
    "category": "Science & Technology",
    "tags": [],
    "views": 214333,
    "likes": 11116,
    "comments_count": 390,
    "description": "Check out the Beryl AX at GL.iNet here:  Also, check out the Slate AX and use code 20AXT1800 to take an additional 20% off your purchase until Dec 31st:   Thank you to Paul Golden of the Wireless Power Consortium for his help with this video.  Learn about the new Qi 2 wireless charging standard.  Leave a reply with your requests for future episodes.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:",
    "description_links": [
        "https://www.gl-inet.com/products/gl-mt1300/",
        "https://store.gl-inet.com/products/slate-ax-wi-fi-6-gigabit-wireless-router",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech"
    ],
    "transcript": "Wireless charging is great, but it's often frustratingly slow, incompatible with your gadgets, or difficult to use because you can't get your phone to line up exactly with the charger. Just... do it. But, lo and behold, an upcoming standard might just solve all of these issues in one fell swoop. I'm talking about Qi 2, the long-awaited update to the original Qi charging standard that came out all the way back in 2010. It's been described by some outlets as MagSafe for Android, and this is actually pretty fitting, but you Apple users should pay attention too. Like MagSafe, Qi 2 is a magnetic standard, and Apple had a hand in its development, as they, along with Google and Samsung, are members of the Wireless Power Consortium, who published the standard. Aww, isn't it nice when gigantic faceless corporate adversaries get along? Not only will this make wireless charging more convenient in that your devices will now magnetically stick to the charger, but Qi 2 should also really help with making sure the charger is properly aligned with your phone's induction coil. Which is great news for the millions of us who keep getting those annoying notifications saying we need to readjust our phone for optimal charging. And despite the simplicity of the design, there are even more improvements over Qi 1, and potentially even MagSafe. We'll tell you what they are right after we thank the sponsor of this video. Thanks to GL.iNet for sponsoring today's video. It's cute, it's portable, and it's highly functional. It's the Beryl AX-WiFi 6 travel router. It comes with OpenVN, AdGuard, and even supports Cloudflare DNS over TLS, so you can secure your browsing anywhere you are. And it runs on OpenWRT, which means future device support is practically guaranteed. Check it out using the links below and use the coupon codes provided to GL.iNet yourself a nice limited-time discount. Who wrote that? The tighter and more precise coupling of the induction coils also means that there should be less undesirable heat buildup when charging. Because wireless energy transfer isn't terribly efficient, quite a bit of that energy is wasted as heat. And in severe cases, heat can even affect the long-term health of your battery. But with the magnetic design getting the coils as close to each other as possible and as well-aligned as possible, it should be less of a problem with Qi 2. Qi 2 is also going to allow faster wireless charging than what we're used to today. The current generation of Qi charging tops out at 15 watts, but this is merely going to be a starting point for Qi 2. While it looks like Qi 2 devices won't initially be faster than 15 watts, the standard will support higher charging rates in the future. You also won't have to worry as much about buying poor-quality, counterfeit chargers that don't deliver the advertised performance with Qi 2. Unlike the original Qi standard, Qi 2 will support a handshaking process, where a device can actually just refuse to work with shoddily-built chargers that aren't compliant with the Qi 2 spec, or, at the very least, give you a warning message. The WPC has come out and said that they can actually get non-compliant devices delisted from shopping sites like Amazon, making it less likely you'll buy a POS. But when, exactly, are we going to start seeing Qi 2 devices hit the market? Look for the first ones in late 2023. These likely will be phones and wireless earbuds. Sometime in mid-2024, we can expect other devices like tablets and smartwatches to start dropping. As for the iPhone 15, well, Apple has said, hardware-wise, it supports the standard, and the software will support future Qi 2 wireless charging, but it's anyone's guess as to when they'll enable the feature. I would ask Tim Cook myself, but he never returns my calls. Wow, that was a whole video you just watched. Good job! Like the video if you liked it, dislike it if you disliked it, check out our other videos, comment below with video suggestions, and don't forget to subscribe and follow. You know, I mean, you'd watch the whole video. I think you can do that. I know you're capable.",
    "transcript_keywords": [
        "frustratingly slow",
        "Wireless charging",
        "charging",
        "Wireless",
        "standard",
        "video",
        "Wireless Power Consortium",
        "devices",
        "Apple",
        "support",
        "charger",
        "phone",
        "MagSafe",
        "supports Cloudflare DNS",
        "Google and Samsung",
        "Power Consortium",
        "Wireless Power",
        "faster wireless charging",
        "charging standard",
        "heat"
    ],
    "transcript_entity_values": [
        "15 watts",
        "Qi",
        "mid-2024",
        "one",
        "the Wireless Power Consortium",
        "Google",
        "Qi 2",
        "Amazon",
        "Cloudflare",
        "DNS",
        "TLS",
        "WPC",
        "MagSafe",
        "Samsung",
        "first",
        "2010",
        "Android",
        "Qi",
        "Qi 2",
        "Tim Cook",
        "AdGuard",
        "late 2023",
        "Qi 1",
        "Apple",
        "today"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "DATE"
    ]
}