{
    "id": "wtSlhqHolso",
    "title": "This is The Best Chromebook",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-03-29T22:42:43Z",
    "video_url": "https://www.youtube.com/watch?v=wtSlhqHolso",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Asus",
        "Chromebook",
        "Flip",
        "C302",
        "C302CA",
        "Best Chromebook",
        "Which chromebook",
        "Versus",
        "Chromebook Plus"
    ],
    "views": 1328150,
    "likes": 22842,
    "comments_count": 1714,
    "description": "Dave2D review of the Asus Chromebook Flip C302. Is a Chromebook worth buying in 2017? Asus C302 -  Blue SSD -   Music Credits: Background: Fili - Domo  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2nhOvUl",
        "http://amzn.to/2nBBzvJ",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "hey how's it going, Dave2D here this is the ASUS C302, it's their chromebook, their top-of-the-line Chromebook, and I don't do much coverage of Chromebooks on this channel, at least I haven't in the past because I feel like this type of hardware, Chromebooks, their value is highly dependent on their software like without a good software experience this whole ecosystem doesn't work very well, and in the past that has been great but recently, actually in the very near future these will become awesome. So, before I get into the whole like review of this particular unit I need to talk about the state of Chromebooks in early 2017. So Chromebooks have traditionally been just like ok if you don't know what a Chromebook is, it's a inexpensive laptop like device, well it's basically a laptop, and it runs Chrome OS which is a software made by Google. Now, in order to put applications on these things traditionally you go to something called the Chrome Web Store which is kind of like their app store so iPhones have the app store, android phones have the google play store, Chromebooks have, they used to have, something called the Chrome Web Store which is their application kind of library. The problem was that developers just didn't develop much for the Chrome Web Store, like most of the popular applications weren't available on the Chrome Web Store so Google did this thing last year whether like 'hey we're going to allow Android applications, the ones that you would see on your android phone, we're going to put those on to Chromebooks in the near future' and that is right now. In the next week or two they're going to be rolling out across most Chromebooks at least all of the current generation one and future generation Chromebooks they're going to be able to run android applications. So at first glance it's not like a huge thing, yeah it's like a bunch of apps, are coming into the system but this really is a game changer. So not only do you have just a gigantic library of apps now, you're now able to do stuff offline so if you want to do editing of documents offline, if you want to play games offline if you want to download videos and watch stuff off netflix offline, you can now do this on a Chromebook, these are basically full-fledged computers. So the addition of these android apps into this chromebook ecosystem I think it's going to heavily affect the sales and the livelihood of Android tablets. This is a Galaxy tab S3, came out a week, maybe two weeks ago, and I I feel like these products are dead on arrival. I mean, why would you purchase that when you could buy these for half the price and they're just as if not more capable than those. Some apps don't work yet, like VISCO Cam, this is a really popular photo editing app, and when i try to install it, it says it's incompatible, but chances are if your favorite app isn't available right now, there's going to be an alternative or two or ten that are available and able to run on Chromebooks already. So in general, I think if you are an average user - I mean I know a lot of my audience are like, they're heavy gamers or just photo or video editors; if you're one of those people then you probably won't be able to use this as like your only machine, maybe as like a secondary device, but for most people you can get by with a Chromebook; the App Store selection is huge, so yeah I think that's just the state of Chromebooks right now. So I want to talk about the device in specific now. So this is the ASUS C302 and personally I think this is the best Chromebook right now; it's expensive - it's five hundred dollars, and I guess let's talk about the things that I do like about first. So it's got great build quality; full aluminum build, everything is solid - there's no plastic on the device, everything from the hinge to the finish feels like a top tier device. There is like you can see over here that it wasn't milled from a single block of aluminum there's like two pieces that they put together, but the build quality on this thing is quite good. There's two USB-C ports and there's no USB-A ports - obviously not a huge selection of ports, but it's a Chromebook and you probably won't be connecting too many devices to this thing. You also have your microSD slot and then on the other side you have your volume rocker, power button and audio jack. The screen is 2400 x 1340 - it's reasonably bright and color accurate, I'd say it's about average for a higher end laptop or Chromebook. There are better screens out there but I like this one a lot. Performance is pretty strong - strong enough I mean for what you would do on a Chromebook - I can easily have 10 chrome tabs open with Spotify, Netflix or Twitch running in the background and it'll handle it with ease. The 64 gigs of storage feels a little light, especially if you're coming from laptop, but you can easily add a microSD card if you want. I will say though if you're interested in purchasing this thing, I would highly recommend getting the upgraded one, like the one with the core m processor - I've used the Pentium processor and it feels noticeably slower. It's not that much cheaper so I highly recommend getting the upgraded version with more storage and a faster processor. Okay let's talk about the keyboard. This is why I've crowned this ASUS as the best Chromebook. It's backlit 1.4 millimeters travel, perfect layout, there's really nothing I would change about this keyboard. Maybe like the springs could be a little bit stiffer but really it's a great keyboard, it feels a lot like the macbook air, and for what I use a Chromebook for and what I think is a lot of people will be using Chromebooks for - the typing experience has to be awesome and this really nails it. Very few Chromebooks do. And so there's another competitor to this that I would consider to be like the second-best Chromebook out there which is the Samsung chromebook plus, but the keyboard on that is significantly worse than this, that's why I prefer this. The other thing that I really liked about this like device as to why I think it's the best - it's the flip. So a lot of devices, when you flip it into tablet mode, it's just not a comfortable device. This thing is relatively light - 2.6 pounds (1.18kg), but it's also the ergonomics like when you hold this thing it feels like an actual tablet, and I think if you're going to have a 2-in-1 device if your tablet mode your tent mode and your laptop mode are all really comfortable to use you've done a good job. The trackpad is less awesome - surface feels good, but it lacks perfect precision - you'll get the occasional jitter, it is a decent trackpad though. The battery life is great - it's a 39 watt hour battery, you'll comfortably hit eight or more hours on this thing, so I've been able to hit eight hours with the screen at 250, keyboard backlighting on, I mean it's a Chromebookm it's not pulling too much juice so it's going to last. It also uses USB-C charging - if you have other USB-C devices that's a nice bonus. The speakers are also decent; they're positioned nicely, you get a good stereo effect, and they're clear enough - there's no fan noise on this thing so audio comes out pretty clean, but it's a small speaker on a Chromebook so it's not going to be amazing. There's a few things I don't love about this Chromebook - I wish the screen was brighter, 300 nits is fine for indoor use but if you bring it outdoors it's not ideal. The other thing are the bezels - so, these bezels are, I mean they're not huge or anything but when you have it in tablet mode, especially because you have that ASUS logo on the side, it doesn't look like a particularly elegant screen. I wish these bezeles were smaller but that's about it, there's really not much I dislike about this Chromebook. Now, it's not cheap, it's five hundred dollars which is actually quite expensive for a Chromebook, but in 2017 you're not going to get this kind of build quality unless you're paying this kind of money. So is it worth it? I think it is, especially if we consider the android apps that are coming in - if you can make this fit into your workflow, I think this is a really good device. Hope you guys enjoy this video, thumbs if you liked, subs if you loved it, see you guys next time.",
    "transcript_keywords": [
        "Chrome Web Store",
        "chromebook",
        "Chrome Web",
        "Web Store",
        "app store",
        "Store",
        "Chrome",
        "thing",
        "topoftheline Chromebook",
        "android",
        "google play store",
        "device",
        "android apps",
        "Web",
        "App Store selection",
        "Android applications",
        "app",
        "apps",
        "future generation Chromebooks",
        "Samsung chromebook"
    ],
    "transcript_entity_values": [
        "1.4 millimeters",
        "Chromebooks",
        "2400",
        "2",
        "Chromebookm",
        "Chromebook",
        "39 watt hour",
        "1.18kg",
        "Twitch",
        "the Chrome Web Store",
        "the next week",
        "10 chrome tabs",
        "Pentium",
        "USB",
        "Spotify",
        "Samsung",
        "early 2017",
        "64",
        "1340",
        "half",
        "five hundred dollars",
        "two weeks ago",
        "S3",
        "jack",
        "second",
        "Chrome",
        "Google",
        "microSD",
        "Chromebooks",
        "USB-C",
        "Android",
        "the macbook air",
        "Netflix",
        "two",
        "Galaxy",
        "300",
        "first",
        "App Store",
        "2017",
        "eight hours",
        "netflix",
        "ASUS",
        "secondary",
        "eight or more hours",
        "250",
        "microSD",
        "last year",
        "iPhones"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "QUANTITY",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "NORP"
    ]
}