{
    "id": "WuljKartv2U",
    "title": "Samsung Z Flip 5 Review: I Was Wrong!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-08-09T19:10:14Z",
    "video_url": "https://www.youtube.com/watch?v=WuljKartv2U",
    "category": "Science & Technology",
    "tags": [
        "Samsung",
        "Z Flip 5",
        "Samsung Flip",
        "Samsung Z Flip 5",
        "MKBHD",
        "Flip 5 review",
        "Samsung Galaxy Z Flip 5",
        "Galaxy X Flip",
        "reseña Flip 5",
        "Galaxy Z Flip",
        "avaliação do Flip 5"
    ],
    "views": 5572171,
    "likes": 129125,
    "comments_count": 5523,
    "description": "I was wrong about how much I'd like the Galaxy Z Flip 5  MKBHD Merch:   Get a dbrand skin for the Z Flip 5 at    Tech I'm using right now:   Playlist of MKBHD Intro music:   Phone provided by Samsung for review.  ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://dbrand.com/shop/flip5",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "- All right, so I was wrong about the Z Flip 5. Kind of, kind of. (bright upbeat music) All right, so this is the new Z Flip 5 from Samsung. This is their smaller folding phone again, starting at a thousand bucks, and in nearly the same dimensions as last year's 4. And I remember when it first got announced, we had some well-respected reviewers saying, this changes everything. This is the big upgrade, it's the biggest upgrade ever. And my impression was, they've settled here. Now to be fair, my video is examining both the Flip 5 and the Fold 5 and looking at how much the foldables world has evolved in the past year, and how much Samsung seems to be sticking to their tried and true form factors, so it just feels like they're refining and settling into their positions. But now after using the Flip 5 much more over the past couple days, I gotta say I was wrong about this phone. This is actually one of the biggest updates yet. So basically there's three main new differences with this phone over the Z Flip 4, which are the chip, the hinge, and then the new outside display. And I'm gonna go in order of importance here actually, because I think it's a pretty clear order. So first of all, they got this new overclocked Snapdragon 8, Gen 2 chip in here. Great, it's now up to date with the latest flagships. It's the same one that's in the S23 and S23 Ultra. And yeah, it's been a great chip, you know the phone is super responsive. It can handle multitasking, since it's paired with eight Gigs of RAM. It's snappy, apps open quickly, there's no issues here. It can also handle heavy gaming. And I don't even game much on my phone, but it can do it, it's great. The other half of great chip though is efficiency. So when I saw Snapdragon 8 Gen 2 for Galaxy, I was hoping to see maybe an improvement in overall battery life. But I didn't. And I mean I guess I shouldn't be surprised considering the physical battery size is still the same, it's still 3,700 milliamperes, but it's got way more pixels now to power, which we'll talk about that in a second. So the new chip, fine. But y'all have heard me talk about the hinge though. The hinge being the most important physical part of a folding phone, you can't ace a folding phone without acing the hinge. And this hinge is nice. So Samsung for the first time has actually taken parts out of, and simplified the hinge of this phone, which has resulted in less moving parts which is typically a win for long-term durability but also means a little less volume, and a little less thickness around the back of the phone. Shout it to Dave 2D for this graphic, basically illustrating the new internal multi axis folding mechanism that allows the oled inside to have this slightly gentler wider radius when it's folded up, which should put less stress through the middle. Honestly, I don't notice a huge difference with the crease. It's still clearly there, like it's one of those things where you turn the screen off or look off axis and it's very obvious, but once you get into the flow of using the phone, it's very easy to forget about. Honestly, the most important difference here with the hinge is actually just that it folds completely flat now. So every Z Flip up to this point has folded shut with just like a little small gap that could get a little bit of dust, a little bit of sand, a little bit of dirt inside, which is not great when the inside screen is the most delicate part of the phone. So now all these folding phones across the board from everybody, they're all working towards this gapless close. It's still technically not fully dust resistant. I mean it has an IPX8 rating, again. The eight means it can be splashed, but the X means no official dust resistance yet. But it's also an even more satisfying clap now. (clapping phone) And yeah, it's also just, it's slightly more firm. It's a nice sturdy hinge every year, which is hard to appreciate until you go back to the earliest folding phones and see how loose those were. I still personally hardly ever use those like half folded features where you can like prop it up and use the camera like this or like watch videos or whatever. But look, a good hinge is a good hinge. But the biggest change to this phone is clearly the bigger screen on the outside. So let's talk about it. So the Z Flip has gone from this tiny little 1.9 inch slot to a full squared 3.4 inch 720P cover screen called the Flex window. And this is huge, it's a massive improvement, that's way more screen for checking the time or reading notifications, way more screen for framing up pictures with the primary cameras on the outside. It's a huge win for all that stuff. And then also since it's this huge new screen, they've sort of organized this UI of up to 11 pages of apps that you can flip through, sort of encouraging you to use the outside screen more. You're using a phone without even opening it. So you can fully unlock and then just start swiping over to either quickly view and organize your notifications, or move between all these full screen widgets. I have a calendar widget of course, which is scrollable. You've got a scrollable weather widget. Basically these are all, not even really widgets, they're more like mini apps that have been specifically built for this outside screen to be fully functional and optimized. And then if you're feeling bold, you can also jump into the lab settings and start enabling other non-optimized apps to also work on the outside screen. So there is no question, you can do way more with this outside screen than you ever could before on the Flip. The question that's up to you now really is just, will you actually use it? Like how will you use it? And it's a surprisingly hard question to answer. Like when I first saw the phone get released, at first you see like it's a bigger outside screen, but I honestly thought I wouldn't use it much, like I thought I would just continue to use the phone mostly open, and I would enjoy the barrier between me and endless doom scrolling. And maybe I'd check the time or some notifications a little bit more on the outside, but I was wrong. Basically the thing that I found I do much more often, especially like early in the day is, notification management. Just triaging, going through at the beginning through a bunch of notifications and clearing through the ones I don't need, reading the ones that I do need to see. That's way better than opening the phone and like accidentally starting to doom scroll through TikTok or something. So in the lab settings, there's basically only a few apps that you can actually officially enable on the outside screen. It's basically maps, messaging apps, and then Netflix and YouTube, for some reason, for you psychos out there. I definitely tried to answer some texts with the full QWERTY keyboard that shows up on the outside screen now. And yeah, it technically works, but it's like, all right do we really wanna be doing this? Like my hands are too big to be typing on this small of a keyboard regularly. Maybe a few quick responses to stuff here and there, maybe voice to text a little more often, but nothing too crazy. There's actually also even a whole app in the Samsung Galaxy store called Good Lock, with an extension called Multi Star. And basically if you have both of these, it lets you add a launcher to the outside screen with literally any app on your phone. And so you can go through and experiment and find all kinds of weird stuff that kind of works here. Like you can technically just scroll through Twit-, or through X if you want to. You can flip through your favorite Reddit app before it disappears, or you can move around Spotify playlists, and these are all kind of not bad. There are also plenty of apps that are an absolute nightmare that look ridiculous in a square. So I wouldn't recommend that, but I still feel like the whole point of having a flipping phone remains the same. Like this barrier between open and shut, like it's nice to have the outside functionality, but this action really signifies, okay, now I'm about to get in and like actually do something on my phone. It just really becomes up to you where that line is of like, when do you open it, versus when you do something on the outside. And I think that my theory is it's just time. It's just how long does that action take? So if it's just checking your notifications or just reading the time or something quick like that, or pausing your music, that takes two seconds. Green light, like that could be on the outside screen. But watching a two hour Netflix documentary, or something that takes like writing an email, you don't wanna do that on the outside screen, that's a red light. And then there's a whole bunch of stuff kind of somewhere in the middle, like flipping through a new playlist in Spotify maybe, or checking your calendar or just like little brief stuff, that's up to you. So yeah, if I could give Samsung any feedback on this thing that they've made here, I mean I think they will continue to settle into this general shape, I think they're pretty locked in with it. But two things; One, the outside screen is 720P, and if you look closely enough, you can see some pixels, so maybe a little resolution bump would be nice. But I think more importantly actually is LTPO. This is a 60 hertz outside screen, so it's 60 hertz all the time. And I think if you had an LTPO screen, first of all it would match the 120 hertz max refresh of the inside, which it's not the end of the world that they're different, but also that could save battery life. Being able to go down to one hertz when you're only just like play/pausing music, or reading a quick notification or something, that could help with the relatively small batteries on these phones. Oh, and maybe add decks. That would be kind of nice too. So, all right, at the end of the day, should you buy the Z Flip 5? Honestly, the truth is that I think this is the best folding phone on the planet for the most people right now. It's a great high-end chip, the cameras are still solid, the battery life is at least decent, like the fingerprint reader is super fast. It hits a lot of fundamental stuff. It's not missing any massive features, you got wireless charging, IPX8, and they raise the base storage from 128 to a respectable 256 Gigs for the $1,000 starting price, which is about as good as it gets with foldables. And yeah, the colors aren't that interesting, but I do love a extremely easy to install dbrand skin on the back, since it's literally just a square of glass. So I drop the icon skin on there, easiest install of my life. But yeah, until they do make some big jump in the form factor, or some change to this thing, as long as they're settling into this, this is the safest, easiest to recommend foldable on the planet, easy. And it even has the five year window of security updates, like this feels like, this feels like the iPhone of Android foldables. I made a video about the iPhone of Android, I'll link that below if you wanna check that out too. But either way, that's been it. Thanks for watching, catch you in the next one. Peace.",
    "transcript_keywords": [
        "phone",
        "screen",
        "Flip",
        "folding phone",
        "hinge",
        "apps",
        "Samsung",
        "folding",
        "basically",
        "Great",
        "chip",
        "Kind",
        "yeah",
        "phones",
        "time",
        "stuff",
        "notifications",
        "nice",
        "good hinge",
        "great chip"
    ],
    "transcript_entity_values": [
        "little 1.9 inch",
        "Flex",
        "Gen 2",
        "every year",
        "120",
        "three",
        "Spotify",
        "one",
        "One",
        "Z Flip 5",
        "Flip",
        "the day",
        "Reddit",
        "the end of the day",
        "256",
        "two hour",
        "1,000",
        "8",
        "Snapdragon",
        "eight",
        "128",
        "UI",
        "Android",
        "4",
        "3,700 milliamperes",
        "half",
        "first",
        "QWERTY",
        "last year's",
        "Netflix",
        "Flip 5",
        "a thousand bucks",
        "IPX8",
        "Multi Star",
        "the past couple days",
        "the past year",
        "second",
        "YouTube",
        "two seconds",
        "Samsung Galaxy",
        "3.4 inch",
        "60",
        "TikTok",
        "the five year",
        "two",
        "Dave 2D",
        "Samsung",
        "Good Lock",
        "up to 11"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "DATE",
        "GPE",
        "DATE",
        "CARDINAL",
        "TIME",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "LAW",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORG",
        "TIME",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}