{
    "id": "WuP8tOEbO60",
    "title": "Is Apple in TROUBLE?",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-03-04T02:41:59Z",
    "video_url": "https://www.youtube.com/watch?v=WuP8tOEbO60",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "Apple",
        "Epic Games",
        "Arizona",
        "bill",
        "legislation",
        "Coalition for App Fairness",
        "iOS",
        "App Store",
        "payment methods",
        "Arizona bill"
    ],
    "views": 645976,
    "likes": 37722,
    "comments_count": 1173,
    "description": "Head to  and activate Honey for free to start saving today! Thanks to Honey for sponsoring this video.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      Timestamps: 0:00 no tech news? unacceptable! 0:10 RX 6700 XT announced 1:22 Chrome losing third-party cookies 2:26 Arizona passes anti-Apple bill 3:38 Honey 4:12 QUICK BITS 4:20 Intel drops overclocking warranty 4:51 Microsoft Hololens stuff 5:21 Twitter Clubhouse clone on Android 5:48 DJI FPV drone 6:12 Sinking City Developer DMCA's their own game  NEWS SOURCES  DO YOU HAVE A PRESCRIPTION RX 6700 XT  March 18 for $479        Smart Access Memory on Ryzen 3000 series    WHO TRACKS THE TRACKERS Chrome ditching third-party cookies  bad for advertisers   no alternative trackers   Firefox does this and has Total Cookie Protection   Brave making its own search engine   ARIZONAS HEATING UP Arizona passes bill requiring Apple to allow third-party payment methods       Epic Games acquires Fall Guys developer Mediatonic    QUICK BITS  CLOCKSTOPPERS Intel discontinues overclocking warranties     Maybe because they just got hit with 2.2 billion fine    HO-LOL-OLENS Microsoft Ignite Power Automate Desktop free   Mesh   Pokemon Go Hololens   also wants you to patch server flaws    CAN I BE IN THE CLUB Twitter copies Clubhouse with spaces     DRONE GO BRRRR DJI FPV drone      SHOOT HIM, IM THE REAL GAME Sinking City developer DMCAs their own game off of Steam      ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "http://joinhoney.com/techlinked",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://linustechtips.com/topic/1311716-amd-announces-the-rx-6700-xt-available-march-18-for-479/",
        "https://www.anandtech.com/show/16526/amd-announces-radeon-rx-6700-xt-1440p-gaming-479-march18",
        "https://youtu.be/jjBqaGLRycc",
        "https://youtu.be/VOWPt56iZoE",
        "https://hexus.net/tech/news/cpu/147498-amd-brings-smart-access-memory-ryzen-3000-series-cpus/",
        "https://blog.google/products/ads-commerce/a-more-privacy-first-web/",
        "https://www.wired.com/story/chrome-cookie-update-advertisers-google/",
        "https://chromeunboxed.com/google-privacy-first-web-no-trackers-floc",
        "https://blog.mozilla.org/security/2021/02/23/total-cookie-protection/",
        "https://www.pcmag.com/news/brave-is-building-a-privacy-focused-search-engine-to-counter-google",
        "https://www.theverge.com/2021/3/3/22309284/arizona-app-store-bill-2005-apple-30-percent-cut-bypass-legislation",
        "https://www.cnbc.com/2021/03/03/arizona-house-passes-bill-that-threatens-apple-and-googles-app-stores-.html",
        "https://www.macrumors.com/2021/03/01/apple-arizona-bill-lobbying/",
        "https://www.kitguru.net/gaming/matthew-wilson/epic-games-acquires-fall-guys-studio-mediatonic/",
        "https://linustechtips.com/topic/1311112-intel-is-dropping-its-overclocking-focused-warranty/",
        "https://www.extremetech.com/extreme/320442-intel-discontinues-overclocking-warranties-as-hobby-continues-to-die",
        "https://tuningplan.intel.com/",
        "https://arstechnica.com/tech-policy/2021/03/intel-hit-with-2-2-billion-patent-judgment/",
        "https://www.thurrott.com/windows/windows-10/247728/power-automate-desktop-app-for-windows-10-is-now-available",
        "https://youtu.be/Jd2GK0qDtRg",
        "https://youtu.be/ICaWblVgv6A?t=67",
        "https://linustechtips.com/topic/1311570-microsoft-urges-businesses-to-patch-critical-exchange-server-flaws/",
        "https://linustechtips.com/topic/1311610-twitter-beats-clubhouse-rolls-out-spaces-beta-for-android-users-earlier/",
        "https://techcrunch.com/2021/03/02/twitter-spaces-arrives-on-android-ahead-of-clubhouse/",
        "https://www.engadget.com/dji-cinematic-fpv-drone-first-person-view-price-release-date-140032533.html",
        "https://www.youtube.com/watch?v=LVoPGlNvHhw",
        "https://www.vice.com/en/article/epdw7p/the-sinking-city-developer-uses-dmca-to-remove-its-own-game-from-steam",
        "https://twitter.com/Frogwares/status/1365385278140133378",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "(Riley clucks admonishingly) - Here you are with nary a tech news to your name. It simply won't do! James! Don't worry. We'll fix you right up. (cackles) After the appropriate amount of information had leaked, as required by traditional PC gamer culture, AMD officially announced the RX 6700 XT today. The card comes with 12 gigs of memory, 40 Compute units, and according to AMD, can perform about as well as Nvidia's RTX 3070 at 1440p while costing $20 less at $479 U.S. Unfortunately, that's still higher than many fans expected, leading some to accuse AMD of capitalizing on the current low supply, high demand market situation by raising prices, which is not something that happens very often in the economy! I think. I've never taken an economics class. I... What? Laissez-faire, man. AMD also announced that their implementation of Resizable BAR, called Smart Access Memory, which allows Ryzen CPUs to directly access GPU memory, will work with Ryzen 3000 series CPUs, not just the upcoming 5000 series chips. Which means they might have a bit of a leg up on Intel and Nvidia, which, as a reminder, are other companies that release products you can't buy. But if you really wanna try, the RX 6700 XT will launch March 18th. - [James] Get your bots ready! (Riley giggles) - (grumbling) Programming! Last year Google announced it would remove support for third-party cookies in Chrome, which allow companies other than Google to track you across the web in order to serve you ads for things that you might actually be interested in, like a pillow shaped like a processor from LTTStore.com. Hey! Get outta here! - Yep yep! It's your boy! - Well, today Google said once they get rid of all those nasty third-party cookie crumbs, they're not going to build alternative identifiers that track individuals as they browse the web, nor will they use them in their products. Which kinda makes it sound like that's exactly what they're gonna do. I could almost hear the wink in that sentence. Also, why do you need to say you're not gonna use the thing that you said you wouldn't build? Just a question. - Switching to Firefox. - Google's clearly trying to keep up with their consumers' demand for privacy, an area where browsers like Firefox- - See? - Exactly! You got there, James. And Brave, are a step ahead. Google says they can make this change without breaking the way that web advertising works, but it's unclear that means things won't break for Google while breaking for everyone else. - [James] Suck it, Zuck! - Zuck it! And Arizona has passed a bill that would prevent tech giants from forcing an app developer from using a preferred payment system, a landmark piece of legislation that could have a big impact on Appic... Appic? Maybe the should just merge. Apple and Epic, you know? Make up finally and become one company. A big impact on the fight between Apple and Epic over the iOS App Store. The bill also prohibits companies like Apple or Google from retaliating against developers who elect to use third-party payment systems. Just like the recent similar North Dakota bill, this one was influenced by the Coalition for App Fairness, which is like Epic's club for companies burned by Apple's mean App Store rules that suck. That's the acronym. I can't say it. The bill being passed could be the start of a legislative wave sweeping through the U.S. state by state until iPhones are literally just open source devices you can install Windows on if you want, or could... That couldn't happen. Could be nothing. Either way, despite all the lobbying, Epic Games seems to be sitting pretty. They just bought the developer of \"Fall Guys,\" the pandemic era smash hit that everyone's still playing, right? Everyone- - Drake? - Drake, are you there? - Hello? - I bought a Drake skin. Now it's time for Quick Bits, brought to you by Honey, the free shopping tool that finds the best promo codes whenever you shop online at specific sites, and by specific I mean over 30,000 stores, including Amazon, eBay, Newegg, Razor, Best Buy, Walmart, and more! - [James] That's all of 'em. - I just listed 30,000 stores! Honey gets a small commission from sites where Honey saves you money, which means it's free for you to use. And it installs in just two clicks. Those of you who have downloaded Honey from our link have already saved $100,000 in the last few months! So get Honey for free right now at joinhoney.com/techlinked or click the link below. Oh my gosh. You have to try these Quick Bits. - [James] No... - What? - Way! Shut the front door! - Ah! Intel has discontinued it Performance Tuning Protection Plan which provided an extended warranty covering processors that get damaged by overclocking. Intel says the PTPP wasn't needed anymore because overclocking is so easy now. And demand for the warranty was low, so they're listening to their customers and responding to them. It's not at all because they were just ordered by a judge to pay $2.2 million to a patent troll company after losing a lawsuit. - [James] Those are customers too. - Well, that's true. Yeah, those don't... That actually doesn't work together. I thought they would go nicely together. Microsoft's Ignite conference kicked off this week and besides the super nerdy announcements like Power Automate Desktop now being free, we got yet another flash concept video about how HoloLens is going to revolutionize work. - [James] In another 10 years. - Exactly. Microsoft Mesh is basically AltspaceVR. Microsoft acquired AltspaceVR, so that makes sense. And there's also a \"Pokemon Go\" HoloLens demo, wow! Huh! This was fun! Can't wait for next year's HoloLens concept video. It'll get here someday. The audio chat app Clubhouse is currently being cloned by the bigger tech platforms, but Twitter's clone, called Spaces, is making some features available on Android. Clubhouse itself is only available on iOS and is invite-only. - [James] That's what the cool kids do. - Exactly, I mean, it makes your app cool, but it also makes it harder to download. And all the coolness draws the attention of the big guys and they clone your app. But you do have the cool thing going. - Mmm. - And I love being cool. DJI officially unveiled their FPV drone yesterday, which works with the company's FPV goggles and combines elements of racing and cinematic drones. You can fly with GPS and visual positioning systems, like a normal DJI drone, or take full manual control to make it act more like a Cinewhoop-style drone. - Whoop, whoop! - Do you know what that is? - [James] Nope, whoop, nope! - \"I'm taking the Cinewhoop for a whoop-whoop.\" And a game developer has managed to force its own game off of Steam, which is not something you hear every day. You see, Frogwares, developer of \"The Sinking City,\" had do DMCA their former publisher... Nacon? Who had published the game on Steam without Frogwares' approval. Their reasoning: \"Doesn't look like that cool of a game anyways, guys.\" Whoa! Rude! Why would you... Better get at 'em on Twitter for that. It would be rude to continue this episode, so it's over. Come back on Friday for more tech news. You know, the kind that really sticks to your ribs. - [James] Oh, I thought you were gonna say tongue. - That sticks to your tongue. - Like a frog? (Riley squeaks)",
    "transcript_keywords": [
        "Google",
        "app",
        "AMD",
        "Honey",
        "Epic",
        "App Store",
        "Apple",
        "cool",
        "makes",
        "Smart Access Memory",
        "access GPU memory",
        "Quick Bits",
        "game",
        "developer",
        "memory",
        "companies",
        "bill",
        "AMD officially announced",
        "tech",
        "free"
    ],
    "transcript_entity_values": [
        "Clubhouse",
        "James] Suck",
        "DMCA",
        "Riley",
        "U.S.",
        "- Drake",
        "Google",
        "Amazon",
        "Last year",
        "Walmart",
        "Twitter",
        "Chrome",
        "Quick Bits",
        "Friday",
        "App Store",
        "third",
        "these Quick Bits",
        "AMD",
        "Nvidia",
        "FPV",
        "March 18th",
        "iPhones",
        "Ryzen 3000",
        "Epic Games",
        "Drake",
        "the last few months",
        "Epic",
        "James] Nope",
        "today",
        "30,000",
        "100,000",
        "next year's",
        "Newegg",
        "the Coalition for App Fairness",
        "3070",
        "Arizona",
        "Fall Guys",
        "another 10 years",
        "AMD",
        "Firefox",
        "over 30,000",
        "GPU",
        "eBay",
        "this week",
        "$2.2 million",
        "Steam",
        "20",
        "RX 6700 XT",
        "Frogwares",
        "North Dakota",
        "Cinewhoop",
        "HoloLens",
        "PTPP",
        "Microsoft",
        "James] Oh",
        "DJI",
        "Spaces",
        "Android",
        "12",
        "Ryzen",
        "Best Buy",
        "Apple",
        "Appic",
        "yesterday",
        "Pokemon Go",
        "Windows",
        "Intel",
        "Power Automate Desktop",
        "40",
        "479",
        "5000",
        "Compute",
        "Zuck",
        "The Sinking City",
        "Microsoft Mesh",
        "Razor",
        "Smart Access Memory",
        "Frogwares",
        "just two",
        "Nacon",
        "James"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "NORP",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "GPE",
        "NORP",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON"
    ]
}