{
    "id": "wvhP1al3Ur4",
    "title": "Mac Studio Review: Double Trouble!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-03-18T21:35:13Z",
    "video_url": "https://www.youtube.com/watch?v=wvhP1al3Ur4",
    "category": "Science & Technology",
    "tags": [
        "Mac Studio",
        "Mac Studio review",
        "M1 Ultra",
        "M1 Ultra vs",
        "M1 Ultra vs M1 Max",
        "MKBHD"
    ],
    "views": 4085881,
    "likes": 136861,
    "comments_count": 4781,
    "description": "This M1 Ultra machine is incredible, but I'm not switching YET  M1 Max MacBook Pro review:  BluDot Desk:  Scott Simmons:   MKBHD Merch:   Review spec: M1 Ultra, 128GB, 2TB, 64-core  0:00 Intro 1:52 The Design/Ports 4:00 Modular? 6:00 Benchmarks 8:06 Real World Performance 11:45 Incredible Packaging 12:35 You Probably Don't Need One  Tech I'm using right now:   Intro Track: Jordyn Edmonds  Playlist of MKBHD Intro music:   Computer provided by Apple for review.  ~",
    "description_links": [
        "https://youtu.be/rr2XfL_df3o",
        "https://www.bludot.com/cant-desk.html",
        "https://www.provideocoalition.com/review-mac-studio-and-the-m1-ultra-for-video-editors-part-1/",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://smarturl.it/jordynedmonds",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(light music) - Welcome to the review of the Mac at the Studio. I mean, welcome to the review of the Mac Studio. (upbeat music) All right, so this is a computer I personally got really excited about when they announced it because we've built a video studio here and this computer's literally called the Mac Studio. So the entire purpose is to be the ideal computer that is small and powerful enough to be in a studio environment. And they had all these example studios in the Apple event from music studios, to design studios, to specifically video studios. And so they made a little cube the size of 2 1/2 Mac minis with a bunch of I/Os, some new cooling, and an M1 Max or an M1 Ultra chip inside specifically to live in these studio environments. So now, I've got one here in our studio. So I've been throwing all types of tasks and projects and accessories at this thing, including this new Studio Display, which I also plan on making a separate review about 'cause it's pretty weird. Make sure you get subscribed for that. And I actually have two but I've mostly been putting my time into testing this M1 Ultra version because it's the newest, biggest, baddest chip. So I call this the 2x Machine. Basically everything about this machine is doubled. Now I'm gonna be referring to the M1 Max chip a lot during this review. So if you haven't already seen the MacBook Pro review with the M1 Max chip in it, that's gonna be very helpful. I'll leave that link below the like button. This one basically doubles all the things. So physically speaking, it's basically like two Mac minis stacked on top of each other, melted into one thiccc Mac mini. Three Cs. And this is incredibly small for the amount of power it puts out. It can sit on any desk alongside speakers or a monitor or whatever you set it up with. Also, and this is a total coincidence, but I set mine up on this desk I got from Blu Dot, which already has a bunch of these perforated holes that remind me of the Mac, and it fits absolutely perfectly underneath the shelf so that a monitor can sit on top of the shelf without actually sitting on top of the computer. Anyway, this is the back of the computer, which has a full suite of I/O, even more ports than the Mac mini. There are four Thunderbolt 4 ports, a 10-gigabit ethernet port, the power plug, two USB-A ports, an HDMI 2.0 port, not 2.1 again, for some reason, and a headphone jack that can support higher impedance headphones, just like the MacBook Pro. Now it's not kicking out world-class audio by any means, it's not gonna replace my Universal Audio DAC, but it is convenient to have. Kind of the same way HDMI is convenient. Although, I'm kind of surprised this one doesn't do HDMI 2.1. I get it on the laptop. That's just so you can plug in a random monitor on the go but this is gonna sit at your desk and it would be nice to have high fresh rate. But at the same time, the four Thunderbolt ports will support up to four Pro Display XDRs, which are all 6K, so I guess you got that going for you. But then, at the front, hey, look. Look at that, front I/O, which is nice 'cause this is gonna sit on a desk, not under it. So up front here, that's gonna be two USB-C ports if you get the base M1 Max version but those graduate to two Thunderbolt 4 ports if you get the M1 Ultra version because there's literally more buses available. And then an SD card slot because every studio I know has tons of SD cards lying around somewhere. So it turns out if I wanted to replace my Mac Pro today, that is enough I/O for me to actually do that. So I've got two Thunderbolt displays and then one Thunderbolt RAID Array, and the DAC, the Universal Audio DAC is also Thunderbolt. So all together, plus a couple of card readers, I'd be set. Now Apple did use the word modularity in their presentation. I don't know if that word means what they think it means. I mean, maybe if they're just trying to say because it's not connected to a display and you can choose your own unlike the iMac, that's what they're considering modular. If not, then I have no idea what they're talking about because this thing is absolutely not modular at all. All of the parts inside are soldered in. There is no upgrading of the RAM or the GPU or any parts of this thing ever for the entire lifetime of the machine. I'm not even sure there's any reasonable way to actually open up and get into the Mac Studio. So, yeah, I can't give you modular on this one, Apple. But, also, this level of vertical integration is basically required to get a computer to be this small and this efficient. I've seen some small PCs before. This one is tiny. Also the power supply is built-in, so there's no wall wart. It's all just in this little box. Also, fun fact, Apple did send both the M1 Max and M1 Ultra versions here to the studio to test. And the M1 Ultra version is, in fact, noticeably heavier than the Max. It's two whole pounds heavier. It turns out that's because the heat sink they used in the Ultra version is made of copper instead of the aluminum one they put in the M1 Max. It's much more dense, it's heavier, it's pretty serious. But, I think that's my cue to talk about the inside of this machine a little bit more because that's where the 2x theme starts up again. So you remember the event, the M1 Ultra is literally two M1 Maxes basically fused together with a high enough bandwidth between them to behave like one huge megachip, which is awesome, because that means two times the CPU cores, two times the GPU cores, two times the memory bandwidth, and two times the total memory. So in applications that can take advantage of this stuff, well, this should be twice the machine. Now, Apple did the whole thing they always do with graphs, and you can never really take these completely at face value. I did do some synthetic benchmarks though, and for a lot of them, it does behave like twice the computer. It absolutely blew the doors off every other Mac ever made, especially including the iMac Pro and it even flirts with the 28-core cheese grater Mac Pro that I've been using. So in Geekbench, it ties the highest single-core score I've ever seen. And then it drops a multi-core score, literally double the M1 Max MacBook Pro. And yes, that also makes it more powerful in the CPU department than any other Mac ever, including 28-core Mac Pro. Then in the Cinebench test, which I think is a little more realistic, ran it for 10 minutes, and it gave me around 24,000, which, again, is about double the M1 Max and is right in line between a 16-core Threadripper and a high thread count Xeon chip like the Mac Pro. Basically the CPU benchmarks are killer. Intel could never. But, then, we gotta talk about GPU stuff. It gets a little more interesting. So you might remember, Apple's graphs were comparing, at one point, the Ultra to an RTX 3090. They kept saying it'll have the same performance as an RTX 3090 but at 200 watts less power. And that's very impressive, but it turns out, the graph should continue a little something like this because the RTX 3090 will happily continue to draw way more power, up to 400 watts of power. It's one of the power hungriest cards ever. So shout-out to Chaim Gartenberg at The Verge for this chart inspiration. So it turns out, it doesn't beat the RTX 3090 at anything that you would buy an RTX 3090 for, which I didn't really expect it to, because that card's almost exclusively for gaming. You buy that to play games and you would never buy this to play games. But, hey, double the cores still do double the work. So on Geekbench's Metal benchmark, which measures GPU performance with things like image processing, I got nearly double the score of the M1 Max MacBook Pro, cracking 100,000, which is around what a Radeon Pro Vega II Duo in my Mac Pro scores, but the Mac Pro has four of them. Now, synthetic benchmarks are cool and everything, but you don't buy a computer like this to just try to get the highest benchmark scores. You buy a new computer to see if that new power can translate to real-world performance and real-world workflows. And so basically what I've noticed most is, the more well optimized the app, the closer you get to those 2x performance numbers. Nothing really typically hits exactly 2x, but the M1 Ultra does feel faster a bit sometimes than the M1 Max. I mean, in everyday performance, just zipping around the Mac, yeah, this thing slaps. It makes me really wish I had a higher refresh rate monitor here that plays nicely with the Mac because that would actually feel way more responsive like the MacBook Pro with its Pro Motion screen, but 5,000-plus megabytes per second read/write speeds from the drive, things open instantly, it's great. And then in my own workflow, you might know by now I'm a Final Cut Pro editor here, it did give me more headroom, and it did perform better than the M1 Max MacBook Pro. But, again, it didn't quite beat the Mac Pro I'm currently using. Basically it's gotten to the point where I can drop fresh 8K raw files on the timeline in better quality playback mode, immediately hit play, and start tweaking color and messing with raw settings, and it plays back perfectly at 30 frames without hesitation. Minimal lag when I hit the play button, I love it. It's when you start adding layers of objects and plugins and animations and trackers on top that things do start to slow down, and I can still bring it to its knees with enough layers of moving objects. I had six at the beginning of the iPad Air review, but then when I got to the export at the end of the video, it took the Mac Studio 7 minutes and 30 seconds to export my iPhone SE review, which is pretty impressive. But, interestingly, this same project took 6 minutes and 5 seconds to export from the Mac Pro so it's still more powerful. It just has more raw horsepower. But, of course, not everybody's using Apple's own apps like I do with Final Cut. There are plenty of Premiere studios. There are lots of DaVinci Resolve studios. Hell, even in this studio, we've got people using heavy Photoshop and After Effects stuff for thumbnails and motion graphics. So I am happy to report that Adobe has been working through their suite. The newest After Effects beta is dramatically faster on Apple silicon, so that's awesome. And I'm gonna look an article from Scott Simmons, where he went through a bunch of tests between Premiere and Resolve, comparing the M1 Ultra with the M1 Max, and you can see a consistent performance improvement with all the heavier stuff like adding warp stabilizer, rendering a heavy clip, et cetera. The only thing I did find where the M1 Ultra didn't beat the M1 Max was interestingly just a straight up ProRes video export. Sorry for the tons of video comparisons, but, hey, it's a video studio. So this was one area where it did smoke the Mac Pro because the new ProRes, the media engines in these Apple silicon products are great. The M1 Ultra has literally double the media engine of the M1 Max, so I thought it would be twice as fast. While they both beat the Mac Pro, it was roughly the same time to export a single ProRes clip. But generally, yeah, it might not have matched the Mac Pro at every single little thing I threw at it, but, yeah, if you're not a video person, I'll let you find the benchmark that applies best to your workflow. But, generally, with the stuff I threw at it, M1 Ultra heavily outperformed M1 Max. And it did it all very quietly with very little heat in this tiny little box that just sits inconspicuously on your desk. I mean, this computer makes it so obvious why they were eager to ditch Intel. Also, let me give a shout-out to the sustainability element here too. So they use recycled materials inside these computers. That's cool. And then even the packaging, I don't think people understand how hard this is. The packaging for these computers is absolutely incredible. Fully recyclable, lots of padding, moving parts, and then with a literal floating cardboard platform in the middle for shock absorption; it's wild. I would not be surprised if just this box added 50 bucks to the price of the computer just to engineer such a ridiculous package. But, as far as real-world impact, the biggest chunk of that will come from the efficiency of these chips, of course. Apple says that it'll use over 1,000 kilowatt hours less energy per year than an average PC desktop. That's good for your electricity bill, but that's also good for the environment. But at the end of the day, look, this is just a tool, right? Just like the app or program you're using already, it's just a tool. And so I think people look for the the benchmark that will prove that this machine will make them better at what they do. It can't do that. Just 'cause it's fast, if you're bad at editing and you get this machine, you'll still be bad at editing but just faster. But I am really happy to see new machines like this still coming out that do make big leaps in performance and capability. Sort of raises the ceiling for what you can do. Now, all that being said, the Apple silicon Mac Pro is still coming. And I say that, not even like as a warning to most people, but just to remind myself because, honestly, most workflows are covered with the Mac Studio. Like, today, if I'm a YouTuber and I'm just editing 4K or 8K even, ProRes all the time, this will able to handle it. But if you're doing large 3D modeling projects or tons of tracking and layers in After Effects, or even in audio projects, lots of plugins and video stuff, if you're really pushing the limits of your machine, the Mac Pro platform still does offer the most horsepower. So, I mean, it shouldn't be surprising that the current 40-pound, 28-core, 768-gig of RAM Mac Pro manages to slightly outperform this little tiny box here. But when we do get the new Apple Silicon Mac Pro, I do expect performance to double this one up again, which is crazy to say out loud. But for everyone else, this thing is overkill. And I love that that's the narrative around this computer. Do you really need that much power? Probably not. But, hey, at least it's $5,000 of overkill versus $25,000 of overkill. So, it's a bargain. Either way, that's been it. Thanks for watching. Catch you guys in the next one. Peace! (upbeat music)",
    "transcript_keywords": [
        "Mac Pro",
        "Mac",
        "Max MacBook Pro",
        "Mac Studio",
        "Pro",
        "silicon Mac Pro",
        "Apple silicon Mac",
        "RAM Mac Pro",
        "Max",
        "Mac Pro scores",
        "MacBook Pro",
        "Studio",
        "Ultra",
        "Mac Pro today",
        "Mac Pro platform",
        "Apple",
        "grater Mac Pro",
        "Mac Pro manages",
        "Ultra version",
        "computer"
    ],
    "transcript_entity_values": [
        "Apple",
        "four",
        "two whole pounds",
        "Universal Audio DAC",
        "2x",
        "5,000",
        "ProRes",
        "the Mac Studio",
        "up to four",
        "Geekbench",
        "the M1 Ultra",
        "the MacBook Pro",
        "YouTuber",
        "the Mac Pro",
        "M1 Max",
        "Cinebench",
        "today",
        "The Verge",
        "3090",
        "M1 Max MacBook Pro",
        "Threadripper",
        "one",
        "RAM Mac Pro",
        "Thunderbolt 4",
        "iMac",
        "100,000",
        "Three",
        "2 1/2",
        "Max",
        "M1 Ultra",
        "around 24,000",
        "USB-C",
        "iPhone SE",
        "Radeon Pro Vega II Duo",
        "the Mac Pro",
        "iPad Air",
        "M1 Maxes",
        "2.1",
        "Photoshop",
        "Resolve",
        "Xeon",
        "the iMac Pro",
        "200 watts",
        "two",
        "The M1 Ultra",
        "Premiere",
        "25,000",
        "Chaim Gartenberg",
        "Mac",
        "the Mac Pro",
        "MacBook Pro",
        "Intel",
        "Ultra",
        "50 bucks",
        "6 minutes and 5 seconds",
        "28",
        "the Mac Pro",
        "SD",
        "Adobe",
        "GPU",
        "5,000-plus megabytes",
        "Pro Motion",
        "second",
        "Mac Pro",
        "RAM",
        "the MacBook Pro",
        "jack",
        "the entire lifetime",
        "DaVinci",
        "Thunderbolt",
        "10 minutes",
        "10-gigabit",
        "8",
        "400 watts",
        "7 minutes and 30 seconds",
        "Scott Simmons",
        "4",
        "Final Cut",
        "ProRes",
        "40-pound",
        "Studio Display",
        "Apple Silicon Mac Pro",
        "Mac",
        "SD",
        "6",
        "CPU",
        "six",
        "16",
        "the end of the day",
        "Blu Dot",
        "USB",
        "over 1,000 kilowatt hours",
        "30"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "NORP",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "DATE",
        "FAC",
        "PRODUCT",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "LAW",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "TIME",
        "CARDINAL",
        "LAW",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "FAC",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL"
    ]
}