{
    "id": "WvnMIPQLauc",
    "title": "The swagged-out pope is an AI fake | The Vergecast",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-03-31T14:21:33Z",
    "video_url": "https://www.youtube.com/watch?v=WvnMIPQLauc",
    "category": "Science & Technology",
    "tags": [
        "ai",
        "midjourney",
        "pope ai image",
        "pope ai photo",
        "pope ai",
        "pope puffy white coat",
        "ai art",
        "midjourney ai",
        "midjourney tutorial",
        "ai art generator",
        "midjourney prompts",
        "ai generated art",
        "how to use midjourney",
        "midjourney v5",
        "openai",
        "midjourney tips",
        "midjourney art",
        "ai robots",
        "ai tools",
        "open ai",
        "tech",
        "tech news",
        "the verge",
        "vergecast",
        "the vergecast",
        "vergecast podcast"
    ],
    "views": 13365,
    "likes": 279,
    "comments_count": 20,
    "description": "Let's talk about the pope. Images of the pope wearing a white puffy jacket went viral this week. Theyre AI-generated but show how difficult it will be to distinguish fakes from reality in the future. #technology #ai #podcast   Watch the full episode here:   Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://www.youtube.com/watch?v=5FngDg3a2iI",
        "http://bit.ly/3MbUfy9",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "(upbeat music) - Let's talk about the Pope. (upbeat music) An amazing sentence to say on this AR technology podcast, but this week, Midjourney, which is a generative AI tool that makes images, released an update. The images can now be vastly more photorealistic, and the first thing that happened was people made images of the Pope just absolutely swagged out in a gigantic white puffy coat. - Well, actually, the best part of this is that's the second thing that happened. - [Nilay] Okay. - The first thing that happened was somebody tweeted a generated picture of Donald Trump being arrested that no one fell for, and actually, it sparked this really interesting thing about, like, oh, look at this fake picture. Someday, people are gonna fall for these, but it didn't become a thing, and then literally a couple of days later, the Pope swagged out in a giant puffy coat gets everybody. (David laughing) - That got 'em! - Yeah, so, and this is like the heart of the story. This is like the most Vergecasty thing, right? Why did the information environment know not to fall for Trump being arrested, even though he's tweeting, \"I'm about to be arrested.\" - [David] Right. - And then everyone, I think, had the same reaction, which is they were scrolling on whatever feed somewhere and, like, you know, the swagged out Pope showed up and everyone was like, oh, that rules, and, like, moved on, right, and, like, there are no stakes to falling for it. - Right. - And so no one applied their, like, critical thinking skills until later when people were like, when various writers and people were like, hey, the fake pope is the portent of doom, that we all had to, like, take a step back. You should go look at these images if you haven't seen 'em. I can't imagine you're listening to this show. James Vincent wrote a great piece. The headline is \"The Swagged Out Pope is an AI Fake and an Early Glimpse of the New Reality,\" a perfect Verge headline. You should go read that piece. You should go through the images. They are remarkably realistic. There's some pieces of them that make it easy to spot. Like, this new version of Midjourney, it's kind of like, everything's, like, a little too HDR. Everything kind of looks like the clarity slider in Lightroom has been turned up too far. So, they have a style, which is interesting in and of itself. Like, you tell Midjourney, make a thing that looks like a real photo and it is like, okay, we've mined Zillow for the most whacked out HDR real estate photos that can exist, and that's the style we're using for the Pope. - One of the things I thought was really interesting is there have been people, like, with some of these Trump photos, that are starting to come out where you can say things like, make it look like it came out of a TV camera, and the people making these images are getting better and better at teaching the system how to replicate the weirdness of photos that we see in the world, 'cause in a weird way, like, Instagram has trained us to not notice that a photo isn't real anymore. Like, first, we had filters. - [Nilay] Yeah. - And now, we have all these incredibly nuanced tools that people can use to change things, and it's generally true that if you look really, really, really hard, you can figure it out, right? Like, there are telltale signs in, like, the dynamic range and the contrast and often the hands, but, like, the argument that you should zoom this photo to 200% and inspect every pixel in order to see if this is real is ridiculous and we're way past that point. Like, the idea that you can just sort of quickly look at it and be like, that's not what faces are, which is what these things were six months ago. - Yeah. - We're so far down the road of, like, this looks like a regular photo that a normal human might have edited to have this kind of style and then posted on the internet. Like, we've crossed some Rubicon there. - The Pope one is really interesting 'cause his glasses are melting onto his face. (Alex scoffing) Like, it's right in front of you. - Yeah. - Like, you don't have to necessarily, you should go look at his hands. Everyone should go look at this picture. There's a bunch of stuff in it that would tell you, but the first one is that his glasses are melting into his face. - Well, you're too distracted. - And you just start to overlook it, unscroll. You're like, I don't know, look at that jacket, and you just, like, miss it. - Yeah. The jacket is really, really good. Like, I want that jacket. I wish the jacket existed, the one that makes it look like it's got, like, the little Pope cummerbund built in. I was like, yes! Beautiful. No notes. I don't even care that his glasses are melting into his face. That's just an aesthetic choice for him, I assume. (Nilay laughing) - Yeah, and as James points out in his story, there's a couple of other things too, right? Like, the cross he's wearing on a necklace is sort of warped and melted, like Salvador Dali-style. His hand looks crazy with. - [Nilay] Yeah. - The thing that he's, like, if you spend 15 seconds with this photo, you can pretty quickly figure out it's not real, but, like, how many photos do you spend 15 seconds staring at going, is this a thing? Like, are we supposed to do that with every picture we see from now on for the rest of our lives? - So, bring that back around to Donald Trump, right? I didn't even think of it as the first thing that happened. Like, of course, the first thing that somebody made with this tool was a photo of Trump getting arrested. - Like, sure. - But it didn't hit, like, it wasn't resonant in a really unique way. - Yep. - And the swagged Pope was. (David snickering) Why do you think that is? - James makes a couple of arguments that I think are really compelling. His piece is really good. Everybody should read it, but the first thing, I think, is there is this, like, hyper-realism I think is the phrase he used, that others have used before around celebrities. We're just, like, used to seeing these people in these odd places with odd lighting doing weird stuff. The Pope, in particular, is the kind of person who is, like, massively photographed. He is unusually, I think for a Pope, around, like, swag all the time. (everyone laughing) Like, (everyone laughing) there's just a picture of the man, like, signing a Lamborghini, and so it's like, it's just in this realm of possibility enough, and then you add on top of that this kind of weird veneer that is all celebrity stuff now, and then attach, again, like you said, sort of the low stakes of it, right? Like, Trump getting arrested is, like, objectively, it's a big deal if it happens, and so it's gonna cause most discerning people to at least take a half a beat and be like, is this anything, but, like, why would they lie to you about, like, this sick jacket the Pope is wearing, right? Like, we're just not conditioned to ask that question, and so, I think you put all these things together, and also, something like Midjourney is gonna do really well with a photo of the Pope or Donald Trump as opposed to, like, a picture of your neighbor, because it has the training data to do this. So, it is able to do these things in such a more convincing way (upbeat music) because of kind of both what we're primed to see and what it actually has in its system to work with. (upbeat techno music)",
    "transcript_keywords": [
        "Pope",
        "thing",
        "Donald Trump",
        "Yeah",
        "Trump",
        "things",
        "picture",
        "people",
        "photo",
        "jacket",
        "thing that happened",
        "images",
        "arrested",
        "Donald",
        "Pope swagged",
        "swagged Pope",
        "happened",
        "Vergecasty thing",
        "kind",
        "glasses are melting"
    ],
    "transcript_entity_values": [
        "Rubicon",
        "this week",
        "Zillow",
        "Lamborghini",
        "Midjourney",
        "Lightroom",
        "The Swagged Out Pope",
        "Trump",
        "15 seconds",
        "Vergecasty",
        "200%",
        "David",
        "a couple of days later",
        "Trump",
        "Alex",
        "Pope",
        "second",
        "James Vincent",
        "first",
        "Instagram",
        "James",
        "Donald Trump",
        "Midjourney",
        "six months ago",
        "Salvador Dali"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "NORP",
        "PERCENT",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON"
    ]
}