{
    "id": "wWw2MybbNFo",
    "title": "Apple Watch Series 5 hands-on",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-09-10T23:07:57Z",
    "video_url": "https://www.youtube.com/watch?v=wWw2MybbNFo",
    "category": "Science & Technology",
    "tags": [
        "apple watch",
        "apple watch series 5",
        "watch series 5",
        "apple",
        "watch series",
        "apple watch series 4",
        "watch series 4",
        "series 4",
        "series 5",
        "apple watch 5",
        "Apple Watch 4",
        "smartwatch",
        "new watch",
        "smartwatches",
        "iphone 11",
        "iphone 11r",
        "11 pro max",
        "apple watch 2019",
        "watch 2019",
        "2019",
        "watchos",
        "price",
        "release date",
        "sleep tracking",
        "heart monitor",
        "new phone",
        "apple phone",
        "apple update",
        "apple rumors",
        "apple leaks",
        "hands on",
        "first look",
        "the verge",
        "verge",
        "technology",
        "tech",
        "latest updates",
        "tech news"
    ],
    "views": 831622,
    "likes": 7918,
    "comments_count": 596,
    "description": "Apple announced the new Apple Watch Series 5 today, bringing an always-on display. In addition to the new screen, the Series 5 adds a new titanium finish option as well as the ceramic option that was available on prior models but disappeared for last years Series 4.  Read more about the Watch Series 5 hands-on:  Top event announcements:  iPad hands-on:  iPhone 11 hands-on:  iPhone 11 Pro and 11 Pro Max hands-on:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2lIt7wm",
        "http://bit.ly/2lKAeEv",
        "http://bit.ly/2k8B7WY",
        "http://bit.ly/2kDQzL2",
        "http://bit.ly/2lP1TE8",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey everybody, I'm here in Cupertino at Steve Jobs Theater and I have the Apple Watch Series 5 on my wrist and I am really excited about it and it's because of this thing I'm doing right now, let me explain. The thing I'm most excited about for the Series 5 is this screen right here. The screen is currently off and when I turn it to face me it pops on again. And then if you do that it just goes back off or if you turn it away from yourself. Now Apple says that they are able to maintain an 18-hour battery life even though the screen is always on. And they're able to do that because they're good at screens, they're good at processors. But this is an LTPO screen, which means that Apple can dynamically change the hertz, the refresh rate of the screen depending on what the situation calls for. They say all the way down to one hertz and up to 60. So, this is, you know, moving pretty fast. It's like driving the second hand. The refresh rates pretty good. And then here, there's basically no refresh rate at all. It only needs refreshing, honestly once a minute because it's just sittin' there, so. That's really impressive. Another new feature in the Series 5, is a compass, so we'll look at our recent apps here, and there's the Compass. And as I turn you can see there's this little red cone that gets smaller and smaller as it's more and more confident that it's accurately telling me the correct direction. Which is really clever, they call it, like, \"the Cone of Confidence.\" And then if we go back to the recent apps we can look at Maps, that same cone is visible, and you can see it's really narrow inside Apple Maps. The Apple Watch comes in three finishes now there's aluminum, which is slightly higher quality then before, there's stainless steel, this is the gold stainless steel, right here and there's a new ceramic option. Now, last but not least, I'm not actually gonna show this to you but the Emergency SOS feature on cellular now works internationally. Any country it's able to figure out what the number is for Emergency Services and dial it. So the Apple Watch Series 5, starts at $399 for the regular GPS version. The LTE version costs $499 and you could probably price them way higher than that if you go ceramic and special band or whatever, and actually when you go to an Apple Store or online they now sell the watch and the band sort of separately and so you can pick and choose what you want your package to be. But, maybe my favorite thing is the Series 3 which is a couple generations ago. They've dropped the starting price on that down to $199, which is a pretty good deal for a new Apple Watch. Hey everyone thanks for watching. This is a new Apple Watch we're obviously gonna review this and the new iPhones and everything that's got announced today so keep it locked to the Verge.",
    "transcript_keywords": [
        "Steve Jobs Theater",
        "Cupertino at Steve",
        "Steve Jobs",
        "Jobs Theater",
        "Apple Watch Series",
        "Apple Watch",
        "Apple",
        "Watch Series",
        "Watch",
        "Series",
        "screen",
        "Cupertino",
        "Steve",
        "Jobs",
        "Theater",
        "thing",
        "Apple Maps",
        "inside Apple Maps",
        "good",
        "Apple Store"
    ],
    "transcript_entity_values": [
        "18-hour",
        "Steve Jobs Theater",
        "one",
        "Apple",
        "499",
        "Cupertino",
        "Compass",
        "iPhones",
        "three",
        "the Cone of Confidence",
        "LTE",
        "the Series 3",
        "today",
        "399",
        "SOS",
        "up to 60",
        "5",
        "the Series",
        "Apple Store",
        "hertz",
        "Apple Maps",
        "the Apple Watch Series 5",
        "The Apple Watch",
        "199",
        "Apple Watch",
        "second",
        "the Apple Watch",
        "a couple generations ago"
    ],
    "transcript_entity_types": [
        "TIME",
        "FAC",
        "CARDINAL",
        "ORG",
        "MONEY",
        "GPE",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "EVENT",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE"
    ]
}