{
    "id": "WxRblujlYOg",
    "title": "16” MacBook Pro - Apple’s Last Chance",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2019-02-19T20:48:21Z",
    "video_url": "https://www.youtube.com/watch?v=WxRblujlYOg",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "16 inch macbook",
        "macbook 16",
        "16 macbook",
        "macbook pro",
        "best macbook",
        "xps 15",
        "versus",
        "best laptop for video editing",
        "apple core i9",
        "apple overheating"
    ],
    "views": 936150,
    "likes": 27090,
    "comments_count": 1894,
    "description": "The 16\" MacBook Pro sounds like it'll be the best MacBook ever, but it needs an engineering overhaul to get around the thermal limitations of the current design. I WANT TO BELIEVE. Apple Space Heater -   Background Music Fili - Differences  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2DRWq50",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Recently the fairly reliable Apple analyst Ming Chi Kuo talked about the possibility of a 16 inch MacBook Pro coming out this year and the idea of a 16 inch MacBook Pro got a lot of people excited like Publications are talking about how it's gonna look beautiful It's gonna be bezel is like that's great null, but I think the more important question is why? why is Apple making a 16 inch or 16 and a half inch device and it's not because like that extra screen inch is gonna change the world It's... I have a different theory. I have a belief, and this is something that I want to make a video on before they even made this announcement and it's because they have a huge problem with the current MacBook Pro design, so when they came out with the 13 and 15 inch MacBook Pros in 2016 They were very beautiful Like they just looked like such elegant machines and people loved them, but they had thermal issues right from the beginning They just couldn't run the CPUs as hard as they wanted to and even the graphics chips that they were putting in these laptops were not super powerful because these really thin laptops can only cool things so well and then 2017 rolled by same issue, but then 2018 rolled by and Intel came out with these really powerful CPUs they have these six core CPUs and you really start to see the limitations of a super thin chassis like Everyone likes a nice looking computer, right? We all get it but when you make them this thin you just run into problems when it comes to cooling these devices and This year intel has their new ninth gen Mobile CPUs and they have an 8 core chip the 9980H and this is a sepia that's going to be very powerful The Windows laptops will be able to use it and just push that some really awesome Performance with it If you try to take that chip an eight-core mobile Intel CPU And you try to stick it into a 15-inch MacBook Pro right now like the current designs. It's not happening There's no way they were able to cool that thing properly So this is the fundamental reason why I think Apple is making the new 16 inch MacBook Pro to get rid of this Thermally limited like trap that they've built for themselves when they built that 15 inch MacBook Pro Intel had these four core cpus and when you looked at the road map back then in 2016 It looked like until was gonna make these smaller chips that were more power efficient and would be able to be cooled in a chassis Like that, but in 2019, we know now there's no way like their CPUs run quite hot they draw a lot of power and It just needs a completely new chassis to fit that stuff in and then if you take a look at the graphics side of things The current MacBook Pros that have Vega 16 and Vega 20 options Those are pretty good like they're better than last year's options But compared to what is available on the market like if you look at what NVIDIA has and what AMD has down the pipeline You're gonna need some way better cooling to deal with those new upcoming GPUs So this whole idea of building a different chassis, I'm all for it. They need it and they're gonna deliver it now I'm gonna mention one other thing power. So power delivery on the current 15-inch MacBook Pros They use an 87 watt adapter that connects over USB C but if Apple builds a new 16 inch MacBook Pro they have the option Of doing something custom right the way that Dell did they have a hundred and thirty watt adapter that also connects over USB C you're just able to do so much more when you build a new system like this better thermals better power delivery better everything I think in the current state of the mobile like workstation and mobile professional device market like They got to do something and I think they have a chance of making something good if if they're smart, okay? Hope you guys enjoyed this video thumbs. We liked it subs if you'd love to see you guys next time",
    "transcript_keywords": [
        "Ming Chi Kuo",
        "analyst Ming Chi",
        "Chi Kuo talked",
        "inch MacBook Pro",
        "Apple analyst Ming",
        "Ming Chi",
        "Chi Kuo",
        "MacBook Pro",
        "MacBook Pro coming",
        "fairly reliable Apple",
        "reliable Apple analyst",
        "MacBook Pro Intel",
        "inch MacBook",
        "analyst Ming",
        "Kuo talked",
        "excited like Publications",
        "Publications are talking",
        "current MacBook Pro",
        "MacBook Pro design",
        "Pro"
    ],
    "transcript_entity_values": [
        "16 inch",
        "six",
        "Dell",
        "MacBook Pro",
        "ninth",
        "Mobile",
        "CPU",
        "87 watt",
        "Windows",
        "one",
        "this year",
        "9980H",
        "Apple",
        "USB C",
        "Ming Chi Kuo",
        "15 inch",
        "20",
        "MacBook Pro Intel",
        "16 and a half inch",
        "eight",
        "15-inch",
        "2018",
        "MacBook Pros",
        "intel",
        "NVIDIA",
        "2019",
        "2017",
        "four",
        "2016",
        "AMD",
        "13",
        "a hundred and thirty watt adapter",
        "Intel",
        "last year's",
        "Vega",
        "8"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL"
    ]
}