{
    "id": "wzU46BiYh2o",
    "title": "How the James Webb Space Telescope will revolutionize astrophysics",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-12-25T13:27:45Z",
    "video_url": "https://www.youtube.com/watch?v=wzU46BiYh2o",
    "category": "Science & Technology",
    "tags": [
        "nasa",
        "space",
        "james webb launch",
        "james webb space telescope",
        "spacex",
        "nasa launch",
        "nasa launch today",
        "space telescope science institute",
        "hubble space telescope",
        "james webb",
        "james webb telescope",
        "james webb telescope update",
        "nasa james webb telescope launch",
        "perseverance landing",
        "science",
        "facts",
        "nasa news",
        "physics",
        "biology",
        "chemistry",
        "universe",
        "education",
        "mars",
        "elon musk",
        "verge science",
        "the verge",
        "jwst",
        "time machine",
        "real",
        "history"
    ],
    "views": 330809,
    "likes": 9682,
    "comments_count": 643,
    "description": "NASAs James Webb Space Telescope was successfully launched on December 25th. This is the revolutionary successor to the Hubble Space Telescope. The spacecraft still has a long way to go in space, but if all goes well, the vehicle could transform our view of the Universe.  Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- [Announcer] (Foreign word), liftoff, from a tropical rain forest to the edge of time itself, James Webb begins a voyage back to the birth of the universe. - NASA just launched the most advanced space telescope ever created, a spacecraft that could fundamentally transform our understanding of the universe as we know it. It's the James Webb Space Telescope, or JWST for short, and while technically, it is a telescope, it's really more like a time machine, one that will allow us to peer back to the dawn of the universe, when the first stars and galaxies were just taking shape. - The primary science driver was to find the earliest galaxies, to find the very first epic of galaxies that were born after the Big Bang. - [Loren] Amber Straughn is an astrophysicist at NASA's Goddard Space Flight Center, and she's been working on JWST for more than a decade. - I really do think that this telescope will be transformational for astrophysics. I think that we will learn things about the universe that completely surprise us. - JWST is often considered the successor to NASA's Hubble Space Telescope, a bus sized observatory that's been orbiting the earth for the last three decades. You may recognize some of Hubble's greatest hits. With its nearly 8' long mirror, the telescope has captured some of the most iconic space photographs of galaxies and nebulas ever taken, and it's also told us a lot about our cosmic home. Hubble is the reason we know that the universe is about 13.8 billion years old. - As incredible as Hubble has been, you know, there are a lot of ways that we have pushed it to its limit, and JWST is specifically designed to sort of go past that boundary and answer some of these big questions that Hubble just can't quite get to. We expect JWST to be roughly about 100 times more powerful than Hubble. - [Loren] But unlike Hubble, which sees in the optical wavelengths of light, JWST will see in the infrared. - [Amber] So if you look at the most distant galaxies we've ever seen with Hubble, you'll see that there are these teeny tiny little red dots. They're so distant, that their light has been stretched by the expansion of space time, all the way into the infrared part of the spectrum. So, in order to have a telescope, that would be able to detect these very, very early galaxies, it needed to be infrared, and it also needed to be very, very big. - [Loren] Infrared is a type of light that we can't see with our eyes, but we can feel it in the form of heat. Any object that has a temperature above absolute zero emits infrared radiation, and the hotter the object is, the brighter it glows with infrared light. - That's one of the great tricks of infrared light is it sort of allows us to peer through dust to see the sites of star formation. - [Loren] This new telescope sports a giant mirror, more than 21' across, that will gather even more light than Hubble's. - And also the size of the mirror helps us to see finer detail in the cosmos in this wavelength range. So thinking about if there was a bumblebee on the moon, from the earth, we would be able to see the heat of that bumblebee. And in terms of sharpness, we would be able to see details the size of a penny from 24 miles away. - [Loren] James Webb's mirror is coated in an unthinkably thin layer of gold, about 200 times thinner than the average human hair. - Gold, it turns out, is really the best material for reflecting infrared light, in a lot of the wave lengths that we care about, it can be as reflective as 98% of all light that hits it. - [Loren] Lee Feinberg is the Optical Telescope Element Manager for the James Webb Space Telescope. - We also needed a structure, large composite structure, designed to work at the very cold temperatures of JWST, so that's -400 degrees Fahrenheit, but that is incredibly stable. - NASA plans to send JWST into a super distant orbit of roughly a million miles away, which is about four times farther out than the moon. Combined with the telescope's massive mirror, this means we can peer into the deepest recesses of space and time. JWST will be able to study objects that are 10 billion times fainter than the stars that we can see without using a telescope, but even more enticing is that JWST will be able to gather light from stars and galaxies located up to 13.6 billion light years away from earth. And that's what makes the telescope a window into the past. The light from those objects will have taken 13.6 billion years to reach the telescope's mirror. That means these objects were around just 100 to 250 million years after the Big Bang. At that time, the universe was just at one or 2% of its current age. It'll be our first time in history seeing what the earliest galaxies in the universe looked like in their infancy. - Now right now, the farthest back in time that Hubble can see, just barely, is like when the universe was 400 million years old, so that's a really exciting aspect of what JWST can do. And that's just gonna uncover things about the universe and about, you know, astrophysics, that we can't even imagine at this point. - Scientists first conceived of JWST in 1989, and back in those early days, they underestimated just how much it would cost and how long it would take to build. And many of the technologies that were needed to make the telescope a reality, like those impressive gold mirrors, for instance, just didn't exist when the spacecraft was first dreamed up. - Let's see, we had to invent 10 technologies just to be able to build it. You know, we actually had to make the mirrors, for example, on JWST, 10 times lighter per unit area than the Hubble primary mirror, just to be able to have the rocket be able to carry that much mass up. So, in just about every way, JWST is really pushing the envelope. It's really nothing like we've ever done before. - There were plenty of road bumps along the way when it came to piecing the spacecraft together. Decades later, its total development cost is at $9.7 billion. Meanwhile, as JWST struggled to get off the ground, the field of astronomy continued to blossom and to diversify. One emerging field, the study of exoplanets, or planets outside our solar system, grew into a thriving new discipline. We didn't even know that exoplanets existed before the 1990s. Now, we've discovered thousands of these far off worlds and hope to discover many thousands more. JWST's ability to detect super faint light also means it will be able to catch glimmers from the atmospheres of distant planets and perhaps, tell researchers whether those atmospheres contain signs of life. All of this means that thousands of scientists are thirsty, to get just a few hours of precious time with the telescope when it's operational. Unsurprisingly, JWST's first year of science is jam packed full of scheduled observations. If all goes well, researchers will have at least 5 1/2 years with Webb, with the possibility of extending its mission beyond 10 years. Ultimately, its life is limited by the finite fuel it has on board and how much its components degrade over time. But even though JWST is in space now, everyone is still holding their breath. This telescope isn't out of the danger zone yet. In order to fit on top of the Ariane Five rocket that launched it into space, JWST had to ride completely folded up. - From the very early stage, we knew we had to figure out a way to unfold the primary mirror, and that meant making it segmented in some way, so that kind of drove that. And then, likewise, we knew that we needed a way to cool that mirror, and the multi-layer sun shield seemed to be the right way to go, but it needs to be very large, so that as the telescope slues around, we keep the sunlight and really, moon and earth light, off of the telescope. And so that made this sun shield about the size of a tennis court and we used a very light Kapton material. It's like almost as light as aluminum foil, if you will. We actually can fold it all up, and we control it in a very special way, and it's a lot like origami, where it sort of unfolds in different sections. And actually, when we're all done unfolding, it will actually tension it. - During the unfurling, there are 344 single points of failure. That means those steps and those mechanisms must work perfectly or else they could jeopardize the entire system. - A lot of the large deployments happen during the first two weeks or a little more than that. You know, most of the team, I think, feels like that's really, you know, they'll rest after that, but for me personally, actually, that's really kinda when I get started, because that's only when we start deploying the mirrors, which each have these six actuators that push them forward. And then we start all the alignments of the telescopes, so I won't actually rest until the telescope is aligned to the primary mirrors, what we call phased up, as though it's a single mirror. - But if the telescope does unfurl as planned, then the last big test comes 29 days after launch, when the spacecraft burns its thrusters, putting it on its orbit, 1,000,000 miles out from earth. It's a lot of moving parts, but it's all necessary for JWST to work, and unlikable Hubble, JWST can't be fixed. There's no current way to send humans out to the spacecraft to give it a tuneup if it's broken. But if everything goes smoothly, we'll get the very first images and data from JWST by summer of 2022, that will be when a new era of astrophysics begins, one where we can see into the farthest reaches of the universe as we know it.",
    "transcript_keywords": [
        "JWST",
        "Webb Space Telescope",
        "telescope",
        "Hubble Space Telescope",
        "NASA Hubble Space",
        "James Webb Space",
        "space telescope",
        "Hubble",
        "light",
        "space",
        "tropical rain forest",
        "NASA Goddard Space",
        "James Webb",
        "mirror",
        "universe",
        "Webb Space",
        "time",
        "Space Flight Center",
        "Goddard Space Flight",
        "James Webb mirror"
    ],
    "transcript_entity_values": [
        "zero",
        "1989",
        "JWST",
        "2022",
        "Hubble",
        "one",
        "light years",
        "about 200",
        "degrees Fahrenheit",
        "24 miles",
        "Goddard Space Flight Center",
        "Webb",
        "around just 100 to 250 million",
        "roughly a million miles",
        "$9.7 billion",
        "Hubble",
        "Hubble",
        "Amber Straughn",
        "1,000,000 miles",
        "James Webb",
        "Loren] Infrared",
        "six",
        "the Optical Telescope Element",
        "Hubble Space Telescope",
        "2%",
        "years",
        "344",
        "13.6 billion",
        "the 1990s",
        "a penny",
        "the James Webb Space Telescope",
        "Lee Feinberg",
        "Decades later",
        "more than",
        "thousands",
        "NASA",
        "roughly about 100",
        "98%",
        "those early days",
        "Kapton",
        "more than a decade",
        "Loren",
        "One",
        "400 million years old",
        "the first two weeks",
        "13.6 billion",
        "James Webb's",
        "the last three decades",
        "about four",
        "at least 5 1/2 years",
        "Ariane Five",
        "10 years",
        "just a few hours",
        "about 13.8 billion",
        "first",
        "JWST",
        "10 billion",
        "years old",
        "29 days",
        "summer of",
        "10"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "PRODUCT",
        "FAC",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "FAC",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "DATE",
        "TIME",
        "MONEY",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL"
    ]
}