{
    "id": "x06yBIHu26o",
    "title": "Ugliest iPhone Cases Ever?",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-07-10T15:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=x06yBIHu26o",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iphone case",
        "iphone case review",
        "uglly iphone cases",
        "weird iphone cases"
    ],
    "views": 10141774,
    "likes": 127894,
    "comments_count": 21781,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, guys, it's Justine, and I'm here with my friend, Ro. - Hello. - We haven't done a video in a while together. - I know. It's been too long. I was so happy you came over, 'cause I was so sad. - When I found out that we were going to be doing a video together, I brought over this mystery bag. - I love mystery bags, so I have been wondering what's in here. I love mystery everything, even mystery gum. - Well, this isn't really mystery to me because I bought all of these. I wanted to do a video talking about some of the weirdest, ugliest iPhone cases that I can find. Some of these in here-- - Are just hideous. - I can't wait for you to see 'em. Do you wanna go first? - Yes! Okay. This one's like-- - It's actually very fitting for you. - Oh my gosh! It's a dog! - Look at that! It could potentially be Cookie with glasses. I think I have a knife in here. I have a Punisher knife. - Oh. Careful, careful, it's sharp. - Look at that. You always have the coolest knives. - I love knives. - Okay, how do you do this? You just? - Just. (plastic crinkling) Whoa (laughing) - Oh, my-- - My gosh! - So, this is our first one. This one is actually a nice case. I like this. So, let's- - [Ro] The dog could've had a happier face, though. - [Justine] You think? - [Ro] Criticism number one, - I'm really have no attachment to any of these cases, so you can be negative or positive. - [Ro] Does this dog face look happy? - He looks like he's moderately excited about life. - Let's put this little puppy on there. - Okay. You can just tell us in the comments if you like it or don't like it. - Yeah, so is it cute, or is it woof? - I must say, some of these were very, extremely very cheap, so. (loud crinkling) - Can't wait to see it. - Oh, popcorn! - Popcorn, is it squishy? - Yeah, it's almost like the same thing. - Oh, I like this texture. Who would get this? Is like you were a movie enthusiast? - This is not very well made. I can't even get in there to turn the volume off. Let's try another one. - Yeah, let's try another one. I'm gonna pretend I'm one of those machines- (imitates machine whirring) - The claw! - Can you guys see what it is, cause I don't know yet. - I know what this one is, it's-- - What the heck is this? Is this like a, a lint ball? - Just open it up and see. - Oh geez. Okay, so I've really gotta hold on better. - Yeah, just. - Oh, how do you do this? Away from the face. - Yeah, cut away. - Okay. - [Justine] Oh, my goodness. - Oh, it's an animal! Oh my, okay let's-- - This is-- - Where to begin? - [Justine] Where do we begin? There's glue on the side of this. - There is glue. You have to see this. Can you see this? - [Justine] This is disgusting. - [Ro] Justine, please model this glue, can you? - Wait, is this the butt? - That's a butt? - I think that's a cat butt. - No. - [Justine] Yes, I think it is. - They designed a butt? - Yeah, look that's the butt hole. - No, no, no, no. - I swear, that's the cat, wait, what is this? (gasping) Oh my goodness (laughing). - This is not his face. - This is not his face. - Okay, so this is the face. This is the backside of a cat. - Yeah, so I saw this and then I saw that. - So this is like his booty area. - Oh my goodness, Somebody did not-- - Get neutered. - The, yeah, did you not? - Gotta spay and neuter your pets. - Heed the warning from Bob Barker back in the day? - Could you imagine if I showed up to your house like this? Oh hey Justine girl, let's just take a selfie. - It's- - Can you imagine? - So, this is actually foul. Like, I can't even look at, it's so-- - Like my finger is touching it prolly shouldn't touch. - You're so close to the, look, wait. - It does kinda make a good, ya know, like one of those PopSockets? - Here, let's take care of this. (laughing) Let me do, here can you hold this down for me? - Oh my gosh! - I just, I don't wanna cut you, but could you like, just hold right there? - [Ro] Justine is now a veterinarian. She is performing surgery as we speak. Gosh, it's a little bit more appropriate. - I feel so uncomfortable right now. - I'm like, sticking my hand in here, so. - This is definitely not where I thought this video was gonna go. This is really crappy. I need to see how much I paid for this because this is definitely not worth anything at all. I can't even believe that someone would buy this. - Is this custom handmade? The glue, I mean, this is custom, this is hand-glued. - Soft, fur case, cartoon, funny, cute, puppy, plush, animal, cat butt, Corgi tail, brown hair, creative design, Apple 10, ten phone case for girls, women, gray, cat. I can't believe this. - What a title! - This was-- - Nice and catchy. - Eight dollars. - Sticks with ya. - And 99 cents. - This? - Yes. - Okay. - We need a discount now that I had to do the- - Whoever is making this, clean up the glue a little. - I'm gonna go through, and I'm going to leave some reviews for each one of these case manufacturers. - I also like how the glue's yellow, cause it kinda looks like maybe it was like, pee pee. - Take that off of your phone immediately. (laughing) Are you ready for the next one? - Take it away. - This one looks really cool. - Oh, okay. This is a cool one. What kind of a camera is it? - [Justine] The S100. - There's not a lot to read in here. - Nope. Is this called iPhoto Camera Case? It's definitely... It feels really cheap. - [Ro] What does it feel like? Is it- But look at all these little knobs that- They don't turn. - It looks like you could probably put a little, I don't think it has it in here, but a little- - Does this do something? - No. It looks like you can put a little hanger type thing on it? - You can make it a purse. - You could. Alright, let's put this on. - [Ro] Do we have string? Do we have ribbon? - Look at that. - Does it fit okay? - It fits pretty good. - Can you hit your buttons? - [Justine] Hit the button? Yeah. Although, I definitely can't get to the one to put it on vibrate, so that's definitely not good. Oops. It's broken. I mean I just did a single turn- Oh, shoot. Daddy broke the second one. I mean, I can jam it back in. - We need super glue... And strength. - Let's see what else we've got. - We need another great iPhone case. Alright, what else got in here. Hello. Did I get another animal butt? - You did! - Okay, what butt is this? I am lucking out, Justine. I'm getting all the little booty cheeks. I got another little animal booty cheek. - [Justine] I hope this one's a little bit better made. - You can guess what animal it is. I think it's a corgi butt. - I think it is, too. - You think it's a little corgi- - Yes. - Cause look at underneath. - This is much more appropriate. - There's no private parts hanging out, so this is a lot cuter. - [Justine] This is really soft, too. Oh my gosh. - It's my new PopSocket. - [Justine] This one's a little bit better than the other one because the other one definitely was very, I was very uncomfortable. There may be another case in here that you're gonna like even more than that. - This is just not great. Oh my- - What's this? What? - The ear already broke. - The quality of these cases is very astounding. Guess what we've got? - What, what, what is it?? - Wait, is it my turn? Yeah, cause you just picked. - I found two booties in a row. What is this? - What is this? I don't actually even remember ordering this. - Is that what I think it is? - Is this Pink Panther? - Yes. Oh my gosh. That is a throwback. That is a retro cartoon I used to watch. - [Justine] Yes. - [Ro] I mean that is so- - What do you think Pink Panther's up to now? - I think it was made into a movie a really long time ago, but I can't remember now. I have no clue. - He's really just sticking out of this case. - [Ro] He's really fancy. He's got a top hat. - This is a like a DIY case gone wrong. This actually looks kinda good, from far away. - Yeah, I feel like he's gonna start to like tap dance and- - Did he tap dance? What did he do? - He was... He... - Didn't he have a, the song was like That's Pink Panther, isn't it? - I thought so. Is he a spy? - The Pink Panther is a British-American media franchise company primarily focusing on the series of common mystery films- - Mystery? - Featuring a French police detective, Inspector... Okay, this is too much information. Anyway - A detective, a sly detective - This is a pretty nice phone case. Do any of you guys know who Pink Panther is? Is this too old for you, or? Cause this said it was like in 1963. - Okay, we didn't watch it in 1963. - We did not. - Okay, just for the record, before we go there, we didn't watch it in 60's. - We didn't. - Okay, onto the next one. What is it? This really creepy. (laughs) - [Justine] I thought, just looking through, I thought it was like pills, but don't be fooled they're small people. - They're people inside of, they look like little pill capsules. Talk about PopSocket, you could just stick your fingers in there. - [Justine] That's kinda cool. - [Ro] And just like, hold it. Can they open? - [Justine] No, I think that's probably asking a lot. - This is bizarre, because some of the people are standing up, some are bent over, like they're sitting down. - What is this? - They're like matrix pills with people inside. (crinkling sound) That's so cute and weird. - A watermelon. - [Ro] It's huge! That's like an iPad case. - This is so massive. - [Ro] That's for your phone? - Yes! - That could fit an iPad. That could fit a small iPad. It's so big. Look at your phone. - Look at this. - An inch and a half bigger. - Well, yeah, and then look how much bigger it is on this side. How would you-- - [Ro] What if you had a cute little clutch? Where would you put this? - Ew, it stinks. Oh gosh, this smells like poison. - It smells like gas. - [Justine] It stinks. - It smells like when you're doing a barbecue. - Propane. - Propane. - Yeah, oh I know something about propane. (dramatic techno music) (crinkling sound) - What we have? Are you kidding me? It's a unicorn. - That's perfect for you, except for the fact that it is the size of your body. - This I would hurt myself. - [Justine] Wow. I thought I would like that. - A little big. I have a hard time pushing any of the buttons. - [Justine] Clearly, you're not very functional. - [Ro] And if you're laying in bed. Hey, Justine, you're gonna be my boyfriend. - Okay. - Okay, we're laying in bed, and I'm scrolling on a phone and I should be going to bed but I'm scrolling. If I drop this on my face, which I usually do, this could take out his eye. - It could. Yeah. It could take out your eye. - [Ro] Unicorn is super cute, but I'm a little disappointed there's no rainbow mane. - I'm sorry. - You know what I mean (mumbling). - We probably would've come with a couple extra dollars. - [Ro] And, why's it just white? - These clearly are not high quality. Maybe there's something else in here. It's a pig! - Okay, that's cute. - Let me see this knife. - Yeah, open this puppy up. - Okay, look at this. This is so cute. - [Ro] I like it. - I love it. Okay, I'm definitely keeping this one on. This is my favorite one. And it's like small, low profile. I think we have, yeah we have one more left. - How many more is left? - We've got one more. - Do I get to do it? - Yeah, it's your turn! - What's it gonna be? (carnival music) - [Justine] What is wrong? - [Ro] What is this? So weird. What am I looking at? - [Justine] (laughing) Okay, so I already know what this is. - I do not know what this is. I don't even know if I wanna know what this is. Is this a chicken wing? - [Justine] It's a chicken leg. - This is fried chicken. I was like, \"Is this poop, barf? What is this?\" - No, the best part about this is they have like five different shapes of chicken. They've got a chicken tender, a chicken, this-- - No. - Yes, it's so weird. This also said it was an iPhone 10 case, but clearly use it, the other way. - This is not an iPhone 10 case. - It's definitely not. - This is a seven plus. I have to give it credit, because it actually, out of the packaging, looks like chicken. - [Justine] It does. I just can't believe that they're several different, I was gonna call them flavors, but there's different chicken shapes. - [Ro] These are like those fake foods when you're a little kid and you get the ones that are really realistic looking. Like little fake foods to play with. - Who would buy this? - It takes up a lot of room in your purse. I like fashion, but I'm also a fan of functionality, so wasting space, not.. Oh my gosh. - Oh my gosh. - [Ro] Can you just stick it on any way? - You can stick it anywhere. I mean, it was just glued on. This is disgusting. Who would ever, I can't even think about if someone's like, \"This is what I want my iPhone to be.\" - If you were gonna design a custom case, what do you think you'd put on it? A little piggy? - I really like the pig, but this is just so silly. I can't get over it. That was the last one. - That's it? - Yes, I'm so sorry. - These were so weird and awesome. - Which one do you think's your favorite? - This is so hard for me. These little booty cheek ones shocked me. This one was the weirdest to me. - So strange. - Little people in pill capsules? I don't get it. And that one's just so weird. - This is for you. - Wow, I love when friends give you great gifts. This is. If anyone was wondering what Justine got me, when we hit 10 million subscribers, it was this chicken wing. - Let's celebrate Ro's 10 million subscribers with this chicken wing, but you know what? If you wanna keep any of the other ones, honestly, you totally can. - [Ro] Well, would people think you're Dexter creepy if you have this? - I don't think they're gonna really see it if they actually look at it. - Let's show these all off. Can you see of all of these? You need to see all of it and all of its glory. - Ro, thanks so much for being in my video today. - You're very welcome. - This was awesome. Make sure you guys go check out Ro's channel. I'll put a link in the description, and be sure to subscribe and hit the bell on both of our channels. But, we'll see you guys in the next video. Bye! - Bye! (cheerful music)",
    "transcript_keywords": [
        "Yeah",
        "case",
        "Pink Panther",
        "chicken",
        "mystery",
        "gosh",
        "butt",
        "Justine",
        "put",
        "face",
        "glue",
        "Pink",
        "Panther",
        "cute",
        "video",
        "wait",
        "love mystery",
        "phone",
        "people",
        "love"
    ],
    "transcript_entity_values": [
        "a couple extra dollars",
        "PopSockets",
        "second",
        "Ro's 10 million",
        "one",
        "iPad",
        "1963",
        "DIY",
        "Justine",
        "Ro",
        "Pink Panther's",
        "iPhone",
        "99 cents",
        "ten",
        "the day",
        "10 million",
        "Justine]",
        "Pink Panther",
        "half",
        "British",
        "Bob Barker",
        "PopSocket",
        "five",
        "Punisher",
        "Dexter",
        "Corgi",
        "today",
        "two",
        "seven",
        "60",
        "Cookie",
        "first",
        "French",
        "Ro",
        "iPhoto Camera Case",
        "Apple 10"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "NORP",
        "PERSON",
        "ORG",
        "CARDINAL",
        "NORP",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "NORP",
        "ORG",
        "PRODUCT",
        "ORG"
    ]
}