{
    "id": "X15o2sG8HF4",
    "title": "Obama on AI, free speech, and the future of the internet",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-11-07T15:00:27Z",
    "video_url": "https://www.youtube.com/watch?v=X15o2sG8HF4",
    "category": "Science & Technology",
    "tags": [
        "obama",
        "obama interview",
        "barack obama",
        "barack obama interview",
        "ai regulation",
        "obama foundation",
        "government and technology",
        "artificial intelligence",
        "social media",
        "ai safety regulations",
        "ai in government",
        "biden",
        "joe biden",
        "ai executive order",
        "tech regulation",
        "president barack obama",
        "decoder",
        "nilay patel",
        "the verge"
    ],
    "views": 472566,
    "likes": 12852,
    "comments_count": 1230,
    "description": "Former President Barack Obama sat down with The Verges editor-in-chief and Decoder host Nilay Patel to talk about AI, social networks, and how to think about democracy as both of those things collide. The conversation, which took place just hours after President Joe Biden signed his executive order on AI, covers some of todays biggest issues in tech and policy. Of course, we also had to ask Obama what apps he has on his homescreen. #AI #Technology #Podcast   Read more:    0:00 Intro 0:30 Bidens executive order on AI 05:38 Tech regulation & avoiding mistakes of social media 11:30  Why AI companies are asking for regulating 14:52 Silicon Valleys pushback against regulation 17:35 AI rules and whos responsible for following them 19:43 Should tech platforms be treated as common carriers?  22:57 Regulating around the First Amendment; copyright law 25:08 Red Lion v. FCC & the Fairness Doctrine 28:26 The rise of AI-generated social feeds 33:41 AI copyright lawsuits & labor effects 39:47 Obamas experience using AI chatbots 41:39 Obamas homescreen apps  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://www.theverge.com/e/23712912",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "- Hello? - [Nilay] Hello, sir. - Nilay, how are you? - [Nilay] Nice to meet you. - Very nice to meet you. It looks like you cleared out my whole office. - Yeah, we got rid of everything. - Man, they're doing some work somewhere. How you been? - I'm doing all right, man. How are you? - I'm doing great. I should have told you, by the way, you didn't have to wear a tie, but you look sharp. You know more about this stuff than I do so. - Well, let's start. (Obama chuckling) President Barack Obama, you're the 44th president of the United States. We're here at the Obama Foundation. Welcome to Decoder. - It is great to be here, thank you for having me. - I am really excited to talk to you. There's a lot to talk about. We are here on the occasion of President Biden signing the executive order about AI. I would describe this order as sweeping. I think it's over 100 pages long. There's a lot of ideas in it. Everything from regulating biosynthesis with AI. There's some safety regulations in there. It mandates something called red teaming, transparency, watermarking. These feel like new challenges, like very new challenges for the government's relationship with technology. I wanna start with a Decoder question. What is your framework for thinking about these challenges and how you evaluate them? - This is something that I've been interested in for a while. So, back in 2015, 2016, as we were watching the landscape transformed by social media and the information revolution impacting every aspect of our lives, I started getting in conversations about artificial intelligence and this next phase, this next wave that might be coming. And I think one of the lessons that we got from the transformation of our media landscape was that incredible innovation, incredible promise, incredible good, can come out of it, but there are a bunch of unintended consequences and that we have to be maybe a little more intentional about how our democracies interact with what is primarily being generated out of the private sector. And you know, what rules of the road are we setting up and how can we make sure that we maximize the good and maybe minimize some of the bad. And so, I commissioned the, you know, my science guy, John Holdren, along with John Podesta, who had been a former Chief of Staff and worked on climate change issues. Let's pull together some experts to figure this out, and we issued a big report in my last year. The interesting thing even then was people felt enormously promising technology, but, you know, we may be overhyping how quick it's gonna come. And as we've seen just in the last year or two, even those who are developing these large language models who are, you know, in the weeds with these programs, are starting to realize this thing is moving faster and is potentially even more powerful than we originally imagined. So, my framework and in conversations with government officials, private sector academics, that the framework I emerge from is that this is going to be a transformative technology. It's already in all kinds of small ways, but very broadly, changing the shape of our economy. In some ways, even our search engines, you know, basic stuff that we take for granted is already operating under some AI principles, but this is gonna be turbocharged. It's gonna impact how we make stuff, how we deliver services, how we get information, and the potential for us to have enormous medical breakthroughs. The potential for us to be able to provide individualized tutoring for kids in remote areas. The potential for us to solve some of our energy challenges and deal with greenhouse gases that this could unlock amazing innovation, but that it can also do some harm. Yeah, we can end up with powerful AI models in the hands of somebody in a basement who develops a new smallpox variant or, you know, non-state actors, who suddenly, because of a powerful AI tool, can hack into critical infrastructure or maybe less dramatically, AI, you know, infiltrating the lives of our children in ways that we didn't intend, in some cases, the way social media has. So, what that means then is, is that I think the government, as an expression of our democracy, needs to be aware of what's going on. Those who are developing these frontier systems need to be transparent. I don't believe that we should try to put the genie back in the bottle and be anti-tech, because of all the enormous potential, but I think we should put some guardrails around some risks that we can anticipate and have enough flexibility that it doesn't destroy innovation, but also, is guiding and steering this technology in a way that maximizes not just individual company profits, but also the public good. - So, lemme make the comparison for you. I would say that the problem in tech regulation for the past 15 years has been social media. How do we regulate social media? How do we get more good stuff, less bad stuff? Make sure that really bad stuff is illegal. You came to the presidency on the back of social media. - I was the first digital president. - You had a Blackberry, I remember, people were very excited about your Blackberry. I wrote a story about your iPad that was transformative. That's young people are gonna take to the political environment. They're gonna use these tools, we're gonna change America with it. - You can make an argument. I wouldn't have been elected had it not been for social networks. - Now, we're on the other side of that. There was another guy who got elected on the back of social networks. There was another movement in America that has been very negative on the back of that election. We have basically, failed to regulate social networks. I'd say there's no comprehensive privacy bill even. There was already a framework for regulating media in this country. We could apply a lot of what we knew about should we have good media to social networks. There are some First Amendment questions in there, what have you, the important ones, but there was an existing framework. With AI, it's, we're gonna tell computers to do stuff and they're gonna go do it. - Right, we hope. - That we have no framework for that. - We hope they do what... - We hope, right? - Think we're telling them to do. - We also ask computers a question. They might just confidently lie to us or help us lie at scale. There is no framework for that. What do you think you can pull from the sort of failure to regulate social media into this new environment such that we get it right this time, or do anything at all? - Well, this is part of the reason why I think what the Biden administration did today in putting out the EO. The work they've done is so important. Not because it's the end point, but because it's really the beginning of building out a framework. And when you mentioned how this executive order has a bunch of different stuff in it, what that reflects is we don't know all the problems that are gonna arise out of this. We don't know all the, you know, promising potential of AI, but we're starting to put together sort of the foundations for what we hope will be a smart framework for dealing with it. And in some cases, what AI is gonna do is to accelerate advances in, let's say medicine. You know, we've already seen, for example, with, you know, things like protein folding and the breakthroughs that can take place that would not have happened had it not been for some of these AI tools. And, you know, we wanna make sure that that's done safely. We wanna make sure that it's, you know, done responsibly. And it may be that we already have some laws in place that can manage that. There may be some novel developments in AI where an existing agency, an existing law just doesn't work. You know, if we're dealing with the alignment problem and we wanna make sure that some of these large language models where even the developers aren't entirely confident about what these models are doing, what the computer's thinking or doing. Well, in that case, we're gonna have to figure out what are the red teaming, what are the testing regimens? And in talking to the companies themselves, they will acknowledge that their safety protocols and their testing regimens, et cetera, may not be where they need to be yet. And I think it's entirely appropriate then for us to plant a flag and say, \"All right, frontier companies, you need to disclose what your safety protocols are to make sure that we don't have rogue programs going off and hacking in our financial system, for example. Tell us what tests you're using. Make sure that we have some independent verification that right now this stuff is working.\" But that framework can't be a fixed framework, because these models are developing so quickly that oversight and any regulatory framework is gonna have to be flexible and it's gonna have to be nimble. And it's gonna, and by the way, it's also gonna require some really smart people who understand how these programs and these models are working not just in the companies themselves, but also in the nonprofit sector and in government. Which is why I was glad to see that the Biden administration part of the executive order is specifically calling on a bunch of, you know, hotshot young people who are interested in AI to do a stint outside of the companies themselves and, you know, go work for government for a while. Go work, you know, with some of the research institutes that are popping up in places like the Harvard Lab, or the Stanford AI Center, and some other non-profits. Because we're going to need to make sure that everybody can have confidence that whatever journey we're on here with AI, that it's not just being driven by a few people without any kind of interaction or voice from ordinary folks, regular people who are gonna be using- - Well, there's a difference there. - these products and impacted by these products. - There's ordinary folks and there's the people who are building it who need to go help write regulations. And there's a split there. The conventional wisdom in the valley for years is the government is too slow, it doesn't understand technology. And by the time it actually writes a functional rule, the technology it was aiming to regulate will be obsolete. This is markedly different, right? The AI doomers are the ones asking for regulation the most. The big companies have asked for regulation. Sam Altman has toured the capitals of the world politely asking to be regulated. Why do you think there's such a fervor for that regulation? It's just incumbents wanting to cement their position. - Well, I look, you're raising an important point, which is, and rightly there's some suspicion, I think among some people that, yeah, these companies want regulation, because they wanna lock out competition. And as you know, historically, sort of a central principle of tech culture has been open source. We want everything out there. Everybody's, you know, able to play with models and applications and create new products, and that's how innovation happens. Here, regulation starts looking like, well, maybe we start having closed systems and, you know, the big frontier companies, the Microsofts, the Googles, the open AIs, anthropics, that they're gonna somehow lock us out. But in my conversations with the tech leaders on this, I think there is for the first time some genuine humility, because they are seeing the power that these models may have. I talked to one executive, and look, there's no shortage of hyperbole in the tech world, right? But this is a pretty sober guy, like an adult- - Now, I have to guess who it's. - who's seen a bunch of these cycles and been through boom and bust. And I asked him, I said, \"Well, when you say this technology you think is gonna be transformative, give me sort of some analogy.\" He said, \"You know, I sat with my team and we talked about it. And after going around and around what we decided was maybe the best analogy was electricity.\" Then I thought, well, yeah, electricity. That was a pretty big deal. - [Nilay] Yeah. - And if that's the case, I think what they recognize is that it's in their own commercial self-interest that there's not some big screw up on this. That if in fact it is as transformative as they expect it to be, then having some rules, some protections, that create a competitive field, allow everybody to participate, come up with new products, compete on price, compete on functionality, but you know, that none of us are taking such big risks,- - Yeah, there's a view in the valley. - that the whole thing blows up in our faces. I do think that there is sincere concern that, if we just have a unfettered race to the bottom, that this could end up, you know, choking off the goose that might be laying a bunch of golden eggs. - There is the view in the valley though, that any constraint on technology is bad. - Yeah, and I disagree with that. - Any caution, any principle where you might slow down is the enemy of progress. And the net good is better, if we just race that as fast as possible. - In fairness, that's not just in the valley, that's in every business I know. It's not like Wall Street loves regulation. It's not as if manufacturers are really keen for government to micromanage how they produce goods. But one of the things that we've learned, you know, through the industrial age, and the information age, you know, over the last century, is that you can overregulate, you can have over bureaucratize things, but that if you have smart regulations that set some basic goals and standards, making sure you're not creating products that are unsafe to consumers. making sure that if you're, you know, selling food, you know, people who go in the grocery store can trust that they're not gonna die from salmonella or E.coli. Making sure that if somebody buys a car that you know, the brakes work, making sure that, you know, if I take my electric whatever and I plug it into a socket anywhere, any place in the country, that it's not gonna shock me and blow up on my face. It turns out all those various rules, standards, actually create marketplaces and are good for business, and innovation then develops around those rules. So, it's not an argument that I think part of what happens in the tech community is the sense that we're smarter than everybody else, and these people slowing us down are impeding rapid progress. And you know, when you look at the history of innovation, it turns out that having some smart guideposts around which innovation takes place, not only doesn't slow things down, in some cases, it actually raises standards and accelerates progress. There were a bunch of folks who said, \"Look, you know, you're gonna kill the automobile, if you put airbags in there.\" Well, it turns out actually people figured out, you know what, we can actually put airbags in there and make 'em safer, and over time the costs go down. - There's a great TikTok- - Everybody's better off. - of somebody reacting to drunk driving laws in the eighties. It's great, I'll send it to you. There's a really difficult part in the EO about providence. Watermarking content, making sure people can see it's AI generated. You are among the most deep faked- - Oh absolutely. - people in the world. - Well, because what I realized is when I left office, I'd probably been filmed and recorded more than any human in history, just 'cause I happened to be the first president when the smartphone came out. - I'm assuming you have some very deep personal feelings about being deep faked in this way. There's a big First Amendment issue here, right? I can use Photoshop one way, and the government doesn't say I have to put a label on it. I use it a slightly different way. The government's gonna show up and tell Adobe, you've gotta put a label on this. How do you square that circle? It seems very challenging to me. - Look, I think this is gonna be an iterative process. I don't think you're gonna be able to create a blanket rule. But the truth is, that's been how our governance of information, media, speech, that's how it's developed for a couple hundred years now. With each new technology, we have to adapt and figure out some new rules of the road. So, let's take my example, a deep fake of me, that is used for political satire or just to, you know, somebody doesn't like me and they wanna deep fake me. I was the President of the United States, and there are some pretty formidable rules that have been set up to protect people from making fun of public figures. I'm a public figure, and what you are doing to me as a public figure is different than what you do to a 13-year-old girl in high school, freshmen in high school. And so, we're gonna treat that differently. And that's okay. We should have different rules for public figures than we do for private citizens. We should have different rules for what is clearly sort of political commentary and satire versus cyber bullying, or... - Where do you think those rules land? Do they land on individuals? Do they land on the people making the tools like Adobe or Google? Do they land on the distribution networks like Facebook? - My suspicion is how responsibility is allocated, we're gonna have to sort out. But I think the key thing to understand is, and look, I taught constitutional law. I'm close to a First Amendment absolutist in the sense that I generally don't believe that, you know, even offensive speech, mean speech, et cetera, it should be certainly not regulated by the government. And I'm even game to argue that on social media platforms, et cetera, that the default position should be free speech rather than censorship. I agree with all that. But keep in mind, we've never had completely free speech, right? We have laws against child pornography. We have laws against, you know, human trafficking. We have laws against certain kinds of speech that we deem to be really harmful to the public health and welfare. And the courts, when they evaluate that, they say, hmm, you know, they come up with a whole bunch of time, place, manner restrictions that may be acceptable in some cases aren't acceptable in others. You get a bunch of case law that develops. There's arguments about it in the public square. We may disagree. Should Nazis be able to protest in Skokie? Well, you know, that's a tough one. But, you know, we can figure this out. And that I think is how this is gonna develop. I do believe that the platforms themselves are more than just common carriers like the phone company. They're not passive. There's always some content moderation taking place. And so, you know, once that line has been crossed, it's perfectly reasonable for the broader society to say, \"Well, we don't wanna just leave that entirely to a private company. I think we need to at least know how you're making those decisions, what things you might be amplifying through your algorithm and what things you aren't. And you know, it may be that what you're doing isn't illegal, but we should at least be able to know how some of these decisions are made.\" I think it's gonna be that kind of process that takes place. What I don't agree with is the large tech platform suggesting somehow that we want to be treated entirely as a common carrier. - It's the Clarence Thomas view, right? - Yeah, but on the other hand, we know you're selling advertising based on the idea that you're making a bunch of decisions about your products. - Well, this is very challenging, right? If you say you're a common carrier, then you are in fact regulating them. You're saying you can't make any decisions. - Yes. - You say you are exercising editorial control. They are protected by the First Amendment. - [Obama] Yes. - And then regulations get very, very difficult. It feels like even with AI, when we talk about content generation with AI, or with social networks, we run right into the First Amendment over and over again. And most of our approaches, this is what I worry about, is we try to get around it so we can make some speech regulations without saying we're gonna make some speech regulations. Copyright law is the most effective speech regulation on the internet, because everyone will agree. Okay, Disney owns that bring it down. - Well, because there's property involved. There's money involved. - There's money, maybe less property than money, but there's definitely money. - Well, IP and hence money, yeah. Well, look, here's my general view. - Yeah, but do you worry that we're making fake speech regulations without actually talking about the balance of equities that you're describing here? - I think that we need to have, and AI I think is gonna force this, that we need to have a much more robust public conversation around these rules and agree to some broad principles to guide us. And the problem is, right now, let's face it, it's gotten so caught up in partisanship, partly because of the last election, partly because of Covid and vax and anti-vax proponents that we've lost sight of our ability to just come up with some principles that don't advantage one party or another, or one position, or another, but do reflect our broad adherence to democracy. But the point I guess I'm emphasizing here is this is not the first time we've had to do this. We had to do this when radio emerged. We had to do this when television emerged. And, you know, it was easier to do back then in part because you had three or five companies or you, you know, the public through the government technically owned the airwaves. And so, you could make these. - No, this is the square on my bingo card. If I could get to the Red Lion case with you, I've won, right? There was a framework here that said the government owns the airwaves, it's gonna allocate them to people in some way, and we can make some decisions. And that is an effective and appropriate speech regulation. - [Obama] That was the hook. - Can you bring that to the internet? - I think you have to find a different kind of hook. - Sure. - But ultimately, even though the idea that the public and the government owned the airwaves, that was really just another way of saying this affects everybody, and so, we should all have a say in how this operates. And we believe in capitalism, and we don't mind you making a bunch of money through the innovation and the products that you're creating and the content that you're putting out there, but we wanna have some say in what our kids are watching or how things are being advertised, et cetera. - If you were the President now, - [Obama] Yeah. - And I was with my family last night, and the idea that the Chinese TikTok teaches kids to be scientists and doctors, in our TikTok the algorithm is different. And we should have a regulation like China has that teaches our kids, we don't, it came up. And all the parents around the table said, \"Yeah, we're super into that. We should do that.\" How would you write a rule like that? Is it even possible with our First Amendment? - Well look, for a long time, let's say under television, there were requirements around children's television. It kept on getting watered down to the point where anything qualified as children's television, right? We had a fairness doctrine that made sure that there was some balance in terms of how views were presented. And I'm not arguing, you know, good or bad in either of those things. I'm simply making the point that we've done it before and there was no sense that somehow that was anti-democratic or it was that squashing innovation. It was just a understanding that we live in a democracy. And so, we kind of set up rules so that we think the democracy works is better rather than worse, and everybody has some say in it. The idea behind the First Amendment is we're gonna have a marketplace of ideas that these ideas battle themselves out. And ultimately, we can all judge better ideas versus worse ideas. And I deeply believe in that core principle. We are gonna have to adapt to the fact that now there is so much content, there are so few regulators. Everybody's can throw up any idea out there, even if it's sexist, racist, violent, et cetera. And that makes it a little bit harder than it did when we only had three TV stations or a handful of radio stations or what have you. But the principle still applies, which is, how do we create a deliberative process where the average citizen can hear a bunch of different viewpoints and then say, \"You know what, here's what I agree with. Here's what I don't agree with.\" And hopefully, through that process, we get better outcomes. - Let me crash the two themes of our conversations together, AI and the social platforms. Meta just had earnings. Mark Zuckerberg was on the earnings call. And he said for our feed apps, Instagram, Facebook threads, \"For the feed apps, I think that over time, more of the content that people consume is either going to be generated or edited by AI.\" So, he envisions a world in which social networks are showing people perhaps exactly what they wanna see- - Absolutely. - inside of their preferences. Much like advertising that keeps 'em engaged. Should we regulate that away? Should we tell 'em to stop? Should we embrace this as a way to show people more content that they're willing to see that might expand their worldview? - This is something I've been wrestling with for a while. I give a speech about misinformation in our information silos at Stanford last year. I am concerned about business models that just feed people exactly what they already believe and agree with, and all designed to sell them stuff. Do I think that's great for democracy? No. Do I think that that's something that the government itself can regulate? I'm skeptical that you can come up with perfect regulations there. What I actually think probably needs to happen though is that we need to think about different platforms and different models, different business models, so that it may be that I'm perfectly happy to have AI mediate how I buy jeans online, right? That could be very efficient. I'm perfectly happy with it. If, you know, and so, if it's a shopping app, or a thread, fine. When we're talking about political discourse, when we're talking about culture, et cetera, can we create other places for people to go that broaden their perspective. Make them curious about how other people are seeing the world where they actually learn something as opposed to just reinforce their existing biases. But I don't think that's something that government is going to be able to sort of legislate. I think that's something that consumers and interacting with companies are gonna have to discover and find alternatives. The interesting thing, look, I'm not obviously 12 years old, I didn't grow up, you know, with my thumbs on these screens. So, I'm a old ass, you know, 62-year-old guy, that sometimes can't really work all the apps on my phone, but I do have two daughters who are in their twenties. And it's interesting the degree to which at a certain point they have found almost every, you know, app, social media app, thread getting kind of boring after a while. It gets old, precisely because all it's doing is telling 'em what you already know, or what the program thinks you want to know, or what you want to see. So, you're not surprised anymore. You're not discovering anything anymore. You're not learning anymore. And so, I think there's a promise to how we can, there's a market, let's put it that way. I think there's a market for products that don't just do that. It's the same reason why, you know, people have asked me around AI, you know, are there gonna still be artists around and singers and actors, or is it all gonna be, you know, computer-generated stuff? And my answer is, you know, for elevator music, AI's gonna work fine, you know, for... - A bunch of elevator musicians just freaked out, dude. - You know, for the average, you know, even legal brief, or let's say a research memo in a law firm. AI can probably do as good a job as a second year law associate. - Certainly. as good a job as I ever did. - Exactly, but you know, Bob Dylan or Stevie Wonder... - [Nilay] Lemme ask, there's one thing. - That, that is different. And the reason is because part of the human experience, part of the human genius is it's almost a mutation. It's not predictable, it's messy, it's new, it's different, it's rough, it's weird. That is the stuff that ultimately, taps into something deeper in us. And I think there's gonna be a market for that. - So you, in addition to being the former president, you are a bestselling author, you have a production company with your wife, you're in the IP business, which is why you think it's property. It's good, I appreciate that. The thing that will stop AI in its tracks in this moment is copyright lawsuits, right? You ask a generative AI model to spit out a Barack Obama speech and it it will do it to some level of passibility. Probably C plus, that's my estimation C plus. - It'd be one of my worst speeches. But it might sound sort of. - You fire a canon of C plus content in any business model of the internet, you upend it. But there are a lot of authors, musicians now. Artists suing the companies saying, \"This is not fair use to train on our data to just ingest all of it.\" Where do you stand on that? Do you think that, as an author, do you think it's appropriate for them to ingest this much content? - Set me aside for a second, 'cause you know, Michelle and I, we've already sold a lot of books and we're doing fine. So, I'm not overly stressed about it personally, but what I do think President Biden's executive order speaks to, but there's a lot more work that has to be done on this, and copyright is just one element of this. If AI turns out to be as pervasive and as powerful as its proponents expect, and I have to say, the more I look into it, I think it is going to be that disruptive, we are going to have to think about not just intellectual property, we're gonna have to think about jobs and the economy differently. And not all these problems are going to be solved inside of industry. So, what do I mean by that? I think with respect to copyright law, you will see people with legitimate claims, financing the lawsuits and litigation, and through the courts and various other regulatory mechanisms, you know, people who are creating content, they're gonna figure out ways to get paid and to protect the stuff they create. And it may impede the development of large language models for a while, but over the long term, I don't think that'll just be a speed bump. The broader question is gonna be what happens when 10% of existing jobs now definitively can be done better by some large language model or other variant of AI? And are we gonna have to reexamine how we educate our kids and what jobs are gonna be available? And you know, the truth of the matter is that during my presidency, there was I think a little bit naivete where people would say, you know, the answer to lifting people out of poverty and making sure they have high enough wages is we're gonna retrain them and we're gonna educate them and they should all become coders, 'cause that's the future. Well, if AI is coding better than all, but the very best coders, if ChatGPT can generate a research memo better than the third, fourth year associate, maybe not the partner, you know, who's got a particular expertise or judgment, you know, now what are you telling young people coming up? And I think we're gonna have to start having conversations about how do we pay those jobs that can't be done by AI. How do we pay those better, you know, healthcare, nursing, you know, teaching, childcare, art, things that are really important to our lives, but maybe commercially, historically have not paid as well. Are we gonna have to think about the length of the work week and how we share jobs? Are we gonna have to think about the fact that more people choose to operate like independent contractors, but where are they getting their healthcare from and where are they getting their retirement from, right? Those are the kinds of conversations that I think we're gonna have to start having to deal with. And that's why I'm glad that the, you know, President Biden's EO begins that conversation. Again, I can't emphasize enough, because I think you'll see some people saying, \"Well, we still don't have tough regulations. Where's the teeth in this? We're not forcing these big companies to do X, Y, Z as quickly as we should.\" That I think this administration understands. and I've certainly emphasized in conversations with them. This is just the start. And you know, this is gonna unfold over the next 2, 3, 4, 5 years. And by the way, it's gonna be unfolding internationally. You know, there's gonna be a conference this week in England around international safety standards on AI. Yeah, the Vice President Harris is gonna be attending. I think that's a good thing, because part of the challenge here is we're gonna have to have some cross-border frameworks and regulations and standards and norms. You know, that's part of what makes this different and harder to manage than, you know, the advent of radio and television. Because the internet by definition is a worldwide phenomenon. - Yeah, you said you were the first digital president. I gotta ask, have you used these tools? Have you had the aha moment where the computer's talking to you? Have you generated a picture of yourself? - I have used some of these tools during the course of, you know, these conversations and this research. And you know, it's fun. - Has Bing flirted with you yet? It flirts with everybody I hear. (Obama laughing) - Bing didn't flirt with me, but you know, the way they're designed, and I've actually, raised this with some of the designers. You know, in some cases, they're designed to anthropomorphize, to make it feel like you are talking to a human, right? It's like, you know, can we pass the Turing test, right? That's a specific objective, 'cause it makes it seem more magical. And in some cases it improves function, but in some cases it just makes it cooler. And so, there's a little pizazz there and people are interested in it. I have to tell you that generally speaking though the way I think about AI is as a tool, not a buddy. And I think part of what we're gonna need to do as these models get more powerful, and this is where I do think government can help, is also just educating the public on what these models can do and what they can't do. That, you know, these are really powerful extensions of yourself and tools, but also reflections of yourself. And so, don't get confused and think that somehow what you're seeing in the mirror is you know, some other consciousness. A lot of times this is just feeding back to you. - You just want Bing to flirt with you. This is what I felt personally very, very deeply. - Yeah. - All right, last question. I need to know this. It's very important to me. What are the four apps in your iPhone dock? - Four apps at the bottom. I've got Safari. - Key. - I've got my tax, you know, the green box. - Yeah, you're a blue bubble. Do you give people any crap for being a green bubble? - No, I'm okay. - [Nilay] All right. - I've got my email, and I have my music, that's it. - It's like the stock set, pretty good. - Yeah, you know, if you asked the ones that I probably go to more than I should, I might have to put like words with friends on there where I think I waste a lot of time and maybe my NBA League Pass. - Oh, that's pretty good, that's pretty good. - But you know, I try not to overdo it on those. - League Pass is just one click above the dock. That's what I'm getting outta this. - That's exactly. - President Obama, thank you so much for being on Decoder. I really appreciate this conversation. - I really enjoyed it. And I wanna emphasize once again, because you've got an audience that understands this stuff, cares about it, is involved in it and working at it, if you are interested in helping to shape all these amazing questions that are gonna be coming up, go to ai.gov and see if there are opportunities for you fresh outta school. Or you might be an experienced, you know, tech coder who's, you know, done fine, you know, bought the house, got everything set up and says, \"You know what? I wanna do something for the common good.\" Sign up, you know, this is part of what we set up during my presidency, US Digital Services. And it's remarkable how many really high-level folks decided that for six months, for a year, for two years, them devoting themselves to questions that are bigger than just, you know, what the latest app, you know, or video game was turned out to be really important to them and meaningful to them. And attracting that kind of talent into this field with that perspective, I think is gonna be vital. - Yeah, sounds like it. - All right, great to talk to you. - [Nilay] Thanks so much. - You bet. - [Nilay] Thank you very much. - Really enjoyed it. - I appreciate that. - [Obama] Come on, why don't we get a picture of- - [Nilay] Yeah. - [Obama] the team, 3, 2, 1. One more, okay. Fantastic, really enjoyed it. You did great. - [Nilay] Thank you for saying that. - [Production Assistant] Thank you. - One thing real quick. - Yes, of curse.",
    "transcript_keywords": [
        "people",
        "Yeah",
        "make",
        "social media",
        "government",
        "good",
        "social",
        "President",
        "models",
        "stuff",
        "framework",
        "making",
        "speech",
        "regulations",
        "media",
        "bunch",
        "social networks",
        "rules",
        "President Biden",
        "thing"
    ],
    "transcript_entity_values": [
        "Decoder",
        "Biden",
        "three",
        "the past 15 years",
        "NBA League Pass",
        "2",
        "last night",
        "the First Amendment",
        "Turing",
        "Safari",
        "44th",
        "Blackberry",
        "First Amendment",
        "Meta",
        "One",
        "Sam Altman",
        "Harris",
        "First Amendment",
        "TikTok",
        "US Digital Services",
        "AI",
        "Covid",
        "six months",
        "2015",
        "the next 2",
        "this week",
        "third",
        "the last year",
        "Google",
        "Bob Dylan",
        "3",
        "England",
        "Obama",
        "iPad",
        "a couple hundred years",
        "4",
        "Stevie",
        "China",
        "Clarence Thomas",
        "Four",
        "first",
        "Instagram",
        "IP",
        "Nazis",
        "5 years",
        "Chinese",
        "the Obama Foundation",
        "last year",
        "fourth year",
        "the work week",
        "AI",
        "Googles",
        "the Harvard Lab",
        "EO",
        "Disney",
        "Stanford",
        "12 years old",
        "2016",
        "Adobe",
        "Facebook",
        "Microsofts",
        "John Podesta",
        "second",
        "five",
        "the eighties",
        "twenties",
        "Blackberry",
        "1",
        "Skokie",
        "vax",
        "one",
        "four",
        "10%",
        "today",
        "valley",
        "the last century",
        "John Holdren",
        "two years",
        "years",
        "a year",
        "3",
        "Barack Obama",
        "America",
        "the United States",
        "two",
        "62-year-old",
        "Red Lion",
        "Michelle",
        "our First Amendment",
        "Mark Zuckerberg",
        "iPhone",
        "100",
        "the Stanford AI Center",
        "13-year-old"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "TIME",
        "LAW",
        "ORG",
        "ORG",
        "ORDINAL",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "LAW",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "GPE",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "NORP",
        "DATE",
        "NORP",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "LOC",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "GPE",
        "GPE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "LAW",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE"
    ]
}