{
    "id": "X2sjoQY3zSE",
    "title": "Green Grilled Cheese | Happy St. Patrick's Day!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-03-17T16:23:24Z",
    "video_url": "https://www.youtube.com/watch?v=X2sjoQY3zSE",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "st patricks day",
        "green grilled cheese",
        "rainbow grilled cheese",
        "how to make grilled cheese"
    ],
    "views": 183795,
    "likes": 6000,
    "comments_count": 834,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it going? It's Justine, welcome back to my kitchen, and today, it's Saint Patrick's day, and to celebrate, I am making my inspiration, my reason for living, I am making grilled cheese sandwiches. Now I've made these before, I made a grilled cheese tower back in the day, and that was the first time that I got to use this little griddle here. - What do you think we're making Nathan? (friend laughs) - Ah god! - Oh, geez! I'm using tongs! Don't give him the stick! - Don't give him the stick! - Alright, give him the stick - Don't give him the stick! - Oh yeah, baby! - But today, we're going to make it special, we're going to make them green. Now, I don't know if this is going to work at all, I actually don't know what to expect, as per usual. I've seen so many people making the rainbow grilled cheeses, so I thought, hey, why not try to make it green?! I don't really know what's going to happen. So let's just get started. The first thing that we've got is our bread, and we've got some butter, and most importantly some green food coloring. You are the key ingredient to this recipe. Oh! Cheese! I need cheese! (opens refrigerator) So I decided to go with a nice mild cheddar. Do you like cheese? - No, no it looks terrifying. (laughter) - Haha, he's lactose intolerant so, probably won't be having any of this today. I need to melt the butter and make the butter green. So with our butter we're going to put it just, ya know, I was going to say a little bit of food dye but that's a lot. We're going to put this in the microwave. (microwave opens) (buttons dinging) - Add a minute and there we go, we're cooking. Here's the problem, the green food dye is splattering everywhere. Ow!! Geez, oh, god! I burned myself! (microwave humming) This is very hot, I think I'm going to turn it down. Oh my god, my phone is burning! - (singing) Let me see that bread! Oh, I stabbed it! Got the butter, wow. Wow! There it is, that is definitely something that I definitely don't ever want to see again. This is repulsive. So, here is the problem, I probably should have used a different type of dye. (singing) Okay now we're probably going to make the same mistake. OF course it's all up here! Because why would it not be accessible? Somewhere that it's easy to get? (mumbles) (rummages through cabinet) Wow! I found some cans of pumpkin! From two pumpkins ago. Two Halloweens, two pumpkins ago, huh? These are definitely expired. This is what I've been looking for! My cake! This isn't what I was looking for. But, my cake leveler. That's something I need. What's this? Do you know what this is? I think this might be made for, like, not for someone taller. Should have been a baller. Okay, what am I even doing? I was looking for green food coloring that was gel and whoever painted my ceiling did a very bad job of it. I'm getting a whole new perspective on my life, my house. Definitely my lack of memory retention. Okay, why am I here? Why are any of us here? Here catch! This is something that I've been looking for that does not belong here. So absolutely nothing was accomplished. This butter is looking disgusting. Now we're going to melt our cheese. We probably should have Googled to see what everybody else did and stole their ideas, but I'm going to do my own idea. So, I'm going to just melt this cheese into my own mixture and I'm going to pour it in between the slices of bread. (plate clinking) I think I'm going to put this on a lower power setting because I feel like it's going to burn and I do not want that to happen. We're going to see how this works out. Yes! It looks amazing! I think I can just dump it. Not something that you should ever try. We've gotta get all the way to the edges! So I remember back when I was little, I think was probably in Kindergarten and they're like, 'Justine, what do you want to be when you grow up?'. I said I wanted to be a chef, I don't know why. I never liked cooking, and here I am, many many years later, doing my childhood dream. I don't know why that was my childhood dream because I never liked cooking. I think I got nervous. Okay, so lets flip this over. Oh, my cheese is boiling! Okay, so we're going to mix this cheese up a little more. Don't try this at home kids! And if you do try it, don't tell your parents that I, Justine, this was her idea because it was not her idea! I will not be taking any angry phone calls or emails from your parents. A flipper-doodle-do. This is definitely mixing better. (mixing cheese) Are you making fun of me? (chuckles) - I'm breaking out in hives just looking at this. - Look at this cheese! Can you guys believe this? This is perfect. This is actually exactly what I was hoping was going to happen. (chuckling) - This is unreal. This is so great. Oh god, wait, I have to eat this. Gonna get that nice, and all on to the edges, just like so. Oh, oh, oh! Hot, hot, hot! Okay, I'm going to give it a flip. Cause I don't know what is happening on this other side. Oh, I can't wait to show you guys the surprise that I have for you! A nice little fun little addition to this. So because I have some of this leftover dye, I made something ahead of time because I wasn't quite sure if it was going to work or not. I made shamrock butter. Little, things. I mean, I don't know why you would ever do this but. So using the green butter, you've got a little green shamrock butter. Isn't that cute? This is not healthy at all. This is slime! This is the new challenge. It's the cheese challenge. I challenge someone to eat all- no, don't eat that. I don't want to be the one who starts that. This has got to go away. I can never see this again. Now you guys know what it's time for. It's time for slow-mo cheese taste test. Let's go. (dramatic music) Oh my god, it's so good! I mean, this thing is doused in butter, filled with delicious melted cheese. If only you were not this disgusting green color. Oh my god, I am so happy right now. I don't think I have ever felt this kind of happiness. I need Jenna to try it because she has got to taste this. It is phenomenal. - You want me to eat that? - Its so good- - You eat it first. - Jenna I already have, and it's- - Prove it. (crunching food) - It's so good! - Put it down your gullet! You're going to have some toilet trouble. (laughs) - Just take a bite, I swear. Its the best. I swear, it's so good. - But, I don't want it to be- - Just eat it. - Green. - The middle part of it. It's so good. - It's green! - Don't look at it. - I'm gonna see it. - Again. - Very soon. - I can't! - Your tongue is green! - I've eaten a lot of this, its not healthy. Alright guys, thanks so much for watching. This is, by far something that you should never make because it is dangerous. It is dangerous for the health, it is dangerous for the environment. I don't even want to see this later, but I'm definitely going to. I will see you guys later, as well. Bye! (Irish music playing)",
    "transcript_keywords": [
        "Saint Patrick day",
        "cheese",
        "green",
        "butter",
        "Saint Patrick",
        "make",
        "god",
        "give",
        "grilled cheese",
        "green food",
        "making",
        "guys",
        "eat",
        "making grilled cheese",
        "Patrick day",
        "made",
        "good",
        "stick",
        "grilled cheese sandwiches",
        "grilled"
    ],
    "transcript_entity_values": [
        "first",
        "the day",
        "Kindergarten",
        "Nathan",
        "Irish",
        "two pumpkins ago",
        "today",
        "Saint Patrick's",
        "Justine",
        "Jenna",
        "Two"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "NORP",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL"
    ]
}