{
    "id": "X3E0kbSYd0k",
    "title": "Small Phones Are Back (But Not Like You Expect)",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2021-02-03T18:12:16Z",
    "video_url": "https://www.youtube.com/watch?v=X3E0kbSYd0k",
    "category": "Science & Technology",
    "tags": [
        "best small phone 2021",
        "best compact phone 2021",
        "small phones",
        "tiny phones",
        "iphone 12 mini review",
        "galaxy s21 review",
        "galaxy z flip review",
        "motorola razr review",
        "flip phone 2021",
        "folding phone 2021",
        "folding screens",
        "best flip phone",
        "best folding phone"
    ],
    "views": 497925,
    "likes": 20838,
    "comments_count": 1492,
    "description": "This video is sponsored by RhinoShield. Protect your device  and get 20% off if you use code MRMOBILE within 48 hours (or 10% off thereafter!): Samsung Galaxy S21:  iPhone 12 Mini:  RhinoShield Collabs Designs:    [SMALL PHONES 2021]  For as long as I have been covering mobile tech, my fellow phone geeks have loudly longed for the return of \"the small phone.\"  Why? For those of us old enough to remember when the name of the game was making phones as pocketable as possible, nostalgia plays a part, for sure. Then theres those whose clothing options make pocketability impossible for todays shin-sized slabs. And rounding it out are those trying to scale back their screen time: I guess the idea is, if your phone is smaller, maybe itll force you to be more intentional with the time you spend on it.   So there are good reasons for the comeback the small-smartphone squad constantly calls for. But when I took stock of all the small or smallish mobile phones in my review queue, I became convinced that the small phone as we know it may be dead. And the small phone of the future  is already nearly here. It's called the clamshell foldable, and in this video I'm going to tell you why I think it's going to make the iPhone minis and Sony Compacts of the world obsolete.   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILES SMALL PHONES 2021 VIDEO EDITORIAL]  MrMobile's video editorial on the Small Phones of 2021 was produced following extended testing of all of the devices featured in this video, which are a mix of review samples from manufacturers and retail purchases as follows:  Samsung Galaxy Z Flip - Purchased Samsung Galaxy Z Flip 5G - Purchased Samsung Galaxy S21 - Review Sample Motorola RAZR 2019 - Review Sample Motorola RAZR 5G (2020) - Review Sample Motorola RAZR 5G (2020)(2) - Purchased Apple iPhone 12 mini - Purchased  MrMobile does not accept compensation from the manufacturers of the products he reviews; no payment was provided and no manufacturer or carrier was afforded a preview or copy approval rights concerning this content. The lone sponsor of this video is RhinoShield.   [LINKS]  The iPhone 12 mini is (mostly) great [NothingButTech]:   Sony Xperia Z1 Compact Review: small phones, big performance [Pocketnow]:   You've Been Asking For A New Small Phone Well, The Clamshell Foldable Is It [Android Central]:   Sony Xperia Compact release date, price news, rumors, and just how small it could be [TechRadar]:   iPhone 12 Mini Sales Lackluster Compared to Other Models [MacRumors]:   Apple Shifting Some Production From iPhone 12 mini to iPhone 12 Pro to Meet Demand [MacRumors]:   Latest Samsung Galaxy Z Flip 3 specs leak reveals a choice of two memory and storage configurations and universal improvements over the Z Flip 5G but at a cost [Notebookcheck.net]:   Road Test: I Did a Digital Detox With a $300 Dumb Phone [Self.com]:   iPhone SE Review: Bigger on the inside [iMore]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford Future plc a commission should you make a purchase. This does not affect MrMobiles editorial content. See Future's disclosure policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #iphone12mini #galaxys21 #sonycompact #galaxyzflip #razr #razr5g #zflip #flipphone #foldable #foldingscreen #xperiacompact #tinyphone #smallphone",
    "description_links": [
        "http://bit.ly/MrMobile-S21",
        "http://bit.ly/MrMobile-i12Mini",
        "http://bit.ly/MrMobile-Collabs",
        "https://www.youtube.com/channel/UCSOp...",
        "https://www.youtube.com/watch?v=o7n-aK2IS5c",
        "https://pocketnow.com/sony-xperia-z1-compact-review",
        "https://www.androidcentral.com/youve-been-asking-new-small-phone-well-clamshell-foldable-it",
        "https://www.techradar.com/news/sony-xperia-compact-release-date-price-news-rumors-and-just-how-small-it-could-be",
        "https://forums.macrumors.com/threads/iphone-12-mini-sales-lackluster-compared-to-other-models.2278826/",
        "https://www.macrumors.com/2021/01/20/production-shifting-from-iphone-12-mini-to-pro/",
        "https://www.notebookcheck.net/Latest-Samsung-Galaxy-Z-Flip-3-specs-leak-reveals-a-choice-of-two-memory-and-storage-configurations-and-universal-improvements-over-the-Z-Flip-5G-but-at-a-cost.517790.0.html",
        "https://www.self.com/story/light-phone-review",
        "https://www.imore.com/iphone-se",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.futureplc.com/terms-conditions/",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- This video is sponsored by RhinoShield. You know, I've been making tech videos for almost a decade. And for the vast majority of that time one of the only things us phone geeks could agree on was that we all missed small phones. Why? For those of us old enough to remember when the name of the game was making phones as pocketable as possible nostalgia plays a part for sure. Then there's those whose clothing options make pocketability impossible for today's shin sized slabs. And rounding it out are those trying to scale back their screen time. I guess the idea is if your phone is smaller, maybe it'll force you to be more intentional with the time you spend on it. So there are good reasons for the comeback the small smartphone squad constantly calls for. But when I took stock of all the small or smallish devices in my review queue, I became convinced that the small phone as we know it may be dead. And the small phone of the future is already nearly here. (upbeat music) Now I wanna be clear that when I say small phones I'm not talking about tiny phones. And yeah, there is a difference. Tiny phones are cousins of a category I like to call savior phones, because they exist to save you from your smartphone addiction, often by either curtailing features or omitting them entirely. So you won't want to use the thing as much. What's worse, usually you're asked to pay a premium for the privilege. Small phones are not that. Ideally, these do almost everything their larger cousins do just in a smaller footprint. For a while, from about 2013 to 2018, the gold standard for this approach was Sony. Which would debut alongside each year's flagship smartphone a companion model, which packed the same, or nearly the same, specs into a more pocketable parcel that Sony called the Compact. While they weren't always consistent in the quality, ask any Android nerd if they remember the Compact and they'll probably have some fond memories. Now I say Android nerd because our friends across the aisle in iPhone land, they've had little phone life a little bit easier. In 2016, alongside its high-end iPhone success, Apple released the first iPhone SE. Which in addition to being the most beautiful device Rene Ritchie has ever committed to film, was also something of a dream come true for those who even at that point were fed up with the ballooning scale of smartphones. Apple did what so many of us were clamoring for, crammed updated internals into an older, smaller chassis, and sold it at a competitive price. It would be four years before Apple would revisit fun sized phones, but when it returned in 2020 it went all in. For tiny iOS on a budget, the iPhone SE got new silicon and an aesthetic upgrade, or maybe downgrade, to the iPhone 8 style, in the summer. And the real deal came around in October. This is the iPhone 12 Mini. I talked about it on my road trip review to Philadelphia. You saw a lot of it on my road trip review to Mystic, Connecticut. It's my favorite Apple smartphone since 2010. Like the 12 Pro and Pro max, it resurrects that decade old slab-sided design. But unlike its siblings, it does so in a size that fits not just my hands, but almost everyone's. As Jacklyn from NothingButTech puts it... - It's easily one handable. I can hit all four corners of the display, and power button, and volume rockers, all with one hand. I can't even remember the last time I could do that on a flagship. - And you know, it's not just for those with small hands, or small pockets, or dudes who are between jobs so they get to spend a month not doing much. Am I right? Not that I know anybody like that. Fact is, when I need to use an iPhone, I prefer the Mini, despite its reduced camera capability and endurance, all because of that hyper-convenient size. Now, if you have a critical mind, which is useful in these times, you might be asking, okay, if small phones are so great why are all signs once again pointing to their extinction? MacRumors recently reported that the iPhone 12 Mini made up just 6% of sales during the launch period, which might explain its subsequent report that Apple has shifted production away from the Mini in order to meet demand for the more popular 12 Pro. Meanwhile, the rumors of Sony reviving its Compact line continue to remain just rumors. And as much as I'm personally attracted to the Galaxy S21, favoring its smaller size versus its Ultra alternative, it's really not a proper small phone any more than Google's Pixel 5 is. It's just smaller, in a relative sense. I think the answer to that sticky extinction question is that, small phones are dying because they're not a great fit for the modern world. And I believe they'll soon be replaced by a reboot of a smart concept from the old world. First though, whether you got a Galaxy S21, or an iPhone Mini, or something in between, you gotta protect it from the rigors of any world. And today's sponsor can help you do that. In my line of work I see a lot of phone cases. But here's the thing, in a home like mine, the term 11 foot impact is hardly academic. (phone clattering) That's why my sponsor RhinoShield built the SolidSuit. It's made of durable polymer with a shock absorbing honeycomb structure. And at an average of 30 grams, it protects your phone without adding bulk. Most importantly though, it's not boring. From the abstract to the throwback, there's a design for everyone. Including NASA nerds like me, whose favorite cases come from the cosmos. And if none of those, or even these looks, is your style, well you can build your own design right on RhinoShield's website. Including a classy monogram option, like this one the company surprised me with. And for the iPhone, the Mod NX case lets you mix and match back plate designs with frame, case, accent rim, even swap out those button colors. RhinoShield ships worldwide, covers all iPhones and most Android flagships, and backs all its cases with a lifetime warranty. Use code MRMOBILE at the link below for an exclusive discount. And thanks to RhinoShield for sponsoring this video. So what keeps killing the small phone? Well, I think the core of it is the simple fact that what's convenient for a pocket, and what's useful for a smartphone, are fundamentally opposed concepts. I mean, think about it. The phone that disappears into a pocket just physically can not be big enough to type as comfortably on. Its screen can't take up temporary duty as a small tablet, like larger phones can. Its small battery doesn't last as long. And it doesn't offer enough space for flashy feature centerpieces, like periscope zoom cameras. So, in an ideal world, what you want is a phone that gives you both. Plenty of space to spread out on a six and a half inch screen, say. Enough casing space for a battery of between 3,000 and 4,000 milliamp hours. And ideally some capable cameras. All of it crammed into a chassis that fits into a pocket better than anything else out there. That's right, if you ask me, the small phone of the future is mostly here already. And you know it as the foldable. Not the Galaxy fold type, or the coming rollable format. Both of those are phones that can temporarily turn into tablets, which is a totally different thing. I'm talking about the Galaxy Z Flips and Motorola Razors of the world, clamshells. Open, they're almost indistinguishable from a typical slab. But closed, they take up half the space. Working their hinges revives memories of the past. They free up space in a pocket or purse. And if you like, they can even discourage you from using your phone as much with that one extra step you have to take before using it. Each of the three pillars I called out at the top of this video has benefits folks value in a small phone. Note my careful use of weasel words here. Almost, nearly, mostly. The fact is, as much as I love my foldables, they're not quite ready to take up the small phone mantle just yet. That's obvious if you've been watching my reviews. Of the four clamshell shell foldables that have launched thus far, none has succeeded in duplicating the full camera capabilities of their slab siblings. Same goes for battery life. Durability, while not as large a concern as it once was, nevertheless lags behind phones without moving parts. There's still the issue of the crease. And yes, foldables are still priced at a premium. But folks, fixing those flaws is a matter of when, not if. And if you don't believe me just look at how quickly Samsung and Motorola are iterating. The Razor 5g feels almost in another class compared with the first-generation Razor that proceeded it by just six months. And while the Z Flip 5g of August is more modest with the upgrades, because there wasn't much wrong with the Z Flip from February. That first Z Flip contained tons of upgrades and improvements as a result of the lessons learned from the first Galaxy Fold. Which at that point was still a newish device. Better yet, trade-ins on the Samsung side, and aggressive discounts on Motorolas, mean the prices have already begun to drop below the thousand dollar mark. And of the leaks we're seeing for the next generation, durability is rumored to be high on the priority list. So, while clamshell foldables aren't yet the new small phone, I think within a few years at most, they will be. And thanks to the combination of their practical benefits and just plain old fun, I think they stand a good chance of being more successful than any small phone has so far. Thanks for joining me for this thought experiment, folks. Let me know if you'd like to see more content like this on the channel by sharing the video if you're already subscribed. And by subscribing if you're not. This video was produced with a combination of review devices loaned from manufacturers and retail units purchased by Mr. Mobile. No phone manufacturer offered compensation in exchange for this coverage, or was given copy approval, or an early preview of this video, however. And finally a shout out to Ara Wagoner at Android Central, who's been ringing this same bell for some time. I've linked her similar editorials below. Until next time. Thanks for watching. And if you can't stay home, then stay safe and mask up while you stay mobile, my friends. As much as I love my foldables they're not, Jibo. (Jibo chattering) Thank you, Jibo. Thank you for the turtle. You're the-- No, it's Michael. That's my mom, you think I am. Okay, it's good to hear your voice too, Jibo. It doesn't matter what you're saying. You're a delight.",
    "transcript_keywords": [
        "small phone",
        "small",
        "phone",
        "phones",
        "iPhone",
        "missed small phones",
        "Mini",
        "Apple",
        "Galaxy",
        "time",
        "tiny phones",
        "video",
        "proper small phone",
        "Android",
        "small phone mantle",
        "smartphone",
        "smaller",
        "world",
        "foldables",
        "RhinoShield"
    ],
    "transcript_entity_values": [
        "the summer",
        "2020",
        "Jibo",
        "First",
        "almost a decade",
        "year",
        "12",
        "Razor 5",
        "iPhones",
        "Mystic",
        "Connecticut",
        "Galaxy Fold",
        "half",
        "Motorolas",
        "Samsung",
        "Mini",
        "about 2013 to 2018",
        "October",
        "Apple",
        "11 foot",
        "2016",
        "Android Central",
        "NothingButTech",
        "Rene Ritchie",
        "iPhone Mini",
        "just six months",
        "a Galaxy S21",
        "four",
        "that decade old",
        "between 3,000 and 4,000",
        "2010",
        "just 6%",
        "Mobile",
        "Motorola",
        "today",
        "iPhone",
        "first",
        "six and a half inch",
        "Razor",
        "30 grams",
        "Philadelphia",
        "Google",
        "NASA",
        "Michael",
        "Galaxy",
        "Jibo",
        "August",
        "RhinoShield",
        "MacRumors",
        "a few years",
        "Jacklyn",
        "thousand dollar mark",
        "5",
        "Motorola Razors",
        "Ara Wagoner",
        "iPhone SE",
        "the Galaxy S21",
        "February",
        "four years",
        "Sony",
        "three",
        "Jibo",
        "one",
        "Android",
        "8"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "PERSON",
        "ORDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "NORP",
        "PERSON",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE",
        "FAC",
        "NORP",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "FAC",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}