{
    "id": "x3Iz0SPy2Ic",
    "title": "Galaxy Note 7 Teardown - Screen Repair, Charging Port Fix, Battery Replacement",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-08-19T05:06:16Z",
    "video_url": "https://www.youtube.com/watch?v=x3Iz0SPy2Ic",
    "category": "Howto & Style",
    "tags": [
        "Note 7",
        "Galaxy Note 7",
        "Note 7 Repair",
        "Screen replacement",
        "How to fix Note 7",
        "Stylus",
        "spen",
        "battery",
        "charging port note 7",
        "charging port",
        "dead battery note 7",
        "replacement",
        "repair",
        "fix",
        "teardown",
        "disassembly",
        "assemble"
    ],
    "views": 530742,
    "likes": 9413,
    "comments_count": 1086,
    "description": "Awesome Smart Phone Tool Kit:  Green Pry tool:  Phone opening metal tool:  Let me know if you need specific parts or if those links stop working!!   Here is the Full disassembly video for the Samsung Galaxy Note 7.  If you need to replace your screen, your charging port, or battery, this video shows how I personally took apart my phone.  A repair always makes more sense after you've seen it done by someone else.  And that is what makes YouTube an awesome place!   This video is for the people who want to see whats inside the Galaxy Note 7. Tearing down the Note 7 is very similar to the Note 5, as well as the Galaxy S7 and the Galaxy S6. Samsung hasn't changed their overall design in a few generations.  But that's totally fine, because this design is working out pretty well. While it still sucks to open up, the phone is extremely durable, (Minus the easy scratching part.)   Let me know if you have any questions!  The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad",
    "description_links": [
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/1R7Ltic",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "Today Im going to show you how to take apart and fix most everything on your Galaxy Note 7. I will link all of the replacement parts and tools that youll need down in the video description below as soon as they become available. Hopefully youll never have to replace your screen with the new shatter resistant gorilla glass 5 because taking apart this phone is not for the faint of heart. It will require courage, bravery and at least 6 healthy Pokmon. Remove the bottom S pin and the top SIM card tray. And then with a heat gun youll need to heat up the back cover universally all around the outside. I heat it up until its too hot to touch with my fingers. Then I can take a thin metal pry tool and slide it between the metal frame of the phone and the back glass, being careful not to lift up too tall or else the glass will crack and break and I want to reuse my back glass cover. I will reheat the glass about every 30 seconds as I slide my tools around the edge. Before going around that back curve Ill stop with my metal tool and switch to a playing card or business card, because the business card is flexible enough to wrap around that curve without putting any extra stress on the glass. Its been about 30 seconds so Im going to heat up the phone again until its too hot to touch and then slide the second card around that second curve and slide it up, slicing through the adhesive all the way around the outside. Im not going inside the phone too deep because there is the wireless charger and the NFC pad that we dont want to rip around the edge, as well as a little ribbon cable right next to the power button. So watch out for that. Ill slice through the remaining adhesive around the top edge and the back panel will lift off away from the phone. If youre just replacing your back panel, they do sell replacements; usually theyre around 20 or 30 bucks. I will link these down in the video description. They will come with their own adhesive so you can peel off the old adhesive and youre good to go. There are 11 screws around that backside; remove all those and try to keep them in order. Even though they appear to be the same size its always good to keep your screws organized. The loud speaker comes off easily enough; set that off to the side. And then the wireless charging and the NFC pad lift off as well. You can see the gold contact points at the upper corner that just rest against the motherboard and thats how it charges the battery through the board. Heres the vibrator motor as well. Now that we can see the guts of the phone we will unplug the battery, making sure that theres no electricity coursing through the board. And we can unplug the S pin. Removing the battery is relatively easy. I am using my metal pry tool; just make sure that you do not puncture the battery at all. I did slice my bottom edge a little bit, which shouldnt be a big deal as there is no copper exposed, but still, you want to be very very careful with the batteries. Im going to undo the screen ribbon right here on the left hand side. And then we have the IR blaster next to the 5 megapixel front camera. Well talk about those more in a second. Im going to disconnect the ear piece and the front sensor array, and then this other ribbon cable on the side along with the power button. All of these unsnap like a little Lego. Down here we have some new ribbon cables. Instead of a wire connection its now a ribbon. We will disconnect the home button cable and then we have two screws before we can lift off the motherboard. Im just going to fold it over because there is one more Lego-like connection at the bottom where the charging port connects to the bottom of the motherboard. Its been the same way since the Note 5, and the Galaxy S7 and the Galaxy S6. So well just take my plastic non-marring pry tool and unsnap that from the motherboard. Here is the rear 12 megapixel camera. It does have a little bit of adhesive holding it onto the board. You can see the OIS stabilizing feature. The camera itself moves around inside of the housing to stabilize your image while youre holding your phone. This works for pictures and for video. Well set that back in its frame and line up the Legos so we can connect them again. Heres the front array. It has an infrared LED that supposedly helps with the iris scanner in low light situations so it can find your pupils and scan it into the phone. Well tack that back into place. Heres the iris scanner on the right. And the front 5 megapixel camera on the left. Cute little guys. The iris scanner is what you use to unlock your phone with just your eyes. Well put those back into place. And here is the charging port. There are three screws holding it down. Remove all 3 screws and then you can disconnect the headphone jack. A phone isnt a phone without a 3.5 millimeter headphone jack. The charging port is oddly shaped so be careful when youre pulling it out and make sure you have all the components and nothing rips, especially if you need to reuse it. If youre replacing it you probably dont need to be so careful. This charging port has the USB type C as well as these two signal wires up at the top. Except theyre not wires anymore, they are ribbons, which is interesting. Down here at the bottom of the charging port we can see the USB type C connection as well as the microphone. It has a little hole in the bottom that rests against the frame. Ill talk about the water proofing abilities of this phone in a future video. So make sure youre subscribed so you get the notification for that. Now here is the heat pipe. These things are always interesting to me. Some manufacturers call them liquid cooling which I think is a bit of a stretch since theres not really any visible liquid inside of them; its more of a vapor tube or a vapor chamber. Its more fair to call them a heat pipe instead of liquid cooling. The little fibers you see here help transfer the heat up and down through the pipe as it rests up against the processor. Well fold the copper back down into place. Pinch it down and its as good as new. Well put the thermal pad back into place and move on to the screen replacement. Now I was unsuccessful at removing this screen successfully. I broke mine during the process as I imagine most everyone else will as well. There is an extraordinary amount of adhesive holding this screen into place. I imagine that has to do with the waterproofing that the Galaxy Note 7 has. So far Ive heated the screen up till its too hot to touch and Ive slid a playing card in through the little battery hole so it pokes out the side and this gives me a starting point to slide another playing card around the edge to soften the adhesive. Remember that there are multiple layers to the screen, like the digitizer and the AMOLED layer, and if you accidentally separate those two layers, your phone will be broken. Now I imagine if youre trying to remove the screen, the screens already broken anyway. Samsung has industrial machines that can remove this screen really easily with heat and suction and grabbing all the right points on the frame, but local repair shops like myself, without those machines, its going to be a tough task. Luckily there isnt any reason to remove the screen unless its broken so you wont need to be as meticulous as me. Just make sure not to damage the home button and menu buttons as it comes off during your screen replacement. Youll see where those are at in a second. I wonder if Samsung could develop some kind of adhesive pull tabs like whats underneath the iPhone batteries that helps it release a lot easier. One little pull tab stuck somewhere inside of your phone and all of the adhesive would come off. It might add some slight thickness to the screen but it would make replacing things a lot easier. As you can see with a screen replacement its getting pretty ridiculous at this point. I am heating it up about every 30 seconds and then sliding more playing cards in along the side, making sure to avoid where the AMOLED screen starts on each of the corners. Heres where I made my first big mistake trying to slide my card in underneath this ribbon cable. I sliced right through it and I imagine theyre probably pretty important. There are a few other points along the screen that Ill mention in a second that you have to watch out for; one is the other ribbon cable at the top along with the whole ribbon that goes to the AMOLED screen. And then at the bottom you have the two menu buttons and the home button itself. So basically all around the whole edge of the phone is pretty fragile. Now that all the adhesive is cut or loosened I can lift up the bottom and make sure that Im not ripping the menu buttons as I lift off the screen. So Ill tuck those back down into place, and the screen is off. So this is the replacement screen. This is what it will look like if you need to buy one for yourself. Except for yours wont be cut along the top ribbon and nothing will be sliced off like I managed to do with mine. It will have some adhesive on it that you can use to reattach to your old frame. To remove the home button and the menu buttons they are slightly adhered down to the frame. Im going to lift those off and pull the ribbon through the frame hole and you are set. If you ever do need to replace your fingerprint scanner or menu buttons you do have to take apart your entire phone to get to this point. Remember I will link all the replacement parts down in the video description below. I am going to wait until parts become available for this Note 7 before I put mine back together. I will be replacing the screen and the faulty fingerprint scanner. I say faulty because, well, its my fault that its damaged. I want to admire this frame for one quick second. You can see how thick the metal is all the way around the outside. There is an extraordinary amount of metal in this phone; probably enough that you can make two Nexus 6Ps from just one Note 7 frame. Huawei should take a page out of Samsungs book. I hope you enjoyed this teardown. I enjoyed making it. If you have any questions, leave them down in the comments. And please subscribe so you dont miss my future teardown videos. My next video will explain how the Galaxy Note 7 is water resistant. Bonus points if you follow me on Twitter and Instagram. And every now and then Ill throw a snap story out with behind the scenes footage as well. Thanks a ton for watching! Hope to see you around.",
    "transcript_keywords": [
        "screen",
        "phone",
        "back",
        "adhesive",
        "Galaxy Note",
        "ribbon",
        "frame",
        "Note",
        "card",
        "bottom",
        "heat",
        "screen replacement",
        "Ill",
        "ribbon cable",
        "menu buttons",
        "Galaxy",
        "lift",
        "button",
        "glass",
        "AMOLED screen"
    ],
    "transcript_entity_values": [
        "about 30 seconds",
        "the Note 5",
        "just one",
        "iPhone",
        "Lego",
        "Instagram",
        "IR",
        "two",
        "jack",
        "three",
        "at least 6",
        "20 or 30 bucks",
        "Twitter",
        "Legos",
        "Huawei",
        "12 megapixel",
        "about every 30 seconds",
        "Samsungs",
        "11",
        "5 megapixel",
        "5",
        "3.5 millimeter",
        "NFC",
        "the Galaxy S6",
        "Pokmon",
        "second",
        "first",
        "the Galaxy S7",
        "Samsung",
        "the Galaxy Note 7",
        "3",
        "One",
        "USB",
        "AMOLED",
        "one"
    ],
    "transcript_entity_types": [
        "TIME",
        "EVENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "TIME",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL"
    ]
}