{
    "id": "x4sS_piqQzY",
    "title": "Can You Actually Put Your PC In A Fridge?",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-10-20T18:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=x4sS_piqQzY",
    "category": "Science & Technology",
    "tags": [
        "pc",
        "computer",
        "refrigerator",
        "fridge",
        "cooling",
        "condensation",
        "compressor",
        "phase change",
        "components"
    ],
    "views": 419682,
    "likes": 23880,
    "comments_count": 1211,
    "description": "Play World of Tanks for free at  New players will receive 500 gold, 7 days premium time, and a T-127 by using my code TANKTASTIC. Thanks to Wargaming for sponsoring this video.  Can you properly cool your computer components just by putting them in a refrigerator?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://tanks.ly/2RBBrve",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Heat is the constant nemesis of any computer enthusiast, and between custom water loops, RGB fans and beefy tower-style heat sinks, a massive industry has sprung up around keeping your precious components as cool as possible. (laughs) Not a problem for me. (laughs) But is all this effort for nothing? I mean, nearly all of us have a refrigerator in our homes to reliably create a cold environment so we don't get food poisoning from our leftover Frito pie. So why can't we just stick our computers in a fridge and forego all of these expensive cooling gadgets? Well, other than the fact that your cables will stick out of the fridge and cause you to lose cold air, embarrassing, there are actually some pretty big issues with the idea. The first thing to remember is that a refrigerator is designed to remove heat from food and then turn off its own compressor once everything inside gets down to a cold enough temperature, relying on insulation to keep things cold for a while before it has to kick back on. Although the fridge might have to work harder if you put in a bunch of Thanksgiving turkey that's at room temperature, it can still handle the task since the turkey isn't going to be continually spitting out tons of heat. Computer components, on the other hand, generate lots of heat, especially when you're running \"Doom Eternal\" at 8K or unzipping all that RAM you downloaded. In even the best-case scenario, a refrigerator's compressor won't be able to remove all that continuous heat quickly enough, meaning the inside of the fridge could actually become warm. And at worst, you could end up damaging the fridge as the compressor constantly strains to cool things down. On top of that, you'd run a high risk of actually wrecking your components. Suppose you leave a PC inside a fridge for long enough for the component surfaces to cool off. Any moisture inside your refrigerator could then condense on your components, just as it condenses on a cold drink on a hot, humid day. That certainly looks super refreshing in a soda commercial, but PC components don't drink soda. That's a free tech tip right there. If your PC components get wet, they could short out, and suffice it so say that your crazy experiment to prolong the life of your electronics would come to an ironic, tragic end. And if you put your PC in a fridge that you open regularly, this risk would be even greater, as you'd probably introduce more warm, moist air every time you open it. Disgusting. But why don't radiators and water coolers that are designed for computer parts suffer from the same problems? Well, although these solutions market themselves with cool names like PrimoChill and TWIN FROZR, your components are still much warmer than ambient. Even if you have an awesome cooler that keeps hour high-performance CPU and GPU below 60 Celsius under load, that's still going to be much warmer than the ambient room temperature unless you're living in a walk-in barbecue, in which case I think you have more immediate problems to worry about. Remember, a component that's hot to the touch can still be cool enough to function with no issues. You just don't want them to be literally frozen. Just let it go. On top of that, computer cooling products are designed better for continuous active heat exchange than a home refrigerator is. Heat pipes, water pumps and fans operate the entire time your computer is powered on to draw heat away from your components and ultimately dispel it into open space without breaking down your cooler. Contrast that with a fridge that instead relies on insulation to keep heat from getting in, as well as a compressor that's not designed to be running all the time. Otherwise you'd have to go catch it. (snorts) Now, all this isn't to say there aren't exotic cooling solutions that are refrigerator-like that can cool electronics properly. Some enthusiasts have invested in expensive phase change cooling systems that operate using similar principles to a fridge, and air conditioners that help cool data centers also use evaporating liquid to keep all those servers from overheating. But as far as trying to stick your PC inside your mini fridge, you're much better off just using it to stop your balogna sandwiches from spoiling. And if they do, make a better sandwich. Balogna, John? (Riley scoffs) Well, that's it for this one, guys. Thanks for watching. Like the video, dislike the video, according to your wants and desires. Check out our other videos and comment below with video suggestions. And also, don't forget to subscribe and follow, 'cause we'd do the same to you. (Riley snickers)",
    "transcript_keywords": [
        "towerstyle heat sinks",
        "beefy towerstyle heat",
        "fridge",
        "Heat",
        "custom water loops",
        "RGB fans",
        "components",
        "constant nemesis",
        "beefy towerstyle",
        "massive industry",
        "industry has sprung",
        "keeping your precious",
        "RGB",
        "cool",
        "cold",
        "heat sinks",
        "refrigerator",
        "towerstyle heat",
        "computer",
        "inside"
    ],
    "transcript_entity_values": [
        "PrimoChill",
        "GPU",
        "Doom Eternal",
        "Frito",
        "RGB",
        "turkey",
        "first",
        "TWIN FROZR",
        "CPU",
        "Balogna",
        "RAM",
        "John",
        "8",
        "60 Celsius",
        "Riley",
        "Thanksgiving",
        "Riley"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "GPE",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "DATE",
        "ORG"
    ]
}