{
    "id": "X5tIvJKFIzY",
    "title": "Moto G4 Durability Test - BEND TEST - Scratch test BURN TEST",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-01-30T14:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=X5tIvJKFIzY",
    "category": "Howto & Style",
    "tags": [
        "Motorola G4",
        "Smartphone",
        "Durability test",
        "tech",
        "Android",
        "iPhone",
        "Moto G4",
        "Lenovo Moto G4",
        "budget android phone",
        "Durable smartphone",
        "How durable is the Moto G4",
        "G4"
    ],
    "views": 865098,
    "likes": 15072,
    "comments_count": 2381,
    "description": "Current Moto G4 Pricing HERE:  Its time to add another durability test to the YouTubes. This time its the Motorola G4. This phone was released mid 2016, but it has been heavily requested in the comments of my other videos. And as you know, I do test the phones that get mentioned most often.   Moto G4 Teardown:   This phone will get the same unbiased treatment as the rest of the smartphones on my channel. Scratching, burning, bending, and general build quality verification to make sure it is a solid device worth owning for two or more years.   Cell Phone Replacement Parts:  Awesome Smart Phone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/2k7wwjj",
        "https://youtu.be/W1Pxjjv_D30",
        "https://goo.gl/8e9zgI",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2iZ67Ty",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "A surprising amount of people have requested that I durability test the 4th Generation Moto G, or also known as the Moto G4. Pretty inexpensive compared to most of the phones I test, even though it is rocking an octa core processor. Is it durable though? Thats what were here to find out. [Intro] As always lets start with the scratch test. The Mohs picks help us see how scratch resistant the glass is. Motorola is advertising that there is gorilla glass 3 on this phone, so its not surprising at all when it scratches at a level 6. This is perfectly normal and sits perfectly on par with the rest of the tempered glass screened flagships. Its not invincible against scratches like sapphire or ceramic would be, but it is very scratch resistant. The earpiece slot is abnormally large for a cell phone. Perfect size for collecting dust, make up, or even allowing small rocks to get in. And unfortunately there is no metal grill inside the glass keeping the earpiece protected. The black part you see is more like a rubberish vinyl covering. So if you ever need to clean out this little slot be gentle with it or the earpiece covering might get punctured. The 5 megapixel camera is under that same front layer of gorilla glass 3, so you dont have to worry about it getting scratched up either. The back of the phone is removable but for some reason it still does not give us access to the battery. This is extremely weird. A removable back with a non-removable battery. Well have to see whats up with that during my teardown and repair videoif the Moto G4 survives the rest of my durability tests. The back of the phone is made out of rubber. Since it is easily replaceable its not that big of a deal if it gets scratched up, but as you can see, my razor blade still does a pretty good job of disfiguring the grippy material. Scratching on rubber doesnt have that same satisfying metal on metal sound we all enjoy, but I still managed to draw a happy little tree. I imagine most of you arent going to take a razor blade to your phone, so I did test an everyday objects like keys and coins but neither of them left a mark. Rubber is pretty durable and resilient even if its not one of those premium feeling build materials like glass and real metal. Now that Art Classes with Jerry are finished we can move on to the sides of the phone. These are plastic all the way through which is totally fine for a device this price. The inner plastic is a slightly different shade of gray though. Any dings or dents would visibly show up with time, so watch out for that. The side buttons are also made of plastic, the volume and power button. This phone does have a headphone jack so for you practical people who enjoy listening to music on the go; this full featured phone would be a fantastic choice. There is one 13 megapixel camera on the back. It maxes out at 1080p resolution while recording video, but at least it is covered in glass so that camera is protected from scratches as well. The dual colored flash is also plastic, but thats totally fine since light will get dispersed either wayscratches or no scratches. The Motorola logo is built into the back rubber panel so theres no worries about that popping out like on some of the older Nexus phones. And now its time for the burn test. The Moto G4 has an IPS LCD under that gorilla glass layer; similar to the iPhone. It lasts about 9 seconds under my flame. With IPS LCDs the pixels will go black and turn completely off. But when the heat is removed the screen recovered completely. The flame from my lighter still burns away the outer invisible oleophobic glass coating though, so I would recommend against lighting your own phone on fire. Speaking of things you also shouldnt try yourself; its time for the bend test. Stress testing a phone during a bend test is a good way to find out how structurally sound the build quality is. This phone holds up just fine when I apply pressure to the screen side of the device. But when I flip it over there is some major flex to the phone. Luckily it still does not catastrophically snap in half. It still functions perfectly fine even though it is currently identifying as a banana. This phone passes the bend test. And Ill give it a thumbs up as far as durability goes. Its nice to know that a phone doesnt have to be expensive to be solidly built. Since this Motorola G4 passed the test you can safely assume that the G4 Plus would also pass since they have the same basic build quality and structural integrity. I was able to bend the phone back straight again so there probably is some metal somewhere inside of the phone. Well find out during the teardown. Ill link current pricing for this phone down in the video description right below this video, and Ill also link the teardown there as well as soon as I get that finished. Hit me up on Twitter or Instagram for behind the scenes and giveaways. And let me know in the comments what phone you want to see me test nextbudget or premium. Thanks for watching. Ill see you around.",
    "transcript_keywords": [
        "phone",
        "Generation Moto",
        "test",
        "glass",
        "Generation",
        "back",
        "Moto",
        "gorilla glass",
        "bend test",
        "metal",
        "Ill",
        "scratches",
        "surprising amount",
        "rubber",
        "plastic",
        "fine",
        "bend",
        "Motorola",
        "phones",
        "scratch"
    ],
    "transcript_entity_values": [
        "Motorola",
        "iPhone",
        "Nexus",
        "about 9 seconds",
        "one 13 megapixel",
        "Instagram",
        "Generation Moto G",
        "4th",
        "The Moto G4",
        "jack",
        "Jerry",
        "Mohs",
        "6",
        "Art Classes",
        "half",
        "nextbudget",
        "5 megapixel",
        "Ill",
        "Moto",
        "3",
        "the G4 Plus",
        "G4",
        "Twitter",
        "1080p"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL"
    ]
}