{
    "id": "X7CpGEujhLg",
    "title": "Not all Gaming Phones Survive... Red Magic 6 Durability Test!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-06-21T13:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=X7CpGEujhLg",
    "category": "Howto & Style",
    "tags": [
        "red magic 6 durability test",
        "gaming phone",
        "best gaming phone",
        "red magic",
        "nubia",
        "iphone",
        "android",
        "scratch test",
        "bend test",
        "burn test",
        "water test red magic",
        "liquid test",
        "drop test",
        "mobile game",
        "gaming",
        "video games",
        "gamer"
    ],
    "views": 841375,
    "likes": 44312,
    "comments_count": 2638,
    "description": "Gaming phones just arent built like they used to be... Get Surfshark VPN at  - Enter promo code JerryRig for 83% off and 3 extra months for free! Gaming phones have had a hard year. Out of the three weve tested TWO of them have snapped in half! Gaming phones are supposed to be the best of the best... its time to see if this new Red Magic 6 can withstand a JerryRigEverything Durability test.   Get my razor knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://surfshark.deals/JerryRig",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So this has not been a good year for gaming phones. We've had the Legion Duel 2 break, some catastrophic damage to the ROG Phone 5. We've had more phones break apart this year than any other year and it's only June. Today we have a new gaming phone, a new contender called the Red Magic 6. It's one of those phones with an internal cooling fan. So hopefully this one survives a little better than the last couple. Today's video is sponsored by Surfshark. Surfshark is a VPN that's easy to install and you use on unlimited devices simultaneously. You might be asking what is a VPN? A virtual private network allows you to encrypt your internet traffic while you're using public wi-fi, or access streaming services from outside the country so you can keep watching your shows while you're traveling...now that that's a thing again. A VPN just keeps your information safer. The best part though, if I can get nerdy for a second, is that Surfshark keeps no data logs with a 100% ram only server network. So your IP and location information and browsing are always protected. Just click the link down in the description and use the code JerryRig to get an 83% discount. And of course, if you don't like it there's always a 30 day money back guarantee. It works on iPhones, Androids, PCs, and Macs, all kinds of platforms including Play Stations, if that's where the kids are doing their internet these days. And you can get all of that for basically $2 a month. I'll leave a link down in the description. Now it's time to see if this new gaming phone performs better than the previous phones. Let's get started. [Intro] This Red Magic 6 costs about $600, which is pretty fairly priced compared to some of the other gaming phones, and it has some pretty impressive specs as well. It is 5G this time around, which is something to consider now that there are more 5G towers in place. Inside the box we get a subtly shiny black smartphone, as well as a 30 watt quick charge charging brick and a red USB-C cable, along with some paperwork and a SIM card removal tool. Red Magic has kept this aesthetic for quite a while now with the cameras lined up vertically in the center of the phone. And they were the only ones for a while to have a built-in internal cooling fan to help keep the guts from overheating during long gaming sessions. There are no metal protrusions or flashy accents. This Red Magic 6 could sneak by as a regular smartphone unless someone was actively looking for it. To get the fan to turn on we flip a switch on the side of the phone, and it's pretty quiet. It's a singular fan. If you remember, the Legion Duel 2 had two fans inside..and it also snapped in half, so it's probably not the design we should be emulating. We'll test this more in a second. It wouldn't be a gaming phone without some RGBs. They are also quite a bit more subtle this time around, just some smaller light bars along the edges, and of course, the logo down at the bottom. Let's just into the durability test. Red Magic is nice enough to include a pretty nice looking screen protector. Once that's gone we can start scratching what Nubia's calling the world's smoothest smartphone, not due to the physical smoothness of the glass, but the digital smoothness of the display. This screen refreshes at 165 hertz, and has a peak touch sensitivity rate of 500 hertz...which for a gaming phone is pretty important and impressive. Pretty sure this is now the world leader in touch sensitivity. The screen can pretty much sense your finger before you sense your finger. Still scratches at level 6, with deeper grooves at a level 7 though. There's no sapphire here. Up in the top bezel we have an 8 megapixel selfie camera, along with the plastic earpiece which won't be falling out on it's own. The bottom bezel is symmetrical, nothing super special down here. The special bits begin on the side. The Red Magic 6 has scratchable capacitive triggers along this right side of the phone. They don't magnetically pop up like we saw on the Black Shark 4, but they are very responsive with a touch sensitivity near 400 hertz. The buttons and fan vent are made from metal. The top of the phone has a headphone jack sitting inside a concave channel similar to a blood groove on a medieval sword. Well that was dark. Then over here on the right side of the phone we have more metal, the volume rocker, the air intake, and the dedicated gaming button. The bottom of the phone has the stereos speaker, USB-C port, and SIM card tray, which does not have any removable storage. Fans inside of smartphones have always fascinated me. Moving air does a really good job of cooling things down. And as we can see, this blower has some force to it, scattering my little bits of shredded post-it note all over my desk. It's easy to tell where the fan is located on the phone when we stab it. I would make a terrible doctor. It makes noise when we jab it at one end, but not the other, so we can tell which sides it's on. Even after stabbing it 10 or so times, the fan is still alive. Thumbs up for that. Hopefully it will still be in one piece when we do the teardown. The back panel is made from glass, and then of course, we have three cameras sitting up here in a little row in the center of the phone. I'll turn off the fan. Up at the top we have the 64 megapixel main sensor that can film in 8K. And then we have the 8 megapixel ultra wide, and the 2 megapixel macro camera, all protected under the same piece of glass. Then, under the back piece of glass, we have a single LED triangular flash. The shape helps the prismatic fluorescence triangulate the luminescence. Just kidding it's all aesthetic, but I bet you thought it was super cool for a second there. Besides the internal fan, the screen is probably the main selling point of the Red Magic 6, along with that 165 hertz refresh rate. It's also a 6.8 inch 10 bit with a billion colors 1080p, and of course, lasts for about 23 seconds under the heat from my lighter before going white and not recovering. Red Magic also says this guy also has 4D shock inside, which might mean multiple vibrators. We'll have to check during the teardown. And the last test before the durability test, is the under screen fingerprint scanner. We can see that it's optical by the light emitting from the portion of the screen that sits above the scanner sensor. It's illuminating the ridges of my fingerprint. And once it's set and working, we can add some heavy duty level 7 deeper grooves to the surface of the screen, which will be more damage than it would receive in normal everyday life. And impressively it's still working...even with how scuffed up my fingerprints are. Finally, the bend test, which apparently, for gaming phones is a hard test to survive this year. Seeing phones snap in half is almost harder to handle than Breath of the Wild being delayed for another year...again. Starting from the back there is hardly any movement in the frame. And bending from the front we get pretty much the same results. Turns out the Red Magic 6 is a solid piece of hardware that can handle the rigors of being a gaming phone. Nice work. It survives my durability test and brings the 2021 gaming phone survival rate to 50%. Let me know what other smartphones or gaming phones you want to see tested down in the comments. Hit that subscribe button if you haven't already. And come hang out with me on Instagram and Twitter. Thanks a ton for watching, I'll see you around.",
    "transcript_keywords": [
        "Red Magic",
        "gaming phone",
        "Phone",
        "Magic",
        "Red",
        "gaming",
        "phones",
        "fan",
        "ROG Phone",
        "pretty",
        "screen",
        "test",
        "Legion Duel",
        "gaming phone performs",
        "VPN",
        "gaming phone survival",
        "year",
        "phones break",
        "Surfshark",
        "red USBC"
    ],
    "transcript_entity_values": [
        "Androids",
        "Surfshark",
        "6.8 inch",
        "83%",
        "hertz",
        "2",
        "8 megapixel",
        "30 day",
        "8",
        "about 23 seconds",
        "the Red Magic 6",
        "Nubia",
        "Instagram",
        "a billion",
        "100%",
        "two",
        "Red Magic",
        "jack",
        "three",
        "6",
        "VPN",
        "JerryRig",
        "10 or so",
        "the last couple",
        "half",
        "165",
        "Wild",
        "VPN",
        "about $600",
        "only June",
        "30 watt",
        "this year",
        "5",
        "USB-C",
        "64",
        "500",
        "Play Stations",
        "second",
        "the Black Shark 4",
        "a good year",
        "these days",
        "400 hertz",
        "Today",
        "50%",
        "another year",
        "4D",
        "iPhones",
        "2021",
        "Macs",
        "one",
        "7",
        "Twitter",
        "IP",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "MONEY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "TIME",
        "EVENT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "ORG",
        "MONEY",
        "DATE",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "LOC",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}