{
    "id": "X7vVP7F3-wM",
    "title": "Interview with Google CEO Sundar Pichai at Google I/O 2022",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-05-12T14:54:21Z",
    "video_url": "https://www.youtube.com/watch?v=X7vVP7F3-wM",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 2557588,
    "likes": 54468,
    "comments_count": 2002,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(somber upbeat music) - Hey guys, it's Justine and I'm here at Google I/O, and I had so much fun watching the presentation. And now I'm gonna go head over and chat with Sundar, the CEO of Google. He just left the stage. So let's go have a chat. (somber upbeat music) Thank you so much for sitting down. And I'm just so excited. This is actually my first I/O. - Oh well, welcome. And you timed it well, we are back in person in shoreline. Did you enjoy it? - I did. Did you enjoy it? - Yeah, of course I loved... It took me a while to get used to having audience back and the reactions back, and so I had to go through an adjustment, I think, but I loved being here. - Oh, like in the auditorium too, it was just like feeling that energy. I feel like everyone missed that. - And I hope it continues. I think it's time for people to come back- - [Justine] Sure. - And get on with their lives. - I felt like watching the presentation, it really felt like Google was trying to be additive to technology and not something that's like distracting in your life. So how do you feel that that kind of carries through towards Google's mission? - No, it is. You know, if you go back to Search, Search was always about trying to get you the answer as quickly as possible and not... The focus was that; And so in some ways, I think a lot of what you saw today, is people are living their lives doing what they're trying to do. We want to find those moments where if they need help, be helpful as quickly and efficiently as possible. So yeah, that affects how we think about it. - And it's incredible with your whole career at Google too and you've been there for so long. So what's it been like to really see the entire tech industry just change, like right before your eyes, And even having like a huge part in that? - Wow. I mean, who would've thought the internet would reach where it is today. And I couldn't have quite foreseen it, but early on I realized that finally you have a medium which is going to pretty much touch everyone in the world eventually. And so it's been thrilling to be part of that ride and being at Google gives you a chance to do that at scale and impact a lot of people. So, but I think look, the great thing about technology is, for people who are young and coming into it, the next decade, the next two decades, are going to have as much evolution and as many new things as what I've seen in my last two decades. So I think that's the great thing about technology. - Is there any key moment that you're like, that was the most meaningful thing that you felt that had like this huge impact? - Towards the end when it all comes together, when we are investing in AI, and trying to help people as we are testing the prototype and giving it to people who could be either deaf or hard at hearing or didn't understand the language, that's where you see how it can all come together and touch people's lives. And so, I think that's the potential of technology, the kind of thing which makes me get up in the morning and come into work. So, that's what I would say. - Yeah, and I feel like now even just with the internet and being able to touch that many lives, is so incredible. And I think accessibility is so important. I mean, how do you guys kind of go through that whole process of deciding what is something that you need to include for accessibility and kind of just carry that through? - Yeah, we've deeply cared about it in our mission; And so, if anything, we are constantly across every products, been getting to everyone in the world, trying to make it as affordable as possible, and making sure we are thinking through deeply for people with disabilities and working to make sure the products work for them. All of... There's a lot of work still left to do. One thing I would say is, AI offers new opportunities to do it in a way we couldn't have solved it before. And so that's what, why, when you look at things like translation or transcription or all that, I think offers us to support these groups better than ever before. - You guys have talked so much about AI, and it's weird and kind of also interesting when I talk to my non-tech friends, their kind of perception of AI, like you think of what you see in these big high budget movies, like robots running around everywhere. And like, that's not the actual reality of it. So do you wanna talk a little bit about like what AI actually is, and how you guys kind of implement it in all of your devices? - So coming at many ways, the kind of AI we are talking about is, as humans, like you and I are using language fluently, we are looking at each other, we have context, all this is very, very hard for computers to do. So, we are trying to make progress and make computers be a bit smarter and using AI to make those things better. But it offers promise in a different way because the same AI can be an expert on many topics. So it could be like you're talking to thousand different experts on any topic, right? That's the potential. So you can imagine a kid in the future being able to learn on any topic regardless of where they're growing up, what access they have. So that's the potential we see. But when we speak about AI, a lot of it is about how do we use that to bring more knowledge to more people. And so that's how we think about it. - I love that too, because learning, I learned almost everything that I know now from Google and watching YouTube videos. And I feel like a lot of kids learn in different ways and a lot of times classrooms aren't equipped for that. So the fact that you guys are building that out and also making it accessible is just... I think it really is life changing. - Yeah, I mean, I wish I had YouTube when I was growing up. I've learned on so many topics, by particularly, even through the pandemic, just YouTube was a place I would go, learn from creators like you; And so, hopefully this is all part of that journey in making it easier for people. By the way, AI also, one feature we launched today was to automatically create chapters in YouTube videos, you know? Uh-huh, yeah. - The crowd goes wild. I'm gonna put in a sound effect here. (crowd cheers) (both laugh) That's amazing too, because you're trying to find that information quickly And the fact that those chapters are automatic- - [Sundar] Yeah. - [Justine] I cannot wait to try it. - [Sundar] Yeah. - And we're still talking about AI, and because Google is such a huge company, you guys can literally do anything. So, I feel like you guys have a responsibility to kind of set those principles. And I know you talked a little bit about that. Do you wanna expand a little more on that? - You know, I mean, obviously it's a profound technology and both will have useful things can be misused, can have harmful effects, so, from a ground up, we have to think about it, right? And so we have publicly stated AI principles and it has seven core areas. You see some of that work today when we talked about monk scale or what we did in our cameras last year, across a range of skin tones, being able to capture that well on camera, is an example of the kind of responsible AI work we are doing. So we are thinking it through across everything we do. - I love the demonstration that you guys did with Lambda too. And that kind of conversational technology is really just, it's so impressive. The fact that you can make those lists, like which one was your favorite? - Oh yeah, I've played around with it so much. What's stunning for me, is how it breaks down every topic. And then it makes you think about things which you wouldn't have thought of. And, I think I've vaguely tried planning a party and seeing all the stuff. And even for something you think you know, it surprises you. There's a creativity to all this. And you can imagine you're anywhere, like a planet made of ice cream, and you can think through that. So, you can imagine being an author and you're writing something, and you can play with it to get inspiration. And so, that is the power of what, if we can get all this to work well, that's the power ahead. - Another thing is, I love your kind of initial story of kind of working with Chrome. And that was really impactful for me, because I feel like a lot of my career has been people telling me I shouldn't do this or I shouldn't do that. And when you have sort of that conviction that something is something and it can be something, like that's really was touching for me. So like, do you have any advice for any young entrepreneurs or creators or developers who are kind of getting started and how to kind of combat hurdles? - No, it's good, look, I mean, I think it's important to remember, you're going to have setbacks. It doesn't go exactly the way you... Some sometimes it does but that's rare. For most people, it kind of meanders and it takes longer than you think it is. I think working with people who you think are very good I think that's important, working something which kind of clicks inside, you feel it; If you work on something you like, you will feel it inside. And I think that's important to try and find it if you can. And so, if you do that, and you're doing your best, that's what's in your control. And as I said earlier to young entrepreneurs, there's no better time to be an entrepreneur. Like I would ignore what's happening in the short term, like there is so much opportunity ahead over the next 10 years or 20 years, I think to creators there, there's no better time to be a creator; And so, that's how I would think about it. - Yeah, I guess one last question. I guess the future of tech it's all moving so quickly. So what is your kind of big picture vision for the next five to 10 years? - From our standpoint, we are working on, given our goal, is to help give access to knowledge. We think computing is gonna evolve dramatically over the next 10 years. We will evolve beyond phones, and you saw some hints at the end of what we think that world will be. And so, building that out and putting it in people's hands, and that's something we are super excited by. - That's so awesome. Well, thank you so much for chatting, and thank you to my audience for watching. I know they're gonna be so excited. - Subscribe and click on the bell. - Yes. - Like and comment on the video. - This is the best day ever. (Justine laughs) Can we get a selfie? - [Sundar] Of course. - Oh my gosh. This is incredible. All right, here we go. - [Sundar] All right. (upbeat music) - Awesome, got new options- - All right thank you. - Thank you so much it was so nice to meet you. - I'm Trying to keep up pace with your selfie skills. (Justine laughs) (upbeat music) - So this was both of our first Google I/O, - Yes. - Which was so much fun. And you are a veteran? - Yes. It's 17, 18, 19. Three years, yeah. - Oh, wow. And he did not tell us that it was cold. - It was very cold. I'm sorry, guys. - It was freezing. - I had a lot of fun. - Yeah. - [Michael] I can't wait to see your interview. - I can't wait to see yours. - Yeah, I can't wait to see your interview. Yeah. 'cause we couldn't hear anyone. - Yeah. - Yeah. - So you guys make sure you go check out both of their videos, I'll put links in description. And I think that's a wrap on Google I/O. - Yeah. - Yeah. - I gotta go to the airport now. - Me too. - So do you. You're leaving tomorrow. - Yeah, I'm good. (all laugh) - Bye. (upbeat music)",
    "transcript_keywords": [
        "Yeah",
        "kind",
        "Google",
        "people",
        "guys",
        "lot",
        "feel",
        "make",
        "thing",
        "Justine",
        "work",
        "guys kind",
        "things",
        "technology",
        "back",
        "years",
        "working",
        "Hey guys",
        "lives",
        "watching"
    ],
    "transcript_entity_values": [
        "the next five to 10 years",
        "the next 10 years or",
        "one",
        "Three years",
        "thousand",
        "17",
        "Justine",
        "YouTube",
        "the next decade",
        "20 years",
        "the next 10 years",
        "Michael",
        "Sundar",
        "YouTube",
        "last year",
        "Chrome",
        "the next two decades",
        "Google",
        "18",
        "today",
        "seven",
        "YouTube",
        "AI",
        "my last two decades",
        "first",
        "tomorrow",
        "19",
        "One"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "DATE",
        "CARDINAL"
    ]
}