{
    "id": "X9-EiR9g1cw",
    "title": "iPhone Names Make No Sense",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-11-27T18:46:46Z",
    "video_url": "https://www.youtube.com/watch?v=X9-EiR9g1cw",
    "category": "Science & Technology",
    "tags": [
        "apple",
        "iphone",
        "se",
        "max",
        "pro",
        "naming"
    ],
    "views": 150272,
    "likes": 12355,
    "comments_count": 960,
    "description": "Get both the Drop x Sennheiser PC37X Headset and ENTR Keyboard bundle for $50 off at   Why is Apple's naming scheme for the iPhone lineup so inconsistent?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://dro.ps/lmg-bundle",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- It's always nice when naming schemes are straightforward and the powers that be just slap a number onto the end of every new version of something. I mean, it worked fine for the \"Lethal Weapon\" movies, right? But one very popular product line up has been a little less than consistent. I'm talking of course, about the iPhone, which hasn't had a very simple naming progression at all. So let's look at a bit of history and at a why Apple might have made the decision that it did. The original I-phones name was a continuation of what Apple started when it released its iMac computer nine years prior, with the I insinuating internet, internet conductivity. Wow, so it was it was a natural fit for a phone that Apple touted as being able to access internet seamlessly. This is just so cute in retrospect. Of course the next iPhone wasn't simply called the iPhone two, there wasn't an iPhone two. In 2008, 3G connectivity was relatively new so Apple saw an opportunity to highlight the new model support for it by calling it the iPhone 3G, which offered much faster data speeds than the original. Apple's next device was the third iPhone but it wouldn't have sounded kind of weird to follow the iPhone 3G up with iPhone three or iPhone 3G-2, Final Fantasy style. So instead we got the iPhone 3G-S. which although I've been holding this for a while, this is actually the 3G-S. With the S standing for speed. It's network conductivity wasn't any faster but it had a more powerful C-P-U., a feature that was starting to become more important since consumers were doing more with their phones. The succeeding iPhone four was named in a much more straightforward manner, after all it was the fourth version of the iPhone. But after the success of the 3G-S., the paradigm was set to use the letter S to indicate a souped up revision of a base model phone. So in 2011 we got the iPhone four S. But this time the S officially stood for Siri as this was the first model to feature Apple's virtual assistant. Apple stuck with this tick-tock cycle for the iPhone five and five S. But this is where things took a bit of turn, the iPhone 5S launched alongside the iPhone 5C, which was a lower end device sold at a lower price point, an interesting move for Apple as by this point the iPhone had positioned itself as a higher-end smartphone. The 5C replaced the baseball iPhone five though Apple had to differentiate it from the older version without confusing it with the more souped up S model so they stuck at C and the name. The speculation being that the C stood for color. But the phone flopped due to consumers not particularly liking the less premium \"unapologetically plastic\" field, leading people to joke that the C meant cheap. So Apple was done using the C suffix for the time being and the next generation brought us to the iPhone six and six plus. Apple was trying to make it clear that plus meant something different than S, as the plus model was mostly the same as the base iPhone six, just with a larger screen. This left the door wide open for Apple to give us an S revision of the iPhone six lineup and this is where the naming scheme started to get a little unwieldy, as iPhone six S plus was a bit of a mouthful. This is also around the time when we got the first iPhone S-E. which I don't have with me today, which was a much smaller and quite different internally device than the other contemporaneous models. So Apple dubbed it S-E., special edition. The next year we got to the iPhone seven and this is a seven plus. But instead of then releasing a seven S, Apple backed that trend and skipped right to the iPhones, eight, eight plus and 10, here's a 10. This is where divining Apple's intent gets a little more difficult. There's been speculation that they wanted to compete with Samsung's S eight and did not want to have a lower number associated with their own device. Other speculation was that they wanted to highlight the fact that the iPhone eight had wireless charging and that was a bigger deal than would be implied through calling it the seven S. Then of course, you have the fact that Apple released the 10 the same year as the eight, skipping the iPhone nine altogether. It's been suggested that this was for iPhone's 10th anniversary as well as to imply a reinvented iPhone with a ton of new features like Face ID. They may have also taken a page out of Microsoft's book as Microsoft too skipped straight from windows eight to windows 10 and they haven't looked back. Apple then went back to using the S suffix with the upgraded iPhone 10 S, but also tried their hand, Once again, at a lower cost variant with the iPhone 10 R, putting a letter that's pronounced as a number next to a letter that's actually a letter, cool. However, unlike the C from the iPhone five C, Apple said themselves that the R took inspiration from the world of high-end cars, and doesn't actually stand for anything. But that may have paid off well for them as the 10 R actually sold pretty good. I guess Apple learned not to make their phones out of plastic. This was also around the time where Apple confusingly switched from using \"Plus\" to using \"Max\". Here's a 10 S Max to indicate a larger sized variant, which the company seems to have settled into for the iPhones 11 and 12. Oh, and they dropped the S in favor of Pro like the iPhone 12 Pro Max (mumbles) and added a mini designation to indicate a smaller size model and threw in an updated iPhone S-E. that's just called iPhone S-E. (exhales) And that's it, I want to go home now, someone else can do the sponsor. Drop is running an exclusive promotion for all tech quickie viewers. Just use the code LinusDropsThis (laughs) and save $50 when you add the Sennheiser PC37X gaming headset and ENTR keyboard into your cart. The PC 37 X offers an open back design and dynamic drivers for clear audio for gaming and music. And the ENTR keyboard is made of enthusiast grade materials with your choice of mechanical switches. This promotion will run from November 30th to December 2nd, 2020, and after that, the sale will be available to everyone. So click the link in the description and use code LinusDropsThis for 50 bucks off the bundle today to make sure you get to get it. So thanks for watching guys if you liked this video, give it a like, give us a subscribe and hit us up in the comments section with your suggestions, for videos that we should do in the future.",
    "transcript_keywords": [
        "iPhone",
        "Apple",
        "Lethal Weapon",
        "Iphones",
        "model",
        "feature Apple",
        "Max",
        "Apple started",
        "Apple stuck",
        "Apple released",
        "time",
        "device",
        "letter",
        "lower",
        "naming",
        "original Iphones",
        "Apple touted",
        "phone",
        "Apple virtual",
        "Apple dubbed"
    ],
    "transcript_entity_values": [
        "3",
        "seven",
        "Final Fantasy",
        "5C",
        "C,",
        "5S",
        "10th",
        "three",
        "iPhone S-E.",
        "a ton",
        "one",
        "Drop",
        "the iPhone 5C",
        "iPhone",
        "the \"Lethal Weapon",
        "iMac",
        "the 10 the same year",
        "Max",
        "Siri",
        "iPhones 11",
        "iPhone 10 S",
        "Sennheiser",
        "The next year",
        "Samsung",
        "Microsoft",
        "third",
        "10",
        "first",
        "iPhone four",
        "two",
        "iPhones",
        "nine years prior",
        "four",
        "C-P-U.",
        "windows eight",
        "12",
        "2011",
        "six",
        "2008",
        "five",
        "50",
        "50 bucks",
        "eight",
        "Apple",
        "today",
        "fourth",
        "November 30th to December 2nd, 2020"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "NORP",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE"
    ]
}