{
    "id": "xaT2hqHgLdY",
    "title": "How to make a DIY Thermoelectric Generator",
    "channel": "DIY Perks",
    "channel_id": "UCUQo7nzH1sXVpzL92VesANw",
    "subscriber_count": 4640000,
    "upload_date": "2016-05-16T14:30:01Z",
    "video_url": "https://www.youtube.com/watch?v=xaT2hqHgLdY",
    "category": "Howto & Style",
    "tags": [
        "thermoelectric",
        "generator",
        "renewable",
        "energy",
        "electricity",
        "power",
        "diy",
        "solar",
        "wind",
        "water",
        "watts",
        "charge",
        "phone",
        "fire",
        "peltier",
        "cooler",
        "air conditioner",
        "candle charger",
        "flame",
        "generate",
        "amps",
        "turbine"
    ],
    "views": 1083161,
    "likes": 26981,
    "comments_count": 1192,
    "description": "In this video we'll be building a thermoelectric generator that can provide enough power to charge your smartphone using just candle flames!  Parts Links:  Disclosure: These are affiliate links. If you click them and make a purchase from the various merchants they link to, DIY Perks may earn a commission. Affiliate programs and affiliations include, but are not limited to the eBay Partner Network and Amazon Associates.   Thermoelectric plates*:  US:  UK:  DE:   Voltage regulator:  US:  UK:  DE:   Thermally conductive glue:  US:   *It's important to not let these budget plates get too hot, or else they can be damaged. Just make sure you refresh the water regularly and you should be okay.  This video and its giveaway is sponsored by Native Union. To be in with a chance of winning the four Native Union cables ( sign up to their giveaway here:   OFFICIAL LINKS:  Support me on Patreon:   Official Website:   Discord:   Forums:   Twitter:",
    "description_links": [
        "http://ebay.to/2DorMPv",
        "http://ebay.to/2BuuCoZ",
        "http://ebay.to/2DoNW4l",
        "http://ebay.to/2p8h1xJ",
        "http://ebay.to/2BecxqX",
        "http://ebay.to/2CT6SXI",
        "http://ebay.to/2Dp97mU",
        "http://bit.ly/DIY_NU),",
        "http://bit.ly/DIY_Native",
        "https://www.patreon.com/DIYPerks/",
        "https://www.diyperks.com/",
        "https://diyperks.com/discord-server/",
        "https://diyperks.com/community/",
        "https://twitter.com/DIYPerks"
    ],
    "transcript": "In this video we'll be making a thermoelectric generator that can reliably charge your phone using nothing but the heat emitted from candle flames. The way this works is by using the temperature difference created between the candles underneath, and the cool water in the tray, to generate electricity. At first this might seem a bit of a novelty at first, but it could be genuinely useful in some very real situations. For example, if you are out camping and your phone runs out of juice, you could use the thermal generator to charge it back up over a camp fire. A little closer to home it could come in handy if there's ever a power outage, and you could make some hot chocolate whilst you're at it. However you choose to use it, this is a very fun project and it doesn't take much time to build, so let's get to it. By the way, if you like the quality look of the charging cables used throughout this video, stick around for your chance to win them, courtesy of the manufacturer Native Union. So, the first items we'll need for this project are 10 thermoelectric plates. These are usually used in devices like portable drinks coolers, and they work by essentially moving heat from one side of the plate to the other when electricity is applied. This means that when the hot side is kept cool with a heatsink, the temperature of the cold side, from which the heat is being removed, can drop low enough to freeze water. Most interestingly, these plates can also be used to generate electricity by heating up one side and cooling down the other. This is called the Seebeck effect, and is what we're going to be taking advantage of in this project. They're surprisingly cheap as well, so I've placed international purchasing links in the description. Next thing we'll need is a metal tray to hold the water - in my case I used a bread tin. When you choose yours, you'll need to make sure that the base is large enough to accommodate all ten plates, which need to be stuck to the bottom of the tray with the printed text facing upwards. We need to use thermally conductive glue for this, and we need to use enough of it so that the glue spreads to the edges when the plates are squashed down. Again, you can find links to this glue in the description. Now, you'll notice that the red and black wires form pairs - these need to be soldered together, though if you don't have a soldering iron you could probably get away with twisting them together if you leave yourself some extra length before trimming the wires down. When you reach one end, you can simply continue the circuit by bridging it over to the other plate like so. The wires at the opposite end can just be left loose, as they will be later connected to a voltage regulator. To stop our joints from touching the tin and shorting out, we can stick a strip of electrical tape to protect it from short circuits. Now, as we've connected all of our thermoelectric pads in series, the voltage could potentially be as high as 15v, which is too high for phones which only need 5v. So what we'll need is the aforementioned voltage regulator, which takes this higher voltage and stabilises it at 5v - it even has a standard USB socket so that we plug devices straight in with no messing around. Like the rest of the parts required for this build, you can find purchasing links to it in the description. To keep it out of the way, we'll be mounting it over the tray using a strip of aluminium. I trimmed mine down from a larger piece by first scoring it with a knife, and then bending it repeatedly until it split. I then used some pliers to bend over the edges so that it hooks tightly over the rim like so. Now we can insert the wires into the voltage regulator's input, and clamp them in place. Because of the way we've stuck on the pads, the polarity of them is inverted, so in this case red is negative, and black is positive. It is always worth confirming this with a multimeter before use however. When we glue it to the aluminium, we can stick a piece of cork in between to act as an insulator. The regulator can then be glued down on top. Our generator is now almost complete, but before we try it out we need to make a little lip to help catch more heat. To do this, we can get another piece of aluminium that's large enough to cover the plates with some room to spare. We can then score some lines about a centimetre in from the outer edges, and bend them slightly downwards to make a lip. Looks pretty snazzy - especially with the rounded edges, which were made simply with a file. This can then be glued to the plates using some more thermally conductive glue. After you've done this I recommend that you clamp it all together so that it makes a tight thermal bond, leaving it for about 12 hours whilst the glue dries. After it's set the generator should be looking something like this, and the only thing left to do is make the stand. To make it we can again use some aluminium, and bend it into shape. You can customise its dimensions to fit the tray that you use, but height wise you need to get the tray fairly close to the candle flames without them actually making contact, as that would cause things to get sooty. Although it's quite a simple stand, it's surprisingly quite rigid. Now it's ready to try out! So we can get as many candles as will fit inside our base, carefully light them all, and then place the generator on top. Now we can pour some cold water into the tray and wait for the generator to kick in. In a few seconds, the little LED on the regulator should start to glow. As the power increases, the voltage display should light up too, and it should continue to rise as the temperature difference increases. Once over 10v, we can plug in the device we want to charge, and press the regulator's power button to activate it. The device should now start charging! It's not quite as quick as a fast charger, as it only delivers about one and a half watts, but that's not too bad at all considering that it's being generated by the heat from the candles. To keep the temperature difference high, the water does need to be refreshed when it gets warm, which needs to be done every 10 minutes or so. If you were to use something like snow or ice instead, it would not only last longer, but would initially generate significantly more power, so that's something to keep in mind for the winter months. So, that's it for this project, but what about that cable giveaway I mentioned earlier? Well, there are four cables you can win, all made by Native Union, who specialise in quality above all else. They're really nicely made, so are probably the only cables you'll ever own that are actually good to look at by themselves. They have some nifty functionality too. The casing of the Jump cable, for example, actually works as a charging buffer, so can give you an extra 20% boost in battery power when you don't have access to electricity. Alternatively, the Key cable doubles up as a key chain, so you'll always have it with you when you're out and about. So, to be in with a chance of winning all four of these cables, simply sign up to Native Union's newsletter with the link in the description. Good luck! So, I hope you've enjoyed this video. If you did, don't forget to hit that like button, and maybe consider subscribing if you haven't already. I'm Matt, and I'll see you next time.",
    "transcript_keywords": [
        "tray",
        "plates",
        "Native Union",
        "voltage regulator",
        "make",
        "voltage",
        "regulator",
        "glue",
        "generator",
        "heat",
        "water",
        "heat emitted",
        "reliably charge",
        "power",
        "cables",
        "electricity",
        "project",
        "side",
        "description",
        "wires"
    ],
    "transcript_entity_values": [
        "first",
        "ten",
        "USB",
        "all four",
        "centimetre",
        "four",
        "every 10 minutes",
        "10",
        "about 12 hours",
        "a few seconds",
        "Native Union's",
        "about one and a half",
        "10v",
        "5v",
        "one",
        "Matt",
        "the winter months",
        "as high as 15v",
        "20%",
        "Seebeck",
        "Native Union",
        "Jump"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "TIME",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG"
    ]
}