{
    "id": "XBjEU1bJd5U",
    "title": "What Magic Is This?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2017-01-07T22:31:45Z",
    "video_url": "https://www.youtube.com/watch?v=XBjEU1bJd5U",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "square off",
        "square off chess",
        "chess",
        "chess set",
        "square",
        "off",
        "cool gadget",
        "new gadget",
        "invention",
        "new inventions",
        "inventions",
        "futuristic",
        "android",
        "2017",
        "cool",
        "innovation",
        "cool technology",
        "iphone 7 plus",
        "amazing inventions",
        "apple iphone",
        "best android",
        "google",
        "7 plus",
        "awesome",
        "iphone 7",
        "android 2017",
        "smart",
        "future",
        "cool tech",
        "technology (industry)",
        "ios",
        "internet chess"
    ],
    "views": 5445612,
    "likes": 154092,
    "comments_count": 6921,
    "description": "This may be the World's coolest chess set. The Square Off is a connected chess board with a magical twist.  Here is some more info from the manufacturer -  Square Off is all set to redefine the world of board games, starting with chess. Bringing to you the worlds smartest, most connected and the most evolved chess board. It enables you to play your favorite game against a fellow chess enthusiast from anywhere in the world. The automated board is designed to reflect the move of your opponent with precision. Not just that, you can challenge the artificial intelligence of the board too.   Square Off Chess Set -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://squareoffnow.com/",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Today... I might very well blow your mind! And my own? Possibly Jack's. This is a very exiting moment here on unbox therapy because... Whenheard about this thing, this in front of me, you see it'sry... large. I responded immediately to the email. I was like \"Send this thing to me!\" Because what I have in here... is some tech. Is almost MAGICAL. Inside this box is possibly the most advanced chess set EVER IMAGINED! This was launched on KickStarter. I'm not sure what stage or phase it's in right now. I just know I have one of the only copies on the planet. Now I'm not even...! Let alone a master. BUT THIS right here is about to be some magical... Harry Potter type stuff. And where did you see it, where you gonna see it? ON UNBOX THERAPY!! THAT'S WHERE! Now its called Square Off. There's your pieces... The concept here is that the PIECES MOVE ON THEIR OWN!! I didn't even tell them that yet. The pieces slide across the table... On their own. I don't know. I don't know! We're gonna find out! Some power for it as well... That's about it. Oh, and a note. \"Hey Lewis! How are you? Finally we meet. My creators must have spoken to you about me. But let me formally introduce myself. I am Square Off, the world's most evolved chess board EVER! How many classic tangible chess boards allow you to play against an opponent sitting across the globe?...\" Do you hear that Jack? Rather than just have like a video game type interface, the physical pieces are moving and you can touch... You can touch it. You can get... intimate... with your opponent. Playing options: Versus a friend Or versus Machine.. Play against Square Off's artificial intelligence. 20 difficulty levels. Wow I think it gonna be a WOW moment when these things starts to move across the board, so... I'm guessing the first step is to set 'em up. Power port over here, and then a power switch. Oh cool! They give a little stand for your phone I'm gonna power it on. and I hear a little noise it makes... I think... WOAH! Woah! That sounded like... a photocopier or something. Now there is an app to go with it. So I've got the app. Oh! Pairing? Whoo! I'm connected... I can challenge machine or friend. Imma start with the machine. I'm guessing I need to have these things on here, right? I probably should've had them on here before I started the game, right? The King is over here... Ooh I'm getting some beeps right now. Is that the right way? That looks right, right Jack? The Queen goes on the color. I can play chess! It's just been a while. I kind of miss this game. I used to play this as a kid, I recall now Okay, everything is set up. We've got the white on this side, the black pieces over here, I've got the app open over here connected to the board, it should bring it up, and pair hopefully. There we go. And that little beep tells you that you are connected. Now I'm gonna play against the machine Right now you're saying ''Lew it looks like a normal chess board, I don't get it man!'' THIS! This is where the magic's about to happen! So I don't know, let's say I move this one. You wanna register on the spot you're coming from and then the spot you're going to. Now watch this! OOOH!! (wheezing sound) (he laughs) I never claimed to be a chess master, alright people? But I wanna show you guys what happens when a guy get's killed, when a guy get's taken. Liam Neeson style. Oh man. He wants this guy over here. So I put a little pressure on him like this. Here. Oh, you gonna back off! I was gonna do something stupid so you guys could see what happens when a player get's taken. I move here to here, take that guy, put him over here. Now obviously they're gonna take the Queen. LOOK AT HIM GO! AHA! And watch, the pawn will move in there! That's my spot now! I don't know if you guys are as excited as I am about this, but I just think this is a really cool way to learn and interact with chess. I'm playing against AI right now but of course it's not a video game. The pieces are actually moving. It's like I'm having to reconceptualize the way I look at AI because there's a physical movement associated with it. And of course the app is updating those movements as you key them in. There's different engines built into it right now and I'm sure that'll be expanding. And of course many different difficulty levels as well. Oh goodbye! Hahaha Oh it even toppled my queen! How bout that? I'll take that little guy. Yeah, there you go. You heard a couple of beeps for check. If I try to move, say, my king... There... Invalid move, I get two beeps. Goodbye! I dont understand these feel like normal chess pieces. They're got a little bit of felt on the bottom. I don't know there must be some metal under there or something. (he laughs) GOOD NIGHT! What can I say, I mean it's self explanatory, this thing is crazy cool. I don't know, maybe you grew up, you're playing chess with your brother all the time. Now he left, I don't know, he's in the--where did he go? He went away to school or he's in the military or something. He can just pop out his app and still play against you and you can feel like he's right on the other side. It's gotta be a game changing thing in the world of chess, I'm sure. If you guys want to check on your crowd funding progress I'll put a link down in the description. This thing is cool! That' the bottom line!",
    "transcript_keywords": [
        "chess",
        "pieces",
        "MOVE",
        "play",
        "guy",
        "thing",
        "game",
        "app",
        "guys",
        "Jack",
        "Square",
        "board",
        "unbox therapy",
        "chess board",
        "power",
        "cool",
        "Queen",
        "beeps",
        "chess pieces",
        "set"
    ],
    "transcript_entity_values": [
        "AI",
        "20",
        "two",
        "Harry Potter",
        "Square Off",
        "Liam Neeson",
        "PIECES",
        "Lew",
        "it'sry",
        "I am Square Off",
        "first",
        "KickStarter",
        "Imma",
        "Today",
        "Square Off's",
        "Jack",
        "Machine"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT"
    ]
}