{
    "id": "xBMuxH3s-0M",
    "title": "New Engraved AirPods 2 with wireless charging case!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-05-08T14:01:29Z",
    "video_url": "https://www.youtube.com/watch?v=xBMuxH3s-0M",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "airpods",
        "engraved airpods",
        "unboxing"
    ],
    "views": 368994,
    "likes": 8658,
    "comments_count": 844,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- I know, I know, I've already unboxed the AirPods with the wireless charging case but this is very, very special. I ordered this almost, I think over a month ago at this point. I have been traveling pretty much non-stop for the past month so I've basically had these AirPods following me around the country and trying to get them. At first, I ordered them to my parent's house but then I wasn't at my parent's house to sign for the package and then I decided that, okay well I'm gonna be somewhere else, so then I had them re-directed there and then I wasn't gonna be at that location anymore so finally I was like, okay I'm just gonna re-direct them back to Los Angeles and then thankfully my sister was back here and able to sign for them. These guys have traveled all around the country and they have finally made it to me. And just to clarify, this wasn't an Apple issue, this was a Justine issue because I kept traveling and I kept missing the delivery, I had to keep re-directing it so they did a really great job of routing this thing all over the place. So let's open these up. The thing that I'm most excited about these is, much like the engraving on the Apple pencil, you couldn't put a lower case letter, these you could. So I was able to actually get ijustine written on them. And this is gonna be good because my sister and I both have AirPods and we tend to get them confused with each other so now we won't have that issue because my freaking name is on it so back up Jenna, these are mine. Usually we have to just open them next to each other and see whose they are, yes. Oh, it's so cute and small and little, my little name. Oh my God, it's so crazy, it's so little. Have any of you guys ever got your Apple products engraved? If you have, let me know in the comments below. What did you guys get engraved? Did you get your name? Get your iPad or something engraved, I would love to know. That's my little, tiny name, it is so small, it's crazy. I like that it is so small so if you just kinda glance at it, you don't really see it but if you really look, maybe get a magnifying glass, whose AirPods are these? They're mine. So at this point, it's probably been, I guess about a month with my AirPods. I feel like I'm having an intervention here with my AirPods but they've been really awesome and since I have been traveling a lot, I've been using my wireless charging mat a lot. So I always have that set up by my bed in hotel rooms or even when I'm home at my parent's house, my mom has wireless chargers in all of our bedrooms which is really cool. That was one of the things that she added fairly recently, I think in the past year or so. She was looking for little side tables that doubled as a light and a wireless charger so this is actually the one that she ended up getting and I really love it. So Mom, really great job on the light purchases. You can also change the color temperature in this light so you can change it from warm to cool and you can dim it and of course, it has the built in wireless charger so that's really nice whenever I'm home, I can just throw my phone down and now, I can throw my AirPods on to charge. I feel like my previous version of the AirPods that didn't have the wireless charging case, I would always find them dead, so I'd have to charge them really quickly using some sort of portable charger when I'm on the go. But now I feel like when I get home, I just add this as my routine of throwing this on the wireless charger, let those charge and then after I'm done with my phone, before I go to bed, I just swap, put my phone one and then the AirPods are usually pretty charged for the next day. So one of the things that I did notice is a big difference is how quickly these did pair to different devices. The previous version, without the wireless charging case did take a little bit longer to connect. I mean, we're not talking significantly longer but if it's something that you do every day, day in, day out, switching from your iPhone to your Mac then to your iMac or something like that, you got really accustomed to how quickly something happened so with these, it does happen a little bit quicker. So I'm not really sure how much time I've saved myself in total from trying to swap between AirPods and my Mac, but it is faster. So all in all, that's a good thing. I've also been enjoying all the AirPods memes. I just, I don't know, it's really, really funny to me. I think it was a few months ago, there was an AirPods user meet-up or something, a bunch of you guys were tweeting me that you were going. Unfortunately, I wasn't in town so I wasn't able to go 'cause otherwise that would actually be kind a funny. I'm at an AirPods meet-up, what? It's almost the dumbest thing that I've ever heard but it's also absolutely genius. And I'm still upset that I couldn't make it. So really, I just wanted to unbox this because this has had such a long journey to get to me that I almost thought that they were gonna get shipped back to Apple and then I would never see them again and then I would just get my money reimbursed but I really wanted these. I'm very glad that they finally made their way to my house. I'm also glad that I made my way back to my house. Honestly, I've been so exhausted from traveling. It is just something that really takes a toll on your body. I've had a good time visiting family and friends and I went to the YouTube Creator Summit. That was in New York this past week and that was so much fun because I got to see a lot of old YouTuber friends and I met a lot of new YouTuber friends. It's really cool just to see how much this community has grown and how many people are actually creating on this platform. It's also really cool to hear from YouTube, talking about some of different features and of course, there's a lot of drama that's happening on YouTube all the time so it is really great to hear from YouTube directly, speaking to us, answering our questions and sometimes we get some answers. I guess that brings this AirPod video to a close. I mean, I don't really know what else I can do that I haven't done already. I mean, they're AirPods, they have a wireless charging case. You already saw me unbox and talk about these the first time around so of course, I don't really have anything else to say other than I think the engraving is really cool. I like it, I'm excited about it and if I leave these anywhere, I guess at least somebody will know who to return them to. Let me know in the comments below if there's any other videos you'd like to see me make and also be sure to hit Subscribe. If you haven't hit the bell already, do so. Hit the bell and tweet me a screenshot of you guys hitting the bell because that will allow you to get notifications so you guys know when I post new videos. You don't want to miss this quality content because honestly, where else are you gonna get this at? Nowhere, no where.",
    "transcript_keywords": [
        "AirPods",
        "wireless charging case",
        "wireless charging",
        "wireless",
        "wireless charger",
        "Apple",
        "guys",
        "charging case",
        "charging",
        "case",
        "back",
        "house",
        "cool",
        "lot",
        "thing",
        "Los Angeles",
        "parent house",
        "charger",
        "traveling",
        "day"
    ],
    "transcript_entity_values": [
        "AirPods",
        "iPad",
        "one",
        "New York",
        "Apple",
        "Justine",
        "YouTube",
        "Mac",
        "iPhone",
        "a few months ago",
        "the next day",
        "YouTube",
        "Los Angeles",
        "this past week",
        "AirPod",
        "the past month",
        "YouTuber",
        "YouTuber",
        "the past year",
        "iMac",
        "first",
        "a month ago",
        "Jenna"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "PRODUCT",
        "DATE",
        "PERSON",
        "NORP",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON"
    ]
}