{
    "id": "XC_dV9fGJco",
    "title": "MacBook Pro Fails to Boot - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2018-04-05T19:00:53Z",
    "video_url": "https://www.youtube.com/watch?v=XC_dV9fGJco",
    "category": "Science & Technology",
    "tags": [
        "MacBook Pro Fails to Boot",
        "MacBook Pro Fails to Boot - Krazy Ken's Tech Misadventures",
        "Apple",
        "MacBook Pro",
        "macOS High Sierra",
        "macOS",
        "Macintosh",
        "Mac",
        "Notebook",
        "comedy",
        "Tech",
        "Humor",
        "Funny",
        "Computer",
        "Fail",
        "Boot Fail",
        "Computer Crash",
        "AMD",
        "ATI",
        "GPU",
        "Graphics Card",
        "KKTM",
        "Krazy Ken",
        "Krazy Ken's Tech Misadventures",
        "single-user mode",
        "Terminal",
        "Unix",
        "Target Disk Mode",
        "SSD",
        "Solid-State Drive",
        "Recovery Mode"
    ],
    "views": 122806,
    "likes": 2425,
    "comments_count": 525,
    "description": "This MacBook Pro fails to boot. Did it crash? Is it a hardware issue? Software issue? Find out Krazy Ken's theories and see if he can unveil the evil within this notebook!  Watch the iMac Pro unboxing?   Want more videos like this?   Subscribe for new content!   Watch another speed test!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures #50 - MacBook Pro Fails to Boot  Contact the CC    Get film gear Ken uses   On a lower budget?    Want music for your videos?   (We use these guys a lot. They're good.) Amazon links are powered by the Amazon Associates Program.",
    "description_links": [
        "http://bit.ly/clan2FFMtue",
        "http://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://bit.ly/clan2DNi4VW",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://thecomputerclan.com/contact-us.html",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL",
        "http://bit.ly/clan2LBaKov"
    ],
    "transcript": "- [Krazy Ken] All right, time to screw (beep) up. Oh, that was a stupid idea. This is where everything and anything can absolutely go wrong. (beeping) (upbeat electronic music) Hey guys, how we all doing? Really? That's just great. You know who's not doing great? This laptop. You know, a kind man came up to me yesterday and he said that the computer wasn't working. I remember it like it was yesterday. (phone vibrating) - Honey would you get the phone? Gosh you take forever to respond. I'll do it myself. Yeah what? - [Dude On Phone] Hey man what time is it? - What time is it? Yesterday. - [Dude On Phone] Oh why thank you, could you fix my computer? - Yeah sure whatever. - [Dude On Phone] Okay thanks. - Yeah true story. So apparently in some type of boot loop. I'm not sure if that's the technical term but the startup screen shows up, the screen goes white and then it turns off again, like so. And then when it turns off it actually just reboots. (startup sound) So we got a bong. We got an Apple, progress bar. Progress bar goes away before it's even like what a quarter of the way there, and then it will hang here for a bit I'm digging the anti MI6 device. It's just kinda hanging, just kinda chilling. And there we go. This time it doesn't even seem like it rebooted. It actually shut down, the fans turned off too. So, that's kind of where we are right now. Now, let's try a few different things. We got a bunch of troubleshooting things in the handbook. And our last resorts and other options we don't wanna touch with a ten foot pole. Let's start with the basics. Zap the NVRAM. (startup sound) (startup sound) So yeah, I'm just doing the textbook stuff right now because I can read. And then we'll also probably reset the SMC thinga-ma-jigger. Do you have to be plugged into power to do that? I honestly don't remember. So yeah, let's see if that does anything. It probably won't because it only fixes like 1% of problems. And if that's all it takes I would be very surprised. So a little bit more backstory while this thing is not working. Computer was working fine for many years, then I think the hard drive died is what the guy said. So he replaced the hard drive, and then everything was fine and then this started happening like, a couple weeks later I think. So yeah, oodles of fun. Yep, just turns off. Why does it turn off at that point? I'm not sure, maybe it is a hardware issue, but I'm guessing it's a software issue. So I think it's Option Control Shift power button. I think that's how you reset the SMC. I'm gonna google that while I do another boot attempt. I'm gonna use Siri. How do you reset the- No Siri you bitch, stop, never works, so confusing. How do you reset the SMC on a MacBook Pro? Okay, so I hold it down for ten seconds, let's try ten seconds. One, two, ten. SMC reset. (startup sound) I really pray this is a software issue, because if it's a hardware issue this is gonna be a lot harder. So we're gonna try to rule out all the software crap first because, as I have shown in the SSD conundrum yeah, sometimes it's just the software that's the problem. If you have not seen that lovely five part story arc, (laughing) I recommend checking that out while I try to get this thing working. Actually, wait that's not how it works. It's a tech video log, it's not in real time. Watch them after this. Yep, looks like this is still not working. Okay. Alright so we did some of the textbook stuff. Well there actually is one more. I'm gonna try Safe mode, see what that does. I also did boot this in verbose mode earlier to try to see what might be wrong, but verbose mode exits and goes to the screen before the shutdown occurs and when it boots back up it does not report a panic so, it's not a system crash. I mean this could very well be some other type of failure. This is a little bizarre, um, for shits and giggles let's try Safe mode. Just going down the list of textbook stuff first. Process of elimination. Okay this time the progress bar, I don't wanna jinx it, but it looks like it's moving a little bit further than it did before. So here's the other thing. The guy who has this computer said he ran hardware diagnostics and everything checked out fine, and it also has a fresh install of High Sierra. Now, that's what he's saying, I trust him, but I'm still gonna check some of that stuff as much as I can, or as much as I want to. (laughing) But yeah, the hardware thing said, hey it's okay, well then maybe it's not a hardware problem. I'm hoping it's not. See right now it's staying on for longer. It's still not doing anything, but this is the longest it's lasted so far. Well it looks like the system is hanging. So we are gonna move into phase two of our textbook troubleshooting. We are gonna try recovery mode, mode, mode. Let's see what's up. I'm gonna try it from the boot picker first. We're gonna hold down the trusty option key (startup sound) Okay, it does not look like there is a recovery partition. Bit of a problem. Well, let's just try it anyway. So I'm gonna shut this down. Let's try Command R, which I think pulls internet recovery? We might have to do that from, actually I have no idea what that does, let's just try it anyway. (startup sound) If this doesn't work we may have to go to the special next option. Yeah, I got low confidence this is loading any kind of recovery. We may have to rebuild a recovery partition. Heaven knows that I have no idea how to do that. (laughing) I'll figure it out. We have other options. We have the nuclear option which involves a big red button. Literally, you'll see it if this doesn't do anything. I'm just afraid this thing's gonna start like steaming and like leaking battery acid like any moment. This is the part where it usually turns off. We are wasting a lot of tape here. Yeah it definitely seems to be locked. The caps lock key won't light up. Control command power button won't trigger the sleep light, but, it's a little different now. Before it would automatically shut down, now it's not doing that, but it's still hanging so progress question mark, no idea. Alright, well, let's shut her down and let's go to the nuclear option. Actually it may not be that nuclear. It's like half nuclear. (intense music) Well, there goes our effects budget. - [Director] What effects budget? You know the one you approved. - [Producer] Yeah man, we never approved an effects budget. - Oh hell. Boom! Okay, there we go. We have our acid level and our thunderbolt fire wire icon. Perfect. That's half the battle. Handy dandy thunderbolt cable. Let's do it. Alright thunderbolt is in on that side. Flip it around the back, and I'll plug it into the other source. Disc not ejected properly, well screw you that's not really gonna help is it? Yeah, I was moving it and the cord might've jiggled. Anyway, the hard drive of the computer is mounted. So, that's kinda telling me on a physical hardware level, things are mostly okay. Let's just run a few textbook things with this. Alright, so we have the laptop's disc here, let's erase it! No just kidding. We're gonna do first aide. I was instructed that I am allowed to make a backup if I need to, because I may need to format the disc. Maybe we need to do some migration or something, I don't know. But, if the disc is to be erased, the data should be backed up first, because the data does not exist in a second location. That is what I was told. So, let's let Disk Utility do its magic. Repairing file system, oh that's a lot of things, whoa! Okay. Well, what do you say, should we try booting it? Well that didn't work. I didn't even bother showing you, because it was a massive disappointment, like me. Okay, we're gonna try maybe a reinstall? Maybe we'll do a reinstall, and then maybe a reformat and a reinstall. I'm not sure if he ever tried reformatting before, but we may have to try that regardless. After we backup data. Mounted, okay let's see. There's a lot of space free, so if we need to backup this data, doesn't look like there's much to transfer. Alright, so I'm gonna go over my potential ideas with y'all while I put this thing into recovery mode. So basically what I'm gonna do is I'm gonna throw this into recovery mode, and try to reinstall the operating system onto the target disc model laptop. I'm gonna try just a regular reinstall and see if that works. If that doesn't, then we have to go to something a little more nuclear. (startup sound) What I mean by that is we're probably going to have to format the hard drive and reinstall. Now, for backing up the data I can't just use the built in time machine method because the system won't boot up. And I don't wanna image the computer, and restore the image because if the system is corrupted or something, I don't wanna make an image of a corrupt system. So it looks like we're just gonna have to do some manual work. Alright, macOS utilities. Okay, reinstall macOS. I think he said he did do High Sierra. Pretty certain that's what he said. So I'm gonna do that. Oh. Like what? Seriously? I can't install to a volume that's in Target Disc Mode. Well, I didn't think that'd be a problem, okay. Well okay, let's reverse it. Let's try throwing this into Target Disc Mode and booting off of it on the laptop. Switch it around. What, it works in every spy movie. Just reverse the polarity you know. It should work here. Okay so now my MacBook Pro is in TDM so let's try booting off of that (startup sound) Now if this doesn't work I do have an external drive that is for emergency situations like this, but of course someone else is using it right now. (laughing) So I can't actually get to it. Ah shit! (censor beep) Yeah it's uh. Yeah, the recovery option does not show up. So, that sucks, I'm just gonna have to get that drive back. Woo hoo, I'm gonna make some phone calls. (instrumental music) Well one week later and I got the SSD back. So, I use this SSD for on the go video editing but I also have an emergency partition on here for situations like this. It's a fully boot-able version of macOS Sierra, who I just realized, it's Sierra, not High Sierra. Well, let's install Sierra on here first and then if everything works we can upgrade it. Alright, the reason why it is Sierra and not High Sierra is because I actually made this emergency boot drive during the days when High Sierra wasn't incredibly stable on older hardware. In fact I had quite a few little rants in other Krazy Ken episodes about that so if you wanna check those out I'd recommend it. However, High Sierra has got a lot better. So thank you Apple. Okay, so here is our macOS Sierra boot. We probably don't need to actually go there because we have the recovery partition on the SSD So, let's go into there. Can we do verbose mode for recovery partitions? Yes we can! Let's just have fun with that. I don't think I've ever actually seen verbose mode for a recovery partition. And I'm sure all of these things mean something, yeah. Absolutely. Okay, this is weird. We are having the same problem that we had with booting off the internal hard disc now on the external SSD. So now I'm starting to think that maybe this isn't a software issue. Maybe something else is wrong with the computer, that is preventing any startup disc from booting up. And it's freezing at the same location during the process. Just on the white screen between the loading bar and any other kind of shell we can actually interact with. That is incredibly bizarre. Okay so we can't boot internally, and we can't boot externally to a recovery partition. So, now it's starting to seem like maybe it's not a software issue, maybe it's something else that's maybe not a hardware issue, but something with the ROM or something? I have no idea. Let's try booting into the macOS Sierra partition. Oh that's, that's strange. Okay, so I'm not a hundred percent sure what model of computer this is, but I'm guessing it's probably a 2011 because it's not the thinner Retina version, and if I recall correctly there were some GPU issues with those. So I hit up some things in the inter webs of people having the exact same problem where the system will hang on that like gray white screen even if you boot from an external source. So what I'm finding out is it might be a GPU related issue and Apple has had some recalls and class action lawsuits with those in the past. So maybe that's what's happening here. This could be GPU failure. So, we're gonna try something for grins and giggles. (startup sound) We are going to select the internal hard disc as the boot option but we're gonna boot into single-user mode. So I'm gonna try doing a couple of things. I'm just gonna move the google machine out of the way here. So, we have some commands we're gonna try to execute. So let's do Command+S and Enter and go into single-user mode. Alright time to screw shit (beep) up. This is where everything and anything can absolutely go wrong. s bin final system check fy I've no idea if that's normal. So if you haven't figured out by now, I'm trying to move some of the ATI and AMD, AMD owns that brand, that's the old name ATI. I'm trying to move those graphic extensions into a different folder to prevent them from loading up. Safe mode, as you recall did not work. So I'm gonna try just moving these couple extensions. Star space dot. Oh, operation not permitted, well that's, that's great. That's probably not supposed to happen. You know if we need to we could actually do this from a GUI because I can mount this disc in Target Disk Mode. Yeah, I'm getting a lot of permissions issues. I shouldn't have to run this as sudo, because I am the root right? Oh touch, I don't even know what that command means. Let's see man touch, oh that sounds dirty. Touch change file access and modification times. Oh okay. Oh how do I exit the man page? Oh crap I forgot how to do that. How do I get out of the manual? (laughing) End, End, End! Aw crap. Oh that was a stupid idea. Control+C? No! Okay I tried running the commands again. I don't see this working, because it looks like it's spitting some permissions errors at me, but we're gonna try it for grins and giggles. Now, if this doesn't work. I'm trying to read what that's actually saying. It says something is disabled. Oh it's scrolling too fast (laughing). If this doesn't work I'll try doing this through a GUI just through the finder on another computer because I can mount this disc via Target Disk Mode. Alright we're waiting for DSMOS, he's always late. Okay so we did that, but again, I'm doubting that's gonna work because, those errors. Alright, we're back at the gray screen. Yep, it shut down. Okay so we're just going to take the SSD out, throw this in Target Disc Mode, and try maybe disabling that stuff through the Finder (startup sound) just by moving the extensions. So here's that disabled system extensions thingamajig we made earlier. So, let's hop around here for a sec. So here's all the AMD legos, or extensions. So I'm gonna try to move those into here. Alright, now let's take a look at the ATI ones. Okay, so now basically we did that through a GUI All of the AMD and ATI extensions are now in a disabled folder in the root, so they will not execute on boot up hopefully because they are out of the system library extensions folder. They are no longer inside there. So, let's see if that works. Now if it does work I'm expecting the graphics performance to be absolute trash. Check out that frame rate, Oh mamma. Here's the other fun thing, when I looked this up this little issue, the first two posts that I saw about it were in regards to 2011 MacBook Pros. (laughing) So I don't know if it's the GPU, maybe there's some trend with it not working. Yeah, it's weird right? And I know Apple had some issues with some of them, but Whoa hello! Oh! Check it out! Progress, progress. I don't know his password, I maybe should've asked for that. (laughing) Oops. But yeah we can definitely see we're getting some graphical performance problems, but okay, that actually means a lot. We are probably discovering that there's something wrong with the GPU, that when it tries to load any AMD or ATI extensions there's some kind of conflict that causes the boot sequence to lock up. So my money is on that the GPU needs to be replaced. However, I haven't checked the MSRP of these computers, but by the time you spend the money to get that replaced, you might just wanna throw a couple extra hundred bucks and get one of these things refurbished. I'm not sure what they cost, but at this point with this thing being what a seven year old computer? It might be best just to get like a refurbished one that's this old or maybe a year newer. Okay, so we're narrowing it down. Now I don't know the exact configuration of that computer because I can't log in to look at the system report. But, on Mac of All Trades, it looks like we have a very similar machine, an early 2011 anti glare 15 inch MacBook Pro quad core, Radeon chip set for $679 in excellent condition so, Yeah again, I don't know how much the price would be to replace the GPU on that machine, but if it's within the realm of like four to five hundred bucks, I would probably just recommend, shell out the extra $200 to get a professionally refurbished machine. That is going to be up to the owner though. So really, I'm not calling this a win. I'm not calling it a loss. I'm calling it a stalemate, because it's kind of up to the original owner to decide what to do next, because now money is involved. And everything changes when money is- (RECHING IN BACKGROUND) Oh I thought someone was puking upstairs. Hang on my DVR came out of pause mode. So I'm not calling this a win. I'm not calling it a loss. I am declaring this a stalemate. Why? Because now it's up to the owner to decide what to do next, because now money is involved. And everything changes when money is involved. But, I think we narrowed down what the suspect is, and we have two solutions. Replace the GPU (upbeat electronic music) or just get a new refurbished machine. That's all I've got guys. Thanks for watching. Catch the crazy, and pass it on.",
    "transcript_keywords": [
        "mode",
        "High Sierra",
        "Yeah",
        "Target Disc Mode",
        "Sierra",
        "Disc",
        "boot",
        "recovery",
        "system",
        "target disc",
        "GPU",
        "work",
        "Disc Mode",
        "Alright",
        "computer",
        "things",
        "recovery mode",
        "thing",
        "issue",
        "time"
    ],
    "transcript_entity_values": [
        "one week later",
        "High Sierra",
        "ATI",
        "Yesterday",
        "Target Disc Mode",
        "seven year old",
        "early 2011",
        "half",
        "ten seconds",
        "679",
        "ten foot",
        "a quarter",
        "a hundred percent",
        "15 inch",
        "two",
        "Apple",
        "GUI",
        "Radeon",
        "SSD",
        "Sierra",
        "a couple weeks later",
        "ten",
        "macOS Sierra",
        "2011 MacBook Pros",
        "GPU",
        "Krazy Ken",
        "Mac of All Trades",
        "DVR",
        "Target Disk Mode",
        "a MacBook Pro",
        "Retina",
        "AMD",
        "200",
        "first",
        "one",
        "many years",
        "AMD",
        "my MacBook Pro",
        "One",
        "try ten seconds",
        "NVRAM",
        "Option Control Shift",
        "the days",
        "five",
        "MacBook Pro quad",
        "yesterday",
        "Finder",
        "second",
        "2011",
        "TDM",
        "sec",
        "1%",
        "Siri",
        "SMC"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "CARDINAL",
        "TIME",
        "MONEY",
        "QUANTITY",
        "DATE",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG"
    ]
}