{
    "id": "xcVJ8a0uG0Q",
    "title": "Samsung Galaxy Book Pro and Pro 360 first look: OLED for $999",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-04-28T14:00:23Z",
    "video_url": "https://www.youtube.com/watch?v=xcVJ8a0uG0Q",
    "category": "Science & Technology",
    "tags": [
        "Galaxy Book Pro",
        "Galaxy book Pro 360",
        "laptop",
        "samsung",
        "samsung galaxy book pro",
        "galaxy book pro 360",
        "samsung galaxy book pro 360",
        "galaxy book s",
        "galaxy book flex",
        "galaxy book ion",
        "samsung book review",
        "galaxy book",
        "samsung galaxy book",
        "OLED",
        "AMOLED",
        "pc",
        "portable pc",
        "samsung galaxy",
        "samsung electronics",
        "samsung tv",
        "best laptop",
        "samsung laptop",
        "samsung laptop review",
        "best samsung laptops",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 321330,
    "likes": 6426,
    "comments_count": 496,
    "description": "Samsung has unveiled two new members of its Galaxy Book line. Theres the Galaxy Book Pro, a clamshell, and the Galaxy Book Pro 360, a 2-in-1 convertible. Both devices come in 13-inch and 15-inch sizes, and all four configurations include gorgeous AMOLED screens. Theyll be some of the lightest and most portable PCs you can buy, and theyre powered by Intels latest 11th-Gen processors.  Read more:   Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/3aNBEoi",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Samsung has a ton of Galaxy Books in its lineup. And you've probably heard of some of them. There's the Galaxy Book S, the Galaxy Book Flex, the Galaxy Book Ion. And we've just gotten a look at two brand new Galaxy Books. The Galaxy Book Pro and the Galaxy Book Pro 360. The Galaxy Book Pro is a standard clamshell laptop. And the Galaxy Book Pro 360 is a convertible which supports Samsung's S pen. (keyboard clicking) Both of these devices come in 13.3 and 15.6 inch sizes. And right off the bat, the thing to know about these, is that they're unbelievably light. The 13-inch Galaxy Book Pro starts at just 1.92 pounds. That means it's going to be one of the lightest laptops you could buy of any size anywhere. The larger Galaxy Book Pro is 2.3 pounds. And that's still crazy light for a 15-incher. The other exciting things about these devices are their screens. Now, the Book Pro has an AMOLED screen and the Book Pro 360 has what Samsung's calling, a super AMOLED screen. Which is a touch screen that Samsung says is brighter and less power hungry than a traditional OLED. So most screens that you'll see on laptops are LCD panels, which means the whole panel is illuminated by one LED backlight. So what makes OLED panels so phenomenal, is that every pixel provides its own illumination. So that means OLED panels can usually provide blacker blacks and better contrast ratios than any other laptop screen that you'll see. Though they also tend not to be quite as bright. These Galaxy Books will be among very very few 13-inch laptops that offer this OLED technology. So the screens were both pretty glossy and did kick back some glare. But I did find that I could actually see the videos and webpages that I was using while I worked outside. And that's not the case with a lot of laptops out there. The other major update here is that there's a new S pen which comes with the Book Pro 360. The only difference between this S pen and the S pen on the Galaxy Book Flex, is that this one is 2.5 times thicker. Samsung says this is to prevent hand cramping. And I can't tell you how effective that's gonna be, but I will say, it feels like a real pen in your hand. Now the new S pen is not supported by the regular Book Pro because that one doesn't have a touch screen. On the inside, all four of these devices contain Intel's newest 11th gen core processors. Samsung worked with Intel to certify all of these devices through Intel's Evo program. Which means that Intel vouches that a new laptop meets various standards that are most important to users. So that includes all-day battery life, quick boot time, general responsiveness, et cetera. So we've tried a number of these Evo devices for ourselves over the past year, and not all of them have quite measured up to all of those benchmarks in our testing, but the Evo label is a promising sign. And I'm looking forward to seeing whether these Galaxy Books actually hold up in our testing. I took a couple of these models for a spin and they seemed pretty responsive. I was able to run a couple of videos at a time without significant issues. Now, one thing to note is that you can't configure the Galaxy Book Pro with a discrete GPU. All the models come with Intel's Iris Xe integrated graphics. Now, don't get me wrong, these integrated graphics are good. We've tried them in a number of different laptops over the past year and they can generally run whatever games you would want to play at pretty good frame rates, provided that you bump the settings down. But they're not what you'd buy for professional video work for example. So that doesn't make the Book Pro a bad laptop, but it does mean that the Pro name is a bit misleading. It's not targeting high power users, so much as amateur graphic artists and other average Joes who just want a really nice screen. Another upgrade here is that these Galaxy Books include Dolby Atmos speakers, which are engineered by AKG. The benefit of Dolby Atmos is that it's supposed to give you more of a 3D surround sound experience. So that will be a nice compliment to the AMOLED screen if you're watching movies. During my brief testing period, I didn't get to listen to any audio that actually support Dolby Atmos. But I did get a pretty full sound from the YouTube videos that I watched. The Galaxy Book Pro can come with a CORE i5 or a CORE i7. You can go up to eight gigabytes of RAM on the 13, and 16 gigs on the 15. These both go up to 512 gigabytes of storage. And that's an NVMe SSD. You have one Thunderbolt 4, one USB type C, one USB 3.2, an audio jack, and a micro SD slot. And then the 15 inch also has an HDMI. And both of these have a fingerprint sensor. Now, the Pro 360 is a bit more pro than the regular Book Pro in a couple ways. So it has the same processor options, a CORE i5 and a CORE i7, but both the 13-inch and 15-inch 360 model comes with up to 16 gigs of RAM. The 13-inch comes with up to 512 gigs of storage. And the 15 goes all the way up to a terabyte. The 13-incher also supports 5G, though your mileage with that will vary based on where you are. Both models have one Thunderbolt 4, two USB type C, an audio jack, and a micro SD. These have a fingerprint sensor as well. The Galaxy Book Pro 13 starts at 999 and the Pro 15 starts at 1099. The 360 models start at 1199 and 1299 respectively. You'll be able to pre-order both the Galaxy Book Pro and the Galaxy Book Pro 360 today, April 28th, and they'll ship on May 14th. So both of these models are lightweight ultra portable laptops with good screens, and they're coming from a company that's very good at making lightweight ultra portable laptops with good screens. So far so good. But the question is gonna be, how well these laptops execute on the other fundamentals. Like battery life, performance, and audio quality. After all, for consumer laptops at the $1,000 price point, you want the standout feature to be a bonus, not something you have to sacrifice other things to get (keyboard clicks)",
    "transcript_keywords": [
        "Galaxy Book Pro",
        "Galaxy Book",
        "Book Pro",
        "Galaxy Book Flex",
        "Galaxy Book Ion",
        "Book",
        "Galaxy",
        "Pro",
        "regular Book Pro",
        "Book Pro starts",
        "Galaxy Books include",
        "larger Galaxy Book",
        "Books",
        "Book Flex",
        "Book Ion",
        "laptops",
        "regular Book",
        "screen",
        "Samsung",
        "AMOLED screen"
    ],
    "transcript_entity_values": [
        "the Pro 360",
        "the S pen",
        "LCD",
        "Book Pro",
        "360",
        "one",
        "Galaxy Book Pro",
        "Galaxy Books",
        "four",
        "The Galaxy Book Pro 13",
        "15.6 inch",
        "AMOLED",
        "the Galaxy Book S",
        "2.5",
        "all-day",
        "GPU",
        "the Galaxy Book Pro 360",
        "15-inch 360",
        "USB",
        "just 1.92 pounds",
        "Evo",
        "the Book Pro",
        "1099",
        "1299",
        "Joes",
        "5",
        "999",
        "512",
        "AKG",
        "13.3",
        "the Galaxy Book Ion",
        "15",
        "The Galaxy Book Pro",
        "Samsung",
        "May 14th",
        "the Galaxy Book Flex",
        "two",
        "13",
        "jack",
        "the past year",
        "1,000",
        "CORE",
        "4",
        "11th",
        "SD",
        "the 15 inch",
        "the Book Pro 360",
        "April 28th",
        "Iris Xe",
        "Dolby Atmos",
        "the Galaxy Book Pro",
        "13-inch",
        "YouTube",
        "The Galaxy Book Pro",
        "512 gigabytes",
        "SSD",
        "1199",
        "2.3 pounds",
        "Intel",
        "RAM",
        "16",
        "a ton",
        "the Book Pro"
    ],
    "transcript_entity_types": [
        "ORG",
        "EVENT",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG"
    ]
}