{
    "id": "xd-SefaGrLM",
    "title": "OnePlus: The rise and the decline of a fan-favorite brand",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-02-14T15:00:42Z",
    "video_url": "https://www.youtube.com/watch?v=xd-SefaGrLM",
    "category": "Science & Technology",
    "tags": [
        "oneplus",
        "oneplus 11 5g",
        "oneplus 11 5g review",
        "oneplus 11",
        "one plus",
        "oneplus 11 5g unboxing",
        "oneplus 11 review",
        "oneplus 11 unboxing",
        "oneplus screen",
        "oneplus battery",
        "oneplus 11 battery",
        "oneplus 11 price",
        "oneplus 11 specs",
        "apple",
        "samsung",
        "best phone",
        "best smartphone",
        "best smartphone 2023",
        "tech",
        "the verge"
    ],
    "views": 104170,
    "likes": 3100,
    "comments_count": 376,
    "description": "OnePlus is trying to woo estranged fans with the 11 5G, its best phone in years. But is it too little too late? We explore the winding road the company has been on for the past few years, finally leading to the OnePlus 11 5G. Sit back, because its kind of a wild ride. #oneplus #phones #technology   Read more:   The Verges sponsors play an important role in funding our journalism, but do not influence editorial content. For more information about our ethics policy, visit   You can get the OnePlus 11 5Ghere:    Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:",
    "description_links": [
        "https://bit.ly/3JPpePl",
        "https://www.theverge.com/ethics-statement.",
        "https://bit.ly/3E6qw4P",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv"
    ],
    "transcript": "- This is the OnePlus 11 Pro 5G, and I'm just gonna cut right to the chase. It's good, but we're gonna talk about all that. First, I wanna get into the journey that OnePlus has been on over the past few years, where they started and where they are now. Because there's nothing else quite like it in the industry. It's a story of a small brand with big aspirations running into some tough realities. The little Alert Slider that could. (gentle dramatic music) Years ago, OnePlus made a name for itself as an underdog breaking into the smartphone market. They had outside-of-the-box ideas, and low-cost devices that undercut the big guy, kind of a David and Goliath story. The company gained a cult following and grew a reputation for listening to its fans. But here's the thing, it was kind of one of the big guys all along. OnePlus has always been a sub-brand of OPPO, which is one of the biggest smartphone makers in China. But early on, the company got to pretty much operate on its own. That all changed after OnePlus started gaining some momentum and the integration became a lot tighter. Phones started showing up with a bigger and bigger number attached, the price. With the 7 Pro in 2019, OnePlus's main devices jumped up dramatically in price from the OnePlus 6's 529 to $669 for the 7 Pro. From there, they've crept up year after year, hovering around 900 and $1,000 depending on the storage configuration. That put its devices directly up against the very flagships it spent years undercutting. Suddenly things you could forgive in a $600 phone look a lot more glaring when you're spending close to $1,000. While this is happening, OnePlus keeps integrating more and more with OPPO. The two brands merged their Android OS code bases, which caused major headaches in the rollout of Android 12. OnePlus's beloved OxygenOS started looking a lot more like OPPO's ColorOS. Beyond that, OnePlus started losing its underdog image. Fans felt like the company wasn't listening to them anymore, and it was obvious that the brand was one of the big guys. The phones that OnePlus put out weren't bad, but they didn't quite have it all together. They didn't support all the major carriers' 5G networks, and they didn't have the long-term software support policy that other flagships come with. So what we got were some pricey phones with redeeming qualities like really fast charging, but ultimately, came up short against the big players. So here we are. All that brings us to the OnePlus 11. And this little, or not so little device, is carrying a lot of baggage. And honestly, I think it's pretty great. OnePlus has corrected some of those earlier missteps. The price makes sense. It comes with five years of security updates, and it works on all three major carriers' 5G networks in the US. But the path to get here was a little messy. And there are two questions in my mind. Who is this phone for? And are they gonna buy it? And did OnePlus put all of its eggs in the right basket by going in on fast charging? That was three questions. Just go with it. Here's what the OnePlus 11 brings to the table. It's not too shabby when you consider the Galaxy S23 has a similar processor and RAM and storage configuration for $100 more. OnePlus gives you that bigger screen, though, and that's what the people want. There's fast 80 watt charging to fully charge its 5,000 milliamp hour battery in 27 minutes. I've seen this feature on a handful of OnePlus phones, and I'm still kind of blown away when I plug it in and watch the battery percentage climb right in front of my eyes. And of course, the beloved Alert Slider is here. OnePlus left it off of last year's 10T, but it's back, thank goodness. Is this really the thing that's gonna get you to buy the phone? There's a few camera updates too. You get a stabilized 50 megapixel main camera, a 48 megapixel ultra-wide, and a 32 megapixel 2x telephoto lens. And here's something cool. There's a spectral sensor right next to the flash. That's a new kind of sensor that uses information from additional light channels to make better judgments about the light sources that are in your photo. In theory, the result is more accurate white balance, which continues to be a struggle for phone camera systems. But the thing that makes the biggest difference to OnePlus's image quality in the 11, are the tweaks it's made to its image processing algorithm. The photos from the OnePlus 10 Pro tended to look a little over brightened and washed out, but this time around, they have better contrast and richness. Unfortunately, these improvements haven't made it to the telephoto camera. Photos are still a little washed out and soft looking. It also has a hard time keeping the shutter speed up in dim light. My toddler wasn't moving much at all in this situation, but it took a handful of shots before I got one that looks sharp. I also like the colors and contrast better from the main camera in the same scenario. OnePlus kind of rebranded the telephoto camera as a portrait lens this time around. It's the default lens for portrait mode, but you can use the standard wide too. Portraits from the main camera look nice and I can see there's a little more natural falloff in the background blur, but I don't really care for the 2x portraits. And I wonder if OnePlus would've been better off skipping the telephoto lens entirely and just using a 2x crop from the bigger main sensor. If OnePlus is looking for more ways to cut costs, then this might be a good place to start. The ultra-wide doubles as the macro camera this year, which I much prefer over a silly low-res dedicated macro sensor. I had some trouble getting it to stick with macro mode when it switched over automatically. And it's hard to tell if anything's in focus. But when you get it, shot's look good. In other good news, there's no more monochrome sensor or anything like that. Good riddance. Battery life is good. I can get through a busy day just fine. In day-to-day use, the OnePlus 11 feels as fast as any $1,000 flagship. I can bounce between apps and tasks quickly, and the screen looks smooth and feels responsive. It's a premium experience. I don't love the glossy back panel. It just feels slippery in my hand and doesn't catch the light the way the textured glass on the OnePlus 10 Pro did. But if that's where costs had to be cut, then I can live with it. That's what's here. Let's talk about what's not here, starting with wireless charging. It's been a feature that comes and goes from OnePlus flagships, and this year it's out. Just about every other phone in this price bracket offers it, so it's a pretty big bummer not having it here. There's also an IP64 rating, which means it's dust resistant and somewhat water resistant, but it's not designed to withstand a full immersion in water, that would be an IP68 rating. Most other phones that have an IP68 rating cost more than the OnePlus 11, but not all of them. Like the $599 Pixel 7, which also includes wireless charging. OnePlus took a couple of steps forward by strengthening its software support policy and getting 5G certification with all the major US carriers. But it feels like they took a half step back here with some of these exclusions. So here we are, it's 2023 and OnePlus is coming back around to familiar territory, a well-priced phone with a good screen, fast charging and top-notch performance. It's very good, but I'm still not sure who it's for. The competition hasn't been standing still. For a little bit more, the Samsung S23 offers extras like wireless charging, an IP68 rating, and the Pixel 7 includes those things for a little bit less. Neither has a screen as big as the OnePlus 11 or wired charging that's as fast, so there might be an argument for it if you really want that big screen at a lower price. But what's most likely to dictate the OnePlus 11's fate in the US, is that it won't be sold by any of the carriers, not even T-Mobile, which has sold the company's flagships for the past few years. Instead, it'll be sold unlocked through OnePlus's website, Amazon and Best Buy. A loyal fan base can turn your brand into a cult favorite, but in the US, it's carriers that really make or break phone sales. So that's gonna be a real challenge. OnePlus tried going toe-to-toe with the incumbent Android brands and it came up short. The OnePlus 11 is a smart return to form, and a genuinely very good device. But even so, it's a far cry from the company's scrappy upstart beginnings. Scrappy only gets you so far, and I'm not convinced that it's enough to bring back the OnePlus of old. All right, OnePlus fans, what do you think of the OnePlus 11? Are you excited that the Alert Slider's here? Are you gonna go out and buy it? Have you moved on? Let us know in the comments.",
    "transcript_keywords": [
        "OnePlus",
        "good",
        "big",
        "phone",
        "camera",
        "charging",
        "Pro",
        "Alert Slider",
        "OnePlus started",
        "Phones",
        "years",
        "year",
        "fast",
        "started",
        "OnePlus put",
        "company",
        "price",
        "kind",
        "main",
        "sensor"
    ],
    "transcript_entity_values": [
        "the 7 Pro",
        "11",
        "80 watt",
        "Android",
        "one",
        "529 to $669",
        "five years",
        "599",
        "OnePlus 10 Pro",
        "Years ago",
        "three",
        "T-Mobile",
        "OnePlus 11",
        "OnePlus 11",
        "5,000 milliamp hour",
        "close to $1,000",
        "US",
        "5",
        "27 minutes",
        "years",
        "the Alert Slider's",
        "Alert Slider",
        "Samsung S23",
        "half",
        "2x",
        "two",
        "the Galaxy S23",
        "600",
        "100",
        "2023",
        "Amazon",
        "1,000",
        "David",
        "the past few years",
        "The OnePlus 11",
        "this year",
        "2019",
        "China",
        "around 900 and $1,000",
        "10",
        "OnePlus",
        "50 megapixel",
        "Android 12",
        "Best Buy",
        "Goliath",
        "48 megapixel",
        "last year's",
        "RAM",
        "OPPO",
        "32 megapixel 2x",
        "First",
        "OnePlus",
        "Alert Slider"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "MONEY",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "LAW",
        "QUANTITY",
        "MONEY",
        "GPE",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "PRODUCT",
        "DATE",
        "DATE",
        "GPE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "PERSON",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT",
        "PERSON"
    ]
}