{
    "id": "xDKPzgi6qwU",
    "title": "Building the Ultimate MacBook Pro",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-06-27T15:47:30Z",
    "video_url": "https://www.youtube.com/watch?v=xDKPzgi6qwU",
    "category": "Science & Technology",
    "tags": [
        "macbook",
        "macbook pro",
        "best macbook",
        "new macbook pro",
        "apple",
        "mac",
        "macbook pro 13",
        "thunderbolt",
        "macbook accessories",
        "unboxing",
        "laptop",
        "apple macbook pro",
        "gadgets",
        "tech",
        "building the ultimate",
        "best macbook pro accessories",
        "austin evans"
    ],
    "views": 1866592,
    "likes": 36535,
    "comments_count": 2645,
    "description": "Thanks to LastPass for sponsoring this video! Create a LastPass account for free here!  The Apple MacBook Pro finally gets the ultimate build treatment.  Linedock for 13\" MacBook Pro:  Das Model S Keyboard for Mac on Amazon:  Logitech MX Master 2S on Amazon:  Gigabyte Gaming Box External Thunderbolt 3 RX 580 Graphics Card on Amazon:  CalDigit TS3 Plus Thunderbolt 3 Dock on Amazon:  Double Laptop Vertical Stand on Amazon:  LG UltraFine 5K Display:  2016/2017 MacBook Pro Case on Amazon:    By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://bit.ly/2lwPrWl",
        "https://www.linedock.co/get",
        "http://austin.tech/dasmodels",
        "http://austin.tech/mxmaster2s",
        "http://austin.tech/gamingbox",
        "http://austin.tech/tb3dock",
        "http://austin.tech/laptopdock",
        "https://www.apple.com/shop/product/HKN62LL/A/lg-ultrafine-5k-display",
        "http://austin.tech/mbpcase",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin, and today we are building the ultimate 13-inch MacBook Pro. And huge shout-out to LastPass for sponsoring this video. So you might be wondering why we're using the 13-inch Macbook as opposed to a 15-inch when we're trying to build the ultimate laptop, but a lot of it actually comes down to this. So this is a LineDock, and inside, what we're finding here is not only the additional battery, but additional storage, additional ports, that's all meant for the 13-inch. So this guy started out as an Indiegogo, and it's just starting to ship, but inside what we're going to find is something that actually looks a lot like a Macbook. So the idea here is to give you a bunch of the functionality that you would normally expect on, for example, older Macbooks, with, you know, more than four ports. So there are gonna be a ton of ports that are gonna be added, including USB-C, we've got two USB 3.0 on the side, SD card reader. There's also on the other side we've got HDMI, a mini DisplayPort, a third USB 3, as well as one more USB type C. So it's basically the same size as a Macbook, so I sort of stack it on top. What I've got here is a little bit of a sandwich. Actually, how does this connect. Oh, what. Oh, (laughs) for a second, I thought they forgot to put anything else in the box. I think they're taking a subtle hint at the lack of dongles needed with this particular product. There's also an available USB-C magnetic module. So if we open this guy up, what we're going to find is, well, what looks like a USB adapter, but the whole thing is going to be magnetic. Now, supposedly this is going to support full USB-C capability, so stuff like data transfer, video and everything like that. But I've had some questionable luck with these in the past. So maybe I'll try one of the ports on the side. Oh, okay, maybe the back port just doesn't work. So we immediately get charging, and we also have a 256 gig SSD. Okay. So, there are different versions of the Linedock available, say for example if you don't want so much storage, but the idea here is that if you've sort of got this giant dock thing that goes with the Macbook, you're going to be getting battery, extra ports, SSD, the whole sorta package. While this looks a little bit goofy right now, inside what we're getting is not only that SSD, which is optional, you can go all the way up to a one terabyte SSD, or not even opt for one in the first place, but on top of that all these, LineDocks have 25,000 mAh power batteries inside. So it's going to be able to charge at a full 100 watts, more than enough for any Macbook, and in theory it could give you basically double the battery life. Now the LineDock is going to essentially double the thickness of our Macbook. And as we all know, thicker is better when it comes to building the ultimate stupid - I mean - ultimate Macbook. Not stupid. I meant ultimate. So that's where some protection for our Macbook comes in. One of the only real issues I've noticed with the LineDock is that since it's not actually connected to the Macbook besides with a cable, it actually doesn't really matter what you actually do to it, just as long as you have it connected via USB-C. So, that's where this comes in. A very important keyboard protector, that also very helpfully reminds you of all the wonderful keyboard shortcuts that I totally don't know at all. But of course, protection is incredibly important. You never know when a sudden gust of wind could blow your Macbook out a window, and you need to make sure it survives. Well that's where this comes in. This giant case that, supposedly helps. Is that really how it's supposed to go on, it just looks so weird. Oh, I needed to click it, until it did that noise. Now it looks much better. Okay, that looks a little more like it. If I pull it up- hey, there we go! We got some real protection for our ultimate Macbook. Excellent. Now, all you need is some protection for your digital life. Thanks to LastPass. No, I didn't just include a case so I could get a great segue over to protecting your digital life with LastPass. What I love about LastPass is that it's something I've been paying for myself way before they ever decided to sponsor the channel, and that's for good reason. It is absolutely the best way I've ever found to keep your password safe. Now as we all know, or at least as we all should know, it is a terrible idea to use the same password across several sites. If any of them get hacked or compromised, you're gonna deal with the very real potential of someone being able to hack onto other sites based on just using the same password that you used over and over and over again. LastPass takes security seriously. Not only do they do all the encryption of your passwords on your device so you don't have to worry about things being unprotected sitting on their server somewhere, but on top of that, if you lose your password, that's it. LastPass has no ability to be able to unlock your vault or to do anything to sort of open up your passwords. Now that might sound like a bad thing, but in reality that means not even LastPass can get access to your data, and I think that is a very good thing. If you're not using a password manager to not only generate unique passwords for every single site you visit, but also to keep them all safe and secure behind a solid vault, then LastPass is absolutely what you need. And of course, if you guys wanna check it out and help support the channel, the link will be in the description. There's free and paid versions, but regardless, protect yourself online, and download LastPass now. Of course, when it comes to building the ultimate Macbook, a single display is not going to be enough. So that's where the LG 5K Ultrafine comes in. So with a single Thunderbolt 3 cable, we're gonna be able to not only get that full 5k video signal, but we're also going to be getting three USB-C ports on the monitor, and we're going to be getting an 87 watt charge from the monitor into the Macbook. Which is helpful, especially when we have the LineDock, which can also charge the Macbook, so we should be good on power. Now this is starting to look a little bit ridiculous, however, it is by no means ultimate just yet. Which is where this comes in. A laptop vertical dock for two laptops. So with this, we can drop the Macbook as well as the LineDock at the same time. Next up, we have a keyboard. This is going to be the Das Keyboard Ultimate, which not only is going to be able to take advantage of some of the USB ports on the LineDock, but is also going to give us a fully mechanical keyboard that is meant to be used on Mac. We also have the Logitech MX Master 2S. So this guy's going to be using Bluetooth, and now, we're getting a little bit closer. However even this is still not going to be anywhere near enough ports for the Ultimate Macbook. Which is where the CalDigit TS3 Plus comes in. This is going to be a Thunderbolt 3 dock, which is going to give us extra functionality and, well, to be totally honest, even more ports that we're probably not going to actually use. Alright, that's actually not going to be too crazy. So what we're getting with this is not only a bunch more USB ports, we're also going to be getting a second Thunderbolt 3 port so we can daisy chain with the monitor, but we're also going to be getting some other stuff that even the LineDock doesn't include, such as ethernet, another SD card reader, if we wanna do two at the same time. Look I just wanted this dock and I figured it'd be cool. Don't judge me. I just thought it would be really ridiculous. So we're gonna plug in the Thunderbolt 3 cable from the computer, it's going to go into the dock, and then we're gonna plug the Thunderbolt 3 cable from the monitor also into the dock, and then actually what we can do is we can plug the LineDock into the USB type C cable, on the dock. Oh hey wait, okay hang on. Okay that looks good. So if I close the Macbook up, we should have everything on one display. There we go. And then, I set it right here, have my mouse, have my keyboard. So you guys might have caught a little video I did recently trying to game on a Mac. And doing so, I bought this external GPU from GIGABYTE, which is actually going to be really tiny, and yet does connect over Thunderbolt 3. So, if I get a couple more cables going here (laughs). So, with our final Thunderbolt 3 cable, which will be plugged directly into the Macbook, we're going to have a full Radeon RX 580. Now, when you clicked on this video, I promised you the ultimate Macbook. What I've actually delivered is a really, really bad idea. And so it is time to fully test the ultimate 13-inch Macbook Pro. Now to get the ultimate performance because, of course, this is the ultimate set-up, we also have a secondary display, this time a 1080p 144 hertz panel, which is going to be plugged directly into the GPU. 'Cause you know of course the last thing we want is some kind of performance bottleneck. It all technically works. Nothing has crashed, nothing has stopped working. Yet. So, Fortnite decided to not work on us, and instead of reinstalling the entire game and trying again, next we have: Rocket League. Which I will have you know, works completely perfectly on the ultimate Macbook with no issues at all. Basically. Now, we're playing 1080p high, which shouldn't be a really big surprise, with that RX 580 we have plenty of horsepower, even considering that we are running a dual-core CPU. And at the same time, even though it doesn't really matter, we also have a 5K monitor. And like...actually how many ports do we have? Nine, ten, eleven, twelve USB-A ports. Three, four, five, six, seven USB-C ports, one additional Thunderbolt port plus two more that are free on the Macbook, two HDMI ports, we have a DisplayPort, we have a mini DisplayPort, and then we also have three more DisplayPorts on our GPU, ethernet, optical audio, headphone jack, and we have a 25,000 mAh battery, and a 256 gig SSD, and a full RX 580 external GPU. Oh and I forgot to mention, there are also three extra USB-C ports on the back of the Thunderbolt display, for a grand total of ten. So hopefully you guys found building the ultimate Macbook Pro to be very informative, very useful with your own Macbook building projects- what, is it just me who does this?",
    "transcript_keywords": [
        "MacBook",
        "ultimate Macbook",
        "ultimate",
        "MacBook Pro",
        "ports",
        "ultimate Macbook Pro",
        "Thunderbolt",
        "USBC ports",
        "USBC",
        "USB",
        "LineDock",
        "LastPass",
        "USB ports",
        "SSD",
        "Austin",
        "dock",
        "keyboard",
        "cable",
        "Macbook building",
        "additional Thunderbolt port"
    ],
    "transcript_entity_values": [
        "100",
        "six",
        "15-inch",
        "more than four",
        "25,000",
        "LineDocks",
        "5",
        "LastPass",
        "third",
        "LastPass",
        "three",
        "twelve",
        "GIGABYTE",
        "5k",
        "USB-C",
        "DisplayPorts",
        "Three",
        "256",
        "first",
        "Macbooks",
        "USB-C. So",
        "USB",
        "87 watt",
        "hertz",
        "ten",
        "two",
        "K Ultrafine",
        "3",
        "Rocket League",
        "Thunderbolt 3",
        "four",
        "LG",
        "five",
        "Austin",
        "Macbook",
        "one",
        "Indiegogo",
        "MX",
        "second",
        "Bluetooth",
        "580",
        "Macbook",
        "LineDock",
        "MacBook Pro",
        "Macbook Pro",
        "Nine",
        "Fortnite",
        "DisplayPort",
        "1080p 144",
        "SD",
        "Linedock",
        "SSD",
        "Logitech",
        "CPU",
        "Thunderbolt",
        "the Das Keyboard Ultimate",
        "Mac",
        "the Ultimate Macbook",
        "13-inch",
        "One",
        "headphone jack",
        "seven",
        "GPU",
        "today",
        "eleven",
        "Radeon",
        "the CalDigit TS3 Plus",
        "a full"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "GPE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "FAC",
        "CARDINAL",
        "LOC",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "LAW",
        "ORG",
        "FAC",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY"
    ]
}