{
    "id": "XdZqwJEnj54",
    "title": "The truth about the Google Pixel 2!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-10-28T15:22:28Z",
    "video_url": "https://www.youtube.com/watch?v=XdZqwJEnj54",
    "category": "Science & Technology",
    "tags": [
        "google",
        "pixel",
        "pixel 2",
        "pixel 2 xl",
        "pixel 2 review",
        "pixel 2 unboxing",
        "pixel 2 vs iphone 8",
        "pixel 2 vs iphone x",
        "smartphone",
        "android",
        "tech",
        "2017",
        "pixel 2 display",
        "pixel 2 display problems",
        "pixel 2 display bad",
        "pixel 2 screen",
        "google assistant",
        "pixel 2 features",
        "pixel 2 camera",
        "camera",
        "best smartphone camera",
        "android oreo",
        "samsung",
        "pixel 2 vs Galaxy S8",
        "tld",
        "jonathan morrison",
        "pixel 2 xl vs note 8",
        "apple"
    ],
    "views": 1667819,
    "likes": 27734,
    "comments_count": 2292,
    "description": "My review & thoughts of the Pixel 2 & Pixel 2 XL. Enjoy! Panda your Pixel 2:  The $13,000 4K TV Setup!   Background music via Epidemic Sound:  Audio test courtesy of Porter Robinson:   Check out Brandon!   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://dbrand.com/pixel-skins",
        "https://youtu.be/f36wacxDlfQ",
        "https://goo.gl/rMbhQL",
        "https://youtu.be/fzQ6gRAEoy0",
        "https://youtu.be/cRIka4FgQpw",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "(pretty digital music) - Yo guys, Jonathan here. This is the Google Pixel Two and the Pixel Two XL, the almost perfect smartphones. Now when these were announced, everybody was excited. The XL marked scores through the roof. Finally a bezel-less display, at least in the Pixel Two XL but then, devices started rolling out. People started started getting 'em in hand and it almost turned into this horror story for Google. (dramatic music) Now aside from the beat down Google's taken over the past couple of weeks, there's actually a lot to like about the Pixel Two and its bigger brother. So what's kind of weird is both the Pixel Two and Pixel Two Xl come in different color variants. With the regular version we have just black, clearly white and kinda blue. Like the XL Two screen. (extreme alarm) Is that right? On a serious note though, I actually really like the kinda blue. It is a super soft, almost bluish-mint color. I even prefer it over last year's really blue. Jumpin' over to the Pixel Two XL, this actually comes in two colors: just black and black and white, aka panda. Now if you ordered a regular Pixel and you need some of that panda action in your life, the easiest fix for that, is to hit up the robots and throw a dbrand skin on it. This is not a panda, but it sure as hell looks like one. They even got you Dodger fans covered, too. Links are below. So when you stack the Pixel Two and the Pixel Two XL side-by-side, the very apparent bezels on the regular Pixel Two really stand out. The Pixel Two XL looks like it's a phone from 2017, whereas the regular Pixel Two kinda feels a little dated. Regardless, though, the layout on either of these phones is awesome. I really enjoy the location of the fingerprint reader on the back. It works flawlessly. The volume up and down buttons are right smack next to your thumb; super easy to access. Same thing with the power button. It just feels good. Now the bottom of the Pixel Two there is a usb-c port which is always awesome. There is no wireless charging with this which for me is not a deal-breaker. Some people either really, really love wireless charging or some people don't care at all. I would love to hear what side of the fence you're on. Regardless, though, wireless charging not a positive with the Pixel Two as you're getting up to seven hours of battery life with 15 minutes of charging. There's absolutely no room to complain about that. From there you might notice that usb-c port's kind of just hanging out there by himself. There is no headphone jack, and the only weird part about that is Google made a really big deal about the headphone jack last year when the Pixel debuted and this year they were kinda like, (intense music). On a serious note though, I don't think not having a headphone jack is a deal-breaker. Especially for me. Anytime I can go wireless, I am going to go that route. Yes, there's the whole debate about audio quality and having a wired cable but for me, there are tons of fantastic sounding wireless bluetooth headphones out there, so I'm gonna go that way. So while Google did cut off the headphone jack, one giant feature they added this year is water-resistance, and that might be reason alone to upgrade over last year's Pixel. Maybe if someone who always has their phones near the water or if you're in the shower or a bath, super staff. Now when you pick up your shiny new Pixel Two or Pixel Two XL, in the box you get an 18 watt usb-c charger, the usb-c cable, and a usb-c 3.5 millimeter audio adapter. So just in case you're holding on to those wired headphones, you can use it out of the box. What's kind of weird though is there are no headphones in sight within this box. It would have been really nice to have a pair of usb-c headphones with the Pixel Two. On the other hand you have companies like Samsung going above and beyond and including a nicer pair of headphones. So if that matters to you, that is some food for thought. From there it's time to hope over to probably the most controversial subject with the Pixel Two, and that is the display. Specifically that it's geared more towards the Pixel Two XL display as opposed to the regular Pixel Two. That features a five inch, 1920 by 1080 amoled display, whereas the Pixel Two XL features a six inch, 2880 by 1440 p oled display, which seems to be causing all kinds of problems. Like there's no denying there is a very apparent problem with the Pixel Two XL screen. There is major blue shift (mumbles) access this like, any sort of way. The part where it gets a little tricky though is, I think if you just handed this phone to the average person out there, they are not gonna pick up on this. It is the super tech audience that is going deep, diving deep and really getting crazy technical with this, like throwing it down to 10, 15% brightness with a gray screen, like that is kinda crazy. Is that reason enough, just for the screen, to not buy the Pixel Two XL? I'm gonna say no, because there are many, many enticing features with the Pixel Two XL, it's just very disappointing, because if there was ever a company that you would root for to put Apple and kinda kick their ass, it is Google. They're giant. This is a flagship phone with flagship pricing, and you would expect better from them. So with that, it's kind of confusing and has me a little torn. On one hand, you have the regular Pixel Two which has a totally fine display but really, really big bezels, and then you have the Pixel Two XL which is kind of like that person that you see from a distance. It's good from far, but you get it up close and it is far from good. - Blech! - On top of that, I do get that Google was going for that non-saturated look that we've kind of grown accustomed to with smartphones over the years, but the fact of the matter is, certain colors just look really off, especially with red. Again, it's not a bad display, and I don't think it's just solely be a reason to turn you off from the Pixel Two or Pixel Two XL, but when you compare it to something like a Samsung Galaxy S Eight or Note Eight, there is no comparison. Now packed inside the Pixel Two is a Snapdragon 835, four gigabytes of ram. There is no micro sd card expansion, but there is a really solid amount of storage with these. The base Pixel Two comes in at 64 gigs or you can bump it all the way up 128 gigabytes. On top of that you also do have unlimited storage with Google Photos so yeah, that is definitely a thing. For me though, now that we got the ugly, controversial part out the way, there is a lot to love about the Pixel Two and Pixel Two XL. For starters, out of the box you are getting sweet, sweet, pure, unadulterated Android 8.0 Oreo. It's super clean, super smooth, and unlike other Android phones, Google is promising three years of support and updates. I really, really love the wallpapers, especially the live versions. Those are just kind of fun to look at and zone out at. And what is really, really freaking cool with these, is that it's smart enough to know what your wallpaper is. So if you have a dark one, gonna automatically switch the theme of your phone to dark and if you have a light wallpaper, it will automatically switch it to light. Now I wouldn't mind if we claimed it as geared specifically towards the Pixel Two XL is because it has that extra tall 18 by nine screen. I wish they would implement some sort of feature like Samsung does where we can punch in or crop it on YouTube videos. It's not the end of the world, but just something I would like to see in the future. From here I wanna talk about Google Assist, and also roll in the squeeze feature because that is one way to access the Google Assistant. Is this a revolutionary, mind-blowing feature? No, but I don't hate it and it actually works pretty well. Schedule a timer for 12 minutes. - [Google Assistant] Okay 12 minutes, starting now. - What was the score of the Bulls game? - [Google Assistant] The Bulls' last game was against the Cavaliers. They lost 119 to 112. - Man, it sucks to be a Bulls fan this year. Punching people in the face. What is the traffic like to Los Angeles right now? - [Google Assistant] There's moderate traffic from your location to Los Angeles, so it'll take about 42 minutes. - See, that is super fast. So that part of this phone is awesome, and it works really well, just as advertised. From there, I'm gonna kinda kill two birds with one stone. Play Porter Robinson. (Porter Robinson plays) So yeah, there's a ton of volume. That is definitely not anything lacking there. I think overall, I would say if there was anything missing, it would be the low end. There's not a crazy amount there, but regardless, I would definitely take stereo speakers over non-stereo speakers any day of the week. From there, always-on display is an awesome feature to have. Something that I wish worked just a little bit better was the song recognition. It's not that it's bad, and it's kind of confusing because by default, it is turned off, so if you picked up a Pixel Two and it's not working, more than likely you have to go into settings to enable it. But from there the database and the library isn't exactly the biggest, so it's not always gonna recognize every song. And from what I understand, it actually checks every 60 seconds to save battery life, so it's not always gonna feel the fastest or the quickest. Next, we're gonna talk about, hands-down, the most impressive thing about the Pixel Two and that is the camera, seriously. Forget the 94 on that DXL mark score, it should just read next to Google Pixel Two, really (beep) good. Seriously, what Google has done with this camera is nothing short of incredible. Some of the best images I've ever captured are from the Pixel Two. It's a 12.2 megapixel sensor with an f-stop of 1.8 and the color, the sharpness and detail, everything about this camera is awesome. The one thing I really like with the Pixel Two is that portrait mode is gonna work on both the Pixel Two and Pixel Two XL. You're not gonna have to choose between one of the phones because it actually works on one single lens which is kind of crazy. One small thing that may turn off some people, is there's no way to preview the portrait mode before-hand, so you kind of just gotta take the photo and hope for the best, but most of the time it works out really well. One other thing is you're not gonna get as much flexibility as something like the iPhone Eight Plus, the Galaxy Note Eight, or the upcoming iPhone 10 where you can kind of tweak and manipulate things and post but regardless, it is still really impressive. But almost scary to see what Google is doing with a single lens and I'm stoked to see where they take this in the future. Next, I'm gonna talk about portrait selfie mode. It works incredible, and it is super impressive, but I had a hard time getting it working and for you out there that's freaking out right now saying, you're just an Apple fan-boy, you don't know how to, Android is too complex and superior for you. No man. There are threads in forums deeper than your-- Like I was seriously asking for help on Twitter and I got people yellin' at me asking if I could rename photos. (air horn) The simplest way is to find the update link, click on it and hope that it opens in the Play Store because it is not publicly available. If that doesn't work, you gotta go into settings, clear cache and data on the play store, potentially the camera app as well, reset things, go back into the play store and hope that an update shows up. Now for most people out there, that will fix the problem, but there are certain cases, like I experienced, where it actually affects certain Google accounts so for me, for whatever reason, that update did not wanna show up. The absolutely weirdest bug fix and workaround that I've ever heard of, happened with the Pixel Two. If you have a friend where their Google account shows the camera update, have them log into your phone, update the camera, have them log out and then magically your phone is now fixed. It's crazy. At the end of the day, though, I finally go it workin'. Even if I had to side-load a freaking APK, it was worth it because the Pixel Two selfie portrait mode is amazing. Now on the flip side of that, some people are over-critical of the Pixel Two selfie portrait mode, like looking for any possible mistake. Yes, it's not gonna be perfect every time. Yes, it's not always gonna get hair right. Yes, it sometimes may mistake a piece of the background for the foreground but overall, it is crazy what Google is doing with that. So yeah, between the front-facing camera, the rear camera, portrait mode on both sides, the Google Pixel Two as a camera overall is two giant thumbs up. So we're hoppin' over to the 4k 30fps test here on the Pixel Two. Ralphie, Rich and that hard part. Lemme get a close on that. Some quick auto-focus. Also I'd love to hear what you guys think of the video quality and the stabilization. Drop me a comment down below. Lastly, shout out to Mr. Brand on the camera. He makes some pretty awesome videos. Check him out, too, the link below. Lastly, battery life on the Pixel Two and Pixel Two XL overall are really solid. Obviously, you're going to get more of a workhorse with the Pixel Two XL because you're getting a larger battery. At the end of the day, that's kind of what it came down to between these two phones. Battery life and the screen. So clearly if we need that better battery performance, the Pixel Two XL is the way to go and normally, a little bit of no-brainer, you want that bigger, better display, go for the Pixel Two XL as well, but with that weird p oled display and that blue color shift, it kind of makes things a little confusing. One one hand you've downsized to the regular Pixel so you don't have to worry about those weird display issues, or you suck it up for that better battery life and go with the Pixel Two XL. So with this video, hopefully there was enough cover with the features and the software to kind of get you to that almost ready to buy point, and then from there, the best advice I could possibly give you is head into a store, if you can, and look at these displays in person. I could show you a million times over a YouTube video how that blue shift looks like but it's never really gonna simulate real life. And then from there you can ask yourself, is this enough to make me not wanna buy the Pixel Two XL. Are the bezels big enough to where they're gonna annoy me and I'm gonna wanna go somewhere else? And that will ultimately help you make your decision. Aside from that, thank you guys very much for watching. Hopefully you enjoyed the video. If you did and you are feeling like being awesome, make sure to smash that like button. If you are not feeling the Google Pixel Two, maybe check out the Galaxy Note Eight, which you can watch here. Again, huge shout out to dbrand for sponsoring this video. This is Jonathan and I will catch you guys later. - Damn! - Evans. Wait, I didn't see that do it again. - [Male Friend] (mumbles) Get the top part, Get the bottom arms. (laughing) - Damn you're a veiny sucker. (explosion)",
    "transcript_keywords": [
        "Pixel",
        "Google Pixel",
        "regular Pixel",
        "Google",
        "kind",
        "year Pixel",
        "display",
        "Pixel Two selfie",
        "buy the Pixel",
        "camera",
        "phone",
        "super",
        "Pixel debuted",
        "People",
        "regular",
        "base Pixel",
        "awesome",
        "stack the Pixel",
        "battery",
        "life"
    ],
    "transcript_entity_values": [
        "the Play Store",
        "Twitter",
        "up to",
        "18 watt",
        "12.2 megapixel",
        "four gigabytes",
        "Two",
        "your--",
        "between one",
        "one",
        "1080",
        "DXL",
        "1.8",
        "this year",
        "2880",
        "any day of the week",
        "Jonathan",
        "two",
        "Google Pixel Two",
        "Bulls",
        "128 gigabytes",
        "3.5 millimeter",
        "Galaxy Note Eight",
        "15 minutes",
        "Apple",
        "YouTube",
        "119",
        "112",
        "94",
        "64",
        "the end of the day",
        "a million",
        "1920",
        "last year",
        "last year's",
        "10",
        "every 60 seconds",
        "18",
        "the years",
        "Pixel Two or",
        "XL",
        "a ton",
        "five inch",
        "Cavaliers",
        "nine",
        "Porter Robinson",
        "usb",
        "Samsung",
        "15%",
        "Android",
        "the past couple of weeks",
        "Ralphie",
        "Los Angeles",
        "1440",
        "2017",
        "Eight",
        "Brand",
        "Pixel",
        "4k",
        "Rich",
        "iPhone 10",
        "One",
        "Google Assist",
        "Pixel Two",
        "Play Porter Robinson",
        "Samsung Galaxy S Eight",
        "seven hours",
        "six inch",
        "Dodger",
        "Google",
        "YouTube",
        "jack",
        "Pixel Two XL",
        "about 42 minutes",
        "12 minutes",
        "three years",
        "Android 8.0 Oreo"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "PERSON",
        "GPE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "EVENT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "TIME",
        "QUANTITY",
        "NORP",
        "ORG",
        "GPE",
        "PERSON",
        "PRODUCT",
        "TIME",
        "TIME",
        "DATE",
        "PRODUCT"
    ]
}