{
    "id": "xe7izgCcAwI",
    "title": "You can't eat this Keyboard!!!  - CandyBar Premium",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-03-27T17:23:07Z",
    "video_url": "https://www.youtube.com/watch?v=xe7izgCcAwI",
    "category": "People & Blogs",
    "tags": [
        "keyboard",
        "pc",
        "computer",
        "custom",
        "DIY",
        "switches",
        "mechanical",
        "tangerine",
        "c3",
        "metal",
        "aluminum",
        "candy",
        "candy bar",
        "packaging",
        "gaming",
        "enthusiast",
        "do it yourself",
        "special",
        "one of a kind",
        "sweet",
        "pink",
        "QMK",
        "customize",
        "hot swap",
        "PCB",
        "sublimated",
        "the key co"
    ],
    "views": 504703,
    "likes": 21368,
    "comments_count": 1210,
    "description": "Candy just got better with the CandyBar premium keyboard! Custom keyboards are the next big thing for PC enthusiasts, move aside RGB!  Sign up for The Key Dot Co's newsletter to find out when the CandyBar is back in stock!   Buy Mechanical Keyboard On Amazon (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy Mechanical Keyboard Switches On Amazon (Paid Link):  On Newegg (Paid Link):   Buy Keyboard Tools On Amazon (Paid Link):  On NewEgg (Paid Link):   Buy Keyboard Cleaning Tools On Amazon (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://lmg.gg/Ovt3Q",
        "https://geni.us/us4izv",
        "https://geni.us/ycuiRZu",
        "https://geni.us/u4rgjm",
        "https://geni.us/9BJj",
        "https://geni.us/7Caw7VS",
        "https://geni.us/SVVAhjU",
        "https://geni.us/tLlB",
        "https://geni.us/XEC8R",
        "https://geni.us/5qS8wuB",
        "https://geni.us/Y9WyM",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "(board clapping) - I don't know how people do it with one hand. Okay, when this arrived at the office, Tyler brought it up to my desk and he thought that someone had sent us a big chocolate bar because this box is so cool. This is not a chocolate bar. This is instead one of the coolest keyboards that I've ever felt in my life. But the box makes it look like candy 'cause it's called the Candy Bar keyboard, specifically, this is the Candy Bar premium, and it's actually a kit that you use to build the keyboard. This box is awesome. It actually has nutrition facts on the back. How sweet is that? So you've got, it says the Candy Bar is protected by a one-year warranty. It has 62 switches because the size is 40%. It's a 40% keyboard. That's a very small layout, smaller than a 10 keyless. Although this one does have a num pad, but only 40% of the size. Ingredients include a CNC milled and anodized aircraft grade aluminum case, FR four glass reinforced epoxy laminate copper, brushed aluminum switches of your choice and lots of love, baby. What a cool and cute box. (grunting) Oh look at that, and it's got this nice gold foil kind of box on the inside from, of course, The Key Dot Company. It has a nice (sighs) (box flipping) a nice fit (sighs) feel that? We're gonna be here all day just playing with this. What I have in this box is not what you would receive if you ordered this, okay? As a bonus, they sent us this awesome keyboard, which normally comes disassembled, and you put it together yourself. Which is a great gateway drug, if you're trying to get your foot into the door of the enthusiast mechanical keyboard community. But we didn't have time for that, so the nice guy there, he actually put it together for us. So I'm about to pull out a keyboard that is completely assembled in pink. It is a striking looking board for actually lots of reasons, kinda a lot to take in, starting with the color. There are multiple color options, of course, we have to get pink, which is actually called Hubba Bubba, because Linus loves pink. Other options include Laffy Taffy, Mint Chip and black. Very nice. And then another thing that's weird is the num pad on this one is on the left, cause this is the lefty layout, but you can get it with it on the right too. Then there's the split space bar. Now this is another thing that's optional when you're putting this all together, depending on the key caps you get and everything. But I like that because I think it's more ergonomic to use your strongest digits, to do a lot of the heavy lifting like space bar and backspace. I just, backspace is way up there. I don't like reaching up there with my pinky. It's just a waste. But when you have this thing in front of you in person, it's not even the look that catches you off guard, it's actually the weight. This thing is like a weapon, man. The whole thing is aluminum. It's crazy. This is the candy bar premium package, with a full aluminum case and plate inside. And you could just kill a man with this thing. It's insane. 3.62 pounds, what is that in sensible- 1,642 grams. And it's a 40% keyboard, that is crazy. There's a ton of keyboards that just crack 1,000 grams. This thing is like three times heavier than most keyboards, insane. Like if this were a cheapo keyboard like we see in some of the roundups that we've done in LTT, it would be like 500 grams and you'd be able to bend, you can't bend this at all. It's metal. (piece hitting table) Oh God. (laughs) That actually brings me to a, a thing I have to disclose here, which is you may have seen in my little typing test that I was kind of avoiding hitting the space bar key, and that's because they're not really going on there very well. And they don't sound as good. Like here's a normal key, (key clicking) very crisp and consistent. And then we get to the space ones, (key clicking) (key clicking) they're all different. And so here's why, these are prototypes. And since they sent this board to me, they've retooled it and fixed this issue. But basically like this one has like plastic in here just to keep it on there because it doesn't quite sit right. And it's a little bit askew as you can see, but I don't think that will be an issue for people who buy this. It's not like these things are just flying off, okay. But that's a good opportunity for us to check out what's underneath them. These are tangerines. They're a linear switch that just swept the category in our recent blind key switch challenge video. And for good reason, they're just like the smoothest switch in the game. Now of course, these switches and these key caps do not come with this keyboard, but they are optional additions that you can get. And I recommend them, they're awesome. But let's pop a couple more key caps off so we can start to get an idea of what it would look like if you did buy this, instead of having them send you a completely built one. So I'm gonna start by taking off the enter key because that lets us see this pink aluminum plate below. And you can also see this black screw right here. That's what's holding the plate to the PCB. And if I take out one of the switches, you can see the PCB under there. That is a matte black PCB. And there's actually some white silk screened on there. And the white is just instructional stuff to help you build it. It literally says like this side up. So it's a really a great beginner board if you've never ordered any kind of kit like this before, and you wanna try your hand in putting it together, this is really an easy one to do it with. So you're given an empty case like this, some standoffs that you put the PCB on, then you put on the plate with these screws that I showed you and then you put in the switches and they're just kale hot swap sockets. So it's real easy, the keys like this just plop right in. And that's a standard, so there's lots of lots and lots and lots of different key switches that'll fit in there. And then you get your key caps and of course you get whatever color you want and you can just totally customize a board that you think is wicked. Oh, and then after you're done assembling it, you're not quite done because you actually need to program the layout that you've chosen. So you know, see on this one, the arrow keys are all broken up and weird, but it doesn't have to be like that. You can put the key caps wherever you want. And then you program that QMK firmware and flash the firmware on the board to do whatever you want it to do. It might sound a little daunting, but it's not that hard. There's lots of tutorials and tools to use online. These key caps that are on here are dye sublimated key caps. So they won't fade. They won't get shiny from the grease on your hands. And these actually are a pretty good color match as well. And one of the things that's not included in the box are these stabilizers. These are GMK screw-in stabilizers. They are designed to the cherry spec and they are sold separately. And finally, though there is a USB-C port for a cable, there is not one in the box. Kind of a drag, but that's another thing that you can customize. You can get a nice curly cable or something cool. So now you'll notice on the website that you get these through group buys, and right now it's closed. But I'm told that there's gonna be more stock in April and that it shouldn't really be affected too much by the global pandemic right now. So if you're interested in this kind of thing, I recommend checking it out on their site and really, you really gotta feel it to believe it. They're very cool, if you've got the cash to dabble in this hobby. (keys clicking) Very nice, nice gift idea, too. (keys clicking) You know, like your your dad has everything already. (keys clicking) He doesn't have one of these, probably like the Laffy Taffy one. So thanks for watching Short Circuit today, guys. If you like this kind of stuff, subscribe, and if you like enthusiast keyboard stuff, let us know in the comments because we almost never cover this kind of stuff on any of our channels. So if you want us to dive deeper, sound the alarm. Let us know. See ya next time.",
    "transcript_keywords": [
        "Candy Bar",
        "Key",
        "key caps",
        "bar",
        "thing",
        "keyboard",
        "Candy Bar keyboard",
        "Candy Bar premium",
        "box",
        "nice",
        "lots",
        "candy",
        "kind",
        "space bar",
        "caps",
        "chocolate bar",
        "put",
        "space bar key",
        "switches",
        "PCB"
    ],
    "transcript_entity_values": [
        "40%",
        "one-year",
        "all day",
        "a ton",
        "1,000 grams",
        "three",
        "one",
        "only 40%",
        "USB",
        "500 grams",
        "the Laffy Taffy",
        "April",
        "Laffy Taffy",
        "The Key Dot Company",
        "LTT",
        "Hubba Bubba",
        "62",
        "GMK",
        "Candy Bar",
        "10",
        "the Candy Bar",
        "3.62 pounds",
        "four",
        "Mint Chip",
        "Short Circuit",
        "Tyler",
        "CNC",
        "Linus",
        "num",
        "1,642 grams",
        "PCB",
        "today"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "DATE",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE"
    ]
}