{
    "id": "XEqyQxeviVg",
    "title": "The Best Midrange Smartphones [Early 2018]",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-01-06T17:05:47Z",
    "video_url": "https://www.youtube.com/watch?v=XEqyQxeviVg",
    "category": "Science & Technology",
    "tags": [
        "best midrange smartphone",
        "best midrange phone",
        "best affordable smartphones",
        "best affordable phones",
        "moto x4 review",
        "honor 7x review",
        "htc u11 life review",
        "oneplus 5t review",
        "essential phone review",
        "moto g5 plus review",
        "mrmobile",
        "michael fisher",
        "android central",
        "best cheap phone 2018"
    ],
    "views": 610796,
    "likes": 11800,
    "comments_count": 1110,
    "description": "A thought occurred to me as I was reviewing the Galaxy Note 8 last year, and then it popped up again when I took a look at the iPhone X. A lot of people think you need to pay 900 to a thousand dollars for a good smartphone these days. And you know what? You dont.  For the past few weeks I've been using the Honor 7X, HTC U11 Life, and Motorola Moto X4, three midrange smartphones that bring a slew of special features not seen before in this price bracket  which runs from $200 to $400 unlocked. That's not the most affordable collection of smartphones can get, nor is this roundup at all exclusive  but at the top of 2018, I believe it to be the sweet spot between frugality and a solid Android experience. Join me for The Best Midrange Smartphones at the top of 2018!   [SPONSOR]  This video brought to you by Thrifter, a new way to save money by shopping based on value (and not hype). The fine folks over at Thrifter have sniffed out a great deal on a first-generation Moto Z for $270, which you can check out here:  And you can always visit Thrifter for great deals on everything from gadgets to home goods, at     [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  Honor 7X:   HTC U11 Life:   Moto X4:   Essential Phone:   Moto G5 Plus:   OnePlus 5T:    [ABOUT MRMOBILE'S BEST MIDRANGE SMARTPHONES 2018 ROUNDUP]  MrMobile's Best Midrange Smartphones 2018 Roundup was produced following several weeks with an Honor 7X, HTC U11 Life and Moto X4 provided by Honor, HTC and Motorola (respectively). The devices all received software updates during the review process, and were used on T-Mobile, AT&T and Project Fi.    [MUSIC]  Days and Days by Eternity Bro, available at Premium Beat:   Up Top by Tonemassif, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.thrifter.com/unlocked-moto-z-play-deal.",
        "http://thrifter.com",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/4hu",
        "http://mrmobile.tech/4hv",
        "http://mrmobile.tech/4hw",
        "http://mrmobile.tech/4hr",
        "http://mrmobile.tech/4hs",
        "http://mrmobile.tech/4ht",
        "https://www.premiumbeat.com/royalty_free_music/songs/days-and-days",
        "https://www.premiumbeat.com/royalty_free_music/songs/up-top",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Mr. Mobile] A thought occurred to me as I was reviewing the Galaxy Note eight last year and then it popped up again, when I took a look at the IPhone 10, a lot of people think you need to pay 900 to 1000 dollars for a good smartphone these days and you know what? You don't, I'm Mr. Mobile and these are my top picks for affordable smartphones at the top of 2018. (upbeat electronic music) Okay, I didn't just wanna make a list of cheap phones with this video, because even though you can walk into a Walmart and get a 20 dollar smartphone, it's guaranteed to be a pretty rough one, so I'm sticking to three phones I've been using for the past few weeks, the Honor 7X, HTC U11 Life and the Moto X4. These bring a slew of special features not seen before in this price bracket, which runs from 200 to 400 dollars unlocked, as always that means those of you on T-Mobile and AT&T will have an easier time with these, but I'll have some alternatives at the end for you Verizon folks. Starting at the low end in the so cheap, they're probably losing money on it category, the Honor 7X, 200 bucks gets you a bright, six-inch display at 18 by nine, a very fast fingerprint sensor and the biggest battery of the bunch and that power pack pays off too, several times during my month-long test period, I got to the end of the day with more than half a charge left over and the camera software is absolutely loaded, the sheer number of customizations on the 7X makes it the most versatile shooter up here and as you'll see when I show you all the samples together, the 7X probably wins the camera shootout on the whole too. Special shout out here to Huayra Hussman at Android Central for pointing out the built-in document scanner, excellent feature to have right out of the box, that's a terrific showing for 199, but keep in mind Honor had to hit that price point somehow, so here's the bad stuff, this is the older version of Honor software, EMUI5 and it kind of looks like an old version of IOS, even if you like the aesthetics, performance is inconsistent, you'll be humming along just fine for 15 minutes and then suddenly the thing will grind to a halt for no reason or an app will crash. My review unit had pre-release software running on Android Nougat, hopefully the promised update to Android Oreo will smooth some things out, updates will not help the lack of NFC or the old micro USB charging port though and they also won't do anything for this forgettable hardware design. Happily the other two phones breathe a bit more life into the design department, beginning with the U11 Life, starting at 349. Now unlike its two competitors, this phone is plastic, but until you pick it up, it'll fool ya with that reflective backplate, which evokes the glass of its higher end sibling, the U11, it also brings IP67 dust and water resistance, something not often seen at this price point and it ports the U11's most curious feature, you can squeeze the phone to launch certain apps or trigger certain functions or map different commands to short and long squeezes, maybe you'll find it useful, maybe you don't, but it's definitely interesting, making this possible is HTC Sense, a breezy, if dated interface and it's running Android Oreo out of the box. Speaking of the box, it also includes a pair of free Usonic ear buds, whose active noise canceling really won me over back when I reviewed the bigger U11, nice move throwing these in, HTC, you'll have to plug those buds into the USB port though, since the U11 Life is the only phone in this roundup not to include a headphone jack. Another negative, the battery is the smallest of the bunch and I could definitely feel it, this was crying for the charger by the end of every testing day. Also the display isn't quite as bright as I'd like, the bezels are big and finally, mushy buttons, I don't like mushy buttons. The priciest of the pack is also my favorite of the fleet, to me, the 400 dollar Moto X4 strikes the ideal balance of affordability and delight, this is the Motorola version, but it's so similar to the Android one edition, my impressions mostly apply to both. Getting the thumbs up, a striking casing design, that weaves a warped wave under the Gorilla Glass three on the back, it does an okay job of hiding fingerprints and doesn't sacrifice durability of a sort, IP68 dust and water resistance present and accounted for, the glass and metal construction gives it a weighty, rich hand feel normally found on phones half again its price and while Motorola's software may be getting on in years, it still packs some of the smartest shortcuts ever offered on an Android phone. Say it with me, chop chop to flashlight, twist the wrist to camera. Motorola peppers in just enough convenience to make life easier, without corrupting the look and feel of stock Android, battery life is quite good, almost as good as the Honor 7X, oh, and this is the only phone of the three with a Selfie Flash, if you're into that, but even an admitted Moto Bro like me has to see the shortcomings, first of all, this phone is trading on a legacy it doesn't live up to, the Moto X line of years past was an innovative and inspirational reimagining of the smartphone and this is not, in more concrete complaints, the software animations have been shortened to make the phone feel faster, but it only serves to make it seem a little manic, the Moto Display feature comes on seemingly at random, making this an annoying bedside companion and the camera, oh, yeah, we gotta do all the cameras together, transition man, do your thing. This camera shootout's gonna be quick, because if a camera is your number one priority, you are not gonna be wowed by anything in this price range. Averaging out the shots I took on the main cameras, I was surprised to find that the Honor 7X, yes, the cheapest phone out of the bunch usually gave me the sharpest, truest photo of them all, combine that with the feature-loaded camera app and yeah, the 7X is the phone I'd want with me, if I were taking photos. Just a quick addendum here, folks, I tried to get in a selfie shootout, before leaving for CES, but unfortunately the HTC U11 Life doesn't process selfies, I don't know what happened, it just stays in this HTR Boost processing loop forever, even after a restart. Also, while I have ya, I neglected to mention in the main video, that the Moto X4 is the only phone in this line-up with a wide-angle camera, it's not as good as you'll get on the LG G6 or LG V30, but it does give you a little more versatility in tight spots. When I did a similar roundup back in 2016, I tossed out a couple honorable mentions at the end and those brands haven't changed much. If none of these three does it for you, check out the Moto Z2 Play, it's a little over 400 bucks from Verizon, it's got most of the great stuff from the Moto X4 and it's also compatible with Moto Mods. The opposite side of the spectrum is the Moto G5 Plus, still probably the best all around experience you can get at 229 dollars. If you're okay with buying unlocked, but you want something with a lot more power under the hood, the Oneplus 5T is still probably the best value for spec seekers, while the Essential Phone deserves a look, if what you want above all is special hardware. They both are 499 and both have recently crossed the Mr. Mobile review desk, but before you go chase down those links, I gotta tell ya about Thrifter.com, Thrifter is today's sponsor and it's also a new way to save money by shopping based on value and not hype, use the links in the description to find smartphone deals and tons more on everything from gadgets to home goods at Thrifter.com. Here are the links I promised you to those other reviews, folks, check 'em out, please subscribe if you enjoyed this one and be sure to follow theMrMobile on Instagram to check out all the new tech coming out of CES 2018 in Las Vegas. Until next time, thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "Galaxy Note",
        "reviewing the Galaxy",
        "Moto",
        "phone",
        "Android",
        "Honor",
        "Android Oreo",
        "Life",
        "Moto Display feature",
        "camera",
        "Android phone",
        "running Android Oreo",
        "thought occurred",
        "dollar Moto",
        "make life easier",
        "phones",
        "end",
        "Honor software",
        "smartphone",
        "HTC"
    ],
    "transcript_entity_values": [
        "the U11 Life",
        "Android Oreo",
        "the Moto X4",
        "Walmart",
        "month-long",
        "Huayra Hussman",
        "Android Nougat",
        "Instagram",
        "U11",
        "a little over 400 bucks",
        "half",
        "349",
        "Galaxy Note",
        "499",
        "Moto Bro",
        "six-inch",
        "T-Mobile",
        "900 to 1000 dollars",
        "15 minutes",
        "Android Oreo",
        "the past few weeks",
        "AT&T",
        "2016",
        "400 dollar",
        "Android Central",
        "G6",
        "2018",
        "Thrifter.com",
        "200 to 400 dollars",
        "USB",
        "Usonic",
        "Moto",
        "HTR Boost",
        "Mobile",
        "eight last year",
        "Motorola",
        "today",
        "229 dollars",
        "first",
        "18",
        "these days",
        "Moto X4",
        "two",
        "more than half",
        "Moto Mods",
        "IOS",
        "Thrifter",
        "Oneplus 5",
        "years",
        "EMUI5",
        "years past",
        "Las Vegas",
        "nine",
        "V30",
        "CES",
        "the Gorilla Glass",
        "the Moto X4",
        "199",
        "HTC U11 Life",
        "LG",
        "Verizon",
        "200 bucks",
        "HTC",
        "NFC",
        "three",
        "20 dollar",
        "one",
        "Android",
        "the end of the day"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "MONEY",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "FAC",
        "PRODUCT",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE"
    ]
}