{
    "id": "XhEOpqwZeNQ",
    "title": "MSI GE63 Raider - 120 Hz Gaming Laptop",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-09-21T21:35:35Z",
    "video_url": "https://www.youtube.com/watch?v=XhEOpqwZeNQ",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "MSI",
        "GE63",
        "GE73",
        "Raider",
        "GS63",
        "120Hz",
        "G sync",
        "Nvidia",
        "GTX 1060",
        "GTX 1070",
        "GTX 1080",
        "Asus",
        "Versus",
        "Cheap Gaming Laptop",
        "Budget Gaming laptop",
        "Powerful Gaming laptop",
        "Best gaming laptop"
    ],
    "views": 728452,
    "likes": 13300,
    "comments_count": 1042,
    "description": "Dave2D review of the 15\" MSI GE63 Raider. The best gaming laptop from MSI for competitive gamers. 120 Hz Screen (3 ms) and GTX 1060 / 1070 configs Available Here -   More Info -   Music Credits: Background: Fili - Smooth Rides  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2ytnGDo",
        "https://ca.msi.com/Promotion/GE-Raider-series",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going? Dave2D here and this is the MSI GE63 Raider So the whole idea behind the Raider lineup is that they're taking higher-end components or higher-end features like 120 Hz screen and individually lit RGB keyboard, and they're sticking that stuff into a more affordable lineup and so that's how you come up with this, so the 62, the GE62 from last year was probably their best-selling gaming laptop because it was an inexpensive laptop with a GTX 1060 This is much improved across the board. So the stuff that's trickled in, that 120 Hertz panel looks amazing. If you've never seen one in real life you gotta see one because You can't showcase how cool these things are or how good they are for gaming just by watching these videos, you gotta see it in real life. The new individually lit RGB keyboard is pretty crazy and the last thing they're going for is just improved performance across the board so because of the improved thermal solution, you can now stick a GTX 1070 into this chassis. So at this price point you can expect a certain level of build quality right? And it's there for the most part The top panel is metal. It's got that brushed finish, and it looks pretty good I don't love the red dragon, but whatever, and the keyboard deck is metal as well There's no play or soft spots or anything It's a very well-built laptop. The bottom panel is plastic, not that it's bad or anything. It actually feels well-made but it would have been nice if it was metal. Ports election is as expected There's three USB-A's and a USB-C, but it doesn't support Thunderbolt 3. Okay first I'm going to talk about the things that I do like. The screen is really good It's 120 Hertz screen, looks good, the color accuracy is there, the brightness is there It's a great screen for gaming It has a 3 ms response time, which is actually the fastest laptop screen on the market right now I'm obviously not a pro gamer, but games feel incredibly fluid on this display It is a TN panel, but that's how you're getting the super fast response rate And it's great image for a TN panel. The one thing I would have to complain about though is that because it's a TN panel, the viewing angles aren't as good. The moment you tilt it on any axis There is noticeable color shift The keyboard is also something that I really like. Just base keyboard itself is very comfortable to type on, great layout, Good keystroke, the RGB lighting on this thing is seriously the most comprehensive lighting system I've seen on a laptop keyboard. You can light up every single key That's not that new But there's like a whole bunch of features plus there's a hardware button here to switch between the different configurations on the fly. The trackpad is surprisingly good. It uses Synaptics drivers Which was kind of disappointing, but it feels really good. The gestures are a little off like, they're not super accurate But the tracking is good, otherwise, and the dedicated hardware buttons are nice. Now I think the best thing about this laptop is actually its performance, so this thing's running at GTX 1060 You can get a 1070 but the 1060 runs really well and performance in light and even moderately demanding games is just amazing with this 120 Hz screen. You can obviously play more demanding games But you won't be able to show off the screen as nicely. So that's one of the things that I think this whole laptop industry has been shifted towards You want to be able to showcase your amazing graphics cards by getting really high refresh screens if you're not, if you're capped at a 60 Hz screen there's no point in having a GTX 1080 on a laptop, like you're not able to see those extra frames that your card can push out so this is a really nice combination The fan noise is also very acceptable on idle. It's pretty quiet. On load, it's not too bad, but if you want to, you can hit the Cooler Boost button And it'll just crank the fans to max, and this will give you the best possible frame rates It's super loud, but if you're rendering a video or playing something That's just really intense, you'll want to hit that button and the fact that they have it is really nice I wish more laptops had something like this. The thermals on this laptop are good It has seven heat pipes in there which is pretty nuts I can't speak for the GTX 1070 configuration, but on this one, the one with the GTX 1060 There's no throttling and the external temperatures are very comfortable as well There are a few things that I dislike about this laptop, and they're not super important But I feel like I should mention them in case it affects your purchase decision. First are the speakers so MSI markets these things as having three times the size of their old speakers And they are really large if you look inside, they almost look like batteries, but they still don't sound great They sound kind of average. I mean they sound like a $1,200 gaming laptop would. I was expecting something more substantial because of how large those speakers are but they still sound very normal to me I wasn't particularly impressed. The other thing I don't love is the battery life It's a 51 watt hour battery And I'm getting just over three hours of use with the screen at 250 nits and that's kind of below average Considering all the components in here and it doesn't have G-Sync, so this panel is just a simple 120 Hertz panel It doesn't have G-Sync so it does have Optimus, but even with that technology... (sigh) Battery life is a little short It doesn't affect me because I'm not using this for like, extended periods of time when I'm out there But for people that wanna use this for school or whatever, you're gonna have to bring your charger with you, because three hours is not going to cut it. The last thing I dislike about this laptop is the accessibility or the lack of it. Now MSI laptops are not the easiest ones to open They usually make it a little bit more difficult, and they often have a sticker That says you know, don't open this thing, but this particular laptop is extra hard, and it sucks because inside there There's two NVMe slots, There's one SATA drive and two RAM slots, so there's a lot of room for upgradeability and stuff But it's very difficult to get in there without Chipping or breaking the frame, and because this is a review unit I don't want to go ham, just crack the thing But that's basically it a few things that I dislike about it, but the overall laptop I really like it. I think MSI is gonna sell a lot of these. If you're interested There's a link down below with the most accurate pricing. I think these start at $1500. They go up as you kind of add more stuff to it. Hope you guys enjoyed this video! Thumbs if you liked it, subs if you loved it! See you guys next time!",
    "transcript_keywords": [
        "laptop",
        "lit RGB keyboard",
        "thing",
        "good",
        "screen",
        "individually lit RGB",
        "panel",
        "GTX",
        "RGB keyboard",
        "things",
        "keyboard",
        "Hertz panel",
        "lit RGB",
        "Raider lineup",
        "RGB",
        "gaming laptop",
        "Raider",
        "MSI",
        "Hertz",
        "MSI laptops"
    ],
    "transcript_entity_values": [
        "51 watt hour",
        "1060",
        "three",
        "G-Sync",
        "1070",
        "Hertz",
        "Raider",
        "USB-A's",
        "NVMe",
        "one",
        "seven",
        "just over three hours",
        "Synaptics",
        "three hours",
        "First",
        "RGB",
        "60 Hz",
        "GTX 1070",
        "TN",
        "GTX",
        "120",
        "two",
        "3",
        "120 Hz",
        "1,200",
        "Optimus",
        "RAM",
        "1500",
        "1080",
        "250",
        "Thumbs",
        "last year",
        "MSI",
        "62",
        "Thunderbolt 3",
        "max"
    ],
    "transcript_entity_types": [
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "TIME",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "PRODUCT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON"
    ]
}