{
    "id": "XhLsbpFGNOg",
    "title": "TOP 5 iOS 17 FEATURES!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-08-19T15:43:28Z",
    "video_url": "https://www.youtube.com/watch?v=XhLsbpFGNOg",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 271550,
    "likes": 9501,
    "comments_count": 348,
    "description": "My favorite new iOS 17 features!   PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey friends, we are getting closer and closer to iPhone season, which means iOS 17 will be officially released to everyone not just the public developer beta. So I've been using iOS 17 now for a while and I'm just gonna show you my top five favorite features. There are a bunch more and I did do a further in-depth video, if you wanna check that out, but now, that I've been using it for a while, this is what I've been liking the most and I'm not gonna lie, it is the stickers. So in iOS 17, you're now able to make stickers out of photos and live videos. Live photos, not... Well, they're technically videos, but they're live photos. So you make a little live photo here. So I'm gonna go in and I'm going to turn on live photo. Live photo is on. The interesting thing about doing these is you kind of have to start the action before you hit record because the live photo records shortly before you hit record and then after. So it's kind of an interesting thing, but once you get it, you get it. I'm gonna start waving. So now, we're gonna go into my messages. We're gonna go into the stickers and here's ones that I've made before. I'm gonna go in and I'm gonna make a new sticker. It's so easy that it almost just hurts in my soul as like a designer how incredibly easy it is to do things that used to be very processor intensive, time intensive, and now, it's just like that, that's it. Like we go like this and I send it. It's so easy, I freaking love it. I can even go in here and make this even bigger. I love it, they're so great. Now, what's also interesting is you can add different types of features, so you can make these stickers look a little bit different. So this one I'm just gonna take a regular photo, add effect, so you can do like a little outline, you can make it into a comic, a little puffy sticker, or even a shiny sticker, which I think that I like the shiny sticker, so we're gonna go with that and that's gonna be my shiny sticker. It's just cool 'cause you can do this with any photo. So let me find a picture of my dog, I'm gonna make him into a sticker. Add that right on top of hers. Look at Maddie, he's walking. (laughs) This is just adding so much more fun and interactivity to iMessage and I'm also really excited about the new keyboard, the predictive text. It's just felt so much smoother. So hello, Jenna, I am testing the keyboard. It just feels better, like it just feels smoother. The autocorrect isn't trying to correct things that it shouldn't. It's hard to explain until you actually use it. I didn't think that it was gonna feel different, but it does have a different feel to it. Also, it is kind of weird 'cause I sometimes type with like two fingers like this. Like wow, look at me type. Digital touch, I actually forgot about that. Oh my, does anybody remember this? That was like a thing. I don't think... I don't really know, does anyone use that? I forgot about it. So this is something I actually can't demo here, but I can't wait for this. It is the ability to leave a video voicemail when you FaceTime somebody and they don't answer, but now, you will actually be able to leave them a video voicemail and I think this is such a cool idea because obviously, if you're calling someone, you are able to leave a voicemail. Speaking of voicemail, this is also one of my favorite things is the voicemails now will auto transcribe. So I hate listening to voicemails. I also don't like listening to voice memos because I don't know, I get distracted, I don't know what someone's saying, I need to be able to have like an account of what they're saying, but the transcriptions on the voicemail I think is key because you can also choose to pick up or you can just continue letting them leave that voicemail and you can just read it as they're talking, which is pretty awesome. They have an updated thing called contact cards, which allows you to customize your contact card. So if you make a phone call to somebody, you'll be able to customize your photo and what's really cool is if you do have, I guess, multiple contacts, like if you're at a business event, you can have a business contact and you can also have a personal one. So maybe you wanna give people your phone number or if you have a business number, you might wanna give them that separate card and it's really great because you can choose which information you can share with people even if you don't want to share information with them. You can decide to leave off what you don't want to share. So here's a few that I made already. You can adjust the font, your photo, the colors. So we're gonna create a new one just so I can show you how this works. We're gonna go into our photos. I'm gonna find a photo of myself. Oh, look at this, I've already got like a ton of pictures that it suggested, so this is cool. Oh, my gosh, I miss Hawaii, Hawaii is a wonderful place. So here we go. Look at me just chilling at the beach. We're gonna change this to a different font, I kind of like that one, you can pinch a crop, so maybe we will center myself. I can preview my poster and I can choose that the next time that someone calls. I needed a prop for this next one. This next one is called standby mode. You may have seen this at the Keynotes where they were talking about it. So basically, you have a stand and it charges your phone at the same time and when you put it like this horizontal, it will automatically switch to standby mode, and now, this is showing some photos, this is from south side of Pittsburgh, that's my friend Susie, and we can scroll through these, that's a terrible photo, we're gonna just not use that one. This is a nice photo from a hike that I went on and Maddie, there he is, I knew when he was a baby he had short ears. Now, you can swipe through and you can get different watch faces. This reminds me of the standby mode on the Apple watch that's why I said watch faces. This one's fun. I added a bunch of widgets. You can have reminders and you can also swipe on each one of these to change it to be something different. So depending upon what you want your nightstand to look like, that is something that you can do. Something else that I haven't been able to demo yet is AirDrop over the internet. I use AirDrop for absolutely everything. Like I AirDrop photos, I AirDrop videos, content from my phone to my computer, from my computer to my phone, and it's one of my favorite things ever, but if you've ever AirDropped someone before and you've kind of went out of range of their phone, it fails, but now, what happens is that content will then be uploaded to the internet so then as the other person walks away, they can connect to the internet and that will continue to transfer when they're back in reception, so you don't actually have to be near them anymore and that is gonna be so awesome for events and just even transferring files and photos here even in the office, like if I decide to go outside, like I don't have to worry about something stopping AirDropping like it'll just magically work. So there's so much more in iOS 17, but those are a few of my favorite. I feel like I could probably sit here all day talking about it, but before we know it, my friends, it will be here and we'll all have access to it if you do have a compatible device, and then it's gonna be iPhone 15 time. I am actually just I don't... Where did this year go? I have no idea. I would love to hear from you guys though. What are you looking forward to most in iOS 17 and what is something that you're most looking forward to in the new iPhone 15? Thank you guys for watching. Don't forget to like, comment, and subscribe and be sure to hit the bell to be notified when I post new videos because it is almost 'tis the iPhone season, and you guys know that is my favorite time of year. So I'll see you here, bye.",
    "transcript_keywords": [
        "public developer beta",
        "photo",
        "live photo",
        "photos",
        "live",
        "make",
        "sticker",
        "developer beta",
        "iOS",
        "officially released",
        "public developer",
        "voicemail",
        "closer",
        "live photo records",
        "phone",
        "stickers",
        "shiny sticker",
        "closer and closer",
        "kind",
        "leave"
    ],
    "transcript_entity_values": [
        "iMessage",
        "all day",
        "iOS 17",
        "AirDrop",
        "AirDropping",
        "Apple",
        "Hawaii",
        "iPhone",
        "AirDropped",
        "Keynotes",
        "iOS 17",
        "FaceTime",
        "Digital",
        "Maddie",
        "five",
        "Pittsburgh",
        "this year",
        "two",
        "Susie",
        "this next one",
        "Jenna"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "LAW",
        "PRODUCT",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "EVENT",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON"
    ]
}