{
    "id": "XHT1Y3LHx20",
    "title": "Do $450 gaming headsets make sense? - Master & Dynamic MG20 Gaming Headset",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-01-05T20:25:39Z",
    "video_url": "https://www.youtube.com/watch?v=XHT1Y3LHx20",
    "category": "Science & Technology",
    "tags": [],
    "views": 254594,
    "likes": 9590,
    "comments_count": 698,
    "description": "Learn more about Volta GIGA today at   When you hear gaming headsets, sometimes you think it is really outlandish, RGB, and overpriced without the quality attached. Master and Dynamics's MG20  is interesting as it has a high gaming tax price tag, but the performance might match it.  Check out the Master & Dynamic MG20 Gaming Headset at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------  0:00 - Evil James? 0:21 - Unboxing 3:08 - Exterior first impressions 6:52 - Sponsor - Volta Giga! 7:17 - Pairing the headphones 7:44 - Gaming impressions 9:00 - Microphone impressions 9:37 - Music impressions 10:10 - Trying out controls 10:50 - App impressions 12:55 - Final thoughts",
    "description_links": [
        "https://geni.us/r91ag",
        "https://lmg.gg/tZy3x",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "(intense music) - Imagine a gaming headset, but expensive. That's the Master And Dynamic MG20 Wireless Gaming Headset or headphones, as they say. You can use them for casual listening and for gaming. Let's check it out. Whoa, that sleeve just wants to slip right on outta here. Cool case, it looks like a type of cardboard that is, I would say low impact, more sustainable. It looks reused, I like it. Interesting. It's just the headphone and then a boom arm for the mic. I don't wanna get too, ah, distracted by those right now though. Let's do the unboxing, let's focus. Here's the microphone. Looks like some, can you see it? There's some shmoo on there I feel like I could scratch off. It's a flexible, quite flexible mic boom arm you can use the headphones with or without it, you can even talk with or without this. So, I'm gonna try a sound test for both mic modes later on. There's a sub box and the sub sub box. Let's deal with this first. Literature, a quick start guide. Not gonna use that. And a purse, bag, man sac. This is kind of interesting. It's canvas. There's a zipper pocket at the bottom for accessories for like the mic boom arm. It's actually soft on the inside. It's softer than the canvas exterior. Zipper is really nice. And then the top opens, this feels like a magnet. How do they work? I don't know, but then they got some tags there too. Your microphone is meant to go in there, not in this zipper pocket, that zipper pocket's all bonus, baby. And it's not so deep that you lose it. This is a soft case. You could still sit on and break these headphones in here, but they're gonna protect them from scratches, abrasions and they're gonna hold all your accessories together. So, it's still appreciated. Come on out now. Now, these headphones come in two colors. This is, okay, put it in the other way, guys. This is actually like a problem. Oh my God, I'm defeated. It's out. I would recommend maybe going plug side down. Oh, whoa, I didn't notice this stuff before. There's actually a little pop filter for the boom arm. They don't show that in any of their marketing, which is very minimalist. We also have a dongle, the low latency adapter for g-g-gamers. And then we've got two cables. One of them is USB-C 2A and the other, oh, wow. Hold on. Is USB-C headphone too, three and a half millimeter adapter for probably not your phone and then there's also the splitter. If you've got separate mic and headphone ports on say your motherboard. I'm gonna test with a phone later. These aren't designed for the phone. They are 32 ohms of impedance, whereas some more mobile-focused headphones would be say, 18 ohms. That's what my Audeze Sine are, but we're gonna try it anyway. They may just not go that loud, but we'll find out. Now I was hoping that we got the other color. This is black. I think they call it onyx. There's also a white, which I thought looked really smart. I'm noticing that these do not rotate all the way flat. They actually don't rest on the table completely. It's kind of like the camera bump on your phone. That may be sufficient though because you just need them to lay down on your chest. And they do that. These headphones are sweet because they're gaming headphones, but they actually look cool. So, I think a lot of gaming headphones, they look a little, plastic-y, clunky, a lot of RGB on them, which is cool for some people, but other people want a more minimalist, Nordic, mature kind of look. They are of course, very expensive, $450 U.S., 450 euros. But, here's what you get for that. Magnesium ear cups that are, they feel very light. The action of the rotation is very smooth. They're not very creaky. They're quite silent. That is huge. The ear pads, these are lambskin. They feel very soft, like a leather jacket I bought from Moores as a high schooler that I had for many, many years. They're an over-ear design with 50 millimeter beryllium drivers. You can see them there. And these go on just, yep, magnetically with some, see those keynote circles there? So yeah, a little bit of a friction fit and a little bit of magnet action. Then the headband, it has alcantara on the inside. Not a lot of padding. This really does feel like it could compress maybe after an hour of wearing it. And maybe this headband would dig in. They weigh about 320 grams once you get the mic arm on there, that boom arm just clicks in pretty snugly. The plug part goes in and then there's an additional little click. And you can kind of see that there's this little plastic bite out of it that you can feel that extra click because of that. The action of the adjustment that's what you're getting. So, your head can be that much bigger than mine. My head is I would say small to medium. You can actually feel that this headband is ribbed on your head. Those are speed holes, guys. That's for radiating heat. Now, I noticed there's buttons on the sides, but I didn't yet touch them. Each side has a wheel. This side's wheel is ratcheted. You can actually hear it click while you're wearing them. This side's wheel is also ratcheted. So, this one is for appears to be volume. This appears to be the volume of your mic, your speaking volume versus the volume that you hear. There's a button here. It looks like it could be on off. It's pretty tactile. It's not too cliquey. And there's a button over here that says 7.1 and another button that says Bluetooth. So you don't need to use that dongle that it comes with. And then there's, I guess that's an indicator light. No, that's a microphone. That's cool, it actually has this little grill over it. Looks really nice and premium. These are an over-ear design. So, my ears are completely inside of the ear cups, not an on-ear design, but my ears do not touch the drivers themselves, which is a big pet peeve of mine and it does happen quite frequently, at least on one of my ears. So, it sticks out more than the other one, I guess, but they're not touching. And because the ear cups are pretty rigid, these don't really compress too much. I feel like even if I was, for some reason laying on my side, I still wouldn't have my ears really touch the drivers. Comfort, pretty good. Caliper pressure, which is like this way, not too high. Maybe if you had a big melon, they would be, but they don't squeeze too hard. They do move quite a bit. Don't take these to the gym and try to bench press stuff. Cool, well I guess it's time to hear what they sound like. Right after this message from our sponsors. Thanks to Volta for sponsoring today's video, clean up your desk and declutter your workspace with the Volta GIGA Charger, which can charge four devices simultaneously. It comes in either 130 watt or 200 watt configurations, and they also have the anchor three-in-one, magnetic wireless charger stand. They have express worldwide shipping with a 30-day money back guarantee. So, learn more about their chargers today at the link below. You can probably even charge these puppies. Is there gonna be a tone or something? Whoa, there's all these like THX sounds happening. Ah, okay, it's pulsing. I guess that means, yeah, you can see that. It's trying to pair that way, but I got this dongle going. Do I have to press this Bluetooth connection button? It made like a sword into a sheath sound like, shhk. I hear nothing. Finally, I can hear something through these headphones. All right, I got it. Okay, finally listening wirelessly. Whoa, cool. I can already tell from just taking my mouse, mousing over these interface elements, you know, they have that really cliquey kind of Rolodex sound. I can tell that the soundstage is kind of wider than I'm used to in a headset. It just sounds like those clicks, they're not just like right in my ear. They're kind of, they're out here somewhere. It's more spacious. That's sweet. Make it a free for all. - Can you hear us? - I can't hear you guys really. You guys are talking about me? Yeah, these are pretty isolating. They say that they have a balanced kind of closed slash open design. I don't really know what that means looking at it. I do see on the ear cups that there's these, what I would think are vents right here. So, maybe that's contributing to a wider, more natural soundstage, which is what open backs are characteristic of. But, these are mostly closed. And, to the extent that they're pretty isolating, I couldn't really hear you guys at all. These are a little bit warm, I'll say that. They're already a bit warm 'cause they do seal pretty closely around my ear. And they have that lambskin as we talked about. Well, I'm definitely immersed. Oh no, no, no. (guns firing) I got killed by that guy from rusted aldrin. These headphones are sweet though, sound-wise this isn't a review just an unboxing, but these don't like automatically suck. Man, I am slaying. Oh God. So, this is what it sounds like with the internal microphone array ,no boom arm. That's what I've been using this whole time. Now, let's try plugging in the boom arm. And I got the boom arm just totally straight, wind sock on. It's not pointing toward my mouth at all. That's what it sounds like. Now, I'm gonna angle it so it's like basically right, one finger width away from my lips. And that's what that sounds like. And that same configuration, but with no wind sock sounds like this. Peter penis applause, Peter Parker, pickles, pepper, blah. Peter Parker, pickles, penis, pickled penis in a jar. No! That's what that sounds like with a sock on and off. Sweet action. I'm gonna try using it with my phone now. Let's see if I crank it. I'm at three quarters. It's already louder than I would normally use. So yeah, your phone can drive these fine. Let's see maxing it out here. Oh, oh, don't max them out, guys, not good. Maybe with a better amplification that'd be okay, but like that got kinda rough and muddy. Distorted when I turned it up all the way. The mids are super clear. The vocals are coming through nice. I haven't made a determination on the bass yet. It's definitely present. I just don't know if it's very tight. So, let's do some experimentation here. Do they have any controls on here? Can I pause and stuff? I have this multifunction button. What does that do? Tapping it paused. Tap it once more to play. If I go double tap. Oh, it does go to the next track. I wonder if I go one, two, three. Uh, I think that just did next again. One, two, three. No, you can go back. Little finicky though, it took two tries. And if I hold it, Google assistant? No, it just paused it. Oh, there is the Google assistant. Okay. So yeah, it can do everything that you would expect with that multifunction button. But many of those things took me two tries. Let's see what's up in the app. We're on English, bro. Oh, one thing I wanted to try is if I take them off, will they pause? No. They said that they have detection so that you get longer battery life 'cause they advertise 22 hours of battery life. 50% of that you can get in half an hour, but they say that they preserve battery life by pausing automatically and these definitely did not. I can still hear Peter McCormick talking here on his podcast. Got a battery level here. Oh, there's an update available. Wow, I guess I gotta take that. (light music) Okay. 25% done. (light music) it went like thrash, grunge, new metal. (light music) Let's go update, let's go. (light music) Update complete, yeah. All right, I got a battery meter, 100%. I'm up to date. What do we have in the hamburger menu? Quick start guide, support, legal links, language, nothing I want. Settings, sound profile. They give us some EQ here. There's no EQ flat, which is the default. That's nice, that's what it should be. E-sport, now again, this is a gaming headset. It's not just headphones. That's why it doesn't just have genre based EQs. Bass boost is cranking. It's kind of V shaping it. It's cranking the bass and lowering the mids while leaving the highs flat. And then can I do whatever I want on here? Is there a custom? Come on, man. Auto off timer, never or 10, 30, 60 minutes, three hours. Your device will power off if the empty 20 detects is not being worn. Oh, okay, so that's why it wasn't pausing. Okay. So, it's not ever gonna pause when you take them off, but it will automatically turn them off. So, if I set that to 10 minutes and then I take them off and I let them sit here, they'll power down after 10 minutes if they detect that they're still not connected on my head. Okay, that's cool. Restore app default settings. Dude, there's barely any settings. I'm kind of disappointed by the app. I really wished that I'd be able to mess with the EQ. That's it? Hey, I guess I'm glad it exists, better than nothing. Overall then, I think this is a good headset. I think the sound is good enough. These are expensive, but they're also versatile. You're not limited to just using this headset as a headset that never leaves your desk. You can ride transit with it and just treat it like your music listening headphone. So, for that reason, I think the sale price is less daunting. There's also an aesthetic you get with these that is worth a premium above, I dunno, your Turtle Beach Plastic Fantastics. Because if you care about the look of your battle station, you have a really cool prominent, headphone hanger and a really minimal aesthetic. There needs to be gaming headsets that match that aesthetic and this is them. Overall I think they sound okay. I would rather buy these than the Apple AirPods Macs. - Really? - Which are, I mean, those are more expensive than these and less versatile. These are pretty good. I think they're worth exploring. Someone could do a deeper exploration to the sound quality, look for reviews for that. But these, they don't suck. The price isn't outrageous for what you get. This little thing just flew into my, (blowing), it's stuck on my skin now. Just stay on there. Watch \"Short Circuit\" forever, guys, see you later.",
    "transcript_keywords": [
        "boom arm",
        "headphones",
        "kind",
        "sound",
        "Master And Dynamic",
        "arm",
        "hear",
        "sounds",
        "boom",
        "mic boom arm",
        "ear",
        "pretty",
        "Cool",
        "mic",
        "gaming",
        "headphone",
        "headset",
        "feel",
        "guys",
        "ear cups"
    ],
    "transcript_entity_values": [
        "10 minutes",
        "450",
        "100%",
        "18 ohms",
        "three",
        "One",
        "an hour",
        "30-day",
        "one",
        "U.S.",
        "Turtle Beach Plastic Fantastics",
        "Google",
        "about 320 grams",
        "Peter Parker",
        "three hours",
        "22 hours",
        "half an hour",
        "Nordic",
        "Audeze Sine",
        "130 watt",
        "7.1",
        "450 euros",
        "three and a half millimeter",
        "Rolodex",
        "three quarters",
        "10",
        "50 millimeter",
        "first",
        "32 ohms",
        "Bluetooth",
        "USB-C 2A",
        "Peter McCormick",
        "two",
        "25%",
        "four",
        "EQ",
        "60 minutes",
        "50%",
        "RGB",
        "200 watt",
        "Volta",
        "Peter",
        "Moores",
        "30",
        "20",
        "today",
        "English"
    ],
    "transcript_entity_types": [
        "TIME",
        "MONEY",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "TIME",
        "TIME",
        "TIME",
        "NORP",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "TIME",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "LANGUAGE"
    ]
}