{
    "id": "XIsuu9VW_z0",
    "title": "The Verge’s favorite gadgets from 2018",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-12-21T14:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=XIsuu9VW_z0",
    "category": "Science & Technology",
    "tags": [
        "top gadgets",
        "2018",
        "the verge",
        "pokeball plus",
        "pokemon go",
        "apple watch series 4",
        "apple watch 4",
        "series 4",
        "google home hub",
        "home hub",
        "aflac duck",
        "aflac",
        "sony a7 3",
        "sony a7 iii",
        "a7iii",
        "sony headphones",
        "headphones",
        "sony",
        "cool gadgets",
        "gadget",
        "new gadgets",
        "gadgets on amazon",
        "new technology",
        "tech",
        "gadgets",
        "latest gadgets",
        "2019",
        "new phones",
        "smartphones",
        "new tablets",
        "tablets",
        "new phone",
        "smart home",
        "pokemon",
        "technology",
        "top 10",
        "top 5",
        "latest updates",
        "apple",
        "google",
        "android",
        "iphone",
        "verge"
    ],
    "views": 242993,
    "likes": 4765,
    "comments_count": 194,
    "description": "Weve reviewed a lot of tech gadgets in 2018  its been quite a busy year. So for our end of the year roundup, we asked The Verge team to tell us what their favorite gadget was this year and why. These aren't the best gadgets of the year, theyre just our favorites.  Read more about our favorite tech here:   Here are some links to the products you saw in the video:  PokeBall Plus:  Apple Watch Series 4:  My special Aflac duck:  Google Home Hub:  Sony 7 III camera:  Sony 1000XM3 headphones:   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Listen to our podcasts:  Read More:  Community guidelines:  Wallpapers from The Verge:   Note: we sometimes place affiliate links directly to the best deals in our video descriptions, so we may earn a commission if you buy something.  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2SfRGw2",
        "https://amzn.to/2SMrAUW",
        "https://amzn.to/2X57cgX",
        "https://fave.co/2UX41XP",
        "http://bit.ly/2DEdOdm",
        "https://amzn.to/2tk5ISq",
        "https://amzn.to/2SRDAo5",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- This year we've reviewed a lot of gadgets, like a lot. We've looked at new phones, new tablets, new speakers, new cars, new wearables. If you can name it, we've probably reviewed it. So for an end of the year roundup, instead of doing a best of list of categories, we decided to talk to a bunch of Verge staffers and ask them what's their favorite gadget of the year and tell us why. These aren't the best gadgets, these are the Verge's favorites. (upbeat rock music) - This is the Poke Ball Plus and this is my favorite gadget of the year, which I wanna first say I don't usually spring for all the bells and whistles of most gadgets, but this is exactly the kind of kitschy bullshit I love. Because really it doesn't do that much, it's a controller. But the thing is, you can also put a Pokemon in here and then walk around with it and the ball makes cute little noises. It's not that this is especially impressive in terms of what it does, but I really do like the feeling of having a Poke Ball in my hand. And as silly as it seems, this is exactly the kind of thing I would've loved as a kid. Is this Useless 90% of the time? Absolutely. Is this the kind of thing that's very niche? Totally. Is it also the kind of thing that's very nostalgia-driven and that I'm gonna pay 50 bucks for? Yes. Nintendo put a price on nostalgia and I'm very willing to pay it. - Hey, I'm Christ Welch and my favorite gadget of 2018 is the Apple Watch series 4. Now I've owned a lot of smart watches, Android watches, Samsung watches, and this is the first watch I've actually kept. There are two reasons for that. One is the big screen. These small bezels make the Apple Watch Series 4 feel like a true computer on your wrist, that's something that no other watch has really done for me before. The thing I like most about this Apple watch is speed. Every old Apple watch felt slow. I would tap an app and wait 10 seconds and then just pull out my phone 'cause I was frustrated. This time, Apple nailed that. Apps are quick. You tap things and they happen as you expect. That's a big deal for a smart watch. - So this is my favorite gadget of the year. It's called the My Special Aflac Duck and it's a weird pick because it isn't connected to the internet, you can't buy it, and it's made by Aflac, the insurance company. But here's why I love it. It's being built to giveaway to children in hospitals who are battling cancer and feel like they have a friend in the hospital to go through the experience with them. And I know it seems weird for an insurance company to be making toys for kids, but it doesn't have any Aflac branding on him and it's being used for a really good cause. 2018 has been a really weird year, so to me this is a really good feel-good gadget that proves to me tech can still do good. - My favorite gadget this year is Google's little Home Hub. Now the Home Hub is a great smart speaker, though you maybe don't wanna use it for a lot of music listening. But it can answer facts, set timers and alarms, control smart home gadgets, and even watch videos on YouTube like this one. But the reason I love it so much is because I can link my Google Photos account to it. So whenever I look at the Home Hub, I see a picture of my kids of the thousands of them that I've got stored in my account. And thanks to the auto-adjusting display on the Home Hub, the pictures really look great, they look like a printed photo in a frame. Now the Home Hub is not the biggest smart display you can get, it doesn't have the best sounding smart speaker either, but it's the one that makes me the happiest when I look at it, so it's my favorite. - This is the Sony a7 III and it's my favorite gadget this year. It's really fast, takes vivid photographs, and it has a really good battery. This is a balance of portability and specs, and power that no other mirrorless camera has come across. When shooting in the city, I really appreciate the exposure dial. It makes adjusting settings like exposure really easy to do on the fly. Also, the a7 III's really well-suited for action and sports photographers. It has 693 auto focus points and shoots up to 10 FPS. So it's a really fast camera. Hopefully though next year Sony will fix the menu system. And until them, it'll remain my favorite gadget. - My favorite gadget this year is Sony's 1000X Mark 3 noise-canceling headphones. They're not like the biggest change over last year's Mark 2 model, but it's a lot of small and subtle things that just make them really, really great. The biggest is that they made them so much more comfy, they added like a ton of padding around the ear cups, they redesigned the band, they added more padding up there too. And you can just wear them forever. I wore them for like 15 hours straight on a flight to Germany and they're just fantastic. My ears didn't hurt at all, even with these giant glasses. They're just great. And Sony made the noise canceling better too. So everything sounds like a library now. Your train sounds like a library, your plane sounds like a library, your library sounds like a library. And the biggest thing, at least for me, is that they charge with USBC. Take the same charger from your laptop, from your phone, from your Nintendo Switch, and you can use them to charge your headphones. It's wonderful, it's great, do more of this please everyone. Please. - So there you go, those are some of our favorite gadgets and products of 2018, the year that felt like it was never going to end. Let us know what your faves are for 2018, what you're looking forward to in 2019. Maybe next time we'll have a 5G phone to talk about or one that folds in half, but until then, we'll see you next year. So what are we doing here? My least favorite gadget is definitely the Red Hydrogen phone, I can't believe that came out this year. But fortunately, Verge Science on YouTube also launched in 2018, so if you haven't checked it out, go to youtube.com/vergescience. (energetic rock music)",
    "transcript_keywords": [
        "favorite gadget",
        "Home Hub",
        "year",
        "Apple Watch",
        "favorite",
        "gadget",
        "Apple Watch series",
        "Watch",
        "Home",
        "Apple",
        "Hub",
        "Poke Ball",
        "gadgets",
        "thing",
        "smart home gadgets",
        "Verge",
        "smart",
        "Verge favorites",
        "Sony",
        "lot"
    ],
    "transcript_entity_values": [
        "Home Hub",
        "Aflac",
        "next year",
        "like 15 hours",
        "Christ Welch",
        "USBC",
        "Android",
        "the Apple Watch Series 4",
        "an end of the year",
        "Apple",
        "Germany",
        "the Home Hub",
        "Verge",
        "50 bucks",
        "Google",
        "5",
        "Nintendo",
        "693",
        "YouTube",
        "the Home Hub",
        "10 seconds",
        "a Poke Ball",
        "the Home Hub",
        "Verge Science",
        "Samsung",
        "thousands",
        "half",
        "1000X Mark 3",
        "two",
        "4",
        "One",
        "Google Photos",
        "this year",
        "2019",
        "Pokemon",
        "2018",
        "the Apple Watch",
        "the Poke Ball",
        "Sony",
        "YouTube",
        "first",
        "a really weird year",
        "last year's",
        "Mark 2",
        "the year",
        "Nintendo Switch",
        "a ton"
    ],
    "transcript_entity_types": [
        "LOC",
        "ORG",
        "DATE",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "GPE",
        "FAC",
        "TIME",
        "PERSON",
        "LOC",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "QUANTITY"
    ]
}