{
    "id": "xJBcNbS-uTM",
    "title": "Ranking the WORST Controllers of All Time",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-06-28T18:03:34Z",
    "video_url": "https://www.youtube.com/watch?v=xJBcNbS-uTM",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 406827,
    "likes": 10072,
    "comments_count": 1330,
    "description": "Who makes the best controller ever?  PlayStation, Xbox, or Nintendo?   Shark Tank Scams Tested!  I got SCAMMED on Instagram:  The Smallest Xbox Yet:  I Bought the WORST Shark Tank Products:  PS5 Pro:   Subscribe!  Twitter:  Matt:  Instagram:   Make your own tierlist and tell us how we're wrong:    Chapter Titles ------------------------------- 0:00 Hello and Welcome 0:26 Nintendo 64 Controller 0:59 PSOne Controller 1:43 Joy-Cons 2:31 DreamCast Controller 2:57 DualShock 4 4:00 Sega Genesis 4:45 Xbox 360 Controller 5:32 Original Xbox (The DUKE) 6:16 Xbox S Controller 7:05 Apple Pippin 8:00 Sega 3D Pad 8:28 Xbox One Controller 8:53 DualShock 3 9:26 NES Controller 10:00 DualShock 2 10:21 IntelliVision 10:30 Xbox Elite Controller 10:56 Wii Remote 12:14 GameCube 12:48 DualSense 13:38 Wii U Gamepad 14:24 Super Nintendo Controller 14:53 Xbox Series X/S",
    "description_links": [
        "https://youtu.be/w1-NoqAL5fE",
        "https://youtu.be/5dd1GmKPsIw",
        "https://youtu.be/iw4gjl2aako",
        "https://youtu.be/QxsClxIo6fI",
        "https://youtu.be/f9KdYp0upfE",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel",
        "https://tiermaker.com/create/video-game-controllers-15151464"
    ],
    "transcript": "- Matt, you're wrong. - The whole thing is that we have to have a consensus on these. - Oh yeah, you're right. Matt, I will begrudgingly agree with you. - We are gonna angrily agree with each other because there have been some dumb controllers that have been made throughout the years. - Duke. N64. - But there's also been some absolute amazing controllers that've been made throughout the year. - Dual sense. - So what we're gonna do today is go through all the core console controllers, and we are gonna put them in a nice little tier list. Starting with the first one over here. We have the N64. - Oh man! No. - So if you had three hands, this would've been S tier. But unfortunately for us mere mortals, we only had two hands. - Do you hold it like this, or like this? - No, no, you hold it like this! Left hand, middle. - Yep. - Thumb on joystick. - Yep. - Right hand on the arrow buttons and AB button. Because of ergonomics, I would say C. - I could be persuaded for C, I lean toward D. - I'm gonna argue C, because this is our first one. If we're gonna be that negative that early... - Okay. - You know? - C tier, let's go. - C tier. - What's the next one? - DualShock. The original PS One DualShock. I certainly have a fond attachment to it. It was a decent controller. Now obviously it got a lot better with the addition of rumble and the analog stick. I don't believe the base model had rumble. I think that was added with the DualShock. I wanna say this is B tier. I could be persuaded for C, but I think even though this was not as good as its later version, compared to something like like an SNES controller or a Genesis controller, this was much more of the traditional modern shape of controller. They kept this design for what, 15 years? I think it's for a reason. - I'm gonna say B. - I'll give you B. The launch PS1 was just so plain. Because we got the analog stick one in the same generation, that's where I'm like, man... - Well, We can talk about that when we talk about the DualShock 2. - Yeah. Let's do that. - Joy-Cons? Oh boy. How do we rank Joy-Cons? - Here's the thing that's gonna get me canceled... I don't like the Joy-Con. - I agree with you actually. It's too small. - It's too small. Drift has been an issue since day one. - Yeah. I'm okay using it as single Joy-Con, kind of on the side. But even then, it's definitely a compromise. There is something to the fact that you can just snap them on. They charge automatically. Like, it's a really clever design. I wish they were a little bit bigger. I'm gonna lean toward B. - B? - I'm gonna lean toward B. - Oh, absolutely not! - Where are you at? - I'm just floating between D and C. The tech inside is the only thing that's protecting it to me, for being an F. I think we've gone through double digits of Joy-Cons on the channel throughout the years. C at best. - Okay, I'll compromise with you, C. - All right. All right. Next up we have, the Sega Dreamcast. - [Austin] Hmm. That's a tough one. - [Matt] The chunkiest of boys. - The problem is half the audience has probably never even heard of a Dreamcast. They were probably not even born yet. It's too wide. - It felt like you were holding, like a Tupperware full- - [Austin] Yeah. - -of mom's spaghetti. The combination of the memory card, which was also- - [Austin] The DMU is cool. - [Matt] But nothing took advantage of it. - It's cool though! I'm gonna say D. - I'll give you, D. - Okay. - But... - Not good. Not good. - All right. What do we got up next? - DualShock 4! Okay. I love the DualShock 4. Full context, and I'm sure we're gonna talk about some of the other PlayStation controllers, but this was the first true redesign of the PlayStation controller since the PS1 came out in 1995. So when the PS4 came out, the DualShock 4 added a lot. I will say, even to this day, I'm still not a huge fan of the sticks on the bottom, I like the Xbox approach of the offset. - I agree. I agree. - But it's totally fine. Had a rechargeable battery, something that a certain other wireless controller in 2022 could learn a thing or two from. I like the DualShock 4 a lot. Really the only thing that dings it, and it's not even fair, is just that the DualSense is so good that it kind of makes the DualShock 4 just seem like a half step. But for its time, it was a good controller. - I feel like we can't look at it that way though. I feel like we have to look at these things somewhat in a vacuum. Like I would give this S tier. - I'm leaning toward A. - I will give it A. It's it's a great controller. Just, me personally, I don't like the joysticks, both being on the bottom. To me, that feels weird. And I know that's not what everyone thinks. - Lot's of things feel weird, Matt, but sometimes you just gotta suck it up and deal with it. - You now what you gotta suck up and deal with? Using this next controller, which is the- - [Austin] Genesis! - Yes. This one was great for fighting games. Like, it was almost like specifically for Mortal Kombat and stuff like that. - I never liked to the D-Pad on the Genesis controller. I might be in the minority. - It's mushy. - I do like the actual buttons and the layout. So if you're not gonna have sticks, which obviously this was before 3D games were really much of a thing, having your right thumb be able to do the sweep of all six buttons on the front was nice. It was unlike a lot of the other controllers of the time. It was actually designed for human hands and not like, four fingers or something. I'm leaning toward B on this one. - I'll give you a B. - All right Pretty fair. - Yeah B. - Looking at our tier list right now, I'm feeling pretty good about it. Again, I wanna know what's gonna be S and I wanna know what's gonna be F. 'Cause I don't know yet. I don't know. - (laughs) I know. I've got a couple for both. - You've known since the day you were born, I get it. - Next up, we have the Xbox 360. I'm gonna put my cards right on the table. S tier, no doubt. This was, and remains to be, one of my favorite controllers of all time. The only reason that you could knock me off the S tier perch is the fact that this was a AA battery controller. But 2005, I'm a little bit more okay with it compared to the newer. But this controller is so good. - It's a great controller. Little small for my taste. - I guess compared to the Xbox One today, I agree, I like the feel of it. Before it's time, this went up against the DualShock 3. - I'd definitely pick this over the DualShock 3. - [Austin] Yeah. There's a reason why this was not only the standard for console gaming, but it was also the standard for PC gaming as well. - If you wanna argue, S I'll give it to you. I think it's a low S. - Ugh. - I think it's S-A. - Rock, Paper, Scissors? I'll go S, you go A? - All right. - [Together] One two three. - Ahh! Okay - S tier let's go. Next up, we have the Duke! - [Matt] the Duke! - No. - Another chunky boy for a chunky boy. It felt like you were holding a pizza. - I heard stories, apparently the engineers developed the actual innards of the controller, and then it was left to some poor product designer to figure out how to wrap the actual shell around it. And they're like, \"oh, what?\" There's no way you could try to tell me that the Duke is not F tier. I know that they did redo it. Maybe Hyperkin or someone? - [Matt] Hyperkin, re-released it. - Unless you are Shaquille O'Neal, you're probably not gonna find this controller helpful. Maybe some people have some fond memories, but man, this is hard F for me. (booing) - I mean, imagine throwing this thing at your little brother, in the face. You don't have a little brother anymore. (child screaming) You know what you do have still? - [Austin] And yes! Okay, so this is exactly what you're just talking about. I don't know if S stood for \"slim\" or \"super duper good\" or whatever, but this was the smaller, slimmed down version of the Duke. Still nowhere near the 360. I think the 360 was like where Xbox controllers got good, and they've been good ever since. - My issue with this entire generation of Xbox controllers was the button layouts were kind of weird, of like trying to reach down and hit the white and black button. - Yeah. Yep. - It was just was super awkward. - It was out of the way. - Yeah. You know the big thing I'm gonna give them points for? The quick release- - Cable. - Cable. Kids these days, you youngsters... - Spoiled. - You're like, \"Oh no oh no oh no ahh!\" And then you rip your console off the wall. This here, had a quick release on here that would just just kind of go \"boop\". - I'm gonna lean towards C on this one. Middle of the road, fine, big improvement, but not... - I'll agree with C. - All right. What is next? (Matt laughing) - [Austin] The Apple Pippin. - Well, I'm curious to like anyone in the audience. Has anyone used the Apple Pippin in anything other than a hotel or something in the late nineties? That's pretty much the only place that Pippins were really used. - Yah. - Was in hotels as like, you could buy games or play games through the hotel infotainment system. - If you are confused about why we're talking about an Apple Pippin, yes it is from that Apple. So in the mid nineties, Apple went through at an interesting time. They had some teenage growth issues. - Ergonomically, it was horrible. It was a lot of extra controller sticking out of your hands in the back. - You're just wrapping your hands. - Like if I had a banana for scale, I'd have a lot of extra banana in my hands. - Well, don't we all have that problem. - I'm gonna give this one an F tier. - You going F? - I'm giving this one an F. All right, show me a real controller here. - [Austin] The SEGA Saturn 3D Pad! I'm not gonna lie, I don't think I've seen this in my life. - Gun to my head, I couldn't even tell you that this was real. - Kinsey, this is all you. What are we ranking this one? I have literally no idea, it looks bad, but I don't know. - [Kinsey] It did have like an analog stick, so that was kind of cool. - [Austin] Oh, on the Saturn. Okay, okay. - This was like if you were carrying around a manhole cover. (Kinsey laughs) - Oh, C. - Five letters more than I would've given it. - Okay, D, because Matt is salty. - No no no you already said C, don't let him bully you. - I like that you know how this works now. Moving on. - The Xbox One! Matt, this is gonna be a tough one. The Xbox One did make some key improvements over the 360. I do think it's a more comfortable controller. It's a little bit larger. To me, this Xbox One controller was my favorite controller of this generation. - Making a lot of good points for an A. - No I'm gonna agree. I think A is a good spot for the Xbox One. Good, great, probably my favorite controller of the time. But still, I don't think quite earned that S. - Yeah, yeah. - We got some heavy hitters coming up. - [Matt] The DualShock 3. - Oh, okay. - Here's the thing, it was fine. - Did you ever see the prototype? What was it, the Boomerang controller? - [Matt] Yeah, I did yeah. - I think what happened was they were going to do that and people said \"oh, that's dumb\", so they just grabbed Dualshock 2 and slapped a new label on it. - What did we give the PS One controller? - We gave PS One B. - I feel like we gotta give this one B as well. - I'm actually leaning a little bit more towards C, because it's basically the exact same thing as what came out 10 years beforehand. You really think this is B? - Fine. I'll give you a C. Give you a C. - It's a C it's a C. - And then when we argue, I'm going to play my card on you. - You'll get one veto from me. - All right. Moving on to the next one. We have the NES. - Oh, that's a tough one! Cause this sucks. The problem was, it was square. - It was not comfortable to hold, but if we take off our nostalgia glasses... - Yeah. This is bad. - It's not a good controller. I'm gonna go with D. - I completely agree, I'm glad you said it before I did. Yeah, D. - Like the sharp edges were a thing. Someone's gonna be in the comments like, \"my entire childhood was built on this. And this controller is what set the stage for everything-\" Shut up. Just cause it's old doesn't mean it's good. Which is basically my life story. (Austin laughs) So let's move on to the next one. - DualShock 2. This is a little bit of a tough one because while I'm not a huge fan of the 3 because it was the same controller, the DualShock 2 was also basically the same controller. As much as I didn't love the Xbox controllers and I had some fondness for the game cube, I like this more than any of the other controllers of that generation. I'm leaning toward B... - I'm giving it B. - Right? It wasn't great, but it was certainly- - It is still an improvement. - Yeah. Moving on. Intellivision! - F! (booing) - Yeah okay. I'm fine with that. It was not good. - Moving on. The Xbox Elite. S tier! S tier! S tier! S tier! S tier! - It's too expensive for S tier. - It's regularly on sale. - You know what is also on sale? The controller that comes in the box that you don't have to pay extra for. I'm not gonna argue with you that this is one of the best controllers you can buy. What I'm gonna argue with, is that if you are going to qualify as S tier, you need to come in the damn box. It's an enthusiast thing, right? Like, to me, it's a strong A tier. - [Matt] Yeah. - That's fair. - I like it. But it's so expensive. I'm pretty firm on A on this one. - Hit you with this thing though. - The Wii Remote! - [Austin] Ooh, where does this go, Matt? - I gotta give it a C. - The, Wii a C? - I'm giving it right in the middle. I'm including the nun chuck in this as well. - Yeah, I agree. - Which kind of defeated the purpose of the wireless, that you were tethered to it. Did you ever throw one of these into your TV? - Never. You actually broke a TV? - Oh, we broke multiple TVs. - What is wrong with you? - Because we're like whoo pah! - How hard are you Wii sports-ing? When you bowl, do you bowl like this? Or do you bowl like that? - Yeah, but I don't let go of the controller. I never threw my controller. I think the Wii controller is deserving of a B. Let me tell you why. Yes, it did not have rechargeable batteries. And yes, it was a little bit weird. But, here's the thing. It had motion controls, really, you bought a Wii because of the controller, right? - Could we talk about how expensive the motion bar was? I don't know if you ever did the trick. Cause when that thing inevitably broke, cause it always did. Cause the wire was thinner than my will to live. What you would just do is you'd have to go out and buy candles and you put two candles on the edge of the TV. (Austin laughs) That's why I give it a C versus a B - Look, I feel pretty strongly that this is worth a B. This sold a hundred million Wiis - I disagree with you. I think Wii Fit sold a hundred million Wiis. - No. Kinsey can you please give us a tiebreaker here? - I would still put it in B because this thing was like kind of revolutionary. - Thanks for backing me up I appreciate you. All right, moving on, we've got the GameCube! This is a really divisive one, 'cause people love this or people don't care. I liked the way that the L and the R felt. It's way better than the N 64 controller, I'll say that right off the bat. I'm just gonna put my cards on the table. I think this is a solid B controller. This was far better than the Xbox, the Xbox S controller and that's C tier. So I say it's gotta be B. - I wanna do C on this. I think there's a world where this was the N64 controller. And they just said, \"you know what? Let's just swap the buttons around\". It does come in atomic purple. - A great color! - Well, I'll give it B, strictly because of the color. - Yes! Okay. I'm about to get in trouble, S tier. I love this controller. - I gotta give you- it's S. - Playing Gran Turismo with the dual sense is by far the best racing game experience I've ever had. Feeling the motion of everything. It's comfortable, still has the touch pad, I think it looks good, I have basically no complaints about this controller. To me, it is hands down, ha ha, the very best controller on the market right now. Even above the Elite, in my opinion, just because of the motion and everything. I love this controller. - I can't argue with that. It's a great controller. I can't, I can't. - I'm looking at our tier list though, and I'm feeling good about this tier list. - People in the comments like, \"you forgot to mention this one controller that only three people in the world used- - Guitar Hero! Guitar Hero! - -because it was only used in a back alley in Japan between the summer months of 1948 and-\" - The disdain that you have for the audience, Matt, is something to behold. - [Matt] The WiiU game pad. - Oh no. - [Matt] Hey Nintendo... - Hell no. - [Matt] ...you. - Hell no! - I can only think of two games that like properly took you to this. Mario Party, we got to be Bowser and cheat. And it was Batman Arkham, where you use like your utility belt. - If you look at it as a historical item, that was a predecessor to the Switch, sure. Makes sense. You look at this as an actual controller, it's trash, right? Not only do you have to stay obviously close to your Wii, it was not an actual tablet that you could take with you, it had to be connected, and got all of its video wirelessly from the WiiU. Now it had like some TV functionality and stuff, but it was unwieldy... Like I really, really disliked the WiiU and the fact that we got the Switch, thankfully, means that the WiiU is essentially just relegated to the sands of time. This is F tier. This is easy F tier. - This is F tier. - But here's where I'm gonna be controversial. - [Austin] Okay. - In the early era of, you know, pre-3D games, this I think was the best controller that was ever made. It was comfortable to hold. It had like a great button layout and it gave you actual like extra buttons. This is where I'm like, A tier. A tier. - I will give you, that it's not a huge difference. And if you want to veto, I'm happy to do it. - I'm vetoing. A tier. - Okay. All right. - A tier, fair enough. I won't argue that one. It is a good controller, just not a great controller. Genesis better. The Xbox Series X/S. This is a little bit of a tough one because it's essentially the Xbox One controller. - A! - Okay, well no point in talking about that one anymore. A tier. It is a very good controller. If the DualSense did not exist, this would be probably my favorite controller you could get right now. Where it falls flat, I think, is the fact that it's essentially the same as the Xbox One, which to be fair, nothing was really broken, give it some tweaks and stuff. - If it ain't broke, don't fix it. Let us know the comments if you thought we were absolutely wrong about this tier list. What would you put at S tier? What would you put at F tier? Like, subscribe, follow us everywhere and tell us your favorite game. - Their favorite game is every game show we do on This Is of course. (relaxing music)",
    "transcript_keywords": [
        "controller",
        "tier",
        "Xbox",
        "Xbox controllers",
        "good",
        "give",
        "yeah",
        "good controller",
        "thing",
        "DualShock",
        "great controller",
        "Wii",
        "agree",
        "tier list",
        "favorite controller",
        "Genesis controller",
        "Matt",
        "great",
        "Apple Pippin",
        "lot"
    ],
    "transcript_entity_values": [
        "Dualshock 2",
        "three",
        "Kombat",
        "the day",
        "this day",
        "GameCube",
        "Elite",
        "Mario Party",
        "Joy-Cons",
        "One",
        "The Wii Remote!",
        "SNES",
        "Dreamcast",
        "the late nineties",
        "NES",
        "DualShock",
        "D.",
        "The Xbox Series X/S.",
        "Shaquille O'Neal",
        "The Xbox Elite",
        "Nintendo",
        "Matt",
        "Duke",
        "DualSense",
        "Austin",
        "Xbox One",
        "Pippins",
        "Xbox S",
        "Xbox",
        "WiiU",
        "Genesis",
        "Boomerang",
        "10 years",
        "first",
        "1995",
        "DualShock",
        "a hundred million",
        "Bowser",
        "Kinsey",
        "Wii Fit",
        "the early era",
        "N64",
        "the mid nineties",
        "WiiU",
        "15 years",
        "Joy-Con",
        "Tupperware",
        "4",
        "PS One",
        "these days",
        "PlayStation",
        "Saturn",
        "the year",
        "SEGA",
        "Wii",
        "Hyperkin",
        "Wiis",
        "the summer months of 1948",
        "one",
        "Switch",
        "Apple",
        "PS4",
        "four",
        "today",
        "the Sega Dreamcast",
        "2005",
        "six",
        "chuck",
        "F",
        "the years",
        "3",
        "half",
        "two",
        "DMU",
        "the Joy-Con",
        "Wii",
        "Japan",
        "only three",
        "the Apple Pippin",
        "Matt] Hyperkin",
        "Batman Arkham",
        "2022"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "PRODUCT",
        "NORP",
        "EVENT",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE"
    ]
}