{
    "id": "XkGTE4WMMko",
    "title": "A BANANA PHONE?! - What the Fruit?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-04-01T14:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=XkGTE4WMMko",
    "category": "Howto & Style",
    "tags": [
        "Banana Phone",
        "Apple",
        "Iphone",
        "Bluetooth",
        "Plantins",
        "Save the gorillas",
        "banana",
        "platinos",
        "smartphone",
        "blutooth",
        "accessory",
        "tech",
        "technology",
        "review",
        "hands on",
        "April Fools",
        "April Fool",
        "April 1st",
        "funny",
        "JerryRigEverything"
    ],
    "views": 991311,
    "likes": 34840,
    "comments_count": 3586,
    "description": "Current Banana phone pricing:  If you have NOT tried fried Plantains (You are missing out!) Give this recipe a shot. Remember, these are PLANTAINS not Bananas, they are just related, and look the same, but taste different.   1) have adult supervision 2) even if you are an adult 3) Preheat oil in a large deep skillet over medium high heat 4) Peel the Plantains and cut them in half, and then slice again lengthwise into thin pieces. 5) Fry the pieces until brown and tender.  6) Drain the excess oil onto paper towels.  7) Enjoy!  8) Might want to wait for them to cool down first actually.   HERE are some of my other APRIL FOOLS videos:  2017- NoPhone Durability test -  2016- Nokia 3310 Teardown and Durability:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://amzn.to/2EaqUxd",
        "https://youtu.be/1riMzZ6CjUI",
        "https://youtu.be/hQovQtM8Zhw",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Banana phone slipping into the niche fruit themed phone market next to Apple and BlackBerry. It's time to see if this newcomer can hold it's own during a durability test. The box says Talk more, smile more, and save the gorillas. I wasn't planning on saving any gorillas this morning, but this phone just talked me into it. Let's get started. [Intro] Inside the box we get some instruction booklets, the Banana phone itself, and a micro USB charging cable. Pretty simple design so far. My Banana has 3 buttons and is about the same size as a real banana, which I've included here for scale. Apparently by buying this phone, 1% of the sales are donated to Gearing up for Gorillas, an organization working out of the Congo. So that's kind of cool. Grabbing my Mohs picks, there is no screen on this contraption, mostly because it works exclusively through Bluetooth and acts as a wireless Bluetooth headset for your current phone. The whole thing appears to be made from yellow plastic - up here by the earpiece as well as the stem is all plastic. The yellow buttons are also made from plastic, and the rest of the shaft down here next to the microphone is plastic. It's literally now possible to pair a Banana with an Apple via Bluetooth and if that's not the future, I don't know what is. Peeling the Banana down at the bottom near the micro UBS charging port reveals more plastic. I can see why the box said Do not eat. You'd have to be bananas to eat this Banana, because going bananas means...yeah...right. But is the Banana structural? That is what we've all come here to find out. Gripping the tropical fruit with both hands and flexing the construction reveals a solid build quality. There is some creaking along the outer plastic peel, but the Banana remains solid and intact. I would not worry about keeping this Banana in your pocket unlike a real banana which would definitely not be safe in your pants. Here in the United States bananas are usually eaten raw, but in other parts of the world there is a member of the banana family called Plantains that is fried and is surprisingly delicious. My lighter doesn't cook this Banana real good, but I'll include a recipe in the description if you want to make some real plantains for yourself. You're currently watching a grown man play with a banana. Let that sink in for a second, and figure out what life decisions got you to this point and then let's keep going. It's time to take this Banana apart and review it from the inside. The Banana has no visible exterior screws but does have a nice seam along the outside that allows the Banana to peel in half, getting our first look inside. And I'll be honest, there's quite a lot of wasted space in here. There is plenty of room for wireless charging or even a headphone jack. This is not an efficient Banana at all. Curious enough though, there are 2 Phillips head screws holding down a large block of solid metal. People generally associate weight with quality, so adding a metal banana core, while decreasing nutritional value, would indeed provide a false sense of quality and substance. A nice little trick there Banana maker. There are 4 screws holding down the motherboard to the Banana peel. There is no water proofing inside the Banana but there is a lot of hot glue holding in all the components. It's a very inexpensive, yet effective construction technique. Up top we have the largest earpiece I've ever seen inside of a phone, held in place by the same hot glue we see everywhere else. It's hard wired to the motherboard just like the microphone down at the bottom of the Banana. Repairability wasn't high on the priority list during the Banana design process...no Lego connections anywhere. I was finally able to pop the charging port out of the device, but not before it snapped in half rendering my Banana un-chargeable in the future. But at least we got to see the insides. The battery is a 450 milliamp hour, which gives this Banana about 10 hours of talk time. Apple's usually have closer to 14 hours of talk time, and finally Apple beat another phone at something. Thumbs up for that. The 3 buttons are all injection molded into one piece. Overall I would have to say that the Banana shape is a great form factor for a cellphone. It has a nice curve to it way better than something round like an orange...or this carrot. I love carrots. Do you like carrots? What's your favorite fruit? Do you think Banana phones are going to be the next big thing? Let me know in the comments. If you want a Banana phone of your own, I'll put a link down in the video description. And thanks a ton for watching. I will see you around.",
    "transcript_keywords": [
        "Banana",
        "Banana phone slipping",
        "Banana phone",
        "themed phone market",
        "phone",
        "real banana",
        "bananas",
        "United States bananas",
        "niche fruit themed",
        "plastic",
        "Apple",
        "fruit themed phone",
        "States bananas",
        "Inside",
        "phone slipping",
        "themed phone",
        "phone market",
        "Bluetooth",
        "Banana real",
        "gorillas"
    ],
    "transcript_entity_values": [
        "Gorillas",
        "Lego",
        "jack",
        "14 hours",
        "Mohs",
        "1%",
        "half",
        "Banana",
        "4",
        "Phillips",
        "this morning",
        "Plantains",
        "the United States",
        "Apple",
        "first",
        "second",
        "450 milliamp hour",
        "BlackBerry",
        "3",
        "USB",
        "one",
        "Congo",
        "2"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "PERSON",
        "TIME",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "GPE",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL"
    ]
}