{
    "id": "xlBmdFORhZ8",
    "title": "Dave2D - Q&A 2017",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-02-16T16:45:03Z",
    "video_url": "https://www.youtube.com/watch?v=xlBmdFORhZ8",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Q & A",
        "Questions",
        "What does Dave2D do?",
        "What is your job?"
    ],
    "views": 429797,
    "likes": 15389,
    "comments_count": 1047,
    "description": "Dave2D Q&A. Thanks for submitting questions and for spending the time to watch my stuff =) My Backpack -  Cheap Knock-off Version -   My iOS game - Inject    Music Credits: Intro: Matanoll - Clearness (Robotaki Remix) Background: Fili - Domo  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2kueoDT",
        "http://amzn.to/2kNRLX5",
        "https://youtu.be/l3ky6pD9kXo",
        "https://itunes.apple.com/us/app/inject/id645521014?mt=8",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "All right Hey, how's it going Dave 2D here a couple days ago? I went onto Twitter to ask people to ask me some questions for this [Q/A] video And I did it because truthfully super busy at work don't have time for a regular text video hence the filler Q/A video I apologize if you're expecting a tech video this week [okay], first. What do you do for a living beside Youtube it's a little bit complicated but the simpler answer is that I work at a company that does the engineering the architecture the development - construction of Medical buildings, so imagine a medical clinic those things are built from like step 0 through step 10,000 we do all [of] them and one of those steps happens to be Equipping them with tech and that's kind of how I got [into] this besides Tech is there any other stuff that you'd like to make videos about and I would do the answer that'd [know] mostly because I [think] I'd be [pretty] terrible at making every other type of video you Do 2d game development - what have you made? I'm a little hesitant to tell you because it's terrible [okay]. I worked on several teams for game development But the one game that I made that is like most personal to me because everything about it [was] like it was my game Mechanic my game design it's a game called inject. It's available in the app store It's only for ios. It's [a] terrible game don't purchase it please But it exists if you want to see how terrible it was you can take a look at it I might put a link to like the trailer down in the comments section or in the video description What do you use to [make] the animations in your videos I use after effects. There's no like easy way to do it It's time consuming.I enjoy doing it. It's kind of like a cathartic like Relaxing thing for me to just like draw the lines and stuff like that But it's not a quick process by any means to use a laptop or desktop primarily I use almost exclusively laptops mostly because my work requires me to be pretty mobile and Laptops while you do that, how do you balance a Youtube channel work and personal life I? Don't I think I'm pretty bad at it. I sleep very little and that's probably like the easiest way to do it How do you spin laptops on the finger? How do you develop the skill? It's essentially like spinning A textbook it's unlike spinning a basketball But the basketball [you] kind of use your other hand to keep the ball Going with speed with a laptop or a textbook you have to keep the speed with the same spinning finger Are you related to Marques brown you guys have the same last name? Okay, we're both last names [wait]. Why do you use a Mac slash hackintosh instead of windows? The simple answer okay the true answer is that I am much more productive on a Mac Simply because I can't predict around I can't play games on a mac as readily as I can on a good PC Like I have very poor self control when it comes to playing game I will just sink hours into the game if I have access [to] a good computer when you have a good Mac You can't play the games that I like to play hence. I use a Mac to Force myself to Curb my gaming habits Whatever do a behind the scenes laptop review. No those are really they would be super boring to watch. I assure you Have you ever been to MalaySia? [yes], I have part of my family's from there, and I often go there for work, but yeah I go there once in a while. What are three important tips you could give to a new? Tech channel okay, I mentioned this in my first Q&A I don't remember exactly the points I gave them But the one that comes to mind is making content that you personally enjoy that you enjoy like creating and you enjoy watching because if you don't if you're just doing Content because you think it's the right thing to do or you think it's popular It's going to come across people can smell that a mile away. It's just bad content Enjoy the process because seriously that's probably the most important thing about YouTube other like tips Clattering oh man. I'm not good [with] that stuff. Maybe something another thing that comes to mind don't Like try not to watch other people's content and try to replicate what they're doing That's something that I think a lot of people are tempted to do because they see a successful challenge like hey I'll do what that guy is doing, but I'll do it. My [own] way do my spin on it It's a terrible way to do things you call yourself a content creator because you're a content creator. You should be creating things And replicating I really think that I mean the more that you practice at making your own style the better You'll get at it. So make your own thing Try not to bite What's your favorite watch character over [watch] Character [Road] [hogs]? Probably because he doesn't have he doesn't require like good twitching. He's just Yeah because I have that aim non check item favorite non tech item that you own I Don't [know] Maybe my backpack that's really lame answer. I apologize How do you keep things so clean did you place a lot of storage or deal with mentally minimally? I throw out everything that I can't like the moment I open something like a box Immediately gets thrown out all the cables that I don't absolutely need get thrown out It's just I mean I'm terrible with keeping things I sometimes regret having thrown certain things out, but it just lets you have a cleaner space [XPs], 15 or the X360 15 XPs 15 for sure? do I think each Eps will take off this year no mostly because external gPUs the when they were announced the 10 series pascal and video cards had not come out and It kind of made a lot of sense at the time The 10th used cards are such a big jump up from the previous [generation] And they're so similar to be like the laptop versions are so similar to the desktop versions It's not really a compelling purchase. It's such an expensive like everything about it. Just doesn't work right now Maybe in the future, but right now eg gpus are too expensive and the performance isn't good [enough] to really warrant it for most people What's your daily schedule look like I? Work a lot like 6070 sometimes more 6070 hours for my regular work So I try to devote maybe four to five hours of like shooting With YouTube videos per week like so [2] hours [1] Day [2] hours a second day I [never] give myself more than [2] days to shoot youtube videos and I shoot during my lunch break and stuff like that I'll edit videos at home at night, but I just don't have more time than that to shoot video The rest of my time is [spent] doing work and spending time with my family daily driver is currently using Nexus not the nexus the pixel phone that shows how much I often use I actually use it [the] pixel and the iphone and I use the Macbook pro and the XPS 15 Occasionally the razor blade if it had 32 gigs of ram. I would use a razor blade more, but XPs 15 more often than not What's your education I went to university of Toronto [I] Studied a human bio like a life science kind of thing completely unrelated to what I do for work completely unrelated to the YouTube stuff But that's what I did What's the best beginner camera your smartphone camera? You can make some amazing stuff with a smartphone camera, you completely don't need anything else more than that to start a YouTube channel Did you get a gh4 specifically for YouTube or something else? okay, I Actually yea, the Gh4 was my first camera I actually borrowed that thing from my friend and I used it for a very long time like a year and a half and then I broke it because I'm a terrible friend and I actually pre-ordered the red the scarlet w before I broke it It just took so long for it to come [I] had to purchase a like intermediary camera in between a Panasonic G7 that I used for a couple months in between and then after that I went to the [scrub] w so it's kind of weird the scarlet Debbie is actually my Very first camera that I purchased just kind of pick idiotic What do I eat for breakfast? I've not much of a breakfast person? I'm a coffee person Where are you from I am obviously Asian, I'm like my dad is half Chinese half malaysian my mom is half Chinese half burmese so that yeah, you can Asian, I was born and raised in Canada though, so I was born in Toronto raised in Toronto, Canada What was I doing before being a full-time youtuber [I] would not consider myself a full-time youtuber at all Before [I] made youtube videos on the [side], I made 2d games on the side Pancakes or waffles waffles for sure like for sure mostly because waffles are more like Anyone can make a pancake you make pancake mix and [just] make a pancake on any day But with a waffle you need like a waffle iron. You need like stuff to make it more awesome It's just like a fancier wall. It's basically a fancy pancake Favorite new game overwatch. I played that [a] lot classic game probably Zelda a [link] to the [past] on the Super Nintendo Good memories there [specs] of your hackintosh, so it's bad things there. It's a 6700 K skylake GtX 980 I don't love the reliability of it. It's fine for regular use, but I can't edit videos reliably on it So I just tend not to use it as much as I would like to Tim [Hortons] orders the Tim Hortons is like a coffee chain in Canada to milk one sweetener. That's like my go-to What's the story behind the 2d in the channel name, so 2d is I guess? My username on forums when I went on to [forums] like looking for how to do things for game development. It was Dave [2D] What's the best way to learn video editing? Just do it man? You just got a giver and you'll get better over time what would be your perfect laptop so a laptop that was like thin and light that was somehow able to run a 6 or Even 8 Core CPU like intel CPU would be awesome It's not going to exist [anytime] soon at least I don't think it will But that would be pretty perfect favorite youtubers that I watch that aren't in tech I don't watch that much YouTube but the one guy that I watch relatively frequently is H3h3 his stuff is slap for everyone. I find it pretty funny Do you have a girlfriend I? Am married I have a wife does that count and have a kid I don't know if that counts as a girlfriend How's the switch to red going for you? Was it the best decision? You've made also did you color the red symbol [teal] yourself? Okay, [Debrand] actually made that teal or blue logo thing and stuck it on for me. Which is awesome in terms of the workflow It's definitely slower than before. It's probably five maybe [10%] than my previous camera which was the Gh4 But it's so much more enjoyable to work with and the learning curve is just it's steep But [it's] very satisfying when you kind of figure stuff out as you go. Hope you guys enjoyed this video I gotta get back to work [some] to be liked it subs. We loved it. I'll see you guys next time",
    "transcript_keywords": [
        "game",
        "video",
        "work",
        "Youtube",
        "YouTube videos",
        "things",
        "thing",
        "videos",
        "game development",
        "stuff",
        "time",
        "kind",
        "laptop",
        "Mac",
        "good",
        "terrible",
        "made youtube videos",
        "made",
        "make",
        "camera"
    ],
    "transcript_entity_values": [
        "2] hours a second day",
        "Tech",
        "three",
        "the Tim Hortons",
        "Macbook",
        "Debbie",
        "Twitter",
        "Dave",
        "this week",
        "10,000",
        "Force",
        "CPU",
        "gh4",
        "2d",
        "one",
        "Asian",
        "Mac",
        "this year",
        "Toronto",
        "Youtube",
        "10th",
        "half",
        "daily",
        "Tim",
        "a couple days ago",
        "youtube",
        "YouTube",
        "university of Toronto",
        "malaysian",
        "Zelda",
        "intel",
        "Curb",
        "four to five hours",
        "first",
        "1] Day",
        "Panasonic G7",
        "five",
        "X360",
        "10",
        "6700",
        "32",
        "Canada",
        "just sink hours",
        "a mile",
        "2d",
        "Eps",
        "Chinese",
        "2] hours",
        "6",
        "a couple months",
        "2] days",
        "Nexus",
        "burmese",
        "6070",
        "6070 hours",
        "15",
        "Mac",
        "Youtube",
        "0",
        "10%"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "PERSON",
        "DATE",
        "GPE",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "TIME",
        "QUANTITY",
        "DATE",
        "ORG",
        "NORP",
        "TIME",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "NORP",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT"
    ]
}