{
    "id": "xlBrisS4dTQ",
    "title": "Cutting Soap!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-03-12T18:01:56Z",
    "video_url": "https://www.youtube.com/watch?v=xlBrisS4dTQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "cutting soap",
        "ASMR",
        "soap cutting",
        "lush soap",
        "soap haul",
        "ASMR SOAP",
        "ASMR soap sounds"
    ],
    "views": 2155089,
    "likes": 41924,
    "comments_count": 6379,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "Hey guys you may say Justine what are you doing? If you hit a new low potentially, but don't ask questions because today. We are here to cut soap! Apparently this is a very popular thing to do on YouTube so I thought hey why not jump on the bandwagon That's what we do here except some people don't film dead bodies on YouTube so Did You Sue? I think that's one bandwagon that probably most people will be jumping on but the soap on the other hand let's do This I've also got a slow-mo soap cam right here, and we're gonna cut it I don't know if there's an etiquette to this, but I've got the slo-mo cam here So we're gonna have some slo-mo soap cut I also ordered on Amazon Prime now a new cutting board because the one that I had I didn't like so midway through this video I should be getting a bigger cutting board cause this is all pun intended not gonna cut it oh gosh (Oh Justine And The Puns) I'll be here for the next 5 to 10 minutes But what we need to do now was we gotta get some knives because if you guys are new here You don't know that I. Love. Knives! Welcome to my channel, so these are my cooking knives They're very dull because I use them to open things and boxes and stuff, so we're gonna set these off to the side So this is my bowie knife This is probably one of my favourite knives that I own I do have a lot of smaller ones that I like but as For the larger knife. I really love this one. I've used this to cut cakes And other things, but today my friends. We're gonna cut soap with it, which soap should I do first Nick do you have a preference? (Off Camera: The Pink One With The Green Stuff) Okay, I don't know what the etiquette is I feel like people would like really chopping and getting into it But I'm gonna do it my own style. I'm gonna cut this soap however. I want to cut the soap so first I'm just gonna maybe give it a nice jab oh wow guys have you seen this? piece Oh Wow, WOW WOW WOW let's Just hope that I am NOT going to end up in the hospital after that Wow soap is super slippery Is that what people are into is that something that happens, I'm gonna cut it am I doing it right? That's a cut That's a cut! I feel like this is one of those things where what I think back to my childhood When people were like just see what do you want to be when you grow up? Oh boy? (Off Camera: Im So Confused) Shh, this is entertainment this is fun. You just don't get us Nick. You just he doesn't get us guys I'm curious as to what you thought I was doing I thought you were gonna like craft the bars Into like a shape or something You don't melt those down into another bars. No. I'm literally cutting so you're asking way too many questions You don't understand yeah the culture So let me break it down for you. Yeah, I think you're just fine so that's it that's actually what I'm doing No, you know I'm enjoying this commentary atleast I've got someone to talk to you while I'm cutting my soap This smells very good so the scent of this it's like a minty Raspberry it like kind of smells. It smells so good. I want to eat it so For our next soap I'm gonna switch it up a little bit. I'm gonna. Maybe use a smaller knife Just to see how that feels maybe I might like it more maybe I might not I don't know what this is it's a blue Chunk, but it's really beautiful, so now let's cut it *sneezes* Oh God, I'm very sensitive to like smells and man has this making me sick This it's like some sort of ocean breeze nonsense I have seven soaps left thats a lot of soap I'll use a smaller knife so I decided to use this one I usually use this to cut bread or open up Amazon boxes, so we'll see how this cuts Look at that texture Wow we Guess whats here New cutting board this is gonna look so much better We just upped our game. This stinks. It smells lie disgust. It smells like shame and need like a bucket new cutting board What do you things look good now? We're on to our next soap Next knife look at this little one is a little carrot Oh you guys like this one look at this real Chuck real fast. Chalk oh Look at this Mmm. That smells actually that's smells pretty good. This looks like something. I would eat this looks like a little muffin Let's give it a big chop Give you the treatment I think smaller knife works better for the effect that we're trying to get This looks like a salad I think you guys are gonna be super into this soap. It's a very bubbly soap So I'm gonna be completely honest with you guys I'm getting a headache from the scent of this soap all of this is Definitely giving me a headache Two soaps left have I lost any of you guys yet. Are you confused? I'm also confused, but we're gonna try to do two soaps at the same time why not Look at that Well guys today We cut soap if you enjoyed this or if you didn't enjoy it I'm probably gonna do it again because I want to get my sister in here to see what she thinks about cutting soap this is So strange and weird, but in some weird way it was actually kind of relaxing just cutting soap I wish that I wasn't so sensitive to these smells because it's making me slightly nauseous, so thank you guys for watching I will see you in my next video if you haven't subscribed already You know what to do, and if you don't then Probably shouldn't be using YouTube. What if I put all this soap into the bathtub? Should I try it, I probably should try it I should try it why not what have I got to lose my house My skin my dignity I've got a lot of things to lose. It's not happening. Okay. Bye! (Music)",
    "transcript_keywords": [
        "soap",
        "cut",
        "cut soap",
        "guys",
        "WOW WOW WOW",
        "wow",
        "smells",
        "cutting",
        "WOW WOW",
        "Justine",
        "cutting soap",
        "slomo soap cut",
        "cutting board",
        "knife",
        "things",
        "people",
        "soap cut",
        "soaps",
        "Wow soap",
        "knives"
    ],
    "transcript_entity_values": [
        "YouTube",
        "Two",
        "I. Love",
        "Shh",
        "bowie",
        "10 minutes",
        "Off Camera:",
        "Amazon",
        "Chuck",
        "YouTube",
        "today",
        "Justine",
        "two",
        "the next 5",
        "seven",
        "Nick"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON"
    ]
}