{
    "id": "xMMxiAYmLWE",
    "title": "Robots are cleaning my house!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-09-04T19:14:48Z",
    "video_url": "https://www.youtube.com/watch?v=xMMxiAYmLWE",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 848108,
    "likes": 11534,
    "comments_count": 894,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and today we're gonna be unboxing something that will help you clean your house. Robots! (upbeat music) So I have the iRobot Roomba and the iRobot Braava jet. My sister actually has this one and she has been saying how amazing it is, so I'm really excited to check it out. A huge thank you to iRobot for sponsoring this video. I cannot wait to have a clean house. I have purposely been not cleaning the floors, I mean, I'm saying purposely, but just like, I really just haven't actually cleaned them. So this is going to be great because there's a lot of dirt all over the place, but don't worry. We're also gonna show you how it can disappear very quickly. Let's unbox. (upbeat music) It's been a while since I've been this super excited to unbox something. I mean, I do unbox a lot of stuff, but this is gonna help me keep my life in order and clean. Oh, this is its base station. (cardboard box shuffling) The real question is what are we gonna name it? (cardboard box shuffling) Seriously really exciting. I was spending so much more time at home and to be able to have sort of the heavily trafficked areas clean consistently throughout the day, especially the entrance to my little backyard area because the dog is constantly in and out of there all day long. So this will be able to know my high trafficked areas and take care of it for me. I wonder if you make a good dinner companion, how's your conversational skills. Mine are pretty poor. Look at this. Let's get it set up, and then I'll unbox the Braava jet while this is charging. (upbeat electronic music) Okay. Braava jet. (cardboard box shuffling) Oh, look at you. This is really sleek looking and we've got the base station. Cables, oh, look at this. This is a washable wet mopping pad. And here's a couple of the single use wet mopping pads, here's a sweeping pad, so we have a sweeping pad, a mopping pad and a washable. Now we need to find a home for this, and then we're gonna set up the app and get these all synced up so we can start some cleaning. (calm electronic music) So I've read all my directions, I have the app downloaded, these guys are all plugged in, and now it's time to set them up. Let's set up the vacuum. Let's name it Roomba Mama, press and hold spot and home spot and home. Okay. (electronic ding) I've pressed the buttons, (gasps), set up is complete. \"Welcome to the world, Roomba Mama.\" This is the best thing I've ever seen in my life. Maddie, please, we're doing a software update. Get hyped. So the update for the Roomba Mama is ready. So this is just about ready to clean, I'm gonna set up the mop, then start this clean while this charges, it's all a process, but this is gonna be great, because once these are all set up, everything will basically be automated, and I won't have to really do anything. What should we name this one? How about Baby Braava? (gasps) There we go. (electronic ding) (gasps) Connect to my wifi. Once baby Braava is connected to your wifi, I love these names (laughs). This is the best part about it. That's interesting. So depending upon which pad you install into the Braava jet, it'll automatically put it in that mode. There's different automations that you can set your robots up to do, so you can actually have it set up so that when you leave the house, the robots will know that you're no longer here and they'll start cleaning so that you can return home to a clean house. I also love that this has integration with Alexa and Google, I can, I'm like, I always bring my voice down, like, so they can't hear me. She heard me, she already heard me. So with that integration, you'll be able to communicate with your voice through those devices, to have them clean a specific room or just clean the house. So we're about to do our first clean, and this has no map data of my house. So we need to do this first clean so that it's able to kind of get its bearings. So first thing's first Roomba Mama, let's get this party started. (electronic musical signal) (Roomba whirring) This is your first time! (electronic music) It's learning, it's learning! (calm electronic music) I love that he's like not even afraid of it. He's like, \"All right.\" (electronic music) I have a busy schedule and then I also have a dog who frequently tracks in dirt and makes a lot of messes. I can easily set a schedule so they can clean specific rooms on certain days, or just clean every room, with imprint link technology, Roomba and Braava jet are able to mop my home and clean without me having to do anything. It's really cool because it's able to imprint smart mapping to be able to learn its way around my home. I do have two floors in my house. So this could also learn my upstairs as well as the downstairs. You can choose a room to be cleaned in the app and you can also use smart home integration with Amazon Alexa and Google. Roomba clean my kitchen! I love that you can make keep out zones, these are virtual boundaries so I can make sure that my dogs, food, and water dishes are off limits. You can also add clean zones for a place that might frequently need cleaning like the kitchen island or the front door. There's an all new updated app that lets you build out your own map and customize it with room dividers, labels and zones. You can also add favorites, so with one tap, you'll be able to clean your preferred room or highly trafficked areas. It's also always learning your space and it keeps evolving the more you use it. (electronic music) I'm so entertained, I've been watching this thing the whole time. It's navigating around everything, like, it found its way out of so many obstacles, it went under the couch, and then came back out. It made its way around the garbage can. I went upstairs to play video games, and then I got a notification that said \"Roomba Mama was completed.\" So it cleaned this entire downstairs, returned to the base by itself to do a charge, and it also empties itself, so when it returns, it'll actually empty itself from here into this bag. Originally, I was gonna do a dusting first with the Braava jet, but the Roomba did such a great job of cleaning that we're gonna go straight to the mopping. You also have an option to add some of this Braava jet solution, this is some cleaning solution that you can put into the reservoir along with some water, which is in here (gasps) tank guard, look at this, instructions everywhere. Lift the handles, remove the tank. Then we fill this up. So here's the mopping pad, this is one of the one use wet ones, and this little cardboard here that you install right into the bottom, this will determine what mode that it places itself into automatically. Then we'll put in our water tank. (electronic music) Ready to wet mop, it automatically identified which pad that I put on. Now we're gonna mop everywhere. (electronic ding) Time for clean, time for clean. (upbeat music) So I've brought in my sister, I mentioned her before, because she actually has one of the iRobots as well. So I wanted to show her the new updated app because you don't actually have it yet. The one that I'm using right now, it's in beta and I'm testing it, so when I showed it to her, she was like, \"Wait, I don't have any of these features.\" - Well, I thought it was just like an example. And I'm like, wait, that's the layout. Oh, that's so cool. Yeah, I don't have that. That's really neat. - So yesterday I filmed the unboxing of the setup. And then I realized when I was gonna finish this video, that I still needed to make sure that the robot was doing some more training and it had some more time to learn my layout. So I did that and I basically lifted up everything, I've done, like, a quick little video, but I put everything up so that it can completely really learn the whole area. I put like my trash can up, I put like everything away, so that it would know the full layout. And then once I put those things back down, it'll know that they're there, but I wanted it to be able to get a sense of the entire layout. So let me show you this. - Oh cool. Here it is. These are my two rooms. - That's -- So this is kind of like the kitchen area and my living room. - It's very accurate. - So now, I know, we can go in and customize. (both gasping) It is so cool, so this is downstairs and then we hit next. And so this is saving everything, that's cool. - Yeah, I don't have that. - Look at that. I just, I turn it on and I can like set a schedule, but this is cool. - Look, it's letting me set up rooms since it's already divided. It says \"Roomba Mama tries hard, \"but doesn't always get rooms exactly right. \"Please review and tweak as needed.\" - Oh. - Honestly it did a pretty good job to be honest with you. This is good so we can add a divider if we wanted to. Oh my gosh and I can just turn it like that, did you guys see that? Look at this. I'm turning it. - This is fascinating. - I know. Now we can label each room. - Oh. I can't wait until yours updates to this. - I'm excited. - It's gonna be cool. - Tap a room to label, okay. - Kitchen. - Let's call this, let's just call this kitchen. Kitchen, kitchen. - Kitchen's nice. Very generic. This is the kitchen. - Very. Here we go. Living room. - And this is, living room. - There you go. - You can set up favorites, so I can just vacuum everywhere or I can add my own favorite so I can set up the kitchen, what color should kitchen be? I really like purple. - Look and you can even set up to mop after -- - I know. I know. - I'm shocked. - And they we're in quick mop after. - Looks nice now 'cause you've already cleaned it. - Look at this, choose the mop. - Oh my gosh. - So you can also set a schedule, which is kinda cool because if I wanted this to clean up, basically like after my day of, you know, existing and making messes in my house, I can set it to start. How about like nine o'clock? - Yeah, sounds nice. - That sounds good. And then we can also do an automation, so if I want to enable this, it'll know that whenever I leave, it can just start cleaning so that when I come back, it'll be nice and clean. - That is pretty cool. - You can also set up zones. So Maddie's food in his dish is usually like over there. Look at this, I can zoom in. - Wow. And we can add a keep out sound. - That's really cool. - I know it was probably about that much maybe, okay. So there's a way to save it because I don't want his little food to get spilled. - No, it'll bump it. - Yeah. Or the one time he was eating dinner and there were, the vacuum was coming, he's just like, so unbothered by it. I'm like, \"Buddy, move!\" - Move, Maddie, get out of the way! - He's like, \"I'm eating, leave me alone.\" So thanks for joining my video. - Yeah, I was excited when you told me, I was like, you've done a lot of cold things, but I was really excited about this. - And when I told her there was a Braava jet that mops -- - Lost my mind. - Thank you guys so much for watching, I'll put a link in the description, if you guys want to check out, both of these, the iRobot Roomba and the iRobot Braava jet. - I'm obsessed. - Now you're gonna have to get yourself a Braava jet. - I know, it's so cute, I love it. - How much -- - Should I just have them clean again? - Yes, just do them all - I think so okay. Let's do it again. - Why not? All right, okay, okay. (electronic music)",
    "transcript_keywords": [
        "Braava jet",
        "Roomba Mama",
        "clean",
        "set",
        "Braava",
        "Roomba",
        "Justine and today",
        "room",
        "kitchen",
        "iRobot Braava jet",
        "jet",
        "cool",
        "Mama",
        "put",
        "house",
        "home",
        "time",
        "iRobot Braava",
        "pad",
        "Justine"
    ],
    "transcript_entity_values": [
        "Alexa",
        "iRobot Braava",
        "Maddie",
        "iRobot",
        "the iRobot Roomba",
        "Braava",
        "Roomba",
        "first",
        "the day",
        "Amazon",
        "one",
        "Alexa",
        "today",
        "Roomba Mama",
        "Justine",
        "two",
        "Google"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "ORG"
    ]
}