{
    "id": "XNsLVJql-HA",
    "title": "Phones are ROLLABLE now??",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-01-12T03:30:54Z",
    "video_url": "https://www.youtube.com/watch?v=XNsLVJql-HA",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "CES 2021",
        "CES",
        "virtual CES",
        "LG",
        "LG rollable phone",
        "lg virtual influencer",
        "LG TV",
        "2021 TVs",
        "new TV lineup",
        "new phones",
        "2021 phones",
        "folding phone",
        "bending phone",
        "flexible display",
        "rollable",
        "phone",
        "rollable phone",
        "LG Rollable"
    ],
    "views": 404325,
    "likes": 28279,
    "comments_count": 1480,
    "description": "Remotely monitor and manage your server or PC with Pulseway at   GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   Timestamps: 0:00 It's a special week 0:15 Parler banned by everyone 1:25 LG Rollable Phone + other stuff 2:46 RTX 3000 Mobile parts?? 3:51 Pulseway 4:37 QUICK BITS 4:42 Rocket Lake CPU overclocked 5:04 OtterBox Xbox clip 5:29 Touchless doorbell 5:52 A city built in a line? wut  NEWS SOURCES  NE PARLER PAS     PHONE ROLLIN ROLLIN ROLLIN       BUT CAN WE BUY ONE?     QUICK BITS  KEEP YOUR ROCKET COLD     RAGEQUIT ARMOR?    HANDS OFF THE BUTTON    A LINE WITHOUT LINES?   ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/ces2021",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://www.independent.co.uk/life-style/gadgets-and-tech/parler-down-app-trump-capitol-riots-amazon-b1785290.html",
        "https://mashable.com/article/parler-down/",
        "https://www.reuters.com/article/us-amazon-com-parler/parler-sues-amazon-over-web-shutdown-alleges-political-animus-idUSKBN29G282",
        "https://www.businessinsider.com/lg-rollable-phone-screen-expands-video-ces-2021-2021-1",
        "https://www.techradar.com/news/lg-rollable-teased-as-the-first-phone-with-a-rollable-screen",
        "https://www.engadget.com/lg-c1-oled-tv-game-optimizer-google-stadia-135907267.html",
        "https://www.lgnewsroom.com/2021/01/lg-to-reinforce-industry-dominance-with-ultimate-tv-technology/",
        "https://www.theverge.com/2021/1/11/22224601/lg-ces-virtual-influencer-dj-reah-keem-uvc-robot",
        "https://www.tomsguide.com/news/nvidia-rtx-30-mobile-gpu-launch-looks-set-for-tuesday",
        "https://www.pocket-lint.com/laptops/news/nvidia/155273-nvidia-geforce-rtx-3000-series-mobile-graphics",
        "https://www.guru3d.com/news-story/nvidia-posts-2021-ces-teaser-predominantly-geforce-rtx-30-mobile-focused.html",
        "https://twitter.com/PttpcWorld/status/1347550550233997315",
        "https://hexus.net/tech/news/cpu/147249-intel-rocket-lake-flagship-cpu-overclocked-69ghz-ln2/",
        "https://www.youtube.com/watch?v=bYHS9lSIdTw",
        "https://www.ign.com/articles/otterbox-is-launching-an-xbox-controller-shell-phone-gaming-clip-and-more",
        "https://www.slashgear.com/otterbox-prepares-xbox-controller-for-battle-and-remote-streaming-11654503/",
        "https://www.cnet.com/news/alarm-com-debuts-a-no-touch-video-doorbell/",
        "https://pravinfo.com/germanyeng/finally-the-doorbell-for-the-pandemic-era/",
        "https://www.middleeasteye.net/news/saudi-arabia-the-line-neom-megacity",
        "https://www.prnewswire.com/news-releases/hrh-prince-mohammed-bin-salman-announces-the-line-at-neom-301204772.html",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "(shouts) CES, it's happening. So just like in previous years, there will be a Techlinked episode every day this week. That's two more episodes than normal! So don't say we never give you nothing, you know? We give you tech news. - [Man] And that's not all! - That's not? Oh, that's not all. Okay. Apple has made good on its promise to ban the social networking app, Parler, from its app store. But in an even bigger hit to the service, Amazon has suspended Parler from AWS. Meaning the platform is now without a host and is offline entirely. This past Friday, Apple said it would pull Parler if Parler staff did not submit a plan to improve content moderation within 24 hours. (trills lips) But Parler refused, which makes sense, since their whole thing is like, unmoderated free speech and stuff, and refusing is cool! (laughs) Unfortunately, that policy led to a lot of Parler posts encouraging violence and contributing to the storming of the capital last week, which in turn led Google, Apple, and Amazon to pull the app. Parler is now suing Amazon under a theory of antitrust saying that the ban reduces competition. And while some are welcoming the ban, citing real world consequences of internet misinformation and violence mongering, others are concerned that the move sets a dangerous precedent allowing just a few large corporations to police online speech. Thankfully, we're all reasonable people and can recognize that both of these things can be true at the same time. Right? We can do that, right? - [Man] Wait, wait, what? - Yeah. - [Man] I think I should be mad at you. - LG showed off some interesting stuff at CES including their Rollable phone! - [Man] Woo! - Not just a rollable TV. - [Man] Whoa, what? - That's been rumored for some time now. The company released a brief glimpse during a virtual CES 2021 event. And it looks like the phone is also going to be called the LG Rollable when it hits the market. Dude, is that a Rollable? You bet, buddy. (laughing) It should give Samsung some competition in the foldable, rollable phone space. I can't believe I'm saying that. But no word yet on pricing or availability. I mean $2,500 though, why not? LG also wants to make it a bit easier for you to use your next gen consoles on your TV with a new game optimizer rolling out with this year's modules. Models. - [Man] Same thing! - Which lets you quickly enable a variable refresh rate and reduce input lag from one menu. In addition, the company's 2021 TV lineup will come with support for Google Stadia and G-Force now, even though the TV is run on LG's wacky web OS and not on Google TV, which doesn't even have Stadia yet. - [Man] Aww! (indistinct) my Stadia that I love! - I haven't even said the craziest part yet, which is that LG had a virtual influencer of some type announce some of their products and I don't know about you, but I am way more likely to buy a TV when I hear about it from a badly voiced CGI avatar instead of a real human. - [Man] Oh, yeah. - Because I hate humans. I'm a misanthrope! And like many others, you may not have been able to get your hands on a RTX 3000 graphics cards yet. But instead of that, what about a laptop with one of these hard to find GPUs instead? It looks like during tomorrow's NVIDIA event at CES, team green is going to announce RTX 30 hundred mobile chips. And, well, unlike the current gen mobile CPU's, they're not supposed to be that good. (laughs) The rumor is they suck, as Linus talked about on WAN show, you can check that out on LMG clips if you just want to see that little snippet. But on the bright side, the 3080 Max-Q should have even more VRAM than the desktop 3080. A lot more, in fact, with 16 gigabytes being the expectation instead of the 10 that you would get on a discreet card. A lot of vocal flubs there, but you get what I'm saying. There should also be resizable BAR support which is the same technology behind AMD's smart access memory for its Radeon lineup. But no matter how good or not good these laptops may be on paper, they are not good at all if they're not in stock. So, come on 2021. - [Man] Hey! - Death to all scalpers. - [Man] Be different! - Now its time for quick bits brought to you by Pulseway. The service that lets you spend quality time with all of your devices, even when you're apart. Pulseway knows that being away from your remote systems and servers can be so hard emotionally with (chuckles) With their real time remote monitoring and management app, that's compatible with Windows, Mac and Linux, Pulseway can give you access to real-time status system resources, logged in users, network performance, Windows updates and more. I wanna be able to Windows update wherever I go. You can deploy custom scripts and update all your systems on the go. So, it'll feel like your machines are right there with you where you would love them to be keeping you warm with all their fans, safe in your arms. Rekindle your connections by trying Pulseway for free today at pulseway.com or through our link below. My link baby. And I will have my quick bits. A Twitter account called VWorld has shared two videos of an unreleased Intel Rocket Lake CPU being overclocked to over 6.9, nice, GHz using liquid nitrogen. This is not the order in which things are supposed to happen. We're supposed to get the chips, and then make 69 memes. - [Man] Yeah. - This is too early. Oh no, that's what she said. (laughs) Otterbox is coming out with a new rugged shell for X-Box controllers, as well as the clips so that you can use the control with a smartphone. So now both of your expensive tech products can stay in one piece after you throw them across the room when you lose in War Zone because of network lag. It won't protect the walls though. So I need a Otterbox wallpaper. - [Man] You need to live in an Otterbox. - I'm an Otter. I would be an Otter at that point. (laughs) You've probably gotten contact-free food or package delivery at some point during the pandemic. But, alarm.com thinks that there can be even less interaction between your home and a strangers' body (laughs) with its new touchless video doorbell which will cause your chime to go off whenever it sees a person at the door. It's 200 bucks, so it isn't cheap. I mean, can you really put a price on people not putting their grubby little hands all over your doorbell? - [Man] $200. - And Saudi Arabia thinks it has the solution to long commute times. The Nation's Crown Prince has announced a project simply called 'The Line', which isn't a social media app that people younger than you use, but is-- Instead, it's a hundred mile long set of zero carbon smart cities that the country plans to house with 1 million people by the year 2030. Instead of roads, the cities will be connected with high-speed transit and autonomous vehicles. The idea is to ensure you'll never be traveling for more than 20 minutes, no matter where you're going. 'The Line' is part of a $500 billion, you know, that oil money, project. So maybe they should call it 'The Credit Line' instead. Just kidding, they're paying in cash. So that's it for our show. Come back on Wednesday, psych! Remember what I said? All day, every day, C-E-S. - [Man] Ah! 24/7! - C-E-S! - [Man] Can I join your game? - You see that S, that's negative space, South side!",
    "transcript_keywords": [
        "Parler",
        "CES",
        "Rollable",
        "Techlinked episode",
        "time",
        "app",
        "Pulseway",
        "good",
        "Amazon",
        "Rollable phone",
        "Apple",
        "give",
        "Google",
        "Line",
        "Stadia",
        "Windows",
        "people",
        "Google Stadia",
        "Otterbox",
        "pull Parler"
    ],
    "transcript_entity_values": [
        "CES",
        "16 gigabytes",
        "30 hundred",
        "Stadia",
        "more than 20 minutes",
        "G-Force",
        "This past Friday",
        "year",
        "Nation",
        "one",
        "LMG",
        "WAN",
        "NVIDIA",
        "War Zone",
        "Google",
        "2021",
        "6.9",
        "Windows",
        "Amazon",
        "3000",
        "last week",
        "24 hours",
        "the LG Rollable",
        "3080",
        "today",
        "Google Stadia",
        "Windows, Mac",
        "3080",
        "Twitter",
        "Samsung",
        "Techlinked",
        "Linux",
        "Windows",
        "VWorld",
        "The Line'",
        "South",
        "LG",
        "1 million",
        "Crown Prince",
        "10",
        "Pulseway",
        "AMD",
        "Intel Rocket Lake CPU",
        "Google TV",
        "a hundred mile",
        "two",
        "Parler",
        "Wednesday",
        "AWS",
        "2,500",
        "Radeon",
        "200",
        "Saudi Arabia",
        "69",
        "The Credit Line'",
        "200 bucks",
        "Otter",
        "C-E-S.",
        "Linus",
        "Otterbox",
        "CPU",
        "Otterbox",
        "$500 billion",
        "All day",
        "the year 2030",
        "tomorrow",
        "Apple",
        "Rollable",
        "zero",
        "previous years",
        "Rollable"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "LOC",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "NORP",
        "ORG",
        "WORK_OF_ART",
        "LOC",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "GPE",
        "CARDINAL",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT"
    ]
}