{
    "id": "XNVX5poHwQ4",
    "title": "X1: The Future of TV? [ad]",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2015-12-14T23:05:33Z",
    "video_url": "https://www.youtube.com/watch?v=XNVX5poHwQ4",
    "category": "Science & Technology",
    "tags": [],
    "views": 1509576,
    "likes": 11888,
    "comments_count": 1708,
    "description": "This video is sponsored by XFINITY  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys. Lou here back with another video and today I'm gonna be checking out X1 from xfinity. Comcast asked me to come take a look and more importantly share it with you guys. One of the cool things is this remote which now features voice control Pretty cool function so let's check it out. Alright so now I've got the sys- >Ok hold on [inaudible] clear that coffee cup. We can see through the relfection Alright so now we've got the system booted up. I've got the remote in my hand which is obviously very important A lot of the magic happens with this button-the xfinitiy button. When you press it you'll see this little menus come up from the bottom of the screen Now the first option is a guide. It allows you to see what's on right now You get the On Demand section This is gonna be the home of everything that's available On Demand. Whether that's TV, movies, and so on. Featured movies, new and most popular Select something that is of interest to you or if you are like me, you can just sort of browse around and spend a bunch of time watching a bunch of trailers and never deciding on anything. The ratings for Rotten Tomatoes is listed right on there and you can actually sort by those critic's ratings. One of the key features here: the ability to search things using your voice There's a microphone at the top. Drake. Look at this. Look at this right here With the old man dance moves he knew people were gonna be talking I love it though. Well done. We also got an apps selection. This might be the coolest spot in my opinion You can have access to your personal photos via various social media. Then you've got some apps specifically for sports, weather, horoscopes if that's your kinda thing. You see I'm watching a game on the left but maybe I'm a heavy duty sports fan. Over here on the right hand side I've got all the sports from NFL to NBA. Once I click on something. Let me say I scroll down here Bills v. Jets let's say. I can see all these stats look Average Score, Average time of posession. I can see who's injured right now so as a sports fan this means that you don't really need to choose. You don't need to land on only one event You can be following some other sporting event essentially over here on the Sports app on the side. So you can have a little bit more fun with voice search I'll be back The Terminator. It has a hundred percent on Rotten Tomatoes. That's surprising to me I mean I get it Now one of my favorite features is the opportunity to binge watch. You watch a show, you get started. Next thing you know it's the next day Breaking Bad. I can watch-I can pick whatever episode I'm looking for: Season 4 Episode 2 so on I can resume if I started one. I can then go in and look at the cast and crew from the show. Select somebody and then continue to navigate. See all of the other movies this particular actor is appearing in. I can also favorite an actor so that he lives in my favorites section so that if anything gets added I can go check that. This is good too. You can see more like this of course Better Call Saul comes up Just sort of like a smart section that understands what show it is that you were interested in and find ones that are kinda similar that you might like as well. But maybe...you don't know what you want. Maybe you wanna sit back, lean back in the couch and let the system do the work. You can with this little phrase right here: \"What should I watch?\" The universe of things that I should be looking at has just shown up here and look its pretty smart too because it brought up True Detective They know that I've probably wanna go back and do that again. I wouldn't be totally against especially the first season Second season... True Detective is exactly the type of show that binge watching was created for Each episode moves into the other so beautifully. It messes with your dreams a little bit but trust me its worth it. Finding the way that you like to interact with your content and it's different for everybody There's also a trending section. I'm gonna click on this real quick. This is gonna bring up the popular stuff that's on right now that a lot of people are watching so maybe you wanna get into that conversation on Twitter as it's happening down here. You can also select movies so all your seeing in your guided movies if you happen to be a moviebuff I can see events that are on now, programs that are on now. Then I can also move forward in the timeline. See stuff that starts at 5:30, 6:00, and so on. And at the very top there's another filter so I can then go in from here and only select HD stuff or select stuff in a specific language So there you have it. X1 from xfinity as I've said before. This is all about navigating the wide world of content: Movies, television, sports. That whole picture. As I've showed you in this demo here. You can do it with voice You can do it with buttons if you're old school. It's completely up to you but that's the idea So hopefully you guys enjoyed this content. If you did make sure a a thumbs up down below and I'll catch you very shortly on the next episode. Later Guys",
    "transcript_keywords": [
        "sports",
        "movies",
        "Rotten Tomatoes",
        "Select",
        "back",
        "guys",
        "episode",
        "voice",
        "watching",
        "section",
        "show",
        "stuff",
        "True Detective",
        "things",
        "sports fan",
        "sort",
        "Season",
        "Demand",
        "features",
        "Alright"
    ],
    "transcript_entity_values": [
        "Twitter",
        "Season 4",
        "True Detective",
        "xfinity",
        "Comcast",
        "The Terminator",
        "today",
        "first",
        "a hundred percent",
        "NFL",
        "Lou",
        "Average Score",
        "only one",
        "One",
        "the first season Second season",
        "Rotten Tomatoes",
        "Breaking Bad",
        "Drake",
        "one",
        "the next day",
        "5:30, 6:00",
        "NBA",
        "Saul"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "ORDINAL",
        "PERCENT",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG",
        "PERSON"
    ]
}