{
    "id": "xOkHoB6Pp3g",
    "title": "BlackBerry KEY2 Review: 3 Reasons It's My Next Phone",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-06-27T12:59:03Z",
    "video_url": "https://www.youtube.com/watch?v=xOkHoB6Pp3g",
    "category": "Science & Technology",
    "tags": [
        "blackberry key2 review",
        "key2 camera",
        "blackberry 2018 review",
        "key2 vs keyone",
        "mrmobile",
        "michael fisher",
        "crackberry"
    ],
    "views": 703978,
    "likes": 13814,
    "comments_count": 1353,
    "description": "The flagship BlackBerry in 2018 is a sleek, slab-sided smartphone with a design from the future  and a keyboard from the past. I say in the narration that the BlackBerry KEY2 probably wont be your next smartphone, and based purely on buying habits in 2018 that's probably true. The thing is, it will be *my* next phone  and Im gonna do this review a little differently by telling you the three reasons why. Join me for the MrMobile BlackBerry KEY2 Review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S BLACKBERRY KEY2 REVIEW]  MrMobile's BlackBerry KEY2 Review was produced following eight days with a BlackBerry KEY2 review device provided by BlackBerry. It was tested on T-Mobile US in New York City, NY; Greater Boston, MA; Frankfurt, Germany; and Milan, Italy.    [PRODUCTS IN THIS VIDEO]  BlackBerry KEY2:    [MUSIC IN THIS VIDEO]  E-Business by Olive Musique, available at Premium Beat:   \"Feels Like A Comeback\" by Brightside Studio, available on Premium Beat:   Skyrocketing by Vincent Tone, available at Premium beat:     [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/4q8",
        "https://www.premiumbeat.com/royalty_free_music/songs/e-business",
        "https://www.premiumbeat.com/royalty-free-tracks/feels-like-a-comeback",
        "https://www.premiumbeat.com/royalty-free-tracks/skyrocketing",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Narrator] This is BlackBerry in 2018. Sleek, slab sided, and super modern with 35 tiny exceptions. If we're being honest, the BlackBerry KEY2 probably won't be your next smart phone, but it will be mine. And I'm gonna do this review a little differently by telling you three reasons why. (upbeat music) Now before you go thinking this is a puff piece folks, I'll encourage you to stay tuned for the whole video. This is a review, not a commercial and some of my reasons to buy will no doubt be reasons for you to stay home. Reason number three, you knew it was coming, the keyboard. It's modeled after the one on the BlackBerry Bold 9900 and that's worth more than just a ticket on a nostalgia trip. The physical keyboard is why you buy a BlackBerry in 2018 and for me, it's all about the tactility. See, no matter how good a phone's haptics are, typing a piece of glass still always feels like typing on glass. Autocorrect sucks, you can't really do it without looking. It's just not as satisfying. I did have a pretty steep re-learning curve. It took me more than a full week to get used to real buttons again. That's partly because the KEY2 is lighter than it looks so it bounces around a bit more in the hand. But once I adapted, I was almost as fast and substantially more accurate on the KEY2 than my Pixel 2 XL. And you do get a consolation prize for all the screen real estate that keyboard consumes. Just like on the KEY1, it doubles as a track pad for scrolling and if you want, swipe style typing. That's pretty much the only way to use this keyboard one handed, by the way. One thumb typing is much slower when you actually have to click your keys and if you're gonna use the new speed key, you still need two fingers, one to click the toggle, one to press the app shortcut you want. So the KEY2 is less suited to a run and gun, one-handed lifestyle, more something you pull out when you've got both hands free to get down with some emails. Reason number two, it doesn't have a notch. JK, LOL, but that is true, though. The real reason number two, BlackBerry fixed my biggest complaint about the KEY1. See, a BlackBerry was my first smart phone, so I'll always have an affinity for the trappings of that experience, the logo, the red LED, the convenience key you can do anything you want with, but that wasn't enough for me to get past just how slow the KEY1's software was. Well not KEY2. I pushed this phone hard, even going so far as to watch a YouTube video, picture-in-picture, while navigating a route in Google Maps and keeping a podcast loaded in the background. The KEY2 kept up. I will say that I have disabled some of the features that ship with the phone, such as the Hub, and I don't even use BlackBerry's own home screen anymore, preferring Nova Launcher. So depending on how much of that stuff you keep online, your mileage may vary. I haven't kicked all the custom features to the curb though. I kinda dig the privacy shade. Swipe down with three fingers to give yourself a little peephole so you can read sensitive documents in public without your neighbors peeking. I love Redactor, a tool for blanking out secret agent names in all your nefarious documents. It's cool to have a protected enclave on the device for your secret stuff called the Locker. Also cool, the fingerprint sensor that lets you into that safe is still on the space bar, a genius use of space. And the coolest ever, tap on that fingerprint sensor when you're in the camera, and the phone will take a secret photo that goes right into the secret locker. If you're wondering whether BlackBerry sacrificed some of the KEY1's legendary battery life to get the speedy performance, my answer is not that I can tell. Only on my heaviest day did I manage to kill the phone before 11 p.m. and that day started at six a.m. and included 3 1/2 hours of mobile hotspot and three hours of streaming podcasts over Bluetooth. On a lighter day, I manage to hit seven hours of screen on time before power down. And finally, reason number one I'm gonna carry the KEY2, well, I have the luxury of carrying two phones. With a device like the Pixel 2 XL in my second pocket, I can more easily overlook the ways the KEY2 disappoints. The dim display that's kinda tough to read in the sun, the slow platform updates, the weird way you have to hold it when you're playing a game. Then, there's the inconsistent way those BlackBerry features play with Android, that fancy scrolling keyboard doesn't always work, like in some PDF readers or on Instagram TV. And in some apps, like Netflix, it actually scrolls backwards. And the biggest reason I'm glad I still live the captain two phones lifestyle, the camera. In a vacuum, the KEY2's dual camera array is fine. You can get good photos from it if the stars align. You can get nice 4K video if you have a steady hand that compensates for the lack of stabilization, which, by the way, you do not. The slow motion video is good to have on hand for rocket launches, low res, though it is. The scanner mode is useful for capturing text on documents. The selfie shooter gets the job done. Even the portrait mode works better than I expected. Yeah, there's good stuff here. But the second you put the KEY2's pictures up against the Google Pixel 2's, even during the day, you're just not in the same ballpark. And at night, well, you're not even playing the same sport. And this is all using the KEY2's primary lens. Switch over to the telephoto, and I can't even come up with a witty way to say it, it's just not good. Is it unfair to compare the BlackBerry KEY2 to the best smartphone camera on the market? If the KEY2 was priced like its predecessor, or brought it some more goodies like a brighter, better display, sure. But BlackBerry wants a whole nother Benjamin for this thing then it asked for the KEY1 and that puts it right at parody with the Pixel 2. Maybe BlackBerry is banking on the fact that this is effectively the only good phone you can buy with the physical keyboard. Or maybe it's hoping its enhanced security promises will help it get traction among the privacy conscience. Maybe it's hoping some folks buy it based on call quality alone, which by the way, is very good. But for my part, I'll be carrying the KEY2 because it's different, because I'm a little fanatical about the QWERTY keyboard, and because I can carry a second phone to do the things the KEY2 can't. I hate to say it, but at 649, that's a lot of asks for folks with more pragmatic priorities than mine. Is the BlackBerry KEY2 your next smart phone? Let me know why or why not in the comments and be sure you're subscribed so you don't miss the next video. I have a feeling this won't be my last BlackBerry video of 2018. Til next time, thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "BlackBerry",
        "phone",
        "Reason number",
        "keyboard",
        "good",
        "Reason",
        "smart phone",
        "video",
        "Pixel",
        "reasons",
        "number",
        "typing",
        "BlackBerry Bold",
        "buy",
        "secret",
        "day",
        "camera",
        "stay",
        "BlackBerry video",
        "good phone"
    ],
    "transcript_entity_values": [
        "Locker",
        "BlackBerry",
        "11 p.m.",
        "Google Maps",
        "3 1/2 hours",
        "KEY2",
        "Pixel 2 XL",
        "six a.m.",
        "number two",
        "649",
        "QWERTY",
        "2018",
        "YouTube",
        "three hours",
        "One",
        "first",
        "two",
        "the day",
        "35",
        "Benjamin",
        "Nova Launcher",
        "more than a full week",
        "second",
        "the BlackBerry Bold 9900",
        "seven hours",
        "Netflix",
        "KEY2",
        "PDF",
        "number one",
        "the BlackBerry KEY2",
        "Instagram TV",
        "three",
        "one",
        "Android",
        "a lighter day"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "TIME",
        "GPE",
        "TIME",
        "GPE",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "TIME",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "LAW",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE"
    ]
}