{
    "id": "XPECNs2TrdQ",
    "title": "Crazy iPhone 7 Lighter Case",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-11-27T00:09:06Z",
    "video_url": "https://www.youtube.com/watch?v=XPECNs2TrdQ",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "iphone 7",
        "apple",
        "apple iphone 7",
        "iphone7",
        "iphone",
        "iphone 7 case",
        "iphone case",
        "case",
        "lighter case",
        "iphone lighter case",
        "best iphone case",
        "does it suck",
        "best",
        "2016",
        "video",
        "smartphone",
        "cool gadgets",
        "test",
        "cool",
        "inventions",
        "innovation",
        "futuristic",
        "android",
        "invention",
        "vs",
        "amazing inventions",
        "apple iphone",
        "new inventions",
        "awesome",
        "phone",
        "new gadgets",
        "plus",
        "iphone 7 plus",
        "iphone plus"
    ],
    "views": 3126356,
    "likes": 52040,
    "comments_count": 4334,
    "description": "iPhone 7 Lighter Case (USA Link) -  iPhone 7 Lighter Case (International) -   Here's a crazy one... The Apple iPhone 7 Multifunction Lighter / Bottle Opener Case!  More info from the manufacturer -  This lighter case is a new release from ZVE store. It has been updated and become more slim and light. ZVE always did the good quality to our customers.  If you always forget to take your lighter or opener, do not hesitate to buy this HANDY 3-IN-1 HYBRID. It is more than a Shockproof Protective Case, but also a Bottle Opener and a Cigarette Lighter -- handy and useful for camping, parties or outdoor survival.   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/2gtyGdN",
        "http://geni.us/2AuZB",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "We're about to make a fun video, right here together the last time I received something from these guys, ZVE It was a good time these guys make very unusual cases for iPhones, and they finally got their product ready for the iPhone 7 so, what did I do, I did exatly what you expected me to do bring it to you, 'coz you need to know what's happening in the world of weird i Phone cases this is no exception what made this company famous with the iPhone 6 version they have, as far as I know one of the only cases that is ready for .. party-mode so there it is now... *Laughs while looking at the case* Zone of Variety & Excellence that's what ZVE stands for I think it is available in amazon as well now, right now you say lew, looks like a bizarre, black, iPhone case that is.. chunkier that it should be, OK there's good reason for that below, this little trap door right here it's a coil, like a heated coil and you see the flame icon there you can light something I've got the Don Tomas's back, all right from the original video, the Don Tomas is back for the iPhone 7 version i just want to put this out there, I don't smoke, right and I don't recommend that you do either BUT... there is a purpose I think beyond just smokers for a case like this specifically for those people in uhh.. survivalist realm as a fire starter, look at that, you lift that up... BOOM oh, they re- they've changed the design of that a little bit watch the coil just heat up BOOM so if you are a survivalist type dude you get yourself a little twig you got a light, now you make a fire out of I dont know, you... you survive an extra... 15 min in this zombie apocalypse if only the bears don't get you, did you heard the story about the bear... with the dog.. *Slaps table and laughs* the bear is petting the dog oh, you are being sentimental about it, YOU DON'T LET A BEAR PET YOUR DOG MAN!! a polar bear only knows how to kill there is no barriers.. all right, there is no.. rummaging...seals.. penguins... YOU NAME IT artic fox, it will take what it can get you don't want to mess with.. especially if you're a dog who thinks you are getting pet let me tell you something you are not getting pet... you get a massage like a peace of sweet veal just getting ready for dinner time... we just want to believe, some alternative reality beyond the one that we actually have in which polar bears and bears and this other dangerous creatures are this friendly things that only exist in story books and have a voice our story time is over it's time to grow up anyway, so you got a lighter on it now they took an step further all right, for the iPhone 7 since it's party time, you also have a bottle opener in the top let's give them the warning jack tabacco smoke affects everyone all right, listen kids out there iPhone 7, I've got a mate black version over here its about to get upgraded.. just clips right in, it's actually kinda nice little grip on it oh, wait this is an upgrade.. it looks like they've put a lightning oh my goodness .. so you don't need a separate cable ZVE you outdone yourself in that model now the question is, does it work? let's crack a Don Tomas here... moment of truth here we go *Lighting Cigar* they did it again am I about to set up the fire alarm again? look it works ok, hang on.. since it's party time over here... Ohhh... That's a nice one that's actually a good bottle opener the Schnitzer Bru german like my last name Schnitzer Bru!! somebody tell me what it means in the comments.. all right HERE WE GO *takes a swig* jack that's a... hhmmm that's a very unique flavor there is almost like a sweetness to it go ahead Jack, have yourself a swig... DRINKING ON THE JOB! I'm giving thanks right now.. one more.. all right Jack here you go... for giving thanks enjoy it *bottles clink* the party case, I mean, its pretty self-explanatory Is it perfect for thanksgiving? Is it perfect for Christmas? Is it perfect for hanukkah and... everything else that people celebrate? Yes, I think it is I'm defenitly gonna set off the alarm though that's the thing.. and i'm gonna blame ZVE designs.. to the non smokers think about it, camp fire style outdoorsy types maybe you're one of these guys with all those scented candles... like Jack hey.. what's he got goin' on with a little scented.... How smoky is it here right now? I gotta put this out I gotta put this out oh the candle smells like chamomile, we love it.. we love it.. *tormenting laughter* the iPhone lighter case where did you see it? UNBOX THERAPY that's right... i'm outta here",
    "transcript_keywords": [
        "weird i Phone",
        "Phone cases",
        "iPhone",
        "Don Tomas",
        "world of weird",
        "exception what made",
        "made this company",
        "company famous",
        "case",
        "time",
        "unusual cases",
        "iPhone lighter case",
        "Don Tomas back",
        "Phone",
        "iPhone case",
        "ZVE",
        "Zone of Variety",
        "jack",
        "fun video",
        "bear"
    ],
    "transcript_entity_values": [
        "hanukkah",
        "lew",
        "Schnitzer Bru german",
        "Variety & Excellence",
        "the iPhone 7",
        "amazon",
        "iPhone",
        "iPhone 7",
        "Lighting Cigar",
        "jack",
        "Jack",
        "the Don Tomas",
        "the Don Tomas's",
        "artic fox",
        "a Don Tomas",
        "iPhones",
        "Christmas",
        "thanksgiving",
        "jack tabacco",
        "15 min",
        "Schnitzer Bru"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "EVENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "QUANTITY",
        "PRODUCT"
    ]
}