{
    "id": "XQ9t6Ja_6Fk",
    "title": "Liquid vs. Air: Which $50 CPU Cooler Is Better?!",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2021-11-16T00:28:07Z",
    "video_url": "https://www.youtube.com/watch?v=XQ9t6Ja_6Fk",
    "category": "Science & Technology",
    "tags": [
        "aio",
        "air cooler",
        "cpu cooler",
        "cpu air cooler",
        "cpu tower",
        "tower cooler",
        "deepcool",
        "scythe",
        "scythe mugen 5",
        "$50",
        "$50 air cooler",
        "credit",
        "$50 aio",
        "aio vs air cooler",
        "gaming pc",
        "computer",
        "how to build a pc",
        "aio cooler",
        "water cooling",
        "pc build",
        "best cpu cooler",
        "pc gaming",
        "air cooling vs liquid cooling",
        "air vs liquid cooling",
        "Air cooler vs aio cooler",
        "liquid cpu cooler",
        "greg salazar",
        "science studio",
        "best cpu coolers",
        "air or liquid cooling",
        "air cooler vs aio cooler"
    ],
    "views": 127967,
    "likes": 5129,
    "comments_count": 453,
    "description": "SPONSOR: Check out Ridge Wallets at    Use code 'SALAZAR' to save 10%!  At time of filming, both the Deepcool Castle 120R and Scythe Mugen 5 BE were on sale for $50. So which is the better buy? Let's find out!   Consider supporting us on Patreon!   SPONSOR: Snag an OEM Windows 10 Pro key and use code 'SKGS' for a sweet discount:   Check out the coolers tested in this video on Amazon: Scythe Mugen 5 BE:  Deepcool Castle 120R:    PC parts list:  AMD Ryzen 5 2600:  ASUS TUF B550M-PLUS WiFi:  16GB Silicon Power DDR4:  Graphics Card: Gigabyte RX 6600 XT Cooler Master Q300L:  EVGA 500W BR:  Team Group MP33 512GB:    My studio gear on Amazon: Sony a6600 (Primary):  Sony a6400 (Secondary):  2x Pixio PX277 Prime 165Hz IPS Monitors:  Neewer LED Lighting Kit:  Audio-Technica AT2035:  Yamaha MG10XU Mixer:  Neewer Microphone Arms:  Arrowzoom Sound-Damping Foam Panels:    Follow me on social media: TWITCH:  FACEBOOK:  TWITTER:  INSTAGRAM:    Join our public Discord server:   DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our Rakuten account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.",
    "description_links": [
        "https://ridge.com/salazar",
        "https://www.patreon.com/gregsalazar",
        "https://bit.ly/3nfdVmg",
        "https://geni.us/m6cpLF",
        "https://geni.us/72bCuv",
        "https://geni.us/bteaEC",
        "https://geni.us/t3CC",
        "https://geni.us/fHc6",
        "https://geni.us/Aquun",
        "https://geni.us/QiuBpdS",
        "https://geni.us/Ji1os",
        "https://geni.us/k8VBToq",
        "https://geni.us/24nqw",
        "https://geni.us/bCg4nD",
        "http://geni.us/9VTXr0",
        "http://geni.us/xvQc",
        "http://geni.us/d4VvGM",
        "http://geni.us/1w5Sx2Y",
        "http://geni.us/EKFxZc",
        "http://www.twitch.tv/GregSalazar",
        "http://www.facebook.com/GregSalazarYT",
        "http://www.twitter.com/GregSalazarYT",
        "http://www.instagram.com/GregSalazarYT",
        "https://discord.gg/jYA9Xvp"
    ],
    "transcript": "Which one's the better buy, a $50 air cooler or the $50 AIO? It's a good question and part of the reason why I wanted to make this video is because I noticed that DEEPCOOL at the time of preparing to film this one, was running a good sale on their CASTLE 120Rs. So this is a 120 millimeter all-in-one liquid cooling solution for your CPU. It supports up to AM4 and I don't believe the latest Intel CPU's yet, although I'm sure it would be very easy to add that support to a later revision of this, But it's very compact, it's very sleek and still quite effective. And that's why these are great for mid-towers and ITX builds. Those CPUs that have mid to low TDPs. Now off to my left here is the Scythe Mugen 5, but more specifically the Black Edition of the Mugen 5, which means that it looks freaking awesome. Check out this shot I took here. This is actually our test bed, our test rig that we used for both of these coolers and this thing just, it just blends in so nicely. I am such a sucker for black tower coolers. I like the Be Quiet! Ones, I like the Hyper 212 Black Edition, there are a few others that come to mind, but yeah, this one from Scythe is just, they really nailed it in the aesthetics department. But how a cooler looks is often not as important as how it performs and that's why this video exists. I think you will enjoy it. I think you'll be surprised by the results as well. Stay with me. Ridge Wallet makes sleek compact wallets good for up to 12 cards plus room for cash. Choose between over 30 designs, including Burnt Titanium, Brushed Carbon and this cool typography texture. I've been repping Ridge Wallets for several months now. And in my opinion, there's really no substitute for something that's compact, portable, and efficient. Best of all, you'll enjoy durable materials and a lifetime warranty for peace of mind. No wonder they're backed by over 40,000 5-star reviews. So check them out via the link below or visit ridge.com/salazar and use code Salazar, that's S-A-L-A-Z-A-R to save 10%. We're gonna jump right into the meat and potatoes of this one starting first with a side-by-side comparison of specifications. And remember that these coolers are totally different in terms of philosophy, how they get rid of heat, how they move it and relocate it from one area to another. Obviously the CPU is what's generating the heat and you need some sort of medium to move that heat away from the source. AIOs often used water or glycol solution and tower coolers typically use either copper or nickel plated copper heat pipes. The Mugen 5 has six of these along with a fairly large aluminum fin stack whereas the CASTLE 120R here, oh, everything's a bit more compact. So you have closer spaced aluminum fins, but then again, you also have quite a bit of water to absorb a lot of that heat. Water has a very high heat capacity so it takes a lot of energy to raise water by a single degree Celsius, assuming a fixed volume. The two variables we're looking to isolate here are sound and temperature, and we're gonna use AIDA64 to create a very sustained load, a very constant sustained load on the CPU. We'll also put a load of course, on the FPU, which is a part of the CPU, depending on how you categorize that, the cache, the RAM and the GPU. We'll also stress a disks just because why not? So this system for both scenarios, will for all intents and purposes, be under a full load. It's important to note that the graphics card really doesn't get super stressed in AIDA64, but it will be generating some heat and that could play into our results here. My train of thought here was that most folks who buy products like these are probably gonna game at some point, they're building a custom PC, but what they do with it, I mean it's of course, subjective. Are you gonna do things that only stress the CPU or only stress the graphics card? So I think it's important to stress both at least somewhat so that we get a fair representation under most scenarios where both will come into play. Gaming, for instance, is one of those where you're probably going to have a heavily stress CPU and GPU with few exceptions. Something else to add, both of these products include its own 120 millimeter fan. And while it would be easy to just fan standardize, which means do you use the same fan in both scenarios, I don't think that's a fair representation of the average builder with this kind of budget. If you're spending 50 bucks on a cooler, specifically a 120 mil AIO. I think this is, I mean, this is as small as it gets for the most part. You can buy smaller than this, but they're very niche. You're probably not gonna spend 30 or 40 bucks extra for a super optimized, very quiet fan. So I'm going to use the ones that are included in the boxes, the Mugen 5 we'll be using the Scythe fan and for the 120R we'll be using the DEEPCOOL fan. I'm not gonna take up too much time talking about our test bed here, you can find the specifications in the video description if you wanna buy anything that's included in this rig. We do have a Ryzen 5 2600 in here, a B550M motherboard from Asus. We have a 6600 XT from GIGABYTE and a 500 watt power supply from EVGA. The case is a Cooler Master Q300L. Airflow is subpar if I do say so myself. It's not optimal, but because we're only using one fan in either instance, I think that it's still a level playing field. So let's get into those numbers. Let's start with temperature, I was sure to run each of these tests for an hour, and this really isn't as important for air coolers, which usually heat up and saturate themselves fully after I don't know, 10 or 20 minutes, but AIO it's important you let these run for at least 30 minutes, but I always go for an hour just because, especially for the larger AIOs, you're gonna want that water to reach a thermal equilibrium, otherwise you'll be seeing temperatures that don't really reflect what the true state of the CPU is long-term. You can see in AIDA64 both CPU diode and package temperatures reached 76 degrees peak. So this is peak temperature here. It's as hot as it ever got for the entire one hour or so run. And if we juxtapose this with the air cooler run, you can see the temperatures were actually pretty much the same. About 77 degrees Celsius in the Mugen 5's case. So for all intensive purposes, I mean a one degree Celsius delta, within the margin of error I would say. One other thing to note, while again, temperatures were more or less the same. I noticed the CPU clock speed in the Mugen 5's case was slightly lower than that of the CASTLE 120R. So after an hour had passed under full load, the CPU was throttling frequency back to 3,650 megahertz or so in the Mugen 5's case. Whereas in the 120RS case frequency is about 50 megahertz higher. Now this isn't something you're likely to notice in real-world usage, but it is a slight advantage toward the AIO. And again, this is what the exact same fan curve for both scenarios. Now remember that each of these fans is different that's just a consequence of whichever cooler you decided to go with though they are both 120 millimeter fans and PWM controlled, they do both have different operating RPMs. So as CPU temperature increases, we would expect that our normal fan curve will kick in and try to make up for that excess heat being dumped into whatever cooler is at play. And that is why it's also important to measure sound or in this case apparent loudness with our sound meter. It doesn't really make sense to call the AIO the winner, if, while it is slightly cooler, it runs louder. So of course, right, there's that trade-off there that you have to keep in mind. And that's why, again, we whipped out the sound meter and measured both of these coolers after an hour long burn-in each. It goes without saying, of course, all of these tests were run with the left side panel installed, including this audio test here. And would you look at that? And the Mugen 5 five, yes was slightly hotter, but it was also slightly louder. And this was something I could distinguish myself, I could tell very clearly that the tower was louder. It also had a higher pitch than the DEEPCOOL fan did. Another thing I wanted to look at was operating RPM. So the Scythe Mugen 5 fan was actually operating at around 1200 RPM and the DEEPCOOL fan was operating around the same. So this comes down to just fan design and where the fan is located in this case as well. 'Cause you have to remember that the Scythe fan is located right in front of the tower, more or less in the middle of the chassis. And the DEEPCOOL fan is located more toward the backside of the case where you would expect natural exhaust fans to be placed. Now, obviously this isn't representative of all tower coolers out there, and that's not what this video is seeking to do. There are many tower coolers I could name that are quieter than even 240 millimeter AIOs under the same load. So keep in mind that this is a very product specific test we're running here. And again, I felt like it would be fun to match these two up because they were the same price when I decided to make this video. So with this data in mind, the CASTLE 120R at 50 bucks is a better buy than a $50 Mugen 5 Black Edition. That's not really what I expected and the AIO operated quieter and it kept temperatures lower. This only being a 120 mill radiator here, I figured that because it was smaller, more compact, it wouldn't be able to withstand as much heat and it would result in higher package temperatures. But the opposite was actually the case, which again is not what I expected. I went into this thinking that because the Scythe Mugen 5 had the larger heat sink by apparent size, and we're not talking fin density, it was just a larger heat sink in general. I assumed that it would be the better cooler and that it would run quieter as well but the opposite is true. So let's try one more thing because why not, I'm curious. If we swap fans, that is if I put the CASTLE 120R's fan over the tower of the Mugen 5, will that make up for the delta? If it does then that suggests the size advantage is not as good for these kinds of scenarios and maybe even this kind of case, but if it doesn't solve the issue, then it's likely that the Scythe Mugen 5's heat sink is just not prepared enough to handle the thermal load of a 2600 as well as the 120R's. I would be fairly surprised if that was the case, because again, this radiator is just so small and so compact, but maybe fin density is playing a bigger role than we thought in this case. So let's remove this fan, should be fairly straight forward, disconnect it up top here and just kind of sorta slide it on out. There we go. And we'll recycle the mounting clips for our DEEPCOOL fan here. Should just snap into place. There we go. And one more down here. Reconnect it to the same fan header to make sure that these cables don't get snagged while we're running these tests and we'll be on our way. So, with everything else exactly the same, save again, that fan swap, package and diode temperatures reached 76 degrees Celsius, which is identical to the temperatures we got with the CASTLE 120R. All of these temperatures are within one degree Celsius of each other so we can chalk most of this up again to the margin of error, but the DEEPCOLD fan does seem to be slightly more effective at moving air. That said, if we look at our sound test, the sound profile of this cooler with the DEEPCOOL fan is pretty much the same as it was with the Scythe fan. So not much of an audible difference here. Both were quite loud by comparison, using the DEEPCOLD fan with the DEEPCOOL AIO was actually the quietest of the three scenarios. I wanna stress again, that this is a very product specific test. My goal here is not to show that liquid cooling is better than air cooling or vice versa. Personally, I've done a lot of both. And while I do see some benefit using AIOs, especially larger AOS or larger radiators in those all-in-one liquid coolers. In the long run, they still have an extra failure point, that being the pump. There's a potential for leaks as well, and that could damage other components. Whereas in the case of most air towers, you just got to worry about a fan dying. And if that happens well for one, it's gonna be pretty obvious. And for two, it's not really gonna take much else with it. Save possibly your CPU if for whatever reason, it doesn't thermal throttle and shut itself down to save itself. Now, if I personally had to choose between these two, I'd say it's very build dependent. For a build like this in the Cooler Master Q300L, I'd choose the 120 mil AIO. I think it's a bit sleeker, it looks nice in here. And of course we have the space for it, but you also have to take into account the fact that this can leak. The pump can die, and that can be problematic in the long run and the failure rates of these are quite low because the only moving component is the fan. The other side of this is that for $50, I mean, this is one of the cheapest AIO's you can buy for 50 bucks. That is a win in DEEPCOOLs case, I think. That's the competitive advantage that it has apart from some of the other smaller technological feats, if you wanna call them those, the Anti-Leak tech is actually pretty cool. A little bladder in there expands when the fluid gets too hot 'cause the fluid in here does slightly expand when it reaches the thermal equilibrium so that stuff's in here and that's cool and all, but I think the real selling point here is the price. It's one of the cheapest AIOs you can buy. Whereas in the Mugen 5's case, it gets a bit more dicey. I personally think that a $50 price tag for this is a bit of a, it's kind of a letdown. If you're gonna spend 50 bucks on an air cooler you could probably justify spending a tad bit more than that. And if you can justify spending a tad bit more than that, you're probably looking at Noctua or Be Quiet! or some other very premium, very quiet air cooler, air cooler brand, I should say. And they make plenty of good stuff in the 60 to $80 range. This ventures awfully close to that price territory. You also have to consider there are cheaper counterparts to this, that perform almost as well. In my testing, the Cooler Master Hyper 212 Black Edition performs about 90 to 95% as good as this. And that's another thing you have to consider is that you have cheaper options that perform nearly as good. They might not be as quiet because again, smaller heat sinks. The fans have to work a bit harder. I think what Scythe's done here, they've made a really good product. It's just a tad bit expensive at 50 bucks. You're venturing into again, that higher end air cooler territory. And you're also venturing into AIO territory. And even a 120 mil AIO could keep up and even out perform slightly an air cooler like this. So that's where I have to leave it. I didn't expect to conclude it this way. I thought that the CASTLE 120R would fall a bit short, frankly, but that wasn't the case. And I have to follow the data. Our data suggests that the 120 mil AIO is the better buy. Well, that was a lot of fun, like we don't run a lot of these tests anymore, it's because so many channels are doing the same thing nowadays and at this point I just defer to them. It's too much to keep up with and we don't have an entire team that can run all these benchmarks. I have to do everything myself here. So I'm just already kind of on the back foot in that department. That said whenever I see a decent deal, and I think it's worth juxtaposing two products that are again, essentially the same price. I think it can make for a fun video. We can kind of experiment a bit and see what's what, what's causing things to behave the way that they are. And yeah, hopefully you enjoyed this one as much as I did. If you did be sure to give this one a thumbs up, I would appreciate that. Consider subscribing if you have not already and stay tuned for more of the good stuff here on the channel. My name is Greg, thanks for learning with me.",
    "transcript_keywords": [
        "fan",
        "DEEPCOOL fan",
        "Scythe Mugen",
        "Mugen",
        "CPU",
        "cooler",
        "AIO",
        "air cooler",
        "case",
        "Scythe fan",
        "heat",
        "Scythe",
        "coolers",
        "Black Edition",
        "DEEPCOOL",
        "tower coolers",
        "bit",
        "air",
        "CASTLE",
        "Cooler Master"
    ],
    "transcript_entity_values": [
        "Ridge Wallet",
        "several months",
        "first",
        "ITX",
        "six",
        "6600",
        "GIGABYTE",
        "120RS",
        "one degree Celsius",
        "three",
        "120 mil",
        "60 to $80",
        "95%",
        "at least 30 minutes",
        "XT",
        "10%",
        "120",
        "about 50 megahertz",
        "500 watt",
        "Ridge Wallets",
        "CASTLE",
        "2600",
        "PWM",
        "120R",
        "One",
        "two",
        "30 or 40 bucks",
        "About 77 degrees Celsius",
        "40,000 5",
        "between over 30",
        "Cooler",
        "CPU",
        "a single degree Celsius",
        "5",
        "Burnt Titanium, Brushed Carbon",
        "DEEPCOOLs",
        "about 90",
        "76 degrees",
        "240 millimeter",
        "Mugen",
        "one",
        "50",
        "the Hyper 212 Black Edition",
        "Scythe",
        "Salazar",
        "GPU",
        "10 or 20 minutes",
        "Mugen 5 Black Edition",
        "76 degrees Celsius",
        "DEEPCOLD",
        "RAM",
        "120R",
        "EVGA",
        "1200",
        "AOS",
        "Intel",
        "120 millimeter",
        "AIO",
        "Greg",
        "DEEPCOOL",
        "50 bucks",
        "up to 12",
        "5",
        "an hour",
        "3,650 megahertz",
        "Asus",
        "Noctua",
        "the entire one hour"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PERCENT",
        "TIME",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "ORG",
        "ORG",
        "TIME"
    ]
}