{
    "id": "xQMQW4sbXf8",
    "title": "eBay is FULL of Cheap Hard Drives! What's the Catch?",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-11-06T18:00:18Z",
    "video_url": "https://www.youtube.com/watch?v=xQMQW4sbXf8",
    "category": "Science & Technology",
    "tags": [
        "Hard drive",
        "HDD",
        "Used hard drive",
        "Used HDD",
        "ebay hard drive",
        "ebay hdd",
        "used hard drive safe",
        "used hard drive worth",
        "cheapest hard drives",
        "cheapest storage",
        "cheap HDD"
    ],
    "views": 1529127,
    "likes": 53008,
    "comments_count": 1971,
    "description": "Get $25 off all pairs of Vessi Footwear with offer code LinusTechTips at   Save 10% and Free Worldwide Shipping at Ridge Wallet by using offer code LINUS at   Weve said more than once to never buy a used hard drive. But file sizes are increasing across the board, so could it actually make more sense to turn to the used market  like ebay or craigslist - for more storage capacityeven if the hard drives were used for crypto mining?  Discuss on the forum:   Buy a new Seagate Exos:  Buy a new WD Blue:  Buy a used hard drive on eBay:  Buy a used Seagate Exos:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 2:02 Hard drive mining 2:54 What we got  4:13 Shipping and buyer protection 5:10 SMART data 6:27 Did we get mined drives? 8:34 Let's use them for something! 9:50 A darn good deal 10:36 Aww shucks 11:34 Is it worth? 12:47 Outro",
    "description_links": [
        "https://www.Vessi.com/LinusTechTips",
        "https://www.ridge.com/LINUS",
        "https://linustechtips.com/topic/1465898-i-found-cheap-hard-drives-on-ebay/",
        "https://geni.us/fs97sH",
        "https://geni.us/B5pJtA",
        "https://geni.us/7TkSVg",
        "https://geni.us/Aioa",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- We've told you this so many times, buying used hard drives is not worth risking your data. But sometimes, you see an offer you just cannot refuse. We took that risk and bought eight used hard drives from eBay, totaling 136 terabytes for $2,000. That's almost half the price compared to new, really impressive savings. But, just like buying a used GPU on eBay, there's a real chance that new to you high capacity hard drives were used for cryptomining. So is even this great deal worth it, if there's a chance your parts arrive with one foot already in the grave? I'll tell you where and why these drives are popping up for sale, what red flags to look out for, and when you should consider making an exception to the don't buy used hard drives rule, right after I tell you how to make an exceptional segue to our sponsor. - Ridge. Ridge Wallet has redefined the traditional wallet with its compact frame and RFID blocking plates. The bulge in your pants shouldn't be from your wallet dang it. Use offer code Linus to save 10% and get free worldwide shipping. (logo twinkling) (upbeat music) (upbeat music) - The shameful truth is, this isn't even the first time we've bought used storage, my personal hard drives are from a dead NAS and are currently dying. Years ago, Linus splurged on 24 used SSDs for a server at home, but the only reason he was comfortable taking that risk was that he had been reassured by another buyer the SSDs were in good health, so he bought them. This time though we don't have that luxury, but what we do have are some very attractive prices. $200 for 16 terabytes when the cheapest new drive of the same capacity would be in the neighborhood of $300. So why are they so cheap? Uh, supply and demand, wow. A huge volume of drives are being dumped on eBay, Marketplace, and the like. Some from everyday people, some that were refurbished, and some from unscrupulous users that used the hard drive to mine cryptocurrencies. Ugh. But how much does that hurt them? Well, there are many coins you can mine on a hard drive today, we've tried it in the past, the most popular by far is Chia mining. It was so popular at launch in May, 2021, that Seagate was even considering making an entire line of cryptocurrency specific hard drives. Sure, anyway. Chia mined hard drives should be pretty safe to buy since Chia runs on a proof of space algorithm. So once the drives are filled with the plot data from Chia to prove the space or capacity, very little read or write activity is required while mining that space on the drive. That means that drives used in Chia mining are barely used, which is enough justification for us to roll the dice on eBay. We settled on two 16 terabyte WD Ultrastar HC550, two 16 terabyte Seagate Exos, 16 Xs, that one? Yeah, this one right here, and four 18 terabyte Toshibas, oh (beep) me. And now they're here, let's compare what was advertised with what we actually got. Our two WDs were listed with up to 2100 hours of power on. Yeah, not so much. We got drives with 2300 and 2600 hours, a bit above the stated value, but in the grand scheme of things, those extra 10 or 20 days of power on time aren't really a big deal. On the flip side, the Seagates were expected to arrive with up to 11,000 power on hours, and instead they just had, like, 234, 213 hours. Damn, score. But still, is that a lot or a little? In the enterprise world, the expected lifetime is around 45,000 hours, but, anecdotally, some of our staff have drives with 50 to 60,000 hours. Ultimately, it's hard to say when a drive is too old to use. Higher hour drives are typically cheaper but they also might not last as long. Only you can decide if it's worth it for your needs, but we'd recommend 20, maybe 25,000 hours as a safe ceiling. Lastly, our four Toshiba drives, the packaging just speaks for itself. This is what our other drives came in, you can see here ESD bags, this foam to hold your hard drives in, and this is how the Toshibas arrived. Not great for mechanical devices with moving parts, like, just look at the SATA connectors on this one. I noticed that the corner is just completely bashed in on this one. Oh, it's just actually broken (laughs). Fantastic. A quick sound check on the Toshibas tells us the other drives were damaged as well. (hard drive squeaking) (hard drive squeaking) Huge bummer. Unfortunately, this buyer didn't accept our returns, but no matter, the buyer protection on eBay is excellent and we were able to use the money back guarantee to get our cash back. But physical condition and power on hours aren't the only way to diagnose our drives, it's time to pull the rest of the smart data. Thanks to the cloud backup and storage systems experts at Backblaze, we know that some parameters are better indicator of failures than others. The combination of attributes 5, 187, 188, 197, and 198 can accurately predict an impending drive failure 76.7% of the time. And how did our other drives fair? Flying colors. It's golf rules and we have zeros across the board, or at least as far as we could tell. See, every drive manufacturer has different ideas about which of the many specific smart attributes they should monitor. Seagate gave us all five, while neither WD or Toshiba include 187 and 188. One blemish though, was that despite its low power cycle and on hours count, attribute 199 on one of our Seagate Exos drives was flagged as concerning. This rather nebulous error count increases when there are infant decimally short drops in communication between the controller on the hard drive and the SATA controller on the motherboard during a data transfer operation. These drops are almost exclusively caused by things like a bad or loose SATA connection, or a faulty SATA controller on the host system. So, ultimately they're safe to ignore so long as they aren't reoccurring and if you confirm the cabling and the controller are both good. The final thing we can glean from our smart data is the evidence of cryptomining, farming, well, whatever. We're looking at three specific signs, high power on hours, a relatively low number of total reads compared to those power on hours, and a total write amount that is roughly equal to the size of the drive, although that's no guarantee. With a quick conversion and a little math, we can see our Seagate drives have a total reads and writes that are staggeringly high given their 250-ish power on hours. It's also roughly twice their capacity, which, according to our friend Wendell from Level1 Techs, could be due to one of the integrity checks that might run while refurbishing a drive. And lo and behold, they've been etched to say they're re-certified. Weird, since there was nothing about that in the listing. Well, well, we can only speculate on their history, but it's possible these are gray market drives, from a batch of drives that had their tilt indicators tripped during shipping or were sent back as an open box return. Drive failure is mostly common when a drive is new, they maybe DOA, or fail, within a couple days of use. So these drives could have been through all of that before being re-certified and then sold to us. Checking the Seagate website for warranties has both drives report back not warrantied by Seagate, which in theory means that the re-certifying company offers an alternative warranty, and this 30 day seller warranty is exactly that. 30 days isn't quite the five years that Seagate offers from authorized sellers, but it's a heck of a lot more than zero days. Lastly, our WD drives continued their trend of ignoring useful features and chose not to log total reads and writes. Thanks WD. This makes it difficult for us to even speculate on their history, but at only 100 or so days of power on time, it seems unlikely they were part of a farm because having the patience to allow those rewards to slowly accumulate is essential for returning a profit, especially when factoring in upfront costs and power consumption. And you should factor in the power you feel with a screwdriver from lttstore.com (chuckles). They're actually very good. Now it's time to do something with these drives. Seeing as we have this much storage on hand, let's do it to make just a janky DIY NAS, and compare its price to an off the shelf pre-built NAS. The keen eyed among you may have already noticed though that we paid more for our 16 terabyte drives than our 18s. So it seems like a good time to note that we had some time constraints that prevented us from getting the absolute best bang for a buck on the hard drive. Namely, we wanted to get a variety of different drives from different sellers, and they had to be able to ship it to us up in Canada, further limiting our choices. Our best deal was easily the recertified Seagate drives that came with an 80 gigabyte per dollar compared to 50 to 55 gigabytes per dollar brand new. That's two used drives for the price of one and a half brand new. And if you happen to need a drive, we'll have the links for both new and used down in the description. Oh, here we go. Oh wow, that's heavy. Good old steel chassis. Assuming we converted our trusty old $69 gaming PC into a NAS, and assuming we loaded it with these 16 terabyte Seagates, which, ideally, would've been the Toshibas, if they worked. And then you factor in some money for cables and a hard drive cage, we are sitting right around 71 gigabytes per dollar. Meanwhile, a preconfigured NAS with that much storage space comes in at $1,622, meaning 39.5 gigabytes per dollar. What could you do with that extra $720? How about buying another three full hard drives, or building a whole other PC? Not to mention that the $69 PC can still do all the normal things you expect a PC to do, while a dedicated NAS has a singular purpose. But it's not just about spending less on your NAS project, you can also afford to buy more drives that you can dedicate to parity, for example, choosing to go with RAID 5 instead of RAID 1. Those used drives may be less reliable overall, but at some point, the extra redundancy makes it the safer move. But there's a few things we haven't touched on so far with this price discussion. Sales on new hard drives and shucking. Shucking hard drives involves buying a drive, generally intended to be used externally, and removing all of the unnecessary bits to just get to the 3.5 inch hard drive inside. As an example, you could pick up one of these 18 terabyte external WD My Books brand new for 280 per drive, meaning 64 gigabytes per dollar, substantially closer to the cost of a used drive than to the cost of one that was intended to be used internal all along. As for sales on new drives, this is essentially a matter of patience. We've seen the price of a brand new 18 terabyte drive fall as low as $300. And new 16 terabyte drives have gone on sale for 245. Again, not as cheap as used, but it's got a lot of benefits, like a full warranty, known history, and zero power on hours. With all that said though, can I ultimately recommend using used hard drives? It's all going to come down to just your personal comfort level with risk. If you are storing something easily replaceable, like Steam games or media files, you might be pretty excited to get a bunch of capacity or redundancy for the same amount of money. But if you're storing family photos or important documents, well, those are worth a heck of a lot more than a game save, to most people, and also just use Steam Cloud saves. And knowing they're on a new drive might help you feel more at ease. Regardless of what drives you end up with, you should have a good 1, 2, 3 backup strategy in place. Three copies of your data on two separate mediums, one stored off-site. I personally prefer the 1, 1, 1. - [Harrison] (laughs) Just one drive? - One drive, already failing, one location. - [Harrison] (laughs). - (laughs) These questions about risk aren't something we can answer for you, it's up to each individual to decide on their own, but for our part, yeah, it's kind of worth the risk. We've definitely had a bunch of change of opinion on used drives, and we'll be considering them in future when a build calls for the most terabytes for our dollars. Just like how this video calls for the most segue to our sponsor. - Vessi. Vessi footwear. They're known for being lightweight, easy to pack, and most importantly worn by me, just joking, most importantly, they're water resistant thanks to Dyma-tex technology. Their Everyday Move line is designed with added support at the midsole and better breathability to keep up with your active lifestyle. Take 'em off and put 'em back on with ease, as you saw, I don't mess with laces anymore, and these are made creature free, so every step you take will be guilt free, they're vegan. And thanks to the dual climate knit material your feet will stay dry during the winter and cool during the summer. So treat your feet with Vessi's Everyday Move shoes and save 25 bucks with our offer code Linus Tech Tips at vessi.com/LinusTechTips. - So huge thanks for watching this video, might have been a little bit deeper than we thought at first, but if you enjoyed this video, maybe you want to look at the last time we built a tiny NAS with a 100 terabytes of space. Sure wish that we bought some used drives for that one. Have a great day.",
    "transcript_keywords": [
        "drives",
        "hard drives",
        "drive",
        "hard",
        "Seagate",
        "hours",
        "power",
        "Seagate drives",
        "NAS",
        "Seagate Exos drives",
        "time",
        "terabyte",
        "Seagate Exos",
        "Chia",
        "terabyte drives",
        "power on hours",
        "recertified Seagate drives",
        "capacity hard drives",
        "Toshibas",
        "terabyte Seagate Exos"
    ],
    "transcript_entity_values": [
        "Dyma-tex",
        "one",
        "197",
        "20",
        "the five years",
        "Vessi",
        "eBay",
        "eight",
        "300",
        "One",
        "zero",
        "10%",
        "GPU",
        "WD",
        "ESD",
        "25 bucks",
        "Three",
        "1",
        "50 to 60,000 hours",
        "Marketplace",
        "up to 11,000",
        "69",
        "three",
        "Canada",
        "188",
        "Linus",
        "1",
        "198",
        "24",
        "two 16 terabyte",
        "the summer",
        "25,000 hours",
        "76.7%",
        "280",
        "187",
        "first",
        "2",
        "136 terabytes",
        "2300 and 2600 hours",
        "Toshibas",
        "May, 2021",
        "199",
        "DOA",
        "Linus Tech Tips",
        "hours",
        "213 hours",
        "RFID",
        "around 71 gigabytes",
        "up to 2100 hours",
        "NAS",
        "39.5 gigabytes",
        "80 gigabyte",
        "four 18 terabyte",
        "30 days",
        "around 45,000 hours",
        "only 100 or so days",
        "16 terabyte",
        "a couple days",
        "four",
        "one and a half",
        "100 terabytes",
        "RAID 1",
        "2,000",
        "720",
        "Higher hour",
        "Everyday Move",
        "Toshibas",
        "this 30 day",
        "16",
        "3.5 inch",
        "Toshiba",
        "Seagate",
        "Wendell",
        "3",
        "Seagate Exos",
        "50 to 55 gigabytes",
        "Ridge Wallet",
        "all five",
        "Steam Cloud",
        "1,622",
        "two",
        "one foot",
        "250",
        "16 terabytes",
        "Chia",
        "200",
        "zeros",
        "10 or 20 days",
        "today",
        "as low as $300",
        "245",
        "WD Ultrastar HC550",
        "SATA",
        "almost half",
        "DIY NAS",
        "Seagate Exos",
        "5",
        "Years ago",
        "terabytes",
        "234",
        "Seagates",
        "64 gigabytes",
        "18 terabyte"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "TIME",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "TIME",
        "TIME",
        "ORG",
        "QUANTITY",
        "TIME",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "LAW",
        "MONEY",
        "MONEY",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY"
    ]
}