{
    "id": "XRCprhlz4D8",
    "title": "Passive infrared motion sensors: a two-bit camera powered by crystals",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2024-07-25T16:44:01Z",
    "video_url": "https://www.youtube.com/watch?v=XRCprhlz4D8",
    "category": "Science & Technology",
    "tags": [],
    "views": 773356,
    "likes": 49268,
    "comments_count": 2159,
    "description": "Not that kind of crystal. Links 'n' stuff:  Technology Connections on Mastodon:   Technology Connections on Bluesky:   Have you ever noticed that I've never done a brand deal? That's all thanks to people like you! Viewer support through Patreon keeps this channel independent and possible. If you'd like to join the amazing folks who fund my work, check out the link below. And thank you!",
    "description_links": [
        "https://mas.to/@TechConnectify",
        "https://bsky.app/profile/techconnectify.bsky.social",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Motion sensors. Youve seen em. But have youever wondered how they work? There are several kinds out there but the most common one is thepassive infrared sensor. You might already know that these detect your body heat, but how does itdo that? And whats going on inside here to, yknow, actually determine that something ismoving and not just warm? Like so many of the ubiquitous devices in our lives, the fundamentalthing this is doing is incredibly simple. But look at how all its pieces fit together andyoull start to uncover something amazing. First, lets talk about you. Youre glowingtoday! Quite radiantly, I might add. We all are! In the infrared. To quote some website Ifound, All matter with a temperature greater than absolute zero emits thermal radiation and we matter! And greater than absolute zero. So our bodies radiate some infraredlight. Now, fun fact about infrared light, when it lands on stuff it heats that stuff up. So you literally make everyone and everything around you just a little bit warmer simplyby being there. And thats affirmative! And also useful! Because of a little phenomenon called pyroelectricity. Turns out there are these crystals no not like that actualcrystals which generate a little bit of voltage when they are heated up. Galliumnitride is one such crystal. Its a really, really small effect producing only a wee bit of voltage so its not like theyre useful for doing work but thanks to the extremelysensitive field-effect transistor or FET, pyroelectric crystals can be used to detectchanges in heat. Hook one of these crystals up to the gate of a sufficiently sensitive transistor and you canproduce a large electrical signal when the crystal heats up even just a tiny little bit. Since yourbody is constantly radiating infrared light, that means a pyroelectric crystalcould be used to detect your presence. Except no. If you glitched into existence rightin front of a pyroelectric crystal [fwoop] it would produce a blip of voltage as your body heat raisedits temperature but then well it would stop. Its only the change in temperature that produces thevoltage, otherwise wed have something of a free energy device on our hands. So once your bodyheat brought it to a new equilibrium temperature, the voltage would go away. But also,we dont want that anyway. Such a sensor would react to anything near it that quickly changes temperature - say a heater switching on. And thatsnot what were trying to detect. But what if you had two of them? If onecrystal warmed up but the other didnt, there'd be an imbalance in voltage between thetwo which could be measured. So if you can figure out a way to cause a personmoving in front of a device with a pair of pyroelectric crystals to heat only one ofthem at a time, you could detect that persons movement. Which brings us to these: here I havetwo common types of passive infrared sensor, both used in lighting products. The translucentpiece of plastic you find on the front of both sensors is actually a complicated lens. Theylook cloudy since theyre not transparent to visible light, but this material affects infraredlight just as if it were glass. And sitting behind the lens (quite far behind it as a matter offact) is our pair of pyroelectric crystals. Theyre inside this metal can and hidingunderneath a filter which rejects visible light so we cant see them, but I've got a Dremeltool with a cutoff wheel so that wont stop me! And whats inside? The letter H. This may notlook like much but this is in fact a pair of pyroelectric crystals. OK, well the H isnt -at least, I dont think it is. Full disclosure, I dont really understand how this is constructed or indeed what the crystals are - it may be gallium nitride, but it couldbe something else. Pyroelectricity is exhibited in lots of stuff. And Im not even sure this isonly two crystals. If you look closely, youll see that theres a translucent, vaguely shiny andstripy pattern on top of the H. That could be a series of crystals, and my intuitiontells me the H we see below them is a printed pattern on their support which helps maximize the temperature differential between different areas of the crystal surface by absorbing moreIR in some spots and reflecting more in others. I was looking through some data sheets for similar parts and this arrangement isnt always the same, which leads me to believe that the actual sensor element can be tuned for different applications. Regardless of the specifics, look closely and youll see that the crystal is sort of floating above something. So I broke it to see what thatsomething was. And its a small transistor package containing a FET. Now that we can see everything, we can figure out how this component works. Its three pins which attach it to a circuit board are labeled V, G, and S. Thats voltage, ground, and signal. Then if we look back at thecomponents topside, we see that the voltage and signal pins are connected to the source and drainof the FET. But the ground connection - that went to one side of the crystal element. And, beforeI destroyed it, the other side of the crystal was connected to the gate of the FET. Just like I said a few paragraphs ago! Now, you might be a bit confused here because I said there were two crystals and yet theres only one structureconnected to one transistor. Well, heres the really clever bit. The two crystalelements found on this structure have opposite polarity. While one produces a positive voltage, the other produces a negative voltage. This means that if the whole structure heats up, whileboth crystals will produce some voltage, they perfectly oppose each other. Andthe net effect is nothing happens. Why do we want this? Well, lets say there was abright flash of light - maybe from lightning. That will actually cause a voltage spike in a pyroelectricmaterial because that visible light also becomes heat when its absorbed by it. But we dont want the sensor toreact to that. Thanks to the opposing polarity of the crystals it wont. If the entire sensorarea is heated uniformly, the equal and opposite voltages produced in the two halves of thepyroelectric element cancel each other out. But If its only partially heated, then only onecrystal produces voltage while the other doesnt. That means theres an imbalance, so theres avoltage potential across the entire structure. And, since that structure is connected across ground and the gate of the transistor, that difference in heat (and thus difference in potential) will triggerthe FET and it will in turn produce a blip on the signal pin. Which brings us back to thelens. I mean, lenses. If I remove this and we look at the backside, youll see that this isactually a bunch of Fresnel lenses. Counting each section with a circle bit as one lens means there are twenty-eight lenses in total. Unfortunately because this is designed to bend infrared light and not visible light I cant demonstrate what this lens is actually doing all that well. But if I stick my phones flashlight behind it at roughly the same positionthe crystals sit, you might be able to see that only one section of the lens lights up brightly, and which section lights up changes as I move the camera around. Of course, in practice, this is designed to collect light and focus it on the sensor so what Im demonstrating here isbackwards. But hopefully this helps you understand that each section of this lens is lookingat a narrow slice of whats in front of it. And what goes in front of it? You! The infraredlight your body is emitting will be collected by these lenses and projected onto the inside surface of the enclosure as a series of fuzzy spots. Since its infrared light, wherever those spots land heats up just atiny bit. And heres the key: as you move in front of the lenses, those fuzzy spots of infraredlight will move, too. And some of them will end up sweeping across the crystal face, heating oneside first, and then the other. That temperature imbalance as the warm spot sweeps across meanstheres a voltage imbalance in the crystal, and that imbalance is what triggers the transistor. With each lens collecting light from a small slice of its field of view, these sweeps of IRacross the sensor repeat as you continue moving. Do you understand how that works? It'stough because I cant show you this but I can show you stock footage of a disco ball! As theball turns (this clip is only seven seconds long, so its gonna loop a lot) as the ballturns (this clip is only sev sorry couldnt resist). As the ball turns, thanksto the fog machine in the room, we can see the moving beams of light thatsweep across the space. The same thing would happen if the ball were motionless but the lightshining on it was moving around the ball. And if we look at the walls of the room, youll see thatthose spots of light are sweeping across the walls. This motion sensor is basically exactly that, butin reverse. The lens is collecting your body heat and creating hot spots inside this enclosure,focused on the sensor. As you move in front of this thing, those spots move, too. When they sweepacross the two halves of the pyroelectric crystal, it generates enough voltage to trigger thetransistor and produce a signal blip. Then, the electronics inside the device will do whatever it is theyre supposed to do. And by the way, infrared motion sensors can be more likedisco balls than you may realize. When the front face of one of these looks uniform rather than segmented, sometimes it isnt a lens. Instead it might be a simple window thats transparentto infrared, and behind it is a segmented mirror focusing and reflecting light onto the pyroelectric sensor. Thosemirror segments reflect your body heat onto the face of the crystal, and just like the segmentedlens, the spots of heat your body generates on the crystal move across it as you move around. A sweep across produces a voltage imbalance, which triggers the FET, and theelectronics react accordingly. Speaking of electronics, this module is the kind of module you typically find on an outdoor floodlight. And it has a distance adjustment. These knobs turn potentiometers on the board: one for the time the light should stay on afterbeing triggered and the other labeled distance. What that distance adjustment does is change howmany signal blips from the sensor are required in a given time for the module to interpretmovement. Set at its furthest distance, it may react to just a couple of blips. Butyou can dull its sensitivity by requiring the logic to see more blips from thesensor before it switches the lights on. How does that change the distance it sees? You probably noticed already that some of the lens elements are smaller and theyre aimed indifferent directions. The smaller lenses at the bottom wont produce as bright of an infrared spot on the inside astheir larger neighbors, and since theyre aimed in slightly different directions, you have tobe closer to this (with your body taking up more of its angular view) for those lens segments totrigger the sensor. So, if you require more sensor blips in a given period to trigger this, the thingits reacting to needs to be closer to it so its seen by more of the lens elements and causes moreIR sweeps and thus more signal blips more quickly. Of course, there are plenty of other designsyou can play with, but like everything in life, there are tradeoffs. The golf ball lookin' lenson this solar light, since its a hemisphere, is able to detect movement across a widerfield of view. You often see this kind of sensor on ceilings to detect room occupancy. But sinceeach lens element is very small, you have to be pretty close to this for your body heat toaffect the pyroelectric crystal. That gives it a limited detection range, and since the lenselements are mostly uniform, while you could in theory adjust its sensitivity that wont correspond asnicely to distance as it does with this design. You can also use the lens elements and their size to calibrate how large of a living creature you want this to react to. Lots of home security systems have motion sensors that dont react to pets, and one way that's is accomplished is by using lens elements that are simply too small to generate enough heat on the crystal unlessit's a human-sized thing walking in front of it. It may also use smaller lens elementsfor areas facing the floor. Since the actual sensor in these is so simple, tweaks to the lens and careful calibrationis really the name of the game here. And speaking of names, we've reached the end of the video. And as you might have noticed, at the end of every video (wellalmost every video sometimes Im lazy) this scrolling list of names appears. These aresome of the lovely people who are supporting my work via Patreon. I havent really talked about Patreonin a long time because, to be honest, Im doing just fine. But in the video I just made where Iwas fawning over awnings, it was dawning on some folks that Ive never done a sponsored segment orad read. And thats true! Ive never explicitly said that since I dont like tooting my own horn, and also that's a weird thing to brag about: it's not like I begrudge anyone for doing ad reads. Especially if theyre funny. But truly,the reason I'm not doing that is these folks! I consider myself very lucky that I dont have to read words somebody at a PR firm wrote for me, and so long as I can keep going as I am now, I wont. So as thejazz fades in, I want to give a heartfelt thanks not just to the people you see here but everyonewho supports my work on Patreon. Ive got a lot of cool plans lined up and theyre all made possible bypeople like you. And thank you! What is this, PBS? pyroelecrtrically smooth jazz But look at how all its beh. It may be gallium nitride but it could be something else. Pyroelectricityis exhibited in a lot. What? What am I doing? STOP CHANGIN THE WORDS! And what goes in front of it? [confusion] Oh. Well thats a problem. Are you gon areyou gonna stop? If you I need you to stay I need you to not do that. And one way this is accomplished is by using smalllllllll what? When it lands on the stuff... Well I skipped a skipped some words. oops! Speaking of oops, I'm sitting at my desk with the top half of the flood light sensor enclosure and there's a little mirror in there I didn't show you! It's angled to help the IR coming in from the extreme side areas of the lens make it onto the sensor. And it looks like it's also throwing the light coming up from the small segments at the bottom back downward. Neat.",
    "transcript_keywords": [
        "light",
        "crystal",
        "lens",
        "sensor",
        "crystals",
        "voltage",
        "pyroelectric crystals",
        "heat",
        "infrared light",
        "front",
        "infrared",
        "body heat",
        "pyroelectric",
        "lens elements",
        "FET",
        "spots",
        "bit",
        "visible light",
        "temperature",
        "body"
    ],
    "transcript_entity_values": [
        "Pyroelectricityis",
        "Iwas",
        "only seven seconds",
        "half",
        "Dremeltool",
        "only one",
        "pyroelecrtrically smooth jazz",
        "two",
        "Galliumnitride",
        "Butyou",
        "Ifound",
        "Patreon",
        "IRacross",
        "FET",
        "Patreonin",
        "first",
        "one",
        "twenty-eight",
        "First",
        "Fresnel",
        "IR",
        "PBS",
        "three"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}