{
    "id": "XRT9jYrPxgY",
    "title": "Why Are There SO MANY Graphics Card Makers?",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-09-16T18:02:25Z",
    "video_url": "https://www.youtube.com/watch?v=XRT9jYrPxgY",
    "category": "Science & Technology",
    "tags": [],
    "views": 685975,
    "likes": 33003,
    "comments_count": 811,
    "description": "Learn through problem solving, and the first 200 people can save 20% today on Brilliant at   On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):   Buy: NVIDIA GeForce RTX 2080 Super On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):   Buy: ASUS ROG Maximus XI Hero On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):   Buy: ASUS ROG Crosshair VIII Hero On Amazon (PAID LINK):  On Newegg (PAID LINK):   Why don't AMD and Nvidia just make all their graphics cards themselves?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://brilliant.org/Techquickie/",
        "https://geni.us/qGvyV3",
        "https://geni.us/zY92KC",
        "https://geni.us/1Fuffc8",
        "https://geni.us/BxCre4",
        "https://geni.us/rx1ms",
        "https://geni.us/9lHo",
        "https://geni.us/6oUEjLO",
        "https://geni.us/y7qu0Ga",
        "https://geni.us/5RE4pW",
        "https://geni.us/jYpjxh",
        "https://geni.us/kCqSbmH",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- If you're in the market for a new graphics card, you probably know that for the time being you have only two options when it comes to a GPU: AMD or NVIDIA. But once you've made your decision and you go to buy the actual graphics card, you're inundated with a ton of options from different companies like Asus, Gigabyte, MSI and a bunch of others. Why are there so many, and why don't AMD and NVIDIA just make the entire card themselves? And yes, obviously both companies make their own reference design cards you can buy, but cards from add-in board, or AIB, partners remain the most popular choice. Let's start by looking at this from the perspective of the chip maker. For example, CPUs for a desktop PC are sold separately from motherboards. Although it wouldn't exactly be difficult for Intel or AMD to make their own PCB and slap a CPU on it, the issue is that manufacturing a complicated processor, whether that's a CPU or a GPU, is a lot more involved than putting together a PCB with some traces on it. But if manufacturing the board is simple, how does that then tip the scales in favor of outsourcing that work to an AIB partner? Unsurprisingly, cost is a big consideration. Because the GPU itself is the big determining factor of performance for a home gamer and the high-performance models are difficult to design and produce, margins on GPUs are quite high. By contrast, a PCB is a rather low-cost, low-margin product. It's not hard to turn out lots and lots of them, but the amount of profit a company makes per board, just on the board itself, is quite low. But how about from the AIB partner's point of view? The calculus is similar, but just works the other way around. These companies are rarely just making graphics cards and are already in the business of making PCBs for lots of other components. Just think about how many AIB partners you know also make motherboards, which of course are just PCBs with capacitors and slots soldered on, as well as power supplies, mice, cases, et cetera, things that also need PCBs, albeit smaller ones. So doing this makes economic sense for both parties. NVIDIA and AMD get to pour money and resources into innovating where it really counts, in the GPU itself; meanwhile, AIB partners, whose expertise is on the commodity, PCB, side of things, can buy the GPUs from Team Green and Team Red, solder them onto a board and resell them to consumers for a healthy profit. And, of course, there's also money to be made by competing in the AIB space itself. Partner companies can set themselves apart with out-of-the-box overclocks, a variety of cooling solutions, advanced power delivery built into the board to better serve enthusiasts and tweakers, and other features that result in a broad product stack within the same GPU family. So if you just need a certain GPU model that simply functions, you can pay something near the bottom of the pricing stack, but the companies can also make money from selling cards with more advanced features stuck on the PCB for a higher price. Not convinced by the theory? Here's a cautionary tale of what can happen if you try to do everything yourself: if you are a little older, you might remember when a company called 3dfx was a big player on the GPU scene. However, the company went out of business in the early 2000s, and a big part of why was that they insisted on making their own cards after acquiring a PCB manufacturer and attempted to control the entire process top-to-bottom, vertically integrating. However, this decision led to cost and quality problems that could've been avoid if 3dfx had used multiple AIBs, and the company soon collapsed under their weight of fierce competition from NVIDIA and ATI. So remember, there's absolutely no shame in not doing everything yourself. How do you think matchmakers stay in business, you know? Just tell me who to date. I can't trust myself to swipe right. But I do trust our sponsor, Brilliant. If you're a student, a professional, or just someone who wants to understand the world a little bit better, check out Brilliant, the website that helps you reach your learning goals by working just a little bit every day. Brilliant offers interactive explorations and a mobile app to help you master concepts in math, science and computer science. The courses take complex concepts and break them up into bite-sized chunks. Over time, you'll be amazed at what you can accomplish. We suggest checking out their Mathematical Fundamentals course, which has been redesigned with interactive features to help you with the foundational concepts behind algebra, number theory and logic, which make it a great resource for STEM students. The first 200 people to head to Brilliant.org/Techquickie will get 20% off an annual premium subscription. So thanks for watching, guys, if you liked this video, give us a thumbs up, hit Subscribe, and be sure to hit us up in the comments section with your ideas for topics that we should cover in the future.",
    "transcript_keywords": [
        "GPU",
        "graphics card",
        "AIB",
        "PCB",
        "actual graphics card",
        "making graphics cards",
        "cards",
        "AMD",
        "AIB partner",
        "make",
        "NVIDIA",
        "board",
        "PCBs",
        "graphics",
        "card",
        "companies",
        "GPUs",
        "big",
        "AIB partner point",
        "company"
    ],
    "transcript_entity_values": [
        "Team Green and Team Red",
        "Intel",
        "a ton",
        "20%",
        "Gigabyte",
        "NVIDIA",
        "200",
        "Subscribe",
        "Mathematical Fundamentals",
        "AIB",
        "annual",
        "AMD",
        "first",
        "AMD",
        "Asus",
        "MSI",
        "Brilliant.org/Techquickie",
        "GPU",
        "ATI",
        "only two",
        "CPU",
        "PCB",
        "the early 2000s"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE"
    ]
}