{
    "id": "xsp92m9hio0",
    "title": "Is This The Toothbrush Of The Future?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-11-28T18:44:20Z",
    "video_url": "https://www.youtube.com/watch?v=xsp92m9hio0",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "toothbrush",
        "tooth brush",
        "tooth",
        "brush",
        "electric toothbrush",
        "electric",
        "tech toothbrush",
        "oral-b",
        "8000 genius",
        "oral-b 8000 genius",
        "best electric toothbrush",
        "best",
        "2016",
        "2017",
        "video",
        "oral-b genius",
        "genius",
        "test",
        "cool",
        "oral b",
        "oralb",
        "oral-b electric toothbrush",
        "brushing teeth",
        "electric toothbrushes",
        "philips sonicare",
        "bluetooth",
        "philips",
        "oral-b (brand)",
        "gift ideas",
        "power brush",
        "sonicare"
    ],
    "views": 2724590,
    "likes": 58188,
    "comments_count": 4939,
    "description": "Oral-B 8000 Genius -  GIVEAWAY DETAILS OUTLINED BELOW  Follow on Instagram    Post a picture of your current toothbrush on Instagram and tag with the following hashtag - #unboxgenius - 50 winners will be selected - Get rid of that crappy toothbrush!  This video and giveaway is sponsored by Oral-B.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://bit.ly/2fXAkRq",
        "http://instagram.com/unboxtherapy",
        "http://instagram.com/oralb",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Silvu ple Mone mi Keske tu What did I just say? I don't know either So I got a lot of toothbrushes But it's not any toothbrush this is - uh - apparently the number one in the game. It's called the genius from Oral-B And they reached out and were like \"Lew, we think our toothbrush has so many features that you should make a video on it.\" And I said \"Alright, that sounds cool but if that's going to happen, you're going to need to bring your 'A' game for the Unbox Therapy audience as well.\" To which they said, \"How about we send you 50 and a bunch of fans get one of these babies as well.\" If you want to win one of these yourself, I'll have all the details in the description but basically you need to take a picture of how terrible your current toothbrush is. Post it on Instagram. Follow me on Instagram, follow Oral-B. Bunch of people 'bout to upgrade their oral health courtesy of Oral-B and Unbox Therapy, that's right thank me later. I feel like a toothbrush right now. I look like one too. Alright, so the Genius. It's a special brush but - but what makes it so special? W - Where does the tech come in Apparently, there's a something called position detection Lot of people they're missing spots with the manual toothbrush. Especially, the side that's on the hand you're using, so if you're right-handed, you probably don't spend enough time down here. They can take a picture, it's got bluetooth, there's an app, you can customize the.lightning. I mean look at the packaging, for example - Holy smokes! There's a travel case. You can see there's a spot where you can dock your phone if you're in like a hotel room or something. You just put it right there when you're getting prepared. Now the smart travel case charges your brush and your smart phone. What! Holy smokes, this is intense. This is monumental. Three action brush oscillates, rotates, and pulsates. Does all the 8's. Position detection will help you brush every area so you don't miss a zone Why don't we jump inside? Okay. Ooh. This is the travel case. There's an LED, a USB, and then a power connector. Open it up. Ooh Little dock for the phone, that's crazy. Who would of thought there would be a docking station for your phone? if that doesn't say tech for a toothbrush, I don't know what does. You got the YouTube videos right here, you catching up on your subscriptions. Ooh. Bit of a grip on there. So the suction cup clips onto the mirror and this is how you find out how terrible you are at brushing your teeth. This thing monitors, does the alignment. Tells you where your spending all your time. I'm telling you man, I'm about to get a master's course in oral hygiene. There already are some extra tips in here. Which ever style you like. A place to store them it looks like. So you keep some different ones. You got an at home charge spot too. I'm going to go with the most advanced, right? The Oral-B cross action brush head, this guy right here I'm going to crack this open. Don't act like you're not getting excited right now The app is available for both iOS and Android so you should be covered. It's pairing right now Choose a custom color for your Smart Ring That's this around the top. And you got the weather right there. Why not grab the forecast while you're brushing? Check this out. I got water and Unbox Therapy mug here, how special is that? I need to setup my mount. It's mapping my face right now I'm going to hit continue I'm all setup. Woah I got to get all the sections. Do I just got for it? Here we go. Okay, my session average is 2:04. The goal is two minutes so next time y - you got to hit that two minute. I spent 20 seconds too much pressure. Next time I got to lay off a little bit. This tracks over a day, week , month. But the main thing I noticed with the tracking, the face tracking, is how much I avoided certain areas in my mouth. So main thing is I think I was brushing too short. As they suspected and as Jack told me I probably didn't spend enough time in certain regions My mouth feels so invigorated. I feel like a young man again. I feel like I'm uh... I'm ready for a night on the town This might very well be the most high tech toothbrush on the planet. I mean I've got to say I've never had this much information about my habits, about my mouth, about my toothbrush. Don't forget as well, 50 of these things, 50 of these high end toothbrushes are going to be going out to Unbox fans. The details are down in the description. It's all happening on Instagram and it's super easy to participate.. And as a community, we get to check out all of the nasty toothbrushes that are out there and the worst ones are going to win. So if you're particularly embarrassed about what you got going on in the toothbrush department I want to see it!",
    "transcript_keywords": [
        "Silvu ple Mone",
        "Mone mi Keske",
        "ple Mone",
        "Unbox Therapy",
        "toothbrush",
        "Silvu ple",
        "Mone",
        "Keske",
        "Unbox",
        "Unbox Therapy audience",
        "Instagram",
        "Therapy",
        "brush",
        "time",
        "OralB",
        "Unbox Therapy mug",
        "phone",
        "travel case",
        "smart",
        "travel"
    ],
    "transcript_entity_values": [
        "Lew",
        "Unbox Therapy",
        "20 seconds",
        "50",
        "USB",
        "YouTube",
        "Silvu",
        "Jack",
        "Keske tu",
        "your Smart Ring",
        "two minutes",
        "Three",
        "two minute",
        "Mone mi",
        "8",
        "a night",
        "Unbox",
        "Instagram",
        "one",
        "Oral-B. Bunch"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "TIME",
        "CARDINAL",
        "TIME",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON"
    ]
}