{
    "id": "xSUAS1QAQRw",
    "title": "Cat S61 Hands-On: Lasers Make Everything Better",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-03-03T02:05:30Z",
    "video_url": "https://www.youtube.com/watch?v=xSUAS1QAQRw",
    "category": "Science & Technology",
    "tags": [
        "cat s61 hands on",
        "cat s61 review",
        "cat s60 review",
        "best rugged phone",
        "best rugged smartphone 2018",
        "best rugged phone 2018",
        "mrmobile",
        "mwc 2018",
        "android central"
    ],
    "views": 414472,
    "likes": 8169,
    "comments_count": 463,
    "description": "Go to  or text mrmobile to 500-500 to get a free book and 30 day free trial!   [CAT S61 HANDS-ON]  What do you do when your top smartphone already has epic durability, an air-quality sensor and a thermal camera? You add a frickin laser beam. Im MrMobile and this is a quick look at the new flagship phone for the hard worker: the CAT S61!   [SUBSCRIBE]     [ABOUT MRMOBILE'S CAT S61 HANDS-ON]  MrMobile's Cat S61 Hands-On was produced following an hour with a Cat S61 review device at MWC 2018 in Barcelona. Preproduction device running prerelease software. This video was sponsored by Audible.   [MUSIC]  True Persistence by Cymatix, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "http://www.audible.com/mrmobile",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.premiumbeat.com/royalty-free-tracks/true-persistence",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Man] What do you do when your top smartphone already has epic durability and air quality censor and a thermal camera? Well, you add a freakin' laser beam. I'm Mr. Mobile and this is a quick look at Cat S61. Brought to you by Audible. Cat branded phones have been around for about eight years at this point. So I think we can boil down the preamble to three sentences. Yes, it's the tractor company. Yes, they're made for people with rough and tumble jobs. And yes, we've seen a lot of this tech before. Thermal cameras that you can plug in the smartphones, portable air quality detectors, phone censors that can directly measure the world around them. It's all been done. What's new is building all of that together into a single device that also happens to be one of the most rugged smartphones around. Let's touch on that ruggedization before we fire the lasers. Bullitt, which is the company that builds these phones for the cat brand, first certifies this thing to IP68. Now, that's not particularly rare these days. It's the same dust and water resistance you can find in phones like the Galaxy S9. But the s61 is also tested to mil standard 810G for durability which subjects it to a whole other avalanche of abuse. And after that, Bullitt puts it through another IP test to make certain all those bumps and bruises haven't ruined the waterproofing. To cap it all off, the phone has protective covers over the headphones and USB c ports. They're not needed for the IP rating, but they help keep mud and sawdust out of the phone. Onto the censors. Lots of phones today have dual cameras but this one uses the secondary for a FLIR thermal imager. FLIR took its name from the military acronym for forward looking infrared and it means you can point this phone or object and detect their exact temperature between negative 20 and 400 degrees celsius. The idea is to let workers see heating pipes behind walls diagnose problems in engines or even see through total darkness or fog or smoke. They can also stream that video live to off-sight experts to help with whatever job they're doing. The second censor comes in if the fumes you encounter on that job get too dangerous. Behind these holes on the right side rails sits an air quality monitor. For once every thirty seconds, it sniffs the air for VOCs, volatile organic compounds. These are the kind of things through an paint fumes or solvents and it sounds an alarm if the concentration gets high enough to threaten your health. The final censor is the most buzz worthy. And it's also maybe the simplest. This is a range finder. And it uses an optical laser much like the one you'd find at a traditional laser pointer to paint a red dot on an object. Then the phone uses its camera to determine the distance to that object up to 10 meters away. The measurements can be saved directly to the phones you can call them up later and cat says there's some kind of area measurement function that I didn't get to use really. Like I said, it's simple. But sometimes simple is good. When the alternative is clambering across a room with a tape measured, you know? How well any of this works in the real world setting remains to be seen. And for MSRP of $999, that's a very important question. But how many times have I complained about other thousand dollar phones that don't do much more than competitors half their price? The s61 brings one of a kind tools. And it delivers them in a package that's a lot harder to break than, say, an iPhone 10. That might be worth the price tag to a specific set of folks and I look forward to trying it sometime later this year to see if it delivers on its laser powered promises. This video is brought to you by Audible offering Mr. Mobile viewers a free audio book with a 30 day trial membership. Psst, hey! You're a Mr. Mobile viewer. That's you. So go on over to audible dot com slash Mr. Mobile at the link in the description to choose your free title from Audible's catalog of audiobooks and original shows. If you're a mobile geek like me, you might like losing the signal, the excellent chronicle of the rise and fall of blackberry. If that's not your speed, there are tons of other titles to help you feel healthier, get motivated, or learn something new in 2018. And if you've got a better recommendation, share it in the comments. First, though, you gotta go to audible dot com slash Mr. Mobile down in the description or if you wanna kick it old school, you can text mrmobile to 500 dash 500. Hey, thanks for helping support the channel. Folks, this was Mr. Mobile's final video from MWC 2018 in Barcelona. Be sure you're subscribed for more coverage from the studio, from south by southwest in Austin, Texas. And a tesla model three drive in Florida. All coming up at the Mr. Mobile on youtube. Until next time. Thanks for watching. And stay mobile, my friends.",
    "transcript_keywords": [
        "Mobile",
        "phones",
        "phone",
        "Audible",
        "air quality",
        "Cat",
        "top smartphone",
        "Cat branded phones",
        "laser",
        "air",
        "epic durability",
        "audible dot",
        "slash Mr. Mobile",
        "censor",
        "phone censors",
        "thermal",
        "air quality censor",
        "quality",
        "Mobile final video",
        "kind"
    ],
    "transcript_entity_values": [
        "First",
        "the Galaxy S9",
        "FLIR",
        "30 day",
        "half",
        "every thirty seconds",
        "810",
        "IP",
        "Austin",
        "up to 10 meters",
        "about other thousand dollar",
        "2018",
        "mil",
        "USB",
        "Mobile",
        "today",
        "Texas",
        "first",
        "400 degrees celsius",
        "between negative 20",
        "these days",
        "Bullitt",
        "Audible",
        "second",
        "later this year",
        "Barcelona",
        "Florida",
        "500",
        "999",
        "about eight years",
        "three",
        "Cat S61",
        "FLIR",
        "MWC"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "GPE",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "DATE",
        "GPE",
        "GPE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG"
    ]
}