{
    "id": "xt0_NEDLrjs",
    "title": "Could This Be The Best Camera Phone Of 2019?",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-02-24T16:57:54Z",
    "video_url": "https://www.youtube.com/watch?v=xt0_NEDLrjs",
    "category": "Science & Technology",
    "tags": [
        "nokia 9 hands on",
        "nokia 9 review",
        "nokia 9 pureview",
        "nokia 9 pureview review",
        "nokia pureview",
        "mwc 2019",
        "mwc19",
        "mrmobile",
        "michael fisher",
        "android central",
        "best camera phone 2019"
    ],
    "views": 329111,
    "likes": 9583,
    "comments_count": 759,
    "description": "Two years ago, a Finnish company called HMD Global set up shop across the street from the old Nokia headquarters to resurrect one of the worlds most famous cellphone brands. Around the same time, an American company called Light built a crazy camera using multiple sensors to coax DSLR-like performance out of a smaller package. Today, these two companies have come together to produce an ambitious photography-focused smartphone. These are my first impressions from an afternoon with the Nokia 9 PureView.   [SUBSCRIBE TO MRMOBILE]     [LINKS]  Nokia 9 Hands-On [Android Central]:    [ABOUT MRMOBILE'S NOKIA 9 HANDS-ON]  MrMobile's Nokia 9 PureView Hands-On was produced following two hours with a Nokia 9 review device at a press briefing ahead of #MWC19. Preproduction device running pre-release software.   [MUSIC]  Renewable Energy by Aulx Atudio, available at Premium Beat:   Tidal Lines by Ryan Carlson, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #mwc19 #nokia9 #pureview #nokia #nokia9pureview #smartphones",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.androidcentral.com/nokia-9-pureview-preview",
        "https://www.premiumbeat.com/royalty-free-tracks/renewable-energy",
        "https://www.premiumbeat.com/royalty-free-tracks/tidal-lines",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Narrator] Two years ago, a Finnish company called HMD Global set up shop across the street from the old Nokia headquarters to resurrect one of the world's most famous cell phone brands. About the same time an American company called Light built a crazy camera using multiple sensors to try and coax DSLR-like performance out of a smaller package. Today these two companies have partnered to produce an ambitious photography-focused smart phone and these are my first impressions from an afternoon with the Nokia 9. (upbeat music) Let's start with the obvious question. Why in the name of Carl Zeiss does anyone need this many cameras on a phone? Well with most phones the answer would be to capture different fields of view. Take the Samsung Galaxy S10 with its wide, ultra wide, and telephoto cameras. But this, this is not that. All five of the Nokia 9's cameras are the same resolution with the same lens and aperture. The only difference is that two of them have color sensors while the other three are monochrome. And the purpose of this isn't to give you better black and white photos. You see each of the monochrome sensors can capture nearly three times more light than it could if it had a color filter on it. The sheer number of cameras also means the array can generate a huge amount of depth information. According the Light, most phones are able to capture enough depth data for three to seven places of focus. The Nokia 9 create a depth map with 1200 focal planes and it stretches across the entire 12 megapixel image. But what's all that mean to you? Weil if it delivers on its promises, not only will you be able to use this phone to refocus a photo after the fact as you can see here, but you should be able to select your focal point more precisely then on any other phone. And photos, portrait shots in particular will look better because the continuity of focus is more authentic. Instead of just applying a uniform fake blur across the background to bring out the subject, objects will get progressively less discernible the further away they get. Just like when you shoot with a real camera. Even if you don't care about portrait photos, and by the way I feel you on that one. The combination of all the image information and processing should lend more dynamic range to pictures. You'll also be able to shoot in raw format, in pro mode, and edit on device in Lightroom. With bonus, a custom lens profile made specifically for this phone. Speaking of phone, how's all the stuff that's not a camera? Well on paper, more good than bad. Getting thumbs up are a six inch Quad HD OLED Screen, a big ish battery with qi wireless charging, stock Android One software backed up by a very good record for updates, and a nice casing design that's IP67 dust and water resistant. Getting a so-so is last years Snapdragon 845 Processor. Still powerful, but no longer top of the line. And a couple of thumbs downs go to the lack of MicroSD card and the lack of a dedicated camera button. On a smartphone focused on photography, one that can shoot in raw, both of those omissions are head scratchers to say the least. So what's my takeaway from two hours with the Nokia 9? Excitement tempered by realism. I'm excited because a camera with strong potential motivates me to be a better photographer. And after two years of watching HND release cooler and cooler Nokia phones, I'm eager to finally review one. But I'm guarded in my optimism because the last time I looked at a camera from Light, the L16, frankly I didn't find enough quality to justify the price. Now if you want this one, you'll want to keep an eye out. The phone will be shipping in limited numbers. While the name suggests it's a category topping flagship, HMD doesn't see it that way. It sees it as a special edition phone. Personally, I can't wait to see how this special edition phone stacks up. Exact availability is TBD but details are expected soon. I'll keep my ear to the ground at Mobile World Congress in Barcelona and let you know where to watch for updates. To get the latest from NWC2019 in Barcelona be sure to subscribe to theMrMobile on YouTube and follow the same handles on Instagram and Twitter. When I have more to share on the Nokia 9 and all the other umpteen phones hitting the show floor, that is where I'll do it. Until next time, thanks for watching. And stay mobile, my friends.",
    "transcript_keywords": [
        "Finnish company called",
        "HMD Global set",
        "called HMD Global",
        "American company called",
        "Global set",
        "cell phone brands",
        "famous cell phone",
        "Finnish company",
        "company called Light",
        "HMD Global",
        "company called HMD",
        "company called",
        "Nokia",
        "phone",
        "set up shop",
        "headquarters to resurrect",
        "famous cell",
        "called Light built",
        "Nokia headquarters",
        "American company"
    ],
    "transcript_entity_values": [
        "Today",
        "Android One",
        "Lightroom",
        "L16",
        "1200",
        "Instagram",
        "an afternoon",
        "HMD Global",
        "S10",
        "12 megapixel",
        "NWC2019",
        "Light",
        "Finnish",
        "American",
        "three to seven",
        "YouTube",
        "MicroSD",
        "Two years ago",
        "two years",
        "Mobile World Congress",
        "six inch",
        "first",
        "nearly three",
        "Samsung Galaxy",
        "five",
        "9",
        "two",
        "Nokia",
        "last years",
        "Barcelona",
        "Snapdragon 845 Processor",
        "HND",
        "two hours",
        "Twitter",
        "three",
        "one",
        "Carl Zeiss",
        "Weil"
    ],
    "transcript_entity_types": [
        "DATE",
        "PRODUCT",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "NORP",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON"
    ]
}