{
    "id": "XU52BmNR8q4",
    "title": "Samsung should explain this... Exynos vs Qualcomm?! - Note 20 Ultra",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-09-04T12:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=XU52BmNR8q4",
    "category": "Howto & Style",
    "tags": [
        "Note 20 Ultra review",
        "Note 20 ultra",
        "Samsung Note 20 Ultra",
        "Exynos vs snapdragon",
        "exynos",
        "snapdragon",
        "qualcomm",
        "processor",
        "SOC",
        "best smartphone",
        "best android",
        "best samsung",
        "flagship",
        "Fail",
        "exynos 990",
        "Snapdragon 865+",
        "galaxy note 20 ultra",
        "Note 20",
        "Benchmark"
    ],
    "views": 5672968,
    "likes": 189642,
    "comments_count": 19801,
    "description": "Its time to find out how different the Note 20 Ultra variants really are. We found different cooling systems in my teardown. And we know the processors are also different... But does it matter? How much different is the Exynos Note 20 Ultra when compared to the Qualcomm Note 20 Ultra? And why is there more than one version in the first place?!   Watch the Note 20 Ultra teardown here:  Watch the Note 20 Ultra Durability test here:  Watch the S20 Ultra Exynos vs Qualcomm here:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/nIgu1Ge1llI",
        "https://youtu.be/7eQG8mRlYHM",
        "https://youtu.be/6CUSe8kgIE8",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So personally, I kind of feel like if you're a company and you sell or manufacture a product in different locations, those products should either have the exact same parts, or at the bare minimum, act the exact same...Right? I feel like that's a pretty reasonable request. Well, I know that Samsung is currently selling their main flagship, the Galaxy Note 20 Ultra, with different processors and different cooling systems inside...in different areas of the world. And today we're going to find out if those two different versions act the same...or not. We'll even take apart both phones and spot the copper and graphite cooling systems between them to see if that causes a difference in performance as well. On the left I have an international phone which has the exynos processor and a copper vapor chamber inside. And on the right I have a white US phone with a qualcomm snapdragon processor and a graphite cooling pad inside. In my previous video I erroneously mentioned that it was the exynos that was paired with the graphite, but it turns out that Samsung is using qualcomm chips in some markets outside the US as well. So my phone actually had a qualcomm chip inside. That error though actually kind of makes this test all the more important since it's not easy to know which version of the phone you are actually buying. It's time we find out if one build of the Note 20 Ultra is better than the other. It should be pretty interesting. Let's get started. [Intro] There will be two variables that we're checking on during this test: the processors and the cooling. To start the test off I have both phones charged up to 100% and both brand new phones are on their very first charge cycle. I've downloaded a benchmark app that stresses the processor to see how much processing it can handle and it gives the phone a score. The higher the score, the better the performance. You can see on the left we have the ARMv8 CPU, which is Samsung's own architecture for the Exynos 990 system on chip. While the phone on the right is using the qualcomm snapdragon 865 plus as its brain power. I'll hit run at the same time on both phones and wait for a few minutes while the phones do their thing. The difference between the qualcomm and exynos mobile system on chips is similar to the differences we see between Intel and AMD computer processors. Both are built to do the same job, but are completely different products and perform differently. We can already see that the US based phone with its qualcomm chip and graphite cooling finished first. A whole 15 seconds faster than the exynos version. And finished with a single core score that's 87 points higher than the exynos. And a multi-core score that is 456 points higher. That's a 16% power difference between the two models. And also, just for reference, my last year's Note 10 Plus scored a 2500 on the multiscore. I'll show you that a little bit later in the video, which means that the multi-core score performance of the exynos chip is actually closer to last year's Note 10 model than it is to this year's Note 20 Ultra counterpart. Kind of embarrassing. I'll keep track of the temperature throughout this process as well. I did try monitoring through the internal app and all of the temperatures matched up between both devices pretty evenly. Qualcomm did always run a few degrees cooler, but that's not a huge difference as you'll see throughout the video. I also measured the temperatures externally as well throughout the test. A hotter phone doesn't always necessarily mean the processor itself is hotter. It could just mean that the cooling system is actually doing its job of pulling heat away from the processor and pushing it to the outside of the phone. The outside of the phone is warming up more as a result of that exchange. I performed this benchmark 8 times. I'll let you see the results of each as they tick by. Remember, we'll do this all over again once I've switched out the cooling pads underneath the motherboards just for kicks and giggles. The performance difference between the qualcomm and exynos is consistent, even as both phones heat up. These benchmarks are kind of the equivalent of playing an intense game for about 30 minutes. Remember, this is just one test. To get really accurate results I would probably need to go buy a bunch of phones. But since I've already got 3 of these $1300 flagships, I don't really want to buy anymore. You might also have noticed that the screen color is a bit different with both phones. I'm pretty sure I have the brightness turned all the way up on each. But it makes you wonder if there are other components that don't match between the variants as well. For the last test I added a little fish tank aquarium LCD sticker on the back of the phones. These stickers heat up and tell what temperature the surface is underneath the sticker. Then I started up the last test and monitored each phone. The processor is located in the upper half of the phone and there was always about a 4 or 5 degree temperature difference between the two exynos being the hotter. It turns out that the fish tank thermometers don't work out all that well since both phones blew right past that hottest temperature that these stickers could record. Now we know that if the Note 20 Ultra was a fish tank, we'd have a lot of dead fish. So good thing it's not a fish tank. I'm just going to take these off and we'll forget about this part. So after running the benchmark 8 times on both phones, our battery percentage is at 84% on the exynos, and 86% on the qualcomm. So one processor is performing better and is more power efficient at the same time, which is embarrassing yet again for the exynos. Let's talk about the results from this first round while I take apart the phones to pull out that cooling system. After all, it's not a Jerry Rig Everything video without a teardown. In all 8 tests, the qualcomm variant of the Note 20 Ultra crushed the exynos variant with a nearly 16% performance difference every single time. Remember, my last year's Note 10 Plus scored right about here, even after I've been using it for about a year. So it's almost more worth your time to skip the exynos chip entirely and just get last year's phone model if you're just worried about processor performance. Sometimes apps only use one core, and sometimes apps utilize all the cores. So this benchmark is testing both multi-core use as well as the single core use. And that single core graph is down at the bottom. Now that my mystic bronze international exynos Note 20 Ultra is opened up, we can see that it indeed does have the copper cooling vapor chamber inside. I'll peel out that being careful not to damage it since we are going to plop it inside of the white US version of the phone underneath the qualcomm processor. We can see that it has a little wicking grid inside to pull the moisture from one end of the vapor chamber to the other. It's a pretty sophisticated system. I'll open up the mystic white US qualcomm variant of the Note 20 Ultra. And we can see the graphite cooling system beneath that motherboard, which is what we expected to find. We have yet to see if one cooling system performs better than the other. But by swapping them and performing the load test one more time, and comparing the numbers, we should get a good idea of how much each cooling system is helping out. Now that I've inserted the copper cooling system into the qualcomm phone, we can put the graphite cooling system in with the exynos processor, since the layout for the cooling is exactly the same across both models. They have the same size and footprint. Of course now they don't have the factory seal anymore with the frame of the phone, so it's not an absolutely pristine example, but it's still worth taking a look at. I've got everything put back into place, connected like little Legos, and screwed down. So we're ready to start the benchmark test over again. Remember, the international exynos phone is on the left and now has the graphite cooling system installed. And the US version is on the right with its qualcomm and new copper cooling system installed. Running the 8 tests takes about 30 minutes, which is plenty of time for the processors to start heating up and start throttling a little bit. This is also where I also put my own 10 Plus into the mix and got its 2500 multi-core score. We'll let the rest of the tests cycle through. I'm definitely not the first person to point out the performance differences between the exynos processors and the qualcomm processors. Aaron, from Mr. Who's the Boss, did an excellent video comparing the S20 Ultra variants earlier this year and got nearly the same results I did. It's kind of hard to defend Samsung on this one. It's as if Toyota was selling a 6 cylinder truck in the USA, but a 4 cylinder truck everywhere else without telling anyone what's under the hood. I'm not the biggest fan. And this is also why my Note 10 Plus is probably going to be my last Samsung phone. It's time for me to branch out after this one dies. Now let's see if the cooling systems actually made a difference in performance. Overall, qualcomm still wins massively in the second set of tests. The black line is qualcomm's new benchmark. And the green line is the new exynos benchmark. There is still about a 20% difference in performance pretty much the whole time throughout all the tests. The qualcomm processor is clearly performing better. But what about the cooling systems? When we take a look at the original scores of the US qualcomm model with its graphite cooling, and then overlay the copper cooling scores on top, we can see that the performance actually decreased about 3% across the board this time around. This is quite possibly just a factor of the phone being taken apart and the cooling system not being adhered like it was at the factory. But it is still consistent all the way through those eight tests. And if we take a look at the exynos processor which started out with the copper cooling, which is the graph in red, and we overlay the new scores with the graphite pad in green, we can see they also have decreased about 3% across the board same as the qualcomm. Super interesting. Judging by this set of tests and our rather small sample size, it looks like the cooling system between the two phones doesn't matter very much since the scores were relatively consistent across the board both times. And then both phones dropped equal amounts when I pulled out the cooling system and swapped devices. It's also fun to note that the exynos variant has 5% points less of battery now than the qualcomm version does, even though they've done the exact same things. There are little differences all over the place. In conclusion though, the biggest difference between the two Note 20 Ultra variants isn't the cooling system, it's mainly just the processor itself and the difference between those two processors is huge. Let me know what you think of this whole exynos and qualcomm thing. Do you think Samsung should be allowed to sell an Ultra phone with different internals like they are currently doing? I kind of think they shouldn't. If it acts like a different phone it should be called a different phone. And when someone ends up with an exynos, they are not getting the Ultra phone they paid for. But let me know your thoughts down in the comments. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "cooling system",
        "phone",
        "cooling",
        "exynos",
        "qualcomm",
        "Note",
        "phones",
        "Ultra",
        "system",
        "graphite cooling",
        "processor",
        "graphite cooling system",
        "Ultra phone",
        "year Note",
        "difference",
        "exynos processor",
        "copper cooling",
        "time",
        "test",
        "copper cooling system"
    ],
    "transcript_entity_values": [
        "about 3%",
        "earlier this year",
        "US",
        "1300",
        "Qualcomm",
        "Intel",
        "865",
        "6",
        "CPU",
        "8",
        "Instagram",
        "A whole 15 seconds",
        "two",
        "20",
        "5 degree",
        "up to 100%",
        "20%",
        "qualcomm",
        "990",
        "about a year",
        "exynos mobile",
        "the Galaxy Note 20 Ultra",
        "87",
        "Legos",
        "Ultra",
        "half",
        "4",
        "about 30 minutes",
        "Toyota",
        "2500",
        "AMD",
        "10",
        "last year's",
        "year",
        "USA",
        "first",
        "second",
        "a few minutes",
        "10 Plus",
        "LCD",
        "Samsung",
        "today",
        "86%",
        "16%",
        "3",
        "5%",
        "456",
        "a few degrees",
        "exynos",
        "eight",
        "one",
        "Ultra",
        "84%",
        "Twitter",
        "Aaron"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "DATE",
        "GPE",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "GPE",
        "ORDINAL",
        "ORDINAL",
        "TIME",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "PERSON"
    ]
}