{
    "id": "XvKnshVu1tU",
    "title": "Amazon vs. Walmart: reinventing how we buy everything",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-11-02T13:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=XvKnshVu1tU",
    "category": "Science & Technology",
    "tags": [
        "amazon",
        "walmart",
        "amazon shopping",
        "shopping",
        "online shopping",
        "amazon go",
        "grocery shopping",
        "amazon prime",
        "amazon shopping online",
        "monopoly",
        "sales",
        "whole foods",
        "amazon reviews",
        "groceries",
        "shopping online",
        "amazon haul",
        "amazon deals",
        "shop",
        "diy",
        "online shopping haul",
        "amazon go store",
        "fresh direct",
        "grocery haul",
        "food shopping",
        "food",
        "store",
        "how to",
        "technology",
        "new tech",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "step by step",
        "verge",
        "the verge"
    ],
    "views": 313708,
    "likes": 7925,
    "comments_count": 456,
    "description": "Amazon has grown from an unknown online bookseller to one of the most valuable and powerful corporations in modern history. But, as big as Amazon seems, the companys sales are small compared to big box retailers like Walmart. To compete, Amazon has to do something counterintuitive: it has to move into the real world.   [Correction: At 4:29 we mentioned Walmart's annual sales are $0.5 billion. They are actually $0.5 trillion.]  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(vehicles clinking) - Amazon's new stores are giving us a glimpse of how the company wants to change retail. And it's not what you might expect. By combining the ease of online shopping with shopping in person, Amazon is trying to reshape how we buy everything in the future. In the last 25 years, Amazon has grown from an unknown online book seller to one of the most valuable and powerful corporations in modern history. Amazon did this by totally rethinking how to sell products in the age of the internet. By putting convenience and good deals above all else, Amazon has created a platform that can get you almost anything in two days or less. But the company wants more. Amazon wants to sell you everything. CEO Jeff Bezos's singular mission has been to create the everything store. But before you can do that, Amazon has to become the do everything company. So what could possibly be next for Amazon? Well, to truly become the everything store, Amazon has to do something counter intuitive. It has to move into the real world. That's because a vast majority of the purchases we make everyday, we make offline and in person. In most of the country outside the big cities, people shop way more at big buck stores like Walmart than websites like Amazon. Out of the $800 billion spent on groceries each year, just 2% of it is spent online. As for the whole retail industry, well that's five trillion dollars in the last year and e-commerce is just under 10% of it. Think about those huge numbers and it starts to make a whole lot of sense why Amazon is getting into offline retail. When it spend 13 billion dollars to buy Whole Foods last year, the was the moment everyone realized Amazon was taking offline retail seriously. - Amazon is going to buy Whole Foods. - First it was books then it was household products. - Why would Amazon buy a brick and mortar grocery store? Analyst say Amazon could revolutionize the supermarket experience. - But Whole Foods isn't Amazon's only physical store. It's also experimenting with what it would be like if shopping in real life were as easy as it were online. And that's where Amazon Go comes in. So we're here at the Amazon Go store in San Francisco. It just opened and we're inside. We just scan our app to get in and now we're gonna take a walk around and see what they have to offer. Amazon Go is the company's experimental cashier-less convenient store. These Go stores typical sell prepared food, some groceries, and basic items you'd find at say like a Walgreens or a 7-Eleven. So the big draw of the Amazon Go store is that you can come here for breakfast, lunch, and dinner. They have an off-site kitchen and they make a whole bunch of fresh food every single day and they package it and they bring it here and it's ready to eat as soon as you buy it. They've also partnered with a lot of third-party retailers and chains to bring their food into the stores so you can buy here as well. So one of the unique things I saw here at the store are these ready to cook meal kits. You buy one of these boxes for a flat fee here. It's 16$ for the falafel patties. It's 19$ for the burger. And you get all the ingredients you need to make a meal for two in about 30 minutes. It's all about convenience. Meal kits make shopping easier because you don't need to search the store looking for a list of ingredients. And cooking is faster because well everything is portioned out for you. The one thing we haven't talked about here is the technology. Amazon does this by basically placing a whole bunch of cameras, sensors, all throughout the store. And they track you as you move through it. They track you as you grab stuff off the shelf. They know when you've taken something off the shelf, they put it in your shopping cart. And even know when you put something back. And then they take it out of your shopping cart. They do all these through some smart software. There's a lot of computer vision stuff going on. A little bit of artificial intelligence. But effectively, you as a customer don't need to worry about anything. You just walk to the store, you grab what you need, and put your stuff in your bag, and you walk out, and you're done. And that's it, we just got all these food. And seem like we didn't pay for it but we actually did. At the end, you get a receipt and it shows up in the mobile app and the receipt even tells you how long you spent in the store. So you're probably wondering why Amazon wants to sell you lunch or random grocery items like bread and milk. It's not that there's a ton of money to be made unless you can do it at scale. And scale is what Amazon is great at. If Amazon can put a Go store in every city in America, just think of how much more toothpaste and toilet paper it could sell. This isn't so much about replacing your local market or deli. It's actually a super smart way to compete with Walmart. 90% of Americans have a Walmart within 10 miles where they live. 140 million people shop at Walmart every single week. That adds up to roughly half a billion (correction: trillion) in annual sales. And what does Walmart sell more than anything else? Groceries. That's the market that Amazon hasn't fully been able to tap. Because it's not a thing people tend to buy online. Amazon knows that and it knows that it needs to expand if it wants to truly sell us everything. Amazon has to become Walmart before Walmart becomes Amazon. In Amazon's ideal world, you're buying every single thing, not including rent or utilities from Amazon. You're shopping with a Prime credit card. You're watching movies in TV on Amazon Video. You're getting your groceries delivered from AmazonFresh. You're buying your essentials from PrimePantry. Eating out at Amazon Go. Eating in with Amazon Restaurants. And cooking with ingredients from Whole Foods. You're gonna furnish your entire apartment with Amazon.com. Hell, you can even get your oil change or your gutters cleaned by ordering a specialist through Amazon home services. And naturally that had some people concerned and rightfully so. The Go store already automates cashier jobs. And the company is hard at work at putting more robots in its warehouses. And don't forget that Amazon is working on drone delivery which would radically change how it ships all of its products. It's easy to look at all these forward thinking projects and think that one day, Amazon could take over the world. But the reality is that it's still small in the overall retail market. It only does about a third of the annual sales that Walmart does and there's plenty of competing chains like Walgreens and Target. They're definitely not going out of business any time soon. Well the Amazon Go store maybe the most sophisticated store in America right now. Is it really the most convenient? I think so but it certainly won't be unique forever. Other businesses are bound to adopt this tech-forward model. Even Walmart right now is testing something like scanning and go that let's you do something similar with your smartphone. Now Amazon is testing their high tech retail in cities where their Prime Now services has warmed people up to the idea of buying food from Amazon which is smart. I've been to the Go store a few times already. And can totally see myself going back for a breakfast burrito kind of all of the time. If Amazon can find success in selling groceries and food offline, they have that chance at selling us everything. Today, Amazon owns e-commerce. That's just a fraction of the larger retail market. Having actual stores that you can go to and grab a few things is the key to its growth and making more money because its convenient. And convenience is what builds Amazon's empire. It's still the driving force behind everything the company does today. Amazon has to figure out the convenient way to sell you not what you might need in two days but what you need right now. So what's the weirdest thing you've ever bought on Amazon? For me, I buy all of my picture frames there which is really not all that weird. And it could probably get a whole lot weirder. So let us know in the comments and if you haven't already, subscribe to us on Youtube.",
    "transcript_keywords": [
        "Amazon",
        "store",
        "Walmart",
        "buy",
        "food",
        "sell",
        "retail",
        "stores",
        "shopping",
        "company",
        "Foods",
        "make",
        "Amazon buy",
        "Amazon Go store",
        "Amazon Video",
        "Amazon Restaurants",
        "online",
        "CEO Jeff Bezos",
        "people",
        "groceries"
    ],
    "transcript_entity_values": [
        "last year",
        "$800 billion",
        "Today",
        "10 miles",
        "one",
        "third",
        "AmazonFresh",
        "Youtube",
        "Amazon Go",
        "Walgreens",
        "the last year",
        "Americans",
        "trillion",
        "just under 10%",
        "Amazon Video",
        "today",
        "Target",
        "90%",
        "every single week",
        "Amazon Restaurants",
        "about 30 minutes",
        "about a third",
        "Jeff Bezos's",
        "just 2%",
        "Walgreens",
        "19",
        "five trillion dollars",
        "16$",
        "America",
        "two",
        "Walmart",
        "annual",
        "Amazon",
        "one day",
        "the last 25 years",
        "roughly half a billion",
        "13 billion dollars",
        "Amazon.com",
        "San Francisco",
        "each year",
        "Whole Foods",
        "140 million",
        "a ton",
        "two days"
    ],
    "transcript_entity_types": [
        "DATE",
        "MONEY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "GPE",
        "ORG",
        "GPE",
        "DATE",
        "NORP",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "DATE",
        "ORG",
        "PERCENT",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "MONEY",
        "MONEY",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE"
    ]
}