{
    "id": "XZ0VgOcRxyo",
    "title": "The RETURN of Intel - AORUS 15P Gaming Laptop",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-05-25T20:01:03Z",
    "video_url": "https://www.youtube.com/watch?v=XZ0VgOcRxyo",
    "category": "Science & Technology",
    "tags": [
        "Aorus",
        "Gaming Laptop",
        "Gigabyte",
        "Intel 11th Gen",
        "NVIDIA",
        "3070",
        "Gaming",
        "Games",
        "Performance",
        "Display",
        "High Definition",
        "Intel",
        "11th Gen"
    ],
    "views": 408690,
    "likes": 16385,
    "comments_count": 967,
    "description": "Thanks to AORUS for sponsoring this video! Check out the AORUS 15P Laptop on Newegg at   Gigabyte's AORUS 15P gaming laptop features Intel's latest 11th gen mobile processor. Is this Intel's chance to hit back at AMD?  Buy iFixit Pro Tech Tool Kit On Amazon (PAID LINK):  On Walmart (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  Timestamps:  0:00 - Nice 0:16 - Unboxing 1:06 - Laptop exterior impressions 3:30 - Turning the laptop on 4:31 - Microsoft AI Tuner 5:14 - AORUS cooling 5:30 - Specs! 6:19 - Keyboard impressions 6:53 - Gaming! 8:52 - Processor benchmarking - Cinebench! 9:21 - Webcam 9:49 - Opening up the laptop 11:13 - Sound test 11:49 - Conclusion  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://aorus.shop/VD-laptop-Shortcircut",
        "https://geni.us/EQnRi",
        "https://geni.us/AojPBz",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Oh, we have got a sick laptop right here. And I can tell you that for sure, because this thing is from Aorus and they sponsored this video and if it sucks, I get to have an awkward conversation with them and you don't see this video. So here we go. Oh, let's just get straight into it here. [Jono] What's so cool about this laptop? - Well, we'll find out what's cool about this laptop, Jono. Just wait a second. First of all, we could see just how much power we're dealing with in here, 230 Watts. That means this thing's going to be pretty powerful which I already know, because I looked at the specs on the side of the box and it has a 3080 in it and also an 11th gen Intel processor. So yeah, she's fast. It looks like they also included a thermal pad. Maybe like a three millimeter one. It's kind of a thick, I guess your SSD is upgradable because why else would they include this? That's pretty cool though. And here we go. Very simple. I find sometimes Aorus can kind of get a bit too spaceshipy with their designs. This one right here. I think they nailed it kind of going between gigabytes arrow lineup, where it's pure class and race car, Ferrari spaceship. This is a good middle ground. For IO we've got full-sized HDMI display port or mini display port, full-sized USB type A, ethernet, headphone, microphone. And on the other side we get, let's see here. It says it has Thunderbolt. Okay, double-check that. Thunderbolt four here. Doesn't have the little note Thunderbolt on it but we're all good there. Full-sized SD card reader. I really like this, for most people it doesn't matter, but if you ever use a real camera, these are awesome. And two more type A ports. This keyboard cover that they have feels very good. I'm guessing you could probably use it afterwards to clean your display and stuff. I always feel weird commenting on things like chassis rigidity and sponsored videos but this is exceptional. You can see me pushing on it. The total deflection you might see on camera is a bit much but the overall rigidity is very high. It would appear that it's kind of like you have a plastic chassis with an aluminum top plate but the overall feel of it is very good. How heavy is it? Let's find out. Not from the spec sheet, from an actual scale because sometimes spec sheets lie. 4.8 pounds, okay. Which is 2.2 kilograms for civilized people. Yeah, that might not be the lightest laptop I've ever used but for something with 3080, that's damn impressive. Now my one complaint here it's not the worst thing in the world, but gigabyte, please. Your displays, they've been so floppy for so long. I've been complaining about this since 2017. Wow, that's a lot of RGB. You can definitely tone it down but the default state is just pure unicorn vomit. Oh my God. I need to turn that down to tell you how good it is. Oh, wait, what? I didn't do anything, but it turned to white and now it's much more chill. I do kind of like that in these laptops where you have full RGB access to be able to just be like, \"All right, I'm going over to my friend's house and we're going to have just pure seizure warning needed to turn this laptop on mode.\" And then you can go to a meeting with your professor at university and not feel like an idiot. What color do you guys want? - [Jono] Give me purple. - Purple? - [Emily] Purple for ShortCircuit - All right, purple. There we go. Also in here, we have our device settings. You will be able to get the absolute best performance if you come in and tune all of this yourself but they have their Microsoft AI first ever AI crap. And it actually kind of works. Basically, all it does is it selects a device profile based off of the game or application or whatever that you're using. Most of the time when I use these laptops I just let that do its thing. Wonder how loud it is. Turbo mode, can I just put the Phantom Aux? Oh wow, that's pretty good. It's not whiny. A lot of laptops, especially ones with this much power can be very much like (screams) whereas this one right here is more, it's more of a woosh, I like it. Gigabyte was able to pull that quietness off apparently by using two 71 blade fans and five heat pipes. We'll take a look at that in a bit but I'm actually pretty impressed by that. Now under the specs this is maybe the most interesting part of this laptop. So in here we have an i7-11800H. And is it good? I don't know. We'll find out pretty soon. Aside from the CPU, we got 16 gigabytes of RAM, 3,200 megahertz, that's actually pretty good for a laptop. One terabyte SSD, Intel WiFi 6. They said, put the logo on the screen while I mentioned that, editor do that, please. But at the same time that's just basically the best WiFi card that you can get. I'm glad to see it on here. And finally, we get an RTX 3080. This right here is 130 watt version. So not the most wattage that we've seen but at the same time, that's a lot of power. We also have the eight gigabyte version here. Apparently there's an 16 gigabyte one. I don't know that you should spring for that. You'll probably be fine with eight. Okay, okay. This keyboard seems quite good actually. I'm not surprised Aorus, well gigabyte, but Aorus was kind of the first one to start putting really good keyboards in their gaming laptops. The Aorus 15 was kind of the first slim gaming laptop that had things like a good keyboard and a track pad that also doesn't suck. This one right here is pretty good. I wished that it was a little bit bigger but it is glass topped. The tracking's really good. And you're not going to have any problems with it. [Jono] What game do you wanna play? - I'm playing Valheim. I am sorry everyone that thinks it's a bad benchmark, but I like it as a game. So too bad. (chuckles) Editor, please don't sign into my Steam account. Okay, let's see here. I kind of built a castle and it got a bit out of hand. Yeah, so I play this on a GTX 1080 and ever since I built this big old castle here, it's struggled hard. It's still under construction, as you can see but my computer with a 1080 and a 5960 X, we're looking at rate around 18 FPS. Right now, I am getting 30 which might not sound too good. But in this situation, in this game is very impressive. - [Jono] I think you just wanna show off your house. - Yeah, I also just wanna show off my house. Now we'll hop into good old do maternal. This is where we get to show off the display. See what we've got here. 240 Hertz as well as full SRGB coverage. Okay, we're in doom here. It seems I'm getting a bit of hitching. I wonder what's up with that. Oh, okay. That's a little bit better. I adjusted some of the settings, resolution. Everything was wrong. We're looking now at, it's going between 160 and 180 FPS. That's about what I would expect for a laptop like this. Oh, this is such a hard game to talk and play at the same time. What was I talking about? Oh, damn. GPU is currently at 65 degrees. That's after a little bit of gaming. That is really good. What I am intrigued about though is this processor. Now, Intel will absolutely hate that I'm doing this, but at the same time you kind of just gotta, I wanna run cinebench and see what happens. Now for an eight core laptop, 4,000 is a score that I would accept if it hits 5,000 that's like, whoa, wow. 4626, all right. So that lands us good bit above last gen. That is very promising. I'm sorry Intel that I did that, but good job. Oh, it has a webcam. There's a little webcam down here. They have these super small bezels around the whole thing. That's nice, webcam down here. It's not great, but at least they have one. It is very much freed up to know that I don't look all the way down here. I still look kind of weird but at the same time. You at least get a webcam for somehow that's a plus. And with that, I really want to see how this thing is cool because well, apparently it's cool. All right, let's look at, what's on the go in here. Now first thing, 99 watt hour battery, awesome. So Aorus says that it'll get you eight hours but I have done no battery testing on 11th gen Intel processors but eight hours does check out. And also in here you get two SSD slots. So this right here is the one that's empty. This one already is full. It also has two sodium slots that are easily accessible. There you go. Now you have your RAM. You can upgrade it just like that. As for cooling. It's kind of interesting how they did this. Normally you would expect to see kind of more heat pipes going to smaller heat sinks. Whereas here they've gone and given you much bigger heat sinks apparently they're all copper and also these nice big fans with 71 fins on each one of them. I was kind of confused because I couldn't tell if this was a vapor chamber or not, but it seems like that instead that they've integrated a heat pipe kind of rate in here to cool the GPU and the VRMs. Jono, we forgot something. - [Jono] What? - We didn't do Crab Rave. - [Jono] oh, yeah. - Okay, well, we'll put it back together real quick for you guys. (upbeat music) Okay, I was really confused there because I thought that it was pretty good. And then suddenly got really bad when I turned up the volume, but it turns out that your hand position on this thing actually makes quite a big difference. So I think that they have some speakers up here but there's also some rate down in here that they're bouncing off of the table. (upbeat music) This sounds pretty good. Put your hands there, it sounds bad. Overall, I would say those speakers are quite good although it goes a little bit louder than it probably should. At full volume, it's like a bit distorted, but once you take it down to 70%, it still is plenty loud and sounds quite good. A huge thanks to Aorus for sponsoring this video. Now I think this is what, 2,399? Yeah, link down in below the description there for new link. That's what, half a 3080 if you're getting a desktop. Not too bad. So yeah, I'm really excited to properly put this thing through its paces on LTT. Oh, shut up Crab Rave So yeah, hit like, get subscribed and just have a fantastical day, so long.",
    "transcript_keywords": [
        "good",
        "kind",
        "pretty good",
        "bit",
        "laptop",
        "Aorus",
        "thing",
        "pretty",
        "yeah",
        "Intel",
        "cool",
        "time",
        "laptops",
        "gigabyte",
        "game",
        "heat",
        "sick laptop",
        "put",
        "bad",
        "display"
    ],
    "transcript_entity_values": [
        "16 gigabytes",
        "half",
        "Aorus",
        "Valheim",
        "2.2 kilograms",
        "webcam",
        "GTX",
        "Aorus",
        "Intel",
        "the Phantom Aux",
        "eight gigabyte",
        "Hertz",
        "One",
        "RAM",
        "one",
        "USB",
        "4,000",
        "between 160 and",
        "Gigabyte",
        "Crab Rave",
        "4.8 pounds",
        "Microsoft AI",
        "240",
        "230",
        "a second",
        "99 watt hour",
        "2,399",
        "LTT",
        "eight hours",
        "3080",
        "IO",
        "130 watt",
        "3080",
        "65 degrees",
        "two 71",
        "11th",
        "Jono",
        "3,200 megahertz",
        "Aorus",
        "2017",
        "first",
        "71",
        "two",
        "1080",
        "4626",
        "four",
        "GPU",
        "Emily] Purple",
        "RGB",
        "Ferrari",
        "SD",
        "CPU",
        "First",
        "five",
        "16 gigabyte",
        "5,000",
        "5960",
        "eight",
        "30",
        "70%",
        "SSD"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "GPE",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "TIME",
        "CARDINAL",
        "ORG",
        "TIME",
        "PRODUCT",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "ORG"
    ]
}