{
    "id": "Xzhp1HTt43M",
    "title": "Building a $500 Intel Gaming PC - 2023",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-05-16T17:29:34Z",
    "video_url": "https://www.youtube.com/watch?v=Xzhp1HTt43M",
    "category": "Science & Technology",
    "tags": [
        "Gaming PC",
        "Budget PC",
        "Gaming Build",
        "Gaming",
        "Gaming Computer",
        "Intel",
        "AMD",
        "i3-13100F",
        "Budget Gaming",
        "RX 6600",
        "Budget Build"
    ],
    "views": 2517619,
    "likes": 80082,
    "comments_count": 4155,
    "description": "Play Enlisted for FREE on PC, Xbox Series X|S and PS5:  Follow the link to download the game and get your exclusive bonus now. See you in battle!  Its only been 9 months but AMD and Intel have both launched new processor lines. How far will our $500 go if we want to use the latest CPU technology in a new Budget Gaming PC?  Discuss on the forum:   Check out the Parts of this $500 Rig: Intel Core i3-13100F CPU:  ASRock B660M-HDV Motherboard:  Patriot Viper Elite II DDR4 3200MHz CL18 8GBx1 RAM:  Intel 670p 512GB NVMe M.2 SSD:  DIYPC F2 Micro-ATX Case:  Enermax CyberBron 500W 80+ Bronze PSU:  ASRock AMD Radeon RX6600 Challenger D GPU:   Buy an ID-COOLING SE-214-XT CPU Cooler:  Buy a Thermalright Assassin X 120 SE CPU Cooler:  Buy a Vetroo V5 CPU Cooler:  Buy a SURALLOW NVIDIA GeForce GTX 1660 Super GPU:  Buy a Gigabyte Radeon RX6600 Eagle GPU:  Buy a Seagate ST500DM002 500GB Hard Drive:  Buy a Seagate ST1000DM003 1TB Hard Drive:  Buy a Gioneda 257GB NVMe M.2 SSD:  Buy an AMD Ryzen 5 7600 CPU:  Buy an AMD Ryzen 5 5600 CPU:   Purchases made through some store links may provide some compensation to Linus Media Group.  Some CPU Cooling Options:    Intel system as built:  An AMD AM4 Option:     GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:40 Processor 2:07 Motherboard 2:48 Memory 3:42 Storage 4:35 Case 5:54 Cooling 9:47 Don't try this at home... 10:55 Halo Infinite 11:56 Doom Eternal 12:58 CS:GO 15:25 Outro",
    "description_links": [
        "https://enplay.link/ltt.",
        "https://linustechtips.com/topic/1507424-building-a-500-intel-gaming-pc/",
        "https://geni.us/ctkl",
        "https://geni.us/mD5Ns",
        "https://geni.us/yXyl0oB",
        "https://geni.us/LsAg",
        "https://lmg.gg/RWSoW",
        "https://lmg.gg/dS2h5",
        "https://lmg.gg/LwG9j",
        "https://geni.us/EUFXL",
        "https://geni.us/HhYfVfZ",
        "https://geni.us/2Iylbpv",
        "https://geni.us/R0tHPa",
        "https://geni.us/jbAca",
        "https://lmg.gg/0PL2y",
        "https://lmg.gg/00uX6",
        "https://lmg.gg/qFyBs",
        "https://geni.us/BBSLeys",
        "https://geni.us/YVGO7G",
        "https://pcpartpicker.com/products/cpu-cooler/#xcx=0",
        "https://pcpartpicker.com/list/6DJ4xs",
        "https://pcpartpicker.com/list/mYg7Kp",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- I know what you're thinking. It's only been nine months since our last $500 budget build. But in that short time, we've seen AMD and Intel launch new product families, and we've seen inflation take away about 3% of our buying power, which at a $500 budget works out to about $15, which is the difference between eight and 16 gigs of RAM, or between a 512 gig and a one terabyte SSD. So we've got a lot of questions to answer today. Like how far will $500 go if we want the latest CPU tech? Will we be able to afford a good GPU, an okay GPU, a GPU? Can I afford a segue to our, ooh, I faked you out. We're gonna get right into it today. Starting with the Core i3-13100F. Four hyper-threaded performance cores and a boost clock of 4.5 gigahertz, the Core i3-13100F doesn't offer a lot of bells and whistles. It doesn't even have onboard video, but it does support Intel's latest platform features like PCIe Gen 5 and DDR5, even if we won't be using them. And it's only $100, making it, well, the only option. By comparison, the cheapest 7000 series Ryzen CPU is the 7600 for a whopping $120 more. To be clear, it is much faster. Six cores rather than four at up to 5.1 gigahertz. But at this price, AMD just isn't viable for our system. And what's really wild is even if we go back to their older AM4 platform, we find that AMD has simply abandoned the budget-minded customers that kept them alive during the bad years. Even with a Ryzen 5600, we would need to make extra compromises to hit our $500 budget, like trying to find a free case or buying a used GPU. But today's a no-compromise day. I especially am not gonna compromise on this segue to our sponsor. - Enlisted! Take part in iconic World War II campaigns in this immersive, free-to-play first-person shooter. Use detailed, era-accurate firepower to dominate the competition. Get enlisted at the link below. - Unlike 20 years ago when I first got into this hobby, there's not much left in the way of bad motherboard brands. So really what it comes down to is finding something that has the features and connectivity that you require. We settled on the B660M-HDV from ASRock. It's got a total of six USB 3.5 gigabit ports, including one Type-C, dual M.2 SSD slots, ample PCIe, USB 2, and SATA expansion. And while it only has two DDR4 memory slots, unlike the H610 chipset motherboards that come in a little bit cheaper than this, those slots support overclocking, which means we're not leaving any performance on the table. I, well, not that that's necessarily a concern given our RAM choice. We ended up with a single eight gig stick of Patriot Viper Elite 2. And I know, I know, this is gonna be a bit of a controversial pick, so please allow me to explain. This lands firmly in the bang for the buck speed range for this platform. And while we could have gone with 16 gigs of RAM, or at least a dual channel eight gig kit, which would have netted us some additional performance, it's a slippery slope, right guys? I mean, if we start with a budget, but then we keep saying, ah, what's $10 more? Suddenly we find ourselves with a $600 build rather than a $500 build, and $100 of debt to our mean older sister. It's far better to just drop a second stick in down the road, upgrade to dual channel later when it can be found dirt cheap secondhand, or when cash flows a little bit looser. Which, while I tend to shy away from the F word, ended up being one of the big themes of this build. Let's talk about storage. For nearly the same price as this Intel 670P 512 gig SSD, I could have had an SSD and hard drive combo that would have netted me significantly more capacity. And in an era when some games will take up a hundred gigs on their own, there's no question that that's desirable. But storage is one area where I just don't like to screw around. And the 670P is not only a known good performer, punching well above its PCIe Gen 3 weight class, it's also got an excellent reputation for reliability. I mean, do you wanna be gaming or do you wanna be waiting around for a warranty replacement that might never come? And besides, once this is full and you wanna boost your storage space down the line, those dirt cheap drives on Newegg are still gonna be there and you can always throw them in knowing that you've got a rock solid foundation. Though I'm not sure I can say the same about our case. The DIYPC F2's main selling point is available in purple or orange. It doesn't have entirely terrible cable management thanks to this kind of popped out back panel here. You can see when we pop off the panel, it's totally flat here, no room for anything. But that's where your space is. As far as I can tell, it's to save the like 6% materials cost of making everything else a little bit bigger to accommodate that extra width. So you just stamp it out of the side panel. It's ingenious actually. Truthfully though, none of that is why we chose this. We chose it only because it is literally the cheapest MATX case that we could find on PCPartPicker. And I would never buy this case. Not because I'm some kind of out of touch elitist, but because I am willing to get down and dirty. If scavenging from a dumpster means saving $38, almost 10% of my total budget here, I'll do it. And you should too. The ATX standard hasn't been meaningfully changed in almost 30 years, which means unless you're buying a top of the line GPU, which you're not, your modern system will probably fit in this, or this, or this, or this, or this. And on the subject of using what you've got, let's talk about cooling. Even as you start to upgrade the machine, the CPU heat sink is one of the last things that I would recommend you spend money on. Intel stock cooler, it ain't much, but it'll take you all the way up to a 13700 non-K. So you might as well use it. Now we just need to plug in our CPU fan header, and while we're at it, let's do our case fans as well. We've got the rear one, and the front one. Header here, yes. If you must have something bigger or especially quieter, there are plenty of options in the 15 to $40 price range. We're gonna have some of those linked down below. Or you could just take my advice and spend that on an adorable wag hoodie for your four-legged friend. Just 24.99 at lttstore.com. Now we just gotta do a little bit of cable management. Here's our front USB 2.0 as well as our HD audio. So convenient, these come in little bricks. Easy peasy, they only go in one way. I can't say the same for our front panel connectors, but what I can say is everything is very helpfully labeled. Reset, power switch. Last thing we've got is our front USB 3.0. Just be careful with this one. These pins are very fragile. Make sure you got it aligned before you click it in. Time for power. This is gonna be yet another controversial choice. We've gone with the Enermax CYBERBRON 500 Watt. It's non-modular, but it does at least have black cables, so it'll look nice. It's 80 plus bronze. It's got dual six plus two PCIe connectors. So it's good for pretty much any performance tier and down GPU. But the issue is that you can get a functioning power supply for as little as like 20 bucks. The issue for us is that our options below this price point are either from unknown brands or from Thermaltake, whose entry-level lineup doesn't have a great reputation. And the thing is, given the risk of collateral damage when a power supply blows, from my point of view, you just can't afford not to spend a bit more here. Didn't really script anything for cable management here. So I guess we're just gonna wing it. Oh yeah. Eight pin. The eight pin has no cable management cutout, so it's just gonna go here. Now this is gonna come right here. Cool. Not bad, not bad. - [David] Not great, not great. - Yeah, yeah, yeah, yeah, just, everybody just relax for a second, okay? That goes there. All right. And now it's pretty all right again. I had a segue into this written, but we're completely off script now, so I'm just gonna open by saying it's amazing what 200 bucks can buy again these days. Anything. The ASRock Challenger D Radeon RX 6600 has eight gigs of VRAM, a core clock of 1,626 megahertz, and a dual fan cooler. That's not bad considering that our only real criteria was how much money do we have left? Okay, I'll take that one. At $200, you're pretty much looking at the GTX 1660 or the RX 6600. Between those two, the 6600 is much newer and way more powerful. See you later, NVIDIA. Not bad though, right? - [David] Nah, it's fine. - I mean, it's not great, but not bad. Power's in and everything's looking pretty good on this side. Not as great on this side. We'll deal with that in a sec. First, I wanna address some of the other options for GPUs. If you're not married to buying brand new, at $200, there are some very interesting options in the secondhand market, including 2080s, 1080 Ti's, 5700 XT's, and 6600 XT's. It's a lot more performance, but you do miss out on your warranty. Oh boy. Oh, I don't know if I want you to roll on this. - [David] Too late, I've pressed the button. Wow, that's something. Just, yeah, no, that's... - [David] Good thing that case is so sturdy. - It's a really good case. Wow, it's like that video of the bloated whale carcass where the guy like cuts it open and it's like, psh. Okay, let's fire it up. Panels, bad GBs, it's not gonna work. Adding everything up after a small mail-in rebate, I think it was like 10 bucks, right? We are just under our budget at $498. We're gonna have a link in the description to our PCPartPicker list. Before you click on that though, let's see if it's worth buying. This is fricking awesome. Sitting at 9%, 8, 6% CPU usage with screen capture going. We're using the GPU for encoding, but it does still use a little bit of CPU. Let's fire up a game. We're gonna go hard. Going straight to Halo Infinite. I think we can go to high preset. Restart of the game to take effect. No, I'm not gonna restart the game. Fine, whatever. 1080p medium preset. Still, we're looking at 80 FPS for our 1% lows. So if you're losing at that point, that's on you. That's good. They didn't even pick up my sniper. These guys suck. (chuckles) Definitely struggling a little bit sometimes. The real world experience is not quite on par with what the FPS numbers would suggest. It's almost like there's a little bit more input lag. Can't put my finger on it. - [David] Shall we play another game? - No, I'm busy winning. I'm the top on my team. What do you mean that's what winning looks like? You want me to capture the flag? Fine, I'll capture the flag. I don't even care. Wait, 10 seconds. 10 seconds of what? We're almost out of time. Draw or, oh, we won. We won. What, we won? All right, Doom Eternal. Hey. But notice how quiet it is. Not bad, generic Orange LED fans. And even that poor Intel stock heatsink when it's barely doing any work. Very quiet. I think Ultra Nightmare is probably a little aggressive for this. Let's try high. Something is attacking me. Look, I don't have any audio. And this is running amazing. Okay, I probably could be running Ultra Nightmare right now. Okay, we're turning it up. It's way, way too good. Ultra Nightmare is a little much. That's not quite right. Oh, crap. Yeah, no, this is laggy. Let's try Nightmare. Or let's try Ultra. How about Ultra? Okay, too easy. Now we're getting 150 frames per second. There has got to be a middle ground here. You know what? I bet it was a CPU issue. Even playing a single player game, four cores these days, very borderline. I'm hitting 80 plus, sometimes 90% CPU usage. Doom Eternal, right? In multiplayer games, there's a little bit more for the CPU to keep track of, and that can be more of a challenge. To be clear, it was very playable, but it's not going to be necessarily optimal. Wait, I only have a pistol now? Wait, what was that? Oh, that was, was that warmup? - That was your knife. - What's happening right now? - Oooh! - I mean, I'm- - Oh, no, you killed your own team. - Oh, did I? - Yeah. - Yeah, it is free for all. Okay, no, no. So I was supposed to do that. So that was epic then. Yeah, whatever. Dang it. Oh, come on. Come on. They're too good. I can't hit Meisel. I'm coming at him from every side. He's dominating me. (David hums) Yeah, thank you for that, David. Anyway, we're getting anywhere from 150 to 300 frames per second. I'd say that's fairly playable. Not that it helps me not suck. - [David] Close the video out, I wanna go home. - No, I'm killing this guy. How did that miss? David, help me out here. These guys good or am I terrible? - [David] That was pretty bad. Ah! Who would have thought that Intel would be not just a good budget gaming option, but the budget gaming option? If we wanted to go AMD with this, we'd have to go all the way back to AM4, maybe a Ryzen 5600 on an A520M board or something like that. The point is that's taking me into probably gonna regret this territory on the cheapness of the motherboard, and it would still cost me a bit more. And if I wanted to spend a bit more, this is still a great starting point. I could cheap out on my case and spend a little bit more. I could get a Core i5-13400 on the same platform. Or if I didn't wanna spend anything at all, I could go for the segue to our sponsor. - Enlisted! Transport yourself onto the battlefield during iconic World War II campaigns with Enlisted, the free-to-play first-person shooter that blends PvE and PvP elements together to create an immersive and unique combat experience that's a lot safer than the real thing. Command a squad of customizable AI soldiers and upgrade and equip them to adapt to any engagement. With over 100 weapons and vehicles at your disposal, you have boundless ways of neutralizing the enemy. M1 Carbine or Thompson? Panzer or Tiger? The choice of brutal killing machine is yours! With so much customization, no one firefight will feel the same. Are you way hardcore? Realistic movement and damage models make battles feel nail-bitingly intense. Feel like taking it easy? Even the most casual of players will feel like they're playing an important role. And with cross-play between PC, PlayStation, and Xbox, anyone can take part in the action. So check out Enlisted using the link below and get an exclusive bonus pack. - If you guys enjoyed this video, why not watch the one where I built a computer just following instructions generated by ChatGPT? It was something.",
    "transcript_keywords": [
        "bit",
        "CPU",
        "yeah",
        "good",
        "GPU",
        "bad",
        "budget",
        "Intel",
        "case",
        "Ultra Nightmare",
        "AMD",
        "Ultra",
        "SSD",
        "power",
        "great",
        "spend",
        "point",
        "Core",
        "USB",
        "Enlisted"
    ],
    "transcript_entity_values": [
        "ASRock",
        "10 seconds",
        "one",
        "1080 Ti's",
        "SSD",
        "eight",
        "only $100",
        "Patriot Viper Elite 2",
        "USB 2",
        "15 to $40",
        "PvP",
        "GPU",
        "Thompson",
        "AI",
        "9%",
        "FPS",
        "AMD",
        "7600",
        "Xbox",
        "10 bucks",
        "MATX",
        "5700",
        "1,626 megahertz",
        "PCIe Gen 3",
        "200 bucks",
        "512",
        "USB 3.0",
        "Meisel",
        "David] Nah",
        "H610",
        "first",
        "20 years ago",
        "PvE",
        "120",
        "First",
        "150 to 300",
        "80",
        "Doom Eternal",
        "80 FPS",
        "USB 2.0",
        "Six",
        "13700",
        "CPU",
        "6600",
        "six",
        "sec",
        "4.5 gigahertz",
        "Ultra Nightmare",
        "between eight and 16",
        "about 3%",
        "6%",
        "the RX 6600",
        "Intel",
        "PCIe Gen 5",
        "ATX",
        "1080p",
        "over 100",
        "four",
        "a Ryzen 5600",
        "90%",
        "almost 30 years",
        "Doom Eternal",
        "10",
        "hundred",
        "David",
        "up to 5.1 gigahertz",
        "16",
        "World War II",
        "Just 24.99",
        "38",
        "Ultra Nightmare",
        "150",
        "the bad years",
        "David hums",
        "600",
        "two",
        "these days",
        "F",
        "Enlisted",
        "second",
        "almost 10%",
        "about $15",
        "Eight",
        "XT",
        "200",
        "today",
        "NVIDIA",
        "1%",
        "Ultra",
        "7000",
        "Ryzen CPU",
        "RAM",
        "as little as like 20 bucks",
        "six USB 3.5",
        "2080s",
        "Newegg",
        "498",
        "AMD",
        "GTX",
        "500",
        "100",
        "Thermaltake",
        "A520",
        "nine months",
        "PlayStation",
        "8",
        "DDR5",
        "M1 Carbine",
        "Halo Infinite"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "PERCENT",
        "DATE",
        "WORK_OF_ART",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "MONEY",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "PERCENT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "DATE",
        "PERSON",
        "PRODUCT",
        "WORK_OF_ART"
    ]
}