{
    "id": "XZkuaj1Jf1Q",
    "title": "This phone makes my hands look BIG! - ASUS Zenfone 8",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-05-12T19:31:02Z",
    "video_url": "https://www.youtube.com/watch?v=XZkuaj1Jf1Q",
    "category": "Science & Technology",
    "tags": [
        "ASUS",
        "Zenfone",
        "Zenfone8",
        "Smartphone",
        "Zenfone 8",
        "Mobile Device",
        "Snapdragon 888",
        "Budget",
        "Mid-tier",
        "Phone",
        "Finger print",
        "Gamer",
        "Sony sensors"
    ],
    "views": 414679,
    "likes": 19624,
    "comments_count": 1412,
    "description": "Grab your new iFixit Fix Kit at   The ASUS Zenfone line has been out for a while, but recently it's getting incrementally better and better. The ASUS Zenfone 8 is a bit interesting as it's priced well, has some of the top features/specs, but it doesn't follow other brands in making it compact. Also, it makes Linus hands feel big for a change.   Check out the ASUS Zenfone 8 at  Check out the ASUS Zenfone 8 Flip at   Buy ASUS Zenfone On Amazon (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  Timestamps:  0:00 - ASUS spells phone fone 0:11 - Linus plays with stickers 0:19 - Unboxing really starts 0:33 - Showing off the Zenfone 8 2:27 - Rest of the unboxing 2:36 - iFixit! 3:01 - Included Charger 3:05 - More in-depth look at the phone 3:39 - Zenfone 8 Display Information 4:45 - Zenfone 8 Performance Specs 5:40 - Watching videos on the Zenfone 8 5:55 - Quick speaker-test 6:13 - Zenfone 8 Camera Test 6:43 - Zenfone 8 Flip differences 7:17 - Final thoughts  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.iFixit.com/LTT",
        "https://lmg.gg/WfiSM",
        "https://lmg.gg/IpcNs",
        "https://geni.us/9KRmnl4",
        "https://geni.us/xHzF",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Who would've thought Asus would make it to eight iterations of their Zen Fone lineup and still not spell phone right. It's P-H-O-N-E Asus, not F-O-N-E. I can have some fun with these. Who am I? Who am I? No, you don't get an Einstein vibe? - [Brandon] No! (chuckles) - You know what? What'd they say, \"Defy ordinary\"? I'd say this is a better-than-bare-minimum included phone case. I really don't like those clear, kinda vinyl-y plastic ones. This is kind of a harder plastic. Feels a little more robust. Oo! It's kinda weighty, but actually compact. Oh, Interesting. Wow, it's really holdable. This is a kinda different-y feeling phone. It's got like a... It kinda reminds me of the Galaxy S6 or S7, but more modern-feeling in the hand, somehow. So you don't have that two and a half D glass that you see on a lot of the newer flagship phones. A lot of people will like that. A lot of people prefer a flat glass. But in terms of the shape, right, and the antenna bands it does kinda remind me of those other phones, but then I also get kind of like a almost couple-generation-ago like a Pixel 2 vibe to the feel of it. 'Cause it's gotta nice skinny screen, it's got the color accented lock button. Actually, we should probably go through the rest of the IL and then it's like, it's like kind of, it's thicker, rather than being a super skinny slab. It feels really good in the hand, and the curve, the curve back here, is just kind of perfect for sitting in your hand like that. I really like the hand feel, bare in mind of course, I do have slightly smaller hands. Another thing that is a bit of a blast from the past is, of course, the inclusion of the 3.5 millimeter jack. Got our volume rocker over here, we've got a USB-C port that can take up to 30 watts of power for quick charging. It's a 4,000 milliampere battery and then around back, we've got a dual-camera system with a 64, and a 12 megapixel Sony sensor. This is kind of a funny one to me. In Asus' marketing materials, they actually say, \"Hey, the 64 megapixel one is like really good, so you could just use that as your telephoto lens and just zoom in.\" It's like, \"Yeah, especially some of the earlier dedicated telephoto lenses on phones. That has kind of always been the case that when they had inferior sensors on them but longer lenses, you could just use your main shooter and just digitally punch in and it looked as good, if not better.\" These days though, especially with a lot of the, ya know, AI fixing that's done by folks like Apple, and Samsung that's not really the case anymore. Thanks to iFixit for sponsoring today's video. iFixit wants to help you skip your next phone upgrade, by helping you replace your battery, or fix your screen using one of iFixit's Fix Kits. They start at just 11 US Dollars and allow you to repair camera lenses, screens, replace batteries, and they've got step-by-step guides with photos and detailed instructions. So this is the links in the description to find the repair kit for your phone. 30 watts, max charging, right, there? And they include a Type C to Type C cable. Thank you, Asus. Under screen fingerprint sensor. Feels pretty responsive but we won't know until we actually go to unlock the phone. Oh, that's interesting. Maybe due to the smaller screen, but Asus opted to, set it to gesture-based navigation by default. So far, ya know, checking out some underwear on LTTstore.com, you wanna go back, just a little something like that. And then if you want to multitask, little something like that. Interesting, I mean, you don't really have a ton of space, even though the chin bar and forehead bar are both very respectable. It's not like you have a ton of space on this screen to take up with buttons in the light. Now that, is an improvement over those older phones. It's got a 120 hertz E4 Samsung AMOLED display that peaks at, I think it's, 1,000 nits of brightness. So that means, if you were to fire up Netflix, or any other HDR capable video watching program, like, oh I don't know, say, let's head over to YouTube. You are probably going to be getting a better HDR experience on this screen than you would on the main one in your living room. Of course, because this isn't really that large of a phone screen, I can't say that I would recommend doing all of your movie watching on it. You can see that while it is easily one-handable, it's pretty small, even compared to an older flagship phone, like my daily driver, Note 9. Surprisingly, nice feeling haptics, that's kind of unexpected. A lot of the time, on more budget-oriented phones, that's one of the first things that they just don't bother putting the work into because it doesn't really show up on the spec list the way that the SOC or the RAM, or whatever else, do and it's easy to just ignore it. But they actually feel pretty nice. Oh! Actually, we should talk about the specs because while I've referred to it as more budget-optimized, it still has flagship-ish internal specs, making it a really unusual, almost like a Sony-esque phone. It's, ya know, small, when every other flagship is gigantic these days. But it still has a Snapdragon 888 processor, up to 16 LPDDR5 memory, up to 256 gigs of UFS 3.1 storage Bluetooth, 5.2 Wifi 6, basically everything that you would expect from a flagship phone, except there's like that weird stuff missing. I guess to fit into this compact frame. Like normally, you'd see a triple camera or you'd have wireless charging, that's like reverse charging, all that kind of stuff. But they were like, \"No, we're going for compact, high performance, but lower price and maybe some of the pre-chart comfort features aren't really present. There's no micro SD expansion, but it does have dual SIM. Man, that is, that is a yeah, a good looking display. Oh yeah, one of the other selling points that you wouldn't normally find on a... I don't even know what this thing is. It's not, it's like budget flagship, I guess, but that you wouldn't find on a budget phone is an amplified earpiece speaker for stereo. Uh, I think this one should have it though. Yeah. So you get the bottom firing speaker, along with the amplified earpiece speaker. It's a lot harder to put decent speakers in a small frame like this. Man, that display looks really good. Yeah, I would keep my expectations tempered, in terms of the camera. Asus is doing a better job than they ever have in the past, but it's not, um, ya know, the most exceptional thing. (camera clicks) Mm, after processing, it looks a little bit better than the viewfinder does, so credit for that. 'Sup surge? - Eh, not much, you? - Eh, I'm pretty good. - Is it doing that recording there for ya? - Oh yeah. - Nice. - Alright, sweet. Oh, now it seems like uh, (camera clicks) as a good of time to mention as any, that Asus has another version of this phone though, the Zen Fone 8 Flip. And that one is 6.6 inches, instead of 5.9 inches on the display, it has their like, rear camera. It's a triple camera range, it flips around instead of having a hole punch selfie camera on the front, which I'm still not a big fan of. Especially, with how it's sort of wide the bezel around it is on this particular one. It's got a 5,000 milliampere battery, rather than a 4,000 milliampere battery. A couple other key upgrades, but also some downgrades. So, it has SD card expansion, but the display doesn't get as bright. Honestly, I think this one is, was the right one to send me. Because if nothing else, it's pretty unique. Like, Snapdragon 888 in this form factor, almost nobody is doing anything like that. And as long as you don't care about wireless charging, I would say, that you would be getting basically everything that you could need unless you are like, a shutterbug, then you wanna take the best possible mobile photos. Yeah, it's one-handable. Oh yeah, it has the response, okay. Unlock speed, not bad. Not great, not the fastest I've seen, it's no One Plus, but not bad at all. I like it and I like telling you guys to subscribe to ShortCircuit so you don't miss more videos, like this one.",
    "transcript_keywords": [
        "Zen Fone lineup",
        "kind",
        "phone",
        "Zen Fone",
        "Fone lineup",
        "Yeah",
        "Asus",
        "Fone",
        "screen",
        "phones",
        "good",
        "lot",
        "thought Asus",
        "spell phone",
        "camera",
        "flagship",
        "pretty",
        "charging",
        "flagship phone",
        "display"
    ],
    "transcript_entity_values": [
        "888",
        "Einstein",
        "IL",
        "Asus",
        "RAM",
        "one",
        "USB",
        "4,000",
        "just 11 US Dollars",
        "1,000",
        "iFixit",
        "YouTube",
        "9",
        "64",
        "6.6 inches",
        "SOC",
        "5.2",
        "the Galaxy S6 or",
        "max",
        "5.9 inches",
        "two and a half",
        "Samsung",
        "These days",
        "daily",
        "256",
        "Brandon",
        "first",
        "Sony",
        "Netflix",
        "Asus",
        "these days",
        "16 LPDDR5 memory",
        "120",
        "3.5 millimeter",
        "30 watts",
        "UFS 3.1",
        "the Zen Fone 8",
        "E4 Samsung AMOLED",
        "12",
        "hertz",
        "P-H-O-N-E Asus",
        "Mm",
        "Sup",
        "SD",
        "ShortCircuit",
        "up to 30 watts",
        "64 megapixel",
        "5,000",
        "eight",
        "Zen Fone",
        "Apple",
        "today",
        "Pixel 2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT"
    ]
}