{
    "id": "XzW3PvSSy8w",
    "title": "I hope you can find a 3080 Ti in stock - EVGA FTW3 Ultra",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-06-12T19:09:47Z",
    "video_url": "https://www.youtube.com/watch?v=XzW3PvSSy8w",
    "category": "Science & Technology",
    "tags": [
        "EVGA",
        "Gaming",
        "PC",
        "Video Card",
        "3080 Ti",
        "NVIDIA",
        "Performance",
        "FTW3",
        "Ultra",
        "Cooling",
        "1080p",
        "12 GB Ram",
        "VRAM",
        "GPU"
    ],
    "views": 347518,
    "likes": 13080,
    "comments_count": 1006,
    "description": "Head to  and activate Honey for free to start saving today! Thanks to Honey for sponsoring this video.  The EVGA GeForce RTX 3080 Ti FTW3 ULTRA is an impressive card but what will be more impressive is finding one in stock. Alex gives you at least a taste of what you can expect when you finally get one.   Check out the EVGA GeForce RTX 3080 Ti FTW3 ULTRA at   Buy Glorious PC Gaming Model O Wireless On Amazon (PAID LINK):  On Newegg (PAID LINK):   Buy the Logitech G915 TKL Mechanical Gaming Keyboard at   Buy ASUS ROG PG259QN 360hz Gaming Monitor On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):   Check out the Digital Storm Velox Gaming PC at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - Intro 0:41 - Unboxing 1:30 - Video card unveiling 1:50 - Video card physical overview 2:23 - It's ok to spin the fans... a bit 2:47 - Installing the 3080 Ti 3:56 - Honey! - Sponsor 4:19 - Turning on the 3080 Ti 4:38 - Digital Storm specs 5:05 - Gaming on the 3080 Ti 6:08 - 3080 Ti temperatures 6:48 - Alex video card tips 7:16 - 3080 Ti fan noise impressions 7:52 - Taking the 3080 Ti apart 9:31 - Cooler impression 11:01 - PCB board impressions 11:31 - Closing thoughts",
    "description_links": [
        "http://joinhoney.com/shortcircuit",
        "https://lmg.gg/xjAGf",
        "https://geni.us/znSmvh",
        "https://geni.us/YTkvC",
        "https://geni.us/KOJlJUs",
        "https://geni.us/i5eK8",
        "https://geni.us/DBjexh",
        "https://geni.us/mI3h12T",
        "https://lmg.gg/sUMM7",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Well, here it is 3080 Ti. Beautiful thing, I think. If I'm totally honest, I know nothing about this. It came out last week and I was too busy drifting a Porsche to care or have time to care. So here we go. The very first thing you know, this thing only has 12 gigabytes. What were we talking about? EVGA, this is the FTW3 Ultra. And it's probably really fast. (chuckles) It's basically a 3090 but with half the... Oh, that's why it's 12, of course. Okay so it's probably the same card but we only have memory chips on one side and none on the other. Okay. You know, it has ray tracing, of course. PCI express gen four, I wonder if we have that in our system here? Yeah, let's open it up. (chuckles) (cardboard scrapes) Oh, that sounded terrible. - [David] Yeah. - EVGA needs to hire some people from like BMW and whatever for their sound design. You put it down, (vocalizes). (chuckles) (David laughs) I want that sense for your graphics card opening. This card includes a retention bracket for attaching to some select chassis. Learn, I am going to learn more. It says essentially the exact same thing. But with two pictures. (camera crew laughs) Here she is. (plastic crackles) This is my first time seeing the 3080 Ti. 20% off a capture card, cool. Oh, I wonder if there's a game code in here. No game codes? Oh, we've got a powered by EVGA sticker. I think that's it. (plastic crackles) Here we are though. Can we do this in a nice way? (plastic crackles) Yeah. (camera crew exclaims) (presenter chuckles) (set crew member applauds) Oh, that was not ideal. (chuckles) (set crew chuckles) These peels are so hard. So it looks like that they have kind of like a through PCB design here. So this fan shoots straight through. It goes straight through the PCB and out the back. Which is pretty cool, in my opinion. We also have what, three eight pin connectors. This thing probably over-clocks like a beast. Is that a vapor chamber? Well we'll find out when we take it apart. They all spin in the same direction. Some GPUs will have this fan spin the other way. I don't think it really makes a difference. (chuckles) Two and a half slots, I guess. Not quite a three slot-er. Oh okay, people always get mad apparently when I spin the fans. This is gonna be fine. When you spin a fan it basically just turns it into a generator and it can feed current back into your board and it's bad. But if you're just doing it like that, it doesn't matter. Like it's the kind of thing where it's only gonna be a problem if you're like, (vocalizes). Like really giving her. I would not blow compressed air into this. That will be bad. (chuckles) And let's just do it, let's game. (computer thunks) Oh geez, yeah. This is a big case you got here Jono. - [Jono] You said that you wanted a pre-built, so. - I did want a computer. (tool clanks) Oh, jeez! I've got this fancy 3080 in here. Spending like any more than like $500 on a GPU, I find incredibly hard to justify. (chuckles) - [David] Really? - The point of having a graphics card is to play video games, it's not to have the best graphics card. (grunts) There we go. (graphics card clicks) (chuckles) That was more difficult than it needed to be. This is also a fine looking card, look at this thing. Sorry EVGA, I just wanna appreciate this for a second. What do you think David and Jono, which one would you get? The eight pins on this are the opposite way of the ASUS card. - [David] Oh no! - Oh that sounded bad. Powered by EVGA. (plastic crackles) Where should I put it? - [David] In the garbage! - No? - Put it in the garbage! - [Jono] Dude, this is a giveaway PC for a future video. - [David] No, no! (chuckles) You son of a (beep). (laughs) You son of a (beep). - Beautiful. (chuckles) Honey, is the free online shopping tool that searches for the best promo codes whenever you shop online at specific sites. It's free to use and installs in just two clicks. Honey works on lots of your favorite stores including Amazon, eBay and Newegg, Razor, Best Buy, Walmart and many more. All you have to do is click apply coupons when you're at the checkout page and wait for honey to search for the best working coupons. Get honey for free right now at joinhoney.com/shortcircuit. (vocalizes) We're using it, whatever. Let's turn this PC on. (chuckles) (David and Jono laugh) - [Jono] Wow. - RGB. Wow, that's a lot! (chuckles) What a beautiful thing. Editor can you please flip it right side up right now? So that the B cams got it in the way most people would see it. (sighs) I love updating computers. All right, let's see what we're dealing with here. We have got a I9 11900K. So that's eight cores. At a very fast speed but not as fast as the last one from Intel. (chuckles) 32 gigabytes of RAM, two DIMs. Only 3,000 megahertz so this is not speedy boy RAM but whatever. And of course the RTX 3080 Ti. What a wonderful thing. Now we're going to boot up everybody's favorite game benchmark, Valheim! (chuckles) Let's see, in here we are now getting 34 to about 40 FPS. That's not too bad. I built a chandelier Jono, are you impressed? (Jono and presenter laugh) And we're actually still getting right around 40 FPS down here so I guess it's pretty hard to get more than about 30. And, oh we're at 40! Not too bad, not too bad. I normally get 18 FPS on 1080 so that's a pretty big upgrade right there. Yeah a graphics card that costs like, I don't know roughly one left nut is good at gaming, who is surprised? Now let's play some Doom. Okay, so we're getting a pretty steady 300 plus FPS. This is a 1080p so it's not very surprising that it's playing really well. This is a pretty OPI card for 1080p. But it does definitely play good. You cannot take that away from it. Now what are our temperatures like? GPU is currently at 70 degrees Celsius. Yeah, how loud is this? Oh wow, there is some heat coming off of this thing. (David and Jono laugh) Well it looks like on the back, we're seeing a maximum of about 69 degrees. - Nice. - Nice. But also that really isn't all that bad. Humans are pretty terrible at telling the difference between anything over 50 degrees because either way you're getting burned. So that feels very hot. But for cards like this, it's really not that bad. Some 3090s are what, like a hundred degrees on the back? Something stupid like that. So I'd call that a win actually for EVGA. A card being hot and a card out a lot of heat are not necessarily related. Now I have an EVGA card in my system at home and this one seems to act in a similar way. Where out of the box, it's basically throws all the performance at you at the expense of some thermals and fan noise. I feel like if you just slightly undervolted this thing, you could have the fans drop considerably. Which I personally, like you, do sacrifice some frames but eh, whatever, it seems worth it to me. That said this thing is really quite quiet. So I don't know if you can hear fans right now but if you can, it's the AIO at the front of the system. I can't really hear the GPU even though it is going half hard. What else do we do, do we just take it apart now? Oh (bleep) I hit restart. Now that we're just at the desktop and it's not doing a whole lot, all three fans completely turned off. I don't know if you can see it there and this is kinda scary but zero fan speed right now. That is awesome! For it being nice and quiet. (sighs) These cables are not very easy to deal with. I feel like I'm talking to my dog here. Come on, let it go, com on. (grunts) Oh. (laughs) (David and Jono laugh) Oh, good boy. (laughs) Here we go, safety first. Thank you Mr. Steve. (paper rustles) Someone rolled us up the wrong way. So let's see how difficult this is to get into. On the back plate at least, it looks like it's all Phillips head screws, which is nice to see. Another cool thing that we have on here is a case fan and RGB headers. That's nice just because then you can have your case fan controlled by your GPU. So it changes its temperature based off of this thing and its fan curves, as opposed to like your CPU temperature. Oh, I don't like that! I was wondering why it felt like the screws were kinda stripped. But it's because they just have a nut on this side. Goodbye warranty. (tool clinks) There we go. Now that we have the backplate off, we can see why it has 12 gigs of RAM. So if this was a 3090, right here and right here, you would have memory and that's what gives you the 24 gigabytes. Instead of this guy right here, which is 12. Which is not enough for a 3080 Ti in my opinion but we've already been over that. (chuckles) Very standard IO shield. It's like we have, I'm guessing a BIOS switch here. (sighs) Wow, there's a lot of tension of this thing, look at that. Oh, that's really stiff! Did this just come off? Oh, I hate this when I don't know though and I'm just pulling on a GPU. Oh, here we go. Oh, there's a little fan cable here. (upbeat music) This is cool, you can actually see where the heat pipes were soldered to this copper piece because it's slightly discolored. Count these. One, two, three, four, five, heat pipes. What is going on here? Oh I see, I got it! I get it, I get it. Okay. So it's actually seven heat pipes, I lied. Wait, is there? I need to take this apart. (sighs) Then do I have to put it back together though? Oh, wait! On their website there's an exploded view. Three, four, five, six, seven. So seven heat pipes. I was correct before. Three of them terminate right at this copper plate instead of going all the way back. So it looks like three of the seven are eight millimeter heat pipes and four of them are 10 millimeters. Let's see how we do for cooling here. We have this massive copper plate. That is an HC. Now you kind of can argue whether or not you want a vapor chamber or just a copper hole plate so something like this, just pure copper, the advantage of that is you can get it way flatter, way easier. You don't have to worry about like you know, filling it with fluid and crap. Although the problem is, is that like you know, it's not a vapor chamber. It doesn't as efficiently move the heat all around. I guess for this, it doesn't matter as much since most of the heat pipes are going straight across your cold bit anyway. But I'm kind of just making this up as I go. And aside from that I don't really know what else we can say about this thing. This seems like a good cooler design, there's loads of fans. And then, do we have any paper towel around? The bearings in this chair are incredible. Look at this. (chair material squeaks) (set crew chatters) (chair clacks) Whatever thermal paste they used here, it does not wanna come off. So what do we have here? So the GA 102-225-A1. I believe that's the same as the 3090 except that's probably like slightly different numbers. But yeah, it's a beautiful little chip. Massive! I do have to say this thing is a very big GPU. It's really expensive, it also games really good. It should have more RAM. Bye. (chuckles) (set crew chuckles) So thanks for watching guys. If you want to see more stuff like well, I guess I don't know, laptops and cars and stuff get subscribed! And just have a great day! Bye.",
    "transcript_keywords": [
        "thing",
        "card",
        "EVGA",
        "fan",
        "heat",
        "bad",
        "GPU",
        "heat pipes",
        "Yeah",
        "graphics card",
        "back",
        "fans",
        "pretty",
        "kind",
        "pipes",
        "nice",
        "FPS",
        "RAM",
        "Beautiful thing",
        "copper"
    ],
    "transcript_entity_values": [
        "half",
        "about 69 degrees",
        "Steve",
        "Phillips",
        "seven",
        "70 degrees Celsius",
        "five",
        "Three",
        "Intel",
        "three",
        "One",
        "RAM",
        "20%",
        "Newegg",
        "3090",
        "HC",
        "BMW",
        "Amazon",
        "Porsche",
        "40",
        "3090s",
        "second",
        "last week",
        "12 gigabytes",
        "Only 3,000 megahertz",
        "EVGA",
        "3080",
        "AIO",
        "Walmart",
        "18",
        "IO",
        "OPI",
        "David",
        "32 gigabytes",
        "Jono",
        "300",
        "Valheim",
        "roughly one",
        "50 degrees",
        "first",
        "Razor",
        "Two and a half",
        "eight millimeter",
        "two",
        "1080",
        "10 millimeters",
        "four",
        "GPU",
        "34",
        "eBay",
        "just two",
        "PCI",
        "12",
        "more than like $500",
        "about 40",
        "1080p",
        "RGB",
        "CPU",
        "six",
        "EVGA",
        "more than about 30",
        "3080 Ti",
        "PCB",
        "eight",
        "ASUS",
        "a hundred degrees",
        "Best Buy",
        "five",
        "zero"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ]
}