{
    "id": "y1-e2Ro1_Ig",
    "title": "Mac Pro hands-on: Apple's $6,000 powerhouse",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-06-03T22:04:28Z",
    "video_url": "https://www.youtube.com/watch?v=y1-e2Ro1_Ig",
    "category": "Science & Technology",
    "tags": [
        "mac pro",
        "mac",
        "pro",
        "mac pro 2019",
        "hands on",
        "wwdc",
        "apple wwdc",
        "apple",
        "wwdc 2019",
        "apple event",
        "event",
        "keynote",
        "developers conference",
        "apple developers conference",
        "ios 13",
        "ios",
        "macos",
        "apple ios",
        "ios beta",
        "beta",
        "tvos",
        "tv os",
        "mac os",
        "marzipan",
        "ipad",
        "iphone",
        "airpods",
        "homepod",
        "itunes",
        "App Store",
        "apple tv",
        "news",
        "apple news",
        "tim cook",
        "what to expect",
        "need to know",
        "apple 2019",
        "gadgets",
        "ipad pro",
        "software",
        "hardware",
        "processor",
        "technology",
        "tech",
        "latest updates",
        "tech news",
        "review",
        "verge",
        "the verge"
    ],
    "views": 670719,
    "likes": 8798,
    "comments_count": 1440,
    "description": "Apple unveiled the new Mac Pro today at WWDC. Starting at $5,999, the most powerful Mac is staging a comeback this fall. Although its a new design, the Mac Pro is also a throwback to Apples classic cheese grater look. The interior is structured for modularity and flexibility, addressing one of the big pain points of the outgoing Mac Pro design.  Learn more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/317zo55",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat music) - Hey everybody, it's Nilay with The Verge. I'm here with Apple's new Mac Pro. We've been waiting for this machine for a long time. The previous Mac Pro came out like in 2013. It was that round trashcan. Apple said it had designed itself into a thermal corner, pulled it off the market, and started redesigning this machine to be inherently modular. That's what they said. So, we expected a big tower, but we got a tower that's kind of unlike any other machine. It's all built inside of a stainless steel frame. All the components mount to that frame. This cover is just to manage the thermals. Inside, you've got an Intel Xeon processor with up to 28 cores. There are eight PCIe, four slots. There's an expansion slot for IO. That has an headphone jack, which is very important to me. It's got two USB A ports and two Thunderbolt 3 port. There's an additional USB-C ports on the top. There's also incredible graphics. So this machine that you're looking at right now that I'm sitting in front of is playing 8K video. That is running on an additional card called the Afterburner card that you can configure into the system. It's an FPGA that accelerates video rendering of this kind. This machine also has Radeon Pro Vega II graphics, the dual, so it has four GPUs in it, which is wild. All that stuff is configurable when you order it. There's not a lot of details on how that's going to work yet. All we know is that the base price of this machine, the one that's been announced is $6,000. Apple says that compares favorably to comparable PCs with the same specs that come out at around $8,000. There's also three fans on the front, a blower on the side to manage all the heat generated by that Xeon, by those graphics cards. Apple says that, under a desk, it will be as quiet as the iMac Pro. We'll have to see. In this environment, it's extremely hard to tell. Here's my favorite feature. You can get it on regular stands or you can get it on casters. This one's on casters. I don't wanna move this one too much, but you can see, it rolls. I'm also sitting in front of Apple's new 6K retina display, the Pro Display XDR. XDR stands for Extreme Dynamic Range instead of just high dynamic range. It does a thousand nits of sustained brightness, up to 1,600 nits of total brightness. It has a million to one contrast ratio using what appears to be a very aggressive local dimming system and a heat management system with the same lattice pattern on the back to manage its heat. It's really cool, it looks really beautiful. It's so hard to show you on a YouTube video, but I promise you, it looks really, really cool. That display is $5,000. You can get a matte version for $6,000. And a stand is optional, it's a $1,000, but you could probably just get a cheap VESA stand if you want. But the cool stand that Apple makes, it rotates in portrait mode, it's a thousand extra dollars for this display. So one thing that Apple did not talk about today was putting Nvidia graphics cards in this machine. It's something a lot of people want. Right now, the only options we've heard about are those Radeon Vega II cards. We're gonna talk to you Nvidia and see what they have to say about supporting this machine. One of the things Apple is really excited about is a new module called the MPX Expansion Module. In this machine, actually, the graphic cards are sitting in an MPX Expansion Module That is PCI plus Apple's Thunderbolt 3 bus on a special connector. Proprietary cards are really interesting. They let you do really cool things. The big promise here is if Apple can continue to support those cards over time 'cause these machines are expensive and they're gonna last a long time, so we'll have to see. The sexier Mac Pro really feels like the successor to the cheese grater tower that all of us have been wanting for so long. We will know much more about it when it comes out in the fall. Right now, the only price we have is $6,000 for that base model. I imagine Apple's gonna sell this mostly as a configurable system. That's the whole point. Whether you're gonna add that afterburner card, what graphics cards you're gonna put in it, what processor you're gonna put in it, all of that is gonna hugely impact the price. We're gonna find out more in the fall. So that's everything I know about the Mac Pro, but Dieter and I are here at WWDC. We're gonna find out everything we can. Stay tuned to The Verge for more. Bye, okay.",
    "transcript_keywords": [
        "Mac Pro",
        "Apple",
        "Pro",
        "machine",
        "cards",
        "Nilay",
        "Radeon Pro Vega",
        "MPX Expansion Module",
        "Mac",
        "previous Mac Pro",
        "graphics cards",
        "Pro Display XDR",
        "graphics",
        "MPX Expansion",
        "display",
        "sexier Mac Pro",
        "Expansion Module",
        "Pro Vega",
        "Radeon Pro",
        "cool"
    ],
    "transcript_entity_values": [
        "Mac Pro",
        "2013",
        "Intel Xeon",
        "one",
        "6,000",
        "Apple",
        "four",
        "WWDC",
        "Nilay with The Verge",
        "a thousand",
        "the MPX Expansion Module",
        "three",
        "the Mac Pro",
        "USB",
        "today",
        "Mac Pro",
        "VESA",
        "a million to one",
        "eight",
        "8",
        "The Verge for more",
        "FPGA",
        "Dieter",
        "XDR",
        "Afterburner",
        "PCI",
        "3",
        "Radeon Vega II",
        "two",
        "jack",
        "Radeon Pro Vega II",
        "1,000",
        "One",
        "6",
        "the Pro Display XDR",
        "USB-C",
        "1,600",
        "the iMac Pro",
        "a thousand extra dollars",
        "up to 28",
        "5,000",
        "YouTube",
        "IO",
        "Nvidia",
        "around $8,000",
        "Xeon"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "GPE",
        "ORG",
        "MONEY",
        "ORG"
    ]
}