{
    "id": "y2BsiLi2t9I",
    "title": "Racing two of the most powerful e-bikes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-06-17T14:00:17Z",
    "video_url": "https://www.youtube.com/watch?v=y2BsiLi2t9I",
    "category": "Science & Technology",
    "tags": [
        "super 73",
        "juiced bike",
        "electric bikes",
        "juiced hyperscrambler 2",
        "super 73 RX",
        "best electric bikes",
        "super 73 review",
        "super 73 s2",
        "super 73 electric bike",
        "juiced bikes",
        "electric bike review",
        "juiced bikes ripcurrent s review",
        "hyperscrambler 2",
        "super 73 rx review",
        "super73 rx",
        "electric bike",
        "e-bike",
        "ebike",
        "radrunner",
        "radrunner review",
        "radrunner ebike",
        "rad power bikes",
        "moped",
        "mopeds",
        "scooter",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 176993,
    "likes": 3665,
    "comments_count": 289,
    "description": "Super73 and Juiced are two California companies that make super-fast, moped-style e-bikes that are incredibly popular right now. We thought it would be interesting to take two of their highest spec models  Super73s RX and Juiceds HyperScrambler 2  and see how they stack up against each other. And of course, we raced them too. Which do you think won?  Super73 RX review:    Juiced HyperScrambler 2 review:   Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/3q14F6y",
        "https://bit.ly/3zx3gsE",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Oh man, equal. Off to an equal start, all right. All right, let's go, let's go, let's go. (quiet music) - [Andrew] So there are two California companies, Juiced and Super73, that sell these electric bikes that are kind of like bike moped hybrids but with an electric motor - [Becca] They're super fast, they are very fun and they are very quickly becoming one of the more popular styles of e-bikes. - So we thought it would be interesting to take two of their best-selling models and see how well they stack up against each other. I tested the Juiced HyperScrambler 2 - And I have Super73 RX. Now there are loads of specs to go over, but we definitely need to it race them. - We have to race, there's no choice. - Oh, let's go. - [Andrew] Let's do it. - All right. (dramatic music) - [Andrew] Oh, god, it started weird. Ah, it's bumpy! (Andrew and Becca giggling) - See you! - [Andrew] Oh no, you're going so much faster, no! It's not fair! It was rigged! - No competition, too easy, too easy! - You gotta be kidding me! (Andrew laughing) - Wow! - I had to go slow at first because there was a lot of bumps on my side of the road and that is why you won. Damn, that thing is fast! - Is that why? - Actually, I'm kind of surprised, honestly. - No , no, it was not. It's unquestionable that yours was going to be faster. You just have less, there's less bulk. I've got so much more bulk - And you're heavier. - I'm heaver, heavier, heavier, heavier. - [Becca] The Super73 brand is instantly recognizable from Casey Neistat to Jack Black and even Justin Bieber being seen on them. These souped up e-bikes have certainly made a name for themselves as a trendy futurist way to get around. And I can confirm, in riding this thing around New York City for three weeks, it certainly attracts attention. The Super73 RX looks and rides more like a dirt bike than a bicycle and it is a blast. - [Andrew] Whereas the Juiced HyperScrambler 2 felt more like a moped or even a classic 1960s era mini bike, it's not as polished looking as the RX but it has more battery capacity. It's a very large, very heavy e-bike clocking in at a whopping 119 pounds. Thanks to those twin 52 volts 19.2 amp hour batteries strapped to the middle of the frame. This is not a bike meant carrying up and down stairs. - The frame of the $3,500 RX is aircraft-grade 6165 and 7071 aluminum alloy, and it feels incredibly rugged. I did manage to take a pretty gnarly fall on this bike and you can't tell from the bike. You can tell from me however Sad. There are also ample mounds for riding accessories to almost any part of the frame and fenders on both tires. And there are a mess of wires on the front that are semi-hidden behind a plastic plate and then they run through the frame to keep the whole bike looking clean. All of these premium materials do add up to 80 pounds of bike. That is absolutely felt when not using the hub motor to move it. I can't imagine owning this bike and having to move it up any amount of stairs. - [Andrew] The HyperScrambler 2 also suffers from this rat's nest look of wires. On the one hand, all this exposed wiring does make it easier if you need to make repairs in the future but it's not going to win any beauty contests. The frame is also made out of an aluminum alloy that's pretty tough to scratch. Still, I love the overall look of the bike and it was an absolute blast to ride. At $3,000, it's not as cheap as I would've liked but you definitely get a lot of bike for that price. - [Becca] I logged over 200 miles on the Super73 in my three weeks with it. In short I had a really great time cruising around on this thing. The RX's single rear DC hub motor picks up gradually but once they're in that 20 mile per hour range it can really kick up to 32 miles per hour in a hurry. And it peaks at 2000 Watts of power. There are front and rear shocks that allow for preload, compression, and rebound adjustments. And when you pair that with the large custom five-inch wide Super73 tires, the bike can cruise over bumps, cracks and potholes with ease. I do, however, wish the throttle was a bit harder to press. When going over a bump, my hand would jump a bit, which caused my thumb to also jump on and off the throttle. That would then cut some of the power to the motor and make the ride a bit jerkier. It even proved painful when I was on some very dry paths and a quick accidental acceleration sent me one way as the bike skidded out the other. - [Andrew] I also had problems with the HyperScrambler's throttle but of a different sort. After using the throttle once the motor would stay engaged, even when I wasn't pedaling. Squeezing the brake would turn it off but releasing the brake would just cause the bikes motor to turn back on again, randomly, without even twisting the throttle. It wasn't a huge deal but it did make things a little awkward. And these are the type of wiring problems that your local bike shop probably isn't equipped to handle. But speaking of motors the HyperScrambler's is a real banger. This thing whips, no joke, and the front and rear suspension really helped absorb all the bumps in the road. As far as visibility, the halo light in front really gives it a retro bike look as well as really lighting up the road ahead. - [Becca] I took the RX on a few dirt paths here in Prospect Park. And this is where you can really feel the power of that 2000 watt motor and front and rear suspension. There is very little this bike won't go over or up. But again, this is where the RX feels more like an electric dirt bike than it does a bicycle and where handling 80 pounds of bike can get really tough if you don't know what you're doing. I also can't imagine using this bike in pedal assist mode only. The low handlebars and farther back seat position, they really make for an uncomfortable peddling experience. But when using this bike with the throttle only, oh, she whips. - [Andrew] I also felt that the amount of power that the HyperScrambler 2 was packing could be really difficult to manage depending on your skill level. If you're an e-bike novice, this is probably not the bike for you but if you've written a bunch of e-bikes or you have a motorcycle license, this could be the one. - [Becca] The Super73 RX has a 960 watt hour battery that in my use averaged around 38 miles of range in unlimited mode, but there are three other class modes that the RX can operate in, including a full pedal assist mode that Super73 claims can get you up to 75 miles of range. - Juiced claims that you can get up to a hundred miles of range on a single charge, but that's only if you're riding in the lowest possible setting. In my experience, very few people will ride the bike this way. But with the dual battery configuration, the HyperScrambler 2 has 1,989 watt hours, which is really just an incredible amount of battery capacity. Juiced has a balancer module that automatically draws power evenly from the two batteries. And you have the option of simply turning one battery off if you only want to drain one at a time. The dual battery configuration really did wonders for my range anxiety. I test a lot of e-bikes and I've been stuck miles from home with a dead battery more times than I can count, it's not fun. If you're gunning it all the time at 30 miles per hour and real talk, you will be, it's so freaking fun, you're going to get about 20 to 25 miles per battery, so about 50 miles total, and riding in a more laid back style will get you even further. - [Becca] Back on the road I found myself scooping up friends and riding to people on the bike that is rated for 325 pounds often. Although very comfortable for one, with two riders the default seat is not the most comfortable and if I were to own this bike I would look into longer saddles. I did, however, pick up $15 pegs from Amazon so that my passengers had a place to put their toes. The range was absolutely affected with more weight, but still incredible. I did an 18.2 mile ride with a second rider totaling 250 pounds of weight on the bike and still had around 10 miles of range left in unlimited mode, but on one ride with that same 250 pounds of weight on the bike, I let the range get down to only 5 miles left in the tank and the bike would not go up a 30 degree incline without me peddling very hard. All of that is to say that when I had a second passenger on the bike I wouldn't feel comfortable letting the bike get down to only 10 miles of range if I wasn't close to a charger. - Unfortunately, I was unable to find any willing passengers for the Juiced bike. My partner is, shall we say, less than trusting of my riding style? Georgia was like, no, no, no, no way. Like the RX, the HyperScrambler is not exactly designed for two riders. The total weight limit is only 275 pounds. And while the saddle is long, it's not that comfortable. - The Super73 RX comes with a five volt 2.8 pound charger that is capable of charging the 960 watt hour battery in three to four hours. Although that is a very quick charging time for a battery of this size, the charger is bulky and too heavy to carry around for charging on the go. There is a small screen on the left side of the handlebars that shows speed, range, pedal assist strength and total distance traveled on the bike. There's also an app that can send turn by turn directions to the small screen. The app is relatively basic and I found myself never really using it but you can change the bikes class within the app to suit your city and state guidelines. There's also a 600 lumens front light and a rear light that is brake activated even when the lights are switched off. - [Andrew] The LCD Matrix display on the HyperScrambler is where you control the seven, yeah, that's right, seven assists levels. Zero, eco, 1, 2, 3, sport. with a top speed of 28 miles per hour, and race for 30 miles per hour or above. Unlike the Super73, Juiced e-bike has a whole bunch of extra features that really enhance the riding experience, like an eight gear shifter, side view mirrors, turn signals, a USB charger, an extremely loud horn, and a pretty decent alarm system. The key for the battery lock also serves as its own antitheft device since you need it to actually ride the bike. - [Becca] The Super73 Rx is as great to look at as it is to ride and for $3,500, it better be. But it's lack of anti-theft features built in had me totally spooked when locking this thing up in New York City. This bike is a total showstopper and therefore it's quite desirable. When parking it on the street, I would remove the 11.2 pound battery with the included key. Then lock it up, using both a chain lock and a u-lock. Even then I would still be nervous about someone running away with it. I found myself wishing Super73 offered better theft production options out of the box, like VanMoof. Also, blinkers would be greatly appreciated. - Yeah, I'm not going to lie. This bike was wildly fun to ride. It's not the most utilitarian e-bike with space for cargo, kids, or anything like that and like the Super73, it's more of a lifestyle bike, which is totally a thing now, I get it. Service and repair is also a big concern. When things break down and they inevitably will, It's going to be more of a hassle to get these bikes repaired than your average 10 speed. Juiced does have a pretty extensive warranty but it only applies to new bike purchases - [Becca] Super73 claims that the battery can be recharged a thousand times over, but their one-year hardware warranty is confusing and currently most replacement parts are unavailable via their site. It's a big investment with little certainty it will be easy to repair, but if that's a risk that you're willing to take and you trust in the parts that Super73 is using in the first place you're going to have an absolute blast on this bike. It is just as fun for riding trails as it is for running around and doing errands on. And I'm really sad that I have to send this back. - No, no, I completely agree. And I'm just amazed that Juiced able to sell this bike for under $3,000 especially with buy prices soaring across the board. It's not going to break the bank but it may break your head. So be sure you always wear a helmet. - Thank y'all so much for tuning in. If you guys want to see more e-bike coverage on our YouTube page, let us know down below. What are you guys riding? - Please let us know and be sure to like and subscribe. We had fun doing this. Thank you. It was a blast. I swear, they didn't make me do this.",
    "transcript_keywords": [
        "bike",
        "miles",
        "battery",
        "Juiced",
        "range",
        "HyperScrambler",
        "riding",
        "hour",
        "bikes",
        "ride",
        "pounds",
        "motor",
        "Juiced bike",
        "watt hour battery",
        "Juiced HyperScrambler",
        "thing",
        "front",
        "throttle",
        "make",
        "dirt bike"
    ],
    "transcript_entity_values": [
        "about 20 to 25 miles",
        "a hundred miles",
        "18.2 mile",
        "one",
        "five-inch",
        "250 pounds",
        "Casey Neistat",
        "Prospect Park",
        "6165",
        "three",
        "325 pounds",
        "Watts",
        "eco",
        "2",
        "USB",
        "only 275 pounds",
        "Juiced and Super73",
        "2000",
        "15",
        "around 10 miles",
        "around 38 miles",
        "Juiced",
        "only 10 miles",
        "three weeks",
        "7071 aluminum",
        "Justin Bieber",
        "eight",
        "California",
        "2000 watt",
        "Juiced",
        "the HyperScrambler 2",
        "3",
        "one-year",
        "80 pounds",
        "three to four hours",
        "1",
        "Becca",
        "3,500",
        "up to 80 pounds",
        "3,000",
        "VanMoof",
        "11.2 pound",
        "Georgia",
        "30 degree",
        "two",
        "HyperScrambler",
        "1,989 watt hours",
        "five volt 2.8 pound",
        "thousand",
        "32 miles per hour",
        "Amazon",
        "New York City",
        "52 volts 19.2",
        "Jack Black",
        "only 5 miles",
        "DC",
        "up to 75 miles",
        "second",
        "28 miles per hour",
        "960 watt hour",
        "RX",
        "30 miles per hour",
        "YouTube",
        "first",
        "1960s",
        "20 mile per hour",
        "119 pounds",
        "Zero",
        "200 miles",
        "about 50 miles",
        "600 lumens",
        "seven",
        "Andrew",
        "10"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "LOC",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "NORP",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "ORG",
        "QUANTITY",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "GPE",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "GPE",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL"
    ]
}