{
    "id": "Y2IqNPi8_Ao",
    "title": "You lose, AMD!",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-11-06T01:59:13Z",
    "video_url": "https://www.youtube.com/watch?v=Y2IqNPi8_Ao",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Intel",
        "Alder Lake",
        "Intel 12th gen",
        "processors",
        "hybrid",
        "cores",
        "performance",
        "benchmarks",
        "DRM",
        "games",
        "gaming",
        "Intel 12th gen Alder Lake",
        "review",
        "12900K",
        "12600K",
        "Ryzen 5950x"
    ],
    "views": 503872,
    "likes": 27796,
    "comments_count": 1135,
    "description": "Get 20% OFF + Free Shipping @Manscaped at     LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 There was a different intro but we scrapped it 0:05 Intel 12th gen Alder Lake reviews 1:30 EVGA GPU truck heist 2:40 Epic Games developments 3:41 MANSCAPED 4:18 QUICK BITS 4:24 EA's into NFTs 5:01 Windows 11, macOS bugs fixed 5:33 BMW kills touchscreens 6:02 More Playstation PC games 6:27 Google's giving AI drugs  AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  They're Just Movies podcast:",
    "description_links": [
        "https://manscaped.com/TECH",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/mK8xs",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/TheyreJustMovies"
    ],
    "transcript": "- [Riley] Welcome, it's time for tech news. (chuckles) Reviews for Intel's 12th Gen Alder Lake desktop processors went live yesterday, and some went live even before that. (chuckles) - [Jonathan] No! - [Riley] It was an accident, all right? - [Jonathan] Who did that? - [Riley] Linus doesn't let me touch the processors anymore, I wasn't involved. As many of the leaks predicted the world's first desktop class hybrid CPU's are impressive with the top tier Core i9 12900K, beating AMD's Ryzen 9 5950X in both single-threaded, and multi-threaded performance. - Checkout LTTS, and some other reviews for the full story, but if you do want in on the party, you should probably check the list of games that Intel has said are not compatible with the new processors. Thanks to Alder Lakes hybrid design acting all wonky with some DRM systems. - [Jonathan] No. - [Riley] Intel's working with developers on patches, and there's also a workaround that involves disabling a processors E cores, and that stands for efficiency, Jonathan. - [Jonathan] Really? - [Riley] As I'm sure you know. - [Jonathan] Macs don't have that. - [Riley] (chuckles) Macs aren't efficient at all, you should just switch. I can't help it note though, that the AMD processors everyone is celebrating Intel's victory over, are a year old. - [Jonathan] What? - [Riley] Yeah. You didn't know that? - [Jonathan] No. - [Riley] Yeah, and it's Ryzen 6000 CPU's are expected in January. But it's nice to see Intel back on the multi-threading throne, even if it might only be for a few months. It's like the iron throne but instead of swords it's like, it's made chips, processors, Ryzen chips. - [Jonathan] Transistors. - [Riley] Game of transis-doors. The GBU shortage has made scalping a big problem, but now we have to deal with literal thieves. And not just any thieves, ones that like cars, and family, and hate the Rock. (Jonathan mumbles) You're a big fan. - [Jonathan] Love the series. - [Riley] That's right EVGA has reported that a truckload of G-Force RTX 30 series graphics cards were stolen on route from San Francisco to EVGA's distribution center. - [Jonathan] Honda Civics? - [Riley] (chuckles) I don't know. - [Jonathan] Honda Civics! - [Riley] Subarus? I hope the drivers are okay. Did anyone get it on film? Was Sung Kang there? This is bad news for the industry, but also for potential GPU buyers. EVG has canceled the warranty on the stolen cards, meaning you could inadvertently buy one on Craigslist from what you think is just a garden variety scammer, but is actually a highly wanted criminal from a crew of experts with extremely deep social bonds. - [Jonathan] Family. - [Riley] And then miss out on your cards, warranty. Oh, sorry I was remembering that part from the movie that they, they take the... - [Jonathan] No they fraudulently rewrote the warranty card. - [Riley] Right, I haven't seen a single one. (chuckles) - [Jonathan] Subscribe to the movie contest. (Riley laughs) - [Riley] And Google has complied with South Korea's recently passed law requiring mobile app stores to give developers third-party payment options, with a catch. Users in the country will be able to choose between the play stores billing system and an alternative, which will still own Google a cut, but it will be 4% less than the standard rate. - [Jonathan] Wow. - [Riley] It's another small step towards the idea of an unrestricted platform that Epic Games is seeking with its lawsuits against Google and Apple. But Epic got another win this week with the news that Riot Games is bringing League Of Legends Valorant, and its other titles to the Epic Game Store on PC. Also, lead character Jinx, which seems to me to be basically like, blue hair Harley Quinn? Have you played the? Is now a skin in Fortnite. Now, is this really a win for Epic when they probably only got this deal by paying Riot millions of dollars? I don't know. I have no idea how money works. It's an, are you a finance bro? Is it in the computer? - [Jonathan] They're just number. - [Riley] They're just... - [Jonathan] Its just a number... - [Riley] They're just numbers, man! Now it's time for Quick Bits brought to you by Manscaped, makers of all-in-one men's grooming tools that'll spruce up your body like the people who changed the wheels and fixed the things on a race car. You know like when they pull into the side on a race and they were, (imitating drill noises with mouth) you know? The Manscape Performance Package 4.0 kit is designed to make grooming below the waist easy with their Lawnmower 4.0. Plus, some other goodies including the Crop Preserver and Crop Reviver, (imitates engine revving with mouth) Reviver sprays to keep things fresh down there. (sniffs) So head to manscape.com/tech and get 20% off Manscaped and free shipping today. (chuckles) You want these quick bits, don't you? - [Jonathan] Yes yes yes yes yes yes yes yes. - [Riley] Ugh, that's a different vibe. The CEO of electronic arts, Andrew Wilson, said in an earnings call this week that game's built with NFT and blockchain technology are \"the future\" of our industry. - [Jonathan] Wow! - [Riley] Shocker. I'm assuming he doesn't mean the game where crypto scammers impersonate websites and get people to unknowingly giveaway their funds. - [Jonathan] I thought they were kidding! - [Riley] It is fun for the... bad guys. Interestingly, EA's comments come weeks after Valve blocked all cryptocurrency and NFT games on Steam. But EA doesn't care. - [Jonathan] EA never cared. - [Riley] Are you ready for this? EA Sports, it's in the chain! I'm sorry. Microsoft has fixed the bug that caused some Windows 11 features like the snipping tool, to break due to an expired certificate. Which is I guess what happens with giant tech companies forget to schedule their renewal appointment. But in case you Mac people think you're above all this, - [Jonathan] Yeah? - [Riley] Apple also had to fix a bug in Mac OS Monterey that was bricking computers. So, \"Macs don't get viruses\". - [Jonathan] Listen, sorry I haven't had a computer brick, so, it doesn't happen. - [Riley] None of my, none of your computers have broken? Ever? - [Jonathan] No. - [Riley] Wow, I will switch to Mac. BMW is removing touchscreen functionality from a number of vehicles. - [Jonathan] Good riddance! - [Riley] What? - [Jonathan] I hate touchscreens in cars. - [Riley] Oh. - [Jonathan] Yay. - [Riley] Okay, I didn't know people would be happy about this. They're doing it in an effort to save silicone and maintain current production levels, which have been affected by the ongoing chip shortage. Now, what I was going to say is to be fair to touchscreens are kind of dangerous to use while driving anyways. So, so wait, we're happy about this? - [Jonathan] Yeah I drive all the way. - [Riley] There's a silver lining to the chip shortage. - [Jonathan] Yep, safe for drivers. Safe for cars. - [Riley] Oh, here's something cool. A G-Force now database leak has once again revealed a list of former PlayStation exclusive games that will, if the leak is accurate, be coming to PC. Including Ghost of Tsushima, Ratchet & Clank, and Returnal. Man, PC gamers have bashed consoles for so long, and now they're giving us all their most cherished possessions. I almost feel bad... for them... because their consoles. And Google is getting another sibling. Their parent company Alphabet has announced Isomorphic Labs, a research outfit that will discover new types of drugs using AI. These robots are just getting absolutely blasted, man. The lab is literally just like a college dorm room, and they're like peer pressuring each other. And there's one AI in the corner who's like, \"No, man. My parents said drugs aren't cool\". - [Jonathan] Why are you still high? - [Riley] I'm testing, man! It's science! It's time to stop. Come back on Monday for more tech news and I'll show you the rest of the song from the beginning. It is a banger. For legal purposes I have to tell you that is not going to happen. I need to sleep. - [Jonathan] Goodnight.",
    "transcript_keywords": [
        "Gen Alder Lake",
        "Alder Lake desktop",
        "Intel",
        "Lake desktop processors",
        "Alder Lakes hybrid",
        "processors",
        "Gen Alder",
        "games",
        "Epic Game Store",
        "Game",
        "Alder Lake",
        "Google",
        "Epic",
        "man",
        "Yeah",
        "Epic Games",
        "Epic Game",
        "Ryzen",
        "Macs",
        "Mac"
    ],
    "transcript_entity_values": [
        "EVG",
        "Isomorphic Labs",
        "South Korea's",
        "Sung Kang",
        "a few months",
        "Riley",
        "20%",
        "Tsushima",
        "Google",
        "EA",
        "DRM",
        "some Windows 11",
        "Quick Bits",
        "January",
        "third",
        "AMD",
        "Alder Lakes",
        "Epic",
        "30",
        "Epic Games",
        "Fortnite",
        "Jonathan] Family",
        "Jonathan] Honda Civics",
        "Ratchet & Clank",
        "Riley] Intel's",
        "Lawnmower 4.0.",
        "Epic",
        "PlayStation",
        "today",
        "G-Force",
        "9 5950X",
        "Mac",
        "Riley] Linus",
        "a year old",
        "Riot millions of dollars",
        "GBU",
        "The Manscape Performance Package 4.0",
        "Jonathan] Goodnight",
        "Alphabet",
        "Ryzen",
        "Craigslist",
        "first",
        "AMD",
        "Harley Quinn",
        "Manscaped",
        "Monday",
        "GPU",
        "this week",
        "CPU",
        "Monterey",
        "weeks",
        "Core",
        "Riot Games",
        "4%",
        "Riley] Apple",
        "Valve",
        "one",
        "Mac",
        "BMW",
        "Jonathan mumbles",
        "EVGA",
        "Jonathan]",
        "Microsoft",
        "the Epic Game Store",
        "Macs",
        "San Francisco",
        "Returnal",
        "Manscaped",
        "Jonathan] Macs",
        "Jonathan] Transistors",
        "Apple",
        "EA Sports",
        "yesterday",
        "Intel",
        "Jinx",
        "NFT",
        "Jonathan] Love",
        "AI",
        "Andrew Wilson",
        "League Of Legends Valorant",
        "12th",
        "Mac",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "DATE",
        "PERSON",
        "PERCENT",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "PERSON",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "NORP",
        "GPE",
        "ORDINAL",
        "PRODUCT",
        "PERSON",
        "GPE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON"
    ]
}