{
    "id": "Y2XtFry_l-g",
    "title": "How to Boost Your Wi-Fi Network With an Old Router",
    "channel": "TechWiser",
    "channel_id": "UCdp6GUwjKscp5ST4M4WgIpw",
    "subscriber_count": 2200000,
    "upload_date": "2015-07-25T21:02:10Z",
    "video_url": "https://www.youtube.com/watch?v=Y2XtFry_l-g",
    "category": "Science & Technology",
    "tags": [
        "tips",
        "tricks",
        "how to boost your wifi signal with an old router",
        "How to Increase the Range of your Wireless (Wi-Fi) Network",
        "How to Extend Your Wi-Fi Network With an Old Router",
        "How To Extend Wifi",
        "how to extend wifi range"
    ],
    "views": 163979,
    "likes": 1466,
    "comments_count": 218,
    "description": "Let say you are not getting enough signals at the other end of the building. So to extend WiFi coverage, we have couple of options here.   First, you can install a custom firmware (like DD-WRT) on your router  and increase your WiFi range to few meters.   However this is a bit more technical and if not done right  than it can even destroy your router and void your warranty.    Second best option we have is to use a power line adapter  Now, power line is a revolutionize product that uses your  home electrical wiring to carry the WiFi signal. But as of now they are quite expensive and thus not feasible for home users   Next, Popular option is to use WiFi repeater.  Simply place this WiFi repeater in the range of your existing router  and it will further boost the signal.    And last option, and also the one we are going to see in detail.   is to boost wireless network by connect two routers with an ethernet cable. Technically its called creating an access point.   Advantages of this setup is that its cheap,  works well, and since we are using ethernet cable to share WiFi,  it will work in the place where, there is no WiFi signal.    So lets see how to make it work",
    "description_links": [
        "http://receivetipstricks.com/use-an-old-router-as-a-range-repeater/"
    ],
    "transcript": "No manual transcript available",
    "transcript_keywords": [
        "manual transcript",
        "manual",
        "transcript"
    ],
    "transcript_entity_values": [],
    "transcript_entity_types": []
}