{
    "id": "y5LTnJI2Nm0",
    "title": "Invisible Phone Cameras Are Here",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2019-06-03T19:17:40Z",
    "video_url": "https://www.youtube.com/watch?v=y5LTnJI2Nm0",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "oppo",
        "xiaomi",
        "mi9",
        "full screen",
        "no notch",
        "notchless",
        "bezel free",
        "bezel less",
        "galaxy",
        "samsung",
        "iphone",
        "apple",
        "android",
        "coolest smartphone",
        "best smartphone",
        "best phone",
        "best android phone"
    ],
    "views": 2069620,
    "likes": 60431,
    "comments_count": 4470,
    "description": "New under display camera demos from Xiaomi and Oppo are similar to the Samsung New Infinity display technology. Pop up Hidden Phone Camera -   It's crazy how far along this technology has come in such a short period of time. We'll hopefully see these cameras in Samsung's Galaxy phones and Apple iPhones soon!  Background Music Fili - H2O  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2W7VZuB",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Over the weekend We just got a look at the first under display camera that we've seen in a functional or seemingly functional prototype and this was a video brought up by Oppo on their social media account but they have a front-facing camera that is hidden under the display. and then a few hours later Xiaomi another chinese company puts out a video with the same kind of technology and this video quality's a little bit better They're showcasing a device that looks very much like a mi 9 but it also has a fully functioning front-facing selfie camera And it's crazy. like this is technology that we've been seeking or the phone manufacturing world has been seeking for the past little while we started off with the phone with a notch the essential phone and then the iPhone had a notch and then every Android phone start to have notches And then we started to get phones this year with things that aren't notches but aren't really like, you know This isn't the final form that we're looking for. We have pop-up cameras. We have flip up cameras. We have devices that are trying to circumvent the whole notch and punch hole technology. But the reality is that they're all trying to achieve a completely natural bezzel-less flip up camera list device and that's what these prototypes are showing now from what I understand the way that they're achieving this is that they're turning off the pixels right in front of the camera sensors so on a regular OLED display It's just a bunch of diodes that are being lit and when they turn off Particular diodes and you can turn off individually ones on an OLED panel when you turn off a set of diodes Whatever's behind it now has a less obstructed line-of-sight So if you look at this still from the xiaomi video you can still see that the camera with this under display sensor Still has a camera visible on that prototype. It's subtle, but it's there It's not as evident as the regular mean and that's beside it But it's definitely there So they've turned off the diodes in that region which allows the camera to be able to shoot through it But the problem is that that area that's been turned off is not optically transparent It's translucent we can obviously see through it to some degree But it's not a super clean image and that's the problem that all these manufacturers are facing right now. anyone who's chasing this under display sensor, under display camera has to figure out how to clean up that image because when you shoot through those diodes Even if they're off it's not clean and they're going to need software or some kind of algorithm to clean up that image as best as they can and maybe they can use maybe two cameras so that you have basically two data points to work with and then they be able to combine that. I'm not exactly sure what the techniques are that they could use for this but that is the problem they're facing right now. How do we clean up that image? So that it is acceptable in today's Selfie camera market And keep in mind that these guys aren't first, right. Samsung's been working on this technology for quite a while now Even in 2018 there were showing slides of how they were working on some under display sensors and in earlier this year They showed like their whole infinity display lineup with the new infinity being the one that's the end goal But it's super interesting to me that these two Chinese companies out of nowhere showcase this technology in a fully functioning prototype. So for me, like I'm not someone that uses selfie cameras very often So I'd be very willing to eat image quality on my front-facing camera for that technology today Obviously, they're probably not going to do that Like they want to get a front-facing image that's comparable to a regular front-facing selfie camera, right? Obviously that's what most people are going for. But I think for a lot of people myself included would just eat crap front-facing image quality for that technology today I mean, I'm willing to put up with the terrible camera on a 12-inch MacBook That's like a 480p camera that looks like garbage but whoever brings that technology to the market first like whoever does it, is gonna have a banger because it resolved things like having moving parts and having reduced water resistance ratings and stuff like that having a under display camera sensor is like.... It's the dream. Okay, that basically wraps it up. I think this technology is cool I'm really glad that we were able to see something this early on. I did not expect it. It's crazy that This went from a neat idea to a seemingly functional prototype in a very short period of time. And that's really cool Obviously, there's a lot more work to be done. But I like what I see. Okay. Hope you guys enjoyed this video Thumbs if you liked it Subs if you loved it. See you guys next time",
    "transcript_keywords": [
        "camera",
        "social media account",
        "display camera",
        "frontfacing selfie camera",
        "Android phone start",
        "selfie camera",
        "technology",
        "display",
        "display camera sensor",
        "Android phone",
        "image",
        "frontfacing camera",
        "cameras",
        "phone",
        "social media",
        "media account",
        "Oppo",
        "frontfacing",
        "video",
        "regular OLED display"
    ],
    "transcript_entity_values": [
        "Selfie",
        "Xiaomi",
        "this year",
        "Samsung",
        "12-inch",
        "iPhone",
        "today",
        "2018",
        "Android",
        "the weekend",
        "9",
        "a few hours later",
        "two",
        "first",
        "OLED",
        "chinese",
        "Oppo",
        "Chinese",
        "MacBook",
        "earlier this year",
        "Thumbs"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "NORP",
        "ORG",
        "NORP",
        "ORG",
        "DATE",
        "PERSON"
    ]
}