{
    "id": "Y7UXjz0_a9k",
    "title": "MagSafe Duo Charger!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-11-10T16:39:37Z",
    "video_url": "https://www.youtube.com/watch?v=Y7UXjz0_a9k",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 524478,
    "likes": 21670,
    "comments_count": 1387,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(typing) - You guys, so today, I'm gonna unbox something for you, that's very exciting, that I've been waiting for since they announced it. Lemme just finish this message really quickly here. Okay. The MagSafe Duo Charger. It's here! (upbeat music) So, I feel like this is kind of the cop-out for not having AirPower, but you know what? I think this is cool, it's foldable, I'm real into affordable stuff. I love wireless charging. So, guess what? I already know I'm gonna like this. So, here is the charger. We have two sides. So, this is to charge your phone, and this is to charge your Apple Watch. This just flips up just like that. You can see right through it. This also folds up, to make it easy to take for traveling. And I love that this has the little Apple logo on it. The other thing that you're gonna notice is there's no charging brick. I do feel like they probably shoulda put one with this, because this is sort of like the whole charging kit. Like, you would need a brick to charge all of the things. So, they do give you the USB-C cable. So, you do get the USB-C charging brick. Then you can use this. This has a little USB-C port right here. Wait a minute. No, hold on a second. It's Lightning. I was thinking this is gonna be USB-C to USB-C, but no, it is Lightning to USB-C. That could have been one of the ways where we sort of made the iPhone USB-C, by making this USB-C. But I feel like most people would probably already have this cable, because they gave you a cable. I'm not really sure the logic behind it, but either way, this is exciting, and I really love the design of this. It has everything that you need to charge your Apple Watch, and to charge your phone. What else do we have in here? Is there any little, did we get a little sticker in here, maybe? Okay, no sticker, but we do have some paperwork. (dog barking) I have a dog. That's my dog. That's my dog, that's my dog. Are you guys ready for the first charge? I am. I like that this is able to flip up, because if you do have this type of watch band, you would probably have to go like this to charge it. Not quite ideal. This way. Are you charging? You're charging, you're charging, look! Here we go. Watch is charging. And it just magnetically zipped itself right into place. Charging! I mean, this isn't really that long of a video, but I was very excited about this MagSafe Duo Charger, that I really wanted to show it to you guys, and I just got it. So, I really wanted to give you guys a first look at the Duo Charger. This is such a great idea. And that's it. There it is. MagSafe Duo. Super cool. Lemme show you the magneticness of this thing. Look at that. Look at this. (upbeat music) It's pretty sturdy. I wonder if I can charge it here on the other side? Probably not, but let's try it. (upbeat music) One side charge only. Had to test it. Well, thank you guys so much for watching this really quick video. Probably the quickest video I've ever posted since I dunno, like 2007, but I have more iPhone videos planned for you guys, so stay tuned. If you guys aren't subscribed to my channel, be sure to do so, and hit the bell so you notified when I post a new video. If you haven't seen my iPhone 12 Pro Max, and 12 Mini unboxing video, be sure to go check that out as well. And I'll see you guys in the next video. (upbeat music)",
    "transcript_keywords": [
        "USBC",
        "Duo Charger",
        "charging",
        "charge",
        "guys",
        "MagSafe Duo Charger",
        "Charger",
        "Duo",
        "video",
        "Apple Watch",
        "MagSafe Duo",
        "Watch",
        "Apple",
        "dog",
        "USBC charging brick",
        "USBC charging",
        "feel",
        "love",
        "cable",
        "brick"
    ],
    "transcript_entity_values": [
        "USB-C.",
        "a minute",
        "iPhone USB-C",
        "second",
        "12",
        "USB-C",
        "AirPower",
        "Apple",
        "2007",
        "iPhone",
        "Pro Max",
        "MagSafe Duo",
        "today",
        "two",
        "Mini",
        "first",
        "Apple Watch",
        "USB",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}