{
    "id": "Y82mpokV_rA",
    "title": "The Secret Bolt",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2015-04-01T06:13:00Z",
    "video_url": "https://www.youtube.com/watch?v=Y82mpokV_rA",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "tech",
        "technology",
        "april fools",
        "april",
        "fools",
        "spy bolt",
        "secret bolt",
        "secret"
    ],
    "views": 4661327,
    "likes": 66380,
    "comments_count": 5751,
    "description": "Buy The Bolt -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/1TVuBNV",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys Lew here back with another video and today. I've got something unusual to show you but very cool This is a bolt, and I'm sure you've seen one of these before this one is obviously a little larger than usual There's actually a reason for that. It's a secret bolt not your average everyday Thing you'd find in a toolbox the top screws off as you can tell here and it exposes An internal cavity where you could store? Various things that's completely up to you this will fit Documents as well as a micro Sd cards like this one Maybe you want to protect some files that are on there could be photos or even video You could store a little piece of paper that has your passwords on this could simply roll up and fit inside So if you're one of those people, it's constantly forgetting your passwords you could even put a bitcoin wallet Inside of the bolt and these can be worth thousands of dollars if you're concerned at all About getting hacked or keeping your bitcoin [wallet] on your system on your computer You can have a paper wallet like this one and hide it inside something like this lastly you can put some cash in there Here's a very cool Twenty Dollar Canadian Bill But it'll work just as well with Us dollars or British pounds even the euro in fact so if you want to stash some cash, it will very easily Fit inside of this Spy [bolt] just like that now a cool feature [you] might not have noticed on the spy bolt is the way That the Lid screws on or the top portion it actually goes in the opposite Direction You're used to so it screws on to the left and off to the right So if somebody was to pick this up think it looked a little bit [unusual] for any reason and they would probably instinctually try to loosen it up by Twisting to the left so in this case it's Threaded in the opposite Direction [also] the intention here is to store this in a toolbox or at the bottom of a drawer possibly amongst other bolts nails so on and so forth so that it really blends in When you receive it in its original package, it's actually covered in grease as well So when you pick it up, you get stuff all over your hands and you immediately want to put it down So there are a few Baked-in Security measures built into the secret bolt, but the fun doesn't stop there There's an unlimited number of things that you could store inside this bowl. Let me show you a few batteries TOOTHPICKS! 1' WIRE NAILS! Drywall Anchors(?) Younger sibling after your kitkat? Hide it in the bolt! Stays fresh longer [you] could probably fit at [least] six peanut M&Ms one two three four five [oh] Disappointed at the Lack of space for peanut M&Ms Try the originals one two three four five 28 42 43 44 fifty nine seventy 84 87 115 uh-oh Natural Brown rice great for your colon The Secret bolt works just as well for your pets. Let's see if these jerky nubs fit. Don't forget about Sparky salted cashews almonds pecans even Brazil nuts even mixed nuts What about lemon juice? fake lemon juice Banana Alright okay enough enough, but in all seriousness guys this little bolt is actually a pretty cool way to keep things confidential [just] like I mentioned earlier in this video if you have a bitcoin paper wallet some Microsd cards with confidential information They can fit inside here, and you can keep it completely secret inside the Secret Bolt I'll drop a link to this thing down in the description. Thanks as always for watching Happy [April] [fool's], and I'll catch you on the next [episode] later can't forget Sparky",
    "transcript_keywords": [
        "Lew here back",
        "secret bolt",
        "guys Lew",
        "bolt",
        "Twenty Dollar Canadian",
        "Dollar Canadian Bill",
        "cool Twenty Dollar",
        "inside",
        "opposite Direction",
        "Secret bolt works",
        "fit inside",
        "Lew",
        "fit",
        "store",
        "Bakedin Security measures",
        "cool",
        "secret",
        "things",
        "bitcoin wallet Inside",
        "store inside"
    ],
    "transcript_entity_values": [
        "Lew",
        "Stays",
        "British",
        "Us",
        "Fit",
        "today",
        "Bill",
        "Twenty Dollar Canadian",
        "Lid",
        "1",
        "two",
        "four",
        "Brazil",
        "six",
        "April",
        "Microsd",
        "the Secret Bolt",
        "three",
        "thousands of dollars",
        "fifty nine seventy 84",
        "Sparky",
        "one",
        "kitkat"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "NORP",
        "GPE",
        "PRODUCT",
        "DATE",
        "PERSON",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON"
    ]
}