{
    "id": "Y8G-SleiyUU",
    "title": "Ethernet: True or False (NVT Phybridge LRE)",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2021-05-30T02:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=Y8G-SleiyUU",
    "category": "Science & Technology",
    "tags": [
        "ethernet",
        "long reach ethernet",
        "long reach ethernet extender",
        "nvt phybridge",
        "nvt phybridge flex 4",
        "nvt phybridge flex",
        "nvt phybridge nv-ec1701u",
        "arvind david",
        "david bombal",
        "ccna",
        "cisco",
        "networking",
        "power over ethernet",
        "poe",
        "cisco 1000",
        "poe switch",
        "long reach poe",
        "cisco ccna",
        "ccna 200-301",
        "ethernet over coax",
        "new ccna",
        "internet of things",
        "iot",
        "ccna exam",
        "ethernet switch",
        "ethernet cable",
        "max length of ethernet cable",
        "maximum ethernet cable length",
        "chariot switches",
        "flex switch"
    ],
    "views": 59252,
    "likes": 1850,
    "comments_count": 266,
    "description": "What's the maximum distance of Ethernet? 100 meters? Can you use an Ethernet cable that only has 1 pair left? Lots of questions to answer! Big thank you to NVT Phybridge for sponsoring this video. #ad  Menu: 0:00  100Mbps using dodgy cable? 0:16  True or false: max distance of Ethernet is 100m 0:35  Can you use single pair cables? 0:49  You cannot use coax cables? True or false? 1:15  You need to upgrade your cabling. True or false?  1:26  NVT Phybridge solutions 2:05  Cisco partnership 2:44  Testing 2000 feet cable 4:43  Test 4xPOE devices over 2000 feet of Ethernet cable 6:25  What types of speeds to you get at 2000 feet 7:00  What amount of bandwidth do you actually need 7:32  iPerf test at 2000 feet 9:30  What kinds of speeds at 100m?  10:44  2 pair cable - does that work? 11:40  1 pair cable - speed test 13:59  Switch power sharing  NVT Phybridge Website:  Free NVT Phybridge training:  100 Billion Reasons Cisco Partnered with a PoE Switch Provider:   Cisco Part Numbers (Flex24-10G not listed yet): SP-PHYBRIDGE-24: 24-port PoLRE switch with 24 Phylink adapters SP-PHYBRIDGE-48: 48-port PoLRE switch with 48 Phylink adapters   Buy the CCNA course and support me: DavidBombal.com: CCNA ($10):  Udemy CCNA Course:  GNS3 CCNA Course: CCNA ($10):   ethernet ethernet length single pair ethernet networking max length of ethernet maximum length of ethernet ccna network nvt phybridge coax cable long reach ethernet LRE Long Reach Ethernet (LRE) networking myths flex 24 flex24-10g cisco cisco 1000 switch cisco 1000 cisco switch cisco router ccna free ccna 200-301 ccna 200-301 free ccna course network networking new ccna david bombal poer nvt phybridge flex 4 nvt phybridge flex  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #ethernet #nvtphybridge",
    "description_links": [
        "http://davidbombal.wiki/nvtphybridge",
        "http://davidbombal.wiki/freetraining",
        "http://davidbombal.wiki/100billion",
        "http://davidbombal.wiki/ciscopartner",
        "http://bit.ly/yt999ccna",
        "https://bit.ly/ccnafor10dollars",
        "https://bit.ly/gns3ccna10"
    ],
    "transcript": "- 95 megabits per second, through a dodgy cable like this with only one pair connected. That's crazy, really. How on earth do we get that amount of traffic going through a messed up cable like this with only one pair intact? True or false, maximum distance of copper UTP cabling is 100 meters? You cannot connect IP devices, such as IP phones or IP cameras or door access systems, to a network if they're more than 100 meters from a switch. Is that true or is that false? Is it possible to use an ethernet cable such as this? This is an ethernet cable that I've cut. Only one pair remains. Is it possible to use a cable like this in an ethernet network? You cannot use old cabling types, such as coax cable, which you may find in a historic building or in a ship, or in other places. Do you need to lay new cabling or can you reuse old cabling in buildings such as this? You cannot use IP devices when your network consists of old cabling, such as Cat 3 cabling, single-pair cabling, coaxial cabling, et cetera. You need to upgrade your network to Cat 5e cabling or Cat 6 cabling or a modern version of UTP cabling for IP devices to work. Is that true or false? Now to help answer these questions, NVT Phybridge are sponsoring this video. Arvind from NVT Phybridge reached out to me and asked me to create a video to show their solution. In the beginning, I was very skeptical. But the more I read about this, the more intrigued I became. Not only does NVT Phybridge have a bunch of solutions that solve various problems that you may encounter in the real world. For example, you do not need to upgrade old cabling. You can reuse old cabling and deploy modern solutions, such as IP phones, even though you've got really old cabling in a building or in a ship or submarine or other interesting places. I was also pleased to see that they are a Cisco partner, that they have worked with Cisco on multiple deployments for the U.S. government. Their solution is also being deployed in embassies around the world for the UK government. Now this is one of those times when I thought, why didn't I know about this previously? And that's why I wanna share it with you and help remove these Ethernet myths that a lot of us believe. (upbeat music) Okay, so let's put this to the test. In this example, I've got two NVT Phybridge switches. I've also got a little Cisco switch. These switches support a long range ethernet using various technologies. Let's start with really long ethernet. Is the distance that you can run an ethernet cable 100 meters? Well, let's change your viewpoint. I've got two boxes of 1,000 feet or 305 meters of cable here. Big shout out to Panduit for supplying this cable and making my job really easy. What I've done is connect these two 1,000 spools of cable together. So I now have 2,000 feet of cable. Okay, so here are the two ends of the cable. I'll plug one of them into the NVT Phybridge switch. 2,000 feet of cable. Let's see if it actually works. So I'll take one of these connectors that they've got. This is called a FLEX-link, a long range PoE over UTP. This is cat to 6e cabling but you don't have to use that type of cabling. The important piece here is that we have four pairs of cable. And what you may notice is that the link light comes on. So link light is on on the switch. Link light is on over here. And what I can do now is take 100 meter ethernet, if I want, connect this to a Cisco IP phone on the switch port, and what we should notice is that the phone comes on. There you go. I am powering a Cisco IP phone across 2,000 feet of cable. It's actually a bit more. So I've got my black cable over here. That could be 100 meters in length. I've got 2,000 feet of cable connecting me to this NVT Phybridge switch. Okay, so maximum distance of ethernet, maximum distance of power over ethernet isn't 100 meters. In this example, I've gone 2,000 feet, or 610 meters. Okay, so there you go. Phone is powered up. But wait, there's more, as they say. Here they've got what's called a FLEX4. I'm not connecting power to the FLEX4. This is running PoE. So what I'll do here is disconnect this FLEX-link and I'll plug in the FLEX4. As you can see here, the link lights come on. And then what I'll do is plug in this IP phone, but this has got four ports and here I've got another IP phone, so another Cisco phone, which I'll connect to this port. So hopefully I'll end up having two IP phones powered by that single port through 2,000 feet of cable. This is really amazing. 2,000 feet of cable, two IP phones, powered through that. But, I hate sounding like a salesperson, there's more. But wait, there's more. So third cable, let's take a Cisco access point and plug that in. So Cisco access point, these are little Cisco SMB access points that I've got. I'll take another cable and I'll plug in another Cisco access point. And what you should notice, hopefully, is that both of these access points are powering up. I've got two access points and two IP phones connected to one FLEX4, connected over 2,000 feet, or 610 meters, of cable to one port on this NVT Phybridge switch. I think that's really impressive. But you may be wondering, what about the speeds? You can get 100 Mbps of ethernet through one of these connections at these lengths. And you may say, well, David, that's way too little bandwidth. Now you typically wouldn't wanna put an access point like this with a lot of clients connected to it to a port like that. I just had those devices that I wanted to power up. And I wanted to show you that they can be powered using this solution but IP phones such as these don't need huge amounts of bandwidth. A lot of clients actually only use a small amount of bandwidth. And you've got to think about IOT devices. In this blog entry, Cisco talk about 100 billion reasons that Cisco partnered with NVT Phybridge. It's because of all the IOT devices. IOT devices don't need a lot of bandwidth. IP cameras often don't need a huge amount of bandwidth. A lot of people are under the misconception that you need a gig to the end point, but that depends on the end point. An end point like this or an end point like a door entry system doesn't need that amount of bandwidth. But let's put this to the test. How much bandwidth can I get through this? They say a hundred Meg, but let's actually test it. Okay, so in this example, I've got a MacBook. I'm gonna run iPerf on the MacBook, send traffic through that 2,000 feet of cable through the NVT Phybridge, through my Cisco switch, to a MacBook, which I'm running in front of me that's running iPerf as well. So I'm gonna test the speeds across that long cable through the NVT Phybridge, through the Cisco switch, to another MacBook. At the moment, there's no route from this MacBook to that MacBook. Pings are timing out. So what I'll do is connect to the NVT Phybridge switch to the FLEX-link. Once again, going through that 2,000 feet of cable. And then I'll connect the MacBook to that. So as you can see over there, link lights have come on. So that's looking good. And what you can see on the MacBook is that pings are succeeding. On this MacBook, I've turned off the wifi. It's connecting to the network using this USB to ethernet adapter. Pings are succeeding, but let's test ethernet speeds by using iPerf. So I'm gonna connect iPerf from this laptop to the MacBook in front of me. And at the same time I'll run iPerf from that MacBook to this MacBook, and what you should be able to see is that I'm getting about 94 megabits per second from this MacBook to this one. And from this one to that one, I'm getting about 73 megabits per second. Now this is obviously not a scientific test but it's a little test. Traffic from this MacBook through that long cable to the NVT Phybridge and going through the Cisco switch to my MacBook over here, getting about 92 megabits per second from one to the other, and about 81 megabits per second from this one to that one. So I think that's really impressive. Again, not all devices need a gig of bandwidth. Now, if I do unplug this and plug it straight into the switch. So I'll plug it in directly onto the switch, so a link light has come on. And what you'll notice now is the speeds are increasing dramatically. I'm now getting about 929 megabits per second from that one to this one. And from this one to that one, I'm getting 943 megabits per second. So in this case, I'm connecting directly from the Mac to the switch. Don't need these connectors as long as you're within normal ethernet ranges. So that works fine. But in this example, if I move it from that port to this port, these speeds will decrease. Time's out a bit there, but pings start to work. And now I'll clear this, stop it, and start it again. And what you'll notice, I'm getting 88 megabits per second over there. I'll stop this one, start it again, and I'm getting about 95 megabits per second here, 94 megabits per second. So over there, gone down to 70 megabits per second when I started sending from this side. But there you go, 2,000 feet of cable. But there's more, as they say. Let's try and run it through some dodgy cabling. So let's start with this. This has got two pairs. I'll unplug this and I'll just plug it directly into the switch. So port five and plug it in over here. Now I've only got a short piece of cable here but the cable can be much, much longer. So pings are starting to succeed. I mean, that's amazing in itself. Start this again. And I'll do the same test over here. Start at that side, and actually wanna stop this and clear it. And over there you can see I'm getting 94 megabits per second, 93 megabits per second. The side getting like 78 megabits per second. So that's through cable like this. But now let's take this crazy cable. I cut the wires once again. There's only one pair left on this cable now. So let's try that. I'll put that into port seven. Unplug this cable and let's try that now. Dodgy cable, does it actually work? Now what you'll notice is it doesn't work. If you've only got one pair of cable, you need to power this locally. Power of ethernet doesn't get sent through. Okay, so I'll have to provide power locally. But what we should see is the link light goes on, which it does. Pings start succeeding. So I'm now sending pings through this messed up cable, only one pair on that cable. And let's start iPerf on both sides and what you'll notice this side, like 83 megabits per second, 78 megabits per second. This side 88 megabits per second, 89. I'm sending that amount of data, 90 megabits per second through this dodgy cable. And if you don't believe me, what I'll do is I'll simply unplug the dodgy cable now. So there's my dodgy cable. And what you'll notice is the pings start failing. Pings are failing here and the throughput is nothing. So iPerf is showing us that bandwidth is down. I'll plug that back in again, dodgy ethernet cable, and what should happen is the pings should start succeeding. There they go. So pings are succeeding. And what you'll notice is we can send traffic now. We're getting an average of 46 megabits per second. I'll stop that, clear it and start it again. Stop this. Clear. Start again. Getting 95 megabits per second. 95 megabits per second through a dodgy cable like this with only one pair connected. That's crazy, really. How on earth do we get that amount of traffic going through a messed up cable like this with only one pair intact? That's really impressive, I think. Okay, but as they say, there's more. So let me keep that going. And I'll get my big, long cable connected to this FLEX4 again and I'll get my devices connected again. Make sure that they get powered up. So connect this IP phone. It doesn't really matter how many devices I have here. I simply want to show you that another cool feature of the switches is that they share power. So if one of the switches loses power, it can draw power from another switch. (upbeat music)",
    "transcript_keywords": [
        "NVT Phybridge",
        "cable",
        "NVT Phybridge switch",
        "Cisco",
        "megabits",
        "NVT",
        "Phybridge",
        "cabling",
        "ethernet",
        "switch",
        "MacBook",
        "Cisco switch",
        "Phybridge switch",
        "start",
        "feet",
        "dodgy cable",
        "ethernet cable",
        "Pings",
        "Cisco access point",
        "plug"
    ],
    "transcript_entity_values": [
        "UK",
        "FLEX4",
        "about 81 megabits",
        "Arvind",
        "1,000 feet",
        "610 meters",
        "MacBook",
        "more than 100 meters",
        "USB",
        "Mac",
        "70 megabits",
        "46 megabits",
        "6e",
        "a hundred",
        "seven",
        "Cisco",
        "100 meters",
        "third",
        "100 meter",
        "94 megabits",
        "NVT Phybridge",
        "2,000 feet",
        "five",
        "two",
        "four",
        "about 73 megabits",
        "about 92 megabits",
        "Time",
        "only one",
        "93 megabits",
        "95 megabits",
        "305 meters",
        "78 megabits",
        "PoE",
        "David",
        "943 megabits",
        "about 95 megabits",
        "89",
        "IP",
        "Panduit",
        "MacBook",
        "one",
        "90 megabits",
        "IOT",
        "100 Mbps",
        "Cat 6",
        "UTP",
        "U.S.",
        "Cisco",
        "NVT Phybridge",
        "88 megabits",
        "over 2,000 feet",
        "Cat 5e",
        "Meg",
        "1,000",
        "83 megabits",
        "NVT",
        "Only one",
        "about 94 megabits",
        "about 929 megabits"
    ],
    "transcript_entity_types": [
        "GPE",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "CARDINAL",
        "QUANTITY",
        "NORP",
        "QUANTITY",
        "FAC",
        "ORG",
        "GPE",
        "GPE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY"
    ]
}