{
    "id": "y9qrAq7KBZY",
    "title": "Apple Lost Again!!",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-08-12T00:54:21Z",
    "video_url": "https://www.youtube.com/watch?v=y9qrAq7KBZY",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Apple",
        "Corellium",
        "lawsuit",
        "iOS",
        "emulator",
        "Apple lawsuit",
        "Apple vs Corellium",
        "Apple vs Epic",
        "Epic vs Apple",
        "Epic Games",
        "Samsung",
        "Unpacked",
        "Samsung Unpacked 2021",
        "Galaxy Z Fold 3",
        "Galaxy Z Flip 3",
        "Galaxy Watch 4",
        "Galaxy Buds 2"
    ],
    "views": 587456,
    "likes": 36461,
    "comments_count": 861,
    "description": "Get 20% OFF + Free Shipping @Manscaped at     LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:  ---------------------------------------------------  Timestamps:  0:00 Always be ready 0:08 Samsung Unpacked 2021 1:51 Poly Network crypto heist 2:52 RX 6600 XT, RTX A2000 3:42 Manscaped 4:14 QUICK BITS 4:25 GamersNexus exploding PSUs story 4:50 Xiaomi Cyberdog 5:17 Apple drops Corellium lawsuit 5:43 Amazon to pay injured customers 6:06 OpenAI Codex natural language programming  AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://manscaped.com/TECH",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/ILUEL",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Tech news comes at you fast. If you're not looking, it might just, ha! See? That's what I'm, whoa! Jeez Louise. Samsung held their annual Unpacked event this morning and took the wraps off four major new products: the Galaxy Z Fold3, the Z Flip3, the Galaxy Watch4, and Galaxy Buds2. August is when we used to get new Galaxy Notes, but I guess Samsung passed too many of those in class and now they've been sent to detention! (Riley growling) - [Johnathon] You bad kid! - (laughs) Yeah, the metaphor doesn't really work there. Like, Samsung, anyways. The Z Fold3 improves on the Fold2 in a number of ways, as Linus discovered in his hands-on video. It's got an under-display camera on the inside and support for Samsung's S Pen stylus, along with an upgraded starting price of $1,800 US. - Expensive! - It is expensive. You might wanna be careful using it on the street. Ya may get jumped. The Z Flip 3 is also cheaper than its predecessor, starting at 1,000 bucks, with a bigger cover display for selfies and a 120-hertz refresh rate for the main screen. Both of the Z phones have Snapdragon 888s inside and are IPX8 water resistant, which is a big leap from Samsung's original foldies which suffered from problems with dust and crap getting stuck in the hinge. I lost a whole hot dog in there once. I mean, I was forcibly trying to put it in. Then there's the Galaxy Watch4, the first fruit of Samsung Wear OS partnership with Google. This thing's got a bioactive sensor that can measure body fat percentage, a new five-nanometer processor and more RAM, and will start at $249. Finally, the Galaxy Buds2. They're smaller and lighter than the Buds Plus, with proper active noise cancellation this time, and once again seem to offer quite a lot for 150 bucks. Hey! Thanks for all the cool products, Apple for Android people. - [Johnathon] No problem! - Samsung? Hackers made off with around $611 million worth of cryptocurrency yesterday in one of the biggest digital heists ever. The victim was Polynetwork, a P2P platform who tweeted the crypto addresses the funds had been transferred to and pleaded for the hackers to please, please return the funds. Appealing to the humanity. Please. - Please, please! - Wait actually did work. Hours after the attack the hackers started sending small transfers back to Polynetwork, eventually returning around $260 million worth of various crypto currencies. One of the hackers has reportedly said, they did it quote \"for fun and to expose vulnerabilities\" and they were always going to return some of it.\" Some crypto fans following the story tried to get in on the windfall though, replying to Poly's tweets asking, please Mr Hacker if you see this, transfer me some coins too. - [Johnathon] Please. - And also sign up for my initially coin offering. It's called plead coin. - [Johnathon] Sounds like a good deal. I have to say. - It sounds promising. And maybe you don't even wanna hear about new GPU launches but reviews for AMD's RX 6600 XT came out yesterday and well, let's just say it doesn't do much to reverse the 2021 GPU trend. The consensus seems to be that the 6600 XT is somewhat lacking in performance for it's $379 MSRP which is probably a lot less than you would end up paying for it anyways. But don't worry, there was another GPU launch this week: Nvidia's A2000. Sure, it's a work station card and is basically a downgraded RTX 3060. But look how cute it is. - [Johnathon] So cute. - Oh my God. - Computer for it. - If GPU performance and price are now meaningless things to use for comparison, we might as well talk about cuteness factor and the A2000 is off the chart. Sign me up. - [Johnathon] We need more cute graphics cards. I'm sorry, but there's not enough. - Now it's time for quick bits, brought to you by Manscaped, provider of all-in-one grooming tools that you have covered rom head to toe, whether you're a man or any other type of hair generating sentient being. The Manscape Performance Package 4.0 Kit is designed to make grooming below the waist easy with the lawnmower 4.0 and other goodies like the crop preserver and crop reviver sprays to keep things fresh. I feel like crop refers to something else here so head to manscape.com/tech and get 20% off Manscaped and free shipping today. Quick Bits coin. Everybody has a copy worldwide. Which makes the bits even quicker. It's the future. - [Johnathon] That's a good idea too! - Distribute the quick bits. Gamers Nexus has published an in depth report on gigabyte GPP750GM and P850 GM power supply units that Newegg has been bundling with GPUs. Apparently to sell off low quality stock. Because around half of the units the tech Jesus crew tested failed. So watch their video and pledge your heart to Steve if you haven't already. He deserves it, with that hair? It takes a lot of work. - [Johnathon] I'm trying to get there. - You're half way. Xiaomi announced a number of new products this week but the standout has to be the cyber dog, a really cool new quadruped robot that is the result of hundreds of thousands of hours of RND which were apparently mostly spent reverse engineering the Spot Robot from Boston Dynamics because come on! That's also probably how they were able to price it so low. I mean Xiaomi gets points for marketing. Their renders look really great but the shamelessness on display here is much more impressive. Apple has officially settled their lawsuit with Corellium, maker of an iOS emulator that could run in a web browser. The Judge ruled Corellium's use of Apple software qualified for fair use meaning I could build a Hackintosh that runs iOS? No, that's definitely not what this means at all but you gotta admit it would be useful to install Find My on my PC. Always losing it, it has a mind of it's own. I put the Mac Pro wheels on it so it's just... Amazon thinks it's finally found a way to appease customers who've bought faulty products which resulted in bodily injuries. Money! People who purchased third party products that cause damage to oneself or one's property are eligible for up to $1000 in hush money. So you can put a down payment on a prosthetic leg for yourself and Jeff can keep going to space. Everybody wins! I don't see a problem here. And OpenAI has found another use for their fancy language understanding GPT3 system, allowing programmers to code without writing code. - [Johnathon] What? - OpenAI's codex will code for you based on natural language input. So you can just tell it to put a bunch of buttons somewhere on a webpage or hey, show a little image of a guy I can control with arrow keys. What are you gonna make with it Jonathon? - It sounds like an assistant. - Hey Codex, end this episode in a fun way and tell the audience to come back on Friday for more tech news, you heartless machine. And then it does it hopefully. - [Johnathon] Bye!",
    "transcript_keywords": [
        "Samsung",
        "Galaxy",
        "GPU",
        "Galaxy Notes",
        "products",
        "Hackers",
        "quick bits",
        "bits",
        "Samsung Wear",
        "work",
        "Tech",
        "put",
        "Apple",
        "performance",
        "coin",
        "fast",
        "Samsung held",
        "GPU performance",
        "Sounds",
        "guess Samsung"
    ],
    "transcript_entity_values": [
        "Steve",
        "half",
        "Hackintosh",
        "yesterday",
        "around $260 million",
        "hundreds of thousands of hours",
        "the Buds Plus",
        "A2000",
        "$379 MSRP",
        "One",
        "RAM",
        "the Spot Robot",
        "Riley",
        "one",
        "20%",
        "Newegg",
        "249",
        "Samsung Wear OS",
        "up to $1000",
        "GM",
        "Google",
        "2021",
        "$1,800 US",
        "Amazon",
        "Galaxy Notes",
        "Johnathon",
        "IPX8",
        "150 bucks",
        "Galaxy Buds2",
        "Jesus",
        "Samsung",
        "August",
        "Xiaomi",
        "Jeff",
        "Friday",
        "$611 million",
        "annual",
        "Corellium",
        "third",
        "first",
        "Hours",
        "AMD",
        "Mac Pro",
        "Nvidia",
        "Corellium",
        "Jeez Louise",
        "120",
        "Manscaped",
        "Android",
        "4.0",
        "four",
        "XT",
        "GPU",
        "around half",
        "Manscaped",
        "this week",
        "Boston Dynamics",
        "Snapdragon",
        "6600",
        "the Z Flip3",
        "this morning",
        "Linus",
        "five-nanometer",
        "3060",
        "Poly",
        "Polynetwork",
        "RX 6600 XT",
        "The Manscape Performance Package 4.0 Kit",
        "Jonathon",
        "1,000 bucks",
        "Apple",
        "today",
        "Fold2"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "LOC",
        "DATE",
        "MONEY",
        "CARDINAL",
        "FAC",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "MONEY",
        "DATE",
        "GPE",
        "ORDINAL",
        "ORDINAL",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "TIME",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "DATE",
        "PRODUCT"
    ]
}