{
    "id": "y_Vx3kt3NUw",
    "title": "Are Blackberry Keyboards ACTUALLY Faster?",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-06-26T19:33:36Z",
    "video_url": "https://www.youtube.com/watch?v=y_Vx3kt3NUw",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Blackberry",
        "KEY2",
        "blackberry keyone",
        "key two",
        "fastest keyboard",
        "PKB",
        "VKB",
        "crackbery",
        "crackberry",
        "fastest smartphone",
        "fastest phone",
        "best blackberry",
        "new blackberry",
        "latest blackberry"
    ],
    "views": 343528,
    "likes": 9756,
    "comments_count": 1071,
    "description": "Before my Blackberry KEY2 review, here are my thoughts on the new physical keyboard. BB KEY2 -   The KEY2 looks to be a nice upgrade from the Blackbery KEYone with improved ergonomics, a Snapdragon 660, speedkey shortcuts and Android Oreo 8.1. It's the best smartphone blackberry has made!  Music Credits: Fili - Up Coast  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2KnljuO",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going Dave 2D here? So the BlackBerry Key2 launched recently and it's a device that people have mixed feelings about on one hand They are like the og smartphone brand These guys are the first people to make that truly relevant Smartphone the original BlackBerry's and people have very fond memories of the keyboards and stuff like that But on the other hand, this is a very dated brand not because of the hardware or the software anything like that But because of the brand and how things shaped out for them people don't really look at blackberry as like a beacon of innovation That's just how the cookies crumbled for them. So I'm someone who used the original blackberries quite a bit for work I never like loved the brand or anything like that, but I like the physical keyboard But ever since I moved to virtual keyboards on like iPhones or Android phones it just I never really missed the physical keyboard So I wanted to know is this device really all it's shaped out to be because we look at the paper specs It's not all that impressive like the snapdragon 660 the four and a half inch IPS screen The hardware is nothing to write home about but the keyboard is what people are interested in I think a lot of my peers in like the YouTube space are like hey This is going to be my next daily driver like this is the phone like I love the physical keyboard So I want to know like am I gonna type faster on this thing? I'm gonna be more productive because a lot of people still say that they are faster on the physical keyboards than they are on virtual keyboards and Not that I disagree with it, but I just I haven't used a physical keyboard in a while. Let's dig in Okay, so I've set up the phone real quick and take some time to kind of get reoccur some to the physical keyboard It's been a while since I've used one and I feel like if I'm gonna give this thing a proper test I have to spend Some time to kind of retrain my muscles, okay *proceeds to test the keyboard* Alright so it's been around 12 minutes of using this thing and I got to be honest I feel slower on this thing than I remember Not that I was super fast or anything before but I feel quite crippled on this physical keyboard Hopefully it does pick up I will say though there's definitely some advantages like the tactility is nice to be able to feel the keys I like that again, but speed is just not there right now I've had about an hour of practice on the BlackBerry key two and at this point I'm comfortable with my speed I don't feel like this is the fastest I'll ever be but it's fast enough for me to measure so I'm gonna measure once on The key two and then once on the iPhone ten and the test I'm doing is really not Scientific, I'm just gonna be typing the phrase the quick brown fox jumps over the lazy dog as many times as I can in one Minute, okay So for both of these phones I was getting around seven sentences in that one minute not particularly fast I feel like some of you're gonna be way faster than that, but that's just my natural typing speed Um, I'm actually surprised I thought that the key two would be noticeably faster and I just don't think that's the case I've always heard that rumor or that idea that a physical keyboard would be faster and better but I really don't think that's the case I will say though that The tactile Keys makes it easier to touch type like as I was using this I could feel like like muscle memory It's easier to kind of feel the keys and just use it like that If you don't wanna look at the screen, or if you can't look at the screen But I don't think speed is one of the big things on this thing I do think that there's a Degree of precision or just like accuracy that comes with being able to feel the skete and feel the keys but not speed. Okay That's basically it between a physical keyboard and a virtual keyboard. I really don't think there's a difference in speed. Okay Hope you guys enjoyed this video thumbs if you liked it subs if you loved it . See you guys next time",
    "transcript_keywords": [
        "physical keyboard",
        "keyboard",
        "physical",
        "feel",
        "virtual keyboards",
        "people",
        "keyboards",
        "thing",
        "speed",
        "faster",
        "feel the keys",
        "Dave",
        "keys",
        "smartphone brand",
        "brand",
        "BlackBerry",
        "key",
        "inch IPS screen",
        "things shaped",
        "BlackBerry key"
    ],
    "transcript_entity_values": [
        "four and a half inch",
        "around 12 minutes",
        "YouTube",
        "iPhone",
        "ten",
        "Android",
        "next daily",
        "one Minute",
        "seven",
        "one minute",
        "660",
        "two",
        "Dave",
        "first",
        "BlackBerry",
        "iPhones",
        "about an hour"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "NORP",
        "TIME"
    ]
}