{
    "id": "YaDORL2OGuo",
    "title": "How does a Modular TV Work? - Samsung Micro LED TV",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-01-18T14:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=YaDORL2OGuo",
    "category": "Howto & Style",
    "tags": [
        "Qled",
        "Microled",
        "TV",
        "big TV",
        "best TV",
        "Samsung TV",
        "samsung",
        "MicroLEDTv",
        "Samsung CES",
        "CES",
        "The Wall",
        "Micro LED",
        "Samsung OLED",
        "8k TV",
        "samsung 8k",
        "8k QLED",
        "oled",
        "Oled 8k"
    ],
    "views": 591445,
    "likes": 25647,
    "comments_count": 2244,
    "description": "The new QLED 8K TV is HERE:   CES 2019 was a blast. Huge thanks to Samsung TV for sponsoring this video and bringing me out to CES to check out their new technology. The Modular MicroLED TV is the next big thing in home entertainment.  *Follow me for updates!* Instagram:  Facebook:  Twitter:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.samsung.com/us/televisions-home-theater/tvs/qled-8k-tvs/85--class-q900r-qled-smart-8k-uhd-tv--2018--qn85q900rafxza/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "[Music playing] Huge thanks to Samsung for sponsoring this video. So you might be thinking to yourself, all TVs are the same. But that's not quite the case. Samsung has just released a modular micro LED TV that's pretty incredible. I'm going to show you how it works. Let's get started. [Intro] So here's the thing with the new Samsung micro LED TVs they are completely modular and customizable. Size-free, ratio-free, bezel-free, and resolution-free. You can combine these little squares together to make a TV as big or small as you want. You can see the TV behind me, it's a 1x8 panel that's completely modular. Each of the little squares can disconnect and be put somewhere else. Let's say you have a TV budget for this year. You can buy the panels, get a TV as big as your budget allows, and then next year, if you have a larger budget, you can buy more panels to make your TV even bigger and increase the resolution. Anywhere from 4K, 6.5K, 10K...as big as you want, as much resolution as you want. It's pretty interesting. Plus, with the modularity of this TV, you know repairability is pretty important for me in my channel, if one panel happens to break...let's say you're getting aggressive during a video game and someone throws a controller at the screen and cracks it. You've seen the YouTube videos where people do that. Instead of replacing the whole TV, you can just replace the one particular panel. So I think this technology definitely has a place in the world, and I'm excited to see where it's going. So how does it work? Magnets. Each of these modular squares has a back plate which mounts directly into the wall. There's kind of like a master square that controls all the squares around it. And each of the rear panels have two little latches that pop up, there are little metal contact pads, and they clip into the panel next to it...just like a little connector to get their information and signal from that master square in the center. And because each of these little modular panels have no bezels, you can stick them right next to each other and the seam disappears when the content is displaying. Now this isn't on the market just yet, it's just where the future is headed. I think modular micro LED TVs are the way of the future, and the same technology that they're using in these modular blocks is used in Samsung's massive TV, which I'll show you right now. The viewing angle on this thing is insane. Even when you're like right up close to it, you still can't see the pixels inside of it, and you can still see the whole image. This is crazy! It can be a window to the outside world. You can watch your movies, and the internal technology, the artificial intelligence, displays whatever content scaled to the right dimensions for your uniquely sized modular TV. So with 8K TVs, obviously not everything is 8K content just yet. We're barely getting into the 4K realm. But with Samsung's TV that they're calling The Wall because of how big it is, it has internal AI that can upscale high definition, ultra high definition, 4K...it upscales it to 8K so it looks even better in real life. So this massive TV behind me is still the same modular technology that we saw in the smaller TVs over there. This is what Samsung is calling The Wall TV because it can literally take up an entire wall. So LED TVs are 100% light efficient. All of the light emitted from the LED shoots directly out to your eyeball the viewer plus the micro LEDs use inorganic material, which means there is no burn-in with this new technology. So you can have the same outside of your window displaying for years with no burn-in on this TV. Samsung does have their high resolution 8KQ LED technology up and running. It's not modular but it's still 8K. Super impressive. I'll leave the current pricing down in the description if you're curious. So whether you're the type of person who likes to go out and buy the latest stuff, or you just like knowing what's out there for the future, 8K isn't something only in your imagination anymore, it's here, and it looks pretty darn good. Would you rather have a modular TV built from panels you organize yourself? Or do you prefer the large standard pre-built TVs? I'm curious to see how the technology is going to be utilized in the future. Thanks again to Samsung for sponsoring my trip to CES this year. Let me know if you have any questions down in the comments. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "modular",
        "Samsung",
        "modular micro LED",
        "micro LED TVs",
        "LED TVs",
        "LED",
        "Samsung micro LED",
        "micro LED",
        "TVs",
        "technology",
        "panels",
        "panel",
        "wall",
        "modular micro",
        "squares",
        "big",
        "micro",
        "pretty",
        "future",
        "LED technology"
    ],
    "transcript_entity_values": [
        "10K",
        "8",
        "two",
        "Samsung",
        "AI",
        "100%",
        "4K",
        "next year",
        "this year",
        "CES",
        "YouTube",
        "years",
        "6.5",
        "1x8",
        "one",
        "4"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL"
    ]
}