{
    "id": "yb7UqUJOyQc",
    "title": "Galaxy Watch Active Review: Trimming The Fat",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-04-05T18:02:43Z",
    "video_url": "https://www.youtube.com/watch?v=yb7UqUJOyQc",
    "category": "Science & Technology",
    "tags": [
        "samsung galaxy watch review",
        "samsung galaxy watch active review",
        "best smartwatch 2019",
        "samsung active review",
        "watch active review",
        "mrmobile",
        "michael fisher",
        "android central",
        "samsung gear"
    ],
    "views": 572388,
    "likes": 9122,
    "comments_count": 458,
    "description": "If youve asked me to recommend a smartwatch any time over the past few years, Samsungs Galaxy Watch line has always been part of the conversation. Thats thanks to three things: consistent software; an innovative active bezel; and longer-than-average battery life. So I was surprised when Samsung ditched two of those pillars to create its new Galaxy Watch Active! Lets see if the tradeoff was worth it.   [SPONSOR]  Sponsored by Qualcomm. To learn more about Snapdragon 855, visit:    [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S GALAXY WATCH ACTIVE REVIEW]  MrMobile's Galaxy Watch Active Review was produced following three weeks with a Samsung Galaxy Active review device on loan from Samsung. It was paired with a Galaxy S10+ for the entirety of the review period and received one software update during that time.   [LINKS]  Samsung Galaxy Watch Active [Amazon]:   Samsung Galaxy Watch [Amazon]:   Galaxy Watch Active vs Galaxy Watch [Android Central]:   Samsung Galaxy Watch Active Review [Tom's Hardware]:    [MUSIC]  Glowing City by Cymatix, available at Premium Beat:   As Science Progresses by Aulx Studio, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #samsung #galaxywatch #galaxywatchactive #wearables #wearabletech #smartwatch #tech",
    "description_links": [
        "https://www.qualcomm.com/products/snapdragon-855-mobile-platform",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/506",
        "http://mrmobile.tech/507",
        "https://www.androidcentral.com/samsung-galaxy-watch-active-vs-galaxy-watch",
        "https://www.tomsguide.com/us/samsung-galaxy-watch-active,review-6254.html",
        "https://www.premiumbeat.com/royalty-free-tracks/glowing-city",
        "https://www.premiumbeat.com/royalty-free-tracks/as-science-progresses",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] This video is sponsored by Qualcomm. If you've asked me to recommend a smartwatch at any time over the past few years, Samsung's Galaxy Watch line has definitely been in the conversation for three main reasons: consistent software, an innovative active bezel, and longer-than-average battery life. So I was surprised when Samsung's new Galaxy Watch Active ditched two of those three main pillars. I'm Mr. Mobile. Let's see if it was worth it. (upbeat music) In the wearable world, the only reason you'd take away two selling points that big is so you can build a watch that's this small. See, in 2019 the average smartwatch size falls between 42 and 46 millimeters. And the Galaxy Watch Active clocks in at below 40 millimeters. That's smaller than its direct competition from Apple and Google, and it's ultralight too at 25 grams without the strap. That's a godsend to people with thin wrists, and for them the elimination of the rotating bezel will be worth it. For me, I wish Samsung had somehow found a way to preserve that interface element, even if it just made the edges of the display touch-sensitive. The loss of the ring is most sharply felt in timers, when scrolling messages, and in the app launcher where launching an app is now a two-step process, one tap to see what it is, another tap to open it. It's a step backward and I wish we didn't have to take it. If you can live with a touch screen and two side buttons, you'll find much to like in Samsung's software though. Initial setup is a breeze compared to Wear OS and after you've moved in, using it is easy too. Swipe in from the top and right sides for settings and widgets, with notifications stacking up to the left as they come in from your phone. The haptic motor is strong enough that you're not likely to miss one of those alerts and while there's no speaker, there is a microphone for voice commands through Bixby. You can start your day with a daily briefing, letting you plan your workouts, telling you what kind of weather to expect. At the end of the day, there's an evening summary that tells you how much activity you got in, what's on your calendar for tomorrow, and how long it'll be until you need to charge. And more on this in a minute. A lot of folks criticize Samsung for a lack of third-party apps, and it's certainly something to consider when you're buying into an ecosystem, but over the past few years I've realized that I don't really use many apps on my watch. Now, Samsung does offer important ones like Spotify and Samsung Pay, and for the former you get standalone playback so you can store and stream music without your phone. If you need more specific smartwatch support from, say, a smart home hub or a camera, you'll still wanna seek out the more robust ecosystem of Wear OS or if you have an iPhone, of course you'll want the Apple Watch. And old guy complaint alert, those watches will also give you preloaded timer and stopwatch apps. I will never understand why Samsung forces a user to go download these basic apps from the store. It's a watch. Okay, so how about staying, you know, active? Well, those who put health and fitness tracking first will still be better served by a Garmin or Polar but for those who just like to do the occasional torso twist, Samsung Health just keeps getting more capable. The watch is water-resistant and ruggedized for swimming or running in the rain. It'll auto-detect exercises, give you gentle prompts when it's time to get moving, and track your heart rate and sleep cycles. But the latter point is gonna be a reason for folks to spring for a Fitbit instead because there's no way you're gonna wanna wear this to bed unless you get into the habit of charging it beforehand. Unlike Samsung's bigger wearables this is a two-day device, and then only if you're frugal with things like GPS workouts. Maybe that's why it's harder to trigger the raise to wake gesture on this watch than others I've tested. Maybe Samsung's trying to clamp down on accidentally powering up that bright but doubtless energy-hungry watch face. And the charge time is pretty pokey too, taking almost two and a half hours to go from empty to full. Now, the silver lining is that if you have a Galaxy S10, you can use your phone to top up your watch on the go, which is absolutely one of the coolest uses of wireless charging ever. But it's not a substitute for better battery life on the whole. The Galaxy Watch Active is more affordable than its larger predecessor's debut price. And again, its slimmer form factor will be a profound relief to those tired of giant watches. It also makes sense that Samsung wants to start differentiating between its fitness-focused wearables and its more proper smartwatches, and the Galaxy Watch Active is a great start there. If a tiny timepiece isn't what you're looking for though, at press time I'm seeing prices for the larger Galaxy Watch as low as $260 on Amazon and at Best Buy. So if you were shaking your head at the downsides of the Galaxy Watch Active, you may want to go with that slightly older wearable instead. This video is sponsored by Qualcomm and its Snapdragon 855 mobile platform. With a seven-nanometer process promising peak performance, some of 2019's newest smartphones are gonna be faster. And we're talking up to 20% faster graphics rendering than the previous generation, and an up to 45% boost in CPU performance. And that's the biggest CPU performance leap ever. You'll be able to play a game for two-plus hours, capture 4K HDR video for six-plus hours, and when it comes time to charge, well, it won't take hours. Simply put, the Qualcomm Snapdragon 855 is one powerful mobile platform. Folks, this review was produced with the help of a Galaxy Watch Active review sample on loan from Samsung. And if you want a deeper dive on the fitness features that I generally only touch on I'll point you to my friends at Android Central who I expect to review this device eventually, and I'll link you to a review I found particularly helpful over at Tom's Hardware. That's down in the description. Until next time, thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "Galaxy Watch Active",
        "Galaxy Watch",
        "Watch Active",
        "Samsung Galaxy Watch",
        "Watch",
        "Samsung",
        "Galaxy",
        "Galaxy Watch line",
        "active",
        "larger Galaxy Watch",
        "Watch Active review",
        "Watch Active ditched",
        "Samsung Galaxy",
        "Watch Active clocks",
        "time",
        "Apple Watch",
        "Samsung Pay",
        "innovative active bezel",
        "Watch line",
        "apps"
    ],
    "transcript_entity_values": [
        "Galaxy Watch Active",
        "seven-nanometer",
        "below 40 millimeters",
        "six-plus hours",
        "third",
        "Garmin",
        "260",
        "20%",
        "Bixby",
        "the Apple Watch",
        "Qualcomm",
        "S10",
        "Samsung",
        "Spotify",
        "Fitbit",
        "25 grams",
        "The Galaxy Watch",
        "Apple",
        "tomorrow",
        "hours",
        "Galaxy Watch",
        "almost two and a half hours",
        "Tom's Hardware",
        "Mobile",
        "Android Central",
        "Polar",
        "46 millimeters",
        "daily",
        "iPhone",
        "the Galaxy Watch",
        "the past few years",
        "first",
        "Best Buy",
        "Michael",
        "Google",
        "between 42",
        "two",
        "4",
        "CPU",
        "two-day",
        "Snapdragon 855",
        "evening",
        "up to",
        "2019",
        "45%",
        "Wear OS",
        "the Galaxy Watch Active",
        "two-plus hours",
        "three",
        "one",
        "Amazon",
        "the end of the day",
        "Samsung Health"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "ORDINAL",
        "ORG",
        "MONEY",
        "PERCENT",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "FAC",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "TIME",
        "PERCENT",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG"
    ]
}