{
    "id": "YBhN7kn8j-g",
    "title": "Apple Forgot to Erase This iMac's Internal Software - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2022-02-10T16:59:32Z",
    "video_url": "https://www.youtube.com/watch?v=YBhN7kn8j-g",
    "category": "Science & Technology",
    "tags": [
        "Apple Forgot to Erase This iMac's Internal Software - Krazy Ken's Tech Misadventures",
        "Apple Internal",
        "Apple Prototype",
        "iMac",
        "PVT",
        "Mac OS X",
        "Mac OS X Snow Leopard",
        "PhoenixCE",
        "Rare",
        "Diagnostic Software",
        "Power Supply",
        "iMac Repair",
        "iFixit",
        "PSU",
        "Mac Crash",
        "Computer Crash",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Tech",
        "Computer",
        "Comedy",
        "Humor",
        "Funny",
        "Computer Clan",
        "macOS",
        "Finder",
        "Apple_KFS",
        "ZFS",
        "HFS",
        "Disk Utility",
        "Terminal"
    ],
    "views": 698987,
    "likes": 18102,
    "comments_count": 1095,
    "description": "Win iFixit Tools! Each week, one lucky fixer who shares a photo of their repair at #fixitfeb will win a Pro Tech Toolkit! Last day to enter is Feb 28th. Winners will be contacted directly via social media.     You can support this channel on Patreon! Link below  This late 2009 iMac has internal Apple software on it and the OS appears to have a non-public build number. You know what else is odd? The Mac's serial number doesn't appear in any lookup tools. And you know what's WEIRDER?! The Mac died on Krazy Ken. Join him as he fixes the computer and explores the hard drive, with help from Brainiac Brent!  Watch part 2 next!    Check out our rare tech playlist   Watch the WOW Computer episode!   Download our epic wallpapers   Support our channel and get cool stuff    Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord     Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #fixitfeb #KrazyKen #ComputerClan",
    "description_links": [
        "https://ifix.gd/computerclan",
        "https://youtu.be/lbUhdIGsxH8",
        "https://bit.ly/clan3zlKXX9",
        "https://youtu.be/1TtXknHoeL4",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- This iMac was at an Apple testing facility and it has special diagnostic software on the hard drive. And usually that stuff is erased before the iMacs go to retail, but this hard drive wasn't erased but as I was testing it earlier, something exploded on the inside and it smelled awful. So today you and I are gonna try to fix it. Sponsored by iFixit. (upbeat music) Hey guys, how are you all doing? If you're new here, welcome My name is Krazy Ken and we need to get this iMac working today because of the special software that was accidentally left on the hard drive. Now we'll take a look at the inside to see what's broken. My theory is a capacitor blew on the power supply. So hopefully swapping that out is all we need to do. And then we can have some fun with the contents on the inside. Also, iFixit is giving away some Pro Tech Toolkits. And I'll tell you more about that in a bit. All right, let's open her up. So the first step to opening up this iMac is we have to remove the display glass. So I'm using these iFixit heavy-duty suction cups. And we'll put one right here, one right here and we'll flip the lever to increase suction captain and do a little more suction there. Okay, that was a little quicker than I thought it would be. So I have my handy little iFixit screw tray here and there's should be eight screws in total along the sides that we have to undo. And oh, the magnet is on the display is sucking in my bits. Okay, that, that sounded weird. All right, so here we go. Number one, I just dropped a screw on the inside and that's the last screw they like to stick to those magnets. Okay, so now we can't take the display out all the way. We have to do a little bit of unplugging so let's be nice and careful. So first we've gotta do the vertical sync ribbon cable here. So now hiding under here is the LED backlight power. We'll take that out. That's probably display data to actually drive the video. Hey, how's it going? So now we have the thermal sensor cable right here. Very tiny one. Let's go ahead and get that out of there. All right, and now the display should be able to be separated. There we go. We have one giant iPad now. The power supply like I was hinting at earlier is likely our culprit but I'm just examining the rest of the components quick and nothing from a quick look seems out of place. So now we can take the power supply out and still with according to iFixit at a T10 but it seems like it's a T9 actually. And it's an exposed power supply. So just word of advice, handle it from the edges. Don't touch the stuff on the other side. There's capacitors on there. You don't wanna shock yourself. It's still connected, but I was just trying to look for any noticeable damage, but I don't see anything yet. Something might have blown much more like deeply inside of here. All right, so let's go ahead and disconnect the AC cable and the DC cable. So Brandy and Brent helped me get the DC cable out. The AC one was pretty easy. The DC one was just kind of a... The replacement one looks a little bit different but sometimes there will be variations depending on the manufacturer of the power supply but they're all built to spec. So it will still work. Just looks a little bit different. So now we're gonna set this one aside, put the new one in, put it back together and hope it powers on. Okay, so while I was working on this episode lots of juicy developments occurred through additional research and through people reaching out to me and I'll share them soon. In the meantime enjoy the rest of the episode. All right, power supply is back in. We'll screw it back in. And while we were doing that, hey there's our little stray screw that fell in there earlier. So now you can reunite with your family. Display has been reinserted with the cables and everything. The ZIF connector for the v-sync was being a little finicky 'cause it's really flimsy and thin. The contacts were bending a little bit for the enable and ground pin. I believe. So I tried straightening those out. Hopefully they work. Now just gonna wipe down the display a bit 'cause we did get some dust in here as we were cleaning. And we don't want that trapped in here between the glass and the display. Unlike the wow computer when I got that, there were like three big fusses in there that was nice. That was a nice $1,300 computer. Going back with the glass here, reinserting it and lining it up and letting the magnets do their work. There we go. Nice little suction cup circle there. Okay, and the display is back on. Now. I did promise to talk about the iFixit giveaway. So I'd like to do that quick. iFixit is teaming up with makers and fixers on YouTube and is challenging more people to fix stuff in February. You'll see creators like me tackling repairs and DIY builds instead of buying new tech all the time. Each week, one lucky fixer who shares a photo of the repair on Instagram or Twitter with the hashtag #fixitfeb will win a Pro Tech Toolkit. Last day to enter is February 28th and winners will be contacted directly on social media. So good luck and happy fixing. All right, let's press the power button and pray this thing works. (iMac powers up) So far, so good. The display is flickering a little bit probably because something wasn't plugged in super properly. (elevator music) So there's been some developments happening recently or as I like to call it, I was mining off camera. So the iMac's backlight just does not work. We reseed everything. We rescrewed everything in it still doesn't work. Sometimes it flickers and then it just turns off. So either something got damaged in the repair which I hope not but another possibility is the driver board or something with the power got damaged when the power supply blew initially. So long story short, the back light doesn't work. The good news is we can hook up an external display so we can see what's happening with the system here. Now this system is kind of a mystery to me and Brainiac Brent, we did some research so we're not totally lost in the dark, but there's a lot of things on here that we really don't fully understand because this is Apple internal software for diagnosing problems. So if anybody in the comments knows anything, feel free to let me know but we're gonna do our best to dive in and have some fun. So when the system first starts up the clock isn't set right. So we'll just ignore that. And then we're greeted by a KSH terminal. It says, please scan, run, and code. So I'm just gonna press good old control C and terminate that and quit out of there. Now you may notice we have these color bars, which are I get guess somewhat similar to those SMPTE bars. You see when testing televisions and calibrating for broadcast, typically you can choose wallpaper, right? And when we choose the Snow Leopard Aurora wallpaper, it's actually linked up as this image to be the default which I think is pretty cool. And they probably use this for calibrating displays and making sure colors work, okay. And there's a lot of icons here in the doc and on the desktop. Stuff I'm sure most people haven't seen before because it's a lot of stuff that I've never seen before. And the PhoenixCE and the iTest really get my attention. Those sound like cool internal diagnosing programs. So I think we'll save the best for last there. One of the other things I first noticed was the file system formatting for these two unmountable drives. So we're booted off of MaxDisk and there's this other diagnostic volume which other information can be stored on like logs. But then there's these two BSD default name volumes, disk zero S2 and zero S5. And they're unmountable. I can't get 'em to mount and of them is 1.9 terabytes in size. But I can't tell what's on there. We have no information here. But this part intrigued me, the partition type is Apple KFS. And I can't recall ever seen that before 'cause we're used to things like ZFS or HFS, hierarchal file system, but KFS, I've never heard of. And I asked Twitter and I did some researching and Kentucky fried file system was a result. I'm pretty sure that's not what it is. But knowledge file system is another thing I saw come up. I also saw KFS get referenced in an IRIX manual and it did reference Apple share but it didn't fully define what the letters in KFS mean. It seems to be some sort of virtual file system which I do not know much about. So I won't even try to explain it. But if anyone in the comments knows more about what KFS is specifically Apple KFS, I'd be really interested to know. So here's something else that got me curious. I wanted to look up the serial number. So when I typed this into Apple's serial number lookup, I couldn't find anything. I typed in some of my other personal devices, some older, some newer and Apple found them just fine but Apple could not find this number in their database. I'm not sure why. So as you may expect with diagnostic things, there's usually some cool demos lying on the system somewhere. So let's take a look at this folder conveniently placed on the desktop OpenGL demos. All right. What do we do for blue pony? Let's open that one. There you go. Wow. This is art. I mean NFTs got nothing on this. Ooh, glut Mac. Yeah, ooh, start walk. Okay, whoa. Okay, chill baby. You're you're not gonna accomplish anything like that. Oh nice, stretchy chess. It looks like it just played until the computer like beat itself. Toggle, toggle chaos. Whoa, they're all dancing. Okay, look at them. They look so happy to have just killed a bunch of people. Speaking of OpenGL another thing I noticed that has something to do with that is this update desktop shortcut. If we show where it is in the file system, it's pointing to this EMC software folder and name along with the couple of other items. And when you run that, it spits out information into an image file and sets it as your desktop. We have chip set model ATI Radeon HD 4670, ROM revision, clock speeds of things, memory serial number and it just puts it right on the desktop for you there. And we can change the desktop background click on the default aurora to get those color bars back. Another thing I wanted to poke around with was history and certain items. Just to see where the previous users might have been. So if we open up safari, we can see at one time someone at Apple or an Apple-related or contracted facility was looking up chud.apple.com which I don't even think is a thing now. I can't connect to it now anyway even on other computer, but it looks like they were also using some other locally mounted volumes, DTI, iMac, K22, K23, archives. So there's some other files that were being referenced here which we can't get to now because we don't have access to this location. Brent, on the box right there, that big brown box that's what this thing shipped in. Can you see if it says K22 or K23 on there, anywhere. - [Brent] Set 2 K22 QCA. - I guess it's quality control and assurance. Something like that. It's just written on the box in magic marker. Yeah, look at that. We interrupt this episode for some breaking news. Okay, so here's some new information we discovered. K22 is likely a code that refers to the unibody iMacs which is exactly what this kind of iMac is. So that makes sense specifically it refers to the 21.5-inch model and K23 refers to the 27-inch model. In addition, we uncovered further evidence that this is a prototype iMac in the PVT stage. Production validation test, not a retail system where the software was accidentally left on the hard drive. Which has occurred in some cases with refurbished Macs. Now in the file system, a folder had the code K22 and the PVT abbreviation in the same file name. That coupled with the fact that the serial number doesn't appear in any lookup, strongly suggests this is a prototype. In a addition, the operating system is likely a pre-release build of Mac's OS 10.6 Snow Leopard. According to Mactracker, these iMacs never shipped with 10.6. They actually shipped with 10.6.1. Also the build number of this OS is 10A2148 which doesn't match any of the public Snow Leopard build numbers. I'm still doing further research. So I think I'll make a follow up episode to this. If you'd like to see that, please leave a like so I know people are interested. All right, back to the episode. So there is another history folder here. Now the date is set wrong. This computer didn't even exist in 2001, but if we open that up, we get something I've never seen before. BTR viewer, MT Viewer and PDCA and CTS portal, all with Apple favicons. So these must be other Apple internal things that I am not familiar with. And it appears they are pointing to an intranet address. So these IP addresses were likely only accessible inside certain buildings, on certain networks for security reasons. It's not accessible to the public, but it looks like they were pointing to some sort of web application 'cause WebObjects was used to make applications that ran off of web servers. EMC, electromagnetic compatibility. These devices need to pass certain require to make sure they're not affected by radio interference or other waves. And to also make sure they're not affecting other devices themselves. So I'm not a hundred percent sure if that's what this EMC program is made for. I'm guessing it is 'cause it says EMC and it shows little radio waves. So I'm gonna check just all of the discs do 'em all. And oh. (guitar music) So yeah, we got a bunch of HS. An error occurred in optical drive two. Okay, we don't have two optical drives. Oh one failed two. It seriously sounds like don't fear the Reaper just slightly different notes. It's like the same rhythm. (guitar music) How long does this usually take? - [Brent] It doesn't stop. You have to stop it. - Oh, okay. I'm glad I know that now. Now one thing I didn't do any prep with was Net Install. I don't know what trains are in this context. For assistance please contact, don't know if the email address is still up. I'd like to be polite and not bug them but that is interesting. Help for Apple Net Install. Go here for help. How much do you wanna bet to doesn't go anywhere. Well, okay, we're not connected to the internet so we can't do anything. Well, we looked it up and yeah, this address doesn't even work. Log monster got my attention in the dock here but I wasn't really sure what it was until Brainiac Brent pointed out some things 'cause as I open up this stuff, I'm going through it. And like I can't even begin to decipher this stuff but he mentioned it looks like it's diagnostic inform being spit out from the Phoenix tool. But I was really intrigued in the about screen here because engineering Phoenix Team, human interface design, Phoenix Team testing all LogMonster Users. So I don't know if Phoenix team is an internal Apple team, it's right down here, it says copyright Apple 2006. So that's another thing that really has me curious. The Phoenix team sounds so cool. I guess that's a good segue to the diagnostic tools. It looks like we have two, we have iTest and Phoenix CE no idea what the CE stands for. It says copyright WW Ops Technology and Apple incorporated. I looked up Ops Technology. Couldn't really figure anything out, but yeah, we have that in iTest. So let's start with iTest. Probing. All right. Could all go for a good probe. So it kind of reminds me of iTunes where you're scrolling through this column view and we're gonna choose the display device. There's word on the street is when you run this, something crashes. So let's take a look. Let's run that... Oh, that was quicker than I thought. So we're gonna run these two video controller tests which apparently have something to do with H.264 encoding. That's a pretty common code for video delivery and visual stuff is fun. So let's do that. Let's run these two. I saw some like stock footage pop up really quick and go away and hey, we have BBC footage now too. This is great. And I'm guessing it's playing it really fast 'cause it's trying to play it as fast as it can without dropping a frame. Zero success info, test 66 complete. So I haven't looked at the audio section yet but we have play rub and buzz sound test. That sounds dirty. I don't know how loud or annoying this is gonna get. I don't know if it's gonna override my volume control but let's do it anyway. (LOUD AF BEEPS!!!) Yes. Okay. Oh wait. Three, four (upbeat music) one, two, three, four. This is just like some guy in GarageBand. So now we will move on to Phoenix which seems to be the recurring word throughout this whole mysterious system. PhoenixCE kinda looks like iTunes, more probing. We can start this thing from scratch. So let's go ahead and do that. Rework begin. And go to test process. And now it's gonna run a bunch of commands here. There it goes. So now it's rebooting for something that it wanted to do. It did say exit type restart. So I'm guessing it's doing this on purpose and now the back leg kicks in. Of course it does. So it rebooted, it didn't automatically relaunch Phoenix. So I did that myself and it looks like it's doing some probing, a lot of probing today. Most of it, I don't fully understand, but I'm sure some of you guys know what some of this stuff is. Oh, please re-plug the ethernet cable. So we won't do that. We're not online anyway. It's a nice like semi translucent window. And we have these little shortcuts here. I guess C for continue there. Oh no. Now it's it's asking me again, but in purple. (chuckles) Continue. No site found, F fail, three exclamation marks press F to fail. (laughs) If I usually like to see if I can find out more information about apps through help and I just get this nice message unable to open Phoenix CE help. But it does say it should be located here so we can take this little path, copy that go to the finder, shift command G, paste it in there. And bada bing. We have release notes for Phoenix CE. Nothing really super useful here to me. I don't fully understand a lot of this stuff but it is cool to see that. Note, this was built on 1057, which was Leopard. We're running ten six, which is Snow Leopard. So it's just kind of cool to see some of these notes in here. All right, hold up a sec. We found a couple other fun tools that I haven't seen yet. So in the indie folder, in the root there's a tools folder which is different than the literally other tools folder. So if we go into here, this is a pretty nifty application. The audio analyzer plus, but you can see, we have wave forms for testing out the responsiveness of the microphone which I thought was really cool. So right now with the controls in time domain we can go to frequency domain and we have more of a spectral frequency analyzer and oh, okay, the window doesn't resize. Well, well, we'll fix that in the next update. And another cool one is SMC platform console. I'm not really sure what all of these descriptions and values mean. I'm sure some of these have to do with Celsius and temperatures of certain thermal sensors but the units say cooked and raw which don't know if we're making steaks or what but that is, that's pretty cool. And speaking of cooked and raw and temperatures we have the fans, we have the minimum RPM max, what it's actually at right now. And you can also force it to go to a certain speed. And another thing Brainiac Brent pointed out here, and again there's that K22 thing popping up again is that you actually get reports of the voltage and the voltage rails inside this log window. So lots of granular information but that makes sense for diagnostic tools. There's a lot of cool applications in here and it would take forever to go through all of them but just believe me when I say there's some cool stuff. And again, if anybody knows more about some of the stuff we looked at, feel free to leave a comment, 'cause I am curious. You know if you're allowed to say, you know if you're working for Apple or something, you know you don't have to say anything but this was a really fun system to tinker with. And guys feel free to subscribe for more tech episodes coming out every week. I love doing episodes about rare and retro tech new tech and of course scam tech. And Hey, if you like this episode, you know what to do. Thanks and I'll see you next time. Catch the crazy and pass it out. (upbeat music) (chime rings)",
    "transcript_keywords": [
        "Apple",
        "system",
        "file system",
        "Phoenix",
        "power supply",
        "display",
        "thing",
        "Apple KFS",
        "stuff",
        "Phoenix Team",
        "power",
        "cool",
        "Snow Leopard",
        "things",
        "file",
        "back",
        "hard drive",
        "work",
        "KFS",
        "Apple internal things"
    ],
    "transcript_entity_values": [
        "10.6",
        "T9",
        "February",
        "a Pro Tech Toolkit",
        "21.5-inch",
        "two",
        "PVT",
        "HS",
        "six",
        "2",
        "2006",
        "T10",
        "ATI Radeon HD 4670",
        "Mactracker",
        "four",
        "one",
        "Phoenix",
        "DTI",
        "1.9 terabytes",
        "Twitter",
        "27-inch",
        "GarageBand",
        "10.6.1",
        "aurora",
        "IRIX",
        "Three",
        "F",
        "Apple",
        "Instagram",
        "WebObjects",
        "BTR",
        "max",
        "IP",
        "Phoenix",
        "Brent",
        "Mac",
        "EMC",
        "AC",
        "K23",
        "first",
        "nice $1,300",
        "Pro Tech Toolkits",
        "iMac",
        "66",
        "iTunes",
        "Kentucky",
        "MaxDisk",
        "Phoenix CE",
        "S2",
        "sec",
        "three",
        "Macs",
        "Phoenix Team",
        "Toggle",
        "zero",
        "eight",
        "Snow Leopard",
        "LogMonster",
        "iTunes",
        "DIY",
        "Ops Technology",
        "CE",
        "iPad",
        "Zero",
        "today",
        "YouTube",
        "Krazy Ken",
        "WW Ops Technology",
        "Last day",
        "BSD",
        "DC",
        "KFS",
        "Twitter",
        "Brandy",
        "CTS",
        "iMacs",
        "iTest",
        "MT Viewer",
        "every week",
        "a hundred percent",
        "ten",
        "Mac",
        "February 28th",
        "iFixit",
        "1057",
        "three exclamation marks",
        "iMac",
        "2001",
        "One",
        "BBC",
        "Brainiac Brent",
        "SMC"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG"
    ]
}