{
    "id": "YBkqBMVbtOs",
    "title": "Magic Oven! Breakfast in the Brava 🍳",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-11-27T20:25:11Z",
    "video_url": "https://www.youtube.com/watch?v=YBkqBMVbtOs",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "brava",
        "breakfast",
        "how to use a brava",
        "what is a brava",
        "how to use brava",
        "brava recipe",
        "brava breakfast",
        "how to make breafkast",
        "kitchen tech",
        "technology in the kitchen",
        "cooking tech",
        "cooking technology",
        "smart oven"
    ],
    "views": 153514,
    "likes": 6531,
    "comments_count": 530,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today we are in the kitchen, and we are cooking something with this oven, right here. Not this one. This one. This is the Brava Oven. And I've made a video about this before, and I've talked about it so many times on my Instagram and Twitter. I love this thing and I'm not a huge fan of cooking, but this thing makes cooking super simple. And it also cooks with infrared light. So it cooks very quickly, efficiently, and it has all of these recipes, and you can connect it to your phone. There's a camera in it. I can watch my food cook. I find my recipes on my phone. I make them and I put them in the oven. I push the button and that's basically it. My meal is cooked. But today we're gonna be making one of my custom cooks. They have this option in here where you're able to take some recipes that Brava already has in their system. You can make various custom cooks. So basically, you can become a chef. You can share your recipes with the Brava community. And today I'm gonna make you one of my favorite breakfast meals. So I just made my own custom cook. There's so many different options of things that you can do. They have a whole list here. So you can search for your food by the photos, or you can click search and you can basically search for anything that you wanna make. But today, we are gonna be doing the custom cook, but I've already made mine, so this is ijustine's Breakfast Bowl. This tells you that we need the metal tray. We're keeping it on the top. Let's do it. First step. We need our frozen breakfast sausage. Frozen sausage, where are you? In the freezer. It's where it is. Do we want chicken and sage, or do we want savory turkey? I have a problem. I really, really like frozen sausage. But there's nothing that I hate more when I go in to the freezer and I don't have my frozen sausage. I think that I'm just gonna do the savory turkey, because this doesn't have any added flavors or anything. It's just, you know, kind of basic, 'cause we're gonna add our own flavoring. So I would say depending on how many people you're making this for, I'm making four servings, but four servings, I feel like is actually for two people. So that's just my appetite. Custom cook, ready to go. See you soon. There's my little sausages. They're, oh my gosh. Look, you can see them. I wonder if I could do an HDMI out and do a live stream of this. So while the sausages are cooking, I'm gonna start working on my breakfast potatoes. So for those, I'm gonna be just using the Brava recipe. So I'm gonna need potatoes, some onions, and a pepper. It said a red pepper, but I couldn't get a red pepper in two hours on the internet to be delivered immediately. So, we're gonna do a green pepper. The recipe called for paprika. I've never used this in my life, but today, we are. What are you? Am I gonna like this, do you think? Oh, oh, look! The best part about all of this is I can see my meat cooking. Look, those are our sausages. They're being cooked. (playful music) That looks nice. I was on \"Chopped\" once. Don't you forget it! When they asked if I had my own knives, I was like, wait, you guys don't have any? They're like, well, a lot of our chefs, you know, they have like their special knives. And I was like, I got mine from the internet. Do you think I've got special knives? I don't. Now we're gonna slice up our onion, more or less to taste. Looking good! Before we started, Tyler was teaching me to cut an onion. So we'll see if I will make him proud or not. Or if he's cringing behind camera. He's cringing. Doing it. We're slicing and dicing. I have a lot. We don't need that much. You guys are getting a real treat today, 'cause normally I use frozen potatoes. Who's ready for some home fries now? This is gonna be my third breakfast today. I just want it to be known. It's really, it's stuck on there. Oh, I just. - [Tyler] Sticky pato. - Very. Sticky pato. Now that word's gonna be stuck in my head. Sticky pato. - [Tyler] Sticky pato. - Sticky pato We have got sticky patoes all up in this joint. Oh, yes, our sausages. Okay, so I'm gonna chop up these sausages while the potatoes are cooking and then I'm gonna put the sausages back in when we do the eggs. The one thing that is nice is this top of the oven is actually heat resistant. So you can put hot pans on it. Let's toss these in some olive oil and some salt and the paprika. Do you like onions? - [Tyler] Hmm-hmm. - Okay. I think we'll do all the peppers though. 'Cause those are nice. Oh, is that too much? These are some sea salt flakes. You don't even know about that. Usually my frozen version, it's already seasoned and everything, but this is, this is the way to do it. Our pan is fully covered with our potatoes and peppers and onions. And now we're gonna roast these up as step two. In you go. Let's do it. Our breakfast patoes are cooking up. I was trying to find a smaller cutting board, but this was the smallest that I could find. A sticky pato. Getting those patoes not so sticky. I'm gonna watch my potatoes while I cut the sausage. Also I have an herb garden, so I'm gonna put some fresh herbs in this. Oh boy. The last step is here. Can we just? Look at this. This is gonna be fun because now I'm gonna make little nests here and I'm gonna put the eggs in and they're just gonna kind of like do their thing, and they're gonna get all fried up. And we're gonna have a delicious breakfast. I'm calling these a little egg nest. Put the sausages back on. So back in the oven we go for our final cook. I should start getting my fresh herbs ready. Oh, my harvest. That smells so good. These look done. I'm just going to let it stay warm. Jenna's here! - Something smells delightful! - Uh, yes, my fresh harvest. Look at this, fresh. The big reveal. The big reveal. It's here! Can you just take a look at that? Tyler is salivating over there. - [Jenna] Are those potatoes? - Yes. Our masterpiece. Guys, I'm taking my photo for the recipe. That looks absolutely incredible. Can you? I just wanna say I'm so happy with my performance. Do I want one serving? I want two servings? Little bit of salt. We have made food. So here's my finished breakfast bowl. I'm so excited to eat this, but one of the things that I love so much about these recipes is if you want to swap something out. So if you wanna use bacon instead of sausage, or if you wanna use some sort of meat substitute, that is also okay as well. I'll put a link in the description if you wanna learn more about the Brava Oven and everything else that it has to offer, and it's constantly being updated. Tyler, would you like the big boy two servings? Okay. That sounds good. Oh, look at that. Oh, man. Potatoes, sausage and egg. Like, what is better? Nothing. And my fresh herbs. I'm sorry, Jenna, I didn't make a meatless version for you. - [Jenna] It's okay. - This is so good. I'm gonna go eat in private. (calm music)",
    "transcript_keywords": [
        "breakfast",
        "sausage",
        "sausages",
        "Brava",
        "Sticky pato",
        "Sticky",
        "make",
        "today",
        "potatoes",
        "Brava Oven",
        "Justine",
        "oven",
        "cooking",
        "put",
        "cook",
        "frozen",
        "custom cook",
        "Frozen sausage",
        "pato",
        "recipes"
    ],
    "transcript_entity_values": [
        "the Brava Oven",
        "Tyler",
        "Breakfast Bowl",
        "Instagram",
        "Brava",
        "one",
        "third",
        "Brava",
        "the Brava Oven",
        "two hours",
        "Twitter",
        "today",
        "Justine",
        "two",
        "Jenna",
        "First",
        "four"
    ],
    "transcript_entity_types": [
        "FAC",
        "PERSON",
        "EVENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "NORP",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "CARDINAL"
    ]
}