{
    "id": "YBTARvcFZ1A",
    "title": "I Bought 10 Weird Keyboards from AliExpress",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-06-25T18:05:19Z",
    "video_url": "https://www.youtube.com/watch?v=YBTARvcFZ1A",
    "category": "Science & Technology",
    "tags": [
        "alliexpress",
        "aliexpres",
        "ali express",
        "keyboard",
        "knockoff keyboards",
        "cheap ali keyboard",
        "cheap keyboard",
        "good keyboard ali express",
        "mechanical keybarods",
        "mechanical keyboard",
        "cherry mx",
        "keyboard roundup",
        "ali espress keyboard roundup",
        "alibaba keyboard roundup"
    ],
    "views": 3178116,
    "likes": 86943,
    "comments_count": 2594,
    "description": "Checkout iFixit's toolkits at:   Have you ever wanted to buy a bunch of the strangest keyboards you find on AliExpress just to try them out? Well now you dont have to! From lasers to screens, weve got 'em all.  Discuss on the forum:   Buy a \"Waterproof\" Roll Up Silica Gel Keyboard on AliExpress:  Buy a DOQO Wired Keyboard with Expansion Dock on AliExpress:  Buy a H18+ Wireless Mini Keyboard & Air Mouse on AliExpress:  Buy a Foldable Wireless Bluetooth Keyboard with Touchpad on AliExpress:  Buy a Wireless Virtual Projector Keyboard on AliExpress:  Buy a Wireless RGB Macropad with 2 Knobs:  Buy a Transparent RGB Wireless Keyboard with Touchpad:  Buy a XZT G7 Single Hand Gaming Keyboard:  Buy a Machenike KT68 RGB 68 Key Wireless Mechanical Keyboard:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:50 Waterproof Rollable 2:33 DOQO Wired Keyboard etc. 4:37 H18+ 6:34 Foldable Pocket 9:49 Laser Keyboard 13:07 Typewriter Macropad 15:18 Tablet Keyboard 18:25 \"45% Layout\" 20:54 Machenike KT68 24:36 Outro",
    "description_links": [
        "https://www.iFixit.com/LTT",
        "https://linustechtips.com/topic/1515487-i-bought-10-weird-keyboards-from-aliexpress/",
        "https://lmg.gg/PIKCV",
        "https://lmg.gg/m8JNP",
        "https://lmg.gg/UYXMG",
        "https://lmg.gg/iFhME",
        "https://lmg.gg/eDWLG",
        "https://lmg.gg/Gyv9O",
        "https://lmg.gg/JvtFC",
        "https://lmg.gg/GpV59",
        "https://lmg.gg/Zr11I",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "You've seen one keyboard, you've seen them all, right? Ha ha, wrong. We spent hours combing AliExpress for the coolest, wackiest finger candy that we could find. And well, we ordered all of them. How is this even a keyboard? Got this foldable to match my phone. Wow, I've got a fricking laser keyboard, whatever that means. But aside from the meme boards, some of these cost serious bucks. So they better at least be, you know, good enough that... What the heck? Oh, I get it. This one is supposed to be waterproof and silent. It's all over my lap. And only $13 and 50 cents. Wow, that's less than the price of this towel from lttstore.com that I'm using to clean up the mess. One moment, please. Portable, durable, and comfortable, they say. And 4.7 stars with 59 sold and 15 reviews. Wow, that's actually pretty promising. Oh my God, this is so much worse than I could have possibly anticipated. I mean, I thought you were just being a diva. Plouffe was the one who prepped this. So if it's not a $400 mechanical keyboard, it's basically shit, but wow. David, do you have a close enough up view to see how when I press one key, the entire keyboard domes up? Can you see it shifting way up here? No, backspace, come on! Come on, you have to work! Fine. Oh my God. 65 words per minute, 85% accuracy. I blame the non-functioning backspace. Okay, maybe I just gotta shake out the water. To their credit, everything they claim is basically true. It does roll, it does appear to be waterproof, and it is silent and comfortable. Okay, hold on, we're gonna try one more time. Last time, last time, I swear to God. It is not working. That's gonna be a nay, goes in the pile. Oh, nay, like this seg nay to our sponsor. Oh, no. iFixit, celebrate iFixit's 20th anniversary and grab yourself a ProTech toolkit this summer using the link down below. Next, we have the Doqo wired keyboard with expansion dock type C hub USB 3.0 HDMI adapter docking station for iPad, Huawei, Samsung, backlit keyboard. Watch this, this is a good trick. Oh yeah, I was a busboy in another life, PCIe bus. Ooh, I kind of like this. Comes with two little feet so you can adjust the angle if you want. Oh God. Wow, is this waterproofing the keyboard or is this a dust cover? Are you sure? There's only one way to find out. Yeah, it seems pretty waterproof to me. Yeah, all right, all right Doqo. This is an extremely short keyboard cable. Right, it's right in the name. It's a dock. This then goes to my laptop and then my power adapter goes here. This is pretty cool. You've got HDMI out, micro SD, SD and four USB three type A ports. That's way more IO than most laptops have. Oh, oh, one of them is USB two. They got the color coding wrong. Super cool, the card reader works, the power pass through works, the keyboard works, it's not great. All that docking capability plus a hundred watts of pass through for your laptop, aluminum construction, a backlight and okay, yeah, it's over a hundred dollars even when it's on discount but as long as the typing experience is okay. I can't say I'm generally a big fan of round key caps but 114 words per minute, 96% accuracy. For me, that's a very good result. The USB cable is extremely short, but it's mobile focused. They really talk a lot about iPad and using it with your laptop. So I guess I kind of get it. And at least it's thick. You know what, I'm giving this one a yay. Good pile, where's the good pile? Wasn't expecting to have a good pile. Next up is the H18 Plus air mouse mini touch keyboard large. How is this even a keyboard? Two kinds of operation mode, touch mode and keyboard mode. Press this key to switch between the modes. What key do I press to power it? Oh, oh, oh, I think I saw some keyboard there for a second. Whoa, this looks utterly unusable. However, whoa, there's your mouse and oh, yep. Definitely one at a time. Does it have a gyro? Yeah, that's a big fat no. You know, as a weekly user of a very similar product from Sadeco that has a little keyboard and then as a gyroscopic mouse, I gotta say, I don't like this. Having to choose between having a touchpad at all and having a keyboard at all is a real bummer. Hello world. I was trying to put my finger on what's so off about this. It's an ortho linear layout, bleh. No offense, no offense if you love ortho. The notes say, don't know what you'd use this for, but whether it's a media PC, an Nvidia Shield, Apple TV, having something like this kicking around so that you can enter passwords and things like that can be an absolute godsend. And it's a relatively small investment at 20 bucks on sale. 22 words per minute. Nice. I'd say the main benefit is just that if you need to enter special characters for passwords, this is gonna be a little faster than using your game controller or your TV remote. I am really excited about this next one though. The foldable Bluetooth wireless keyboard with touchpad ultra slim pocket folding keyboard. Wow. As advertised, she folds, she unfolds and she's got a keyboard and a touchpad. I wouldn't mind if the height was the same across the board. Is there any reason it's not? It just kind of has funky hinges. I think it's just because of this kind of faux leather texture on the back of it. Includes a carrying case. Ooh, this along with these cleaning brushes are apparently a bonus for being among the first 30 orders. Yep, that's a makeup brush. This is obviously just a charging cable. It's type C though. That's pretty nice. Wanna see if it just works over a wire because sometimes Bluetooth devices do not. There's a lot to like here. Multi-device connectivity, gesture compatibility on the touchpad, the inclusion of a full number pad. I'm not a huge fan of the fact that it doesn't appear to connect over a wire. It only charges over a wire, but hopefully it's a pretty quick pairing process. Let's just see. Let's see. Wait, how do you turn it on? Oh, there should be a switch on the side. Oh, okay, we figured this out. We figured out the problem. Aside from being plugged in, hold on. I bet it just starts working too. Here we go. You have to power it on. No, it only communicates over Bluetooth, but we actually have a chance of that working now. Cool, we're in pairing mode. Yeah, Bluetooth people. Here we go. I believe. Yes, Bluetooth is not the best connectivity standard for a track pad. That's a little leggy. And now that I look a little closer at the keyboard, there's some neat functions here. Like the fact that you can switch between iOS and Mac and Android and Windows mode, including the functions of the F keys, but the layout is a little funky. Yeah, you got this numpad over here, which is great, but you're also gonna be way off centered and they've crammed all of the alpha keys into a very small space. Ooh, that T is cut off and V. Ew, that V. Ooh, okay. Okay, 88 words per minute with 90% accuracy. I mean, considering that this is just for blasting out a quick memo when you're on the go on your iPad or something like that, I kinda like it, especially for $33. It'd be nice if it automatically turned off or went into standby instead of having a physical rocker switch, but it gets over 30 hours of battery and takes just an hour and a half to charge, so at least it's a quick problem to remedy. You know what? I'm giving this a yay. Of course, at double the size of my phone, that's still pretty big, and why carry that around when I could use a laser projection keyboard? I've been aware of these for quite some time, but I have never had the pleasure, or from what I've heard, displeasure of actually using one. Let's see how this goes. It's got micro B for charging, power button, one of those little strap pass-throughs, because what? You're gonna carry this on your wrist, I guess. Oh, a warning, because it's a laser. All right. So, oh. Okay, it just starts immediately blasting out laser, so that's good. If you're not familiar with these, the way they work is they have a depth sensing camera of some sort, and then they have just a laser projector so that you can type like right on any flat surface in front of you. I don't see how to pair it. Oh, oh, sorry. What did you pair it with before? You know what? I think it's on my key type. I can try. Yeah, it's paired to my laptop. Oh, okay, way to go, Poof. Yeah, if you disconnected, it should automatically go into pairing mode according to the instructions. In the meantime, we can have a look at the product page for this. Superior durability, that makes sense. No moving parts, lithium-ion battery, compatible with iOS 4, Android 2.1, Windows XP and above. I mean, to be clear, they're probably not wrong. It's just that whenever you see such old operating systems on a product page, kind of makes you question how current the design is. This is interesting though. Am I able to move the keyboard or shrink and grow it? I'm gonna try to do something with it. Hello world. Holy crap, it actually works. I don't have a semi-colon. Okay, so my home row is here, which puts my space bar way over to the left. What the devil is this diagonal arrow? Do you know the answers to these questions? What does diagonal arrow? Oh, it's dim now. I am kknet try ti thch yooe. I was trying to type, I am trying to touch type. We got real close, real close. I'm pretty sure I already know the answer to this one, but let's go ahead and do the typing test anyway. Whoa, I'm touch typing. Oh, 22 words per minute. Accuracy, 91%. At 32 bucks, I mean, I could see picking it up just for a party trick, but beyond that, I'm sorry, but this is an A. How is this a keyboard? Bluetooth compatible wireless RGB mechanical keyboard with two knobs, small gaming keyboard. It's adorable. I mean, it's really cute. Wait, okay, shut up. This has a hot swappable key switches. I can't tell what this is. Is this for enthusiasts or children? It uses type C, it's pretty modern. This actually feels like a reasonable quality, like braided cable connection mode. Wow, it does Bluetooth as well. Question, why can't I open the setup software after downloading it? Answer, check whether the antivirus software is intercepted. Set it as a trusted file to run it. Oh God. Well, if our channel gets hijacked again, you'll know why. There's a red light here that seems to stay on regardless of the position of the switch. Yes, let's start at the left. ABCDEF. A-B-C-D-E-F. Okay, what about this one? ABCDEF. Whoa! Okay, one, three, six, four. One, two, three, five, four, damn. I've been informed I'm not expected to do a typing test on this, which is good. It's just intended to be a macro pad. This switch flips between the three layers, which have to be programmed using their software. How safe that software is, I have absolutely no idea, but it claims 20 days of battery life and allows you to connect either via Bluetooth or via a wire. It's certainly cute. The build quality is a solid okay. It's gotta be a nay because it uses this like random weird software. This one I have really high hopes for. This looks sick. Yeah, it's a tablet keyboard, 28 bucks. They've sold a whopping 13. Some of these sales numbers, I really gotta wonder. How sustainable is it to do the tooling for these things? That costs money. Anyway, the point is it has RGB, which I'm not sure how to use, but I'm sure I'll figure out at some point. Oh, it didn't include a USB-C cable. Oh, there's the power switch though. Okay, power switch. Ooh, yes! Okay, that's pretty sick. Chiclet style keys, all the F shortcut keys that you would expect for an iPad or something like that. Okay, how do we pair though? Oh, connect. Yes, function C. Hey, it's flashing. All right, I've got it. Wow, it is not very great to type on. I love that the battery looks like this. It worked, ooh, wow, that is shockingly laggy. Wow, this made the previous Bluetooth look amazing. You match the scenery. Hey, hey, all right. You know how the top-end mice these days will use greater than a thousand hertz polling for blah, blah, smooth, et cetera, okay. 10 hertz? All right, it doesn't bode well for typing accuracy if that's the polling rate. Let's give it a shot. What the hell just happened? It opened my inbox. One moment, please. Holy. I just hit 120 words per minute with 97% accuracy on this piece of. That's the best you've done so far. The track pad is nigh unusable, but has a keyboard. I can't argue with the results here. Am I even that fast on the real keyboard on my laptop? Do we need a point of reference here? 112, 94% accuracy. I was having some focus issues there, not gonna lie, but you can't deny the results here. If the track pad was better, this would be a definite yay just because of how slim it is. I could see for students, this just being absolutely killer. And the layout is, it's compact, but it's not stupid. Everything's kind of where it's supposed to be. You're not gonna be fumbling for the backspace or shift or anything critical like that. Oh, for only keyboard use. I can't deny the results. All right, it's a yay. I doubt the same thing is gonna happen here though. This appears to be an attempt at making a gaming pad, but all they've really done is hack off most of a keyboard. I don't see the point. I love your notes for this one. How the F is this ultra slim? Yeah, there's nothing slim about this at all. This is a full height, like mechanical ass keyboard, except it's not even a mechanical keyboard. It's a membrane keyboard. Did you lift up any of the key caps? They just sprayed it. They just sprayed the whole thing black with the key caps installed. There's overspray everywhere. This legend is gonna come off immediately. This is a cheap piece of crap. Is it at least cheap? It's $4 and 64 cents. Well, I mean, that's something, especially with a backlight. Although I shouldn't be that impressed because it's basically a third the price of a cheap RGB membrane keyboard. And it's a third of a cheap RGB membrane keyboard. This is what they were going for. You know, with ergonomic improvements and a D-pad and you know, a gaming pad, right? But this is what they ended up with. You know, wait, I'm about to justify the existence of this thing. With a 10 keyless, you end up in a more ergonomic, no, stop, stop face palming. Okay, no, I'm serious, I'm serious though. If you are a low sensitivity gamer and you don't want to use a gaming pad, you just wanna use a regular old keyboard, that's a lot of extra mousing space. I mean, this is a piece of crap, but I could see something like this having a reason to exist. Yeah, I could at least use a couple more of these. Like maybe give me one more, you know? One more column here. You know what? It's a nay, but it's a potential for yay if it was a little better. And I'm gonna do the typing test. Oh crap, that one I could have typed, damn it. But I have no backspace. Zero words per minute, 0% accuracy, and you're outta here. Bringing us to the Machenike, probably the most ordinary mechanical keyboard of the lot, except that we wanted to get an idea of what a $250 mechanical keyboard on AliExpress might look like, even if it's on sale for $117. You know what though? I can't fault their style. That actually looks pretty cool. It includes a dongle with a type C cable adapter for 2.4 gigahertz functionality. It also connects via Bluetooth. It has whatever the devil this is. Okay, we're gonna have to figure that out. It includes both a key cap and key switch puller. No way, does this have hot swappable key switches? Okay, that's pretty cool at this price point. Yes, yes it does. These are very cheap switches. What the hell is G-Rule? Backlight, RGB backlighting? Am I just out of touch with the keyboard scene or does this actually seem kinda not that bad? Yeah, at 250, obviously it's totally out to lunch, but this is clearly regularly discounted. Injection molded PBT? Yeah, they feel really good. I'm kinda liking this thing. Oh, they have some really cool color schemes too. Why did you pick the green and yellow one? What the heck, Plouffe? And it's wireless and it's as cool as you are. Oh, I figured out what toggle bar does. I wouldn't be surprised if it's programmable in some way, but it goes to desktop. It's the, no, I'm actually not... Mom, don't worry about that. There's nothing on my screen button. Per key RGB, giant 4,000 milliamp power battery. Yes, confirms that the toggle bar can be configured to things like pause, play, skip, brightness, volume, realistically anything you want. Hopefully you don't need their software for that. Ooh, I like this volume knob though. Of course, it all comes down to monkey type though. 116, 95% accuracy. Yep, it's a mechanical keyboard all right. Posting one of the best results. And look at this, I didn't even notice the back. This thing looks freaking cool. With that said, the labs did take a quick look at this one because given that it was one of the best performers, we were kind of thinking, oh, this thing could end up with a recommendation. Is there anything that we're not noticing? And they did notice that the input latency is all over the place. Anywhere from 10 to 30 milliseconds on wired and 20 to 40 on wireless, which is pretty unusual for a keyboard of this caliber. They actually asked for it back to do even more testing. Maybe we'll have a comment pinned with some more thoughts. And you know what else we're gonna have down below the video? Is a link to our sponsor. iFixit, iFixit wants to help you repair or upgrade everything from your phone to your home appliances. Their ProTech kit has 64 steel bits and the popular steel blade Jimmy for precise prying. The kit also includes suction cups, a driver extension, anti-static wrist straps, and more. And everything is covered by iFixit's lifetime warranty. So don't wait, save time and money and repair your own electronics using any of iFixit's over 70,000 detailed step-by-step guides. They've even got photos. You can celebrate iFixit's 20th anniversary at iFixit.com slash LTT or at the link down below. If you guys enjoyed this video, we'll have all these keyboards linked down below and we'll also have a link to the video where we bought a game console full of pirated games on AliExpress. As always guys, even though credit cards can have their downsides, I would recommend having the cash on hand and using a credit card when you buy from sites like AliExpress. We ordered a total of 15 and nine ended up showing up. So it's nice to have features like chargeback to ensure that you do actually get the thing you paid for, whether it's a piece of junk or whether it's actually kind of cool like this one.",
    "transcript_keywords": [
        "keyboard",
        "mechanical keyboard",
        "yeah",
        "Bluetooth",
        "key",
        "pretty",
        "kind",
        "type",
        "Wow",
        "RGB membrane keyboard",
        "good",
        "words per minute",
        "switch",
        "cool",
        "accuracy",
        "RGB",
        "God",
        "power",
        "Bluetooth wireless keyboard",
        "pad"
    ],
    "transcript_entity_values": [
        "one",
        "13",
        "15 and nine",
        "112",
        "a third",
        "One",
        "USB-C",
        "RGB",
        "iPad",
        "Doqo",
        "120",
        "Bluetooth",
        "400",
        "64",
        "weekly",
        "LTT",
        "three",
        "0%",
        "a hundred watts",
        "ProTech",
        "20 to 40",
        "only one",
        "Windows XP",
        "ProTech",
        "94%",
        "Jimmy",
        "iFixit",
        "32 bucks",
        "only $13",
        "96%",
        "first",
        "20 days",
        "50 cents",
        "over a hundred dollars",
        "2.4 gigahertz",
        "AliExpress",
        "ti thch",
        "117",
        "Mac",
        "114",
        "88",
        "hours",
        "iOS 4",
        "Poof",
        "six",
        "Machenike",
        "third",
        "4.7",
        "22",
        "20 bucks",
        "Samsung",
        "H18 Plus",
        "64 cents",
        "over 70,000",
        "four",
        "116",
        "65",
        "90%",
        "SD",
        "seg",
        "V. Ew",
        "iFixit.com",
        "28 bucks",
        "iOS",
        "4",
        "two little feet",
        "David",
        "five",
        "91%",
        "just an hour and a half",
        "10",
        "Doqo",
        "this summer",
        "Apple TV",
        "30",
        "250",
        "30 hours",
        "15",
        "2.1",
        "59",
        "HDMI",
        "10 to 30 milliseconds",
        "Sadeco",
        "95%",
        "two",
        "these days",
        "Android",
        "gyroscopic",
        "250",
        "F",
        "second",
        "Two",
        "Huawei",
        "4,000 milliamp",
        "97%",
        "micro SD",
        "33",
        "10 hertz",
        "Plouffe",
        "Nvidia Shield",
        "85%",
        "USB",
        "20th",
        "IO",
        "Zero"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "MONEY",
        "MONEY",
        "PERCENT",
        "ORDINAL",
        "DATE",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "LAW",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "GPE",
        "CARDINAL"
    ]
}