{
    "id": "yBxtLTAGkZM",
    "title": "Is this too XTREME??? - AORUS RTX 3080 XTREME 10G Video Card",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-11-15T20:59:33Z",
    "video_url": "https://www.youtube.com/watch?v=yBxtLTAGkZM",
    "category": "Science & Technology",
    "tags": [
        "AORUS",
        "NVIDIA",
        "3080",
        "Video Card",
        "Graphics Card",
        "PC",
        "DIY",
        "RTX",
        "Gaming",
        "Cooling",
        "Performance",
        "Linus",
        "Unboxing"
    ],
    "views": 1066894,
    "likes": 39138,
    "comments_count": 2640,
    "description": "Thanks to AORUS for sponsoring this video! Check out their AORUS RTX 3080 XTREME 10G on Amazon (PAID LINK):   While manufacturers like NVIDIA or AMD have their own version of their latest video cards, it doesn't stop partners like AORUS to build their own to offer something different.  Buy G.Skill Trident Z Neo On Amazon (PAID LINK):   On NewEgg (PAID LINK):  On BHPhoto (PAID LINK):   Buy Noctua Chromax CPU Coolers On NewEgg (PAID LINK):   Buy Corsair Power Supplies: On Amazon (PAID LINK):   On NewEgg (PAID LINK):   On BHPhoto (PAID LINK):  On BestBuy (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/e75J",
        "https://geni.us/kfbTaj",
        "https://geni.us/G2N2xJ",
        "https://geni.us/EfX7GB8",
        "https://geni.us/q7AHH",
        "https://geni.us/mf6c",
        "https://geni.us/a0YRgZ",
        "https://geni.us/Do7Y",
        "https://geni.us/Ut4XF",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- This unboxing is brought to you by AORUS. This is the AORIS XTREME GeForce RTX 3080. And it promises to, (lid falls) not fall out of the box, if I do that. Sorry, that came off a little bit, there. This is one of the most overbuilt 3080's out there. And it features what they're calling Max-Coverage Cooling. (plastic rustles) I promise, it's gonna be worth the effort. (laughs) I get such a kick out of how freakin' heavy these 3,000 series cards are. (plastic rustles) Now, other board makers, they've gone out and they've done triple slot coolers. But AORIS, they said, \"No! Four slots is the right amount for the RTX 3080.\" You hear that sound in the background? That's the engine revving. Actually, there's construction going on in our office, right now. And we can't delay them, or it's not gonna be done before the end of the year. Let's peel this puppy. (plastic peels) She's a thick boy, all right. - [Jono] Looks like a 3090. - [Linus] Jebus. Well, you know they have the same GPU, right? - [Jono] Yep. - So, overclocking the snot out of a 3080 means you pretty much need a 3090 class cooling solution. There's some other accessories in here. Let's have a, let's take a minute here, though. All right, what all we got in here? All right, fancy case badge. Whoops. And whatever this guys is. Ca-caw! - [Jono] Is that Batman? - I think it's somewhere in between Batman, Birdperson and some kind of, what's that Pokemon, with the bone? - [Jono] Oh, Cubone. - Ca-caw. Oh, I fell down. This is actually not bad. (mouth sounds) Okay, enough of that. Let's have a look at the card. This is cool. This isn't even in my talking points. Check this out, Brandon. Now, you can't use all of them simultaneously, because that's a limitation of the Ampere architecture of the GPU. But look at this, three Display Ports and three HDMIs. What that lets you do, is have the upmost in flexibility. You wanna run, you know, three LG C10 48 inch TVs at 120 Hertz? Boom, you're covered! Three HDMI 2.1's. Or if you wanna run three PC displays at high refresh rates, let's say, you know, 1080p 360 Hertz monitors. Boom, you can do that as well, without having to use any adapters. Of course, it uses PCI Express Gen 4. And no NVLink SLI fingers. You have to step up to the RTX 3090 for that. What they do have up here though, is a little toggle switch. So, you can either throw the BIOS in OC mode or silent mode, depending on what kind of a profile you wanna run in. Now, I would imagine that in silent mode, this thing would be pretty freaking silent. They've got three fans, with one of them counter rotating here, in the middle. And what looks like a very silence optimized heat sync. So, it's large, but more importantly than that, you can actually see that the fin spacing is quite a bit less dense than you might see on some of the cards that aren't quite so thick. A less thick fin stack does mean that there's less overall surface area of metal per cubic inch. But what it also means is that it's easier for the air to pass through the heat sync, with less turbulence. That's another interesting thing, here. So, it doesn't quite have the same amount of pass through as Nvidia's design on their Founders Edition, but you can see they are actually leveraging this edge fan, which is fed by five heat pipes, to do a lot little bit of pass through cooling over here, on the side. This card continues the trend of Nvidia's partners not thinking too much of their proprietary 12-pin connector. Although, I guess it's hard to think much of it, when they were probably as surprised by it as anyone else was. So, it uses three 8-pin connectors. And it doesn't look like much right now, 'cause it's just like a black mirror, but this, right here, is a display that can be loaded up with images and GIFs. So, we're gonna throw it onto a bench and try it out real quick, here. I have very high expectations for this cooler. Especially given that it's got a vapor chamber that I didn't even notice before. So, heatpipes feed this entire fin stack, over here. And then, this one over here, actually has a combination. It's got two heatpipes, plus a vapor chamber, handling the GPU and the memory. Which are the hottest components on this board. So, we've got 10 gigs of GDDR6 RAM. Do I have a keyboard and mouse by any chance? - [Jono] Yeah, it's right behind you. - What a boss. - [Jono] You said to get everything prepared. - I say lots of things. - [Jono] You said you wanted a horse, so I gave you a horse. - That's true, you did give me a horse. We went clip clop, that day. Everything's goin' well, so far. Plenty of time for it to not output anything, though. Let me get you guys a better look at the display, there. Not bad. That's pretty sick. This keyboard is really cute, but we might have to switch off of it. Thanks, like, who doesn't need arrows in their daily life? How sick is this desk pad, by the way? Can we just take a moment, to appreciate lttstore.com's fantastic desk pad? Look how gigantic this thing is. Now, let's see how we hold up for coil whine when we're actually stressing the GPU. Huh, actually, not bad. Here, hold on a second. Let me get my mic, here. Is this boom in the shot? (fans blow) Not bad, eh? Dang, it also looks like we're gonna settle in around like, 65 degrees, with this puppy. Not too shabby. All right, AORUS, that plus a four year warranty makes this look like a pretty compelling card. Of course, if you've got the budget for it, versus a more basic one. So, as always, you can check it out at the link in the video description. And as always, you should make sure you are subscribed to ShortCircuit.",
    "transcript_keywords": [
        "AORIS XTREME GeForce",
        "XTREME GeForce RTX",
        "unboxing is brought",
        "AORIS XTREME",
        "GPU",
        "XTREME GeForce",
        "RTX",
        "bad",
        "pretty",
        "GeForce RTX",
        "AORIS",
        "Cooling",
        "Display",
        "card",
        "thing",
        "unboxing",
        "brought",
        "horse",
        "run",
        "silent"
    ],
    "transcript_entity_values": [
        "four year",
        "Three",
        "Dang",
        "Hertz",
        "three",
        "3,000",
        "Linus] Jebus",
        "8",
        "one",
        "AORIS",
        "Ampere",
        "3090",
        "second",
        "Four",
        "1080p 360",
        "3080",
        "65 degrees",
        "3080",
        "the end of the year",
        "AORIS XTREME GeForce",
        "Batman",
        "C10 48 inch",
        "LG",
        "Display Ports",
        "Birdperson",
        "Brandon",
        "10",
        "Nvidia",
        "AORUS",
        "two",
        "120",
        "Pokemon",
        "Max-Coverage Cooling",
        "GPU",
        "fed",
        "GDDR6 RAM",
        "Batman",
        "PCI",
        "12",
        "ShortCircuit",
        "five",
        "a minute",
        "clop"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "NORP",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "PERSON"
    ]
}