{
    "id": "yCAn5PR36RI",
    "title": "Build a Retro Laptop Storage Bin!",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2018-04-03T15:00:08Z",
    "video_url": "https://www.youtube.com/watch?v=yCAn5PR36RI",
    "category": "Science & Technology",
    "tags": [
        "retro",
        "vintage",
        "computer",
        "laptop",
        "notebook",
        "retro computing",
        "storage",
        "PowerBook",
        "ThinkPad",
        "Latitude",
        "Apple",
        "Dell",
        "IBM",
        "Toshiba",
        "Mac OS",
        "Windows",
        "tools",
        "drill",
        "wrench",
        "DIY",
        "do it yourself",
        "make",
        "build",
        "store",
        "hardware",
        "This Does Not Compute"
    ],
    "views": 14501,
    "likes": 1101,
    "comments_count": 99,
    "description": "I have a small collection of retro laptops, but had no good way to store them -- until now.  -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by Lakey Inspired ( and Epidemic Sound ( Intro music by BoxCat Games (",
    "description_links": [
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "http://www.soundcloud.com/lakeyinspired)",
        "http://www.epidemicsound.com).",
        "http://www.box-cat.com)."
    ],
    "transcript": "Hey everyone, it's Colin. How's it goin'? I have a pile of retro laptops, but nowhere to put 'em. So this time, let's build a custom storage bin. [ Music - Intro ] First, I had to pick a storage bin. But before I could do that, I needed to figure out what the dimensions had to be. I took the largest laptop from my collection: a Thinkpad R51, and found that it measured in a bit over 12 inches wide. I went to the store and found a nice bin that met my needs. The lid latches on securely and at $12, it wasn't too expensive. Something to keep in mind is that the dimensions on the label can be misleading. The bin said it was about 16 inches wide, but that's the measurement at the top. The sides slope inwards so the bin can stack, at the bottom, it's just wide enough to fit my ThinkPad, so it might not be a bad idea to bring a tape measure with you to the store. At the home center, I picked up a few bits of hardware. First were some quarter inch by 20 threaded rods. These'll act as dividers in the bin. I also grabbed some matching cap nuts, which are rounded on one end, so there aren't any sharp edges. To keep the hardware from tearing through the sides of the bin, I got a bunch of large fender washers, then headed over the plumbing department for a roll of vinyl tubing. Now I needed to figure out where to drill the holes. I measured the thickness of each of the laptops, then put a quick spreadsheet together to do the math. I marked on the bin the locations where I should drill, using some masking tape to keep the bit from wandering. The upper set of holes were four inches from the top, and the lower set were nine inches. I used a stepbit in my drill, which made quick work of the plastic and left clean holes with no tear out. Then I repeated the process for other side. I temporarily installed one of the threaded rods to figure out where to cut 'em to length. The ones at the top needed to be longer than the ones at the bottom, but I was able to get one of each out of a single 36 inch piece. I taped the rods together in a bundle so that they all ended up the same when I went to cut 'em. I had at it with a dremel and a cutoff wheel, but a simple hacksaw would work just as well. Then it was time to put it all together. I slid the vinyl tubing over each of the dividers, cutting it just a little bit short. Each divider then went into the bin from the inside, starting at the bottom. The tubing keeps the laptops from rubbing against the sharp threads on the dividers, and also acts as a spacer so the sides of the bin won't get pulled in when it's all tightened down. Time for all that hardware I bought. On each side, I put a fender washer, then a cap nut. Using two wrenches, I tightened down both sides of each divider until the tubing compressed just a little. This puts some pressure against the cap nuts and acts a bit like a lock washer. These dividers aren't going anywhere. I found an extra roll of anti-slip mat in the garage. This is the kind of stuff used to line the drawers of toolboxes, but also provides a little bit of cushioning. I cut a couple pieces to fit the bottom of the bin. This wouldn't be enough protection for the laptops on its own if I was planning on carrying the bin around. But since I'm just gonna keep it in the closet, it should be fine. And, that's it! The laptops are stored vertically, so they're not stacked on top of each other, and one can be pulled out without affecting the rest. The best part is that this design is totally customizable. You can use any size bin or any spacing between the dividers, it's totally up to you! In the end, this wasn't that expensive of a project either, maybe $40 or so, and was pretty quick to put together. Hopefully, this inspires you if you've been looking for a way to store something similar. But in the very least, I'm just glad that I was able to get the pile of laptops off my floor. If you like the video, I'd appreciate a thumbs-up and be sure to subscribe. You can follow me on Twitter and Instagram at thisdoesnotcomp, and as always, thanks for watching.",
    "transcript_keywords": [
        "bin",
        "Colin",
        "laptops",
        "storage bin",
        "dividers",
        "bit",
        "put",
        "sides",
        "inches",
        "top",
        "bottom",
        "tubing",
        "inches wide",
        "found",
        "custom storage bin",
        "wide",
        "store",
        "figure",
        "needed",
        "hardware"
    ],
    "transcript_entity_values": [
        "two",
        "Thinkpad",
        "Instagram",
        "Colin",
        "Twitter",
        "about 16 inches",
        "First",
        "12",
        "some quarter inch by",
        "R51",
        "20",
        "ThinkPad",
        "one",
        "nine inches",
        "40",
        "four inches",
        "a single 36 inch",
        "12 inches"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY"
    ]
}