{
    "id": "yDTZ_TsFUR0",
    "title": "Let's Talk About the PS5 and Xbox 2",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-06-14T16:27:19Z",
    "video_url": "https://www.youtube.com/watch?v=yDTZ_TsFUR0",
    "category": "Science & Technology",
    "tags": [
        "ps5",
        "playstation 5",
        "xbox 2",
        "xbox two",
        "e3",
        "e3 2018",
        "xbox",
        "playstation",
        "playstation 5 release date",
        "ps5 release date",
        "ps5 e3 2018",
        "sony",
        "microsoft",
        "gaming",
        "xbox one",
        "ps4",
        "playstation 4",
        "game console",
        "gameplay",
        "austin evans"
    ],
    "views": 1380761,
    "likes": 31278,
    "comments_count": 4759,
    "description": "The Sony PS5 and Microsoft Xbox 2 are starting to pop up at E3 2018 but is it time for next gen game consoles? The Ultimate PlayStation Comparison:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://www.youtube.com/watch?v=16q8_32M03k",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin and today at E3, well we're getting something a little bit different than what I expected. Of course there's the standard booths from Sony, from Microsoft, from Nintendo and there's all the new games that you would expect. What I did not expect is talk about the next generation of consoles. It has been a full five years since the PlayStation 4 and Xbox One were launched here at E3 2013. Now there've been a lot of things that have changed since then. Both consoles have seen a slim revision, we've seen stuff like the PlayStation VR on the Sony side as well as the death of Kinect on the Microsoft side. But really one of the most important changes over the last few years has been the addition of the mid-cycle console refreshes, that's not a great way of putting that but we've got an Xbox One X and a PlayStation 4 Pro now. Now sure there have been improved consoles in the past, stuff like the Sega 32X add on for the Genesis or the Nintendo 64 expansion pack are cool but they don't come anywhere close to this same sort of level of functionality and extra performance that we've gotten out of the One X and the PS4 Pro. That led a lot of people, myself included, to assume that this current generation of consoles that have quite a bit of life left. However, here at E3 the next generation has actually been mentioned a couple times already. It started on Sunday night with the Bethesda conference where they showed off not only one but two brand new IPs that are meant for next gen. So they very briefly teased The Elder Scrolls VI which was really just a tiny, little trailer but more impressively they also talked about Starfield. - We have also been working on a brand new next generation single player game. - Now the trailer for Starfield didn't exactly give us a ton of game play but what it did do is show off a game that as far as I know is going to be meant only for the next generation. So that's actually sort of not really what I was expecting out of this E3, sure there are going to be of course new consoles at some point in the future but the idea the developers are already showing off games that are meant to be running on that means that it can't be that far off. Or can it? Unless Bethesda is in the business of teasing a game that won't be out for four or five years, which I guess I can't actually rule out, odds are we are going to be able to see the next generation consoles in two or three years and that was further backed up by what Microsoft said on stage on their event on Sunday. - [Phil] The same team that delivered unprecedented performance with Xbox One X is deep into architecting the next Xbox consoles. - Now Phil Spencer didn't just say there's going to be a new Xbox, he said that there were going to be new Xboxes, as in like plural. Not only is this going to be a pretty smart marketing move to get people talking about the next generation of Xbox but this combined with the fact that Microsoft is actually purchasing several major studios to sort of juice up the Xbox game development means that they're actually doing a good job of putting a lot of resources, a lot of money, and more importantly a lot of hype behind the next generation. Still though it's really interesting to think that a year ago at E3 they were talking about the Xbox One X and how it was about to come out and now they've already moved on to the next generation. The rumor mill has gone into overdrive since the announcement. So supposedly Microsoft is working on code name Scarlett which is the series of next generation Xboxes. Now what these actually will look like is kind of hard to say but we can take some educated guesses. On the other hand, it seems like Sony is perfectly content to ride out their sales lead with the PlayStation 4 for a little while. So in our recent interview with The Wall Street Journal, the head of PlayStation, John Kodera, was quoted as saying that the next PlayStation is three years away which would put it in 2021. So not exactly around the corner but it is very clear at this point that both Sony and Microsoft are well under way developing the next generation of consoles. The real question is, what do those consoles actually look like? So if you look at the current generation of consoles, they are both based on very, very similar tech. So both the PS4 and Xbox One have an eight core AMD Jaguar based CPU as well as Radeon graphics. Sure there are some key differences. So not only does the PS4 utilize the much faster GDDR5 memory, something that's also shared now with the One X but the PS4 also does have a more powerful GPU. However, at their core they are sharing the exact same AMD based fundamentals. The same holds true for the enhanced versions of the consoles. So both the PS4 Pro and Xbox One X are using very similar layouts but with more memory bandwidth, bigger GPUs and higher clock speeds. So realistically what we're looking at is another x86 processor that is very likely going to be based on AMD tech. So sure there are lots of other options. I'll get into those in just a minute but I think the main take away here is that by sticking with x86, not only do you keep backwards compatibility with previous generation games, something important for both the One and the PS4, but importantly it also makes developers lives much easier when it comes to porting games from the PC. Now backwards compatibility is something that the Xbox already does really well. So not only does the Xbox One support original Xbox games and quite a few Xbox 360 titles but when you bump up to the One X you're actually able to play some of those games in a full 4K which is impressive considering this all happened with emulation. If you have the very, very similar sort of features set and sort of similar hardware in the next generation of consoles, that makes all of this even easier to keep up to date. You can imagine the next generation of Xbox having full backwards compatibility and that being a huge selling point. Sure you can still go buy an Xbox One but why bother when you can play an Xbox Two that will play all of the same games and then some. Right now, the only company that can deliver an experience like this is the same one that did it on the last generation, AMD. So of course they have modern GPU tech and especially in the next couple years you can imagine that you're only going to be able to get access to better and better stuff. But almost more importantly than that, they also have some new high end x86 CPU cores. So with the current generation using the very slow mobile focus Jaguar cores, I can easily imagine a scenario in which the next generation consoles are going to be using AMD Ryzen. Especially if we really are a couple of years away from the next generation of consoles, it's very easy to imagine a full eight core Ryzen CPU set up inside a console APU. There are already some whispers that Ryzen tech is being implemented in the next gen of consoles. So supposedly with the Sony software that they're using on the PS4 and presumably PS5, there is now going to be support for the timings of the first generation Ryzen processors. Now that's cool but it's maybe not the most exciting option. Take one look at the Nintendo Switch and you can see that the next generation can take several forms. Now sure this is not going to be as powerful as something like the PS4 or Xbox One but the portability really does unlock it to be something that is very, very different. Because Nintendo opted for a mobile focus processor with the Nvidia Tegra X1, not only are you going to be getting ARM CPUs which are typically shared with phones and tablets but importantly, you're also still getting a high end solution within video graphics. Again, nothing that's going to be quite as powerful as something like the current generation of consoles but at the end of the day graphics definitely aren't everything. Sure, the Switch delivers a decent chunk of the performance of the current generation consoles at a fraction of the power budget but I don't think that means it's going to be a good fit to go for this approach for the PlayStation 5 as well as the Xbox Two. Not only has Nvidia taken the Tegra line of processors in a much more automotive focused area, mostly because they make a lot of money there but even with a couple years of upgrades and sort of performance improvements, you really can't still expect a mobile processor to come anywhere close to the level of something like the PlayStation 4 Pro or the Xbox One X. Now sure at some point we might see a mobile PlayStation or a mobile Xbox but I don't think that is going to be what the proper next generation of consoles looks like. On the other hand we have Intel. Now sure they do have the CPU technology and they are working on dedicated graphics but that's going to be several years away and it is doubtful that they're going to waste all those resources on trying to put together some bespoke version of a console APU. Now, yes there are lots of possibilities but I think the smart money is definitely on another fully AMD solution for both the PS5 as well as the Xbox Two. I think it's very likely that Sony is telling the truth. Well we'll probably see a glimpse of the PlayStation 5 a little bit earlier, it will likely go on sale in 2021. Microsoft is more exciting. The Xbox has been beaten and beaten badly this generation. Now sure they've made some major strides in the last couple years with stuff like backwards compatibility as well as the Xbox One X but at the end of the day most estimates put the PlayStation 4 out selling the One roughly two to one and that is not easy to overcome. My best bet is we're going to see the next generation of Xbox at the next year's E3. Now that would give us an early look at something that would probably be launching in 2020. A full year ahead of the PlayStation 5 if everything goes according to plan. And by according to plan, I mean the plan that I just totally made up on my head, that is only vaguely substantiated with real rumors and speculation but it sounds good so. So between next gen Ryzen tech and stuff like game streaming which is only going to be more and more popular, I do think there's a lot of interesting stuff that we're going to see over the next couple years for the new consoles. So I'm curious, what do you guys think about what you expect to find in the PlayStation 5 and Xbox Two? Let me know in the comments below and I will catch you in the next one.",
    "transcript_keywords": [
        "Xbox",
        "generation",
        "consoles",
        "generation consoles",
        "Austin and today",
        "generation of consoles",
        "PlayStation",
        "current generation",
        "years",
        "Xbox consoles",
        "Microsoft",
        "Sony",
        "Xbox game",
        "Xbox games",
        "current generation consoles",
        "games",
        "AMD",
        "game",
        "generation of Xbox",
        "Xbox game development"
    ],
    "transcript_entity_values": [
        "Sunday night",
        "the Nintendo Switch",
        "The Wall Street Journal",
        "first",
        "APU",
        "two",
        "2020",
        "AMD",
        "Starfield",
        "Switch",
        "the next year's",
        "Xbox Two",
        "the PS4 Pro",
        "Xbox 360",
        "a year ago",
        "One roughly two",
        "E3 2013",
        "PlayStation 4 Pro",
        "only one",
        "Xboxes",
        "Jaguar",
        "GPU",
        "2021",
        "PlayStation 4 Pro or",
        "the PlayStation 5",
        "the PlayStation 4",
        "Kinect",
        "a full five years",
        "PlayStation 5",
        "Ryzen",
        "John Kodera",
        "PlayStation",
        "Starfield",
        "Bethesda",
        "Xbox",
        "Xbox One",
        "the end of the day",
        "Ryzen CPU",
        "AMD Jaguar",
        "Xbox One X",
        "Nvidia",
        "the last couple years",
        "Genesis",
        "Scarlett",
        "Tegra",
        "the last few years",
        "AMD Ryzen",
        "just a minute",
        "today",
        "Radeon",
        "PS5",
        "Xboxes",
        "AMD",
        "Sunday",
        "eight",
        "A full year ahead",
        "Phil Spencer",
        "Xbox",
        "Sony",
        "Sega",
        "Microsoft",
        "Xbox One",
        "three years",
        "CPU",
        "the PlayStation VR",
        "Phil",
        "One",
        "PlayStation 4",
        "four or five years",
        "The Elder Scrolls VI",
        "two or three years",
        "Nintendo",
        "the next couple years",
        "PS4",
        "GDDR5",
        "a couple years",
        "4",
        "Austin",
        "Bethesda",
        "Intel",
        "several years",
        "a couple of years",
        "E3"
    ],
    "transcript_entity_types": [
        "TIME",
        "FAC",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "GPE",
        "DATE",
        "PRODUCT",
        "NORP",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "FAC",
        "ORG",
        "DATE",
        "NORP",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "GPE",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "ORG"
    ]
}