{
    "id": "yDwxmF0Kn-Q",
    "title": "Linux and Python on your phone for free in 2 minutes // iPhone or Android",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2022-09-13T14:00:36Z",
    "video_url": "https://www.youtube.com/watch?v=yDwxmF0Kn-Q",
    "category": "People & Blogs",
    "tags": [
        "python",
        "linux",
        "linux iphone",
        "python iphone",
        "linux android",
        "python android",
        "python free iphone",
        "python free android",
        "linux free iphone",
        "linux free android",
        "ish shell",
        "termux",
        "samsung s22",
        "iphone 14",
        "iphone 14 linux"
    ],
    "views": 701022,
    "likes": 20800,
    "comments_count": 773,
    "description": "Install Linux and Python on your iPhone or Android phone for free in 2 minutes!   // MENU // 00:00 - Coming up 00:35 - Intro 00:40 - Getting Linux on an iPhone 02:26 - Python on an iPhone 03:53 - Getting Linux on an Android phone 06:37 - Python on an Android phone 05:55 - Conclusion  // Download links // iSH Shell:  Termux:   // Termux Google Playstore issue // Since November 2, 2020 we no longer able to publish updates of Termux application and add-ons because we are not ready for changes upcoming with SDK level 29 (Android 10). Everyone should move to F-Droid version, if possible:   // David SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // MY STUFF //   // SPONSORS // Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  Apple Android Samsung Python Linux Linux Phone Linux iPhone Linux Android Linux Samsung Python iPhone Python Android Python Samsung termux ish shell  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   Disclaimer: This video is for educational purposes only.   #iphone #linux #python",
    "description_links": [
        "https://apps.apple.com/us/app/ish-shell/id1436902243",
        "https://github.com/termux/termux-app/releases",
        "https://wiki.termux.com/wiki/Termux_Google_Play",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "- In this video I'm gonna show you how to run Linux as well as Python for free on an iPhone, as well as an Android device. In this case, I've got an iPhone and I've got a Samsung S22. I'm gonna show you how to download and install Linux on these two devices and then run Python. This gives you a lot of power. You can practice Linux commands on the go. You can write Python scripts and practice your Python on the go. It's obviously very convenient to take Linux and Python wherever you go. And this is one of those examples. There are many ways to run Python and Linux on devices, but in this example, I'm showing you how to install it for free. Okay, so let's get started. (upbeat music) Okay, so let's start with the iPhone. If you wanna see the Android installation, jump to this timestamp in this video. On the iPhone go to the app store, search for this application, iSH Shell. Download the application. Application is downloaded, click open, and there you go. You've got Linux on your phone. If I type uname-a, and I've sometimes found that it doesn't always work. So I'll just try uname by itself. You can see it's Linux and then uname-a, you can see that we are running Linux on this phone. But let's try some basic Linux commands like pwd. You can see that we root on this phone. If I type cd / pwd, you can see we are in root ls-l. You can see the various folders on the phone. You can see the permissions, et cetera. So, as an example, you can see bin, you can see dev you can see etc, you can see home, et cetera. If I type cd pwd, again you can see we're in root ls-l, or ls-l rather. You can see that there are no folders or files here but I can type mkdir, let say David. And if I do ls again, -l, you can see that the David directory exists. I could go into the pwd... I mean root David sub directory. Okay, but let's go back to the home directory and let's install Python. So apk add python3, you can see it's busy downloading and installing Python on the phone. So I can type python3 and notice I'm running Python. So I could start print, hello, and you can see it says, hello. I've got Python running directly on Linux on an iPhone. Now you can change some of the settings of this application. You could change the appearance to 1, 3, 3, 7 as an example, which you may prefer. So a typical Lenux terminal running on an iPhone. Now you may want to connect an external keyboard to your phone, to make it easier to use. That may be easier, than trying to type like I'm doing in this demonstration. But there you go. I've got Linux running on an iPhone. Didn't have to install anything apart from an app. Alpine Lennox is basically installed here. It's just an app, so I could close it, I could open it up again. So there you go. I've got Linux running on an iPhone. ID shows me that I'm root. Who am I, just shows me that I'm root once again. Not perfect, but a great way to get started. If you wanna learn some basic Linux or you wanna learn Python, you can do it on your phone. Okay, so now let's do it on Android. Go to Samsung, running Android 12 here. First thing you need to do is GitHub. Don't download Termux, from the App Store, there are issues with it. So we're gonna go to GitHub, and we are going to download Termux directly from GitHub. I've put links to that below, and it's also showing on the screen. This is the way you want to do it. I'm gonna download this application anyway, and I'm gonna click open and I'm gonna install Termux. I've put a link to a document below showing you the problems with using Termux through the Play Store. Okay, so there you go. I've got it installed. And if I type uname- a, you can see once again that we are running Linux on this phone. Okay, so just like in Linux, you could do something like apt update to update your references, and then apt upgrade to upgrade your version of Linux. I'm just gonna say yes. Just gonna press enter when prompted. Okay, so you didn't have to do that, but it's better to update your references. And now I'm gonna type package, install Python. If you have problems installing then update your references. Like I did here. In some cases you might not have to do that. Say, yes to continue. And there you go, Python is installed. Let's see if it works. So pyhton3 and there you go. Python is running on the Android phone, so I could type print. Hello world. And there you go, print \"Hello world\" works. I could quit. And now we're back in Linux and you can see that we're running Linux on the phone. Okay, so there you go. I've shown you how to run Linux and Python, on an iPhone and on an Android device you can do a lot more than what I've shown you here. This is just a basic example of how to get it installed and running. I'm thinking of creating a bunch of videos showing you how to use Python, how to use Linux. And I'm hoping that this helps you. If you don't have a computer or you just wanna do this on the go, this is a way that you can run Python and Linux for free on your iPhone or your Android device. Now I'm David Bombal. I really wanna thank you for watching this video. If you enjoyed it, please like it. Please consider subscribing to my YouTube channel and clicking on the bell to get notifications. I wanna wish you all the very best. (upbeat music)",
    "transcript_keywords": [
        "Linux",
        "Python",
        "running Linux",
        "run Python",
        "phone",
        "running",
        "Android",
        "Linux running",
        "iPhone",
        "run Linux",
        "type",
        "Android device",
        "install Python",
        "basic Linux",
        "Linux commands",
        "David",
        "root",
        "Termux",
        "install",
        "run"
    ],
    "transcript_entity_values": [
        "Linux",
        "Samsung",
        "Android",
        "Alpine Lennox",
        "two",
        "Termux",
        "YouTube",
        "iPhone",
        "David",
        "7",
        "Python",
        "Linux",
        "pyhton3",
        "the Play Store",
        "the App Store",
        "Linux",
        "GitHub",
        "Android 12",
        "Python",
        "Lenux",
        "First",
        "1",
        "David Bombal",
        "python3",
        "3"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "GPE",
        "GPE",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "GPE",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "FAC",
        "DATE"
    ]
}