{
    "id": "YePXkA9gF9A",
    "title": "The BEST iPhone XR Accessories!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2018-12-21T05:05:50Z",
    "video_url": "https://www.youtube.com/watch?v=YePXkA9gF9A",
    "category": "Science & Technology",
    "tags": [
        "iphone XR",
        "iphone",
        "iphone x",
        "iphone accessories",
        "apple",
        "iphone r",
        "jonathan morrison",
        "best iphone accessories",
        "iphone cases",
        "iphone x cases",
        "iphone xr cases",
        "iphone speakers",
        "bluetooth speakers",
        "iphone giveaway",
        "iphone cable",
        "iphone gifts",
        "apple gifts"
    ],
    "views": 660340,
    "likes": 15194,
    "comments_count": 2096,
    "description": "Got that fresh iPhone Xr? Yeah, me too. Here's all those young accessories you need to get the most out of it. Start off with that MUST HAVE speaker from Marshall.   You more want gifts? I got those things!      Swoodie-Gang Approved Battery Bank:  More Budget Friendly Model:  That Young USB-C to Lightning Cable (The Magic Sauce):  KODAK PRINTER!  Those Old School/New School Vibes:  Better Less Expensive iPhone Xr Case:  JerryRigEverything Proof Screen Protector:  Charge ALL THE THINGS!:  Charger AirPods Wirelessly?!?:   TLD Behind the Scenes!  Mobile users:   Music via Musicbed (My favorite music for videos)   My Audio Setup & Gear:   Instagram:",
    "description_links": [
        "https://www.marshallheadphones.com/mh_us_en/stanmore-ii-voice-alexa",
        "https://youtu.be/RqnovPrGxvU",
        "https://youtu.be/ZA5mwW8r2gU",
        "https://youtu.be/2e_zYUpwZkw",
        "https://youtu.be/dItCj676GmA",
        "https://amzn.to/2BvG4Ok",
        "https://amzn.to/2R6cpVO",
        "https://amzn.to/2SeG0JQ",
        "https://amzn.to/2RcpTzh",
        "https://amzn.to/2BBsnh0",
        "https://amzn.to/2V2qKSq",
        "https://amzn.to/2V2qKSq",
        "http://bit.ly/2ByiRLk",
        "https://amzn.to/2R9663F",
        "http://bit.ly/TLDBreakdown",
        "https://www.youtube.com/channel/UCDlQwv99CovKafGvxyaiNDA/join",
        "http://share.mscbd.fm/tldtoday",
        "https://youtu.be/v9hu-Avj2oE?list=PLq...",
        "http://www.instagram.com/tldtoday"
    ],
    "transcript": "Today's video is sponsored by Marshall (upbeat music) Yo guys, Johnathan here back with the Holiday Gift Guide centered around at the iPhone XR and honestly most of these apply to the iPhone 10S to 10S Max and even last year's 10, the only difference is I'm giving away a brand new iPhone XR, your choice of the color plus everything featured in today's video and big thanks to Marshall for making that happen. So first up is the Marshall Stanmore 2 which is this beauty sitting right smack behind me and we know, Marshall is known for the iconic sound so sonically this does not disappoint but what's awesome is there is also built-in Amazon Alexa so you are getting twice the goodness. So with 2019 rapidly approaching, ain't nobody got time to control music with their hands. Fortunately with the Amazon Alexa integration you can control everything including your music with your voice. Again though, it's not just limited to music, you have control over your entire smart home, whether you're controlling your lights, your thermostat, maybe running low and how you can order something on Amazon through your speaker. Now what separates this from a sea of Bluetooth speakers, are the looks, so if you're into that classic, vintage rock-and-roll aesthetic, this is perfect. What else I like though, is the instant ability to customize your sound, so if you need more low-end, more bass, just simply turn a dial and you are good to go, it is a beautiful, beautiful thing. So yeah it looks great, it sounds amazing, it gives you smart home control with built-in Amazon Alexa and more than anything, this thing slaps. Next from there, if you whave an iPhone 10 or later and you have not experienced USBC fast charging, you my friends are missing out. So my co2 battery bank is this guy from anchor, but the problem is a little on the pricier side, so I wanted to find something a little more budget-friendly and I think this one from Aukey fits the bill perfectly. This is packing 20 thousand milliamp hours, which is massive but I appreciate the fact that it's slim, it's lightweight and relatively compact, so it doesn't feel like you're carrying a brick in your backpack. Now while this video is specific to the iPhone XR, really any device that rocks USBC is going to benefit from something like this battery bank. If you do own an iPhone though, you will have to pick up a USB-C the lightning cable and I'll link those down below, but yeah if you have not experienced it, it will change how you look at charging your phone. So with iPhone 10 XR cases, there really weren't too many options specifically from Apple, like there was one mysterious case I think just recently came out, but again it's on the pricier side. This one from Nook is built well, it's going to obviously give you more protection, than not wearing a case, but it's not gonna feel overly bulky and the best part about this is that it's only about 13 bucks. What's awesome though is there are 10 different colors to choose from so, no matter what color iPhone 10 XR you have, you have a fantastic chance of finding something that complements it perfectly. Now confession time, I've never really used a screen protector, when in reality I am someone who absolutely needs to use one because somehow I always scratch the crap out of mine. Because I'm dumb. That changes today though, so I picked up this three pack from large plus and we divide that by three, it's a pretty minimal investment to protect something that costs hundreds and hundreds of dollars. Installation was super simple and what I appreciate about these is that they work with the case. If you like that one that I just featured, that is about 20 bucks to really protect your phone, from front to back. Now while the iPhone 10 XR may have gotten a little bit of heat for not being up to flagship standards, in reality it does pack most flagship features, like wireless charging. With that you're going to want a really nice wireless charging solution and this one from Nomad is unique as hell. You can actually charge up to four devices at once, two wirelessly and you have a 7.5 watt USB a port and an 18 watt USB C port which is like super baller. Small things like the ambient light sensor are a really nice touch and I will say it, on the box it shows air pause charging wirelessly and obviously you can't do that yet, unless you find an external solution which I did and cover to my gift by which I'll link to up here and down below. Now the iPhone 10 XR even with these single ends, it has an amazing camera, so chances are you're going to be taking a ton of photos and with something like this mini Kodak printer, it's an awesome way to take those memories and put them in a physical form as opposed to just living on your smartphone. Again like most of these items featured in this video, it is not just limited to the iPhone 10 XR, in fact this will also work with Android phones as well. If you are using an Android phone on top of that you have the added bonus of instant NFC connection. Also in conjunction with the app, you get stickers and filters so it really makes the entire process a lot of fun especially if you're using these for decoration. Now image quality is fantastic, but I will point out, it does add just a little bit of grain, so it does kind of give like that vintage aesthetic tool which some people may like, some people may not, but overall I think it's a great way to spice up something of that, that would otherwise normally be just purely digital. Aside from that, those are my picks on some of the best iPhone 10 XR accessories. Hopefully you guys enjoyed the video, if you did and you are feeling like being awesome, make sure you guys smash that like button. Again big thanks to Marshall for making all this possible. Make sure you check them out, the speaker as well as the giveaway details down below. This is Jonathan and I will catch you guys later.",
    "transcript_keywords": [
        "Holiday Gift Guide",
        "Gift Guide centered",
        "builtin Amazon Alexa",
        "Amazon Alexa",
        "Guide centered",
        "Marshall Stanmore",
        "Marshall",
        "iPhone",
        "Amazon Alexa integration",
        "Holiday Gift",
        "Gift Guide",
        "Amazon",
        "builtin Amazon",
        "Marshall for making",
        "Johnathan",
        "Holiday",
        "Guide",
        "Max",
        "Alexa",
        "Johnathan here back"
    ],
    "transcript_entity_values": [
        "last year's",
        "up to four",
        "two",
        "iPhone",
        "Today",
        "Alexa",
        "USB C",
        "Johnathan",
        "Max",
        "10",
        "only about 13 bucks",
        "hundreds of dollars",
        "Aukey",
        "USB",
        "USBC",
        "Apple",
        "about 20 bucks",
        "Kodak",
        "the Holiday Gift Guide",
        "18 watt",
        "XR",
        "Nook",
        "a ton",
        "NFC",
        "2019",
        "hundreds and",
        "20 thousand milliamp hours",
        "XR",
        "three",
        "first",
        "one",
        "7.5 watt",
        "Amazon",
        "Alexa",
        "today",
        "co2",
        "Android",
        "Nomad",
        "iPhone 10",
        "the Marshall Stanmore 2",
        "Jonathan",
        "Yo",
        "Marshall"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON"
    ]
}