{
    "id": "yEV9MGrxbEU",
    "title": "Aero 15X - An AWESOME Gaming Laptop For Creators",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-04-07T19:53:07Z",
    "video_url": "https://www.youtube.com/watch?v=yEV9MGrxbEU",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "dave lee",
        "review",
        "gaming laptop",
        "coffee lake H",
        "coffee lake gaming laptop",
        "best gaming laptop",
        "best laptop for video editing",
        "video edit laptop",
        "6 core gaming laptop",
        "max-q",
        "msi",
        "msi GS65 Stealth",
        "msi gs65",
        "msi stealth",
        "gigabyte aero 15x",
        "asus gm501",
        "gigabyte",
        "asus",
        "aero 15x",
        "gm501",
        "gigabyte 15x",
        "6 cores",
        "MacBook",
        "MacBook Pro",
        "video editiing",
        "XPS 15",
        "XPS 15 9570",
        "9570"
    ],
    "views": 1049273,
    "likes": 20058,
    "comments_count": 1504,
    "description": "My review of the Gigabyte Aero 15X gaming/workstation laptop with the new generation of 6 core CPUs. This is the best gaming laptop from Gigabyte for creatives! Available Here -   The updated Aero 15X in 2018 is a great addition to Gigabytes lineup. With an all new 8th gen Intel 6-core CPU - the i7-8750H with a 144Hz screen, NVIDIA GTX 1070 Max-Q graphics and a great battery. This is a strong alternative option to the MacBook Pro, Dell XPS 1570 and MSI GS65  Background Music: Fili - Sunday Vibes  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2GJJpL5",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going, Dave2D here. This is the newly updated Gigabyte Aero 15X. It's running the six-core 8750H, combined with a 1070 Max-Q from Nvidia, and it's a very powerful, thin and light gaming laptop that's also really good for creative work. So the design of this thing hasn't changed at all from the 15X from last year, or even the regular Aero 15. It's got this very industrial look, like the lines are sharper and more angular than some of the more modern looking laptops, but yeah, I like the design. The build quality of this thing has always been above average. It's not like an XPS 15 or MacBook, but compared to a lot of other aluminum paneled laptops, this one feels good. It's mostly aluminum, there are some plastic components like the trim around the edge, which makes it look and feel a little bit less premium, but the overall build quality is good. The screen flex is minimal, and same with the body paneling. It's just a very rigid feeling laptop. It has the same width and length as the previous generation, but it's actually a little bit thinner. It's now an 18.9 mm thick laptop, and they've done it by actually reducing the thickness of the screen. They're using a new panel, it's thinner, it's lighter, and it's a 144 Hz. It's a really excellent display. It's bright, it's color accurate, it's just a really good screen. Now, one of the issues I had with the Aero 15X from a few months ago was that they were pairing a GTX 1070 Max-Q with a 60 Hz screen. It's just, it didn't make sense to me. It was like you're wasting the potential of that card because you're capped at 60 frames per second. 144 Hz on these new panels, it makes a world of a difference. Gameplay is very fluid, but even if you're not a gamer, having your Windows desktop at a higher frame rate looks awesome. Just seeing your mouse cursor move around really smooth at 144 Hz, looks so much better than 60. Now, this panel does not have G-Sync, and I've said this before in previous videos, but I don't think it's that important. G-Sync is really useful at lower frame rates, at like 40 to 60 frames per second, but once you go above that, I just, for me personally, I don't think it's that important. Um, I will say this. If you're a MacBook user or like a MacBook Pro user, and you're interested in converting over to this laptop, because it is like something that's geared towards creators, This screen is not as bright as a MacBook Pro screen. It's more color accurate, and I think it's a better screen overall, but MacBook Pro screen gets incredibly bright. This one is like, it's bright for a Windows laptop screen, but it's not as bright as a MacBook Pro screen. Okay, let's take a look at the ports. It's got DisplayPort 1.4, HDMI 2.0, a bunch of USB, and it's got Thunderbolt 3 and an Ethernet port, but the most unique port on this thing is the inclusion of an SD card slot that supports UHS-2 speeds, so if you're a content creator, and you use SD cards, you can offload UHS-2 cards super fast, like 250 or 300 MB/s. It's crazy fast for an SD card slot. The inside is really easy to get into, just a bunch of screws, back panel removes right off, and inside you get access to 2 RAM slots, 2 NVMe drives, and the Wi-Fi card. The RAM that they included is actually super fast, and it's 16 gigs on one stick. so if you want to upgrade this thing up to 32 gigs of RAM, it's more economical. A lot of companies will stick two sticks of 8, And then you have to basically toss both of them if you want to upgrade it up to 32, so this has one stick of 16 gigs. The bad thing is that you're now running single channel memory, and I don't think that's a big deal, outside of like the memory benchmarks, but that's up to you. The battery down here is big. The Aero 15X always has a big battery, this is 94 Wh. Really close to that legal limit for flights, and we're getting around seven and a half hours of battery life for the screen at 250 nits. Now, performance on this laptop is going to be very good, Six-core CPU, it's a beast. Now, I'll link a video down in the description if you want to see more details, But the 8750H is a really impressive chip for multi-core stuff. It's just so much faster than the previous generation. There's a bit of an improvement in gaming performance because of the CPU, but the GPU does most of the work. It's a GTX 1070 Max-Q, really strong performer, and most AAA titles run extremely smooth on this laptop. and that 144 Hz screen looks awesome. The thermal performance is great. There's no throttling in games, and even in benchmarks, we're getting slightly better temperatures than some of its competitors, and because the temperatures are good while running strong hardware, this is an excellent device for content creation. The last three videos I've published on YouTube were done on this laptop. It's just a really nice device for powerful, really color accurate screen, and I was using the 1080p screen. I didn't really need 4K, there is an option for it, but you know, color accuracy is more important than resolution for what I do. Now, the fan noise on this laptop is okay. So on load it's very acceptable, it's not super loud or anything, but I don't like the fact that when it's on idle, like if you're not doing anything, there's still a little bit of fan noise. It's not loud, it's actually barely audible, but there are competitor products that have the same kind of performance that just have completely silent fans when it's idling, and this one doesn't, so it kind of bugs me. Like if I was doing this video and this thing was on, this microphone would pick up the fan noise. Very subtly, but it would be there. Alright, so I've focused on a bunch of stuff that I like about this laptop, and now I'm going to talk about some things that I don't like. One of the weaker things about this thing are its speakers. It's located on the bottom, like a lot of the thin and light gaming laptops are, but I just don't feel like it's as loud as it could or should be. Another thing I don't love is the keyboard, and this is not a huge complaint, it's pretty minor, but I'm just gonna put it out there. The layout is fine, there's nothing I dislike about the layout, But there's something about the keys that are just somehow squished together, it actually took me quite a while to get used to typing on this thing. So I've had this device for almost three weeks at this point, and it was only like week two, that actually got comfortable typing on it. And it might be the keystroke itself, it just takes a little bit more pressure than regular to activate the switch. The trackpad is also not my favorite, it's running ELAN drivers, and it's not the drivers like, the gestures are okay, but the tracking feels a little off to me. And I'm getting this occasional bug, where the cursor stops moving for a split second. I'm sure they can fix it with software, and I'm sure they will fix it with software, but it's just something that kind of annoyed me during this review process. The webcam is also located at the bottom of the screen, and this is something that you get with really thin bezel screens like this, it's a beautiful looking screen, but that camera angle is just not for me. I don't use the webcam that often, so it doesn't bother me, but I feel like some of you guys are big on web conferencing, and just having a good camera angle, this won't give you that. But yeah, overall really good laptop. I mean, I feel like I had to nitpick on this device again, it's one of those like, really good devices. What separates this from its main competitor, the MSI GS65? And I call it the main competitor, because it kind of came out at the same time, and they're just like, similarly spec-ed and, well, I think we need a chart. Do we have a chart? Here's a chart. Okay, the Aero has a better build. I think that they both are well built, but the Aero feels more sturdy. It has better thermals, it's easier to access with a bigger battery, it has better color accuracy despite that smaller color gamut, more ports, and there's an option for 4K panel. The MSI has what I would consider to have a slightly easier keyboard to get used to, not that it's like, a bad keyboard on Aero, but this is an easier keyboard to get used to. I also like the design of the MSI, just looks more modern to me. It also has better speakers, and the webcam position is little bit better. But overall, the big difference is seriously the price tag. This is $200 cheaper than the Aero, which is like 10-12 % cheaper. So it depends on what you need or what your budget is, but I feel like both of them are appropriately priced. Personally, I feel like the Aero is just a better product overall. You're paying a significant amount more, but it's just like, it's just got more stuff going for it. If you're a content creator, I would probably go for the Aero, I feel like it's geared towards professionals a bit more, especially with that SD card slot, But it doesn't matter what you do. If you're gamer, a streamer, content creator, this is a kick-ass laptop for any of that stuff. Okay, hope you guys enjoyed this video. Thumbs if you liked it, subs if you loved it, see you guys next time.",
    "transcript_keywords": [
        "screen",
        "MacBook Pro screen",
        "Aero",
        "laptop",
        "Pro screen",
        "updated Gigabyte Aero",
        "thing",
        "MacBook Pro",
        "good",
        "Gigabyte Aero",
        "Windows laptop screen",
        "feel",
        "bit",
        "MacBook",
        "Pro",
        "color",
        "card",
        "bright",
        "Aero feels",
        "laptop screen"
    ],
    "transcript_entity_values": [
        "2",
        "GTX 1070 Max-Q",
        "only like week two",
        "Aero",
        "six",
        "Ethernet",
        "three",
        "MacBook Pro",
        "60",
        "4",
        "G-Sync",
        "10-12 %",
        "1070",
        "Six",
        "CPU",
        "GPU",
        "32",
        "1.4",
        "One",
        "USB",
        "one",
        "8750H",
        "200",
        "18.9 mm",
        "144 Hz",
        "94",
        "Aero",
        "second",
        "144 Hz",
        "16",
        "60 Hz",
        "G-Sync",
        "MacBook Pro",
        "YouTube",
        "GTX",
        "SD",
        "MB/s.",
        "MSI",
        "UHS-2",
        "Aero 15",
        "webcam",
        "300",
        "two",
        "3",
        "almost three weeks",
        "Windows",
        "seven and a half hours",
        "AAA",
        "32",
        "RAM",
        "8750H",
        "8",
        "MacBook",
        "Gigabyte Aero",
        "a few months ago",
        "15",
        "40 to 60",
        "last year",
        "15X.",
        "250",
        "ELAN",
        "Nvidia",
        "1080p"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}