{
    "id": "yexEhUfMUc0",
    "title": "Galaxy Note 10 and 10 Plus hands-on: the small one is a big deal",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-08-07T20:00:10Z",
    "video_url": "https://www.youtube.com/watch?v=yexEhUfMUc0",
    "category": "Science & Technology",
    "tags": [
        "note 10",
        "note 10 plus",
        "10 plus",
        "galaxy note",
        "samsung galaxy",
        "samsung note 10",
        "samsung galaxy note 10",
        "galaxy note 10",
        "galaxy note 10 plus",
        "galaxy note10",
        "samsung",
        "samsung note",
        "samsung note 10 official video",
        "samsung event",
        "samsung keynote",
        "new note phone",
        "s pen",
        "battery life",
        "samsung phone",
        "smartphone",
        "smartphones",
        "phones",
        "new phone",
        "rumors",
        "hands on",
        "first look",
        "review",
        "unboxing",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "apple",
        "google",
        "iphone",
        "verge",
        "the verge"
    ],
    "views": 507911,
    "likes": 8361,
    "comments_count": 865,
    "description": "The Samsung Galaxy Note 10 and Note 10 Plus  Dieter Bohn tries out all the new features on these just announced phones. The Note 10 starts at $949 and comes in just one configuration: 8GB of RAM and 256GB of storage. The Note 10 Plus starts at $1099 with 12GB RAM, 256GB storage and you can spend $100 more to get a 512GB of storage. Both are available for preorder today and will ship on August 23rd.  Learn more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2MJP49H",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- The Samsung Galaxy Note is back, times two actually. What you are looking at here is the Note 10 and the Note 10 Plus. The Note line has always been about being the biggest and most powerful, and both of these phones are powerhouses, but you can get other big, powerful Android phones now. So, what is Samsung doing this time around to make this thing feel like, well, a Note? I've only had a little bit of time with it for a hands on, but I think you can break it all down into five things. First, well, the most obvious thing that makes a Note a Note is the stylus, the S Pen, and Samsung has two really big updates here. You can still take notes on the lock screen right when you pull the S Pen out, but now Samsung Notes can read those notes. So it can search for them, it does OCR, you can even copy it and paste plain text in another app, or you can export a Word document of your text if that's what you wanna do. They've also added an accelerometer and a gyroscope to the stylus, and so you can use it as a remote control, kind of like a wand. So in the camera, you can go left and right, change between modes and up and down, and even do a little swirly motion. It's kinda wild. They do have an SDK, so other apps could use it, so maybe in a PowerPoint or something someday, but that's not available yet. We'll have to wait to see if more developers are gonna support it in the future. The second reason you might be interested in the Note 10 is DeX. Now, I know what you're thinking, nobody uses DeX, Dieter, come on. But hang on, DeX, if you're not familiar, is you plug a USB-C cable in and then you plug it into a monitor and then you get a, like, Windows version of your phone. You've got windows you can resize and you can, you know, drag stuff around and so on. With the Note 10, what's new is they actually have apps for the Mac or Windows where it runs DeX right there, so you can use the computer you already have and have a little window for controlling stuff on your phone. It's also really convenient if you want to drag and drop stuff, so you can actually just drag and drop a file or an image or something from your PC to your phone and vice versa. It's a totally new thing for DeX and I'm actually really excited to try it. The other thing is, Windows 10 has this feature where it can show your notifications and some other stuff from your phone but you have to install an app, but with the Note 10, Samsung built support for that right in. Number three, and this is the reason people usually buy the Note, it just has every spec you could ask for. So, both of these phones use a Snapdragon 855 processor and there's the thinnest ever vapor chamber for cooling it so it can run at higher clock speeds for longer. Now, on the Note 10, you've got eight gigs of RAM and 250 gigs of storage, which is a pretty darn good default. On the Note 10 Plus though, you have an option to get 12 gigs of RAM and 512 gigs of storage and it has a slot for a microSD card for further storage expansion. Now, this big phone has a 4,300 milliamp battery, the little one's 3,500. Don't know exactly how long that's gonna last in terms of, like, all day, but it's gonna be all day, I'm sure it'll be fine. Also, they both use standard USB PD for charging and on the Note 10, if you want, you can get up to like a 45 watt charger. This thing'll top off in under an hour or about an hour. It's gonna be really fast. Number four, it's just a really nice phone. I mean, it's really good build quality, it's got this classic 90 degree corner that all Notes have. There's basically no bezel. You really have to serach for it to see it 'cause the screen rounds around the corners. It has a smaller cutout for the selfie camera than even the Galaxy S10. It's just, it's super nice. If I had to complain though, I would complain that there's no headphone jack. Samsung says they took it out to make room for the battery and sure, I guess that's fine but, you know, I'm sad. The other thing that Samsung has changed is they moved all the buttons. They're now on the left-hand side and there's just three, two for the volume rocker and one for power which also can double as a Bixby button. Now, the S10 comes in four colors. They're all called Auro 'cause I don't know. This is the Aura Halo. There's also black and white which is gonna be available everywhere and then there's a Samsung.com and Best Buy exclusive of Aura Blue. Number five, and it seems weird to put this last but the cameras are really good. It's basically the same camera set up as the Galaxy S10. It's been tweaked a little bit but Samsung has added some video features. So, there's a cute thing where you can do bokeh and Live Focus a video, that's fine, but the thing I'm really interested to try is the microphone focus. So you can actually zoom in and it does beam forming on three microphones to only pull sound from the thing that you're zoomed in on. Really excited to try that. There's also a time-of-flight camera but they're not really using that for any camera effects just yet. So those are the five things. Do they add up to it being a Note? I don't know. We'll review it and we'll see. The little one is gonna come out for $949, the Note Plus is gonna be $1099, and a maxed out Note Plus is gonna be $1199 and they're gonna be available on August 23rd. I will say I think I'm more intrigued by the smaller Note 10. It's about the same size as, say, a Galaxy S10. While the Note 10 Plus is like the true successor to last years Note 9, it's about the same size. But it's been a super long time since we've had a really pocketable phone that had a stylus. Maybe what the Note needs isn't to be bigger and badder and more powerful, but actually smaller. Hey everybody, thanks so much for watching. Are you interested in either of these Notes? If so, let me know which one down in the comments below and we're gonna have more coverage from Samsung's Live Unpacked event which is happening right now and of course reviews when these things come out, are available, when they're here. You wanna use that, or? - Yup. - Yeah, okay, great.",
    "transcript_keywords": [
        "Note",
        "Samsung Galaxy Note",
        "Samsung",
        "notes",
        "Samsung Notes",
        "thing",
        "Galaxy Note",
        "phone",
        "Windows",
        "Galaxy",
        "Samsung Galaxy",
        "Samsung Live Unpacked",
        "DeX",
        "camera",
        "Note line",
        "smaller Note",
        "powerful Android phones",
        "Android phones",
        "Samsung Live",
        "things"
    ],
    "transcript_entity_values": [
        "DeX",
        "Auro",
        "under an hour",
        "1099",
        "USB PD",
        "Android",
        "Windows 10",
        "one",
        "90 degree",
        "four",
        "949",
        "Bixby",
        "SDK",
        "S10",
        "Samsung.com",
        "three",
        "Windows",
        "the Aura Halo",
        "eight",
        "the S Pen",
        "microSD",
        "512",
        "Aura Blue",
        "Number four",
        "Samsung",
        "4,300 milliamp",
        "the Note 10 Plus",
        "two",
        "the Galaxy S10",
        "Live Focus",
        "250",
        "all day",
        "12",
        "August 23rd",
        "9",
        "1199",
        "3,500",
        "USB-C",
        "Notes",
        "the Note Plus",
        "last years",
        "second",
        "five",
        "855",
        "the Note 10 Plus",
        "the S Pen",
        "Mac",
        "45 watt",
        "OCR",
        "PowerPoint",
        "RAM",
        "about an hour",
        "First"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "TIME",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "EVENT",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "LAW",
        "WORK_OF_ART",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "TIME",
        "ORDINAL"
    ]
}