{
    "id": "YGFqDay5fdI",
    "title": "AirPods 2 - What's the Difference?",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2019-03-21T03:54:33Z",
    "video_url": "https://www.youtube.com/watch?v=YGFqDay5fdI",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "AirPods",
        "AirPods 2",
        "AirPods 2019",
        "review",
        "unboxing",
        "AirPods 2 review",
        "airpods 2 unboxing",
        "AirPods 2 vs AirPods 1",
        "AirPods 2 Wireless Charging",
        "Wireless Charging",
        "AirPower",
        "Apple AirPower",
        "Galaxy S10",
        "Galaxy Buds",
        "Galaxy Buds vs AirPods",
        "AirPods 2 vs Galaxy Buds",
        "Jonathan morrison",
        "tld"
    ],
    "views": 537761,
    "likes": 13863,
    "comments_count": 1034,
    "description": "AirPods 2 with a new Wireless charging case is here. They look pretty much identical to AirPods 1 but what's the difference? Subscribe for my AirPods 2 vs Galaxy Buds Review + Comparison! Secret Galaxy S10 Wallpapers!   the 2019 AirPods feature wireless charging, a new H1 chip that enables hey Siri through voice, 50% more talk time and faster switching between devices.  Wireless Chargers!    Tech that made my iPhone better:  The Perfect MacBook Pro Setup:   TLD Spotify Playlist!   TLD Behind the Scenes!  Mobile users:   Music via Musicbed:   My Audio Setup & Gear:",
    "description_links": [
        "https://youtu.be/V-AOQH3etYc",
        "https://amzn.to/2FnUiCG",
        "https://amzn.to/2To7DA2",
        "https://youtu.be/LrcHHyMSVtY",
        "https://www.youtube.com/watch?v=fBTNg...",
        "https://open.spotify.com/user/jonatha...",
        "http://bit.ly/TLDBreakdown",
        "https://www.youtube.com/channel/UCDlQ...",
        "http://share.mscbd.fm/tldtoday",
        "https://youtu.be/v9hu-Avj2oE?list=PLq..."
    ],
    "transcript": "- Tim Cook, is an absolute mad lad this week, just dropping new products left and right and today, AirPods 2, AirPods 1.5, AirPods S, whatever you wanna call them, the second generation of the AirPods are official and we know this from this super, highly detailed, professional PR image directly from Tim Cook himself. You might be thinking, \"Those look a lot like the AirPods that I already spend a hell of a lot of money on, what is the difference?\", and today I am going to break that down. (upbeat electronic music) So the two biggest features with the second generation of AirPods 2 is one, the ability to activate haste with your voice. - Whoopi And two the inclusion of wireless charging. The breakdown of how much these new AirPods costs is a crap load kind of crap load and then wow, I'm surprised they let you buy the wireless case separately and didn't make you go with option one. For real though that's actually kind of surprising on Apple's behalf. Normally, they're the first company to make you upgrade to that new product just so that you can get your hands on that new feature, so if that voice activated - Sloppy - Isn't that enticing to you and you already own a pair of Airpods you can still join the wireless charging party. Playing that in my head, I don't know if I wanna go to that party, or do I. At the pace Apple is going this week by the time you watch this video there's a good chance that AirPower, yes, AirPower might finally be announced and officially cause I think most of us thought that Johnny I was taking that thing outback and putting it out of its misery, but with the introduction of AirPods2 and that wireless charging case it just wouldn't make sense for Apple not to have that as part of its line because there is no way a Galaxy S10 would be better suited with those Airpods than anything in Apple's line up. Seriously, Galaxy S10 will be able to charge these second generation AirPods so Tim Cook, please, please, please, please release AirPower, it is long overdue. Jumping back to the wireless charger, the good news is, this case will charge the AirPods through the standard wireless choe charging. So whether Apple announces AirPower or not you can use any wireless choe compatible charger and I will drop a few of my favorite down below. You do, of course, have access to lightning port on the second generation AirPod's case just in case you don't want to use wireless charging. I would of loved, loved to have seen USBC but we are not quite there yet. Now yeah, voice activated haste is nice. - Women - But sometimes you just wanna be quiet so personally I was hoping for some sort of advanced gestures where I can turn the volume up or down by swiping up or down, that would be awesome because sometimes I don't wanna be that guy out in public saying, - Hey Samsonite - turn the volume up or down they're like Yo! Whose that dude talking too? So yeah, on the outside these new AirPods look pretty much identical to the first generation but on the inside there's actually brand new H1 chip which not only enables the voice activated haste, - Swanson - but leads to a more stable connection. This should translate to a couple of benefits right off the bat. First, Apple is claiming that you're gonna get two times as fast as switching from say your I-phone to your MAC Book to maybe your I-Pod touch. That's a win and also 30 percent less latency when your gaming and overall just improved sound quality across the board. That last note though, I'm 100% taking with a grain of salt until I get these in my hands or rather in my ears so I could check them out, compare them against the original AirPods because while I'm hopeful for some minor sound improvements I'm not holding my breath that it's going to be drastic. Finally, this may be a huge selling point with these new AirPods if you use them a ton for calls or your Face timing loved ones. You're supposed to get 50% more talk time which is actually pretty significant. All in all it wasn't as sexy as, as craziest or most impressive update, we got no color options but it was definitely necessary and I'm excited for wireless charging. Thank you guys very much for watching, hopefully you enjoyed it. If you did and you're feeling like being awesome make sure you guys go metal gear on that like button and if you missed it we made these beautiful awesome Galaxy S10 wallpapers that you can't find anywhere else. This is Jonathan and I'll catch you guys later. (upbeat electric music)",
    "transcript_keywords": [
        "absolute mad lad",
        "AirPods",
        "Tim Cook",
        "wireless charging",
        "wireless",
        "Apple",
        "highly detailed",
        "professional PR image",
        "absolute mad",
        "mad lad",
        "image directly",
        "charging",
        "generation AirPod case",
        "generation",
        "Cook",
        "case",
        "wireless charging case",
        "Tim",
        "Galaxy",
        "make"
    ],
    "transcript_entity_values": [
        "two",
        "100%",
        "Airpods",
        "30 percent",
        "AirPower",
        "H1",
        "MAC",
        "AirPods S",
        "Apple",
        "USBC",
        "a ton",
        "AirPods",
        "AirPod",
        "Galaxy S10",
        "S10",
        "second",
        "first",
        "First",
        "AirPods 1.5",
        "Tim Cook",
        "this week",
        "today",
        "AirPower",
        "AirPods 2",
        "50%",
        "Yo",
        "Jonathan",
        "Johnny"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "PERCENT",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORDINAL",
        "ORDINAL",
        "ORDINAL",
        "PRODUCT",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "PERSON",
        "PERSON",
        "PERSON"
    ]
}