{
    "id": "YGT1EvmDJh4",
    "title": "The Numitron: An obvious idea that wasn't very bright",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2024-07-01T14:21:00Z",
    "video_url": "https://www.youtube.com/watch?v=YGT1EvmDJh4",
    "category": "Science & Technology",
    "tags": [],
    "views": 1447661,
    "likes": 57017,
    "comments_count": 3234,
    "description": "The numbers don't look good, Jim.  Links 'n' stuff:  Fran Blanche's video on Nimo tubes:  (there are plenty more videos to discover on her channel, too!)  Technology Connections on Mastodon:   Technology Connections on Bluesky:   Have you ever noticed that I've never done a brand deal? That's all thanks to people like you! Viewer support through Patreon keeps this channel independent and possible. If you'd like to join the amazing folks who fund my work, check out the link below. And thank you!",
    "description_links": [
        "https://www.youtube.com/watch?v=xmWg7CtN0Ac",
        "https://mas.to/@TechConnectify",
        "https://bsky.app/profile/techconnectify.bsky.social",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Ah. The seven-segment display. Just make an 8 outof some sticks, and then you can represent the Arabic numerals zero through nine just by taking sticksaway! You can even make some letters happen if youre clever about it. These things have been aroundforever: the earliest known representation of them is in this 1910 patent where FrankWood claims to have devised this special monogram arrangement. Personally Im a littleskeptical that he was the first to think of this, especially since this earlier patent exists whereGeorge Mason devised a segmented alphanumeric display which is even more complicated, and creepylooking, but thats not important to this video. Going back a century you might find theseboxy numbers in price signage or perhaps scoreboards at a sports stadium - anywherea permanent display which needed to show different numbers made sense. Usually large somany people could see them, the segments might be lit with light bulbs (as Frank Wood envisioned) but they could even be mechanical in nature with differently colored flaps hiding or revealingthe individual segments. But for many years, they remained pretty obscure. The seven segmentdisplay wouldn't really start to take off until the digital age. And once wegot there and they started spreading, our old pals at RCA smelled opportunity sothey got out the crayons and took a crack at it. And these are their handiwork. Theyre calledNumitron tubes, and they are terrible. Theyre also rare and frustratingly expensive, probablybecause they didnt sell very well at all. Because theyre bad! This is what I can only describe asthe crudest possible way to produce a technically functional seven-segment display for digitaldevices. Now you might be able to tell whats going on in here just by looking at them, but before I explain their absurdity I want to go back in time because by doing so, youllunderstand why these briefly made sense. Briefly. Once upon a time, there were computers. Atfirst very large, very expensive computers, but we see the potential! As computingtechnology got cheaper and microprocessors started showing up in things like scientificequipment, cash registers, control consoles, and whatnot, we needed displays to allow humansto read and understand the data those processors were spitting out. Of course a general-purposecomputer could justify using a CRT monitor and generating a video signal to display columns androws of text, but something like a calculator didnt need all that. It just needed to showsome numbers. So, cheap and simple numerical display devices which microprocessor-basedsystems could control became a very hot item. Over the years equipment manufacturers tried allsorts of ideas. One of the most famous is the Nixie tube. These neon-filled tubes produced aglow discharge around wire cathodes formed in the shape of numerals, resulting in beautifullylegible displays which were readable in many conditions. But they had a rather hugecaveat - they required high voltage DC to produce that discharge. As in, around 180V. That meant that while the tubes were simple, the circuitry required to drive them was complex. Not to mention dangerous. Because of this, Nixies quite naturally attracted plenty of competition. But, many of its contemporaries shared another of its flaws: the need for a dedicatedoutput for every character it can display. Since Nixies use wire-form numerals, astandard Nixie tube needs 10 inputs to function: one for each of its cathodes. Buta segmented display which forms numerals by combining different shapes together only needsone output per segment. That saves on wiring, but it also makes the circuitry which actuallydrives the display devices cheaper. In the early days, dedicated ICs known as BCD decoders wouldtranslate the four bits of binary-coded decimal input they received from a microprocessor into the correct output to drive a display device. The internal structure of these decoderchips was quite simple - just a few logic gates, really. But they could be a lot simpler witha seven-segment display compared with a Nixie tube since there were fewer outputs for itto control. And, many of the same outputs are active on multiple inputs. A 2 becomes a3 simply by swapping these two segments, and that reduces the number of transistors youneed in the chip which makes the chip cheaper. Thats extremely in the weeds, though- when we get right down to it, the simple fact was the seven-segment displayhad too many advantages over Nixies, Nimos, edge-lit displays, projection displays and allthe other wild ideas that were floating around. So although they were arguablyless readable and more ugly, they were obviously going to become the standard display technology for numerical information. Except - its not really a technology. Itsjust a specific graphical representation for numerals. So using them may simplify controlcircuitry and make wiring devices a little easier but we still have to figure out how toactually make them! And that wasnt trivial. In the late 1960s, our technology to make smallthings light up brightly was quite limited. We did have teeny little light bulbs, of course, and we used those in myriad ways (including those projection displays) but doing that had a ton of drawbacks, especially visibility indifferent lighting conditions. To maximize contrast under bright ambient light, ideallythe glowing element of the display shouldbe directly viewable - which was one of the Nixietubes greatest strengths. So you might just make a seven-segment nixie tube, which was indeed athing (more or less). But glowing neon cathodes still needed the same high-voltage DC as ordinary Nixieswhich was annoying and expensive to implement. Luckily, the vacuum fluorescent display had justpopped on the scene. These devices required low-er voltage than neon discharge tech which was good, but the tubes themselves were more complex. These vintage IV-11 tubes might look simple enough buta closer look reveals there are several layers here. At the front of the tube is a cathode made of two heater wires which emit electrons through thermionic emission. Theres the seven segmentsforming an 8 at the back, of course, but look closely and youll see that right in frontof the 8 is a control grid. In operation, that grid is positively charged and will absorb the electrons coming from the cathode wires at thefront of the tube. But the individual segments behind the gridcan also be positively charged. When energized, they also attract electrons and are able to yank some of them through the control grid. When those electrons collide with the phosphorson top of the segments, they glow. Pretty neat. But thats even more complex than nixies! Andfor every problem they solved they introduced another. These tubes didnt need high voltage, but they needed two voltages: a low voltage for the cathode wires and something around 30 voltsfor the anodes and control grid. Better than 180, of course, but still much higher than the logiccircuitry of whatever you want to put these in, which was typically 5 volts. And, as you might beable to tell, these early tubes have pretty poor contrast under even modest ambient lightingsince the phosphors are white when unlit. So, both neon tech and VFDs had theirproblems. But we were already building a lot of electronic devices which needed numericaldisplays, and there wasnt time to wait. So, the fine folks at RCA barfed out an idea. Heres my impression of how that went: What if why dont we just make a weirdlittle light bulb? [fart noise] And thus explains the Numitron! First hitting themarket in 1970, these really are just weird little light bulbs but with seven filaments. Each filament is stretched across little pegs on a support board so they become the segmentsof a seven-segment display. Then that assembly got shoved into a standard 9-pin miniaturevacuum tube enclosure. Just apply power to those pins to light up the right combinationof those filaments and you technically have a functional digital display device. Oh, and thismodel doesnt have it, but they were available with a decimal point option which took the formof a tiny little X crossing these four pegs. These days, of course, the trendy thing to dowith weird old display tubes is to build a clock so thats what I did. But in the spirit of theNumitron, I didnt bother doing it well! I did the bare minimum. But it technically works. I thinkthat was the slogan for the Numitron! Now, Im about to be rather unkind to this piece of allegedtechnology but before I embark on my tirade where I count all the ways this is just a terribleterrible product, I need to admit that I also kind of like them. Ive always been fascinated withthe idea of building seven-segment displays out of weird things. Like, imagine a clock where eachsegment is a four-foot fluorescent tube. You could read that thing from miles away! And, uh, whenI was in college, I built a giant clock where the segments were sections of LED tape. RGB, ofcourse. So Numitrons are very much up my alley. And while today the use of incandescent filaments in a seven-segment display might seem objectively absurd, that was in fact the point! These tubesare dead simple and require nothing special at all to use. They only need 5V to glow, so theydidnt need their own power supply. Incandescent filaments are self-regulating, too, so theres noneed to add current-limiting resistors to the circuit. And since they were so tiny the segments only consumedabout 25 mA each. This is actually the largest version of the tubes RCA made, but they don'teven consume a watt of power with all segments lit. The ridiculous simplicity of these meant that youcould drive them directly from a seven-segment BCD decoder chip, all powered by the same 5V supply as the rest of your newfangled digital widget. That would save money in the hardware design, and since the Numitron itself is so freaking simple, the display tubes were cheaper than thecompetition. So it wasnt a terrible idea. But, as you might be able to tell just from lookingat them, the execution of the idea left quite a lot to be desired. If I could describe these ina word, it would be janky. Or perhaps slapdash. Nothing about these feels like a finished productthat should exist. They just look way too crude! The extremely thin segments lead to them beingnot very legible, and the arrangement of those segments is just awful. Theres way too much of agap between them and the vertical segments extend uncomfortably beyond the top and bottom segmentswhich just looks weird. And they didnt lean the 8 to accommodate the decimal point at the bottom so the displayis off-center in the tube which is infuriating. But its problems dont end there. Do you noticesomething wrong about the background? For reasons that I cannot fathom, RCA decided to make the supportboard for the filaments grey. That was a mistake. It should be black, or at least as dark aspossible. Because, ya see, any ambient light that hits these things is going to brighten that backgroundand make the glowing filaments harder to see. And, if that werent enough, even in a pitch-blackroom the filaments themselves illuminate that support board enough to where contrast is reduced, making the already kind of hard to parse numbers just a little bit harder to identify. Now, I willgive them the benefit of the doubt and say that there could be some materials reason this isnt black - maybe a nice, dark background wouldnt survive the heat of the glass-sealing process. But I mean,these VFD tubes have a much darker background so And it might be hard to tell but thesearent even straight - and I dont meanmy handwork when installing the sockets. The internal support structure holding the filaments is leaning noticeably in several of these tubes sowith all the tubes fully seated, the numbers are slightly crooked andwith multiple tubes youll never have a perfectly aligned display unless youcommit to a lot of fiddling. Honestly, I dont think anyone at RCA was particularly proudof these things. I mean, if they were, I would think they would have tried a little harder. Just look atthe datasheet. These are the other varieties RCA sold. A plus or minus tube. Wow. And a plus orminus 1 tube. Really workin hard over there. In this promo piece about them, we dontlearn whose idea this was. We just hear from Robert D. Reichert, the manager of thewhole dang tube design department. And RCA didnt bother putting a patent number or even patent pending on these boxes which are specifically branded Numitron. That mademe wonder if they even bothered patenting it. Honestly the only nice thing about theseis their name: Numitron. Thats pretty cool. But its also lazy! This is literallyjust numi (short for numerical I guess) and tron. And back then tron was as infectious a buzzword as AI is today. I was starting to lose my mind over the originof these things. The idea seems simultaneously too obvious (this write-up in Popular Electronicseven says as much) yet these are also just not good. I could not rest until I found the patent andwho invented these. Luckily I did, and here it is. Apparently these were the brainchild of RichardArthur Bonnette and Norman Lee Lindburg. Now, RCA was a huge research-driven organizationback then so its plausible that these were just two names pulled out of a hat and I kindof hope it was. This does not scream quality. Editors note: while looking for a differentpatent (the one showing the projection displays which used little light bulbs) I ran across thispatent issued in 1959 to Art Garfunkl - I mean A. R. Garfinkel. And well, sure enough the idea wastoo obvious and RCA was not the first to have this idea. The implementation here is very different,though - its in a flat package (which is gonna come up again later) but most importantly,if Im understanding the diagrams correctly, the filaments are producing light indirectly and its guided towards a mask with small slits at the front. Im guessing this conceptnever made it to production, and that drawing implies its got the widest bezels youveever seen. But I wanted to throw it in here. You can see from the datasheet that RCA wasgrasping at straws trying to sell these things. Oh sure, low-voltage operation is very real and objectively a good differentiator. But void of clutter is clearly a dig at Nixies, and thewhole oh, its incandescent with a wide spectral output so you can use color filters to obtaina display of any desired color is true, but a stretch. I mean, sure, but good luck with blue. RCA designed them to last 100,000 hours and, well, thats only gonna be possible if the filamentsburn quite dimly. So theyre not producing much light towards the blue end of the spectrumand a blue filter will really cut their output. Now, to be fair the tubes can be a lot brighter than they appear in this clock. Theyre power-limited here thanks to theBCD decoders I had which are not capable of passing 25 mA. If I apply 5 volts directly to atube, we can see that it can get this bright. Which is honestly impressive! Thats definitely brighter than aNixie tube, and whiter than I was expecting. But this also really reveals how much the filaments are brightening the background and reducing contrast. That really shouldnt be grey. I meanyou didnt need a rocket surgeon to tell you that. While RCA didnt seem to try very hard here, the concept was valuable enough to attract clones. There are plenty of variantsavailable that were made in the USSR, but those are even worse! These IV-9 tubes havefilaments that sag under their own weight. Later, incandescent seven-segment displays just like Numitrons but in flat packages appeared, and for some reason I have a memory that they were common in gas pumps for a brief time but literally I have no idea why thats inmy head. I just read it somewhere somewhen. Those clones were all short-lived, though, just like the Numitron, because of a little thing called the light-emitting diode. They had already been invented by the time RCA got the Numitron out the door, butthey were extremely expensive in 1970. And, the first seven-segment displays which usedLEDs were tiny things where each segment was actually multiple LEDs on a tiny little chip, and they relied on magnification lenses to make the tiny glowing digital dots appear larger. Thats why the Numitron made sense to use. But it didnt take long at all for LEDs to get cheap, and once they did? The Numitron was doomed. LED packages like this quickly became the defacto standard for seven-segment displays. These are much like those really early andlarge displays where ordinary light bulbs were stuck down holes with lenses on thefront, but miniaturized by replacing the light bulbs with tiny LEDs. Those LEDs arefiring up at small lenses embedded in epoxy resin and that forms an incredibly ruggedand simple structure. The lens shapes can also be tweaked for maximum legibility, andresins a lot easier to deal with than glass, too. So once production lines for these things spun up the Numitron just looked ridiculous. And lets not forget the vacuumfluorescent display. These things are still in use today - in fact theresone in my stove. The single-digit tube form factor found here became just asridiculous as the Numitron before long, but its the problems with contrast in ambientlight were easily fixed with filtering and soon we learned how to make VFDs flat and pack them with hundreds of individual segments. You might have 8 seven-segement displaysall in a single package for a calculator, or even dot-matrix alphanumeric displays. Through multiplexing, a technique where the entire display is broken up into several sectionsaddressed one at a time in rapid succession, we could make very complicated and very customizable displays featuring custom graphics and multiplecolors, all with excellent readability,longevity, and simple control circuits. Oh, right and then there was the liquid-crystaldisplay. Which, funnily enough, was invented by George Heilmeier at RCA! And before the Numitron! It took quite a while to become viable, though, and RCAs first version used a concept calleddynamic scattering mode, and wasnt super great. Other innovators improved upon it over the years, and Im really only including it as a footnote since it wasnt self-illuminating and it was notquite a contemporary of the Numitron, at least not ones that actually worked well. But once wefigured them out the Numitron looked even sillier. Still, I cant help but admire theNumitron. Its perhaps the perfect example of the phrase so crazy it just mightwork distilled into a product. Trouble was, while it did technically work, its advantagesbecame irrelevant approximately seven minutes after RCA brought it to market. Of course thatsnot entirely true, but I am all but certain that device manufacturers, when shopping for displaytechnologies, looked at how poorly these render numbers and how jankily they were constructed and quickly concluded theyd rather pay more for something a little more polished. Slappingthese in your digital device screamed cheap. If theres a lesson we can learn from theNumitron, its probably that there are times where the simplest possible option really istoo simple. If it had a little more time in the oven and RCA tried executing it a little better, maybe it would have seen more success. But it was always going to be stuck with the shapesyou can make with a filament. In other words, thin, straight lines. With every other displaytechnology offering much more legible characters and even custom glyphs, the Numitron would neverbe able to branch out beyond seven-segment and maybe alphanumeric displays. But Ill bet thosewould look even worse than this. But hey, at least they managed to get it to market when it actually made some sense. Unlike that Videodisc player. Oh look, LEDs! slapdashedly smooth jazz I have to record that line again. Ignore allthe continuity errors.... Its a running clock. For your benefit [waits until the hour rollover] OK and, since the Numitron itself is so dang simple, the tubes werech cheap chchpbbt. Fell apart. The earliest known representation of them is this eh debekadababa Ah, the seven-segment display. Make an aight what? The use of incandescent filaments in a seven-segment display mightseem objectibely objectibely? Because of this, Nixies quite naturallyattracted plenty of commetition. But, Ive mmm. RCA really did some numbers here, didn't they? Or should I say, they really did a number on themselves? Perhaps this is the product that signaled the beginning of the end for RCA. Imagine if they had stuck Numitron tubes in the Selectivision players though. Maybe that would have sold it!",
    "transcript_keywords": [
        "display",
        "RCA",
        "Numitron",
        "sevensegment display",
        "tubes",
        "Nixie tube",
        "tube",
        "displays",
        "sevensegment",
        "sevensegment nixie tube",
        "make",
        "tubes RCA made",
        "display tubes",
        "segments",
        "light",
        "filaments",
        "things",
        "simple",
        "Nixies",
        "stuck Numitron tubes"
    ],
    "transcript_entity_values": [
        "1959",
        "Better than 180",
        "A. R. Garfinkel",
        "1970",
        "Nixie",
        "four-foot",
        "Nixie",
        "Frank Wood",
        "the years",
        "9",
        "FrankWood",
        "30",
        "1",
        "the early days",
        "Selectivision",
        "years",
        "Nixieswhich",
        "the late 1960s",
        "two",
        "Mason",
        "Videodisc",
        "8",
        "RGB",
        "theNumitron",
        "Nixietubes",
        "George Heilmeier",
        "5V",
        "2",
        "this 1910",
        "These days",
        "Buta",
        "VFD",
        "5 volts",
        "hundreds",
        "Arabic numerals zero",
        "USSR",
        "RCA",
        "today",
        "Popular Electronicseven",
        "mA",
        "thewhole dang tube design department",
        "approximately seven minutes",
        "Nixies",
        "Norman Lee Lindburg",
        "seven",
        "Nixies",
        "mA.",
        "RichardArthur Bonnette",
        "first",
        "one",
        "four",
        "many years",
        "Art Garfunkl",
        "10",
        "Nimos",
        "a watt",
        "CRT",
        "One",
        "Numitron",
        "Numitrons",
        "25",
        "nine",
        "mademe",
        "Slappingthese",
        "a ton",
        "First",
        "AI",
        "miniaturevacuum tube",
        "IV-11",
        "BCD",
        "the hour",
        "numericaldisplays",
        "Robert D. Reichert"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "LAW",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "TIME",
        "GPE",
        "PERSON"
    ]
}