{
    "id": "yhavtVpEW2E",
    "title": "5 Reasons Earphones Are Better Than Headphones",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-04-29T13:35:32Z",
    "video_url": "https://www.youtube.com/watch?v=yhavtVpEW2E",
    "category": "Science & Technology",
    "tags": [
        "hifiman",
        "re-00",
        "hifiman re-00",
        "re00",
        "massdrop",
        "earphones",
        "earbuds",
        "unboxtherapy",
        "unbox therapy",
        "tech",
        "technology",
        "audio",
        "best earbuds",
        "best earphones",
        "in-ear",
        "review",
        "unboxing",
        "headphones",
        "best",
        "iphone",
        "apple",
        "android",
        "sound",
        "samsung",
        "iphone 6s",
        "smartphone",
        "new",
        "galaxy",
        "6s",
        "test",
        "phone",
        "iphone 6",
        "gadgets",
        "apple iphone",
        "apple iphone 6s",
        "iphone 7",
        "vs",
        "s7",
        "android (operating system)",
        "apple inc. (publisher)",
        "smartphone (video game platform)",
        "drop",
        "s7 edge",
        "galaxy s7",
        "plus",
        "crazy",
        "samsung galaxy s7",
        "google",
        "edge"
    ],
    "views": 1612241,
    "likes": 29203,
    "comments_count": 2816,
    "description": "HiFiMAN RE-00 -  (Just login to see special price) 5 Reasons Headphones Are Better -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://dro.ps/re-00",
        "https://youtu.be/rKxrwXc_KEU",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys! Lew here back with another video. And this is a follow up to the previous video, The top 5 reasons to choose over-ear headphones. when compared to in-ear This one is dedicated to the top 5 reasons that you might choose in-ear headphones Instead of over-ear, In front of me I have some exclusives once again from Massdrop also from HiFiMAN these are a re-release they're called the RE-00 essentially what we're looking at just like over-ear model is a heavily reduced price to go along with the influx of demand in orders that'll come in from you guys so this is all metal construction 9mm driver you've got a braided style cable couple of different eartips if you wanna check that out link in the description you can go ahead and participate 5 reasons you wanna choose in-ear headphones when compared to over-ear Number one Travel. These are tiny, alright This might seem obvious to you but This is gonna go in anything A pocket, a bag. It's gonna go with you with you and you're not even gonna notice it BUT The other reason travelwise I've been on certain airlines where when you're about to take off they're like \"Hey dude with the big over-ear headphones! You're obnoxious, this is dangerous\" God knows what their reasoning is but often they force me to switch to in-ear style headphones. So if you're on the move and you want something that can fit in your pocket purse or bag, in-ear is the way to go. Number two Smaller drivers, smaller speaker units That fit closer to your eardrum Don't require as much power to be amplified So in general, in-ear headphones are gonna be easier to drive you won't necessarily need a outboard amplifier or any kind of fancy gear just plug these babies into your smartphone and experience what they were designed to do reproduce sound from a tiny little headphone jack and amplifier number three exercise activity jogging lifting weights Jack doing the BodyPump obviously these are going to be more convenient for most people don't have to be as worried about them falling off of your head on over ear headphones get heated up you're sweatin' it's covering I hate being hot, i keep the AC in here on freeze mode jack hates it number four... Price these guys here as I said are about 35 bucks just over $30 and in exchange for quite surprising sound quality at least in the case of this particular model usually when you step into the realm of over years you're gonna pay a little bit more so if you're looking to getting at a low price point generally speaking in ears will deliver more for less point number five is an interesting word isn't even a word inconspicuousness yeah sure why not this is like stealth mode you're walking around your grocery store maybe you're in class I didn't tell you to do it you know have your little secret agent like style while you listen to your tunes some people just don't like the style of having giant headphones on and i can understand that these just blend in better so there you have it the top five reasons to choose in ear headphones but I will say in conclusion is no perfect headphone obviously and if your guy like me or a guy like you if you're an enthusiast chances are you probably want to have a pair of each this happens to be an awesome opportunity to get two cool pairs of headphones, some in-ears and some over-ears from HiFiMan the quantities are limited as I said before special collaboration between mass drop HiFiMan and unbox therapy if you want to learn more the links are in the description I think you guys are gonna get great value out of these 2 headphone options for an open back over-ear and an in-ear there you have it",
    "transcript_keywords": [
        "choose inear headphones",
        "headphones",
        "inear headphones",
        "choose overear headphones",
        "inear",
        "overear headphones",
        "inear style headphones",
        "overear",
        "choose inear",
        "Number",
        "guys",
        "choose",
        "reasons",
        "ear headphones",
        "big overear headphones",
        "headphone",
        "style",
        "choose overear",
        "top",
        "overear Number"
    ],
    "transcript_entity_values": [
        "two",
        "Massdrop",
        "AC",
        "Lew",
        "just over $30",
        "RE-00",
        "HiFiMAN",
        "three",
        "four",
        "about 35 bucks",
        "HiFiMan",
        "9mm",
        "5",
        "BodyPump",
        "five",
        "jack",
        "Jack",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL"
    ]
}