{
    "id": "YiRMs5ZhcH4",
    "title": "Who Can Find the Weirdest PC Parts on AliExpress?",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-05-20T16:56:48Z",
    "video_url": "https://www.youtube.com/watch?v=YiRMs5ZhcH4",
    "category": "Science & Technology",
    "tags": [
        "AliExpress",
        "Aula",
        "Tesla Coil",
        "RGB",
        "VW Golf",
        "Cantenna",
        "Plouffe",
        "Tanner",
        "Jake",
        "Alex",
        "Linus",
        "Fidget Spinner",
        "Fake Pokemon Cards"
    ],
    "views": 1876435,
    "likes": 68237,
    "comments_count": 1796,
    "description": "Thanks to MANSCAPED for sponsoring today's video. Get 20% Off + Free International Shipping with promo code TECHTIPS or visit   Learn more about the G.Skill WigiDash here:   Linus, Alex, Jake, Tanner, and Plouffe all compete for a big prize, by seeing who can find the weirdest PC component or peripheral on AliExpress.  Discuss on the forum:   Buy an Aula H530 Mouse on AliExpress:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:55 Plouffe 2:32 Tanner 5:18 Adam (Alex) 9:16 Jake 11:33 Linus 15:55 Voting 18:56 Outro",
    "description_links": [
        "http://manscaped.com/techtips",
        "https://www.amazon.com/G-Skill-WigiDash-Command-Panel-Customizable/dp/B0CNGSPS1N",
        "https://linustechtips.com/topic/1570934-who-can-find-the-weirdest-pc-parts-on-aliexpress/",
        "https://lmg.gg/xSV64",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "We bought a lot of weird stuff on AliExpress over the years. The difference is this time we're doing it on purpose. The challenge was simple. Buy the weirdest thing you can find, present it to the rest of the group, along with a justification for what makes yours the weirdest tech product. Each of us will vote for two that we think are the weirdest and the winner gets a trophy. There's a trophy involved? That's it. Well, you're the writer, right? You got the trophy, right? I totally have a trophy, yes. Absolutely have a trophy. And you wrote a segue, right? To the sponsor? G-SKILL. Create macros or shortcuts and display your system performance with the Wigi Dash, a seven inch touch panel from G-SKILL designed to fit your workflow. Learn more at the link down below. . After a great start, you couldn't afford a Nuk, so you got a Mook. Mook AI, or I? I'm not sure. It's an H61 motherboard, which came out, what, 2011 or so. OK, but the cool part is this is not from 2011. This is I'm pretty sure from 2023. And the best part is that it has an M.2 NVMe. Wait, it came with all of that? No, no, no, no. I added all this just so that this was a little faster for the video. What I don't know is does this M.2 NVMe slot? actually support NVMe? Because that came out like 2013, two years later. What's the chipset? H61. Are you sure about that? Because I do recall that we have done a video where we had a motherboard like this that said it was a chipset, that it actually wasn't. Somebody wrote on this in pencil. Oh yes, yes! Just like the last time! If this is an H61, then how is it supporting an i3-2150 or 20 or whatever I have in there? Russians. What? Yeah, yeah, no, there's like a whole Russian community around this kind of thing. I think mostly they focus on... Xeon processors, but the chipset should still work. It's a whole thing. Yeah, they remanufactured the boards There's this great tick-tock I think of this guy just sitting in a warehouse somewhere with a giant box of motherboards and then yeah a little jig where he goes And it just cuts the chipset off the board and he hugs the board behind. I love angle grinder electronics Well, we don't know who's gonna win, but I think we know who's not gonna win So why don't we move on to our next contestant? No, okay, I'm gonna need a mouse. Oh, I have one. Is that your item? Yeah. Oh Here's the thing about this it's got top rotation pop a coin Alright, and for that you got it. You want to use what is top rotation pop a coin? Well, you use your your thumb to spin the top rotation pop a coin until it goes cutta cutta I read the manual. This is a new species of fingertip gyro Okay, that legitimately looks pretty cool. It looks pretty cool. It's gotta really like it It's got a removable fuel tank. What fuel tank? Yeah, removable fuel tank. Look right here. That's why you know it's strong It's got dark wire right on the left button. Here's the pop a coin Use your thumb to go cut to cut to cut were you a late-night TV pitch man in another life? Your pitch is so frantic that it sounds like they have your family Like you need to sell this mouse Well, it's me and Vince offer left. They used to call me Billy Mays But really the biggest selling feature of this is right here who has the biggest hands, okay? Just hold your hand like that and lift up your fingers It's fidget spinner . Oh, okay. That's pretty sick Wow all right video done Tanner wins Whoa nice catch. You drop enough things you get good catch on them. Oh whoa you broke it. No I broke nothing I think it's supposed to do this. Is that the removable fuel tank? It could be. Wait so where is the doggle for it then? Oh it's in there. Is it in the removable fuel tank? Hey hey. Wow this is premium quality they just put screws into the plastic and that's what the magnets make. I've got no problem with that. It's not stupid if it works. You're going to talk about that. You're not going to go after this paint job. This is worse than Plouffe's car. Colin, could you go get an air compressor? Air compressor? Don't ask. I think we have to see it in action.Okay. I think so. Okay, do we have to run it on Plouffe's computer or can we run it on a real computer? We have a test bench there. All right. We have a test bench there. What about Plouffe's computer? What's wrong with that? What is that? Whoa whoa whoa whoa whoa whoa whoa. Hey! American megatrends. Oh, I believe it. What? Okay, this is incredible. We put Windows on both this NVMe drive and then a backup SATA SSD just in case. Oh! It didn't actually support it as a boot drive. Oh no, never underestimate Russian Mine clearly works, so that's, you know, that's all I'm saying. There we go, can we get a tachometer? Oh, it's going. I blue- screened. No! My computer! Oh wait no, is that a blue screen? That's recovery. That is going. Alex kind of has two. My first one's banned. Adam is unfortunately sick today, so Alex is gonna choose his item, but he did buy something ages ago. Yes. Banned like in the country we're in or just like... No, we're not allowed to make... the video. So what I have right here is an RGB kit for a Mark 7 Gull. Oh my god. This is not a computer item, Alex. It's RGB. That's the most computer item of them all. So basically you just used our budget to buy something for your car. No, I put this in it as a joke and then you approved it and procurement got it. I never wanted it in the first place. The system works. I don't see any RGB. Alex you got scammed. Oh here's the RGB. Oh there we go. So this right here has to be put in there I guess. I looked at the instructions and it includes a lot of dremeling. Why is this so dirty? Wait so does the car like natively have RGB? Yeah well right now in natively has R. There's just red lights. What's that say? Dead project. RGB for VW Golf could be used for worst Aliexpress products. Exactly! Okay, why don't you go get your real item then. So this is what I have from Adam. He said, \"The one I got is much bigger than the other ones I have seen. I have no idea about safety, so be careful, I guess.\" Oh my God. I know what that is. Oh my God. It's a musical Tesla coil. I don't know if that's computer parts. It hooks into a computer. A speaker's a computer part. Is that fiber optic? Yes, this is fiber optic. 'Cause you want to isolate, you know, your control electronics from your high voltage electronics. Right. But not your body. No, you can touch it. Can you like lick it? I wouldn't, but like you can. Would you do it for 20 bucks? What's the needle for? What's the needle for? Well, right now nothing's happening. You need the needle. Ah! Okay, I'll turn it off for a sec. Ow. So you need the needle. Okay. So that it can do that. Oh, that's great. Yeah, that's not annoying at all. Yeah, it sounds really good. I can smell it. Yeah, you can smell it. Yeah. For the audio, I'll just turn it off for a second. Basically how this works is that normally it's operating at somewhere around a hundred kilohertz, which is way higher than what you can hear. So what we're doing is we are turning it off when we want there not to be sound and then back on when you want sound. So say that you want a thousand hertz, you just turn it on and off a thousand times in a second and you get a tone. So we can turn it back on. Wow. That's great. Wow. What a useful thing that I wish I had in my home. How does this integrate with a computer, Alex? Yeah. Well, it's a speaker. So we can turn it over to music mode. It works! Oh my God. Oh! Incredible. It's sparking out the tip. Oh, jeez. You are not. Oh, that's not so bad. Oh, S*** yeah. Hold on, it arcs to his fingers. Does that hurt? It's tingly. The higher tones, that's hilarious. Oh. The very first musical LTT screwdriver. Hey. That's pretty good. Oh, that's so cool. Okay, that more than tingles. It's scary. Also, I was touching the power supply on the other side. I think it stopped working when you touched that. Oh, oh my God, he killed it. No way. Oh, it just muted. Oh, it's like going up, but not going up. It's just constantly muting. I expected this to be wonderful. I expected this to be able to solve all of our problems. I don't think it's going to do that. No. The app, first of all, is not on the App Store. They give you an APK. You can just download and sideload on your Android phone. We tried to do it on a Pixel, and it didn't work because it's too new. So this is Plouffe's old phone, it's great. Why are the options doubt and don't understand? What is this font? So, this is supposed to be a diagnostic tool for computers. We do have some adapters for like M.2. So in theory, I'm hoping we can test the M.2 slots. If we're going to plug this into anything, it's going to be Plouffe's S*** Oh yeah, the NVME slot. So we can test. No, no, we might as well use this one. It says PCI-E. It's specifically said in the app or the manual or somewhere, don't plug in the PCI one into the PCI-E. That might break it. Anything will fit if you try hard enough. It's plugged in. It's powered. Blue light's blinking. Do I press doubt? Doubt just brings up, follow the onscreen instructions, idiot. It's apparently Bluetooth, so let's find that. It's connected now. All right, everything's done. But what does it do? It's successed. Why do you ask so many bloody questions? Turn the computer on. Okay. And in theory. This is now going to read the diagnostic code. Okay. Oh, it's actually working. Whoa. Whoa, we're getting post codes out of a board that doesn't have post code. But we got the current code is 1D, PCI-RS, good. HSON0, good. HSOP0, good. I love having good Help. HSOP0. Well, wait a second. It says if the computer fails, please eliminate the memory failure first. This is just basic diagnostic steps. It doesn't tell me 1D is okay. It's saying that 1D already shown below the code. It's telling us that's what 1D is. So in theory, this is maybe not compatible with this wonderfully standard chipset. Why don't we try that other computer? PCI bus, proper connection. Oh, look, you click on these and it shows you a photo of how to connect it. Oh, it can test USB. Oh, no way. USB test passed. CPU, motherboard, memory, and USB controller all work. Okay, so maybe useful at some point, maybe. Okay, Plouffe sidebar. What? We're not supposed to have sidebars. Here's the situation. It's AliExpress. I wasn't sure how many, if any of these items were gonna arrive. So I would like four things. Do you think these Pokemon cards are authentic? I think that they don't hook up to a computer. One of my items is this. And what I would like to know is do you think these are authentic Pokemon cards? Oh, I don't know, let's find out. Okay, here, let's each take a pack. I love cracking packs. Okay. First thing I'm noticing is they are in French. I don't know if these are real, dude. They don't feel thick enough. You might have gotten scammed. All right, so you got fake Pokemon cards. No, no, they are proxies. A black line. Oh, yeah, yeah. Magic does the same thing. Okay, yeah. No. No, they're very fake. Do you even remember what you ordered? No. I'm kind of leaning toward this one, but this is tempting too. They won't, I'm gonna do the-- The range, I don't think the range extender is gonna take that long. It's also not a range extender. What? I kind of have two, one of which I think is really weird and one of which I think might legitimately be useful. This is just a mining riser. This is not a mining riser. This, my friend, is a PCI-E. To PCI adapter. We could have used this during the last video. Oh yeah, we need to test it. Well, this is the 2001 Maximum PC Dream Machine complete with 100 megabit fast networking ethernet card and Hercules XP sound card with 3D acceleration. Did not receive the diagnostic code. All right, let's see if an actual card works though. I have seen these so many times. And I've been tempted so many times, but I've never had any reason to actually buy one because I don't have any PCI cards that I legitimately need to use. So here we go. Theoretically, you can just mount this daughter board anywhere in the chassis, plug in your old school PCI cards. Definitely have drivers for it. A little something like that. Yeah, I mean, I don't know, man. I got no idea. Wait, right? Whoa, whoa, whoa, whoa. Wait for best Whoa, whoa, whoa, whoa. Multimedia audio control. Are you kidding me? Realistically, this was just for fun 'cause I wanted an excuse to buy it. My real one is right here. This is the one I'm most excited about. Jeez. It came detached. It is a USB Wi-Fi card with a built-in cantenna. What? So the idea here is that if you have like a shed or a workshop or a distant location on your property that you need to get Wi-Fi to, you can aim your antenna directly at your Wi-Fi router for an improvement in signal integrity. What Wi-Fi standard does this support? I am not sure. RTLdrivers.eu, like, oh my God, I don't even... And definitely no viruses. XP64? Yeah. Setting up device, setting up device. RT something wireless. Yes! It's alive! Take the cable out, pull the cable out. It only says it's 802.11 G. I just want to know, is this antenna actually even connected inside of here? Oh, it is. Oh my God, it is. Look at that solder drop, that's mint. Oh, wow. It looks like they just took a pair of side cutters to the corner of this PCV. Did they just put a glob of solder to hold this in place on a screw? You gotta do what you gotta do. What the heck? That is exactly what they did. Do you see this? That's really bad. If we plugged a working wifi device into this, there is no reason why this wouldn't work. Unfortunately, we were not able to find modern working drivers for this particular Wi-Fi chipset. I'm gonna go first. It's pretty tough, really real good competition here, but Tesla coil 100% is getting a vote. And then number two, I think, has to be the fidget spinner mouse. As somebody with a double diamond AliExpress account, the only thing that has not been advertised to me is the Tesla coil. However... Plouffe's motherboard is also very interesting, because when we did a video on this concept, it was about a Taobao PC, which is technically not the same thing as AliExpress. I'll take it. I'm gonna have to vote for the Tesla coil and the mouse. Damn, I'm getting shafted. You know what? Okay, Tesla coil and Jake's diagnostic. I have to vote for the solder joint in that dish. Yes, I get one vote! And the mouse, of course. I didn't get a single vote. You did! I gave you one! No, I don't want that doesn't count. This isn't even yours, though. No. Adam wins by proxy so far, so far. I'm going mouse and mouse and Wi-Fi. Yes! Two votes for. no, I don't want your pity vote. Maybeactually, is it a tie between the Tesla coil and the mouse? Yeah. Well, what do we do then? We only have one trophy. Okay, we have a deciding vote. Andy. Oh my god. Tesla coil or the mouse? I'm gonna give you give the Tesla. Adam is the winner! I sort of won by proxy. His trophy is... this model of a Tesla coil. I want the parrot. What? I want the parrot. You didn't win. You didn't even pick it. Wait, that parrot? He wants the parrot. He wants the set dressing. You can't have that. Well, what? That's a company parrot. You have to give it to Adam. Fine. What is that supposed to be? A parrot. A parrot. Look at the top. What the hell's in the beak? No, you idiot. The top. I got to leave. What is this? That I don't know. It looks like it holds something. Yeah. You know what else it holds? It holds the segue to our sponsor. Manscaped! Make sure your bits and bobs are in tip-top shape thanks to Manscaped and their Performance Package 5.0 Ultra. It includes the Lawn Mower 5.0 Ultra growing and body hair trimmer. Turn that overgrown forest into a serene garden, but just don't expect any flowers to start growing there. If they do, please seek help. Also included is the Weed Whacker 2.0 electric nose hair trimmer, so it doesn't look like some eldritch horror is trying to escape from up there. You'll also get their Crop Soother Aftershave Lotion and Crop Preserver Anti-Chafing Deodorant to keep you smelling fresh down in your nether regions. It even comes with two free gifts, a toiletry bag for your grooming essentials, and a pair of their Boxers 2.0 to keep your family jewels tucked in all nice and cozy. Check out the Performance Package 5.0 Ultra at manscaped.com/techtips and use code techtips for 20% off and free shipping. If you guys enjoyed this video, maybe go check out the first time we did this. It got almost equally off the rails.",
    "transcript_keywords": [
        "Whoa whoa whoa",
        "Whoa whoa",
        "Yeah",
        "Whoa",
        "Tesla coil",
        "computer",
        "Tesla",
        "god",
        "thing",
        "Plouffe",
        "trophy",
        "mouse",
        "RGB",
        "vote",
        "coil",
        "Wait",
        "good",
        "Plouffe computer",
        "video",
        "turn"
    ],
    "transcript_entity_values": [
        "Russian",
        "the years",
        "Aliexpress",
        "the App Store",
        "one",
        "Nuk",
        "second",
        "20",
        "American",
        "four",
        "first",
        "Jake",
        "Maybeactually",
        "Mook AI",
        "100 megabit",
        "Billy Mays",
        "Tanner",
        "Crop Soother Aftershave Lotion",
        "Two",
        "One",
        "RGB",
        "First",
        "seven inch",
        "PCI-RS",
        "2001",
        "Wi-Fi",
        "Manscaped",
        "Hercules XP",
        "Vince",
        "PCV",
        "2011",
        "Maximum PC Dream Machine",
        "Taobao",
        "AliExpress",
        "today",
        "Alex",
        "VW Golf",
        "Andy",
        "2013",
        "Pokemon",
        "Plouffe",
        "Russians",
        "Pokemon",
        "Bluetooth",
        "PCI",
        "the Lawn Mower",
        "R.",
        "Mook",
        "the Wigi Dash",
        "Tesla",
        "M.2",
        "100%",
        "Android",
        "LTT",
        "20%",
        "a second",
        "2023",
        "1D",
        "CPU",
        "5.0",
        "the Performance Package 5.0 Ultra",
        "sec",
        "USB",
        "two years later",
        "Adam",
        "French",
        "H61",
        "NVME",
        "thousand",
        "G-SKILL",
        "Wi-Fi",
        "two",
        "20 bucks",
        "SATA SSD",
        "Xeon",
        "Colin"
    ],
    "transcript_entity_types": [
        "NORP",
        "DATE",
        "LAW",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "LOC",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "NORP",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "NORP",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "PERCENT",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "LAW",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "LANGUAGE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON"
    ]
}