{
    "id": "Yj-qnDCHf8w",
    "title": "The World's Fastest Gaming GPU vs...VGA?",
    "channel": "Dawid Does Tech Stuff",
    "channel_id": "UCvcRA2Hva1lULVf4GCouH8w",
    "subscriber_count": 688000,
    "upload_date": "2022-04-16T13:00:14Z",
    "video_url": "https://www.youtube.com/watch?v=Yj-qnDCHf8w",
    "category": "Science & Technology",
    "tags": [
        "dawid",
        "dawid does tech stuff",
        "PC",
        "gaming",
        "intel",
        "AMD",
        "Corsair",
        "Gaming",
        "Game",
        "Computer",
        "Gaming PC",
        "David Does Tech Stuff",
        "DDTS",
        "Tech",
        "Stuff",
        "rtx 3090 ti",
        "vga",
        "this seemed like a good idea"
    ],
    "views": 803223,
    "likes": 27898,
    "comments_count": 1729,
    "description": "Gigabyte sent me the most expensive graphics card they make, and to balance it out I decided to try something.  Gigabyte Links (Not Affiliate): RTX 3090 Ti Extreme Waterforce:  Z690 Aorus Extreme:   Microcenter links: WD Black SN750 SE 1TB 3D TLC NAND PCIe Gen 4 x4 NVMe M.2 Internal SSD:  *New Customers Exclusive*  Get $50 off your purchase of select new CPU:   Get some AWESOME Dawid merch here:   -Here is a link to my Patreon page, it would be awesome if you check it out:   -Follow me on whichever Social media you don't hate- Best Website On The Internet:  Discord:  Twitch:  Twitch shorts channel:  YouTube:",
    "description_links": [
        "https://www.gigabyte.com/Graphics-Card/GV-N309TAORUSX-W-24GD#kf",
        "https://www.gigabyte.com/Motherboard/Z690-AORUS-MASTER-rev-1x#kf",
        "https://micro.center/5cb9c0",
        "https://micro.center/915337",
        "https://dawiddoesmerch.com",
        "https://www.patreon.com/DawidDoesTechStuff",
        "https://www.tenthiddy.com/",
        "https://discord.gg/b34uVGaYVB",
        "https://www.twitch.tv/dawiddoestechstuff",
        "https://www.youtube.com/channel/UCAiMJaOrvTik7XyJethz-ig",
        "http://www.youtube.com/c/dawiddoestechstuff"
    ],
    "transcript": "Now I don't often like to accept super high-end stuff for videos because i prefer to do videos on things that i can realistically go out and buy myself. However when gigabyte sends you an email that was clearly destined for Linus's inbox, you kinda gotta say yes. So today we're gonna do a video on the graphics card equivalent of that ice cream that Mr. Beast ate once. and then to balance it out, I'm gonna do the dumbest thing I could think of with it... Now gigabyte also sent over a fancy Z690 motherboard the Aorus master Presumably because the graphics card won't associate with riff-raff motherboards. Whoa this is by far the heaviest motherboard box I've ever picked up because I guess it's hewn from depleted uranium. It's so heavy. This is like at least double the weight of a normal motherboard. That is... that is really heavy.. damn that is one crazy VRM heat-sink. When you actually look at it from the top it seems like it extends pretty much all the way to the to the I.O. and then speaking of the heatsinks we've got this huge chunk monster that is supposed to cool the m.2 drive underhere. I think you know a motherboard's serious when it has a huge metal backplate like that. That is beautiful. We even have built in 10 gigabit ethernet in this motherboard and it's got the most important feature ever which is a physical power button on it. That in itself is worth $200 at least. But with that let's have a look at the rtx saudi prince. Oh yes, The 3090 tie. A graphics card that solidified Nvidia's reputation as the kind of company that would probably burn down a puppy orphanage if they thought it would make their shareholders happy. but that doesn't make this any less crazy of a graphics card and this is the extreme version of it which comes with some exciting things attached to it. So let's open it up and have a look. oh Look at that tube! Oh, it's in two pieces. Of course it's in two pieces because there's a big thingunder it. Kind of remove this bit which is the graphics card bit, and then you can kind of separate out that and then under... oh what... we get a toy with it! He's been shackled because without that, he would have broken free and just desecrated the graphicscard in the packaging - I'm assuming - but I'll put him back in his tomb before he asserts his dominance on me. Damn look at that... we've got three eight pins and then it leads to that single nvidia 12pin thing. So that is a 360 millimeter AIO radiator connected to our 3090 ti. So let's get it out of this little baggie and and have a closer look at it. So as you can see it's not a super long pcb, but it is quite a chunky one, so it's a bit of a chode if you will. Which kind of makes sense, you know - because you got most of the cooling on the actual card. That is plastic. I was expecting that to be mithril, so that is a little bit disappointing. I guess now in terms of rear I.O. it's got a pretty standard affair. We've got a single HDMI with three display ports.So unfortunately we're not going to be able to do a six-panel mesozoic period display setup with the graphics card, but hang on to the thought about mesozoic period ports, because we may involve one in this video a bit later. Now there is our backplate, Which is a complete fingerprint magnet, as you can tell. Look at that! This is our NV link connector, so we could theoretically run two of these in a single system. If you don't already feel like enough of an oil baron running one of these, you can run two of them as well. And then finally here is the new 12V power connector that should become more popular with the next generation of graphics cards. Lean that over because I want to have... oh ooh... almost dropped stuff there.. This is actually quite a dense fin array. Uh.. but I think on that note we're gonna have to jump to the future and do a tear down of this graphics card. Now I really like how they went about powering the fans on the radiator, because there's this single little wire that runs along the AIO tube and then it runs along the top of the fans - like that - so that you don't have to worry about a bunch of fan connectors. That's pretty cool.. Well okay, so tearing down a graphics card that's worth more than my life is.. is.. quite scary. The huge radiator and tubes do make it quite unwieldy... Oh oh.. it is just a huge copper plate with some heat pipes that cools pretty much everything and then it's attached to an AIO block under here that means that the VRM's and all of that is just cooled using the AIO which is good. Yeah, I know, I don't want to put too much pressure on it because I don't want to... I don't want to destroy this very valuable thing. Uh, so let me - yeah - let's just leave it at that. Holy crap. Now this is an extremely dense PCB. Like there is so much going on and uh that's also a huge die. It's so big! Another thing that's interesting to me is that you can see that there are some blank spaces for additional power delivery. Which doesn't make any sense. This is the 3090 tie right? Like what are you gonna use that needs more power delivery on this PCB. That's a bit of a weird move. Maybe there's a higher end version that Gigabyte's going to bring out at some point. I don't know. Now in terms of actual power delivery, that is the just craziest VRM I have ever seen on a graphics card. I think this is 19 phases, if i'm not mistaken. One, two, three, four, five, six, seven. Okay so I count 22 phases, but I'm not sure how they're arranged it. Could be like an 18 + 4 or something. I'm not sure. Either way though, that's crazy! Now just a couple things about the back. Aside from the just mad density back here, uh there's only a couple of small thermal pads that thermally connect the back plate to the back of the PCB. Although maybe they don't need more pads considering that they have so much AIO cooling all the componentry and then, other than that, there's this protective coating that they have over the PCB, which actually seems like quite a good idea. I like that. And then finally that die is an emasculating behemoth. Okay so now that we've had a more intimate look at the 3090 tie. Let's put this whole system together and game on it in just the dumbest way I can think of at the moment. Let's go for it! Now for storage I'm going to use one of these WD Black SN750 drives - which was very kindly sent over by Micro Center. sings *Miiirccooo Cennnteeerrr*. Now, in terms of power supply we don't want anything catching on fire, so I'm going to use this beefy HX1000 that corsair sent over ages ago. Now this is by far the epeeniest setup that I have ever looked at on this channel, which I feel like means we should kind of balance it out a little, right? We should 'Dawid' it up a bit so I'm gonna test it in the only logical way. Which is using a mesozoic period port monitor. Now the more astute of you probably would have noticed that this 3090 tie doesn't have a mesozoic period port on it because, well obviously. So we're going to need a bit of a converter. Luckily they're quite easy to find. All I had to do was buy this HDMI to mesozoic period port adapter, which should let us very easily use this behemoth of a graphics card, with this very old undeserving monitor! Nice! We've booted into the bios and we have a signal out to our mesozoic period monitor, which is good. Uh, yeah. All I need to do now, is install windows and then we can try and game on this! As is tradition, we're starting off with GTA 5. This is with it running at 1080P. This is actually a terrible game to test this with, because the moment that you start averaging about 160 or 170 frames per second, the game engine starts stuttering into oblivion. I - wha.. why is this happening? That is the most messed up frame graph I've ever seen. What the hell? Well let me let me try something. I.. I'm not quite sure what was going on there. I just plugged the external games drive into a different USB port, so for some reason that fixed it but as you can tell the system is not doing much to give this frame rate, at 1080p over mesozoic period port. And, uhm... wow those GPU temperatures are wild but anyway screw this, let's go to a game that makes more sense. We're using 3.7 gigs of video memory which makes me very glad that we've got 24 gigs of it in. This graphics card... wait a minute... I... I need to see if i can - uh - bypass that 200 FPS limit. Ah yes. There wego. I figured out how to unshackle the game engine and uh we're using a lot more of the GPU now. Although weirdly, now that we're running at so much of a higher frame rate there's this like strobing artifact on the monitor now. I don't know if you can see this on camera, but it, I don't know, it looks like the frame rate is like over driving the monitor and it like 'summons gonna explode' but yes, with the unshackled frame rate we do occasionally hit about a hundred percent utilization on our 3090 tie. Um but honestly, most of the time it, it's kind of in like 160 kind of range and it's still quite stuttery. I don't really know why that is? Well we almost hit 400 watts of power draw there and we're still under 50 degrees celsius. Wow. I really wish my monitor could display more than 60 hertz so that I can actually benefit from this frame rate. I don't know, maybe that'll do the trick? Let's see. One should run at like 20 frames per second with a hundred percent GPU utilization. I mean I wasn't super far off. We're at 60 frames per second. Oh look at all them rays being traced! So clearly, you need a 3090 tie to run cyberpunk at max settings at 1080P. and then you still get 60 frames per second. So let's see if we can get a higher frame rate than that. I think our best bet is gonna be some DLSS action. Let's try quality DLSS. Oh it did help! We went from just under 60 frames per second to about 70 frames per second. So I really am glad that the 3090 tie does have some DLSS in it. It's still quite stuttery though. Everything has been quite stuttery. Like look at that frame graph? Okay let's put it in performancemode, because, you know we want to get some performance for our very expensive GPU. So with performance mode DLSS, running at 1080P: The actual render resolution that this 3090 ti is busy rendering, is 960 by 540. We're only getting 93 frames per second. That is... that is... kind of wild! Now on a different note, considering that mesozoic period port monitors have a bit of an analog haze to them. I can't actually tell thedifference in sharpness between DLSS 'ON' and 'OFF', on this monitor. Which, that's a pretty cool advantage of running an analog display in the age of DLSS. I think if there's any game that's actually going to stress this system at 1080P, without the engine exploding it's gonna be Doom Eternal. 'Ultra nightmare' isn't that just a colloquial term for sleep paralysis? I guess... I guess it is? Well the weird monitor artifact is back you can see that there's kind of like strobing happening but look at that frame graph! That is what I'm looking for! And you can actually really tell that 400 frame per second smoothness over this, uh this 60hz mesozoic period port monitor. Doom Eternal has like the most impressive game engine ever. Like it's kind of shockingly impressive. Actually, let me... I... I really want to see this on a higher refresh rate monitor, so I am going to remove the mesozoic period port monitor for a second. Whoa that is that's actually kind of wild! It is making some weird sounds at me though. I can play the graphics card like an instrument by changing where I'm looking. Wait a minute wait a minute, I need to set up a microphone so we can hear that properly. so now that we have the real chad monitor back in rotation, I just want to see quite how far we can push the Doom engine and let's do that using DLSS. Again, the thing that stands out to me is that you can't really tell the DLSS is on with this monitor. So that is a benefit I guess? But other than that we have gotten maybe a couple hundred FPS more. I mean let's see if we can push it further. Like do we just drop the settings down to low again? Visually it looks pretty much identical. I can't really tell. We are getting close to a hundred percent utilization on our 12 900K. I actually just noticed that. That's pretty crazy actually. So having finally found a way to fully stress this monster system with this stupid monitor pairing, I think that brings us to the end of the video. Thank you Gigabyte for sending over that behemoth graphics card. Anyway, Thank you very much for watching. If you enjoyed video. Like and subscribe to the channel for more videos like this one and maybe consider watching another video. I recommend the one where I build the world's worst multi-display gaming setup. That'll pop up in a second. Anyway, thank you for watching and until a couple seconds from now, bye!",
    "transcript_keywords": [
        "graphics card",
        "mesozoic period port",
        "mesozoic period",
        "graphics",
        "card",
        "monitor",
        "period port",
        "frame",
        "kind",
        "frame rate",
        "period port monitor",
        "DLSS",
        "period",
        "mesozoic",
        "frames",
        "bit",
        "port",
        "game",
        "graphics card bit",
        "port monitor"
    ],
    "transcript_entity_values": [
        "1080p",
        "a minute",
        "six",
        "DLSS",
        "Dawid",
        "three",
        "540",
        "FPS",
        "Nvidia",
        "USB",
        "HDMI",
        "3090",
        "VRM",
        "200",
        "DLSS",
        "1080P",
        "seven",
        "60hz",
        "Linus",
        "a 360 millimeter",
        "1080P.",
        "One",
        "two",
        "four",
        "19",
        "about 70",
        "Beast",
        "12 900K.",
        "second",
        "saudi",
        "chad",
        "12pin",
        "I.O.",
        "today",
        "PCB",
        "HX1000",
        "a couple seconds",
        "400",
        "3.7",
        "one",
        "Miiirccooo Cennnteeerrr*",
        "12V",
        "Micro Center",
        "GPU",
        "a hundred percent",
        "93",
        "Aorus",
        "160",
        "1080P",
        "a couple hundred",
        "Black SN750",
        "NV",
        "GTA 5",
        "three eight",
        "Gigabyte",
        "18 + 4",
        "AIO",
        "about 160",
        "five",
        "more than 60",
        "20",
        "24",
        "200",
        "Doom Eternal",
        "60",
        "the age of DLSS",
        "just under 60",
        "400 watts",
        "170",
        "over ages ago",
        "50 degrees celsius",
        "corsair",
        "22",
        "10",
        "960"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "NORP",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "FAC",
        "GPE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL"
    ]
}