{
    "id": "yJuO_HAg7QA",
    "title": "What To Do with Apple's $999 Pro Stand (without Pro Display XDR) - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2019-12-19T21:00:16Z",
    "video_url": "https://www.youtube.com/watch?v=yJuO_HAg7QA",
    "category": "Science & Technology",
    "tags": [
        "What To Do with Apple's $999 Pro Stand (without Pro Display XDR) - Krazy Ken's Tech Misadventures",
        "Apple",
        "Apple Mac Pro",
        "Mac Pro",
        "Pro Display XDR",
        "Pro Stand",
        "Apple Pro Stand",
        "iPad",
        "Pro Stand Unboxing",
        "Tech",
        "Comedy",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Humor",
        "Funny",
        "Computer Clan"
    ],
    "views": 400224,
    "likes": 15064,
    "comments_count": 871,
    "description": "You can use Apple's Pro Stand to fit in with the Mac Pro crowd! Just because you don't have the Pro Display XDR, or a Mac Pro, doesn't mean you have to suffer Mac Pro FOMO (fear of missing out).  Support the show and get in the credits   Subscribe for more tech videos!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures - What To Do with Apple's $999 Pro Stand (without Pro Display XDR)  Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!*   Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?    Amazon links are powered by the Amazon Associates Program.  *not all Patreon tiers qualify for all rewards  #KrazyKen #ComputerClan",
    "description_links": [
        "http://Patreon.com/KrazyKen",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://Patreon.com/KrazyKen",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- Our next item up for auction is a beautiful piece by Sir Jonathan Ive from 2019 titled Pro Stand. Let's start the bidding at a completely reasonable $100. Do I hear $150? - (man) $1,000! (audience gasps in surprise) - What? Seriously? A thousand dollars for this? Are you crazy? Dude, they don't pay me enough for this (beep). Okay, you know what? Enjoy your metal stand, enjoy this. You know? Sold. I accidentally auctioned off my gavel, okay? That's the best I can do. I don't get paid enough for this-- (beep) (beep) (beep) (keyboard typing) (beep) (upbeat electronic music) - Hey guys, how are you all doing? Really? That's just great. You know, I'm doing pretty great today too because we have this massive box in the lair today. This is the Pro Stand. So, Apple's new display is $5,000 and the nano-texture version is $6,000. If you're like me, you probably can't afford the display. But you wanna fit in somehow, so you don't suffer from Mac Pro FOMO. I just coined that by the way. This is probably the most expensive monitor stand in the world. So what we're gonna do today is I'm gonna show you after I unbox it quickly what you can actually do with this thing, so you can get use out of it and not just buy it and do nothing with it. So let's peel this off, pull this baby out, and we will extract the core or the-- (chuckles) oh, oh my, the core (thud) from the reactor here. Okay, that's good, wow. Wow, shnikies! Dude, this is some heavy-duty packaging right here. Ooh, that smells...interesting. Very sterile and plastic-y or boxy. I don't know what the smell was, it smelled weird. Okay, you know it's probably glue. Wow! Holy crap! This thing is THICCC! This thing is thick with three C's! Look at this! (knocks on metal) I'm starting to see-- (beep) (nervous laughter) This is heavy! I'm starting to see why this is $1,000. It's really beautiful. You got the magnetic attachment for your monitor. This can just be a fidget toy. That could be one of the uses, it's a fidget toy. I just want to remind everyone this is the stand that was priced so unexpectedly, that there was a stir in the audience when it was announced. - The VESA mount adaptor will be $199 and the Pro Stand $999. (crowd murmurs) And like the Mac Pro, they'll all be available in the fall. (quack) - So now, let's dive into some of the creative uses you can actually use this thing for if you can't afford the display itself. Use it to hang your clothes or a coat. As a bonus feature, if you have a metal hanger, you can use the magnetic feature to hang your clothes. Okay, maybe not. If you have any books, or maybe just the Sonic the Hedgehog encyclopedia, you can use this thing as a bookend. Now, for the ultimate experience, (thud) you may need to buy two of 'em. Tails is a boy? What! You know what, you can also use it as a crowbar. (knocking on door) Come on honey, (country music in background) just come back out. I didn't mean it. Look, don't make me break down your door again. I can probably do it with this thing, but it's really expensive and I don't wanna get a scratch on it. Could you at least stop playing the country music? Wait a minute. I'm not married. This also isn't my house. Sometimes we've all nearly adopted the dark, so this stand works perfect as a lamp. So simply take one of your LED lamp fixtures and attach it to the mounting feature and there you go. Now you have a lamp. And you can adjust it with ease and you'll have to hold it in place, that's the only flaw 'cause if you let go (bleep) (metal clattering) (beep) This device has two ways to hold cables. It has the hanging feature, which is really convenient. But it also has the hole feature. So if you have maybe a shorter cable, you can just kinda feed that through here and Bob's your uncle. So it's a perfect way to sort and organize all of your IEC cables that for some reason you have lying around. The beautiful craftsmanship of this design also lets you use it as a perfect straight-edge. And there we go. A perfectly straight line. Use it as a paperweight. (paper smacks table) (thud) Ten out of ten. You know, as a bonus feature it also has a built-in magazine stand that actually works pretty well. The magazine is almost as much as the stand is, give or take $900. Use it to pump iron. Add this baby to your workout routine. Feel the burn, 100 more reps. Ah! I just got word that we have a new user submission. They suggested we use it as a... Wait, what? How would that even? How-- No! (stutters) No! And hey, what time is it? I don't know, how about you use this thing as a sundial? I just remembered that I'm 10 stories underground and there is no such thing as sun so I will simulate the sun with my sun simulator. And let's see... - (man) Hey what time is it? - Oh, it's ten to, tend to your own damn business. If you're really wishing to push the limits of your load-bearing capacity of this thing, why not attach your iPad to it? This is a perfect stand for an ergonomic iPad viewing experience. There you go guys, those are all the uses I could think of. And if you have any other creative ideas, do let me know in the comments down below. And thank you to my awesome Computer Clan Discord community for helping me think of some fun ideas as well. Also, since we're talking about Apple stuff, if you're interested in other vintage Apple products like time traveling, I actually do another show called Vintage Apple Vault which is really fun, so I highly recommend checking that out. Or if you wanna watch more (electronic beeping) crazy tech shenanigans, you can watch a bunch of other Krazy Ken episodes. I have over 100 of them, it's a very bingeable show. Thanks for sticking with me, catch the crazy, and pass it on. (upbeat electronic music)",
    "transcript_keywords": [
        "Sir Jonathan",
        "piece by Sir",
        "titled Pro Stand",
        "Pro Stand",
        "Stand",
        "thing",
        "Pro",
        "titled Pro",
        "Mac Pro",
        "Sir",
        "Jonathan",
        "Mac Pro FOMO",
        "feature",
        "Apple",
        "vintage Apple",
        "beautiful piece",
        "Pro FOMO",
        "perfect",
        "wow",
        "Hey"
    ],
    "transcript_entity_values": [
        "2019",
        "IEC",
        "Vintage Apple Vault",
        "A thousand dollars",
        "the Pro Stand $",
        "THICCC",
        "a minute",
        "two",
        "Apple",
        "VESA",
        "100",
        "the Pro Stand",
        "ten",
        "iPad",
        "999",
        "199",
        "today",
        "Pro Stand",
        "Krazy Ken",
        "the Mac Pro",
        "over 100",
        "Bob",
        "one",
        "900",
        "10",
        "6,000",
        "Mac Pro FOMO",
        "100",
        "Jonathan",
        "5,000",
        "1,000",
        "Ten",
        "150",
        "three"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "CARDINAL"
    ]
}