{
    "id": "YkkBViYjSGY",
    "title": "OnePlus 8 review: a familiar formula",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-04-14T15:51:59Z",
    "video_url": "https://www.youtube.com/watch?v=YkkBViYjSGY",
    "category": "Science & Technology",
    "tags": [
        "oneplus 8",
        "oneplus 8 review",
        "oneplus",
        "8 pro",
        "oneplus pro",
        "new oneplus",
        "oneplus phone",
        "oneplus 8 pro review",
        "oneplus 8 pro hands-on",
        "oneplus 8 hands on",
        "review",
        "hands on",
        "first look",
        "wireless charging",
        "wireless charger",
        "5g",
        "refresh rate",
        "screen",
        "display",
        "price",
        "battery",
        "camera",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "iphone",
        "iPhone 11 pro",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 256044,
    "likes": 5386,
    "comments_count": 448,
    "description": "The OnePlus 8 is the less expensive of the two devices OnePlus announced today. It might not have the IP-rating or wireless charging of the 8 Pro, but its still a capable phone in its own right, with a stunning screen, great performance, and solid battery life. Itll retail starting at $699.  Clarification: The unlocked model doesnt have an IP rating, but carrier versions do. In this video, we reviewed the unlocked model.  Read the full review:   Vox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. For more information, see our ethics policy here:   Buy the OnePlus 8:   Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/3ackE8a",
        "http://bit.ly/2TQsqjB",
        "https://fave.co/34zoAyw",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "(eccentric electronic music) - Here's the OnePlus 8, the OnePlus device for people who want this year's model, but maybe aren't into some of the wackier ideas that OnePlus is experimenting with its Pro models. It starts at $699, which is $200 less than the Pro device that Dieter's taking a look at in his review, but all of the OnePlus essentials are still here. It's still got a great screen. It's still got great battery life. It's fast charging, it's still fast, and it's take on Android is still just as clean as ever. And you're getting a screen with a 90 hertz refresh rate, which is honestly, still so good that I wish it was a standard-issue feature for most modern flagships. Now, if you think that sounds like a fairly traditional OnePlus device, then you're not wrong, but the difference this year is that with the 8 Pro, OnePlus has finally addressed some of those issues that OnePlus fans have been asking about for years. It's a device that really makes a serious attempt to break the OnePlus mold. The OnePlus 8 hasn't quite made that same attempt, but it's still a good phone at a good price, which really begs the question, is a good OnePlus device that doesn't break the mold worth it? Or do you need to spend the extra money on the Pro? (calming ambient music) But the OnePlus 8 is a solidly-specced device. It's powered by a Snapdragon 865, starts with eight gigabytes of RAM and 128 gigabytes of storage, but I've been using a model with 12 gigabytes of RAM and 256 gigabytes of storage. There's 5G onboard, Wi-Fi 6, all that good stuff, and that's a lot of spec for $699. Especially compared to, oh, I don't know, the, pretty much identically priced entry-level iPhone 11. So essentially, you're getting most of the internal specs of the OnePlus 8 Pro in the OnePlus 8. The exception that OnePlus is keen to emphasize is that the Pro is using LPDDR5 RAM, while the 8 is using LPDDR4X, but I struggled to notice the difference in real-world usage. I mean, the two phones even look damn near identical from the front because they both have that same hole-punch, selfie cutout at the top left of the screen. Yes, the 8 screen is ever so slightly smaller at 6.55 inches, compared to the 6.78 inches on the Pro, but the two phones are basically the same width, so they don't really feel any different to hold. I mean, seriously, when I was taking comparison photographs, I occasionally forgot which one was which. I will say that the 8 screen seems to curve ever so slightly less around the sides of the device, which is maybe why I didn't experience the accidental touch issues that Dieter had with the Pro, but honestly, it's really subtle, and you have to really be looking for it to actually notice it. All of which is to say, the OnePlus 8 is not a device to get if you're after a smaller phone. Personally, I'd love to see OnePlus experiment with a smaller device, but hey, maybe that's just me. Of course, the screens aren't actually identical. With the 8, you're getting a 1080p, 90 hertz display, with a peak brightness of 1100 nits. Meanwhile, the 8 Pro goes up to 1440p, 120 hertz, and 1300 nits peak brightness. But please, don't let this numbers-to-numbers spec comparison lead you to believe that the 8 has a bad screen. It doesn't, it's great, it's bright, it's vibrant, and it's yet more evidence that OnePlus really, really knows how to put the right display on a phone. Even compared to the 8 Pro, the 8's display still feels smooth. It took me sitting with both phones side-by-side to spot the difference, and even then, it wasn't a night and day comparison. The phone feels nice and snappy to use. Apps open quickly, games run well. You're getting a flagship Android experience here. Oh, and OxygenOS is just as out of the way as ever, which is exactly what I want out of a manufacturer's operating system. I'm looking at you, LG. (calming music) So I've been scurrying around the issue for a little while, but what are the differences between the 8 and the 8 Pro that actually matter? Well, to my mind, there are three main differences that you need to worry about, person who watches YouTube reviews of OnePlus phones. Namely, IP ratings, wireless charging and cameras. So let's just come out and say it. The OnePlus 8 doesn't do wireless charging. It doesn't do the fancy 30 watt wireless charging, the OnePlus 8 Pro, and it doesn't do the more basic five watt wireless charging that basically every other flagship device does at this point. You already know if it's a feature you want or not, so I'm not gonna labor the point too much other than to say that it's still a bit of a bummer. It also doesn't have an official IP rating, which wouldn't be surprising coming from OnePlus, apart from the fact, the company has finally relented and actually added one to the 8 Pro. And yeah, the company claims that it'll still survive being used in the rain and whatever, but come on. And also, finally, the camera's different. So let's dig in. There's good news and there's bad news contained within this triple-camera array, which consists of a 48 megapixel main camera, a 16 megapixel ultra-wide camera, and a two megapixel macro camera. The good news is there's no gimmick lens here. The bad news is you don't get a zoom lens. The macro lens is tricky, and you also don't get a main sensor that's quite as good as the 8 Pro. It's still 48 megapixels, which yeah, is the same, but long story short, it's an older sensor, and it's just, well, see for yourself. In bright conditions, I think it holds up well against both the OnePlus 8 Pro and the Pixel 3 I happen to have for comparison's sake. If you check out these shots I took during my government sanctioned walk around the block, I'll be well-pressed to tell a difference between the 8 and the 8 Pro, and the Pixel 3's images have a slightly softer look in comparison. Look at this picture of a car and you'll see the hedge behind it tints slightly yellower on the 8 compared to the Pro, but look, it's minor. It's after the sun goes down that things start to go badly for the 8. Things are just a lot brighter and clearer on the Pro. Faces can look a little smooth, weird and brightened, especially at night. Oh, and here's some selfie shots, and OnePlus uses the same 16 megapixel selfie sensor between the 8 and the Pro, so they're aren't many differences there, but there definitely seems to be some kind of skin brightening going on compared to my Pixel 3, especially considering it's managed to correctly expose the sky behind me. Obviously, you don't get a zoom lens with the 8, but you do get a macro lens and, (groans) I don't really know how useful it is. Look, I'm not gonna deny that under the right circumstances, you can get a little bit more detail with the 8 than the Pro. I took these two shots from the same distance away with both phones with their macros modes turned on and let them do their thing, and sure enough, you can see a little bit more detail in the shot from the 8, but other times, I straight up got a better macro shot out of the 8 Pro, even though it doesn't have a macro lens, like with this horse head on a Venetian mask, which I just couldn't get the 8 to focus on no matter how hard I tried. Or if you're more of a video person, then you can see for yourself what it looks like. This is from the 16 megapixel front-facing camera. So the easy answer is that if you want the better camera setup, you gotta go Pro, especially if you want a zoom lens and better low-light performance. But the much harder question to answer is how well the modestly priced OnePlus 8 competes against similarly priced rivals. And let's not forget, these include the entry-level iPhone 11, and honestly, I just don't think the 8 quite nails it. I can't really complain about the battery life in OnePlus 8. It's got a 4300 milliamp hour battery, and I haven't even been able to come close to running it down with a full day of use. Although, you can't charge it wirelessly, it supports Warp Charge 30T, which can charge your phone in around an hour. So this is a nice phone, but you already knew that. It's a OnePlus phone, at this point, there's just certain things you can kinda take for granted. It's got a great screen, it's wicked fast, it's solidly built. It's camera can stand to be a little better, and for reasons that seem to apply only to OnePlus, it doesn't support wireless charging or have an IP rating. So yeah, the OnePlus 8 doesn't really break the mold, but I don't think that makes it a bad phone. It just makes it a little predictable at this point, but that makes for a hard choice. Do you go for the predictable OnePlus phone, or do you spend $200 more for a device that definitely overcomes some of these long-standing issues? You'll have to watch Dieter's review of the OnePlus 8 Pro for a complete look at that device's strengths and weaknesses. But a lot of the choice comes down to this, is a $200 price premium worth it for wireless charging and IP rating and a slightly better camera? Because if it's not, then the OnePlus 8 is a great phone. All right guys, thank you so much for watching this review in these super weird times, and I truly hope you are staying as safe and well as you can be at the moment. And check out the super janky camera setup that we've had to use as Alix has directed me remotely (laughs) from zoom. Anyway, thank you so much guys, and check out theverge.com for the full review of the OnePlus 8 and OnePlus 8 Pro, see ya.",
    "transcript_keywords": [
        "Pro",
        "OnePlus",
        "device",
        "OnePlus device",
        "phone",
        "OnePlus phone",
        "camera",
        "Pro device",
        "good OnePlus device",
        "good",
        "wireless charging",
        "screen",
        "charging",
        "phones",
        "lens",
        "Pro models",
        "wireless",
        "wackier ideas",
        "great",
        "megapixel"
    ],
    "transcript_entity_values": [
        "90",
        "Android",
        "1100",
        "one",
        "30",
        "6.55 inches",
        "256 gigabytes",
        "eight gigabytes",
        "a full day",
        "three",
        "16 megapixel",
        "120 hertz",
        "Wi-Fi 6",
        "LG",
        "OnePlus 8",
        "around an hour",
        "128 gigabytes",
        "year",
        "8",
        "5",
        "90 hertz",
        "30 watt",
        "five watt",
        "Dieter",
        "Pixel 3",
        "Venetian",
        "years",
        "hertz",
        "night",
        "4300 milliamp hour",
        "two",
        "Warp",
        "OnePlus 8",
        "selfie",
        "this year",
        "200",
        "OnePlus 8 Pro",
        "6.78 inches",
        "OnePlus",
        "iPhone 11",
        "YouTube",
        "48 megapixels",
        "1300",
        "IP",
        "Alix",
        "48 megapixel",
        "RAM",
        "12 gigabytes",
        "LPDDR4X",
        "OnePlus",
        "699"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "FAC",
        "ORG",
        "EVENT",
        "TIME",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "NORP",
        "DATE",
        "ORG",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "MONEY",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "PRODUCT",
        "MONEY"
    ]
}