{
    "id": "YLC9rZ2e0Ms",
    "title": "Can’t afford a Gaming PC? This one's $169",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-10-15T17:01:03Z",
    "video_url": "https://www.youtube.com/watch?v=YLC9rZ2e0Ms",
    "category": "Science & Technology",
    "tags": [
        "CapitalOne",
        "Capital One",
        "Capital One Shopping",
        "Shopping",
        "coupon",
        "coupons",
        "coupon codes",
        "price comparison",
        "Capital One Shopping Rewards",
        "Gaming PC",
        "$69 Gaming PC",
        "Cheap PC",
        "Cheap",
        "Linus Tech Tips",
        "LTT",
        "Budget Gaming",
        "Budget PC",
        "Z420",
        "RX580",
        "Intel",
        "Asus"
    ],
    "views": 4037444,
    "likes": 127261,
    "comments_count": 5035,
    "description": "Thanks to Capital One Shopping for sponsoring a portion of this video. You can check out Capital One Shopping here:   After spending $69 on a gaming PC, where can we go from here? Lets look at how we can get the most bang for the buck in all your favorite AAA games  Discuss on the forum:   Buy an ADATA SU760 512GB SATA III:  Buy an M.2 NVME to PCIe 3.0 x4 Adapter:  Buy a Samsung 970EVO Plus SSD:  Buy an Asus RX 580:  Buy an Intel Xeon E5 2687W:  Buy a Coolermaster Hyper 212 EVO:  Buy a goCoax RTL8125B 2.5GBase-T PCIe Network Card:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:01 Upgrading the GPU 2:54 Testing out some games 4:04 But what about the CPU? 6:47 Errors aplenty 8:38 Capital One Shopping! 9:21 How to fix CPU cooling error 11:56 Speed holes! 12:40 Time to cRAM in some more parts 15:10 More storage = more games 19:33 Conclusion 20:23 Outro",
    "description_links": [
        "https://www.capitaloneshopping.com/linus",
        "https://linustechtips.com/topic/1461260-can%E2%80%99t-afford-a-pc-you%E2%80%99re-wrong/",
        "https://geni.us/hgRlyo2",
        "https://geni.us/1Udnizm",
        "https://geni.us/Mn7POBB",
        "https://geni.us/iZyV",
        "https://geni.us/9QHq",
        "https://geni.us/c9p3",
        "https://geni.us/XJj2d",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- [Linus] Thanks to Capital One Shopping for sponsoring a portion of this video. - We just built a $69 gaming PC that is so blazing fast that it can play everything from CS GO, to Elden Ring, sort of. All it took was an eBay workstation, with a funny name, and a lucky GPU score from our friend, DudeGuyEveryman on Craigslist. But, what if we could give this budget beauty another boost? What new feats of potency could it reach for $169, $269, or even $420? Spoiler alert, it's gonna get really fast and you're gonna get really surprised. What isn't gonna surprise you is our sponsor, Capital One Shopping. Thanks Capital One Shopping for sponsoring this portion of the video. Capital One Shopping is a free browser extension designed to help you save money by instantly applying coupon codes to get you a better price. Learn more about Capital One Shopping later on in the video. Thanks to Capital One Shopping for sponsoring that portion of the video. What makes a gaming pc a gaming pc? Well, it's the GPU, obviously, right? And, I mean, sure, our $30 GTX 760 here will not be outdone in the bang for the buck department. And, yes, it can technically play just about any game even \"Tiny Tina's Wonderlands,\" but if we wanna do better than 720p at the lowest possible settings, this guy is gonna be the first to go, once our lawnmower business starts paying dividends. Let's look at our contenders then. At minimum, we want four gigs of frame buffer memory or VRAM, and we've got a hundred dollars to spend before we hit our next price tier. That gives us options like the 1660, 1650 Super, 1060, and 970. We ended up going with a GTX 1060, simply because back when we prepared this video, RX 580 prices hadn't yet been annihilated by the Ethereum merge, so, I guess I wasted a hundred bucks on this thing and I'm gonna go grab a Radeon RX 580 from the shelf and you should too. We went with this dual OC model from Asus but realistically, you could go with just about any RX 580, as long as it's not one like this, where it's got both an 8-pin and a 6-pin power connector, because our power supply only has a single extra Molex, and while it does have extras SATAs, and you can get adapters like this, to use a card like this one, I would not recommend this. (computer clanking) For minimal risk of fire then, stick with the dual 6-pin to 8-pin adapter, and a single 8-pin RX 580. Or failing that, you could go with a 570, a 480, or 470, or even a 1060 like we had specked out initially. Tool-less installation and that's it. Let's play some games. This my friends, is why we wanted four gigs of frame buffer. We're at 1080p high, which in DOOM Eternal is basically like medium. We're gaming ladies and gentlemen. I mean, okay, it's not pinned at 60fps, but, this is absolutely playable. Any dying that you see happening here, is because of my lack of skill, not because the game is not running well enough. Okay, let's go again. Where's the bad guys at? I'm only on the first level. It's in the wrong guy. Ah, this is definitely, definitely playable. It's not like oh yeah, we turned the details way down. It looks like absolute hot garbage. This looks fine. I think this is really impressive, but don't take my word for it. Look at these performance graphs. I mean, yeah, we're spending nearly three times as much, on the machine, compared to where we started, but, there are also cases where we're getting nearly three times the performance. That is great value for the dollar, but we are not done. No, no, no, no. I mean, what is the point of rocking a brand new, to us, GPU if it's gonna get bottlenecked by our weak CPU. The bad news is the locked down BIOS on our Z420 Workstation does not support the next generation of Intel Xeon chips, code name Ivy Bridge. The good news, though, is that many other boards from that era did support such upgrades so cast off Sandy Bridge chips, even really high end ones, are cheap and plentiful. The most powerful CPU supported by our motherboard then, is the E5-2687W. In single threaded tasks, it might not be much more powerful than our existing E5-1620, but it has double the number of cores, double the number of threads, and costs a mere $30 on eBay, with many of the listings even covering shipping within the continental U.S. Score! (cheering) Unfortunately, this CPU runs hot enough that HP figured it needed an all in one liquid cooler instead of (metal clinking) this thing. So, I guess we'll need to upgrade that too. Not to an AIO though. We've talked a fair bit about how water coolers are not always better than air coolers, and this wimpy thing is a prime example. Meanwhile, the Cooler Master Hyper 212 EVO supports LGA 2011, and can be had for the very attractive price of about 20 Canadian pesos. So, add about 15 real dollars to the cost of our CPU, another 5 to 10 for some thermal paste, and I'm expecting a pretty nice uplift for $50 here. What is up with this? This is a 5-pin band connector. Ah man, I love HEDT. (plastic clinking) (grunting) I love HEDT cooler installs. Take our fan, pop that on there, and now we just gotta plug ah, this is a 4-pin fan industry standard. Remember on the motherboard we had that 5-pin fan header? Well, a quick Google search later we find a post from user Silentbogo, on the TechPowerUp forums, who tells us that the motherboard header is actually a 4-pin fan header but just with two ground connectors, one on either side of the active pins. So, our workaround is to take a 4-pin fan splitter and use that to make it work. Conveniently, you can find these in two packs on Amazon, for about five bucks. Here's a little tech tip for you. We're just gonna pop these pins out, then we take our connectors in the exact same order, and we're gonna put them in on this side. All right, now we can take our standard fan, plug it into here, standard 4-pin connector, and we've ripped off our proprietary 5-pin connector, and we can plug that into the board. Yay. (computer beeping) (sighing) Really? - [Man] Wait, what? - Really you guys? All right, you don't tell me what cooling I need. The bad news is that this is not the only ridiculous error that could have you pressing F1 every time you want to boot your computer. The good news is that every single one of these errors has a solution that is both inexpensive, and can be executed with standard household tools. But, to show you how many things can cause these sorts of problems, let's go ahead and shut the system back off, and unplug some stuff. Let's unplug the RAM fan, front USB, let's take out this one, sure. And, whoop, sorry, let's fire it back up. (computer beeping) To be clear, it's kind of a cool feature, actually. It's just not the most convenient for performing janky upgrades. So, let's get everything restored to factory. The one we can't put back, though, is this one, which presumably is using that fifth pin to sense whether you have a water cooler or not. The really frustrating part of this, is that if we had opted for the slightly less powerful E5-2690 we probably could have avoided this problem all together. The 2690 is nearly identical to our W workstation chip in every way. It's even the same price on eBay. But, its base clock is 200 megahertz slower, and therefore it's TDP is only 120 watts, instead of the 150 watt monster that we're rocking now. Thankfully, Silentbogo chronicled their journey performing a case transplant on a similar Z620 workstation, and we were able to adapt some of their findings to help defeat the evil Lord, HP BIOS. Let's walk through it, but first let's walk through today's sponsor, Capital One Shopping. Thanks, Capital One Shopping for sponsoring this portion of the video. Let's face it, buying and building a PC can be expensive. But Capital One Shopping can help you save some money on your next build. All you need to do is add Capital One Shopping to your browser, and it will start automatically searching for coupon codes, and testing to make sure that they actually work. What's even better is that Capital One Shopping searches for a better price while you shop at your favorite retailers. If a better offer is found a popup will appear letting you know the price, including tax and shipping details. You'll also earn Capital One Shopping rewards which you can redeem for gift cards. You can check out Capital One Shopping today, using our link in the description below, and start saving money. Thanks to Capital One Shopping for sponsoring that portion of the video. Let's walk through it. Silentbogo's post mentioned that pin one on the CPU fan might have been the sensor for a second fan. And looking at photos of the official water cooler, it certainly appears that that cable goes somewhere instead of just looping back to ground, like it does on the stock cooler. Wanna know why? Because in an air cooled configuration, the system is only expecting one fan. So, that extra pin, well, that goes to ground, no problem. But in a water cooled configuration, it's expecting two fans. So, for that reason, we actually need to jump that fifth pin to the tack pin, which is in the middle. We've already done the work. Well, sort of, the work is sort of mediocrely done, should probably be soldered, but, this is good enough for us to show you guys that it will work. But, one thing to be really careful of, guys, while you're jumpering pins between each other on a fan connector, is, please don't connect your ground to your 12-volt. That could start a fire. Yes, yes. Ignore this extra black lead that's hanging off of here, that was from one of the early experiments when we were still trying to figure this out. Oh my goodness! Still trying to figure this out. (clapping) Ready, and with the CPU actually upgraded this time. Here it comes. (computer beeping) Front chasis fan not detected. Oh crap. The good news is there's a quick and easy solution to this. Unfortunately, ooh, it costs $40. Why do they even need a special bracket for the fan? Just put mounting holes in like everyone else. So, we're not gonna buy that. What we are going to do, is we're going to buy a two pack of those fan splitters we showed you guys before, which fortunately costs the same for some reason, and we're gonna make ourselves another little fix. By salvaging some fan connector pins from our work earlier, shorting pins three and four like this, which obviously we'll protect by putting something over top of them, and then, shaving off this guide here with a pair of flush cutters, we are able to put, without installing another fan, which we don't have the bracket for, eh, this one here which should allow us, once and for all, to boot the freaking thing up. No F1. Here it is, the big moment. Woohoo (cheering) Nice. okay, all I need to do is close up the... (computer banging) Are you kidding me? Thing looks like a bloody Tesla. It's the heat pipes from the cooler causing the problem. Thankfully though, there's a quick and easy solution. (power drill buzzing) Speed holes. Off camera, we just put a little bit of, like, goop, like paint or something on the top of the heat pipes. Then, put it on so that it would mark the spot, and then we just, (power drill buzzing) (screaming) Got it. Parfait, less parfait, oh crap. - [Man] Probably have to sand that. - Should have put some masking tape on. You know what? No, let's see if we got. These are not even close, dude. But wait, wait, why did I even close this up? We're not even done with this stage of the upgrade yet. Ow! (Screen beeping) currently our system has two sticks of memory in it. Which means that we're not making proper use of our Xeon's processors quad channel memory controller. One way to fix this would be to try to match the RAM that's in there with two more sticks. But, there can be a little bit of trial and error, especially on workstation and server boards, which tend to be a little bit pickier. So, we took the easy path and grabbed four matching sticks of ECC DDR3 for about 30 bucks. That is less than a dollar per gigabyte. - [Man] Whoa, nice party trick. - But wait, there's more. Depending how much you spent on your RAM upgrade, your budget for this could vary, but you should have anywhere between $15 and $30 left to spend on a two and a half gig network card. That'll go a long way towards modernizing our system for our high speed network transfers. We're using a card from TRENDnet, which is technically out of our budget, but, it was lying around in the warehouse. Well, we're connected at two and a half gigabit per second, so that's good, but because of other system bottlenecks we weren't able to crack around 800 megabit, so, maybe we can address that later. But first, let's play around with our 269 gaming pc. Oh, here's our eight cores and 16 threads, by the way. Pretty sick. Yeah, I dunno if I would say this is running meaningfully better. I think it's pretty clear from the FPS counter in the corner that we're not getting way higher frame rates than we were before. With our 8-core CPU, they are significantly more consistent, and that's a really good thing because it's making the game feel a lot more smoother than the FPS counter would indicate. That's awesome, this is great. Our 99th percentile low frame times are equivalent to over a hundred fps. Man, you wanna play some GTA five? - [Man] No. - We don't have it cranked or anything, but the game is running pretty high. We're still pinned at like 120fps, which, yes it's not the city, but, like, damn, what's not to like here? This is enough performance for 10 ADP gaming, in pretty much any game you'd wanna play, at $269. Absolutely amazing for the price, but I want more. More what? Well, as I alluded to before I think we could have better storage in this system. Now that I can play so many games, 256 gigs isn't gonna be enough to satisfy me. And, while I could just sell off my precious GTX 760, and use my $23 to patiently wait for a one terabyte hard drive to show up somewhere, I want this PC to be better than that. The smart choice is probably a 512 gig, or one terabyte, two and a half inch SSD, like this. Something like an ADATA SU760 is gonna give me a DRAM cached drive for only 50 bucks for 512, or $85 for a terabyte. But, our next budget tier is $369 and this amount of spare cash has me not really thinking straight. Getting kinda of wacky here. I'm thinking high speed NVMe drive. I mean, yes, this computer predates NVMe drives, but I don't care. I'm flush with cash and throwing caution to the wind. Problem number one is that modern NVMe drives are almost exclusively available in the M.2 form factor. And our motherboard has no M.2 slot. But, I've already kind of given away the solution here. You can get cards like this one from Angelbird that allow you to adapt a regular old PCI express slot to Dun dun dun dun dun dun dah an M.2 slot. And the reason that these are so inexpensive is because they're not actually really doing anything. See, here's all your power pins over here, and here's all your data pins over here, and they just go (mimicking), right there. We had this fancy looking one from Angelbird lying around. But, there is no reason that you couldn't just use an off brand one, which should run you around $13. Then, for our drive, we picked up this second hand Samsung 970 EVO one terabyte. That cost us 120 Canadian dineros, which is about equivalent to 87 real dollars. At the time of filming, anyway. Actually, that was probably at the time of calculating it a week ago, which, (laughing) there we go. We're done. (chuckling) No, we're not. See that, there isn't even a submenu in the BIOS for NVMe drives, but, that doesn't mean that the system can't see it. If we boot into Windows from our SATA drive, it actually shows up in device manager as a PCIE device. It just doesn't show up as a drive. So, we need to find a workaround. Thankfully, we can take a page from the Hackintosh users manual. So, all we need is a USB drive that we don't need anymore. One gig or larger, doesn't even need to be USB 3. Then, we're gonna put the Clover boot loader on it and allow our system to boot from the flash drive. Clover can understand what NVMe drives are, which means that it can bridge the gap between our system, which can boot to USB, and Clover, which can read our NVMe drive. Now, we don't really want a USB drive sticking off of our system if we can avoid it. So, if we wanna hide it, but also ensure that it stays put, we can scrounge up an old front panel USB connection, from an old case, that maybe somebody's getting rid of, plug our drive into one of the many open USB 2 headers on our motherboard. Okay, there it is. Now, we can boot from our Kingston DataTraveler 3.0. Here we go. Automatic boot in one second. By the way, if you don't wanna just leave this hanging here, you could use an LTT store cable tie to hold it in place. (tie clicking) There, that will never move. This is immediately, noticeably faster. It's responsive, you know what I mean? Like, let's fire up Steam, bring up task manager, like, this does not feel like a eight-year-old system. We're back in game now, the performance is very similar to what we had before, but, that's not the point of fast storage. This is the point of fast storage. Boom, I alt-tab out, I'm doing stuff, I'm using my computer, I alt-tab, well, let me make sure I hit the right window, and I'm back in my game. It's (snapping) the responsiveness. That's what makes this feel like a modern new system, and not something from eight years ago. But, we're not done yet. We promised you guys a $420 computer, didn't we? I was told I was getting $50 in RGB lighting, and this is what they handed me. - [Man] Hah. - I guess that's fair enough. At this budget, that would be a pretty stupid thing to spend another $50 on. Actually, I would probably go the route of adding a little bit more GPU power. Maybe step up to something like a 5700 or something along those lines. But, realistically, I don't feel like most people are gonna feel like they need to upgrade this thing. This is Cyberpunk 2077 running on, basically, high presets. What's our 99th percentile lows here, Like 37, 35 fps? No, it's not perfect, but there is no question, whatsoever, that this is playable. Which means, basically, you can play any game. And at this price point, that is quite the accomplishment. (upbeat music) If you like this video, check out the first video where we built the $69 rig, or maybe the extended version of it on Floatplane. We included some too hot for our sponsors bits in there.",
    "transcript_keywords": [
        "Capital One Shopping",
        "Shopping",
        "Capital",
        "fan",
        "drive",
        "system",
        "Shopping for sponsoring",
        "video",
        "CPU",
        "USB",
        "Elden Ring",
        "Dun dun dun",
        "thing",
        "put",
        "game",
        "price",
        "pins",
        "cooler",
        "Dun dun",
        "play"
    ],
    "transcript_entity_values": [
        "one",
        "eight-year-old",
        "37",
        "eBay",
        "Sandy Bridge",
        "1060",
        "eight",
        "One",
        "Floatplane",
        "RGB",
        "USB 3",
        "two and a half inch",
        "150 watt",
        "a two and a half",
        "about 15 real dollars",
        "Ethereum",
        "E5-1620",
        "a hundred dollars",
        "GPU",
        "Kingston",
        "Clover",
        "120",
        "85",
        "ADP",
        "Angelbird",
        "50",
        "Clover",
        "FPS",
        "LTT",
        "69",
        "three",
        "5700",
        "570",
        "around 800 megabit",
        "35",
        "Canadian",
        "256",
        "AIO",
        "HEDT",
        "Elden Ring",
        "512",
        "first",
        "ADATA SU760",
        "760",
        "580",
        "LGA",
        "2690",
        "TDP",
        "970",
        "Angelbird",
        "RX 580",
        "6",
        "Amazon",
        "2077",
        "GTA",
        "4",
        "480",
        "CPU",
        "HEDT",
        "369",
        "87 real dollars",
        "eight years ago",
        "less than a dollar",
        "Intel Xeon",
        "E5-2690",
        "Xeon",
        "only 50 bucks",
        "Samsung",
        "CS GO",
        "about five bucks",
        "12-volt",
        "1080p",
        "Windows",
        "four",
        "Google",
        "470",
        "EVO",
        "HP",
        "one terabyte",
        "hundred",
        "30",
        "SATAs",
        "Capital One Shopping",
        "120fps",
        "Radeon RX 580",
        "16",
        "five",
        "10",
        "only 120 watts",
        "around $13",
        "23",
        "about 20 Canadian pesos",
        "5 to",
        "99th",
        "Capital One Shopping later",
        "two",
        "a week ago",
        "Craigslist",
        "between $15 and $30",
        "second",
        "TechPowerUp",
        "Molex",
        "269",
        "169",
        "DOOM Eternal",
        "PCIE",
        "Hackintosh",
        "Asus",
        "USB 2",
        "two and a",
        "today",
        "a hundred bucks",
        "1650",
        "60fps",
        "U.S. Score",
        "fifth",
        "Tiny Tina's Wonderlands",
        "PCI",
        "Silentbogo",
        "one second",
        "RAM",
        "Tesla",
        "8",
        "ECC DDR3",
        "5",
        "40",
        "GTX",
        "Dun dun dun dun dun dun dah",
        "another $50",
        "420",
        "USB",
        "269",
        "200 megahertz",
        "F1",
        "about 30 bucks",
        "TRENDnet",
        "1660",
        "nearly three"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "MONEY",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "ORDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "MONEY",
        "ORG",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ]
}