{
    "id": "ylfVOUZUYtE",
    "title": "2020 iPhone SE + iPad Pro + iPhone 11 Pro Max Photo Comparison!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-05-01T20:07:36Z",
    "video_url": "https://www.youtube.com/watch?v=ylfVOUZUYtE",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iPhone se",
        "camera review",
        "ipad",
        "Mac Pro wheels"
    ],
    "views": 491595,
    "likes": 15447,
    "comments_count": 1164,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys it's Justine, and today we're gonna do a video that nobody asked for, but everyone needs. We are going to be doing an iPhone 11 Pro Max versus the new 2020 iPhone SE, versus iPad Pro 2020 camera test. Thank you Dbrand for sponsoring this video. We have some black camo skins. I'm ready to dec out my iPhone, and my iPad, and this is one of their grip cases, it's protective, it's grippy, it also has very clicky buttons. You can also customize the skins. This case is impact resistant up to nine feet, and we all know how I am with my phone. I need this. Check out the link in the description to get your own case or skins from Dbrand's website. Let's put on these skins and start this camera test. (upbeat pop music) This set up actually looks really great. I'm working on a Mac Pro upgrade video. So I'm gonna take a few photos here of the setup and then I'll show you guys what that looks like. So first photo. (upbeat music) Now let's test out the video. This is 4K30 on all three cameras. Are you ready? Here we are testing out the video on the back-facing camera on all three of these devices. We've got the iPad, the iPhone 11 Pro Max, and the iPhone SE 2020. I don't know what it looks like right now, but I'm here. Do you guys want to see what 1.5 terabytes of RAM looks like? (sighing) My heart. So now I'm gonna set a 10 second timer and see if I can get great timer photo at the same time on all of these. (groaning) Okay, okay, okay. I tried to look at the middle. So you can tell on the iPad that I'm clearly not looking at the iPad. Let's test out the front facing cameras. The lighting is much better this way. (upbeat music) Front-facing test complete. Let me show you what the wide angle selfie looks like compared to the not wide angle selfie on the iPhone SE. (upbeat music) So, the iPad can actually do a front-facing portrait mode. I'm gonna go through and do front facing portrait on each one of these. But first, the iPad. (upbeat music) Okay, same pose every single time. I only have one face. It's all I can do. It's so weird looking at the iPad front facing camera because it actually looks like I'm looking at the mirror. I could probably use this for makeup application if I didn't have a mirror, like at a hotel or something. Oh I definitely could, put on some eyeliner. This is massive! I don't think that I like seeing their face up this close. You guys probably don't either, I'm so sorry. Now, front facing video. So the only one that is 4K is the iPhone Pro Max which is you right here. The rest are 1080, so here's our iPad. Hello, iPad, how are you? Hello iPhone SE, how are you? Let me show you guys my friends, this is Tom Nook, he's a thief, and here's KK Slider, he's a very talented musician, if you guys don't know him, you need to get to know him. So I couldn't find my juggling balls, but I did just get some Mac Pro wheels. So I thought that I would juggle these in slow mo for you. I would like to note these are really heavy. Oh gosh, I'm nervous. (upbeat music) All right, so it hurts, very badly when the tip of this wheel that you're supposed to put onto the tower jams in your hand. (audio in slow mo) Now let's test out portrait mode on the iPhone SE and the iPhone 11 Pro Max. The iPad doesn't have rear facing portrait mode so we're just going to test it out on these two. Are you ready? (upbeat music) All right, let's take a picture of KK Slider. I'm also gonna do a digital zoom, see what that looks like. I'm obsessed with my findings on a bigger screen. Now we need to take one with the iPad. This thing is so, it's so huge. Gonna be shredded if I start doing photography with the iPad. So I'm gonna take a mirror selfie because it's 2005 and I'm on Myspace. So I'm gonna set a timer. Let's see, we're gonna do a 10 second timer. I never used to set timers, when I would take them back in the day, but I also wasn't taking them with three different devices. (shutter clicking) (upbeat music) Oh God, I'm logging back into Myspace for this, this needs to be seen. I'm gonna do one more, because I feel like why not? I feel like one of these photos is probably the same size as my hard drive back in 2005. So let's really just go for it. (shutter clicking) (upbeat music) I'm logging back into Myspace for sure. One of the biggest requests that I got on my iPhone SE challenge video is you guys wanted to see what it looks like when you take photos at night. Now, this doesn't have night mode, but the iPhone 11 Pro Max does. So I'll show you guys what it looks like with night mode on and off compared to the iPhone SE, and of course, the iPad, which also doesn't have night mode. iPad photography 101. I brought, this actually has a flash. How cool with the iPad, and an iPad flash? I mean look at this, I can like put it on my shoulder, I'm like a news anchor. That, my friends, concludes our night camera test. Back to Justine in the bathroom. Well thank you guys for watching, I just wanted to do a little test between all three of these devices because why not? I look forward to being able to leave the house to do camera photo tests for you, but in the meantime, (phone chiming) I got a tweet. I gotta say, I've definitely enjoyed having a touch home button again, it's quite nice. I'll see you in my next video. Have a good weekend, or weekday, are weekends even a thing anymore? I think every day is just a day. (upbeat music)",
    "transcript_keywords": [
        "Pro Max",
        "iPad",
        "iPhone",
        "Pro",
        "iPhone Pro Max",
        "test",
        "guys",
        "Pro Max versus",
        "video",
        "Max",
        "Mac Pro",
        "versus iPad Pro",
        "camera",
        "camera test",
        "mode",
        "facing",
        "iPhone Pro",
        "back",
        "night",
        "iPad Pro"
    ],
    "transcript_entity_values": [
        "iPhone SE",
        "Dbrand",
        "iPad",
        "one",
        "Myspace",
        "KK Slider",
        "Justine",
        "iPhone",
        "4",
        "Mac Pro",
        "three",
        "2020",
        "2020",
        "the day",
        "Pro Max",
        "Dbrand",
        "1.5 terabytes",
        "iPad Pro 2020",
        "night",
        "RAM",
        "a good weekend",
        "1080",
        "today",
        "two",
        "Tom Nook",
        "11",
        "up to nine feet",
        "first",
        "10 second",
        "KK Slider",
        "weekday",
        "101",
        "Myspace",
        "2005",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "NORP",
        "QUANTITY",
        "PRODUCT",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL"
    ]
}