{
    "id": "Ym4aT0trr1Y",
    "title": "New 2022 Microsoft Surface Lineup!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-10-12T14:36:50Z",
    "video_url": "https://www.youtube.com/watch?v=Ym4aT0trr1Y",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 388153,
    "likes": 9780,
    "comments_count": 380,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(upbeat music) - Hey guys, it's Justine. And I am so excited because I actually just got back from Seattle. I went to visit Microsoft. I mean I flew into Seattle, but then we went to Redmond's, since that's where their headquarters is located. And I've been here before but I've never done an actual full tour of Microsoft. So we got to see so many amazing things. I filmed a bunch of content, but I filmed it all in vertical 'cause I was kind of in that TikTok and YouTube shorts mindsets. There's all sorts of things that go into product making that I don't think people really think about. And I kind of have some background in product making and graphic design and those types of things. But this is a whole nother level. I mean, there's different departments for every single thing, for color, for textiles. Like, I didn't ever think that there's a textiles department at Microsoft, but when you think about it there is soft textiles on some of their Surface products. On the covers, on the actual laptops themselves. So small little details have to be put in place to actually make all of these things it. So it's kind of cool to go in and see all of these different departments working together. I just love their attention to detail. Now, the whole reason that we were actually there is because they're releasing some new Surface products. And I am actually a huge Surface fan. And I know all of the Apple fans out there like, \"Justine, but we thought you were Team Apple!\" Yes I am. But if you're new here and have only seen some of my Apple content, I've been covering pretty much all facets of technology and I'm such a huge fan of Surface. And one of the reasons that I love Apple so much is their attention to detail, and for their incredible design. And I think that's something that Surface has really paid such close attention to, is their attention to detail, their attention to design and just the overall aesthetic of their products is, it's top notch. Like, I absolutely love it, especially the Surface Studio. I've been such a huge fan of this. I actually had a little flashback while I was at Microsoft, thinking of when I first got that Surface Studio. I was unboxing it in my kitchen for some reason. I don't know why, that's why I chose to to unbox it, but I did and that is such an incredible device. But since I started with the studio, they now have the new Studio 2 Plus, and here it is. It looks very similar to the previous models, which is something that Microsoft intentionally did. Because this design already is so great and people love it. And one of the things that they've heard from customers, is there's really not much that they want changed about this design, at least in this current form. I do feel like, there will be a Studio 3, and I think that's where maybe they'll push the envelope a little bit. But the Studio 2, this whole form factor and everything about it, I absolutely love. Now I have started doing more illustration recently, so now I'm really excited kind of coming at this from another perspective to really see what this is like to use for illustration. So here it is. This is the Surface Studio 2 Plus. This has a large 28 inch pixel sense touch screen. And really the key thing with this device, is the fact that you can basically lower it and raise the display with the zero gravity hinge. This does come with Windows 11, and it features an 11th Gen Intel core H35 processor. The Surface Studio 2 Plus has up to 50% faster CPU speeds than Surface Studio 2 and it's five times more powerful than the original studio. It has double the graphics performance than Surface Studio 2, with the Nvidia GeForce RTX 3060 laptop gpu. It's optimized for Windows 11, and it has USBC with Thunderbolt 4. It has enhanced cinematic viewing and sound, with Dolby Vision and Dolby Atmos. And as far as storage, it has a one terabyte solid state drive. Now, in addition to the Surface Studio 2 Plus, they also had the new Surface Laptop 5, and the Surface Pro 9. We also got a chance to get a little sneak peek at some of the Microsoft adaptive accessories. And this is something that I'm so excited about. The things that Microsoft has been doing, even dating back to the adaptive controller for Xbox, has been incredible. And they have this whole adaptive lab, where they actually bring in people, in the community and able to get real time feedback. It was a really cool experience, to really get a chance to see this. This new lab was built with inclusivity in mind. So this is what the adaptive Mouse hub and the buttons look like. So you basically are able to create a mouse that's unique to you. So you can explore all of the different ways that you can customize this. These components all work together. There's the mouse core, a tail extension and a thumb support. So you're able to create a traditional mouse that's light and portable, or you can use just that little tiny one all by itself. It's super easy to pair. You can just connect the mouse core wirelessly, and up to three different devices through a USBC connection. So let's take a look at the new Surface Pro 9's. And obviously since Windows 11 is out, all of these are shipping with Windows 11, which is very exciting. The Surface Pro 9's come with an Intel 12 Gen processors, that are all built on the Intel Evo platform. These come in four colors. There's a platinum, graphite, sapphire and forest. And I am obsessed with this forests color. It's so pretty, I can't even handle it. Something new in the surface Pro 9 lineup is, there's actually a 5G version this time. And the 5G does only come in the platinum. And you can see here that the 5G is a little different, because you can see the 5G antenna bands here, where on the previous version and the wifi only, all of the antenna bands are actually hidden. So you can't actually see them. But of course, 5G does need a little extra help in that department. So that's why you're able to see them here. Now this version of the Surface is like this absolutely, just beautiful blue cover. It's also laser etched with this awesome design. Now this is a partnership with Liberty, they're a London based Global Design House. And since Surface is celebrating their 10 years, they did this awesome collaboration. It has this vibrant blue floral design that's inspired by the Windows 11 Bloom. And it's available in select markets, only at Liberty and Microsoft stores. And while supplies last. I hope those supplies last long enough, for me to get my little fingers on one of these, because it's so beautiful. The pattern is engraved and it matches the keyboard. And it's just so pretty, I can't get over it. I really love the Surface Pro 9 displays. It has 120 hertz refresh rate. It's also got an HD camera, Omnisonic speakers, directional microphones. And their custom G6 chip, that allows you to take inking to the next level with tactile signals. So when you're actually using the surface pen, it'll actually feel like you're writing on paper. And it's such a cool feeling to have that haptic feedback. With the new Microsoft SQ3 processor, it unlocks new AI features that were made possible, through an entirely new neural processing unit. It was really cool to see. They have this new thing called eye contact. So when you're actually on a webcam call and when you're looking at your display, it'll actually make your eyes look like it's looking at the webcam. So, it'll feel more personal to people who are actually watching the call. So even when you're looking down at your display, you guys can see here on this little demo, that we were doing. I'm not looking at the camera, but it looks like I'm looking at the camera. Another incredible demo that we did, this was so impressive. Now using AI, it's such a buzzword at this point. I feel like people are like, \"What does AI even mean?\" We were in this room where it was so loud, they had a train simulation, they had a bar scene simulation. We were talking into the microphone, like looking at the computer, and everyone around was talking, loud clapping, making all sorts of noises. And you did not hear any of that background sound. - How's it going? Can you hear me? (loud background chattering) Hello, hello, hello, hello? Hello, hello, hello, hello? I don't know how to converse with someone that's not there, even though I talk on camera a lot. - I don't know what kind of AI witchcraft it was doing, but it was so impressive. It was probably one of the most shocking demos that I've seen in a very long time. My sister and I actually did a really fun podcast with Panos. So if you'd like to go watch it, I'll put a link in the description. And it was so wild when we did record this. We were talking to him and we had him do a little clap like, (clapping sound) so that we could sync the audio, to the video. And when he clapped, we didn't hear it at all. And I thought, I was like, \"Okay something wrong with my audio.\" Like, what's happening? But it was actually using the AI sound filter, to just remove the sound. And I was so shocked because when we actually got a demo of that in person, I was like, \"Wow, this is impressive.\" Now let's check out the new Surface Laptop 5. It of course provides all day battery life, and it now has Thunderbolt 4, with the latest Intel Evo platform. It's now 50% more powerful than the previous. It comes in a 13 and a half or 15 inch display option with Dolby Vision IQ. The speakers have Dolby Atmos with 3D spatial processing. There's a front facing HD camera and the studio microphones. And check out this new beautiful sage color. I'm not a huge fan of the color green, but for some reason this sage, and even the forest color on the Surface 9, like I'm obsessed, it's so pretty. You can configure this with 8, 16 or 32 gigs of ram. And as far as storage, you can get 256, 512, or 1 terabyte solid state drive. Now the 13 and a half inch comes in the platinum sage, matte black and sandstone. And the 15 inch, comes in the platinum and matte black. Another cool thing about this room is, they had breakdowns of all of these items. So you could actually see the internals, see how everything was working, and all of the pieces and components inside. And again, like I said at the beginning of this video, one of the things that I love, that Microsoft Surface has done, is their attention to detail. Even getting a chance to kind of, see all of the steps that go into the process of making these devices was so fascinating. From the CNC machines, to how they actually cut out pieces of aluminum to test out everything. They have the capabilities there to have an idea, and then be able to just make a prototype, basically overnight. Anyway, this was just a quick look at some of the Microsoft products coming out. I hopefully will be able to get some of these in the studio so that we can get some hands on, so I can actually show them to you. But, it was really great to get a chance to go on this tour and I had so much fun. If you guys are new here, hi, I'm Justine. Please subscribe. So you'll be able to see all of the videos that I post. Hit the bell to be notified when I post those. And of course, leave me some comments below and let me know what you think about the new Surface products. I'll see you guys in my next video. Bye. (upbeat music)",
    "transcript_keywords": [
        "Surface Studio",
        "Surface",
        "Surface Pro",
        "Studio",
        "Microsoft",
        "Surface products",
        "Microsoft Surface",
        "Surface Laptop",
        "design",
        "things",
        "huge Surface fan",
        "love",
        "Pro",
        "Windows",
        "Surface fan",
        "attention",
        "kind",
        "Apple",
        "huge Surface",
        "products"
    ],
    "transcript_entity_values": [
        "the Surface Studio 2 Plus",
        "zero",
        "Surface Studio",
        "Redmond",
        "Seattle",
        "all day",
        "11th",
        "Intel",
        "Dolby Vision",
        "12",
        "Global Design House",
        "one",
        "the Surface Pro 9",
        "15 inch",
        "Nvidia",
        "Apple",
        "Justine",
        "The Surface Pro 9's",
        "32",
        "CPU",
        "256",
        "the 15 inch",
        "4",
        "Surface Pro 9's",
        "USBC",
        "16",
        "10 years",
        "G6",
        "gpu",
        "Microsoft Surface",
        "YouTube",
        "5",
        "Xbox",
        "Omnisonic",
        "Surface Studio 2",
        "four",
        "Mouse",
        "the Surface Pro 9",
        "8",
        "Studio 2 Plus",
        "Dolby Atmos",
        "five",
        "Evo",
        "Panos",
        "up to 50%",
        "the Surface 9",
        "Windows 11",
        "Windows 11",
        "Dolby Vision IQ",
        "1 terabyte",
        "512",
        "13 and a half",
        "Surface",
        "the Surface Studio",
        "13 and a half inch",
        "Microsoft",
        "AI",
        "The Surface Studio 2 Plus",
        "50%",
        "3060",
        "first",
        "Pro 9",
        "28 inch",
        "Gen Intel",
        "CNC",
        "Surface Laptop 5",
        "Team Apple",
        "up to three",
        "Liberty",
        "London",
        "120",
        "TikTok",
        "USBC"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "LAW",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "EVENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "EVENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERCENT",
        "EVENT",
        "PRODUCT",
        "LAW",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORDINAL",
        "LAW",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "LOC"
    ]
}