{
    "id": "YmP9TChpaQ4",
    "title": "PlayStation’s Big Move - Sony Buys Bungie",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-01-31T22:14:06Z",
    "video_url": "https://www.youtube.com/watch?v=YmP9TChpaQ4",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 31740,
    "likes": 1717,
    "comments_count": 212,
    "description": "The arms race between Playstation and Xbox is just beginning Did Microsoft Break Gaming?  PS5 GamePass:  Apple is Wrong About Android:  Playstation is in Trouble:   Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/fsCEfkCijtw",
        "https://youtu.be/zgSlAJaHEvA",
        "https://youtu.be/kXqKNcTgXC8",
        "https://youtu.be/Jib6v--UffY",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Sony has officially clapped back. They clapped their cheeks together. - Whoa! - And they have now bought Bungie. - Wait, wait, wait. I don't think that's what, that doesn't mean what you think it means. (tone beeping) - Hello and welcome to This is Austin. Sony has bought Bungie for. - [Matt] $3.6 Billion. - Which would've been a crazy number a week ago - $70 billion. - But after Microsoft. Yeah, it's 20 times less than Microsoft's acquisition. But this is still big news, and this is something that we said was gonna happen. - Yeah. - We said that, like. - We called it. - I have a feeling that we'll end up talking about this several more times over the next couple of years. We're at the start of this massive arms race. - Yes. - I think that $67 billion is just the beginning. - So, a few things. Sony needed to make a response. Now, like you said, this is a response which to a lot of gamers is probably roughly on the same level, right? You know, Activision, Bungie, some of the biggest names in the industry, but of course, in dollars and cents, this was a complete bargain. This is 1/20 the price of Activision. And mostly because Bungie, even though of course they have a rich and storied history creating Halo, these days, they pretty much just do. - It's pretty much just exclusively Destiny. - Well, they have other games in development. And in fact, one of the things they talk a lot about here is that they have other things and there's a bunch of stuff that they've got in the works. And I'm sure they do, but realistically, it's not wildly different to when Microsoft bought, Mojang, which they were buying Minecraft, essentially. They made a couple of other games, but really they were buying Minecraft. I think it's a little bit better here but generally speaking, Sony just bought Destiny. And most importantly, I think they just put a sort of big flag in the ground of like, \"Hey, look, we're out here too. Don't steal all our games, Microsoft.\" - One thing I'm gonna say that Sony and Bungie have done so much better than what Microsoft has done with any of their acquisitions. When they announced this, they have said, Nope, Destiny's gonna still be cross-platform, it's gonna be on X-Box, it's gonna be on PC, we're keeping this as a cross platform thing. - I would wager. With zero evidence, zero confidence. This was probably worth it for Sony, purely and just to keep the stock from sliding, because you saw how big of a shift the Activision deal was. It brought a bunch of the medium-sized studios hugely up in stock value. People were like, oh, Sony's doomed or whatever. They probably made $3.6 billion just in the stock price just by showing that they're doing something, there are 4% today. - Today. - Success. - They made it back. - They made one press release, they made their $5 billion. - You know, again, I like these moves. I said the same thing with Microsoft. I like having these studios buying games or studios that are going to be cross-platform. because now you're making money on a platform that you weren't previously making money on. - Yeah. - One of the things that I find kind of fascinating is like these kind of blurred lines of who owned what now? I mean, obviously Microsoft still owns Halo. So here's the history, like you said, they started off, they were Mac focus, Steve Jobs announces Halo. So the paired up with Microsoft, then they break away. - Yup. - And they say, \"Okay, we're not gonna be doing halo anymore, we're gonna start doing our own thing, that'd be Destiny.\" - Yes. - And for that, they were teamed up with Activision. - Yeah Activision were the publisher for Destiny up until 2019. - When they said, Destiny's gonna, this is when they said, okay, Destiny is gonna be like a ten-year platform. - It's forever. - Which it kind of happened. - So far, yeah. - Yeah. Destiny 2 was like kind an unplanned, whatever but Destiny as a platform has continued. But so they broke away from Activision and just said, \"Okay, we're gonna do our own thing.\" And now there with Sony, but Sony is now letting them say, you can do your own thing. They're pretty much saying like, according to the letter put out by Bungie, they're saying, \"Okay, we're gonna be running.\" They have so cheesily said, \"We can control our own destiny. We remain in charge of our destiny,\" which is cheesy as hell. But-- - Are we going to let them have that? I don't think we can let them have that. - No look, I liked it with these acquisitions, I like the idea of, okay, Sony, Microsoft, whatever, buying the developer and letting the developer just be the developer. - Yes. - Because people like Destiny for Bungie reasons. And to just let them keep doing what-- - Of course. - Very successful. - Look, we're in the middle of a land grab. - We're not even a full month into 2022, and we've had so many massive deals. - And more are coming. - More are coming. - For sure. - Again, it was hyperbole when I said it, but I do fully expect Tencent buys some massive thing. - Of course. - Nintendo buys some massive thing, I think it makes more sense for Tencent to buy Epic. - Yeah or Epic to buy someone else like, like you know for a fact that this deal, it may not have just completely come out of nowhere because I don't think they're gonna put a deal together in a week and a half. - No. - But this has been a hugely sort of accelerated trend now. it is an absolute land grab. Developers are gonna be super motivated to sell because they're gonna be able to sell for prices that they would've never been able to reach before because there's so much competition. And you look at it from Sony, from Microsoft, from the really, really big players' perspective. There's no reason not to try to gobble up all the medium and smaller people around you, because all that is gonna end up doing is boosting your price either to be sold or to at least kind of beef up the idea that you are doing something big in this space, because it's partly, you wanna make money, you wanna buy a profitable business, you want to keep those games on your platform. But also it's to keep it away from Microsoft or Sony or whatever. Like there's just so much sort of excitement in the space right now, and right now it's all great, but guess what? It's not going to be like that forever, right? Like, you know that someone's gonna be like, Yo Destiny 2.65? Oh! X-Box oh, we forgot to upload it this week. it'll come out a little while. Don't worry, don't worry. But we're totally dependent on our cross-platform friends to make sure that everyone has the greatest experience, right? And the same thing goes for activation, right? Like everyone is trying to build their own content, whether it's for the actual games themselves or whether that's the IPs for the Sony Game Pass Competitor or what have you, right? But this is literally just it's gonna be wild. Like I think we're in for an absolutely wild few months to see who buys who and when and where and we should just sit here in the studio 24/7 ready to report. - We're going to sit here ready to give you the news roughly 12 hours after it happened. - Great reason for to keep your-- - So stay tuned. - Notifications on. - Notifications on. - Set to all. That's what all the cool kids say. - And we'll catch you in the next one. Thanks.",
    "transcript_keywords": [
        "Sony",
        "Destiny",
        "Microsoft",
        "Bungie",
        "thing",
        "Activision",
        "Yeah",
        "games",
        "Billion",
        "bought Bungie",
        "officially clapped",
        "officially clapped back",
        "Halo",
        "things",
        "made",
        "Sony Game Pass",
        "big",
        "platform",
        "kind",
        "Sony Game"
    ],
    "transcript_entity_values": [
        "zero",
        "Halo",
        "Tencent",
        "Today",
        "2.65",
        "this week",
        "one",
        "Bungie",
        "$67 billion",
        "Mac",
        "4%",
        "today",
        "Yo",
        "2",
        "dollars and cents",
        "Mojang",
        "20",
        "roughly 12 hours",
        "Austin",
        "1/20",
        "Activision",
        "Steve Jobs",
        "$3.6 billion",
        "a week and a half",
        "24/7",
        "$3.6 Billion",
        "$5 billion",
        "ten-year",
        "Nintendo",
        "One",
        "2019",
        "Minecraft",
        "Halo",
        "Sony",
        "these days",
        "few months",
        "the next couple of years",
        "Microsoft",
        "$70 billion",
        "Destiny",
        "a full month",
        "a week ago",
        "the Sony Game Pass Competitor",
        "2022"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "PERCENT",
        "DATE",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "GPE",
        "CARDINAL",
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "DATE",
        "DATE",
        "MONEY",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "DATE"
    ]
}