{
    "id": "ynaTZa9dVJk",
    "title": "The Secret Android Button",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-04-13T18:03:14Z",
    "video_url": "https://www.youtube.com/watch?v=ynaTZa9dVJk",
    "category": "Science & Technology",
    "tags": [
        "android button",
        "android",
        "button",
        "pressy",
        "smartphone",
        "tech",
        "technology",
        "nfc",
        "dimple",
        "smartphone button",
        "iphone",
        "apple",
        "unboxtherapy",
        "unbox therapy",
        "pressy review",
        "review",
        "unboxing",
        "samsung",
        "iphone 6s",
        "phone",
        "best",
        "android (operating system)",
        "galaxy",
        "6s",
        "new",
        "iphone 6s plus",
        "iphone 6",
        "s7",
        "camera",
        "iphone 7",
        "vs",
        "apple iphone",
        "apple iphone 6s",
        "smartphone (video game platform)",
        "galaxy s7",
        "apple inc. (publisher)",
        "edge",
        "galaxy s7 edge",
        "gadgets",
        "s7 edge",
        "plus",
        "samsung galaxy s7 edge",
        "samsung galaxy",
        "htc",
        "test"
    ],
    "views": 9901773,
    "likes": 71258,
    "comments_count": 4644,
    "description": "Other Android button video -  The Pressy is around $10 -   Physical buttons for your smartphone are a cool concept. This is the Pressy button for Android. It uses the headphone jack to hijack certain phone functions.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/6Mp01eg0-ZM",
        "http://amzn.to/25uOnBX",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys? Lou here. Back with another video. and today I'm checking out, You know, something that Quite frankly I like. This of course, is the idea of adding buttons, physical buttons, to your smartphone. This is called Pressy, the almighty, Android button. Now I did a video a little while back about a different kind of button, I can't even remember the name right now but I'll link it in the description You can go check it out, It's actually three buttons That use NFC and stick to the back of your device So that you can quickly launch into whatever you want with a physical button. This one takes a slightly different approach It goes into the headphone jack of your device. It uses the data portion of that port to trigger various things. Look at the packaging. Very straightforward here. But the promise Is so extravagant \"Keep your Pressy safe\" So there you go, they even thought about, when you're not using the Pressy You just have this little adapter on your headphone cable that you put it in That's it! That's the little guy! Jack, look at that. Look, how cute is that? I don't use that word cute often. But when I do its very important. That's cute And then you pull out the button itself And that's it! It's like the end of your headphones without the headphones! Now there is an app. There you go, I put the code in Now take a look at that Jack, it's ready to go. So, we're activated, now practice clicking. Short press, two short presses, right? Three short presses, oh my goodness. Now its telling me to add an action. for example: tagging your flashlight, alright. Here we go. Give your action a name, choose a trigger, and go for one press, Okay. And then I'm done. By default is has three actions baked in including flashlight, launch camera and toggle mute. flashlight is one press, oh there we go! Woah! That just happened. It's actually a satisfying little click there, as well. It does take a second, but there you have it. Now camera is a double tap. So let's do a double tap real quick. Hmmm.. do you have to be... How fast do you have to be? You have to be pretty fast. It's a quick double tap. Ooh we got flashlight that time. It's a fast double tap like you have to get used to it. This is gonna be the toughest one a triple tap. Let's see here... There you go, I got it now. I feel like I am getting a hang of it. You can see toggle mute up there, and then to get it off... I'm getting a phone call here, jeez. Hello? Hello?... To toggle sound Pressy requires access. I see. Okay I gotta' give it access here. Okay let's try this again. so, let's say I'm watching a video, real quick. Okay, media is all the way up, so we are muted right now. Do the old tripple tap. Oh... That's interesting, that's pausing the video. So if I'm in Youtube, it's got a different set of rules. it is gonna' actually pause the video. What the hell is going on here? I can't hear... Any Youtube right now. Oh, so you can hear that... You know why? Because it thinks that I have headphones plugged in. Wait a second. You can't use your speakers?! That's what happened with the phone call, it thought that I had a headset plugged in. Wait a second here... It's like hacking the Play-Pause Button on your headphones. We can do a lot of cool stuff. Toggle a lot of cool stuff here. Lock the screen rotation, toggle your... your vibrator, your bluetooth. I'ma try unplugging, and (Noise from phone) Okay, audio is working. Pause it, plug this back in. Is that Pressy? Yeah, it's Pressy! Pressy was pressed while being plugged in, please disconnect and connect it again. Without pressing it, holy, this thing is temperamental. Cool. Still no audio. Soundcloud... Nothing. Maybe there would be a setting for it to still out put audio via speakers, because for me, that's kind of a deal breaker. I really feel a little bit half-baked especially considering the other buttons that I used, again I cant remember the name... Dimple! im gonna link the video, go watch this video. That stuff was seamless. Seamless and it didnt hijack your headphone jack... \"Hijack\". Again the whole, like, double triple press on this thing... Neh! Eh! I'm over it im over it! I'm over it. It's cool to use the headphone jack in that way, apreciate the ambition, but I think the NFC buttons are actually the way to go. Go check that out. There you have it. There are a lot of Lu's, you're seeing Lu, then reflected Lu, then monitor version of Lu. It's too much Lu.",
    "transcript_keywords": [
        "Pressy",
        "buttons",
        "button",
        "tap",
        "jack",
        "headphone jack",
        "video",
        "double tap",
        "double",
        "Back",
        "toggle",
        "headphone",
        "headphones",
        "press",
        "flashlight",
        "Android button",
        "cool",
        "cute",
        "Short",
        "put"
    ],
    "transcript_entity_values": [
        "jack",
        "Android",
        "two",
        "second",
        "a second",
        "the Play-Pause Button",
        "today",
        "three",
        "Youtube",
        "Three",
        "Pressy",
        "Lu",
        "Youtube",
        "NFC",
        "Pressy",
        "Jack",
        "Lou",
        "Dimple"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON"
    ]
}