{
    "id": "YnbEDvSlnWs",
    "title": "The right to repair – and play games anywhere | The Vergecast",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-02-20T14:00:20Z",
    "video_url": "https://www.youtube.com/watch?v=YnbEDvSlnWs",
    "category": "Science & Technology",
    "tags": [
        "right to repair",
        "iFixit",
        "xbox",
        "ps5",
        "streaming",
        "netflix",
        "hulu",
        "ifixit teardown",
        "streaming services",
        "repair",
        "right to repair movement",
        "right to repair bill",
        "right to repair act",
        "right to repair apple",
        "right to repair explained",
        "right to repair laws",
        "right to repair explanation",
        "apple right to repair",
        "the vergecast",
        "vergecast",
        "technology",
        "tech podcast",
        "nilay patel",
        "alex cranz",
        "david pierce",
        "the verge"
    ],
    "views": 14228,
    "likes": 292,
    "comments_count": 19,
    "description": "Today on the flagship podcast of sneaky gaming strategies: Verge producer Will Poor reports on a right-to-repair bill in Oregon and what's next in the right-to-repair movement. Tom Warren breaks down the news from Microsofts gaming chief about Xbox games coming to PS5 and next-gen hardware. David Pierce and Alex Cranz answer a question from The Vergecast Hotline about the crackdown on password sharing for streaming services. #Podcast #Technology   00:00 - Intro 02:51 - Right-to-repair legislation w/ Will Poor 32:15 - The future of Xbox w/ Tom Warren 58:53 - The Vergecat Hotline w/ Alex Cranz  Further reading:  Status of Right to Repair legislation state by state:  The right-to-repair movement is just getting started:  iFixit explains parts pairing:  Jessa Jones iPad Rehab:  Apple Is Lobbying Against Right to Repair Six Months After Supporting Right to Repair:  The current draft of Oregons Right to Repair bill:  Microsofts gaming chief on Xbox games coming to PS5, next-gen hardware, and more:  Netflix might ruin password sharing for everyone:  Disney Plus is finally cracking down on password sharing in the US:  Hulu is cracking down on password sharing, just like Disney Plus and Netflix:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "https://trib.al/sb6bZ4j",
        "https://trib.al/RrBBtCC",
        "https://trib.al/KZytbVv",
        "https://trib.al/YgCSww5",
        "https://trib.al/weXrEBC",
        "https://trib.al/tpiwwup",
        "https://trib.al/RMLUy3S",
        "https://trib.al/P7SmAYR",
        "https://trib.al/M5ihJeP",
        "https://trib.al/nc50STR",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3P4bJgz"
    ],
    "transcript": "- Welcome to \"The Vergecast,\" the flagship podcast of sneaky gaming strategies. I'm your friend, David Pierce, and I am sitting in my basement doing LEGOs, which is a sentence I have not been able to say for a long time and I'm very excited to say. So, Liam James, our producer, got me this Polaroid OneStep LEGO thing for Christmas this past year, which is part of, I'm sure you've seen this, but LEGO doing all the stuff with old technology, and everything from the set of \"The Office\" to the McLaren Formula 1 car. Taking all of that stuff, putting it into LEGO form, and making it available for adults. It's all, I think, like ridiculously expensive to the point where I have not been able to talk myself into actually buying one of these things for myself. But I've realized it makes an awesome gift, and I hope more people give me these cool LEGO sets as a gift. So, I'm gonna spend some time putting this thing together. I realized today I've been kind of intimidated by it. It's, let's see, it's 516 pieces, and it is 18 and up. And you would think I would be able to handle that, but I feel like I'm rusty with LEGOs. It's been a while and the idea of actually sitting here and putting this thing together is both very fun and kind of intimidating. But I have an afternoon, I have shows to catch up on. It's gonna be awesome. I'm very excited. And pretty soon you are going to see this thing in a background when we record \"The Vergecast,\" I promise. Anyway, we have an awesome show coming up for you today. We're gonna do two things. First, we're gonna talk to Will Poor, who has been kind of immersing himself in the world of Right to Repair. It's a really interesting time in the world of Right to Repair. There have been big bills that have gone through. There's some real momentum for the idea that you should be able to repair your own gadgets, but there's still a lot of work to do, and it's not clear that all of the pieces are actually gonna start to come together quickly in a way that makes this stuff really work the way that it seems like it ought to. So, Will has been talking to tons of people. He's gonna come and give us kind of his first report on what he's learned so far. Then we're gonna talk to Tom Warren about Microsoft's news from last week. So, we talked about this a little on Friday's show, but Microsoft made what seems like a relatively small set of gaming announcements last week that kind of hide this huge vision for the future of gaming and the way that things are going to change in the gaming industry in a really big way over the next few years. Microsoft might be wrong, it might be early, it might be late, but it is not betting as small as it would have you think. Tom knows everything about what's going on here, and he's gonna help us figure out what the real story of Microsoft, and Xbox, and gaming, really is. All that is coming up in just a sec, but now I get to go do the thing that is my favorite with a LEGO set, where you open it up and just dump it on the ground, and kind of see what happens. This is where I inevitably like, lose six pieces that turn out to be very frustrating for hours, but you just, it's like the beginning of a puzzle, right? You pour it out, you kind of take stock, and you see what you have. This is either gonna take me an hour, or six months and you'll never hear of me again. So, wish me luck. This is \"The Vergecast.\" Let's go. Welcome back. So, last year was a big year for the Right to Repair movement. There were three major laws. We had one in New York, Minnesota, and California, all of which passed, and all of which said a very basic thing to electronics makers, that you have to let other people repair the products you make. That means giving independent repair shops or even individual people access to the same parts and tools, and information that you, the manufacturer give your own repair shops. Or, to use just one example that I'm confident we're going to refer to 1 million times throughout this story. If your iPhone breaks, the Apple Store shouldn't be the only place equipped and allowed to fix it. Last year, in the midst of all this, we had Kyle Wiens, the CEO of iFixit, on the show to talk about just how big a deal the California law was, in particular. - [Kyle] With the California law, we're up to 20% of the US population has passed the Right to Repair law. - [David] At the time, Apple had just signed on to support that law, and soon after pledge to abide by it nationally. So, on paper this was a big victory lap moment for all of the Right to Repair people. But now it's 2024, which is the year that these laws are actually supposed to go into effect, and we wanted to know what that means. What's actually changing out there in the world of electronics repairs? Like, if your iPhone breaks this year, are you better off than if your iPhone broke last year? Our producer, Will Poor, has been looking into that question for a while, and he claims he has answers, of which I'm always suspicious. Will Poor, welcome to \"The Vergecast.\" - [Will] Hello. Thank you. - [David] Do you have answers? - [Will] I do, I have a lot of answers. I talked to a lot of people to try to understand what's going on here. I talked to repair shop owners, activists, lawmakers, and big companies like, Apple and Google. And you know, shocker, the answer really depends on who you talk to. The advocates for these laws, the folks who have spent years trying to establish the idea of repair as a right, they're pretty jazzed. - [Nathan] Yeah, it was an absolutely monster year for Right to Repair. - [Will] That's Nathan Proctor. He runs the Right to Repair campaign for the Public Interest Research Group. He said last year started with a disappointment, that big New York bill got watered down by the governor at the 11th hour. - [Nathan] I think we just went all out last year, we really put everything we had into it. And then Minnesota passed the broadest Right to Repair bill we've seen yet, even broader than what New York did, with fewer loopholes. Then Colorado passed an excellent farmer Right to Repair bill, which was the first of the nation on that, and that was an extremely difficult fight. - [David] Hang on, did he just say farmers? Are we talking about farmers? - [Will] We are, we absolutely are. Right to repair is this huge deal in agriculture also, it's not just consumer electronics. That's because John Deere, and a whole bunch of other companies have gotten super, super controlling about who can repair their tractors. - [David] John Deere is like, the Apple of the tractors, right? I'm remembering this now, that they're like super mad about anybody who wants to repair their tractor. - [Will] They're the leader in this space. They're a huge problem for farmers, and it's a huge deal for agriculture, because farmers' livelihoods depend on the stuff. You know, it's not like most of our phones where it's, this is an annoyance, but it's not make or break. So this kind of thing comes up in sort of higher stake situations like agriculture. Wheelchairs is another place where this debate is happening. Other kinds of medical equipment. So it's a lot broader than just consumer electronics. Anyway, here's the rest of the Nathan quote. - [Nathan] And then California just absolutely overwhelmingly passed, and you know, and people know or might know that Apple endorsed that bill, which I think is just a sign of just how much momentum we had. - [Will] That Apple endorsement was notable, because for years it was the go-to example of a big powerful company lobbying super hard against repair laws. So, the endorsement was evidence of industry warming up to independent repair, which is just not how things felt for a long time. - [Nathan] In all the years that we've been on Right to Repair, you know, we've heard just absolute, throw spaghetti at the wall kind of arguments against it. The big categories are safety, security, privacy, liability, intellectual property. I remember vividly when AHAM's lobbyist- - [Will] That's the Association of Home Appliance Manufacturers. - [Nathan] Claimed that if people were able to fix their own dryers, like you know, clothes dryers, that you know, they have a latch and the door, \"And what if the door latch came undone because you didn't do the repair right? And then your child put their arm in there, and got it ripped off by your dryer?\" So right to repair means, dismembering children. - [David] So this is wild, this went a whole way I did not expect. But this makes me think of the thing you always heard from Apple and others about like, if you try to take your phone apart, you're gonna blow up the battery and burn your house down, right? That's kind of the consumer electronics version of this, and I think maybe equally realistic, as someone who has blown up a battery trying to take my phone apart in the past. - [Will] It happens. But yeah, I mean this is how far back the safety argument against Right to Repair goes. And this is a drum that all kinds of manufacturers have been beating for a really long time. - [David] But they're starting to, if not, give up on the safety argument, at least, roll it back a little, it sounds like? - [Will] Yes, manufacturers are giving up on some arguments that just have not panned out for them in the past. You know, the times are changing. Apple, in particular, has started to publish repair manuals on its website. It has this self-service repair program, which \"The Verge,\" and lots of other people have pointed out feels a lot like malicious compliance, because it's super expensive and complicated. But in general, Apple is playing ball with these new laws. - [Nathan] Apple announced more DIY options in December. You know, these companies are getting ready for it, you know, so I think that it's clear that to some degree that there will be compliance. Like, they're planning for it, they think that's great. I'm glad that they're not all gonna fight. - [David] Okay, so this all lines up with roughly where we were with Kyle a few months ago. We have some laws, not everything is perfect, but the people who have been fighting this for a long time, and like you said, they've been fighting for this for a long time, are pretty happy. But I don't know, you're setting this all up in such a way that it makes me think there are those who should be psyched, who are not psyched. - [Will] Yeah, yeah. So here's the other shoe dropping. I really wanted to talk to repair shop owners about this, 'cause they're the people that the advocates for these laws say that they're written for. And I did, and truthfully, they're not expecting a lot of material improvement here. - [David] Hmm. - [Will] One owner I talked with was Jessa Jones, who runs a repair and data recovery shop in Western New York. And she echoed pretty much every other shop owner I talked to. Basically, she thinks the laws are well intentioned, but they don't address some really critical things. For example, there is this very basic practice that any repair shop should have at their disposal. - [Jessa] I would like to be able to have a filing cabinet where I put any phone that is here for parts or pieces, or donated, or old, or something I buy. I wanna be able to put it in a file cabinet, where at any point in time, here comes a matching phone model that I can go to my file cabinet junkyard of parts, and I can take out a perfectly fine working, let's say true depth camera out of this phone and install it in that phone. And I can take two bad and make one good. - [Will] But she can't do that with iPhones. Take the true depth camera, that's the iPhone's front facing camera system. She can order a new one direct from Apple, it's about 185 bucks for an iPhone 15. Making that part of available technically puts Apple in compliance with the current repair laws. But if she opened up her file cabinet junkyard and swapped in a working camera from a dead iPhone, face ID might just stop working. That's because the motherboards of modern iPhones keep track of some other parts within the phone, and if you swap in an aftermarket part or even a genuine Apple part that Apple didn't sell you, your phone might start acting up. - [Jessa] If I replace your battery with a quality aftermarket battery, you can no longer go into your settings and see your battery health. You lost a function, that's terrible, that's wrong, and that's what's happening now. - [David] So let me just real quick make sure I understand what's going on here. - [Will] Yeah. - [David] It seems like, what you're saying is, if I have a perfectly good iPhone where most of the parts are still working, and then I have another perfectly good iPhone, where most of the parts are still working, and I take one perfectly good part out of one iPhone and put it in the other, there's a pretty good chance it just won't work. - [Will] Yeah, and this is what's so mysterious and galling about Apple products specifically, Apple products full of genuine Apple components do not play nicely with one another. People have done this famous screen swap test, where they'll take two modern iPhones, swap the screens, so two working phones, two working screens, and all of a sudden those screens won't work properly anymore. - [David] Weird. - [Will] It's super weird, and it's because of this process of software locking components to the motherboard, it's called parts pairing. And it makes repairing iPhones a minefield. iFixit has been keeping really careful track of which parts cause which problems when replaced. Some parts lose functionality, others trigger these warning messages that you can't dismiss, and there's no telling how the next iPhone is gonna behave or even which parts could break retroactively down the road. - [Jessa] You get into this really difficult and seemingly pointless sea of problems where you don't know what is just serialized serial numbers paired to your logic board, and you have to harvest it from your device versus which ones of the guts can you use that came in the phone you bought on eBay? So it's very challenging. - [David] The skeptical part of my brain here says that this is purely malicious on Apple's part, that Apple has a big repair business, that it has lots of reasons to uphold, and this is one basically impenetrable way to win that fight. But just for the sake of satiating the other part of my brain that doesn't believe everything is a conspiracy theory designed to ruin customers. What is the good reason for parts pairing? Is there a theoretically good reason for parts pairing? - [Will] Sure. I mean, Apple, and other manufacturers, will tell you that there are lots of reasons why, at minimum, it's helpful to assign like a digital serial number to each specific part. That's a super basic thing that helps them keep track of inventory and all kinds of stuff. - [David] Okay. - [Will] And even more than that, there are these kind of wonky calibration related reasons that make it helpful for your phone to know which specific part it's talking to, like which one came off the manufacturing line? So there's a lot of sort of nitty gritty stuff that is completely invisible to the end user and completely benign. But it's also just way too easy for a manufacturer to do really frustrating, really visible things with this technology too. And in the case of iPhones, it really does seem designed to kind of nudge you towards Apple's parts, towards Apple's repair shops, towards that very polished Apple experience. - [Jessa] I think that Apple is best thought of as the kind of mom that cuts your steak when you're 30. You know, it's just like, \"Let me help you with that. Let me help you with that.\" In their heart of hearts, they truly just don't want for you to have to live the sad life of someone who has an iPhone with a cracked screen or a cracked rear camera glass. Or maybe the waterproofing isn't as tight as it used to be, because you replaced the battery with some shop, you know? They don't want for you to have the hint of any kind of negative experience, they wanna cut that steak for you. - [David] It's an amazing analogy, because, A, I kind of do want that in my life, right? - [Will] It's nice. - [David] Right, there are upsides to having someone cut my steak for me, it does make me feel better. But also, it can be both well-intentioned and problematic all at the same time, right? Like, I think there's a cognitive dissonance of all of this that has always been hard for me to wrap my head around, but that's a pretty good analogy for it. - [Will] Totally. And even if you remove Apple's secret private heart intention out of it, it is just a practice that ensures a really clean experience, and then occasionally is super, super frustrating. - [David] And this is increasingly common. We've talked a bunch about Apple at this point, and I think Apple is the most obvious, just because it's sort of clear how it works. Apple has Apple stores and the Genius Bar, and the whole repair process is visible to people in the way that it's not for most other companies and products. But if I'm not mistaken, parts pairing is kind of everywhere, right? Like, I have this vague memory of people being mad about the Xbox disc drive being a separate thing, but paired to the Xbox somehow in some similar way. - [Will] Yes, and PlayStations do it too. TVs very commonly have certain paired parts. We talked about John Deere tractors earlier. It is a tough thing to keep track of, because it's not something that manufacturers advertise. It's sort of down to the repair community and advocates to kind of ferret this stuff out, generation by generation of these products. So it's a tricky thing to track but it is out there, but also everyone I talked to reiterated over and over again that Apple is far and away the leader in this space. They're just, everyone is looking to them for innovation in how to do frustrating parts pairing type things. And you know, the other thing is that Apple sold 230 million iPhones last year. So it's, you know- - [David] Fair. - [Will] This is a super ubiquitous practice for that reason alone. - [David] Especially in the US. Like, it's easy to forget this around the world, because the iPhone is not so dominant elsewhere. But in the US there is a one in two chance that if you own a phone it's an iPhone. - [Will] Totally. - [David] And I guess that is true, like as Apple goes so goes so many industries at this point, I guess, including the repair industry. - [Will] Totally. And so, if you talk to any repair shop in the US, that's like, that iPhone dominance is the thing that keeps them up at night. For them the Right to Repair story often just feels like the Apple parts pairing story. - [David] Yeah, and there's a long history of Apple policies dictating everybody else's, especially in the US on this stuff. Did you talk to Apple about any of this, by the way? Apple is like, theoretically in support of all this. Did they talk to you? - [Will] Not really. I did reach someone from their comms team, but they didn't wanna talk to me on the record about any of it. - [David] I think anyone listening to \"The Vergecast\" knows how we all feel about that overtime. So, let's go back to Jessa, for a minute, our repair shop owner. What does she want? What do people who own these shops want to see happen? Like, what is a victory for them look like in this space right now? - [Will] Yeah, well, I asked Jessa that exact question. - [Jessa] I would like to the resumption of aftermarket technology being accepted by the phone. You know, a lot of times like, the batteries, they are better than the ones that you would get in the phone. They have a little bit of a better capacity, they last longer, they're really robust by now. These have been out for a long time. And I don't think that it's the right message to send that it's inherently untrustworthy, untoward or shameful to put an aftermarket part in instead of a branded part. - [Will] And as frustrating as these legal battles have been as she's watched them, she still sees promise in that route. - [Jessa] I do like seeing these bills that have been passed and I do think that parts pairing is a really, probably the most important part of the story. - [David] Okay, so we have all these new Right to Repair laws, but it seems like most of them don't address parts pairing at all, and it increasingly sounds like parts pairing is the most important part of this story. So, where are we actually at here? - [Will] Well, we're at, pass more laws, basically. - [David] Let's get some more laws. - [Will] Yeah, always more laws, and that might happen this year. - [Senator Sollman] Good afternoon, and welcome to the Senate Energy and Environment Committee. I'm gonna open up a public hearing on Senate Bill 1596, and while you read that I'm gonna go- - [Will] So right now Oregon is considering a repair bill that targets parts pairing way more directly than any of those existing laws. I've been following the public hearings in Oregon and I talked to one of the bill's chief sponsors, Senator Janeen Sollman. I asked her, you know, what it's like to get a bill like this one over the finish line? And the first thing she pointed out is that this is the fourth attempt for a repair law in her state. - [Senator Sollman] The first time it was a very broad net, it encompassed a lot of product. And then when I got involved, the scope was narrowed, and it became the consumer items, the cell phones, the laptops and such. And it did not even move out of the House. The third time was last year, it did move out of Senate Energy and Environment. There was a delay in our floor session, because there was six weeks where there was a pause due to a senate walkout, so it died. And then, California then passed their bill, and then we started working right after the session to really fine tune and look at Oregon's policy, what we would be bringing forward. - [Will] So, it's a grind. But the fourth law has been introduced with parts pairing language intact. - [Senator Sollman] I know that the advocates feel very strongly about that. That was something that was either never introduced in other bills, or was amended out or compromised out. - [David] Okay, but it's in there this time, right? What does it say exactly? - [Will] It says that manufacturers, like Apple, can't use parts pairing to interfere in a repair. They can't reduce the functionality or performance of a product, and they can't display misleading alerts or warnings about replacement parts. - [David] I'm guessing Apple is not psyched about that specific language. - [Senator Sollman] Apple has asked us to remove it, but I strongly believe that it's a consumer loss to do so. - [Will] Can you, I would love to hear anything you can tell me about your conversation with Apple directly or indirectly? - [Senator Sollman] You know, I've engaged with Apple many times. I met with a Apple lobbyist, and we kind of went over like, \"Hey these are the issues that we see could potentially be changed. They were introduced in California.\" So I took all of that in. The second meeting, I was told to come alone. - [Will] What? That paints a picture in of itself. - [Senator Sollman] Yeah. - [David] That's amazing. It's some truly cloak and dagger politicking. - [Will] Yeah, it's ridiculous. (David laughs) So to their credit, Apple has gotten a little less cloak and dagger about all of it. A spokesman did finally testify publicly at a hearing a couple weeks ago, though he was basically just there to say, \"Please leave parts pairing out of this.\" - [Apple spokesman] I'd like to begin by saying, that Apple agrees with the vast majority of Senate Bill 1596. However, it is our belief that the bill's current language around parts pairing will undermine the security, safety and privacy of Oregonians by forcing device manufacturers to allow the use of parts of unknown origin in consumer devices. - [Will] So the line here is basically just that aftermarket parts are a crapshoot. They could be good, they could be shoddy, they could be dangerous. Parts pairing is Apple's way of steering customers away from questionable components like explodey batteries. They're super worried about security features, like touch ID components. - [Apple spokesman] Apple could be required to allow third-party biometric sensors to work in our devices without any form of authentication, which could lead to unauthorized access to an individual's personal data. - [David] So this is a slightly different take than we've been talking about with some of the parts pairing stuff, which is I think the, \"I have a working Apple thing and I wanna put it in another working Apple thing\" is one version of parts pairing. But I have to say I find this slightly more credible, the idea that you shouldn't just buy any battery you find on Amazon. And I mean, you and I have both bought crappy things on Amazon. Remember all those hover boards that exploded? Like, maybe protecting people from themselves is not a crazy idea. Do you buy that argument? - [Will] It's funny, we're coming back around to the safety argument. - [David] Yeah, you're right. Kids in dryers. - [Will] Yeah, we're back to dismembering children. But it's, you're right that batteries are an easy punching bag, because they fail and sometimes they fail catastrophically. So, as a DIY repair person, you absolutely should do your homework, and find a trusted supplier of an aftermarket battery, or you should go to a trusted repair shop. As for the kind of rogue fingerprint sensor that can hack your phone, I talked to a security expert and they said it was possible, but really farfetched. - [David] It sounds scary. It's a good like, visceral example. - [Will] Yeah, I mean, it falls really neatly into the category of what advocates refer to derisively as FUD, or Fear, Uncertainty and Doubt. Which is just a very diffuse tactic for people who want to scare you away from a thing. It kind of does go back to the issue though of just finding a good repair shop and a good aftermarket supplier. that's not gonna sell you a super sketchy part. And that is just a leap that Apple doesn't want customers to have to make, basically. So that's Apple's take on the Oregon bill. But the other notable thing about this bill in particular is Google used it as an opportunity to come out fully in support of Right to Repair, including all of the parts pairing stuff in this Oregon bill. And they're basically using this bill to loudly say, \"Yes, you can have a hardware business without controlling what goes into that hardware after the fact.\" - [Steven] I can't speak as well to that 'cause that's simply something that we do not do. - [Will] That is Google's Head of Consumer Hardware, Steven Nickel, on a call with me last week. - [Steven] You can have that quality, you can have that safety with your repairs processes that we implement and not be concerned about it, right? We work with really good repair providers. We also make the process as simple as possible, so we're not as concerned. - [Will] So, obviously Steven knows that taking this more relaxed approach means that more aftermarket parts are gonna find their way into Google products. But here again, he just didn't project any worry about it. - [Steven] We want you to have that best experience. And so, you know, we believe that best experience means authorized parts. We know that other parts are out there, third-party parts for various aspects, right? But continually we believe if we put out this experience and we make authorized parts available, accessible and affordable, you're gonna select those, right? - [Will] So that is basically where things stand at the moment. Google and Apple both support the basic concepts in these repair bills, and now they are duking it out with lawmakers over specifics like, parts pairing. Which is not super satisfying for shop owners, like Jessa, it's slow moving, it's precarious, but everyone involved is starting to reach the marrow of this debate. And along the way Senator Sollman is noticing that same shift that Nathan Proctor and other advocates are seeing in the industry. This really slow, but steady realization that opposing repair laws just isn't a good look. - [Jessa] You know, having folks that have been at the table but are now neutral, having Amazon neutral, having Intel neutral, Microsoft, OBI, which is the Oregon Business and Industry, which has been in opposition, is now neutral. So, this policy is coming and I'm really excited to be one of the ones to bring that forward. - [Will] Gotcha. So to be clear, getting to neutral is the win, because all of those groups were in opposition, yeah. - [Jessa] It's an absolute win. - [David] This goes back to something Kyle said to us last year, which is basically that the big shift was making it very hard for someone to credibly, loudly be against Right to Repair. And it does feel like that has shifted, that we've gone from sort of a reasonable, \"People can disagree\" way of thinking about this stuff to Right to Repair is the right idea. And we can argue about the details of it, but this is clearly how it should work. And I think at this point, that particular battle does seem like it has been won. - [Will] It absolutely has. And everyone I talked to said the same thing, that 10 years ago it was perfectly acceptable for a manufacturer to say, \"No, we know best. We own this entire process, this is how we operate.\" There was no pressure to even give lip service to this idea. And if nothing else, there is now a lot of pressure to give lip service to this idea. - [David] Right? You have to at least pretend to care now. - [Will] Yeah, and then, and now, it's the whole battle is going from pretending to care to if not actually caring, being forced to participate in ways that are really meaningful. - [David] Right, and figuring out how all of this is actually supposed to play out in the real world. We're still at the phase of if my phone breaks, where am I supposed to go, and what am I supposed to do? But that's a much more interesting next phase, I think, than, \"Am I allowed to fix my own phone?\" - [Will] Yes. - [David] It also seems like that is leading us to the next question, which is basically like, how is all of this supposed to work in the real world? Because I'm also increasingly aware of the fact that everything we own is technology, and everything we own breaks in new spectacular ways. And so, we're gonna need this big vibrant repair ecosystem, and we figured out like very little of it yet, but at least we can get to the work of figuring out how it's all supposed to work as opposed to figuring out whether we're allowed to do it, right? - [Will] Absolutely. And it's a very good point that like, as smartphones go today, so could go a lot of different things in the future. - [David] Yeah. - [Will] So I wanted one last perspective on this, which is the zoom all the way out, why is this gonna matter to everyone in the future, perspective. So I called up someone who thinks a lot about how to keep all of this technology working for us. - [Stacey] My name is Stacey Higginbotham, I am a Policy Fellow at Consumer Reports. - [Will] Stacey spent years reporting on the Internet of Things. So when she looks at a technology like parts pairing, she sees trouble ahead for a lot more than cell phones. - [Stacey] We're adding software to a lot more products that historically haven't had software in them, a good example would be your home appliances. Your current home appliances may not have like, a wifi chip in them, and they may not have a lot of software that allows them to do cool features, but your next one probably will. Those companies are learning from what Apple's doing, and they're going to be implementing similar sorts of software pairing techniques to make these devices less repairable by third-parties, but also just less something that the consumer themselves has ownership of, if that makes sense? And that's the big risk here, I think, with software pairing, is that it's not gonna stop with your phones, it's gonna go to everything, because as we connect our devices to the internet, they get not just radios, they get software and cool features, and you're gonna lose control over a lot of that going forward. - [David] Okay, so you've just brought up the like, big, huge, galaxy brain size question behind all of this, which is, do we actually own the stuff that we buy? And like, we cannot get into that now because dear God, the things it will do to me and this episode. But that does feel like this question, right? All of this boils down to like, is my iPhone, my car, my dishwasher, is that mine to do with as I please? Or am I essentially operating something under someone else's purview? - [Will] Exactly. And iPhones are just far enough out ahead of all of this that it is easy to look at them and start to go like, \"Oh, what if the whole world worked like that?\" And so, that's what we're doing right now with consumer electronics like iPhones, and it's what a lot of this Right to Repair movement really boils down to in the end. - [David] Okay, so someday, very soon, you're gonna come back here and we're just gonna get deep in our feelings about ownership, and I'm gonna yell about Kindle books getting removed from Kindles, and it's gonna be a whole thing. - [Will] Yep. - [David] But for now, you mentioned more laws. We're gonna cover Right to Repair a lot this year. I actually think this is like one of the big sort of, trundling along in the background stories in this industry, and you're deep in it now, you're gonna keep covering it for us. But set the stage for the rest of the year for us a little bit. What is 2024 gonna look like in this space? - [Will] Well, we're gonna have to see, it's really hard to predict what happens with all of these different bills. So I'm gonna be following what's going on in Oregon. That bill that we talked about just passed out of committee. It's headed for the full senate in Oregon right now. So, we'll see what kinda legs, lucky number four in Oregon looks like. I'll keep track of other state bills, and I wanna just keep talking to repair shop owners and DIY folks, because parts pairing is really important for them, but there's a ton of other stuff that they're grappling with every day that is very closely connected to the Right to Repair that has nothing to do with anything that regulators are trying to tackle right now. So there's just a lot more going on here. And as you say, I think this year is gonna be a big year both for the laws and for people asking those even larger questions. - [David] Fair enough, how should the people get in touch with you? Like we said, you're gonna be covering this all year. If you are, run a shop and want to talk about it, or just have feelings about your iPhone screens, how should people find you? - [Will] Oh, email me, william.poor@voxmedia.com. And I will check back here when I learn more about all those things. - [David] Awesome. Thanks, Will, appreciate it as always. - [Will] Yeah, absolutely. - [David] All right, we gotta take a break, and then we're gonna come back. And we're gonna talk about some big and slightly confusing news from Microsoft. We'll be right back. (upbeat music) Welcome back. So, we talked a little bit about this on Friday's show, but Microsoft made some big gaming news last week that was also kind of small news. The company announced a couple of new bits of information about how game streaming and Game Pass are doing, but also said that it's gonna take four games, which have previously been Xbox exclusives and make them available on the PlayStation, and the Switch. In and of itself, this is not earth shattering news, it's a couple of games in a couple of new places, but there's something bigger going on underneath all of this. And \"The Verge's\" Tom Warren, I guarantee you knows what is. Tom Warren, welcome back to \"The Vergecast.\" - [Tom] Hello. - [David] You have had a week, my friend. - [Tom] I have, it's been an Xbox week. - [David] I feel like Microsoft likes to do this to you every once in a while where they're just like, \"For five straight days we're gonna ruin Tom's life.\" - [Tom] They're like, \"Tom, it's his birthday, so we're just gonna mess up his week for all the times that he's messed up our weeks.\" - [David] Yeah, it's kind of them, yeah. So, okay, so let's talk about the news, which will take us not very long. And then I wanna talk about all the stuff underneath the news, because this is very much sort of the tip of the iceberg above the water kind of moment for Microsoft and Xbox. So I wanna talk about all of that. But the news of this podcast, which is just the funniest way ever for Microsoft to release this news. What new stuff did we get from this Microsoft announcement on Thursday? - [Tom] Yeah, I mean, the big news is obviously the stuff that's been rumored for weeks or months now, and that is that Microsoft's bringing four games, which they're not actually naming, and we'll get into that, but four games to PlayStation, and Nintendo Switch, or Nintendo Switch. I don't think every single one of those games will come to both, as far as I'm aware. But yeah, four games on multiple platforms, essentially. Now obviously Microsoft does publish, you know, \"Minecraft\" and games like that, and they're gonna be publishing \"Call of Duty\" now 'cause of Activision Blizzard, on multiple platforms. But I still think this is still, although they downplayed it, I still think it's pretty seismic. Like it's, you know, putting your Xbox exclusive games that people have purchased on Xbox on to rival platforms is definitely a strategy shift. Even if they framed it as just four for now, we're just gonna, you know, take some learnings out of it and stuff. But that was the big news, and then they kind of softened the blow of that, because obviously they knew it was gonna be pretty controversial amongst the Xbox fans, like doom and gloom. With the fact that they're working on a next generation console, which, you know, you'd expect them to be, right? But they're saying it's gonna be, you know, some giant technical leap. So, we'll see what happens there. Other than that there was the first Activision/Blizzard game, \"Diablo 4\" coming to Game Pass, a sort of reaffirmation of Game Pass being, you know, games being day one on Game Pass. And then just this kind of light sort of theme throughout it of bringing the games to players where they're at, that very much that multi-platform thing, so. - [David] Right. So, and that seems to me like the big picture underneath all of this. - [Tom] Right. - [David] And my sense is Microsoft would very much like you to think that it's just sort of running an experiment, just trying some things, seeing what happens. \"Let's just put some games out, who knows what'll happen.\" But underneath you get the sense that this is like, this is a moment for Microsoft that is much bigger than it would have you believe. So, like, dig all the way down to the bottom of the iceberg here. Like, what is the sort of big picture thing that Xbox is trying to do? You got this leaked memo from Phil Spencer that I think kind of seems to lay it out in bigger picture terms, but even that might be downplaying it slightly. Like, paint me the biggest version of this picture here. - [Tom] So I think we have to, to paint the picture, we have to understand why they would even do this in the first place, right? Because it sounds, if you said this a year ago, people would be like, \"No way, they're not gonna bring Xbox games to Play Station. That's just like, you know, conspiracy theory or whatever.\" But if you look like, so, two years ago they obviously announced the acquisition Activision Blizzard. At the time they had 25 million Game Pass subscribers, and they announced that. Since then we've never heard anything more about how many Game Pass subscribers they've had. At the time they were kind of pushing Game Pass as the reason to buy an Xbox series S and X. They launched the series S as a $300 console, that was kind of the Game Pass console, right? Like, you buy that to to get the Game Pass subscription, that was the way in, right? Sales of those consoles haven't gone as well as Microsoft hoped. We've seen that they're still lagging far behind the PS5, and Game Pass has stalled. So, Phil Spencer admitted that in late 2022, so probably about 10 months or so after they announced that 25 million. - [David] And I think you can fairly safely assume that the fact that we have not heard much since then is not a sign that it has massively turned around. - [Tom] Not good news. - [David] Yeah. - [Tom] But the one thing we didn't mention with the news is that they actually said 34 million now. - [David] Oh interesting, okay. - [Tom] Which was pretty much spot on what analysts said, they said 33.3 million, so it's like very close. That includes Game Pass Core, which used to be Xbox Live Gold, so that is an interesting part as well. But when you take that example of Game Pass stalling, Microsoft needs to find revenue growth elsewhere. If they're not selling the consoles, and getting that user base up so that they can sell, you know, the micro transactions, the games, all the in-game content, everything else, you need to find revenue from elsewhere, right? You still need to grow, Microsoft needs to grow, especially when they're putting so much money on the line for these studios. So I think that's the main driver behind this. And you are right, like, they're framing it like it's a test, right? \"They're gonna learn\" And I'm sure, yeah, they'll learn a bunch of stuff, but they've already been publishing on PlayStation and Nintendo for years now. So there's not a lot of learnings that they're gonna pick up there that they don't already know. - [David] So if I'm Microsoft, it feels like you take kind of the last couple of years and you can do one of two things. You can either say, \"We believe that streaming and cloud, and Game Pass is the future. We think we're early.\" Microsoft has a really long history of being slightly too early to really good ideas. - [Tom] Yes. - [David] \"But we are gonna keep pushing on this.\" And they've talked a lot about how they're in third place, and this is the way to win the next generation. And so, if you're Phil Spencer, there's a version of this story where you say, \"The only way out is through,\" right? - [Tom] Yes. - [David] The other side is to say, \"Maybe this isn't working.\" And then to say, \"Okay, let's go back to something that feels more like a way that you can actually make money in the gaming industry.\" And the two ways to do that are either make games that people buy on lots of platforms, or make a gaming platform on which people buy your hardware and play your games. And it feels like Microsoft is wanting to say that it's still on the streaming is the future side of things, but is kind of like trenching back towards this like, very normal way of running a gaming business. - [Tom] Yeah, and that's a good point. Like, the cloud stuff is also a big part of this as well, because they kind of bet on cloud being bigger than it perhaps has been or will be potentially in the next sort of five years. Essentially, I've heard they've also had this vision of Xbox everywhere, right? Like, on every screen or whatever, which we've heard them say in this leaked memo. It's always been that vision, like on PCs, on consoles, on cloud, you know, getting into mobile devices through streaming. That's always been that vision. They've just kind of tweaked it to now include PlayStation and Nintendo Switch as targets for that vision. Something that I haven't seen anyone's kind of picked up on or I haven't written about it, I probably should. But if you think about this, when you publish a game on a rival platform, say like Blizzard, they publish like \"Overwatch\" on multiple platforms, you sign in with your Blizzard ID to get into that game, that gives you cross progression and all sorts of account linking stuff. What happens if Microsoft does that with its games that it brings to PlayStation and Switch? Like it requires an account where you get some of that Xbox ecosystem, the cross saves, and if you do wanna buy an Xbox then all your saves are there. All that sort of stuff that they constantly talk about. And what happens if they do eventually then start selling subscriptions to give you in-game stuff or like perks, and stuff for those games. I don't know exactly how that'll work in terms of the platform holders allowing that, but it's a possibility that these could even be like Trojan horse games for something like that down the line. 'Cause they know they can't get Game Pass natively on those consoles 'cause Sony's gonna want their 30% cut, Nintendo is, and just like Microsoft would if it was the other way around, so. But I do feel like there's a possibility that they might be able to work around some stuff with the account stuff, but we'll see. - [David] That's interesting, and so maybe I'm not giving Microsoft enough sort of vision credit there, that maybe they're not just pulling back to, \"We have to sell people video games, because that's how you make money in the gaming business, is by selling people video games, and we have to do it any way possible.\" That they can do a little bit of that while also still pushing on this, \"Xbox everywhere, every screen should be an Xbox,\" kind of strategy. Which like, it'll actually, I think is the right strategy. I think it's again, it seems like Microsoft is early here, and whether it can survive how early it is remains to be seen, but it does feel like that ought to be where all of this goes. And maybe Microsoft isn't giving up on that entirely by doing this. - [Tom] No, and I think a part of it is also, they, obviously Game Pass is pretty disruptive, it was definitely something that kinda shook up the industry a little bit. It definitely made Sony respond, right? They responded with subscriptions beyond what they were offering. And I do wonder if that's kind of Microsoft's plan here as well, is like to try and shake up this idea of exclusivity. 'Cause obviously we saw the Sony president announce just hours, funny enough, before Microsoft's event that they wanted to aggressively pursue multi-platform, or that's the way they say it. But I think the way that you can really understand that is PC, 'cause he did mention computers in particular. So I think that's more them saying they want be day and day on PC more often, 'cause there's money to be had there, right? Like, \"HELLDIVERS 2\" came out recently, and it's doing massive amounts. And I think this is Microsoft kind of saying, \"Sony you should probably do this as well, you know, like do it on PC.\" And I don't dunno whether we'll see Sony do PlayStation games on Xbox anytime soon. But the other part of all of this with, if people are all publishing on different rival platforms and stuff, it's just vows just sitting there sort of laughing, right? - [David] Yeah, true. - [Tom] They've got all the exclusives they want, right? They're getting the PlayStation ones, they're getting the Microsoft ones, they're not getting the Nintendo ones unless Nintendo does PC games, which I do think they should. But they are building, quietly building, the Steam Deck and Linux platform to rival Windows. And that's one of the last touch points of Windows for consumers, is gaming, right? Like, if Microsoft loses that, they lose a lot of consumer in really, if that goes away. So I think there's definitely a part of that as well that Microsoft's looking towards. They're seeing what vows do in that strategy. There's a possibility that we could have gaming consoles that are Steam Decks, right? They are basically a game console now, so you can plug it into your TV. - [David] Well, and speaking of that, we were sort of anticipating potentially getting some big hardware announcement. We've been waiting for the Xbox handheld for what feels like years now, and we didn't get one. But you asked Phil Spencer about it, and I would describe the answer he gave you as the closest thing to saying, \"Yes, we're building a handheld,\" that he could possibly say without saying the words, \"Yes, we're building a handheld.\" Was that your read of what's going on? - [Tom] Yeah, that was my, because he said like, \"Unique hardware,\" right? Like, \"And positioning the hardware teams to sort of design in a way that they haven't before.\" And obviously, they're gonna have to create unique hardware if they are putting more of these games cross platform, you need to have the hardware be some sort of unique thing. So, that doesn't seem too surprising. But yeah, I did ask him, 'cause he always likes a bunch of people's tweets about handhelds so I'm like- - [David] It's such a funny strategy, I love it. - [Tom] It's so obvious, right? Like, he's obviously trying to say something but, and I think part of it's, they obviously have to improve the Windows situation on handhelds so there's competitors to Steam Deck. But yeah, like the Xbox handheld itself, I'm very curious if they do that, and when, and on what sort of platform that runs. 'Cause I think the most ideal thing that they could do, which they could technically do, it's just whether they could put all these things together, is have it run Windows but never expose Windows. Like Steam Deck has Linux and doesn't really expose it unless you want to go into the desktop. But then have it run the virtual machine of Xbox OS on top so you can get Xbox games on it. 'Cause then you don't have to worry about the PC Game Pass Store, and the Microsoft Store, which isn't very good on PC. And then you get the best of both worlds, right? You can still play Steam games on it as well. Like, that would be, if you wanted to sell me a Steam Deck that was running it, that would be, I think, a lot of people would buy that. - [David] I think so too. Well, and this goes back to one of the strangest Microsoft strategies to me, and, you and I have talked about this before, but I'm curious how you're thinking about it now, which is, Microsoft never seems to be able to decide whether it wants to make its own hardware, and it kind of vacillates in and out between betting really big on Surface and doing some really interesting work and really changing the PC industry, and then this sort of pull back from the innovation there, which, you know, caused Panos Panay to leave, and some other machinations going on there. But it seems like if I'm Microsoft, and I am all in on the hardware business, they should have built more Xbox stuff by now. So it seems like there's one way to read that, that's like, well, these two things are too obvious to have not been together by now- - [Tom] Right. - [David] If Microsoft actually cared about doing this. And if you're taking the Windows strategy, you just kind of are happy running on partner devices rather than trying to build your own. - [Tom] Yeah. - [David] But then it is pretty obvious that they're building a handheld. So like what do you make of this? Like, does Phil Spencer wanna build this hardware, or is he trying to like, start an ecosystem of hardware that he can just put his games on? - [Tom] I think, ultimately, they probably do wanna build the hardware. - [David] Okay. - [Tom] There'll probably be some sort of combination of the Surface team doing that, or helping out with it. 'Cause they kind of helped out with some of the Xbox stuff anyway. And a lot of the lab testing is kinda shared. But yeah, like, I do think they'll build it. It's just, it comes back to the question of, what platform will it run on? And I think that speaks to probably why they haven't done it before. There's been that weird, like, always this weird split between Xbox and and PC stuff. And Microsoft's always tried to kind of force the console stuff onto PC, but PC games don't really want that. They use Discord and Steam, and they don't really care about an Xbox party chat or whatever. Like, that's not a thing. - [David] Right. - [Tom] And it's just, I think that is reflected internally. Like, there's, like the old days, what was that org chart where Microsoft's business units were pointing guns at each other? Like, I think that's still- - [David] That's right. - [Tom] That still kind of exists a little bit, and there's still fiefdoms and stuff, you know? Like, I do think that Xbox hasn't been able to do exactly what it wants on Windows, because the Microsoft Stores there, the, you know, there's a control of Windows that's away from Xbox. So, if they can break down those barriers somehow, like, they're gonna have to, if they want their gaming business to survive on Windows, at least anyway. 'Cause Valve is doing some impressive stuff and I don't know, that's the biggest threat, I think, to Microsoft's gaming stuff rather than Sony. - [David] When Microsoft talks about its competitors, Phil Spencer and others, they talk a lot about PlayStation and Nintendo. - [Tom] Yeah. - [David] But they don't talk a lot about Valve. Like, how much do you think Valve weighs on Phil Spencer's mind as he considers the future of Xbox? - [Tom] I think more so these days, although he probably wouldn't admit it, but I think you can just see that, like obviously Steam Deck isn't doing huge numbers right now, but it's starting that category of devices. - [David] But it's like, beloved. - [Tom] Yeah, and it's beloved. - [David] Gamers, like capital G gamers, like love that thing. And I think, I feel like if I'm Phil Spencer, the thing I've learned over the last decade is, \"I have to keep the capital G gamers happy.\" - [Tom] Yes, exactly. Yeah, like it is becoming, it's something that's had promise for like 10 years, and now it's like an actual reality. Like, people are actually playing these things, they're not just some random OEM from somewhere that's creating them, this has got the full backing. And Proton on Linux, that's the main, that's the key, right? It's getting those games and like, not emulated, but you know, like translated onto Linux. So yeah, I feel like if they can tie it all over together internally at Microsoft, then they could pull something off, like the Windows underneath and the Xbox on top. But there's licensing stuff, like they, publishers say, when they bring their game to Xbox it's on a console, right? Not on a PC. - [David] Interesting, yeah. - [Tom] So there's a lot of stuff to work through, if they're ever gonna do that I don't know whether it'd ever realistically happen. But that would, I still maintain that if they did pull it off somehow it would be a killer device. - [David] It does feel like this is a year where if everything goes right, Microsoft's vision for this could come sort of to fruition in really interesting new powerful ways, right? It has, Activision Blizzard, so it has this big new, I mean title in \"Call of Duty,\" but also this big new pipe into mobile in a way that Phil Spencer has been telling you for years is really important. With all the changes coming to the app stores, Microsoft might have an in to be able to do more stuff. The handheld thing could start to happen. Like, it just feels like, if Microsoft's vision of kind of Xbox everywhere, and being this platform across all different screens. Like, it does seem like a lot of things would have to go right, but you can sort of see how the pieces would start to fit together, right? - [Tom] Yeah, no, you can. And you mentioned mobile, and I think that's like, that is a key one for them 'cause they're obviously gonna be publishing a bunch of like, \"Call of Duty\" mobiles, is huge. So they, with Activision Blizzard, King, \"Candy Crush,\" all the rest, they get a really big entry point into mobile and they've obviously were trying to leverage that to build a store on iOS and Android. But then obviously the Apple changes, and Phil mentioned, I specifically pushed him on the Apple changes for Xbox cloud gaming, because I think that's kind of a precursor, I'd say, to the mobile store. Because they've been trying to get that app on there for years now and they've had to do a progressive web app instead. And it's interesting that you said, \"We can't monetize Xbox cloud gaming even if they were to do an app.\" So obviously, whatever Apple's changes are under the hood, they're not good enough for Microsoft. And it's also interesting that those changes, and what Apple's doing in iOS 17.4, by removing the PWA apps, means that Xbox cloud gaming is basically just gonna, it's gonna be a link now, it's not even gonna feel like a slightly native app. So that puts 'em back, a step back as well, in the EU markets at least anyway. - [David] Yeah, Apple's ability to claim it has opened up the App store while seeming to not satisfy anyone who wants an more open app store has been very impressive. Is he still thinking about mobile as kind of the center of what's next in the gaming ecosystem in the same way? - [Tom] I feel like a few things have shifted, right? Because for mobile, for Microsoft, that when they were thinking about it, it was more cloud, right? Before a APK, to which Blizzard King. But now, the cloud has slowed down, and people aren't really as interested in it, and handhelds are emerging, right, as the kind of mobile now, almost. I feel like that's shifted things a little bit. It's definitely shifted our thinking, like we thought that cloud would, you know, grow like Microsoft did. And I think targeting mobile native games in iOS and Android is, is still a ways off. Like, they have these big ones, but they still need to build a bunch of different games there, so. I don't know that there's necessarily change, I think it's just definitely pushing more towards the handhelds than cloud to get to that sort of mobile state, or this idea of Xbox everywhere, you know? - [David] Well, and to that point, actually, one of the things you asked Phil, that I thought was a very funny way of asking the question, was basically, would you rather continue to pursue the next \"Minecraft\" or the next \"Pal World\" or the next version of these individual games? Not gaming platforms, but games that are sort of universes and platforms unto themselves, rather than trying to get more Game Pass subscribers? And he said, he gave you a really wishy-washy answer, which is basically like, \"We'd like both,\" which like, of course. But it does seem like we might be entering a phase where rather than I have access to, you know, these 10 AAA games all in one place, we're kind of entering a place where the AAA game is the platform. Like that's what \"Fortnite\" is becoming, \"Minecraft\" is that, \"Roblox\" is that. Maybe that's the next turn rather than I have a bunch of sort of disparate games all available in the same app, and Microsoft is gonna, like, all you have to do is look at the money and that's what it would tell you to chase right now, right? - [Tom] No, I agree. And I kind of posed a question to him as like, that's my thinking that they'd rather have another \"Minecraft\" like, or a \"Fortnite,\" you know? Like, these are essentially social platforms that teenagers hang out in, right? Just to chill with their friends. So, who wouldn't want that? And that the amount of in-game revenue like, that's a big chunk of the Xbox content and services revenue, right, is from all these in-game purchases. So I'm sure they would love a massive hit like that, and \"Pal World\" was obviously a big one for them, having that just not exclusive to Xbox, it's just the fact that Sony doesn't allow those early access games on their platform. But having that available on Xbox is, I feel like that's probably been pretty enlightening as well. So yeah, I feel like they would still prefer to have one of those big games than, you know, another billion Game Pass subscribers or whatever. Because they probably get the Games Pass subscribers on the back of that anyway. - [David] Right. Yeah, I mean, and I think, what does seem to be true is that making one of those that is a big hit is a lot harder and a lot more finicky than it gets credit for. So he's probably right to kind of hedge his bets a little bit there. But it certainly seems to be true that if you can get one of those handful of spaces online where people actually wanna be, and hang out and spend time, I mean, you've caught lightning in a bottle and you should chase that kind of to the ends of the earth. - [Tom] Yeah, it's, I think it's the thing that they're track internally as well, it's like, it's the engagement right there that everyone tracks these days as well. The time spent in a game, the time spent on the console, rather than we've sold X amount of consoles, which is great, but it, that's a funnel into your software. And if you don't have the games to keep people sticking in there and they're going elsewhere for, you know, whether it be Netflix or whatever, for their entertainment needs, is keeping that sticky experience to keep people spending and keep people playing, and all that sort of stuff. So, that's definitely the way that they're looking at it internally. - [David] Makes sense. So, okay, last thing, and then I'm gonna let you go. The four games that are coming from Xbox to other platforms, Microsoft has not announced, but you know, because you're better at this than everybody at Microsoft, sorry, everybody at Microsoft. What do you make of the four games that Microsoft picked to do this with? And then also you asked Phil about \"Starfield\" and \"Indiana Jones,\" kind of these bigger name games, the sort of central franchises. Do you think we're gonna see those at some point here in the future go down the same road? - [Tom] Yeah, so, the four games are kind of interesting, 'cause \"Sea of Thieves,\" obviously, it's a pirate game, which would be kind of funny to watch Xbox fanboys and PlayStation fanboys battling it out in the seas, right? Sinking each other and- - [David] It's actually kind of perfect. - [Tom] Virtually murdering each other. So, that's gonna be quite funny to witness. And I think that one makes sense, right? It's a multiplayer game, a live service game. You do want those games across as many platforms as possible because when the numbers dwindle, then it doesn't make for such a good game, less people playing it. So, that one makes sense. Similar sort of thing for \"Grounded\" as well, similar sort of multiplayer sort of experience there, and stuff. And then you've got like \"Hi-Fi Rush,\" which I think is probably one of the ones where it's like less obvious why it should go on other platforms. But I think the way they kind of launched it, it was like a shadow drop after an Xbox, I think it was like developer, director they had. And it didn't really have much fanfare, but it's like a great game. So one of the, I think Phil described it as like, \"A hidden gem,\" which is true. And then they want more people to experience that, and it could, I guess, get people to think differently about Xbox games or Xbox as the platform, like that sort of thing. Same kind of, same thing with \"Pentiment\" as well. The interesting one about \"Pentiment\" is that we should have known that it was gonna go on Switch or PlayStation all the time, because in Microsoft's blog post, when they first announced it, at the bottom of it they said, \"Xbox console launch exclusive.\" So AKA, is gonna go elsewhere. Like, they had it there plain as day all along. But yeah, like beyond that, these are the four that they're talking about initially. But beyond that, there are bigger questions around \"Starfield,\" obviously \"Indiana Jones,\" other games. There's a bit of a backlash as well with the Xbox fans at the moment about \"Starfield,\" and some of the reporting around it, and \"Indiana Jones.\" So, I just wanna be super clear that Microsoft is considering both of those, it was considering, it still is considering, it's not off the menu, it's not on the menu, it's not been finally decided or anything like that. So those still could come, but they might not, we don't know yet, it's not a finalized decision like these four titles are. But I think, the important thing is the fact that they were even considering it shows you what their ambition is here, right? The talk of Xbox, \"Every screen is an Xbox, Xbox everywhere,\" all that sort of stuff. If you add it all together, you can, you know, and you look at their finely-crafted messaging during that podcast, if you read between the lines, and you look at very, no bias or anything like that, you could pretty much see what their strategy is, right? They, let's go slowly, surely, maybe some learnings, maybe we'll launch day and date, certain game in the future, unannounced games, all that sort of stuff. Like, they're toying with all these sort of ideas. Nothing is final, but I think it does come down to the fact that they're even thinking about that stuff. That's the interesting part for me, I think that was the bit, when I heard that they were like thinking about some of these things, then you know it's a bigger strategy shift than the way they kind of teased it out on Thursday. - [David] Yeah, and you get the sense that Microsoft is trying to do a huge thing without anyone realizing how huge a thing it is. Which Microsoft has learned the hard way, when it makes giant noises about how it's gonna change every industry forever, it goes badly. So this time it seems like they're trying to make just as big a change, but like, so quietly that nobody notices. - [Tom] Yeah, and then it gives them the room to adjust as they go, right? Like, they could have some plans for certain games to come in like the next six months. And the problem everyone also has to think about is that this is gonna cost them money to port this, to do the work, and it's not something they just go, \"Okay, we're gonna put this game in here,\" and then, you know, Monday they publish it. This is planned months in advance. This is like a big project internally, so it's not something they've just thought, \"Oh, we're gonna do these four games.\" But yeah, it does give them that freedom to sort of tweak things as they go, look at what the fans reception, look at the sales numbers, all this sort of stuff. They'll have people pouring over all this data with MATLAB for hours and hours, I'm sure. But yeah, like, I think it still speaks to that there's something bigger going on for sure. - [David] All right, well, I suspect it's gonna be a big year, so we're gonna have to check in a few times. But Tom, thank you as always. Appreciate it. - [Tom] Thanks man. - [David] All right, we gotta take one more break, and then we're gonna get to \"The Vergecast\" hotline. We'll be right back. (upbeat music) All right, we're back. Let's get to the hotline. As always, the number is 866-Verge-11. The email is vergecast@theverge.com. We love all of your questions, and we try to answer at least one on the show every single week. We've been getting a lot about the Vision Pro, and if I'm being honest, I'm excited about the idea of talking about something other than the Vision Pro. So if you have questions about anything on Earth other than the Vision Pro, please send them in 866-Verge-11, vergecast@theverge.com. This week we have a question about passwords. - [Caller] Hey Vergecasters. My question is kind of simple. Do you think the recent slate of crackdowns by Netflix, Hulu, et cetera, on password sharing, will achieve their goal of getting more paid subscribers? Or will people just throw their hands up and say, \"It was fun while it lasted.\" You know, like many families, friend groups, and the like, you know, mom and dad pay for Netflix and Max, I pay for Hulu, Disney Plus and Amazon, and we've had our little happy Netflix, Amazon sharing ecosystem. Now that I can't access the Netflix account, I kind of refuse to get my own, partially out of spite, and partially out of my budget genuinely not allowing for it. So I'm wondering, do you think there'll be more people like me who say, you know, F it, and just do without, or more people who will suck it up and you know, get their own subscription? Who do you think is gonna blink first, us or the services? Thanks. Hope to hear you guys answer this question on the show. Appreciate what you do. - [David] Of course, we have a question about passwords, and we have a question about streaming. Who else but Alex Cranz. Alex, welcome. - [Alex] Hey. - [David] Okay, so first of all, I wanna know, does your family have a, who pays for what streaming arrangement? Because my family 100% does, and I'm glad to know that others do too. - [Alex] Yes, but it's really just, I pay for everything and then my mom, when she wants to watch things, or my sister, they like text me and they're like, \"Can I have your password?\" - [David] So it's just everyone mooches off of you? - [Alex] Yeah, they're just all mooches. But I guess it's like reciprocal, I mooched off my mom for, you know, 18 years, so. - [David] That's fair. This is your way of paying them back, that's beautiful. - [Alex] Yeah. - [David] So what do you think? I realize I have a pretty strong opinion here that I can't base on anything, but I'm curious what you think. - [Alex] Well, the data suggests that consumers blink first. That we blink before the companies do, right? Like, Netflix has been successful with their password sharing crackdown so far, which is like a major bummer, because I really want them to blink first. But now that Hulu's doing it, now that Disney Plus is doing it, we're getting more people in on it. At some point that's gonna stop, right? At some point people really are gonna stop saying, \"No, I just don't need this product.\" And Netflix has been like really successful, because it's Netflix. - [David] Right. - [Alex] Hulu might not be as successful, even though everyone should go watch \"Fargo.\" It's great. You know, a lot of people will be like, \"I don't need to watch \"Fargo or whatever new FX show is on, I don't need to watch \"Bluey.\" That's the Disney plus one, right? Yeah, like that may happen, in which case, yeah, suck it streamers, stop trying to like, crack down on all of us, just let us do what we want. - [David] Yeah, that's basically where I land too. I think, it seems to me that it's clearly going to work from a technological perspective. Like, I think when Netflix started doing this, everybody's like, \"Oh, this will be easy to get around.\" Like, spoiler alert, super not easy to get around. They have more or less done the thing they set out to do. And from that perspective, it's clearly gonna work and anyone who wants to lock people out is going to lock people out. They're getting very good at this, it's very sophisticated, it's just gonna work. I do think that if you're a streaming service, the very last thing you want to do is give people a reason to say, \"Do I actually watch anything on here?\" And to your point, right, there are streaming services that I pay for, like for me, weirdly enough, it's actually Disney Plus. I don't use Disney Plus that often, I don't really know why. Like, I like all the stuff that's on there. It's just not, when I sit down to watch something, it's probably the fourth app I open. And so for me, the minute it becomes sort of in my face whether I want to keep paying for Disney Plus, I'm probably gonna say no. And I think what's about to happen to a lot of people is it is going to be put in their face, \"Do you still want to pay for this?\" And I think you're right that the answer for most people for Netflix is yes, right? Like, I watch an alarming amount of Netflix. Most of it is not stuff I couldn't live without. There are very few things on Netflix that feel like core to my personality and life, but it's just where I go to watch stuff. And that's pretty powerful. And also only Netflix gets to be that thing. And so for me, I feel like Disney Plus can probably get away with it just because it has some of that same like core content to some people. But like, Hulu is actually probably a good example. Like, how much stuff is there on Hulu that if Hulu suddenly went away from your life, you would be like devastated without? - [Alex] I really liked \"Fargo.\" - [David] \"Fargo\" is really good, I'll give you that. - [Alex] Look, the new season was excellent, but I agree, yeah, like, Hulu is one I probably, I might turn on, right? I might subscribe when I need it and unsubscribe when I don't. - [David] Yeah, my big galaxy brain take is that it is both going to work and it is also going to speed up this crazy consolidation that is happening in this industry right now. Where having the account is going to be the way that you win, right? Like, having a login that I have, which for lots of people, they're not going to have a login anymore, and they're gonna have to make a new one. And people, making a new login is hard, and you lose a lot of people when you make people do it. And so, I think it's gonna take all of these not quite Netflix streaming services and it's gonna make their lives much harder in service of trying to get more people. So I think it's gonna consolidate. - [Alex] That's why they're doing that thing where they're bundling, right? - [David] True. - [Alex] That's why Paramount Plus, you can get that now through Amazon. 'Cause they acknowledge that most people only want that for either their Taylor Sheridan or their \"Star Trek\" fix, or to watch the Super Bowl poorly. So I think they, they kind of recognize what's gonna happen and a lot of them have made peace with it, and Netflix can get away with it. Netflix has shown it works for Netflix, so Netflix is gonna keep doing it and it'll be fine until one day you say, \"Ah, do I need to watch that many K dramas? Maybe I can watch something else on another channel.\" and be done. - [David] Right. Yeah, we're definitely in a phase where Netflix kind of continues to flex on everybody, and everybody is trying to do a Netflix impression, and it seems less and less likely that it's gonna work for a lot of these companies. - [Alex] Yeah. - [David] All right, well, we'll see. In the meantime, we still should have been angrier about this the whole time, and I'm angry about it now, and we will continue to be angry about it. - [Alex] Just find a great website where you can download a file, and then you put that on a software program and it, stuff happens. I don't wanna get too into it, but you can work around it. - [David] At the end of this, Alex's Plex server will be the only streaming service left, and it will be great. - [Alex] Just pay me money. Don't actually pay me money. Nobody, please, don't come and shut me down. I do not share it with people for money that's wrong and immoral. - [David] Well, we're all going to jail. But thank you Alex, appreciate it. - [Alex] You're welcome. - [David] All right, that's it for \"The Vergecast\" today. Thanks to everybody who was on the show, and thank you as always for listening. There's lots more on everything we talked about at theverge.com, lots of Right to Repair coverage, lots of Tom's stuff, especially his interview with Phil Spencer, which you should read all of, it's really interesting. We'll put some links in the show notes, but you know, theverge.com, it's a website, be like it. As always, if you have thoughts, questions, feelings, or other games you'd like to see ported to new platforms, you can always email us at vergecast@theverge.com or keep calling the hotline, 866-Verge-11. Hearing from you is my absolute favorite thing about doing this show, so keep 'em coming. This show is produced by Andrew Marino, Liam James, and Will Poor. \"The Vergecast\" is Verge Production, and part of the Vox Media podcast network. Nilay, Alex, and I'll be back on Friday to talk about more AI news, Mobile World Congress, and a whole bunch of other stuff. We'll see you then. Rock and roll. (upbeat music)",
    "transcript_keywords": [
        "Apple",
        "Microsoft",
        "Game Pass",
        "Xbox",
        "Repair",
        "games",
        "kind",
        "game",
        "people",
        "Yeah",
        "thing",
        "parts pairing",
        "parts",
        "stuff",
        "Xbox games",
        "sort",
        "things",
        "Game Pass subscribers",
        "Phil Spencer",
        "working Apple thing"
    ],
    "transcript_entity_values": [
        "all the years",
        "the Right to Repair",
        "his week",
        "Repair",
        "hours",
        "New York",
        "Fargo",
        "Nathan Proctor",
        "Android",
        "AHAM",
        "Steven",
        "Steam Deck",
        "Windows",
        "senate",
        "Alex] Hulu",
        "the Microsoft Store",
        "Tom] Virtually",
        "six weeks",
        "Andrew Marino",
        "up to 20%",
        "three",
        "FX",
        "the Public Interest Research Group",
        "iPhones",
        "Consumer Hardware",
        "Blizzard King",
        "Jessa",
        "Kyle Wiens",
        "Indiana Jones",
        "Stacey Higginbotham",
        "30%",
        "David] True",
        "EU",
        "the Vision Pro",
        "Call of Duty",
        "Verge Production",
        "this a year ago",
        "Star Trek",
        "Alex Cranz",
        "Paramount Plus",
        "300",
        "late 2022",
        "Hulu",
        "Activision Blizzard",
        "Overwatch",
        "PlayStation and",
        "2024",
        "the Association of Home Appliance",
        "December",
        "one day",
        "Nintendo",
        "One",
        "Valve",
        "five straight days",
        "an hour",
        "Tom Warren",
        "Stacey",
        "Alex",
        "iFixit",
        "MATLAB",
        "This week",
        "Xbox Live Gold",
        "Microsoft",
        "Vox Media",
        "the Steam Deck",
        "every day",
        "Xbox",
        "David Pierce",
        "a big year",
        "Xbox",
        "six months",
        "Jessa Jones",
        "about 10 months or so",
        "34 million",
        "18",
        "Indiana Jones",
        "Mobile World Congress",
        "afternoon",
        "Oregonians",
        "third",
        "Nathan",
        "OBI",
        "the Apple Store",
        "DIY",
        "Phil",
        "Tom",
        "Right to Repair",
        "Google",
        "a few months ago",
        "Christmas this past year",
        "Panos Panay",
        "a couple weeks ago",
        "David] Awesome",
        "Janeen Sollman",
        "Bill 1596",
        "Senate",
        "AAA",
        "Candy Crush",
        "25 million",
        "our weeks",
        "Discord and Steam",
        "AI news",
        "the Super Bowl",
        "the Genius Bar",
        "Sollman",
        "this year",
        "Xbox",
        "Pal World",
        "Fortnite",
        "weeks",
        "FUD",
        "Netflix",
        "Liam James",
        "first",
        "Friday",
        "House",
        "the next six months",
        "Linux",
        "Windows",
        "a ton",
        "10 years ago",
        "10",
        "about 185 bucks",
        "last year",
        "The Verge's",
        "Minecraft",
        "Surface",
        "PS5",
        "eBay",
        "Nathan] Apple",
        "30",
        "Oregon",
        "The Verge",
        "Windows",
        "the 11th hour",
        "a week",
        "Windows",
        "Disney",
        "516",
        "every single week",
        "California",
        "US",
        "Game Pass",
        "this all year",
        "100%",
        "Colorado",
        "the Oregon Business and Industry",
        "David] Gamers",
        "Last year",
        "Game Pass Core",
        "Western New York",
        "the last decade",
        "Disney Plus",
        "Polaroid OneStep LEGO",
        "18 years",
        "Fargo",
        "The Vergecast",
        "last week",
        "second",
        "these days",
        "Monday",
        "Intel",
        "PlayStation",
        "like 10 years",
        "LEGO",
        "David]",
        "the year",
        "Nintendo Switch",
        "PWA",
        "1",
        "Plex",
        "sec",
        "PlayStations",
        "First",
        "a minute",
        "Kindle",
        "Minnesota",
        "the Senate Energy and Environment Committee",
        "one",
        "Will Poor",
        "fourth",
        "Apple",
        "five years",
        "four",
        "Activision/Blizzard",
        "the next few years",
        "iPhones",
        "Earth",
        "Senate Energy and Environment",
        "1 million",
        "David] Fair",
        "today",
        "Kindles",
        "hours and hours",
        "Steven Nickel",
        "Phil Spencer",
        "Nathan Proctor",
        "Consumer Reports",
        "iOS 17.4",
        "six",
        "the Microsoft Stores",
        "years",
        "months",
        "a year",
        "night",
        "866",
        "day one",
        "at least one",
        "230 million",
        "the last couple of years",
        "the Vision Pro",
        "Pentiment",
        "two",
        "Thursday",
        "Amazon",
        "David",
        "just hours",
        "Kyle",
        "Steam Decks",
        "Game Pass",
        "33.3 million",
        "Sony",
        "Phil Spencer's",
        "iPhone",
        "Max",
        "Taylor Sheridan",
        "John Deere",
        "Fear, Uncertainty",
        "two years ago",
        "Switch"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "TIME",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "DATE",
        "FAC",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "NORP",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "EVENT",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "NORP",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "WORK_OF_ART",
        "PRODUCT",
        "TIME",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "DATE",
        "GPE",
        "GPE",
        "EVENT",
        "DATE",
        "PERCENT",
        "GPE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "LOC",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "GPE",
        "WORK_OF_ART",
        "DATE",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "TIME",
        "PERSON",
        "GPE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "NORP",
        "LOC",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "TIME",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "EVENT",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "TIME",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "TIME",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "ORG"
    ]
}