{
    "id": "yO8a7qzTJz8",
    "title": "When Phones Were Fun: LG Crystal (2009)",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2021-02-27T22:10:07Z",
    "video_url": "https://www.youtube.com/watch?v=yO8a7qzTJz8",
    "category": "Science & Technology",
    "tags": [
        "lg crystal",
        "old phones",
        "vintage phones",
        "when phones were fun",
        "throwback",
        "retro review",
        "lg mobile",
        "clear phone",
        "transparent phone"
    ],
    "views": 470186,
    "likes": 19934,
    "comments_count": 1069,
    "description": "Sponsored by HelloFresh. Use code 10MRMOBILE to get 10 FREE MEALS across your first 4 HelloFresh boxes, including free shipping on your first box at    [WHEN PHONES WERE FUN: LG CRYSTAL GD900]  The last time I brought you back to 2009 to show you a semi-transparent phone, the label on the casing said Sony Ericsson and the clear part was the screen. This time around? The name on the box says LG and its the keypad thats Crystal clear. Im Michael Fisher and it took me many months to chase down a working LG GD900 on eBay; join me as I go hands-on with the twelve-year-old LG Crystal!   [SUBSCRIBE TO MRMOBILE]     [ABOUT WHEN PHONES WERE FUN  LG CRYSTAL GD900]  This is the thirteenth in a series of MrMobile videos exploring the mobile tech world's most vibrant period in design and experimentation. In When Phones Were Fun, Michael Fisher re-reviews cellphones from the golden age of mobile, the decade-long span from the turn of the century to approximately 2009.  When Phones Were Fun: Episode 13 features the LG GD900 / LG Crystal, a sample of which was purchased on eBay by MrMobile / Future plc. LG did not pay a fee or otherwise offer compensation in exchange for this coverage, nor did it preview or approve this content before publication. The lone sponsor of this video is HelloFresh.   [LINKS]  Retro Review: LG Crystal - When Transparent Phones Were the Next 'Big' Thing [OSReviews]:    LG S-Class User Interface wins design award [mspoweruser]:   LG considers leaving the mobile business [Engadget]:   LG GD900 Crystal Review [Cnet]:   How do you work wide with your BlackBerry Passport? [CrackBerry]:   HTC Dream / T-Mobile G1: Throwback Review [Pocketnow]:   The Secret History of iPhone [Vector]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #lgcrystal #lggd900 #lg #mobile #vintage #tech vintagemobilephones #whenphoneswerefun #mrmobile",
    "description_links": [
        "https://bit.ly/3hdIiWQ",
        "https://www.youtube.com/channel/UCSOp...",
        "https://youtu.be/tlhSQ0DSwgc",
        "https://mspoweruser.com/lg-s-class-user-interface-wins-design-award/",
        "https://www.engadget.com/lg-ceo-kwon-bong-seok-mobile-division-exit-losses-094712722.html",
        "https://www.cnet.com/reviews/lg-gd900-crystal-review/",
        "https://crackberry.com/how-do-you-work-wide-your-blackberry-passport",
        "https://www.youtube.com/watch?v=kEATBLaylYg",
        "https://www.youtube.com/watch?v=CNUO_1iMsJ4",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- [Michael] This video is sponsored by Hello Fresh, America's number one meal kit. The last time I brought you back to 2009 to show you a semitransparent phone, the label on the casing said Sony. And the clear part was the screen. This time around, the name on the box says LG. And it's the keypad that's crystal clear. (upbeat music) Alright. Before we get started, a little PSA for those of you who may have caught the vintage mobile phone bug from some of these episodes. That's great. But if you're buying an old gadget, please confirm with the seller that it works first. It sounds obvious I know, but it's so easy to get caught up in the excitement, and pull the trigger on a rare device auction, before doing your due diligence. That's what happened to the device that was supposed to be the star of this video, the AOL Mobile Communicator, whose password its owner forgot some time in the 20 years since he bought it. And in a cruel twist, same thing happened to my first backup choice, the oft-requested Samsung Juke. Eventually I'll get other samples of these, or figure out how to reset my wear on the lockouts. Those videos will be done. But just learn from my mistake. Verify functionality before you shell out. Alright, onto the device of the day. The LG GD900, better known by its code name, LG Crystal, was widely requested in the comments of my Xperia Pureness video. And now that I have one in my hands, I understand why. While the Sony is flashier from a futurist perspective, the LG is much more practical. Keep the phone shut, and it easily blends in among its contemporaries, echoing the lines of the LG Voyager, while recalling the company's chic Prada line, with this brushed metal effect on the function keys. Sadly, the effect is just that. As with almost every phone you could buy in 2009, the majority of this device was plastic, that seemed to already come out of the box all greasy. Yuck. But not other phone gave you a slideout touchpad quite like this. It's glass, and for good reason. It's not just a keyboard, but a capacitive track pad. That means you could control parts of the interface using gestures, or move a mouse pointer on screen without obscuring the screen itself. If that sounds familiar, maybe you were a Blackberry fan. Many of that brand's devices, starting with the Passport, and carrying right on to the Key Two, offered a similar capacitive keyboard. But I never knew, when I first saw that feature in 2014, that LG had beaten Blackberry by some five years. And because it's glass on the crystal, you're not dragging your thumbs over physical keys to do it. It is really identical in feel to using a touchscreen. And honestly, I think that's how LG achieved this. It seems to be just the digitizer component of a touch panel, built into glass with etched numerals and some LED side lighting that never stays on long enough for me to get the shot, but that's beside the point. The Crystal was forward-thinking in other ways too. In an era when front-facing cameras were still rare in the U.S., this phone packed one. Of course, it's VGA quality doesn't hold up to any of the modern marvels from 11 years later. But the point is, it was there. The counterpart to this camera was an eight megapixel primary shooter around back. Pretty high-res for the day, which you could activate with a dedicated shutter button, and don't you dare even think about using the crop-style digital zoom the old-fashioned way. No, no, no. For that, you trace the shape of a circle on the keypad to zoom in or out, slowly and painfully. While trying to make this work, I couldn't help think of some of LGs more recent experiments in user interface design. I guess some things never really change. Powering the phone was a 1,000 milliamp battery. That's about a third the average size of a modern smartphone, which you could remove and replace. But you didn't have to do so to get at the micro SD card slot, which was a somewhat rare convenience. Also, audiophiles, get your pearls ready for clutching. This was one of the many devices of the period to omit a full-sized headphone jack, with LG instead bundling special earbuds that plugged into the micro USB port. Of course, Bluetooth was also available, should you wanna be one of those guys. To my eye, the Crystal holds up quite nicely in 2021. Seems like every time I look at it, I find a new aspect to appreciate, like the tasteful gradient that traverses the battery door. From transparent through smokey gray, to piano black, just before the word transparent appears to tell my brain what my eyes already know. You know, while this series is called When Phones Were Fun, I gotta tell you, there are things I do not miss about this period in proto-smartphone software design. Let me go cook up that list while I share with you some other stuff I've been cooking lately. What if I told you the difference between this and this is less than an hour, with no trip to the grocery store? Today's video is sponsored by Hello Fresh, who sent over a calorie-smart meal kit this month, because with all this winter weather, I haven't been able to get as many steps in as I'd like. On top of that, I haven't been cooking as much, so my kitchen skills have gotten a little rusty. As it turns out though, Hello Fresh is so easy, even I couldn't screw it up. Instead of under cooking the cranberry dijon pork tenderloin, and over cooking the wasabi soy chicken, like I expected, each one came out perfectly. And you know if sound proud of that, I am. I never expected to be able to serve a meal that tastes delicious, cuts calories, and saves time, just by following directions. Well Hello Fresh does all that, with pre-portioned ingredients that give you everything you need, and nothing you don't. Whether you go meat, veggie, pescetarian carb-smart, whatever you wanna do. Plus, it works with your schedule. So you can add a meal, or skip a week, whenever you need. Go to hellofresh.com, and use code 10mrmobile to get 10 free meals, including free shipping. Again, go to hellofresh.com and use code 10mrmobile to get 10 free meals, including free shipping. Thanks to Hello Fresh for sponsoring this video. Okay, so yeah, in the wake of the iPhone in 2007, and the first Android phone of 2008, almost every manufacturer that wasn't using an existing smartphone platform, was trying to push its own custom solution. The LG Crystal was called S Class, and while it actual won an award at the time, I'm forced to agree with Flora Graham, who in a contemporaneous review for CNET, wrote that S Class was low class. This was just the absolute perfect storm of all the overwrought design decisions that were happening at the time. You've got a spinning 3-D cube for a home screen, widgets that are allowed to stack on top of one another, for some reason. Every icon drips with the cloying skeuomorphism that Apple made popular with the first iPhone. But tragically, the responsiveness of that iPhone and Android contemporaries, like the Motorola Droid, is nowhere to be found here. In other words, the Crystal is slow. But of course, it was a product of its time. And buried among all the lag and cutesiness are some delightful totems of the turn of the decade. For example, accelerometers were still a fairly new addition to phones. So LG loaded this thing up with gesture-driven games that taught you how to use it with a virtual ping-pong paddle, or a virtual fishing pole. Manufacturers were also opening up other phone sensors to developers for the first time too, so you had apps like Mellow Candle, with a flame that would react to how hard you blew on the microphone. Sure it's all stuff you can get from the app store today, but at the time, this was as ground-breaking as that light saber app for the Nokia N95, or yeah the beer app for the iPhone. It was all about exposing you to sensors on the phone that you didn't necessarily know about, and usage paradigms that you didn't necessarily consider. And then there's the side benefit of reminding you that LG has always known how to build a powerful speaker phone. (bright piano music) 11 years after this phone hit the market for about 700 U.S. dollars, we're entering the biggest period of uncertainty that LG mobile has ever faced. As such, I'm currently working on a tour of some of the company's phones that I found most interesting over the years. But while I've never owned it myself, this one in particular is special. Despite its software flaws, which LG would effectively solve by sensibly shifting its focus to Android soon after its release, the Crystal is a singular blend of everything I've long appreciated about LG. An eye for beauty, but an appreciation for restraint, and a willingness to try something crazy, if for no other reason that no one's ever done it before. It's a totem from a time when twin touchscreens still felt like the future, and phones were fun. (upbeat music) This episode was produced following an insanely rushed day with the GD900 Crystal, purchased by Mr. Mobile. LG had no say in its production, and provided no compensation for same. Quick shoutout to OS Reviews on YouTube for an in-depth walkthrough of this phone that taught me a few things. If you haven't had enough of this phone, I will link you to that video below. Check out earlier videos in this series at TheMrMoble on YouTube, and please, subscribe, so you don't miss future features on old and new mobile teach alike. Until next time, thanks for watching, and until you get that jab in the arm, remember to stay safe and mask up while you stay mobile, my friends.",
    "transcript_keywords": [
        "America number",
        "phone",
        "crystal",
        "time",
        "Fresh",
        "video",
        "Phones",
        "mobile",
        "America",
        "years",
        "device",
        "AOL Mobile Communicator",
        "mobile phone",
        "vintage mobile phone",
        "mobile phone bug",
        "Android phone",
        "meal",
        "crystal clear",
        "Xperia Pureness video",
        "screen"
    ],
    "transcript_entity_values": [
        "2021",
        "Today",
        "Hello Fresh",
        "the 20 years",
        "eight",
        "Xperia Pureness",
        "1,000 milliamp",
        "Mellow Candle",
        "Voyager",
        "about a third",
        "this month",
        "LGs",
        "2009",
        "Android",
        "winter",
        "Apple",
        "the GD900 Crystal",
        "Android",
        "a week",
        "11 years",
        "the years",
        "2008",
        "YouTube",
        "OS Reviews",
        "USB",
        "10",
        "Samsung Juke",
        "VGA",
        "Crystal",
        "Bluetooth",
        "Crystal",
        "Flora Graham",
        "Mobile",
        "3",
        "today",
        "Prada",
        "iPhone",
        "first",
        "some five years",
        "CNET",
        "Michael",
        "U.S.",
        "2014",
        "the day",
        "Hello Fresh, America's",
        "Yuck",
        "Nokia",
        "about 700 U.S. dollars",
        "Passport",
        "11 years later",
        "LG",
        "Blackberry",
        "LG Crystal",
        "the turn of the decade",
        "Two",
        "SD",
        "Sony",
        "the Motorola Droid",
        "2007",
        "one",
        "AOL Mobile Communicator",
        "YouTube",
        "less than an hour"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "LOC",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "TIME"
    ]
}