{
    "id": "yogE3J1fiVI",
    "title": "Adobe Premiere Pro Speed Test - macOS vs Windows - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2019-04-25T20:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=yogE3J1fiVI",
    "category": "Science & Technology",
    "tags": [
        "Adobe Premiere Pro Speed Test - macOS vs Windows - Krazy Ken's Tech Misadventures",
        "Adobe Premiere Pro",
        "macOS vs Windows",
        "macOS",
        "Windows",
        "Windows 10",
        "MacBook Pro",
        "Adobe",
        "ProRes",
        "Apple",
        "Mac",
        "Macintosh",
        "Vintage Apple Vault",
        "Speed Test",
        "h.264",
        "Render",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Comedy",
        "Humor",
        "Funny",
        "Tech",
        "Computer"
    ],
    "views": 37316,
    "likes": 721,
    "comments_count": 153,
    "description": "Adobe Premiere Pro runs on macOS and Windows. However, rumor has it that it's more \"optimized\" for Windows over macOS. Today, Krazy Ken and Maniac Mike test this urban legend. Which one comes out on top?  Support the show and get in the credits   Want more videos like this?   Subscribe for more tech videos!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures - Adobe Premiere Pro Speed Test - macOS vs Windows  Pledge on PATREON now to get your name in the show credits and gain access to Krazy Ken's exclusive Discord server!*   Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?   Amazon links are powered by the Amazon Associates Program.  COMPUTER CLAN COLLABORATORS INVOLVED IN THIS VIDEO midnightxenesis - as Maniac Mike Ken (Hildron101010)  *not all Patreon tiers qualify for all rewards  COMPUTER CLAN COLLABORATORS INVOLVED IN THIS VIDEO midnightxenesis - as Maniac Mike Ken (Hildron101010)  #KrazyKen",
    "description_links": [
        "http://patreon.com/krazyken",
        "http://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://patreon.com/krazyken",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- [Krazy Ken] I was about to ask if you have a web browser on here, but I just realized we just installed this OS, and there's nothing on here. - [Maniac Mike] Well, we have Edge - [Ken] So no, you don't have a web browser. - [Mike] No. (laughing) - [Ken] One, start. Here we go. (upbeat music) (electronic music) Hey guys, how are you all doing? Really, that's just great, I'm doing pretty great today too, because today, I'm gonna solve one of my personal biggest mysteries and I'm not alone, I'm with Maniac Mike. - [Mike] Hello. - [Ken] Hey. This is actually his MacBook Pro that were stealing here. So, the goal today, is we're going to install Adobe Premiere on Windows, and then Adobe Premiere on macOS. Both on the same hardware, and then we're gonna see which one performs faster, because I've heard stories, and lots of rumors, that Windows works way better with Premiere. Premiere is way more optimized for Windows than in macOS. So, we're gonna see if we can get the same result today, and I have a large C drive here with footage that I shot from the upcoming volume two of Vintage Apple Vaults. The public has not seen any of this footage yet, Actually, you guys right now, are gonna be seeing this stuff before it gets released for the first time. So that'll be our test footage for today. However, that drive is working with boring old USB type-A. Awww. That's not gonna work on this new MacBook Pro. So, Maniac Mike, what do we use to save the day? - [Mike] I have what is called the Uber-dongle of conversion technology, which is the HyperDrive. - [Ken] The HyperDrive, so. - [Mike] It has, it has, if you flip it on over, it uses two Thunderbolt 3's to pass through to two more Thunderbolt 3's, and then you have a micro SD and full sized SD, along with two, which are very important, USB type A's running at, I believe, 3.1 or 3.0 spec. And if you look at the top, you also have an HDMI out. - [Ken] Fan-freaking-tastic. So, I was about to ask if you have a web browser on here, but I just realized we just installed this OS and there's nothing on here so. - [Mike] Do you have a web browser? Well we have Edge. - [Ken] So, no you don't have a web browser. - [Mike] No. (laughing) - [Ken] I'm kidding. Honestly, full disclosure, I like Edge, when I use Windows, I'm totally cool with using Edge. - [Mike] Rumor has it that they're actually, not rumor has it, they are building a version of Edge that uses Chrome. - [Ken] I've heard that too. So, let's go to Adobe.com. Okay, we're gonna go to Premiere Pro CC, download that. In the meantime, do you mind if I plug this in and then swap your power into the thing. - [Mike] Oh no, 'cause it goes on the other side. Because this, - [Ken] Oh dah, 'cause it's, - [Mike] There's four Thunderbolt 3's on here. - [Ken] Yeah. I have to reach all the way over there. Okay, I'll do it, it's okay. I'm really just. Go ahead. You know what? You're here, contribute. Plug that shit in too. - [Mike] So, it just goes in right there, and what a nice spot to sit it, it just blends in with the rest of the case. - [Ken] Bon appetit, there it is. Setting up device, we're setting up USB key, what? Device is ready, it thinks it's a keyboard. We'll plug this in, we're probably gonna get one warning about the HFS volume that's on here, but the ex-fat volume should work just fine. Select the skill level. I don't know, Advanced? I don't know how smart I am. We'll say continue. Okay, so we're installing Premiere Pro there, now, in the File Explorer, what we'll do is we'll take the Premiere test drive, and here is that footage from the upcoming Vintage Apple Vault volume 2. We'll just move this stuff to the desktop for now. And we're gonna build a project inside of Windows, and that same project is gonna be used for the Mac test as well. There's gonna be no other variables, we want a controlled experiment. Premiere is starting up, gents and lades. Lades and gents. I don't know where I was going with that. Let's do the thing. Man, I don't think I've ever used Premiere, like, on Windows before, but it's pretty much the same thing. Let's get the learning panel, oh wait, I just did Command W, shit. No, how do I get rid of this? Okay. I'm gonna have to do Control W to get rid of this. - [Mike] Yes, because Command in Windows is Windows key. - [Ken] Yep, thanks, I figured that out. I kid. Alright, so the thumbnails work, that means the ProRes is being interpreted just fine - [Mike] Awesome. Drag it into the Timeline and let's see what happens. - [Ken] Yep it should just automatically do it. Nice, so, this stuff was shot on a Blackmagic URSA Mini 4K in ProRes, so, so far that's just scrubbing like nobodies freaking business, now since we're not doing a serious project here, I'm just gonna take the soundtrack and remove that, we're just gonna focus on the video here, so this is some A roll, this is a Hap, I interviewed him, he's a prototype Apple collector, he will be featured heavily in the upcoming Vintage Apple Vault volume 2. So we have his interview here and we have some B roll shots of, for example the Apple W.A.L.T prototype, so we can insert some of that stuff, so let's just go, we're just making a little experimental thing, right? So we'll just get like a little slider shot here, we'll do in out, we'll drag that into the Timeline as well. And then we'll just truncate that there. So now we've just made, basically, like a just barely under 2-minute video with some A roll and a couple of B roll shots, and to just add a little more complexity to the project, let's open up Lumetri and just add a little bit of color grading to it, just a little saturation boost, and a little bit of a contrast boost. Just to give it some more stuff it has to compute. So, before, after. Before, after. Alright, so that should be G2G, good to go. And this should all be in 4K as well. Hush. Hush there. Maniac Mike, do you wanna be the stopwatch keeper, or shall I be it. - [Mike] Rock, paper scissors it? - [Ken] Oh, okay, see how it is. You're gonna have to bring your fist like around the monitor for... Alright, rock paper scissors to see who is going to be the stopwatch keeper. Alright. Ready? Rock, paper, scissors. Wait, that doesn't. Wait, let's try that again. Alright, how do you do it? One, two, three, shoot? How do you do it. - [Mike] It's rock, paper, scissors. - [Ken] Alright, rock, paper, scissors, shoot. (beep) Alright, you get to be the stopwatch keeper. - [Mike] Wahoo. - [Ken] Alright, so I'm gonna Command M this, Oh (beep) forgot to minimize. Gosh darn it. Control M. Alright. - [Mike] Everything, all of your timekeeping will be done on a Google Pixel 3. - [Ken] Alright, erm, I just need to type in a few settings quick. This will just be our test export. So what we're gonna do is, we're gonna keep it in 4K resolution, h.264 for the sake of deliverability, and we're just do a direct export, no media encoder. So, I'm gonna click it right when you start, I'll give you a three countdown, ready? Three, two, one, start. Here we go. Alright, so the fans are kicking in, and we're at 2 minutes 44 seconds remaining, - [Mike] Closing in on just about a minute here. - [Ken] Still going, ooh, the fans, aah, listen to that. We just passed the halfway mark, what time are we at there Maniac Mike? - [Mike] We just crossed over 2 minutes 10 seconds to go. - [Ken] Alright, so, maybe in about 90 seconds we'll be done here. Then we'll take the exact same project, exact same everything, copy it to the Mac partition, install the exact same version of Adobe Premiere, and export with the exact same settings, and see how long it takes on macOS. When it goes away. Now. Okay, so 3 minutes 52 seconds to export the about a minute 58 second video in 4K. Right, so if we go to our explorer. Go up a level, here's our test export in h.264. And as you can see, it looks perfectly fine, so now let's save that, move this to the macOS, and see how long the render takes on the exact same hardware, exact same everything, except a different operating system. Ready to go? - [Mike] Yeah. - [Ken] Let's do it. Alright, we are rebooting into macOS now. Finger on the Option key, and Mackintosh. So lets open up the exact same project, this has been copied from the Boot Camp partition back to the Mac partition. Bouncing away. And, Maniac Mike, you will be the timekeeper once again. - [Mike] I mean, I don't even know what that thing is on the splash screen. - [Ken] It's hovering, it's abstract. It's mountains, and - [Mike] Like, I'll be honest, it looks like panties. (laughing) - [Ken] Now I can never un-see that, it's like a floating rock, but yeah I guess it's yeah, great. - [Mike] I'm sorry. - [Ken] No, no, no, it's fine. It is what it is. Oh boy, alright, opening the project, it should be reading the media auto-magically. Once it loads up here. So far this is good, we've got a white screen, oh yeah we're bugging out, the canvas isn't loading. So, in terms of optimizations, yeah, it looks like we've already found one problem, it just does not wanna work on macOS in general. Ah, that's nice. Shit. Okay, so. Bug. We've got a bug there. Let's relaunch. Gosh. Alright, let's try that one more time. 'Cause this is, yep, 2019. Oh, now media encoder finished in the background there. Good, good timing, at least. Maybe that's what caused it to bug out, I have no idea. Alright, that was way quicker. Okay, so in terms of the scrubbing, that looks like it's the same performance, that looks good. Alright, so get your stopwatch ready, we're gonna Command M, throw this into the rendering, make sure it's the exact same settings, we'll put it in the exact same place, actually we can't give it the exact same name, because the other one is in there. We'll call it test goals, no, just kidding, two. Test two, so we got that, it's in 4K and it's in h.264. So, ready, I'll give you a three second countdown. Three, two, one, go. And we are now rendering on the macOS, and we'll see what our time is. It's bouncing around a little bit. It's almost at 10% already. Okay, so we're coming up on 50% complete at, - [Mike] At about. - [Ken] One forty five-ish. - [Mike] Yep. - [Ken] Alright, and we're at the halfway point right now, it's at one forty seven. Notice how the fans aren't spinning like crazy though. Isn't that weird? Like, I'm looking at your CPU usage, it doesn't seem very high. I don't hear the fans, we heard the fans in Windows though. Maybe we should've had, like the Task Manager open to see how much power it's actually using. - [Mike] Yeah. - [Ken] But it looks like it's close to the same render times so far, that's interesting. Okay, so we're coming in at 90%, we're at, three fourteen, oh we had Pi there for a second, 3.14. Alright, get the thing in view and get it ready to stop. 94%. And remember not, don't stop it at a hundred, stop it when the window goes away completely. And now. Okay. So really it was only like a ten second difference. macOS was ten seconds faster, but I don't know, but, that's not too earth shattering. It's about the same. The performance scrubbing was the same, the export time, yeah it was ten seconds faster, but I'm not gonna, you know, lose sleep over that. So, yes, this was just one experiment with one acquisition codec and one export codec, but I mean for me, that's what I mainly use. I acquire in ProRes, and I export in h.264, and from this test, the scrubbing performance and the export performance was exactly the same. So I think we can say, optimizations, in terms of play back and exporting it's the same. I don't really care. - [Mike] Aside from being on the same hardware, really, the ten second difference doesn't really make that much of a difference at all. - [Ken] No, and it could be it fluctuates sometimes. - [Mike] Even then, like, being able to edit, like, it, it's performing very smoothly. - [Ken] Yeah, like, this is, this is two ProRes 4K clips on top of each another. It scrubs like butter, it's fine. Cool, well I'm calling that, like its a tie between the two, like, it's fine, the experiment works, nothing's better than anything else really in this case, so, thanks guys for watching. And again, Vintage Apple Vault volume 2 is coming really soon. Catch the crazy, pass it on. Thanks Maniac Mike. - [Mike] Yep. - [Ken] Yay, wahoo. (electronic music)",
    "transcript_keywords": [
        "Alright",
        "Vintage Apple Vault",
        "Maniac Mike",
        "Premiere",
        "Apple Vault volume",
        "Windows",
        "Vintage Apple",
        "Adobe Premiere",
        "Apple Vault",
        "exact",
        "Premiere Pro",
        "Mike",
        "Apple",
        "export",
        "Yeah",
        "Maniac",
        "upcoming Vintage Apple",
        "Edge",
        "test",
        "macOS"
    ],
    "transcript_entity_values": [
        "about 90 seconds",
        "Mike] Rock",
        "3.14",
        "ten seconds",
        "SD",
        "two",
        "Ken] Yep",
        "G2G",
        "3",
        "three second countdown",
        "Adobe Premiere",
        "2",
        "Command W",
        "forty",
        "3.1",
        "2 minutes 44 seconds",
        "Vintage Apple Vault",
        "Blackmagic URSA Mini 4K",
        "four",
        "one",
        "Windows",
        "Adobe.com",
        "MacBook Pro",
        "Chrome",
        "Hush",
        "50%",
        "Lumetri",
        "Task",
        "Three",
        "Mike] Wahoo",
        "Edge",
        "Apple",
        "Maniac Mike]",
        "Mackintosh",
        "a hundred",
        "2-minute",
        "Boot Camp",
        "Hap",
        "Mac",
        "first",
        "Mike] Hello",
        "4",
        "94%",
        "Ken] Yay",
        "90%",
        "Timeline",
        "three",
        "USB",
        "Vintage Apple Vault",
        "Edge",
        "58 second",
        "ProRes",
        "gonna Command M",
        "today",
        "Krazy Ken",
        "Control M.",
        "CPU",
        "Vintage Apple Vaults",
        "Windows",
        "Control W",
        "Mike] Awesome",
        "un",
        "3.0",
        "Premiere Pro",
        "2019",
        "Mike] Closing",
        "Ken] Bon",
        "Ken]",
        "Maniac Mike",
        "10%",
        "Edge",
        "Premiere Pro CC",
        "3 minutes 52 seconds",
        "ten",
        "Mac",
        "one forty seven",
        "Ken] Alright",
        "Premiere",
        "SD",
        "the File Explorer",
        "over 2 minutes 10 seconds",
        "MacBook Pro",
        "One",
        "second",
        "HyperDrive",
        "the day"
    ],
    "transcript_entity_types": [
        "TIME",
        "PERSON",
        "CARDINAL",
        "TIME",
        "GPE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "FAC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERCENT",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE"
    ]
}