{
    "id": "yOxxqrDLWFo",
    "title": "Features You Pay For But Can't Use",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2021-05-14T17:00:39Z",
    "video_url": "https://www.youtube.com/watch?v=yOxxqrDLWFo",
    "category": "Science & Technology",
    "tags": [
        "Cars",
        "Purchase",
        "Feature lock",
        "pay wall",
        "extra",
        "money",
        "printers",
        "ink",
        "software",
        "processors",
        "unlock",
        "payment",
        "subscription",
        "fee"
    ],
    "views": 707006,
    "likes": 42401,
    "comments_count": 1529,
    "description": "Check out the DROP ENTR Mechanical Keyboard at   You bought that fancy new product thinking you can use everything since you own it, but wait, there are additional features locked behind a paywall? What's going on?!?!?!  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  TechLinked:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://dro.ps/tq-may21-entr",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Man, buying products used to be so simple. You pay money for a hammer, and then you can use it however you want, provided we're not talking about settling a score with your neighbor. But did you know that many electronics have hidden features that, for one reason or another, you can't even use? There are actual functional parts on your devices that you, the paying customer, are totally blocked from accessing. What's up with that? All right, let's start with something you might be using right now, your CPU. You see, if you've ever looked at a review of a newly released CPU, or GPU, for that matter, you might've noticed that certain cores or execution units are there in the die shot, but are disabled. So you might think it logically follows that there's some way to enable them again, and suddenly you have an i7 instead of an i5. In fact, in the past, enthusiasts have done just that, with a famous example being AMD's Tri-Core Phenom CPU's, which could be unlocked to Quad-Cores, sometimes. As it turns out, disabling in this context, usually isn't just a switch you can flip in software. You see, when CPU's and GPU's roll off the assembly line, some cores or execution units don't function at peak performance, or they have enough impurities that they might not even work at all. And other cores might work perfectly fine, but aren't good enough to hit the advertised power consumption target. Now, it would be a shame to throw out the entire chip, just because a small part of it was messed up. So instead, these cores, or execution units, are factory disabled, sometimes even at a hardware level, and sold as lower-tier products at a lower price. In cases like this, there's no way for an end user to get in there and enable these extra components. And even if you could, you might run into serious stability problems and maybe even a crisis of conscience. Moving on. For another example, the reason printers are cheap and ink is expensive is because printer companies make most of their profit on ink cartridges, which they can sell over, and over, and over again, as opposed to the printer, which they can only sell once. Lure an unsuspecting grandma in with a cheap printer, and you've got a sale every time her grandkids come over and print 60 copies of their beautiful artwork. Unfortunately, it's kind of an open secret that the printer companies often take this too far by serving users low-ink warnings, even when there's a significant amount of ink left in the cartridge. And while it's true, ink cartridges that still have a very small amount of ink in them are too dry to be usable, many users have reported getting lots of extra life out of their cartridges, even after these warnings pop up. And in some cases, cartridges may refuse to print at all, once they get below a certain level. But there's an ink in there! Unsurprisingly, there's been backlash against these practices. So printer companies have actually thrown customers a small bone in offering models with refillable ink tanks instead of sealed cartridges that can lock them out. For our last example, we'll use a more everyday item. A couple of car makers have played with the idea of enabling certain pre-installed features for a fee after you buy the car. For example, Tesla installs batteries in lower-range cars whose full capacity can be unlocked, microtransaction-style. And BMW has plans to sell features like heated seats as a subscription for a certain length of time. So you could pay just to have them enabled during the winter and turn them off during the summer. That's horrible. That's a bad, (laughs) that's so dumb. It might seem expensive for the companies to make cars with features consumers might never use, but the justification is that it simplifies the manufacturing process to build mostly identical hardware and allow people who don't want the features to save a few dollars at the till. Another argument for this practice is that it could make reselling cars easier, as a new buyer could just enable features that the previous owner may not have wanted. Of course, the other side of the coin would be to say that this is just a way for the automakers to squeeze more money out of you by getting you to pay again for materials that were clearly covered well enough by the price you paid. And the truth is, unfortunately, probably somewhere in the middle. Of course, you could just refuse to play this whole game entirely and go back to the good old days of taming wild beasts and using them as your steed. Speaking of taming wild beasts, here's a wild one, our sponsor, the Drop ENTR keyboard. It's a new keyboard from drop.com, made with enthusiast-grade materials, including an aluminum top plate and plastic bottom plate. It's got white LEDs for visibility in dark conditions and PBT key caps using a doubleshot shine-through design. Weighing in at 964 grams and available in three colors with your choice of mechanical switches. It's the Drop ENTR keyboard, buy it today at drop.com. Ha ha! Whoa, that was a video for sure. I thought it was pretty good. If you agree, give it a like. If you don't agree, give it a dislike. But you know what you should do, regardless? Give us some suggestions for future videos down in the comments. Check out our other videos/channels, whatever you want. And don't forget to subscribe to this channel and follow Techquickie, 'cause we're gonna make more.",
    "transcript_keywords": [
        "ink",
        "CPU",
        "features",
        "printer companies",
        "printer",
        "Drop ENTR keyboard",
        "cartridges",
        "execution units",
        "ink cartridges",
        "Drop ENTR",
        "buying products",
        "cores",
        "Phenom CPU",
        "TriCore Phenom CPU",
        "companies",
        "make",
        "ENTR keyboard",
        "execution",
        "units",
        "cars"
    ],
    "transcript_entity_values": [
        "GPU",
        "the summer",
        "BMW",
        "Techquickie",
        "Tri-Core",
        "AMD",
        "CPU",
        "three",
        "Quad-Cores",
        "964 grams",
        "the Drop ENTR",
        "60",
        "one",
        "a few dollars",
        "today",
        "Tesla"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG"
    ]
}