{
    "id": "YOZi-7V11k8",
    "title": "When Phones Were Fun – And Nokia Was Crazy",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-06-13T15:00:12Z",
    "video_url": "https://www.youtube.com/watch?v=YOZi-7V11k8",
    "category": "Science & Technology",
    "tags": [
        "old tech review",
        "old phones",
        "old nokias",
        "2000s tech"
    ],
    "views": 3602982,
    "likes": 78444,
    "comments_count": 8547,
    "description": "You remember Nokia for the legendary 3310 that no one could break, or for the Nokia N95 that had all the features (before having-all-the-features was a thing). But you might not remember that, for a few years in the mid-oughts, while The Killers were killing the Billboards and Google was first going public  Nokia was going a little bit crazy.   Yep, it's time for another episode of When Phones Were Fun  and this time MrMobile's rose-tinted glasses are focused on some of the strangest mobile devices ever to hit store shelves. From the vase-like Nokia 3650 to the leaf/eyeball/alien artifact Nokia 7600, some of the craziest cellphones of the noughties came straight out of Espoo ... and thanks to a generous loan from friend of the channel (and Nokia collector) Martin, those phones spend this entire video under the lenses of Michael Fisher's stay-at-home studio.  Join me for \"When Phones Were Fun\" Episode 4: a throwback retro tribute to a time when Nokia's weird phones helped set the tone for a new generation of smartphones!   [SUBSCRIBE TO MRMOBILE]     [ABOUT WHEN PHONES WERE FUN AND NOKIA WAS CRAZY]  This is the fourth in a series of MrMobile episodes exploring the mobile tech world's most vibrant period in design and experimentation. In When Phones Were Fun, Michael Fisher re-reviews cellphones from the golden age of mobile, the decade-long span from the turn of the century to approximately 2009.  When Phones Were Fun: Episode 4 features the Nokia 3650, Nokia 3660, Nokia 7600, Nokia 6820, Nokia 6600, Nokia 7710, and Nokia 7650, all on loan from friend of the channel Martin's private collection. No company paid a fee or otherwise offered compensation in exchange for this coverage, nor did any company preview or approve this content before publication.   [LINKS]  Nokia 7600 Review [S21 Archived Link]:   Nokia 7700 [Mobile Gazette]:   Retro: Nokia 7710 [Mobile Gazette]:   Series 60 and Series 90 Merged [All About Symbian]:   IrDA [PhoneScoop]:     [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #nokia #retro #retrotech #2000s #throwback #whenphoneswerefun #nokia3650 #nokia3660 #nokia7600 #nokia6820 #nokia 6600 #nokia7710 #nokia7650",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "https://web.archive.org/web/20140911165509/http://www.s21.com/nokia-7600.htm",
        "https://www.mobilegazette.com/nokia-7700.htm",
        "https://www.youtube.com/watch?v=IoQXPSYcYg8",
        "http://www.allaboutsymbian.com/news/item/Series_60_and_90_merged.php",
        "https://www.phonescoop.com/glossary/term.php?gid=409",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "(phone ringing) - There it is. You remember them for the phone no one could break, or for the phone that had all the features before having all the features was a thing but you might not remember that for a few years there, while the killers were killing the billboards, Google was first going public, and so was Janet Jackson, Finnish phone maker Nokia was going a little bit crazy. Like, just, I mean, what? You can't use this as a phone. Oh, man, all right, let's do this. I'm Mr. Mobile and this is When Phones Were Fun. (upbeat music) Hey folks, I hope you don't mind me dressing down a little for this one but this is the only shirt I could find from the Maddox that I still owned and that I still fit in to. True fact: this pocket right here is where I used to store my Discman. So it's big enough for even the largest of these weirdos. My European friends are always surprised to hear this but between 2002 to 2006 or so, when Nokia was just pouring itself whatever was in the party punch bowl, here in the USA, phones were a lot more conventional. Smartphones existed but they were mostly BlackBerrys or Sidekicks and they were a tiny sliver of the market. The most common phones you'd usually see on the streets were small silver clamshells. As a result, I didn't own one of these bizarre-trons so please join me in thanking friend of the channel Martin for this whole box of beautifully preserved specimens for your viewing pleasure. Most of them are European models with branding and user manuals in various languages I can't read, but even the box art speaks to the totally different era these products came from. Before I even opened these I knew I was gonna have a good time. Now before I get to the true weirdos, here's a phone I'm gonna skip for today. Not because I don't want to cover the Nokia 6820 but because I'm planning another episode of this series for devices like it. See this was part of a subclass that came to be known as messaging phones. You could use them as a typical handset but they also featured a full QWERTY keyboard, usually hidden behind a slider. Well, Nokia's 6800 family took a really clever approach to that problem and I'll talk more about it when we get to that episode. Let's kick things off properly with the Nokia 3560. Sorry, 3650. Man, one thing I do not miss is Nokia's numeric stew of confusion. Almost as confusing? This keypad. Modeled after an old-fashioned rotary phone, the numbers encircle the perimeter of the pad instead of filling it up with the usual grid and it plays horrible mind games with your muscle memory. Well it's not the worst keypad in this video, stay tuned to the end for that. It was apparently divisive enough that Nokia replaced it with a conventional keyboard being a sequel called the 3660. That means the 3650 was successful enough to warrant that sequel and it's easy for me to imagine why. I remember I was working at a mall around this time and I was walking back from a lunch hour and I passed the T-Mobile kiosk where the guy working there was using this phone to watch an episode of \"Star Trek: The Next Generation.\" Needless to say, I was intrigued. Remember, at the time most phones in the States were just getting polyphonic ringtones. So a device that could play full TV episodes was something. The 3650 was the first phone with an integrated camera to be sold in North America. 0.3 megapixels, hold onto your butts, and it was the first phone sold in the U.S. with Nokia's Symbian S60 platform. So it was a true smartphone, in the sense that you could load up a compressed LimeWire rip of a TNG episode onto an SD card and play it back in glorious 12-bit color through a relic like RealPlayer. Now this is a 17-year-old phone at this point, so, of course, it's cumbersome and clunky to navigate but I'm actually surprised by how responsive it is. And ergonomically speaking, wow! It's crazy comfortable. While, like all the phones in this video, it's cheap and plasticky, there's not a hard edge on it. \"Feels good in the hand,\" as they say. If I'd been on a GSM carrier back in the day, I think I'd have considered the 3660. It's quite attractive. And speaking of attractive, let's have a gander at the next. (gasps) Whoo! Sorry about that, but this is heinous. Remember how I kept calling the Sidekick a meatball in the last episode? Well this, this is a legitimate potato. I'm gonna call it the Nokia Spud. I'm just kidding, save your hate-mail. The Nokia 6600, which is what this is actually called, was marketed as a business phone when it launched in 2003 and dudes, it sold. Nokia put more than a 150 million of these into suit pockets across Europe and the Middle East, which means it outsold the first Motorola RAZR. Demand was so high, in fact, that it remained in production until 2007. Why the success? Well the product placement in the movie \"Cellular\" probably didn't hurt but really, it was the business features like corporate email support, a mobile VPN client, and even virtual wallet application for online purchases. It also packed the table stakes like VGA camera, Bluetooth, and the common for the time, IR port, which you could use to transfer data between phones wirelessly and slowly. All this ran once again on the series 60 platform which was first announced back in 2001 in this peculiar package. God, November 2001 phones in Europe looked like this, meanwhile I'm living in Virginia, limping to the barn with a Sprint phone that looks like this. I should have studied abroad. Not that the 7710 is a looker but it's one of those products that's so ugly, it's well, if not pretty, then at least interesting. That's probably what led to its marketing tie-in with the dystopian future thriller \"Minority Report\" but it was its litany of features that cemented it in phone history. It was the first Nokia with a camera and MMS messaging to send it with. One of the first with Bluetooth and it married those with an internal antenna and the always fun slide-out keyboard. Bummer that it's not an assisted slide, no springs to be found here but at least you can still slap it shut. Other signs of the times ranged from the convenient, a user-replaceable battery, to the less convenient, a 2.5-millimeter headphone jack, to the delightfully odd, a dedicated voice memo button. This actually shows up in a few of these Nokias and it reminds me of how many drunken voice memos I used to leave myself on my Samsung A600 in college. For that story, be sure you're subscribed for the next episode. All right, now that you've seen the beginning of Nokia's smartphone legacy, you gotta check out its fat metal. The 7710 looks less like a phone than one of those dashboard GPSs that would become popular in the years following its 2004 release. This was a replacement for the Nokia 7700 which was canceled presumably because it looked like a rejected prototype for a bicycle helmet Napoleon Dynamite might have worn as a kid. It also required the user to side talk, like the infamous Taco Phone, aka the Nokia N-Gage, which I covered in a video a few years back. The 7710 was a full touchscreen phone with an integrated stylus and a few physical controls that actually make sense. The display was roomy for the time with the same 3.5 inch diagonal that the first iPhone would launch with three years later. And it came with some fun tripod-like accessory to stand it up with and also a frankly, horrible-looking leather case. Sadly, the phone lacked not only 3G which was even becoming common on Nokias of the time but it also omitted WiFi. So you had this big for the time display but you were stuck loading websites at less than dial-up speeds. The new series 90 platform was apparently, also undercooked at launch, and all this combined with a strange form factor, high price, and increased competition from platforms like Windows Mobile to basically kill the 7710. The phone was discontinued, series 90 was canceled, and I was allowed to move on to our final, much more fun phone. This is without question, the most ridiculous phone I've ever held. Is it a leaf? An eyeball? An ancient Egyptian artifact? Sure, whatever you want. All rules are out the window with the Nokia 7600, announced in the fall of 2003. About the only conventional things on it were the Symbian S40 platform, changeable express-on covers, like those we saw on the 3650. 3560? No, 3650. And a design ethos that seemed to say, \"Eff it, man, let's get weird.\" Threading the leather wrist strap through the corner pocket, I got to thinking maybe I could carry this as a weekend dumb phone if I could get it work and just to discourage my constant impulse to text, because yeah, you don't wanna text on these keys. They're horrible. You don't wanna use this D-pad, it's horrible, too. And you absolutely don't wanna talk on it, which you have to do by tilting it diagonally and wincing through the pain of hard plastic on all the wrong parts of your ear. Hey, at least it had polyphonic ringtones. (phone ringing) Really, the 7600 is at its best just sitting there and attracting ogles from passers-by, which is why Nokia marketed it to the fashion segment, exclusively overseas. Even then though, to read the user reviews at S21.com, well, it ranges from embarrassing to celebrity worthy, to just a total piece of junk. My favorite is this user in 2008 who boasted, \"I go for style uniqueness, \"that's why I dominate conversations and gossips.\" Hey man, you keep doing you. Respect. As I slipped the 7600 back into its dope travel sack, I will say this is not the last we'll hear from Nokia in this series. The company has many more examples of crazy design from this period. Why? Well, it was the dawn of the smartphone era. New designs were needed for new interface paradigms and new more powerful internals. That meant new casings were needed as well and companies like Nokia decided to push into every possible corner of far-flung theory and thought. We're seeing something similar happening in foldables today, and that's one of the reasons I'm so excited for them. But I don't think we'll ever quite recapture the off-the-wall brazenness and exotic experimentation of Nokia in the noughties, back in the days when phones were fun. This video was not paid for, previewed, or copy-approved by Nokia or any other OEM. It was produced entirely thanks to the borrowed private collection from friend of the channel Martin. Thanks, one more time to him for sending me these gems and for sharing his own experiences with them. Now as I say, Nokia wasn't big in the States at this time so I'd love to hear from those of you who did on these things. Leave your comments below. Next up on the program: I finally get to go back to my first camera phone and Samsung's first camera phone for the States as well. Check out the rest of the series playlist on my channel page. And if you liked this video, subscribe while you're there. Until next time, thanks for watching. Stay safe at home if you can, but in spirit, stay mobile my friends.",
    "transcript_keywords": [
        "Nokia",
        "phone",
        "phone maker Nokia",
        "Phones",
        "Finnish phone maker",
        "time",
        "Finnish phone",
        "Janet Jackson",
        "back",
        "camera phone",
        "episode",
        "Nokia Symbian",
        "Nokias",
        "series",
        "Nokia Spud",
        "maker Nokia",
        "Nokia smartphone",
        "Fun",
        "remember",
        "fun phone"
    ],
    "transcript_entity_values": [
        "Europe",
        "between 2002 to 2006",
        "0.3 megapixels",
        "the fall of 2003",
        "17-year-old",
        "7710",
        "Sidekick",
        "Bluetooth",
        "iPhone",
        "Napoleon Dynamite",
        "3.5 inch",
        "Taco Phone",
        "North America",
        "U.S.",
        "Nokia",
        "Janet Jackson",
        "more than a 150 million",
        "the Middle East",
        "7600",
        "RealPlayer",
        "one",
        "12",
        "2001",
        "Samsung",
        "GSM",
        "Finnish",
        "Maddox",
        "90",
        "S40",
        "3560",
        "VGA",
        "Motorola",
        "TNG",
        "Google",
        "the day",
        "a few years",
        "a few years back",
        "VPN",
        "a lunch hour",
        "Sprint",
        "6800",
        "IR",
        "S60",
        "Martin",
        "Nokias",
        "three years later",
        "QWERTY",
        "European",
        "2008",
        "November 2001",
        "the days",
        "2004",
        "only 3",
        "MMS",
        "S21.com",
        "3650",
        "Star Trek: The Next Generation",
        "SD",
        "2.5-millimeter",
        "2007",
        "Minority Report",
        "3650",
        "7710",
        "Symbian",
        "States",
        "The Nokia 6600",
        "2003",
        "the years",
        "60",
        "Mobile",
        "Nokias",
        "today",
        "first",
        "One",
        "jack",
        "Virginia",
        "Windows Mobile",
        "Egyptian",
        "Sidekicks",
        "Samsung A600",
        "Nokia N-Gage",
        "USA"
    ],
    "transcript_entity_types": [
        "LOC",
        "DATE",
        "QUANTITY",
        "DATE",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "LOC",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "NORP",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "NORP",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "NORP",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "GPE",
        "ORG",
        "NORP",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "GPE"
    ]
}