{
    "id": "yp41RwEWR-Q",
    "title": "The iPhone 7 Plus Plus",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2017-02-09T17:49:20Z",
    "video_url": "https://www.youtube.com/watch?v=yp41RwEWR-Q",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "kamerar",
        "iphone 7",
        "iphone 7 plus",
        "7 plus",
        "iphone",
        "camera",
        "iphone 7 camera",
        "kamerar iphone 7",
        "iphone 7 plus camera",
        "camera case",
        "camera adapter",
        "macro",
        "fisheye",
        "wide angle",
        "zoom",
        "iphone 7 zoom",
        "iphone 7 zoom lens",
        "lens",
        "lens kit",
        "apple",
        "apple iphone 7",
        "test",
        "iphone 7 review",
        "iphone 7 plus review",
        "iphone 7 unboxing",
        "iphone 7 plus unboxing",
        "2017",
        "new inventions",
        "smartphone"
    ],
    "views": 2163603,
    "likes": 44736,
    "comments_count": 1536,
    "description": "Kamerar Lens iPhone 7 Plus (USA Link) -  Kamerar Lens iPhone 7 Plus (International) -   Heres a cool one. The Kamerar Lens Kit for iPhone 7 Plus gives you more creative control over your smartphone photography.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/2kXrPLz",
        "http://geni.us/D3sV4",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Alright guys know in the past I have looked at this various devices that that change the Dynamics of the camera that exists on your phone. Now usually a lot of these they come out for the iPhone But I haven't hit points seen any for the new iphone 7 7 plus because of course it has this Unusual dual camera setup, so a lot of those older accessories aren't really going to work Then I spot this one on Amazon from a company called hammer are And they say it's the world's first dual optic lens solution For iPhone 7 plus now if you're unfamiliar with these type of cases the whole reason they exist is to Give you the ability to zoom in to get a macro effect using your phone's camera you can see an example of that there and then to allow you also to use just a standard zoom like a telephoto and then a fisheye effect if you want a Super-Crazy wide-angle [kind] [of] like the one I'm used to speaking to you guys through right here that you Let me look at that. The fisheye effect on this device is probably going to be even wider And how about the design on there? What is that? It's like a little pixelated kind of thing going on huge logo, not a big fan that but otherwise I mean, this, this right here looks pretty cool [now] It's rubber on the outside, and then it's a hard plastic on the back there are protection for the volume button It looks like now the lenses are in here I guess so the macro zoom lens, and the [fisheye] and telephoto lens so pop this open Look at that. You can see right there. This is a fisheye and that's the telephoto I assume and then this guy get in like that When you're using light it up boom snap a photo now here's Macro And soon this one's a little bit more flat so I don't know maybe you can keep that one on I think we should give it a shot I want to start with the fisheye and telephoto And we'll see what a wide-angle view of this shooting space looks like you guys did not actually seen the back into the shooting space Right now Kinda while it's made him let's be honest here, whoa? Major [Fisheye] happening on here Jack say hi to the camera Boom and then I'm going to do a telephoto lens. I just have this over there macro lens take this photo And then I'll show you with the wide angle just how different those two frames are [wow] [we've] actually [got] you can kind of see the edge of the lens around the outside So if you were using this for video you would fill the crop in a bit in Post now if I go ahead and zoom in boom fisheye [zoom] so it kind of like it kind of accentuate The features of the dual lens system on its own because of course with this case off by [slightly] down You still have your zoom which moves to the other other lens, but it's less substantial less of an impact now where things get possibly even more interesting is with this macro stuff to get crazy close focus And that's something that your camera can do it all nevermind accentuating so if I pull out this other device here, whoa? Wow, that's pretty wild now if I switch over to the other lens. Oh my goodness. Is it goes in even all? Wow, that is tiny font what about my watch here? Let's see Wow ok so I want to get [Wallace] over you I got blades of steel upcoming video related to blades of steel the classic now Just checkin up on the on the very bottom here you have really fine print now lets see if I come with this, It not only picks up that but every little pixel underneath it [what] [about] [the] [size] that I don't know the tip of crayola marker. Maybe I should get a coin or something going? To try and [finish] [out] of that rule Look at the table. There's a table even look like that to you from your cam. I mean, holy smokes That's wild That's probably one of the nicest Macro adapter [I] tried on and [I] don't know if it has to do just with the adapter or the fact that [I] haven't used an adapter With the iPhone 7 camera at seven plus to be exact let's say you carry this one around on the case You've got four different cameras right now a macro macro Zoom and of course your standard wide and your standard zoom and these are small enough to carry around [2I] think this thing is a win right here now [I] don't know if [this] [is] the only one is out with the seven plus. [I] [don't] know how much it is I'll link it down in the description I can't remember but if you are smart phone photographer and your goal is to Maybe have a little more creativity while using your 7 plus. This is definitely a way to do that camera are Don't forget the name",
    "transcript_keywords": [
        "change the Dynamics",
        "macro macro Zoom",
        "macro zoom lens",
        "macro",
        "lens",
        "Unusual dual camera",
        "macro zoom",
        "zoom",
        "camera",
        "Alright guys",
        "fisheye effect",
        "telephoto lens",
        "kind",
        "fisheye",
        "Dynamics",
        "macro macro",
        "telephoto",
        "guys",
        "standard zoom",
        "macro lens"
    ],
    "transcript_entity_values": [
        "two",
        "Amazon",
        "Post",
        "iPhone 7",
        "first",
        "Fisheye",
        "four",
        "7",
        "2I",
        "iPhone",
        "seven",
        "Wallace",
        "Jack",
        "the Dynamics of the",
        "Macro",
        "crayola"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG"
    ]
}