{
    "id": "yPC6xs-xCRs",
    "title": "Windows 12 Is HERE",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-09-17T15:04:20Z",
    "video_url": "https://www.youtube.com/watch?v=yPC6xs-xCRs",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 380816,
    "likes": 12757,
    "comments_count": 1451,
    "description": "Microsoft said Windows 11 is old news WEIRDEST Products at Best Buy:  Why Apple Is ONLY for Rich People:  iPhone 14 - Before You Buy:  Controllers BETTER Than the DualSense Edge:  Amazon is DONE:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Austin Opinion Rapidfire 0:23 Windows 12 ALREADY?! 1:10 Windows 11 Is Actually Healthy 2:11 Why Windows 10 Worked 3:33 Most People Dont Care.. 4:24 Why Not Just Update 10? 5:05 What New Features Will it Have? 6:04 Some Updates Suck.. 7:20 It Should Just Be Windows.. 8:16 Windows 11 Was Released The Same Way.. 9:25 The Architecture Changes.. 10:30 Other Companies Do This Too.. 11:05 What Do You Think?",
    "description_links": [
        "https://youtu.be/akZnxzYGNqU",
        "https://youtu.be/SeJA6bSgmHU",
        "https://youtu.be/WWamFwPysPo",
        "https://youtu.be/4qO8b8LjTRE",
        "https://youtu.be/gH2QUDukjzI",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- 11? Garbage. 10? Get outta here. Vista? Sure. Eight? Never happened. 2000? Uh-uh. ME? Absolutely not. - Hello and welcome to this is Windows 11 Is Dead. Long live Windows 11. Windows 12 is right around the corner and I'm gonna say it's here because Microsoft has been doing some wibbly wobbly things that makes it why would anyone go to 11 at this point? - The rumor currently is that Windows 12 is in active development and is on schedule to come out three years after Windows 11. Which because it came out in 2021 means that 2024 would be the targeted date. - Yep. - For the brand new up to date, version of Windows named, - But! - 12 - Even worse - to making me what? It's impossible, how could it be worse? - Windows 10 is gonna lose all support by 2025. - Are you trying to tell me that Microsoft would be so nefarious to create Windows 11 and then make Windows 12 come out by the time that you can't use Windows 10 anymore with updates, therefore forgetting that Windows 11 ever existed, they would be so nefarious? - I feel like a lot of people are just gonna skip Windows 11 entirely. - Like they skipped 8? - Yeah well, 8 was really bad. I just feel like because the adoption rate for 11 has been growing. - Can I hit you with some numbers? As of June 2022, Windows 11 adoption rate is at 23.1%, - [Matt] Which I'll be honest that's about - [Austin] Very high. So for context, 23.1 is Windows 11 Windows 8 had 13%, Vista had 14%. So it's actually in the ballpark of what I would consider to be a healthier version of Windows. - But like how much of that is again, people buying? - It's gotta be new systems. - New systems versus how many people are upgrading? - Yeah. - Because I feel like that upgrade number's gotta be really low. - I agree. - We're in a period of time where people are buying computers at like an exponential rate as they were. - It's starting to slow down now. - It is. - 2020-2021 were some of the most popular years to the PC ever. In 2022, much to the chagrin of all the people who made PCs is looking a little light. - Well, when everyone in the world has a one year old PC then it's harder to sell PCs. - Windows 10 was a very different version of Windows, right? I think generally speaking, most people like it obviously in our tier list episode, a lot of people are like Windows 10 is S tier which I don't think we quite agreed with, but Windows 10 was solid. And one of the reasons why it was good was because they stopped doing that sort of normal three year cycle of a new version of Windows. And instead they wanted to make Windows 10 kind of quote unquote, the last version of Windows. - Microsoft said they wanted Windows 10 to be the last Windows. It wasn't. - If Windows 12 does indeed come out in 2024, there's one year between that, and when Windows 10 loses support. So you gotta imagine that there haven't really been any new features for Windows 10. There's probably like some new Nvidia and AMD graphics cards that have shiny new ray tracing features or whatever that only work on Windows 11 or Windows 12, or whatnot. Windows 10's gonna start really showing its age then. And if people who have been kinda on the fence have a brand new Windows 12 to update to, which hopefully is not garbage town and terrible. You can see where that would be a really compelling sort of upgrade. - Yeah and I'm on the fence with a lot of this because on the one side I'm like, okay, let's face it. The people who are gonna be upgrading to Windows 10 at the last minute, I would say the vast majority are gonna be the people who have no idea what that there's even a different type of Windows. They don't know that Windows 10 and Windows 11 are two different things. - Yeah, though, there's no one left on earth who doesn't know the difference between Windows 10 and 11 because they've seen the nonstop pop-ups on their system for the last two years about, - I think you were vastly overestimating. - You need Windows 11, press me. Literally it'll happen in the background. Windows 11! Windows 11! - I think the majority of people who would be waiting till the last minute - Okay. - is going to be people who just don't know don't care. If, oh, the shiny ray tracing is only available for Windows 11. - The gamers. - The gamers, which most of our viewers, I would put themselves into a category of gamer. - You're gonna insinuate that this is audience is not a bold diverse, eclectic mix of highly talented - I think - Incredibly attractive individuals who have all caressed that subscribe button and gently rang-a-lang the dang-a-lang button - Rang-a-lang? I'm letting the gamers rise up and you're trying to get the gamers to compromise right now. - I'm just not calling them gamers. - And gamers don't compromise. - I'm not calling them gamers. I'm calling them human beings because you're all beautiful human beings. The thing is they're continuing to develop Windows 11 right? - Yeah. - There's continuing to bring out new features and stuff. But at a certain point, they're gonna have to start carving those things out for Windows 12. And when you think about like why Microsoft needs to bring out a full new version of Windows, it's for major structural change, right? - Yep. - Not just like, oh, they updated Edge or whatever, but like for core functions of the operating system brand new features for huge security, overhauls and whatnot. Again, I think I speak for the audience in a lot of ways that Windows 11, while it is a reasonable success doesn't have the best reputation largely because so many people have computers which cannot properly run Windows 11. And I think that's upset a lot of people and kind of turn them off in the same way that Windows 8 did because it was not good. - There's a game I wanna play with you. - Okay. - In your imagination, - Okay, I'm imagining - We don't even don't need notes. I want you to imagine. - [Austin] Okay. - Give me five features that are brand new. - Okay. - That have never been before seen. - Automatic hunger detection that automatically loads up Dominoes. Um Vista (laughing) - In your wildest imagination. - Yeah I want them to make Vista good - The new feature for Windows 12, - Arrow, Arrow I meant Windows Arrow. - is just Windows Vista? The point of this exercise is more we have so many features. And computers are so good. I think we are all on board with Windows 10 being the last version of Windows. You say like all these big changes are for security purposes. - How about they make File Explorer not trash? - But yeah. - Give me tabs. - But like is that a new feature? Is giving back something that has existed for decades - Okay. - a feature? I wanna talk about Apple for a second in this whole thing. Got my here. Alright. Have you been following Twitter with the whole dumb percentage bar? - Yes. - For the battery. - [Austin] I was 16. There's the beta ads for the first time in like - [Matt] Five years? - [Austin] Five, six years, whatever. - People have lost their mind. Like, oh my God, thank you Apple for bringing giving us this feature to see percentage. It was, it existed for years. - Yeah. - My point is like do you think that putting in like a new feature of Windows 11 is to give tabs back or bring back 3D pinball? Do you think that these are actually features that warrant an entirely new operating system that now requires you to buy new hardware which is what's happening with 11. - Let me simplify this. Windows XP the bliss background, one of the most iconic backgrounds of any computer ever, they took that away. You can't load that up anymore and it is physically impossible to ever change it yourself. Imagine Windows 12, they bring that back. Is that not gonna be the number one new feature? - Probably yeah. - You press one button, you're gonna be super excited. Windows alternates from good, bad, good bad. Right? - My point is like, why do we need imagine it's gonna be good or bad because 10 was good. - And 11 was sus, but 12 will be good. - Like why is 11 worse than 10? Windows 10 should have just been - Windows X. - It should just been Windows at that point. And like, so the fact that we like, they moved away from this thing, like why did they do it? Because what they're doing is probably breaking things as they do, like these major architectural upgrade which don't get me wrong, need to happen because one I mean, for security reasons, it's just super outdated. Like these do need to happen, but it's happening in a way that's making the operating system worse. And then we gotta talk about like, do we think 12's gonna be better? Do we think 11's gonna be improve or whatever? - Well, I mean, I assume 11's gonna get some future updates over the next couple years. - Yeah, of course it will. - I would also assume that by that same token, Microsoft are in their sort of five, ten year planning or whatever on the Windows side. But figuring out what features they think will make 11, what they wanna say for 12, what are easier simpler things versus what are these huge architectural changes that they need to legitimately spend years building and testing. Remember Windows 11 when it came out was a bit of a surprise because really Windows 11 was already kind of like there in the background. - Yeah. - It was mostly like UI stuff that they had like flipped the switch on. But a lot of what it took to make Windows 11 they were openly basically building in the background and no one really realized it. And then go by the way 11 - Again, I don't find tabs in Finder - I do actually that's real helpful. - to be a feature. When they say Windows 11, it you know improves some ray tracing whatever. - [Austin] Sure, sure. - That's a feature. - Sure, fair. - And that's a reason to upgrade. - Okay. - Right now I don't think they have enough of those types of features to be pushing people into another. - Well, they're gonna spend the next two years developing the hot newness of the Windows XP background in 4k. And then I'll upgrade Windows 12. - That's not a If people are gonna get pissed off about Apple keeping iMessage, what do you think if like if Apple, I mean, if Microsoft actually said like oh yeah, in order to get this exclusive background you have to upgrade to Windows 11. But no - I'm not saying they're actually going to do it. I'm just saying like, they take old features they bring it back, they kind of listen to people's advice on like, oh I wish it had this. Or, oh, I wish I had tabs, whatever. They bake that in. And that's the reason why - Old features. - You upgrade to Windows 12. - Hardware's gonna change. - Yep. - And eventually the old system is not like the new as they upgrade the architecture. It's not gonna be able to work on older system. I get that. We have very little to support that it's gonna take like that happens every three years because how many workarounds? - On the flip side, - We did, how many we did a video of - Windows is the slowest, no, but think about it. Windows even a three year life cycle or a lifespan on each OS is the slowest out of anything. There's new version of Android every year, new version of iOS every year, new version of Mac OS every year. So the fact that Microsoft's are going from nebulously a five or six year cycle to a three year cycle in some ways is reasonable. But the lines are very blurry because their three year cycle. They're still adding features every few months or whatever. - We've talked about this with Apple and Android and all that. It's not necessary because, you know, we say like, - They got cell phones. - Well, they do it every year. And then half the features that they announce for the thing are delayed. And they come out nine months after the OS comes out. And then it's kind of just like quietly added in. And they're like, while while they're still talking about the next one. - Yeah. - We're not saying that Microsoft's the only one doing that. Well, at least I'm not saying that Microsoft's the only one who's doing this. I'm saying Microsoft is the most egregious for this one right now because they're the one who said, you know a few years ago, this is the last version of Windows. - Well, they never really said they like hinted that they like insinuated. Like this is the Windows that you're gonna wanna be on - Apple hasn't hinted at this is, they said it's gonna be the last version of Mac OSX 10. Android's not saying this is the last Android system. - True, that is good point. - That's my point when we're comparing those, it's definitely not apples to apples, or Apples to Android. (funny drum roll) (laughing) - God and what a great reason to subscribe for Matt's witty humor. I guess a way to think about this, I should something I've never really thought about but does any of this matter, like at this point are all of the major operating systems sort of mature enough to the point where we're not gonna get those huge massive rewrites and rebuild or maybe every like 10 years or something, but whether they call it a 0.1 update whether they call it a service pack or whether they call it a full version, update Mac OS, Windows, - Yeah. - Android, iOS are all just updating every few months or a year or whatever. And it just happens how they wanna package it and how they wanna market it into actually driving you into going to buy a new computer or a new phone or a tablet, or what have you. So really the name of it unless they're doing some huge core architectural change, which is probably gonna be pretty rare these days, is almost in some ways irrelevant. - Yep. - Except that when they keep bringing new versions of Windows they keep having problems and are worse in some ways. And don't let you upgrade and spy on you. But other than that, it's all the same. Is that what you're trying to say? - Yes. Let us know in the comments, what you think is an old feature that shouldn't have gone away. - Smell Detection. - Smell detection. - Hunger automatic delivery of pizza. - Like subscribe, follow, and order Austin a pizza.",
    "transcript_keywords": [
        "Windows",
        "people",
        "version of Windows",
        "Microsoft",
        "make Windows",
        "year",
        "features",
        "version",
        "Yeah",
        "years",
        "feature",
        "point",
        "good",
        "Apple",
        "upgrade",
        "Windows Vista",
        "Android",
        "system",
        "gamers",
        "Windows Arrow."
    ],
    "transcript_entity_values": [
        "11",
        "Windows 10",
        "Android",
        "Windows",
        "one",
        "Windows Arrow",
        "AMD",
        "Apple",
        "4k",
        "File Explorer",
        "every three years",
        "Windows 8",
        "Mac",
        "Mac OSX 10",
        "0.1",
        "Windows 12",
        "Windows",
        "Twitter",
        "8",
        "one year",
        "June 2022",
        "Windows 11",
        "Windows",
        "five or six year",
        "Windows 11",
        "nine months",
        "8",
        "three year",
        "three years",
        "Matt",
        "a few years ago",
        "years",
        "Vista",
        "Eight",
        "Five years",
        "the last two years",
        "Austin",
        "13%",
        "12",
        "one year old",
        "UI",
        "2024",
        "half",
        "two",
        "14%",
        "12",
        "Vista",
        "six years",
        "the most popular years",
        "Windows Vista",
        "iMessage",
        "the next two years",
        "Apples to Android",
        "every few months",
        "23.1%",
        "the next couple years",
        "ten year",
        "second",
        "Windows XP",
        "five",
        "Finder",
        "Edge",
        "these days",
        "2025",
        "decades",
        "Microsoft",
        "the last minute",
        "first",
        "Nvidia",
        "23.1",
        "16",
        "2020-2021",
        "2021",
        "11",
        "2022",
        "10"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "WORK_OF_ART",
        "DATE",
        "LAW",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "PERCENT",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "PERCENT",
        "DATE",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "TIME",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL"
    ]
}