{
    "id": "YpZqzM_fDqI",
    "title": "The Prices... They're Back...",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-04-21T02:17:49Z",
    "video_url": "https://www.youtube.com/watch?v=YpZqzM_fDqI",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "GPU",
        "graphics cards",
        "pc gaming",
        "DIY PC",
        "RTX 3080",
        "gpu prices",
        "stock shortage",
        "chip shortage",
        "Geforce",
        "Radeon",
        "RTX 30 series",
        "RX 6000 series",
        "gaming graphics card",
        "RTX 3070",
        "RTX 3080 Ti",
        "RTX 3060"
    ],
    "views": 552597,
    "likes": 31918,
    "comments_count": 1185,
    "description": "Get your kitchen essentials from Our Place's Spring Sale today    Check out Startenders!    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 meme opportunity lost 0:14 GPU prices returning to Earth 1:14 Pixel Watch leak 2:06 Meta Quest Gaming Showcase 2:59 Our Place 3:47 QUICK BITS 3:53 Netflix adding ads? 4:20 Amazon XR device 4:45 Game Boy emulators 5:13 Intel detects student emotions 5:36 Anti-salt chopsticks  FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://www.pjtra.com/t/2-498299-268363-217808?website=376476",
        "https://www.oculus.com/experiences/quest/3671539682885620/",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/WlGEv",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- April 20th. (shocking sound) What? It's 420? - [Man] Yeah, duh. - I didn't even know. Oh no, I should do a different intro then. Ah. All right, that's the intro. GPU prices are at the lowest they've been since January 2021, according to a report from German tech site 3D Center. That's pronounced 3D Center. (giggling) After prices for NVIDIA's RTX 30 series GPUs hit a high of 318% of MSRP in May 2021, then, hovered around 180% in the winter, they've now fallen to just 119%, while prices for AMD's RX 6,000 GPUs are down to 112%. Heck, buying a graphics card right now is practically thievery! You're going away for a long time. Now, 3D Center's report does center on the German market, so, you might still be seeing ridiculously unaffordable prices in your region, but it looks like soon, that might change. And after nearly two years of making morbid jokes about how we should all love the GPU we're with, it's nice to see some light on the horizon. Maybe you can find a GPU out there who will love you for you. More Google hardware leaks have hit the web this time in the form of a render depicting Google's upcoming Pixel watch, courtesy of Evan Blass and 91 mobiles. That's a lot. With a glossy, rounded design, and a digital crown on the side, the render matches up exactly with the leak first shown by Front Page Tech back in December. So, when it comes time to hand out the awards for who saw the picture of the thing first, (laughing) hand it to these guys. Nice job. Unlike previous Pixel watch hype, it looks more likely than ever that we're actually gonna see this thing in the real world soon. The Google Store just added a new watches section, and it's been a year since Google and Samsung announced their partnership to create new Android based smart watches, and it's looking very likely that the Pixel 6a will be announced at Google IO next month. So, keep your eyes peeled for the new Pixels if you're subconsciously an Apple fan, but too insecure to admit it. And Meta, the soulless corpse formally known as Facebook, held their Quest gaming showcase this morning, and showed off some pretty cool VR titles coming to Quest headsets. We finally saw a full trailer for \"Among Us VR,\" although, it would've been more exciting if the game mode hadn't been copied by like a dozen other games at this point. Stress Level Zero announced their follow up to \"Bone Works,\" titled \"Bone Lab,\" which sounds like a lab worth visiting. Not for me, though. And \"Ghostbusters VR's\" four-player gameplay trailer makes almost too much sense as an adaptation. But the coolest game they didn't show at the showcase was \"StarTenders,\" the new sci-fi bartending game, in which I play an anxious robot. Okay, listen, earthling, I'll keep your secret, if you keep mine. If I go down, you're coming down with me. (laughing) I'm sure they just forgot to put that one in though. Now, James has something to say. This feels backwards. - Now it's time for the Quick Bits, brought to you by Our Place, creator of cookware that can replace many of your pots and pans into one product. Which is great, 'cause I have no cupboard space. Whether you're making a quick meal, or being a responsible adult and meal prepping for the whole week, Our Place's products are kitchen replacement game changers. For example, their perfect pot is a Dutch oven, not the farting kind, stockpot, sauce pan, and roasting rack, and a steamer, and colander and a brassiere with a- Brassiere? Brazier with a built-in spoon. While the Always Pan is a non-stick fry pan, saute pan, steamer, skillet, and saucier. Saucier? I don't cook. It's never not a pan though. The Our Place spring sale is live from April 19th to May 8th, and everything, including the Always Pan and Perfect Pot, are on sale now. So, check it out at the link below. You know what? You're getting a Dutch oven. - Thankfully, the Quick Bits will never deplete. They reproduce asexually. Netflix announced in a letter to shareholders that it's losing subscribers for the first time in a decade, having bled 200,000 subscribers since last quarter. So, they're considering introducing ads in the low end subscription plans. The company may also crack down even harder on account sharing, a scourge that's estimated to plague around 100 million households. Making their existing service worse seems like a bold strategy to get the growth back. Let's see if it pays off for them. It looks like Amazon is hiring people to develop an AR/VR headset that would be a magical and useful new-to-world consumer product, which sounds like an incredibly utopian description of a device being made by the same people selling $20 microwaves, and the robot that throws itself down stairs. Okay, all right, fine. That's not fair. They also make home security devices that seem to automatically forward the video feed to both North Korea and the police. That takes skill. Emulators for both the Game Boy and Game Boy Advance that Nintendo is reportedly planning to launch through its Switch Online service have leaked, seemingly confirming Nintendo's plans. Included in the testing files are references to easy flash cartridges, physical media popular in the home brew community, indicating Nintendo may once again be incorporating innovation from game pirates in its own much better solution, that involves paying a yearly subscription for access to retro games. Intel has partnered with Classroom Technologies to integrate AI-powered, emotion detecting technology in a remote teaching plug-in for Zoom called Class. It's meant to help teachers know when students are getting bored or confused, but critics say it could set a dangerous precedent for students' privacy. And furthermore, what if that's just the way their face looks? Like Jeremy from homeroom just- He just looked like that. And the same Japanese researcher behind that wacky flavored lickable TV thing has developed a prototype pair of chopsticks that can make food taste 50% more salty using electrical stimulation. That would mean less salt would be needed in the food, so you could have more available for other stuff. Killing slugs. And also, maybe they could double as a taser in a pinch. I just saw everything everywhere all at once, and my imagination is going wild. Subscribe to They're Just Movies. Well, the tech news has been depleted for today, but come back on Friday, because it will replenish. The tech news springs anew each day, three times a week.",
    "transcript_keywords": [
        "game",
        "Google",
        "pan",
        "Center",
        "time",
        "Game Boy",
        "Google upcoming Pixel",
        "GPU",
        "Quick Bits",
        "Pixel",
        "Pixel watch",
        "prices",
        "Game Boy Advance",
        "tech",
        "announced",
        "Place",
        "GPU prices",
        "Nintendo",
        "Quick",
        "Google Store"
    ],
    "transcript_entity_values": [
        "Classroom Technologies",
        "The Our Place",
        "3D Center",
        "NVIDIA",
        "Google",
        "Amazon",
        "Japanese",
        "April 19th to May 8th",
        "6,000",
        "the Game Boy and Game Boy Advance",
        "Samsung",
        "Friday",
        "North Korea",
        "AMD",
        "Netflix",
        "next month",
        "Switch Online",
        "30",
        "May 2021",
        "50%",
        "the winter",
        "January 2021",
        "like a dozen",
        "today",
        "around 100 million",
        "the whole week",
        "Jeremy",
        "200,000",
        "Front Page Tech",
        "Google IO",
        "a year",
        "Brassiere",
        "nearly two years",
        "AR/VR",
        "just 119%",
        "318%",
        "first",
        "Bone Lab",
        "each day",
        "Ghostbusters VR's",
        "GPU",
        "112%",
        "Bone Works",
        "this morning",
        "the Quick Bits",
        "one",
        "20",
        "3D Center's",
        "spring",
        "Nintendo",
        "around 180%",
        "Among Us VR",
        "Android",
        "last quarter",
        "Saucier",
        "StarTenders",
        "the Quick Bits",
        "Apple",
        "Brazier",
        "a decade",
        "Intel",
        "three",
        "420",
        "Pixels",
        "91",
        "Dutch",
        "Quest",
        "yearly",
        "December",
        "Facebook",
        "Evan Blass",
        "German",
        "four",
        "MSRP",
        "James",
        "April 20th",
        "Meta"
    ],
    "transcript_entity_types": [
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "PERCENT",
        "PERCENT",
        "ORDINAL",
        "WORK_OF_ART",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "PERCENT",
        "WORK_OF_ART",
        "TIME",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "PERCENT",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "NORP",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "NORP",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG"
    ]
}