{
    "id": "yqMXBLT_3WY",
    "title": "Apple Made A Desk??",
    "channel": "Snazzy Labs",
    "channel_id": "UCO2x-p9gg9TLKneXlibGR7w",
    "subscriber_count": 1170000,
    "upload_date": "2021-02-13T17:02:43Z",
    "video_url": "https://www.youtube.com/watch?v=yqMXBLT_3WY",
    "category": "Science & Technology",
    "tags": [
        "snazzy labs",
        "quinn nelson",
        "snazzyq",
        "actable",
        "mactable",
        "apple accessories",
        "best desk Mac",
        "standing desk",
        "ikea",
        "Mac",
        "Macintosh",
        "MacBook Pro",
        "MacBook Air",
        "classic Macintosh",
        "Macintosh 1984",
        "Macintosh ii",
        "Snow White",
        "industrial design",
        "braun",
        "bang Olufsen",
        "Jacob jensen",
        "mark Newson",
        "dieter rams",
        "jony ive",
        "design"
    ],
    "views": 231080,
    "likes": 10063,
    "comments_count": 539,
    "description": "Snazzy Labs talks about one of the lesser-known Mac accessories: the MacTable. Released in 1984 alongside the 128K Macintosh, it has a longer and more storied history than you might expect.  Subscribe to my podcast Flashback! -  Follow Snazzy Labs on Twitter -  Follow me on Instagram -   The original Macintosh released in 1984 changed the world. It was the first computer to bring a GUI, mouse, and windowing system to the mass market. Sure, machines from Xerox and others existed beforein classic Apple fashion, nothing they created was novel. But it was polished, it was targeted at \"normal people\" rather than tech enthusiasts that had previously dominated the home computer sales market and it was designed \"right.\" It wasn't resorted to the basement dweller's lair, rather at the centerpiece of the home. As one might expect, accessories for the device became very numerous and in 1984, the MacTable was released. Partial drawing table, partial computer desk, partial... well, who knows what the heck it was for? Designed by famous industrial designer Jacob Jensen of Bang & Olufsen fame, it isn't just your average desk. Let's take a look at it in 2021. #Macintosh #RetroTech #IndustrialDesign",
    "description_links": [
        "http://relay.fm/flashback",
        "http://twitter.com/snazzyq",
        "http://instagram.com/snazzyq"
    ],
    "transcript": "Its difficult to really overstate the impact the first Macintosh left on the home computer market. While not the earliest implementation of a graphical user interface or windowing system, the Mac was certainly the first successful mass-market computer with a mouse, windows, and document previewingditching the premise of a command-line-driven interface. Over the last 37 years the Mac has had high points and low pointsfrom the SE/30 and iMac G3 to the Performa x200 and trashcan Mac Pro. Today, Apples products are more popular than ever and get thisthe Apple accessory market just accessories for Apple products have created a more than $20B industry. The Mac has *always* had a devout and loyal user-basefrom day one, through thick and thinand while smaller than the market today, the 80s also housed a bevy of Apple-focused software and hardware accessories. One such accessory? This. The MacTable. From the Garamond-guilded logotype to the thoughtful design, youd be excused for thinking Apple itself made this desk. In fact, many individuals that have sold their MacTables online over the years have made this mistakeor more cynicallyintentionally misled potential buyers. Even ZDNet in a 2013 article said What about when youre working from home? The iPad and iPhone maker had you covered. Oh, but they didnt because Apple didnt make this deskbut that doesnt make the story behind it any less interesting. A company under the name Scandinavian Computer Furniture, Inc. more colloquially known as ScanCo was the brand behind MacTable. The version I was able to get my hands on was the more common, pedestrian second revision. The first MacTable wasin my humble opinionsignificantly better designed and while I cant state the exact release date, the earliest evidence I was able to find of its existence was a June 1986 release of MacWorld Magazine. The design of the table was rather striking with an enamel painted steel frame with very Scandinavian 90 degree feet. The top of the table is very unique with the front half of the desk being a slope-adjustable slab and the rear half of the desk having three panels that could be individually tilted. The Mac was intended to fit in the center section and was actually height adjustable. You see, the original Macintosh models didnt ship with an internal hard disk but starting in 1986 you could get external SCSI disks upon which your Mac would sit. Obviously, this would make the Mac itself quite a bit taller and so the desk accounted for this height discrepancy by allowing you to lower your machine a few inches. The desk had a number of other well-considered niceties like cable management channels, a platform for your continuous dot matrix printer paper ream, a lock-box for your valuable floppies, and more. If this design seems too well-thought out for the cocaine-laced 1980s theres a reason for that. Possibly. According to this first ad for MacTable, the desk was designed by the iconic Jacob Jensen and Derek Dennis of Bang & Olufsen fame. But heres the thing I have a pet theory that this isnt actually true and was a white lie to sell more MacTable units. Why? Well, because by the mid 1980s, Jacob Jensen had long been considered one of the worlds most renown industrial designersamongst the likes of Dieter Rams and Philippe Starck. With a long and storied history at Bang & Olufsen, the likelihood that hed spend time designing a desk for this unknown startup furniture company seems suspect. Especially when considering that in this advertisement his name is spelled wrong, the other designer, Derek Dennis might exist but I couldnt find anything about him ever being real or working for B&O, and the fact that after this first advertisement, they never once mentioned Jacob Jensen ever againdespite his extremely high profile and prestige as a designer. Im not saying they were scammers, but I mean is it possible that they told a bit of a lie about a guy located halfway across the world in an age before the widespread internet to sell a desk to an extremely niche subset of already niche computer enthusiasts? Ehhh Well never know how many of the original MacTables were ever sold but something in 1987 happened that messed everything upa form factor change. Since the Macintosh was new, nobody knew how long Apple would retain the classic all-in-one form factor and while they did until 1992 with specific models like the Macintosh SE, SE/30, and Macintosh Classic, the Pro Macs shifted to a more PC-looking form factor with the Snow White design language. Back in the 80s before the era of Johnathan Ive and the pursuit of thinnness, Apple was just a computer company. A computer company with a better-than-average sense of design, but just a computer company. In the mid-80s, Apple wanted outside help to create a design language for future Apple products that would transform them from a small Silicon Valley company to a global brand. There were 7 products (it was actually eightbut eight dwarves doesnt sound as compelling) Apple had whipped up and a bunch of design firms came up with ideas for each of the 8 products. Frog Design was ultimately determined to have been the best and Apple adopted their style. Distinguishing characteristics of the Snow White computers was the following: gone was the warm beige color of the 70s and adopted was an off-white fog which was eventually changed to a gray platinum to reduce fingerprints. Each product had an in-laid 3D Apple logo, an expensive and new (at the time) injection molding process called zero-draft which allowed for a subtle but impressive precision on the exterior but also one that could fit components more tightly thus decreasing overall case size, and most distinctly, they added shallow horizontal and vertical lines. Not only did this allow for hidden ventilation but it also gave the illusion that the computer enclosure was smaller than it really was. While Snow White designs may look a bit dated today, it help set design trends industry-wide and molded the perception that computers could transcend beyond mere utility. The first snow white machine to break the 1984 Macintosh form factor was the Macintosh IIa machine designed for professionals. Rather than opt for an all-in-one design, the Macintosh II was modular and much larger in size. This computer was obviously too big for the MacTables precision-engineered all-in-one Macintosh cavity. Thus, ScanCo got to re-designing it. I reckon this time they did so without external design help becausewhile niceits clearly less refined and sophisticated as the original design. The metal subframe is ditched for a beechwood one making the table significantly lighter, the heavy 90 degree legs have taken on a more traditional table form, and those modular panels? Well, theyve just been moved to the front. In the second revision, where the computer and your printer and your accessories fit? Thats all a single slab of wood and frankly, of no benefit over a standard table. The front panels can now adjust but I kinda wonder beyond maybe tilting down the keyboard what benefit having angled panels would be for. Your mouse obviously needs to remain on a flat plane and what are you going to put on the left? Thats space near your arms which youd likely want to leave open. The revised design is confusing but it came with a massive price cut: from $399 to $289. With inflation that makes it about 639 2021 dollary-dos. Not a cheap table to be sure, but also not entirely unreasonable I dont think. Its not made of the nicest materialsjust melamine and beechwood, but it is mostly solid hardwood, its sturdy, and it has a heft you wouldnt find in, say, IKEA furniture. That said, IKEA desks are a lot cheaper than $650. With this price cut subtracted the included cabinetthat wouldve run you an extra $139and it wasnt really part of the table either. It just had rollable casters on the bottom. Disappointing to say the least. Whats not disappointing is that they upgraded the surface-top to a Platinum Gray colorvery similar to the Macintosh computers that were employing use of it. Pretty classy to have your table compliment your computers color. Over the years it seems ScanCo branched out into other general office furniture as indicated by the last ad I could find online for MacTable posted in 1989. They began selling a lateral filing cabinet, bookshelves, and a two door cabinet, oh, and they also sold an office chair. Gone was the beautiful, forward-thinking design of the first MacTable and what remained was merely bland, cheap, dated Scandinavian-style office furniture. For all six pieces youd be looking at a total of $1,214 plus shipping and handling. Interestingly, in this ad it seems that they reversed their decision on panel placement moving the adjustable panels back to the rear half of the desk with a solid slab on the front. My desk doesnt officially allow you to change orientation but we tried anyways and yeah, uh, it doesnt really work with the pitch of the slabs and the logo finds itself upside down. Ive never seen a second-revision MacTable in the configuration presented by this ad. Maybe they never sold any. And that brings us to the question: what happened to MacTable after 1989? In short? I dont know. The downtown Seattle office they occupied from day one actually seems to have gone by the wayside while the company was still active with later ads mentioning only a Redmond P.O. box. The company had a trademark for the MacTable name which expired in 2002 and was never renewed. The agent on fileaka the ownerSoren Stohm is a tricky man to find. A distinctly Danish name, there are a lot of references I found to him back in the 80s and he seemed pretty involved in the community. The book Macintosh II Repair and Upgrade Secrets by Larry Pina thanks Soren Storm of ScanCo in the foreword. I was able to locate the home he owned until 2001 in Seattle and the home that he and his wife allegedly relocated to in Floridapresumably for retirementhowever, after messaging who I believe to be his children on social media, I only heard back from one who told me she didnt know a Soren Storm. Soren, if youre watching this, thanks for making this cool table. Sure, it might not be super integral to the history of Apple or the Mac but it just goes to show how devout and tightly-knit the Mac community was in its infancy. While that community is long gone and the new one is comprised of millions of people, I still feel in a way that new Apple Silicon Macs hearken in some ways to the early days of the Macintosh. Theres excitement in the air, the prospect of new technologies, and Im excited to see what other people make (1) as a result of ARM Macs and (2) for ARM Macs. Even if its just a desk.",
    "transcript_keywords": [
        "Apple",
        "Apple Silicon Macs",
        "Macintosh",
        "Mac",
        "design",
        "desk",
        "computer",
        "MacTable",
        "Snow White",
        "computer company",
        "ARM Macs",
        "Macs",
        "Apple products",
        "Snow White design",
        "table",
        "Snow White computers",
        "company",
        "Jacob Jensen",
        "Apple accessory market",
        "Macintosh computers"
    ],
    "transcript_entity_values": [
        "about 639",
        "a few inches",
        "the early days",
        "Mac Pro",
        "two",
        "MacTable",
        "399",
        "June 1986",
        "six",
        "2",
        "Silicon Valley",
        "Bang & Olufsen",
        "1984",
        "the 80s",
        "one",
        "the last 37 years",
        "day one",
        "millions",
        "IKEA",
        "the mid 1980s",
        "Macs",
        "the Macintosh II",
        "more than $20B",
        "Macintosh Classic",
        "Pro Macs",
        "7",
        "Apple",
        "8",
        "1989",
        "Derek Dennis",
        "the Performa x200",
        "Larry Pina",
        "Danish",
        "2013",
        "SE/30",
        "Mac",
        "MacWorld Magazine",
        "650",
        "first",
        "Jacob Jensen",
        "Philippe Starck",
        "139and",
        "289",
        "a Soren Storm",
        "1992",
        "Redmond P.O.",
        "three",
        "Macs",
        "MacTables",
        "zero",
        "eight",
        "Scandinavian Computer Furniture, Inc.",
        "1",
        "Stohm",
        "Snow White",
        "1987",
        "1986",
        "Seattle",
        "MacTable",
        "Platinum Gray",
        "iPad",
        "today",
        "Soren",
        "Today",
        "90",
        "ZDNet",
        "iPhone",
        "Apple Silicon Macs",
        "Scandinavian",
        "1980s",
        "Macintosh II Repair and Upgrade",
        "Snow",
        "MacTable",
        "half",
        "the years",
        "Johnathan",
        "Frog Design",
        "B&O",
        "Mac",
        "3D Apple",
        "Macintosh",
        "Dieter Rams",
        "the 80s before the era",
        "the 70s",
        "90 degree feet",
        "the mid-80s",
        "2002",
        "SCSI",
        "1,214",
        "iMac G3",
        "2001",
        "One",
        "second",
        "Apples",
        "Floridapresumably"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "NORP",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "MONEY",
        "MONEY",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "GPE"
    ]
}