{
    "id": "yrH3TywyrcI",
    "title": "Will This Be Your First Drone?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-07-31T17:00:11Z",
    "video_url": "https://www.youtube.com/watch?v=yrH3TywyrcI",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "drone",
        "quadcopter",
        "3dr",
        "3dr solo",
        "solo",
        "drone quadcopter",
        "dji",
        "phantom",
        "dji phantom 4",
        "3dr vs",
        "vs",
        "dji vs",
        "best drone",
        "2016",
        "best",
        "apple",
        "iphone",
        "android",
        "smartphone",
        "iphone 7",
        "video",
        "4k",
        "dji phantom",
        "phantom 3",
        "drones",
        "drop",
        "3d robotics",
        "cool gadgets",
        "new inventions",
        "gopro",
        "phantom 3 professional",
        "hero4",
        "gimbal",
        "flying",
        "amazing",
        "awesome inventions",
        "amazing inventions",
        "futuristic",
        "inspire"
    ],
    "views": 3128896,
    "likes": 54300,
    "comments_count": 4078,
    "description": "(   ) --- Today's Mystery Video -  3DR Solo Drone (USA Link) -  3DR Solo Drone (International Link) -   Believe it or not this is the first \"big\" drone I've ever featured here on Unbox Therapy. Had a lot of fun flying the 3DR Solo, hopefully this is the start of many more drone videos!  From the manufacturer -   The worlds smartest drone is also the easiest to fly. With features like pushbutton flight and computer-assisted Smart Shots, Solo makes it easy for anyone to get professional aerial photos and video. Solo is powered by two 1 GHz computers for the best and smoothest aerial photography experience imaginable, and includes many world-first technologies and a host of built-in safety and support features. Its also the only all-in-one drone to offer wireless video streaming in vivid HD from your GoPro directly to your mobile deviceat ranges up to half a mile.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/vDnMiwlDlog?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://amzn.to/2amCfeC",
        "http://geni.us/fBpXZ",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "I'm very excited today together... we are going to experience my very first drone very important moment in Unbox Therapy history the solo smart drone with the gimbal attachment this guy right here as you can tell this is the setup it is a smart drone rather than have a camera built in this lets you use your own GoPro Hero 3, 3+, or 4. I have the 4 Black Edition charging right now so we're gonna send this bird up in the sky so a little brace there for your smartphone run the app see what's up this guy can do an orbit mode it can actually follow somebody on a bicycle in a car as you can see here it's mounted up without the gimbal so it'll work like that but its little bit you know *hand gestures* you know what I'm saying this works on iOS or Android. The Future Woo! Oh My, look at contro-(ller) bah! whoa so that's a nexus 6p this guy controls the camera angle looks like look at that that's the important part Holy! here are the props that's where all the magic happens charge brick very important component here I think it's good for close to 20 minutes ok last up the gimbal your GoPro goes inside here power comes like this constantly making adjustments for stabilization I'm gonna get this baby charged up we're gonna hit the street. Then we're gonna hit the sky *Take off Noise* *Instrumentals* So once you get the whole unit set up and got the gimbal mounted on there As well as your GoPro attached you can see is in this location over here You're pretty much ready to roll you're going to need to install the application Right iOS and Android in from there there's a couple of updates to do but then your Phone becomes the monitor for this camera,and then broadcasting that via Private Wi-Fi network out to your display You're no longer trying to spot the drone in the sky instead you're doing You're monitoring on the phone and from the viewpoint of the drone so the Interface displays some key information here you can see the height of the drone There's a button to initiate flight the battery level the charging status of the GoPro is a selfie mode cable cam where you can set up some predetermined points And have the drone follow those orbit and then follow which will actually have it Follow an individual moving object and then of course you've got the display Readout on the controller itself which is going to give you some information as Well regarding battery reception and GPS another cool thing is the whole Controller it like rumbles when the drone is coming in to land It's almost like a pulse like a heartbeat like bubble bubble bum so you Know what's up you know what you're doing so in the back you've got controls Here for the angle of the camera on the gimbal and you can set up some presets As well so if you've got a couple of angles that you like you can quickly Toggle between the two preset 1 and preset 2 So there you have it my very first drone what if I discovered droning is fun A lot of fun if you haven't flown one of these things you should definitely give It a shot and hopefully this is the start of many successful drone flights And drawing videos I want to cover some other ones in the marketplace let's do it together Me and You!",
    "transcript_keywords": [
        "Unbox Therapy history",
        "drone",
        "excited today",
        "solo smart drone",
        "smart drone",
        "Black Edition charging",
        "Unbox Therapy",
        "gimbal",
        "Black Edition",
        "GoPro Hero",
        "drone follow",
        "follow",
        "moment in Unbox",
        "Therapy history",
        "GoPro",
        "Future Woo",
        "guy",
        "important part Holy",
        "attachment this guy",
        "gimbal attachment"
    ],
    "transcript_entity_values": [
        "Android",
        "Readout",
        "two",
        "1",
        "today",
        "Toggle",
        "first",
        "Black Edition",
        "GoPro",
        "GoPro Hero 3",
        "GoPro",
        "6p",
        "4",
        "close to 20 minutes",
        "2",
        "Interface"
    ],
    "transcript_entity_types": [
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "PERSON",
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG"
    ]
}