{
    "id": "Yss3VChyUNM",
    "title": "Was Dell actually FIRST?? - UltraSharp 40\" Curved WUHD Monitor",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-01-14T22:45:38Z",
    "video_url": "https://www.youtube.com/watch?v=Yss3VChyUNM",
    "category": "Science & Technology",
    "tags": [
        "Dell",
        "PC",
        "Gaming",
        "Monitor",
        "Ultrawide",
        "5K",
        "Curved",
        "2500R",
        "Display Port",
        "DVI",
        "HDMI",
        "I/O",
        "IPS",
        "sRGB",
        "Workstation",
        "Colour",
        "Colors",
        "Tilt",
        "Pan"
    ],
    "views": 741452,
    "likes": 24832,
    "comments_count": 1312,
    "description": "Win a Yeelight Mystery Box valued at $299 at   So Dell wasn't first, well, not exactly, but we're not too sure what we think about this monitor. Is it something of value to have it curved or even at 5K? Well, maybe, but if you're going to release it now, it needs to have HDMI 2.1 at least!  The monitor isn't available yet but see Dell's other monitors at   Buy Dell Ultrasharp Curved Monitors On Amazon (PAID LINK):     On NewEgg (PAID LINK):   On BHPhoto (PAID LINK):  On BestBuy (PAID LINK):   Buy LG Ultrawide 5K Monitor 34WK95U On Amazon (PAID LINK):     On BHPhoto (PAID LINK):     On BestBuy (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://bit.ly/YeelightRaffle_ShortCircuits",
        "https://lmg.gg/5dC12",
        "https://geni.us/QdV5mB",
        "https://geni.us/m1t8",
        "https://geni.us/oD9jw",
        "https://geni.us/TEKvyYl",
        "https://geni.us/yYTbLt",
        "https://geni.us/38PK4M",
        "https://geni.us/LW0do8",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- We're back. That's a 360 baby. It's a big box. People love a big box. And in this big box is a new monitor from Dell which apparently is hold on, let me look at my notes, the world's first 40 inch ultrawide curved 5K2K monitor. Now, when you see a statement like that you can be pretty sure it's not the world's first anything. That's too many qualifiers. And if the marketing department was just trying to tell you as much about their monitors as they could in one sentence, then they kind of screwed up the whole concept of world's first. So, bad marketing either way. But it could still be a great monitor so let's check it out. Right after I get in this box, using my trustee sheers that I keep in my pocket. Oh God! This is like a giant briefcase. This is a fun kind of thing to unbox. In it we have a calibration report. This is showing us that in sRGB mode which is like regular web kind of color space. The Delta Es which is the difference between what the color shows and what like the perfect color is. Those Delta Es are very low which is awesome, they're actually below a Delta E of one. A Delta E of like two and three is like what the human eye can even discern. So that's very good. However, this is a monitor marketed towards color professionals. So if you're doing graphic design or other colored critical work, you're probably not gonna be working in sRGB all the time, you might be in something like Adobe RGB or DCI-P3 which they also have here but the performance isn't as good. It's still just barely over two, it's all under three. So that's pretty good. We have a how do you say, I don't want to say non-verbal but one of those instructor manuals, that's all pictures. Those can be hit and miss. I'm gonna try not to look at that. Cables, display port cable, probably gonna use that. This is a USB I believe that's type B, like uplink cable. So that's because at the back of this monitor there's going to be a USB hub you can plug lots of stuff in and then from the monitor to the PC, you'll have this cord. HDMI, we're gonna look closely at this. You probably don't want to use HDMI with this monitor if it's anything like other 5K2K monitors I've seen in the past. And then there is a Thunderbolt, actually a Thunderbolt 3 cable. These things are pretty expensive or atleast they used to be. But pretty nice for them to include, what is that like a four or five foot cable? Nice, USB type C. So you can also do display port. You could run display port over USB type C using this cable, nice. Wow, there's a bunch of numbers on this thing. Can you see this? Here, look at this upside down one. One, is the base of the monitor stand. Cool, I like this type of base. I prefer this to having like legs that jut out because you can just put your phone or your wallet on it. I think that's cool. This is not too big either, haft! Now here's the little two in the two bucket, and guess what? It's the neck. And you can kind of see already this is a more professional executive look as opposed to like a gamer look. Is this integrated to this? Yes, it is. Snap that on there and then just give this a twist with the fingers. Cool and I can see there is a cable management channel. I like that stand, it feels robust. It's like anodized aluminum. That's good. Power cable, no power brick yet? Hopefully it's integrated into this monitor. It's a fairly large monitor so I would kind of expect the power brick to be integrated into there. And now I get to take this whole thing out. Oh, I think this is telling me to leave this on until later. What is this trying to say? Okay, I dig it. Now I can get rid of this. We're back. (laughing) That's a 360 baby. I think I can actually assemble this without having to take the shirt off. This is actually so nice. So many times, especially with a really big TV, it can be difficult to get it out of the box but then you have to lay the whole thing down on its face while you get the legs on it. And then you're looking for something soft you can safely lay it on putting a blanket down. Big pain in the butt. That you don't have to mess with this time cause they thought of everything. That's great. Now I just go like this. This actually foam in there. Oh, there is more on this side too that I didn't even get to see. It's pretty heavy with the stand. It's about 20.5 pounds not like unruly. Okay. We have this much elevation. Oh, it goes is really nice and low. That's cool. That high. It actually has built in swivel quite a bit. That's nice. And for tilt you get what? The standard? Yeah. Oh, actually tilts up pretty high. Any rotation? What? A little bit. I mean, no one is going to use this in vertical mode. The reason that rotation is nice, is that it's easier to plug stuff in but you couldn't even turn this sideways if you want it because it would have to be so much higher. So this is a reasonable it's nice that they give you a little bit I mean, you know, if your table's not level or something like that. This has a really clean look. This button over here it's just a nice little dimple for the power button and a really premium looking and feeling joystick. It looks like they want Apple users to use this. I can't wait to explore the OSD. Okay, and then looking at the IO, I like the IO labels here. This is almost like a soft touch kind of plastic here. Power cord goes in there. HDMI one and two. Again, I wouldn't use those. They are HDMI 2.0 not 2.1. And at this point in 2021, if you're spending $2,100 I almost feel like that's almost right there I wouldn't buy this monitor. Because in a couple of months is just everything's going to be 2.1 or it should be. So I don't know let's just put an astros on that and keep going. Display port 1.4. Oh, here we go. This is the integrated USB hub. You can see they actually shows a picture of a laptop with a lightning bolt and it says 90 Watts. Yeah, we have RJ45 jack for the internet. We have a 3.5 millimeter audio jack. I believe there are four USB type a ports that are 10 gig on this thing. Oh, here it is. Down here. There's another USB type C down there too. That's really cool. Especially if you want to hook up like your SD card reader or something like that. Yeah, this is kind of a weird screen because it's a 21 by 9 screen, just normal ultrawide. But it's 40 inches whereas most are 34 inches. I have a super ultrawide which is 49 inches on my desk. So it is wider than that but I don't know. Of course this is high resolution. This is 5120 by 2160. So 2160 PS4K. You can think of this as just being like the resolution of a 4K monitor but then you have like an extra third. So it's like a 4K ultrawide but they call it 5K2K, which is annoying. But the reason I was picking on them for saying this is the world's first curved. This is not the first 5K2K. There have been other monitors. We reviewed an LG one back in November of 2018 on Linus Tech Tips that had this same resolution except at 34 inches. And you can buy that one now for about 14 or $1,500. So I don't know why you would buy this now to be honest but we're going to plug it in and check it out anyway. But before he plug in here's a message from our sponsor, Yeelight. Yeelight M2 smart bulbs offer a seamless integration with Google Assistant as well as customizable colors for different scenes. For current Yeelight users, you can enter for a chance to win a mystery box valued at $300 with the latest Google Nest Hub and Yeelights smart lights included. If you're not currently using Yeelights, you can still enter for a chance of winning $109 value mystery box. Check out the giveaway link in the video description. The giveaway ends on January 31st, 2021. So go. All right, this is like a little tutorial teaching you how to use the OSD and some initial setup. Kind of like what you do on a TV but you don't normally do on a monitor. First option I have here is to enable always on USB C charging other USB charging and uniformity compensation. All of which will increase power consumption if you want it to adhere to the energy star rating that it has here but keep those off. All right, this is not really a gaming monitor, it's a 60 hertz monitor. They do claim to have a five millisecond pixel response time this is an IPS panel but for that you need to put it into like it's fast mode which means you might get some overdrive. This is however, not a review I'm just here to tell you that it does have like a matte kind of finish on it 3H. Also one thing you should know, it's curved. It has a 2,500R curvature which is not a very aggressive curve. Other monitors that are more gamer oriented will have 1,800R or 1,000R curve. Let's go into the control panel where we can see. It's a 5120 by 2160 native and it is I believe this is a 10 bit panel. Yep, funk. No FRC malarkey. Let's try to put it at 75 and see what happens. This is not a representative. Like it's kind of a bit of a lottery. 75, it worked cool. That doesn't mean that yours is gonna work. It kinda of varies by monitor a bit. But I mean better than 60. One thing I want to know though is if I switched to HDMI, will I be able to hit the full resolution? Because when I used that LG two years ago, that did work. Okay, well it's full screen that's good news. Because when I messed around with the LG before it was actually squishing it to 16 by nine. But the recommended is not full res, but can it do it? It does 5120 by 2160. Okay, well that's great news. That is fantastic okay. 30 hertz? There it is guys. Oh yeah and ow that I'm moving the mouse around it's like a slideshow show (mumbles). Maybe let's see what happens if I go down to a four to two chromosome sampling an eight bit. Yeah, use display port pretty lame. And I mean, it's not like there's this way of stream compression. If you had a newer graphics card, like a 30 series you could use DSC to get higher specs than HDMI will allow but you don't have HDMI 2.1 on the monitor so that is totally irrelevant. So yeah, you're going to wanna use display port. Other things about this monitor, it does have speakers included two nine watt speakers. It also has a built-in KVM for switching including a picture by picture and picture by picture. So should you buy this monitor if you're a content creator? I don't know. I mean, for HDR, if you're an HDR content creator or even consumer gamer pass on this, cause it's not HDR. The peak brightness is only 300. Even the LG that it was over two years old at this point they set display HDR certification of 600, which still isn't great you want a 1,000 but it's better than 300. And you have the LG is smaller, this is a 40 inch. The other one I think was 34 inches. But that means that is has as a higher pixel density. So pick your poison there. I just think that if you're going to be saving $600 then I would go for the one that's already been out for a long time. Like this is coming out now but it offers nothing new. It doesn't have HDMI 2.1. It does have power delivery, which is kind of nice. It's not a new resolution. I just don't know why this is coming out now. And if it were up to me I would just save the money and go for the LG which also had great coverage of the DCI-P3 color space and also had good color accuracy. It basically does everything this thing can do. So, I mean, this isn't a review but my guard feeling is that I wouldn't get this one over the LG that already exists. So thanks for watching ShortCircuit guys. If you liked this video, hit, like and subscribe and see us next time where we unbox a kitten. 2021 kittens are going to be fire. That's what I heard is yes.",
    "transcript_keywords": [
        "monitor",
        "USB",
        "kind",
        "USB type",
        "HDMI",
        "nice",
        "thing",
        "display port",
        "box",
        "cable",
        "pretty",
        "big box",
        "display",
        "color",
        "monitors",
        "Power",
        "bit",
        "Delta",
        "big",
        "USB hub"
    ],
    "transcript_entity_values": [
        "Linus Tech Tips",
        "109",
        "better than 300",
        "1.4",
        "4",
        "Thunderbolt",
        "USB",
        "49 inches",
        "Nice",
        "90",
        "1,000",
        "Google",
        "2021",
        "1,800R",
        "a four to two",
        "a couple of months",
        "600",
        "Adobe RGB",
        "Yeelights",
        "1,500",
        "two nine watt",
        "10",
        "75",
        "3.5 millimeter",
        "30",
        "300",
        "two years old",
        "40 inches",
        "Dell",
        "only 300",
        "DSC",
        "5K2",
        "9",
        "OSD",
        "Watts",
        "2,500R",
        "KVM",
        "five millisecond",
        "Yeelights",
        "first",
        "two years ago",
        "two",
        "SD",
        "2.1",
        "Google Nest Hub",
        "eight",
        "The Delta Es",
        "five foot",
        "one",
        "2160",
        "USB C",
        "about 20.5 pounds",
        "K",
        "Thunderbolt 3",
        "nine",
        "75",
        "LG",
        "DCI-P3",
        "a 40 inch",
        "HDMI",
        "hertz",
        "ShortCircuit",
        "40 inch",
        "January 31st, 2021",
        "34 inches",
        "jack",
        "Yeelight",
        "First",
        "Apple",
        "RJ45 jack",
        "November of 2018",
        "IO",
        "5120",
        "three",
        "One",
        "60",
        "DCI",
        "FRC",
        "IO",
        "IPS",
        "about 14",
        "21",
        "16",
        "2,100",
        "four",
        "600",
        "four or"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "LOC",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "QUANTITY"
    ]
}