{
    "id": "Yt9sPsdml7g",
    "title": "It FINALLY Happened!! - Building the Largest LEGO Technic Crane!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-12-21T15:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=Yt9sPsdml7g",
    "category": "Howto & Style",
    "tags": [
        "Lego Technics",
        "Lego",
        "Lego Bricks",
        "Lego crane",
        "best lego set",
        "lego construction",
        "Lego Bugatti",
        "Technic",
        "Lego Technic",
        "Lego Technic crane",
        "JerryRigEverything",
        "like a lego"
    ],
    "views": 14295972,
    "likes": 245717,
    "comments_count": 12536,
    "description": "LEGO is here for real! With the largest LEGO Technic set they have to offer:  LEGO Technic is designed for kids 11 and up, Cambry and i had a blast assembling this massive contraption.  It took us almost a week. And was worth every second. Huge thanks to LEGO for sponsoring this video! Check out all their other LEGO Technic Sets HERE:   Ive been playing with LEGO Bricks for as long as I can remember, and this MASSIVE LEGO Technic Crane was a blast from the past and a super fun trip down memory lane. The classic LEGO I remembered from my childhood with a new slightly more advanced and intricate twist. Which LEGO Technic set do you want to try out?   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://amzn.to/41NhrYk",
        "https://ebay.us/BofiQZ",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today is the day. It's finally happened...Mom, I've made it. I have a sponsored video with Lego. Look at the size of this thing. It only took 600 videos worth of mentions to get it. Just like a little Lego Clips like a little Lego Like a little Lego Lego style ribbon connector Both unsnap like little Legos Lego, Lego, Lego, Lego The squeaky wheel gets the grease. I need an extra couple hands for this video. You might remember Cambry...she's here to help. [Cambry] Let's get started. [Intro] So this is one of Lego's bigger sets. This is called the Rough Terrain Crane, and it's one of the Lego technics, which is a slightly more complex system of Legos. You know, for people older than just children. With 4,000 pieces. We might...we might be here a while. So Cambry found what we think is the manual. [Cambry] This is the first half, and this is the second half. [Zack] Look how thick that is. [Cambry] 79 pages of bag 1. [Zack] We're barely through step one, but we already have some pretty intricate designs going. And I'm not sure how this all fits together just yet, but all of these little different parts that we're building just snap in together like a little Lego. Okay, let's keep going. [Music] [Zack] Like a little Lego. So we've been at it for about 2 hours or so. This is the first instruction booklet and we are this far into it. But it's been fun! I feel like it doesn't feel like it's been 2 hours. [Cambry] I lost track of time. We've done 143 steps...144! I'm pretty proud of this. It's big but it's going to be like 10 times this size so I'm excited to see what it looks like finished. [Zack] Not exactly sure where this goes in the whole scheme of things, but it should all come together in the next couple hours. On to step number 2. There are the bags we need there. So this right here, I'm assuming is the front portion of the crane. So we have this gear right here which turns the steering. And the wheels will be attached on either side here. And as the wheels are spinning, you can see the gears inside as kind of like a differential, so if one wheel...let's say this wheel up here has stopped spinning, the other one can still function all by itself, and they can work independently of each other. That's the purpose of a differential, all those gears in the little housing right there. Pretty sweet. [Music] [Zack] Okay, so it might not look like we've accomplished much with the bags, there are still a lot more steps left. We just finished number 4, but the cool part is we just mounted this motor and you can see the individual pistons right there inside. So as the motor turns, you can see the pistons moving, here's the fan in front. But you can also see where the wheels mount right here. They are turning as the motor pumps. [Music] [Zack] Okay, so we've been here for about 7 hours working on this Lego project, and we've gotten pretty far. It doesn't quite look like a crane yet. This is what it's supposed to look like. This is where we're at right now. [Cambry] It's kind of like a huge jig saw puzzle. And I think we've made it through half the pieces, but the last couple of pieces are probably going to be the trickiest because they are all the same color. [Zack] What's nice though is that we have these two massive books and they're pretty detailed. This is the first book that we're in, and we haven't gotten to that second book yet. [Cambry] Yeah, even though we're not through the first book, I think we're still probably halfway there just because by the time you get to the second book, you have less steps, less pictures because you're adding on to the whole structure. [Zack] So after work on this for 7 hours, it's definitely not like a difficult project, but it is very intricate and it keeps your mind and your hands active the whole time, which brings me to one of my favorite quotes that I've ever heard by Harrison Ford: Anyone who stops learning is old, whether at twenty or eighty. Anyone who keeps learning is young. The greatest thing in life is to keep your mind young. And I think building one of these Lego technic projects is a way to keep your mind active and keep your mind young. The wheels feel like they're pretty heavy duty rubber, so it should be interesting when we see them finally on the whole contraption. [Zack] We're making progress. So when you turn this little knob in the back, it rotates all 4 tires at the same time. Also, fun little fact, as it's rolling forward and backward, you can see the pistons inside of the engine pistoning...firing! Firing is the word! [Cambry] We're done with book number one! [Zack] Heck yeah. [Cambry] Onto number two. [Zack] So one interesting thing that translates into real life construction equipment and traffic cones are these indicators. So if you see, when they go on a piece of construction equipment like so, they indicate by slanting down which direction you should walk or which direction you should drive your car to avoid the dangerous obstacles in the middle. So it's nice to see that Lego is translating these real life stickers onto their project. Alright, this is day three, hour...how many hours have we been doing this? [Cambry] I think 11. [Zack] 11 hours. And we should be able to finish today. We're on step 10 and a half. [Cambry] Just to be clear, we're halfway through step 10. There's no 10 and a half. [Zack] So on this crane there is some powered movement and it looks like it's all powered off with this one motor back here using a couple different switches like this guy right here, switching, you know, to drop the legs down or to raise the boom. And this motor connects to this battery pack right here. If you remember those old school Lego Mindstorms, it has the same style of connector. There are these little metal bits inside of the Lego plug, and when it connects right here, the whole thing is powered, and you can go forward and reverse. So it will be interesting to see how all of the gears and contraptions inside of this Lego technic set work together when the motor and the battery pack are working. So we're about to install the lift cable. So it's powered on right now, we have the battery pack here, the motor and then this right here is a switch. So we're going to bring that over to the side. This right here is a switch, so we're going to bring that back. (Small Electric Motor Sounds) And now the battery is on and we're reeling the line in on this spool all automatically. What's cool is that you can see all the gears turning inside, and I imagine if I were to switch this, it would now drop the lever out and and unspool the spool. Pretty sweet. Is this is the part you've been waiting for? [Cambry] Yeah, this is the part I've been waiting for because there is a whole lot of red, and I think it's going to be more challenging to put it all together when it's all one color. [Zack] So we're done with step number 10 and we have the whole base...the whole base put up. And I think now we're going to build the arm for the crane itself. So still like the interior stuff, but it should still...it should look much more like a crane when we're done with it. So we're 12 hours into it on step 11. [Music playing] [Zack] Cambry right now is wiring up the cable. [Cambry] Attempting to. [Zack] There's a series of pulleys that she's threading it through. Alright, so three hours later we finally have the arm of the crane done. Going all the way down. [Cambry] Okay, now lift it back up. [Zack] Instruction at it's finest. [Cambry] All-terrain. [Zack] We are currently on step 967, and we will be adding some exterior, some clothing, to the crane. [Music playing] [Zack] Ha ha! Its working! (Music) Now that we've finished one of these, I kind of want the whole fleet of construction equipment. They do some pretty cool stuff. (Electric Motor Sounds) Alright, we are finished. How many days...how many days did that take us? [Cambry] 17 hours. 5 days. [Zack] But it was worth it. 17 hours of entertainment. [Cambry] A week of Lego. It had 1,170 steps. [Zack] But the steps were very detailed. If this fell apart right now, I don't think I'd be able to reconstruct it, but with the step by step instructions, it did make it a lot easier. If I do this again, the crane is pretty sweet and the other construction equipment, but Lego also had a few cars. One is a Blue Bugatti which I think would be awesome to construct. So if you do end up buying one of these Lego technic sets, the price factors into the entertainment of building it, as well as having something afterwards you get to play with and have like as a piece of art. It's kind of like educational entertainment. If you're interested in seeing what kind of Lego technic sets Lego has to offer, I'll put a link down in the description. Let me know in the comments which one you think is coolest and which one you think I should do next. I'm kind of leaning towards the Bugatti. Maybe I can talk Cambry into coming over for that one. [Cambry] It looks cool. [Zack] If you have any questions, leave them in the comments. [Cambry] I think we deserve some like ice cream or something. Thanks for stopping by. I'll see you around. [Zack] Nope! Also not how we do it. [Cambry] What is it? Thanks a ton for watching. We'll see you around.",
    "transcript_keywords": [
        "Lego",
        "Lego Lego style",
        "Lego Lego",
        "Legos Lego",
        "Lego technic",
        "hours",
        "step",
        "Crane",
        "Lego technic sets",
        "pretty",
        "Lego Clips",
        "motor",
        "Legos",
        "steps",
        "Lego Mindstorms",
        "inside",
        "kind",
        "Lego technic projects",
        "technic sets Lego",
        "Lego project"
    ],
    "transcript_entity_values": [
        "79",
        "Zack] Cambry",
        "11 hours",
        "a Blue Bugatti",
        "the next couple hours",
        "Lego Clips",
        "Zack] Look",
        "967",
        "Zack]",
        "12 hours",
        "1,170",
        "Lego",
        "Cambry",
        "two",
        "Small Electric Motor Sounds",
        "three hours",
        "number 10",
        "about 2 hours",
        "5 days",
        "the second half",
        "A week",
        "about 7 hours",
        "144",
        "1",
        "Bugatti",
        "Legos",
        "2 hours",
        "three, hour",
        "half",
        "4",
        "600",
        "7 hours",
        "10",
        "11",
        "Lego Lego",
        "10 and a half",
        "Legos Lego",
        "first",
        "second",
        "Electric Motor Sounds",
        "the first half",
        "school Lego Mindstorms",
        "today",
        "17 hours",
        "143",
        "Harrison Ford",
        "Today",
        "4,000",
        "Zack",
        "One",
        "the Rough Terrain Crane",
        "twenty or eighty",
        "one",
        "the day",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "TIME",
        "DATE",
        "DATE",
        "DATE",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL"
    ]
}