{
    "id": "ytTRj7-PJb0",
    "title": "Gaming room upgrade! New 75 inch LG TV!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-10-16T21:57:05Z",
    "video_url": "https://www.youtube.com/watch?v=ytTRj7-PJb0",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple",
        "lg qned",
        "lg qned tv",
        "qned tv",
        "best tv",
        "4k tv",
        "8k tv",
        "gaming tv",
        "lg qned mini led",
        "lg tv",
        "75 inch tv"
    ],
    "views": 160479,
    "likes": 3881,
    "comments_count": 224,
    "description": "Thank you to LG for sponsoring this video! Click the links here:  ,  to learn more and check out these Black Friday deals now, only for limited time (starting from 11/8 until 11/28): Currys -  JohnLewis -  RicherSound -   #ad #75inchTV #LGQNED81 #BestTV #LGTV     PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE:    GET YOUR OURA RING:    FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:",
    "description_links": [
        "https://bit.ly/LGQNED_iJustine_US",
        "https://bit.ly/LGQNED_iJustine_UK",
        "https://bit.ly/LGQNED81_iJ_Currys",
        "https://bit.ly/LGQNED81_iJ_JohnLewis",
        "https://bit.ly/LGQNED81_iJ_RicherSound",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "https://oura.link/ijustine",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain"
    ],
    "transcript": "- Hey, it's Justine. And as you can see, I'm not in my normal video studio set up. I'm actually in my gaming room because we are nearing the fall season where I tend to spend so much more time in here playing video games. And as you can see behind me, I have a new addition to the gaming room. This is LG's new QNED TV. And we're gonna unbox it and check it out. (chill music) A baby. A baby is here. So I'm putting these legs on. And something that I noticed, this is pretty unique 'cause I haven't really seen this in many TVs. It gives you the option to put the legs here or here if you have a smaller TV stand. And that's pretty great 'cause I was actually concerned that it was not gonna fit on this desk, but so far looks like it's gonna work. This is the LG 75 QNED80. It's a 75-inch TV with a super slim design, Quantum Dot NanoCell technology for great colors. An Alpha 7 AI processor for outstanding picture, sound, and performance complete with ThinQ AI and webOS for NextGen Smart TV functionality. And just a note that depending upon where you are, this TV has a different model name. In the US, it's the QNED80. And in the UK, it's the QNED81. All right, turning it on. Oh man, it looks so good. Okay, I'm gonna have a seat. Just try it out. Just picture this. Type, type, type, working. Game, game, game game, gaming. Turn around, game game, game game some more or I can watch some content. All right, so let's watch some content and then check out some of the features. (upbeat music) QNED is the latest LCD technology, combining a backlit display with Quantum Dot and NanoCell technology to deliver enhanced brightness, deeper blacks and brilliant colors. The Alpha 7 AI processor allows for precise light and color control. It enhances picture details, automatic brightness, and regulate sound volume depending on what you're watching. The Alpha 7 processor also powers Dimming Pro. This is LG's dimming technology that uses deep learning algorithms to produce sharper, more natural images while minimizing halo effect. AI Picture Wizard analyzes 85 million potential settings to find the best photo settings possible and analyzes viewers color preferences to provide personalized display settings. But my favorite part about this TV is how convenient it is to use. The magic remote makes it super simple to navigate ThinQ and webOS making finding content easy. The first thing that you'll notice is how rich these colors are. And again, this is a YouTube video and you are watching this compressed. So it is kind of hard to tell unless you are actually here in person. But from all of the TV reviews that I've done, I think you can get a pretty good sense of how incredible this looks. This really shows you how black these blacks can get. They're so deep that when I'm looking at this right here, like, it actually doesn't even look like parts of the television is on. It's like it's completely not illuminated and it's so impressive. It looks like part of the TV isn't even on, that this glass is just floating in space. It's so awesome. You'll also notice how bright the colors are, how crisp, and how sharp everything is. Now these QNED TVs are a step above the LG LED TVs. So you'll definitely notice if you've ever seen them side by side, that the QNED definitely has a higher vibrancy. And just even the sharpness, everything looks so crisp. Now the way that this is able to get such dark blacks is because of the local dimming. And that's all due to the new Alpha 7 processor, which is powering this entire thing. That's how you get these really dark blacks with no halo effect. I mean, like, look at that. Like, this is so unreal. It's like this is real life. I also love how convenient this TV is. Pairing webOS with this remote is one of my favorite things. I love this about LG TVs. You can select things with these buttons right here. Or if you press this middle scroll button, it actually brings up a little cursor so you can just select exactly what you want. It's super easy to navigate with a quick cards. It makes it super easy to select various things depending upon what you're into, like live TV, gaming, music. And you can even go in here at the end and you can edit them to whatever you'd like. And overall, just the whole webOS interface is really convenient and super easy to navigate. So now, we're gonna set up the Personalized Picture Wizard. And this is gonna use AI to determine your personal picture color preferences. So let's check it out and see how this works. Let's hit Start. Oh, this is so fun. This is like a, which one do you like better? Okay, select up to two images with preferred picture quality among the images. I like this one. I like this one. Wow, these are all really pretty. This one or this one. So this is really cool because a lot of people don't wanna be diving into the settings, adjusting color preferences when you sometimes don't really know what you're doing. So this is allowing me to pick the images that I like, that I think look good. It'll then choose all of the settings for me. It's analyzing. I like a cool and balanced picture. That is actually pretty accurate. 'Cause even when I'm doing my own color grading, I like everything to be a little bit on the cooler side. So here's my before and here's my after. It is kind of hard to tell, but you can see, especially in the water, this is a little bit bluer. The colors are slightly a little bit cooler of a tone even here on this building. And I'm into it. Okay, let's hit Apply now. Let's dive into the audio settings with AI Sound Pro. So in here, you're able to select the different settings. Standard, Cinema, Clear Voice Pro, Sports, Music, Game Optimizer, and then of course with the AI Sound Pro. This is gonna automatically determine the type of content that you're watching and change the sound accordingly. So now that we have our visual and sound all set up and customized to our liking, let's watch something and see how it sounds. (upbeat music) Wow. Okay. And now, I was actually here in the Maldives. I have seen this with my eyes. And seeing it and reliving it again here on this massive TV is pretty incredible. The colors look amazing. The sound is incredible. (upbeat music continues) Oh yeah. I'm so hyped about my new gaming setup. Like, this is gonna be so great. Super cool. Now, let's get into gaming. Since different games have different visual needs, the Game Optimizer allows you to quickly customize the image to whatever you're playing. It has HDMI 2.1, so you can get up to 120 frames per second at high resolutions. And it also supports variable refresh rate technology with AMD FreeSync Premium. Another thing that is so great about this TV is it supports cloud gaming. So all you need is a compatible controller, and you can play the latest PC games on NVIDIA's GeForce NOW app. So here's your Game Optimizer settings. And this lets you change a bunch of different settings. I like that you can just quickly scroll through here depending upon the type of game that you're playing. And it will automatically adjust. I also like this. It has a dark room mode. So if you are playing in a dark room, it will slightly dim so it's not as bright for your eyes. Inside the Game Optimizer, this gives you all sorts of settings that you can adjust depending upon the type of game that you're playing or the way that you like your display to look while you're playing games. So I kind of like the Standard settings, especially for the game that I'm gonna play. This is my game Robot Ranch, which I'm super hyped about. Let's play it and see how it goes. All right, so let's go. We're gonna do a little speed run here and see how it looks and how it's- (indistinct) All right. That's my own voice. Super weird. (laughs) The thing that I do like about this is it has a low latency mode. And this is especially crucial if you're playing first-person shooter games. Oh! I got run over by the pest. So low latency is super crucial, especially in first person shooter games because you don't wanna have a lot of controller lag or screen input lag. And this is working pretty well so far. Oh. - A little dip, huh? (Justine laughs) - No! Okay, yay. Phew. (buttons clicking) Oh yeah, this is running perfectly. This is the first time I've played it on a big screen. This is awesome. I've been having so much fun checking out this TV, and I'm so obsessed with the Game Optimizer settings. Especially for my gaming room, this is so perfect. But of course I do play a lot of video games just right here at my desk. But what's really fun about this is I can also turn around and play on this massive 75-inch display and I can even watch all sorts of content on it as well. Overall, I'm really happy with this TV and it's such a nice upgrade for my gaming room. Thank you guys so much for watching. I hope you guys enjoyed this video. If you wanna get more information about this TV, I'll put a link in the description. And if you have any questions, feel free to leave those in the comments below. And I'll see you guys in the next video. Bye.",
    "transcript_keywords": [
        "Game",
        "Game Optimizer",
        "game game",
        "Game Optimizer settings",
        "settings",
        "games",
        "super",
        "picture",
        "gaming",
        "sound",
        "Optimizer",
        "colors",
        "Justine",
        "playing",
        "pretty",
        "Alpha",
        "color",
        "gaming room",
        "QNED",
        "Type"
    ],
    "transcript_entity_values": [
        "up to two",
        "second",
        "85 million",
        "Cinema, Clear Voice Pro, Sports, Music",
        "one",
        "LG",
        "Robot Ranch",
        "the AI Sound Pro",
        "The Alpha 7 AI",
        "Justine",
        "QNED TV",
        "UK",
        "75-inch",
        "Dimming Pro",
        "LCD",
        "YouTube",
        "AMD FreeSync Premium",
        "ThinQ AI",
        "75",
        "NVIDIA",
        "NextGen Smart TV",
        "2.1",
        "Standard,",
        "the fall season",
        "Quantum Dot NanoCell",
        "Alpha 7",
        "AI",
        "US",
        "NanoCell",
        "Quantum Dot",
        "AI Sound Pro",
        "Maldives",
        "webOS",
        "first",
        "QNED",
        "120",
        "GeForce"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "LAW",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}