{
    "id": "yUwJK5aJYbs",
    "title": "Google Pixel’s Night Sight is revolutionizing low-light photography",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-11-14T17:00:07Z",
    "video_url": "https://www.youtube.com/watch?v=yUwJK5aJYbs",
    "category": "Science & Technology",
    "tags": [
        "night sight",
        "pixel 3 night sight",
        "night sight pixel 3",
        "night sight pixel",
        "google night sight",
        "google",
        "pixel 3",
        "pixel",
        "pixel xl",
        "pixel 3 xl",
        "pixel 3 camera",
        "night sight review",
        "google pixel night sight",
        "google pixel 3",
        "night mode",
        "pixel 3 camera apk",
        "google phone",
        "pixel 3 xl camera",
        "pixel 3 google camera",
        "pixel 3 camera app apk",
        "made by google",
        "pixel camera",
        "photography",
        "pixel 3 night mode",
        "hands on",
        "review",
        "latest updates",
        "technology",
        "apple",
        "android",
        "iphone",
        "verge",
        "the verge"
    ],
    "views": 755030,
    "likes": 17944,
    "comments_count": 1397,
    "description": "Googles new Night Sight mode for Pixel phones lets you capture low-light photos you wouldn't be able to otherwise. It collects data from your subtle hand shakes, instead of just taking a super long exposure, to fill in details that would be lost. Its a huge, game-changing improvement for low-light photography. Now that its available, Dieter Bohn took it to the streets to see what Night Sight is capable of.   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- So the Google Pixel 3, you already know that it has the best camera that you can get on a smartphone today. But, when it shipped, it didn't have one of the key features that Google was talking about. It's called Night Sight and it lets you take photos that normally would look like this, and it turns them into photos that look like this. You get photos that would be otherwise impossible. Now, that sample photos was taken with an early leaked beta version of the Night Sight software. But, the official version is out now in an upgrade for Pixel phone owners and I want to go out and take some more photos. But before I do, I know that my friend and colleague, Vlad Savov has been testing it, and I want him to give me a few pointers. So, let's talk to Vlad. Hey Vlad. - Hello. - So, can you just tell me how this thing actually works? - Now, how it works is you have the HDR Plus system which makes the Google Pixel camera what it is. Night Sight takes that and expands it over this period of a few seconds to get you more light in situations where you basically have almost none. So that means up to 15 frames, or up to six seconds. But, this is really complicated because Google combines a whole bunch of information. So, first of all, when you're metering the light around you, you usually have a static photo. What Google does is motion metering. So it actually takes into account the movement of the phone in your hand if there's any hand shake. It takes into account the movement of the scene around it. And then it does the usual standard calculation of how much light it is in the sensor. Right, so the whole idea is you can take something like a long exposure, like a six second exposure, but Google segments it across frames and then recombines them. - Alright, so it's getting dark. I'm gonna head outside. But before I do, any tips, any tricks, things I should avoid when I try this thing out? - Yeah, the main tip is to actually find genuinely dark areas. So this mode is really designed for night and dark scenes. It will improve the quality of the photo when it has lighting, sure. But, for you to be really blown away by it, for you to get the most out of it, find night, actual night. - Alright, well, we'll see what we can find. I mean, we're in the city here, but there's a lot of haze, so I guess we'll see. (upbeat techno music) So the funny thing is, the Pixel camera's so good that even this light I'm in right now is almost too much to show off Night Sight. But, if I take a photo here. And then I can go to enable Night Sight, and then take another photo. The whole bottom of the photo is basically black, but if I look at the results, you can see that the Night Sight did pick up a bunch of the green that wasn't available there before. But really, what we need to do is go someplace way darker, because we gotta show this thing off. (upbeat techno music) So there's a ferry pulling in, so we'll take a shot with the regular camera. We'll go to Night Sight and it is moving but we'll try it anyway. So I'll hold still. And we can see, in the Night Sight mode, you get the foreground actually coming in. You get the boat all nice and lit. And then on the non-Night Sight, all that foreground is lost, the boat looks fine. And it's more than what my eye sees, so this is a little bit unnatural. But it is kind of interesting, that it's able to pull that off. And I actually prefer this shot quite a bit. That boat is moving, but it managed to maintain some detail on it nonetheless. Alright, it's the next day, we're back in the studio. I just wanna show you a few more of the photos that we took. Because, look at these, they're just filthy. Filthy good, I mean, they're really good. They're the kind of stuff you wouldn't ever be able to get otherwise. Also, Vlad took a bunch of photos, so let's take a look at what he got. - [Vlad] This scene illustrates the best use of Google's Night Sight. You have very little light, it's nowhere in the frame. And as far you and I can tell, all you really have are the outline of the bin and the bench. With Night Sight turned on, you get so much more detail. You get actual color of the leaves on the ground and on the trees. And you actually have a usable photo. So here's an example of a shot where Google's Night Sight is not actually particularly good for. It's a nice shot, but it's really well lit, and there's a moving object in the frame. No matter how sophisticated Google's system is, even with all the multiple exposures and chopping things up into frames, moving objects will get blurred in these situations. The only benefit in this shot, if you look really closely, is the reduction of noise in the dark sections of the sky. - When I first reviewed the Pixel 3, I was really worried that all of the features that Google was adding would turn out to just be gimmicks that I wouldn't use. But that didn't really turn out to be the case. I use them a lot now and I think the same thing is gonna be the case with Night Sight. And I actually asked Vlad about that yesterday. - Well, as far as I'm concerned, it's not a mode. It's almost having an entirely new camera in there. I mean, we've seen things like DXO, the guys who do all the camera benchmarks. They did an attachment for the iPhone, which costs hundreds of dollars, and it did basically the same thing. Night photography, improved night photography. Google's Night Sight does that exact same thing, but just does it through software. - I think that's exactly right this night mode thing, it really is like having a weird extra single purpose camera in your pocket at all times. You're not gonna use it every day, but when you need it, it's going to be there, and it's going to work way better than you expect, and I think it's kind of amazing. And what's most amazing to me is this is year three of the Pixel, and if they're pulling this off right now, I cannot wait to see what they're gonna do with the main camera software next year. Hey everybody, thank you so much for watching and I wanna know, if you had this mode on your phone what kind of pictures would you try and take with it what kind of stuff haven't you been able to get before? Let me know in the comments. And then head over to Verge Science because they have a dope video about supersonic air travel, it might be coming back. (imitates jet plane flying)",
    "transcript_keywords": [
        "Night Sight",
        "Google Night Sight",
        "Night",
        "Sight",
        "Google Night",
        "Google",
        "Google Pixel",
        "Night Sight mode",
        "called Night Sight",
        "Google Pixel camera",
        "Night Sight software",
        "Pixel",
        "Vlad",
        "enable Night Sight",
        "Night Sight turned",
        "photos",
        "thing",
        "camera",
        "photo",
        "Pixel camera"
    ],
    "transcript_entity_values": [
        "next year",
        "Night Sight",
        "the next day",
        "yesterday",
        "today",
        "Google",
        "six",
        "this night",
        "night",
        "3",
        "Verge Science",
        "Vlad Savov",
        "hundreds of dollars",
        "supersonic air travel",
        "second",
        "the Night Sight",
        "first",
        "iPhone",
        "up to six seconds",
        "year three",
        "up to 15",
        "DXO",
        "Vlad",
        "a few seconds"
    ],
    "transcript_entity_types": [
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "TIME",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "ORDINAL",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "TIME"
    ]
}