{
    "id": "yUZq6BPRZ-M",
    "title": "Can Sony make glass sound GOOD? - LSPX-S3 Glass Sound Speaker",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-05-28T17:55:30Z",
    "video_url": "https://www.youtube.com/watch?v=yUZq6BPRZ-M",
    "category": "Science & Technology",
    "tags": [
        "Sony",
        "Glass",
        "Organic Glass",
        "Speaker",
        "LSP",
        "Tweeter",
        "Bluetooth",
        "Wireless",
        "Audio",
        "Subwoofer",
        "Bass Boost"
    ],
    "views": 712359,
    "likes": 34010,
    "comments_count": 2019,
    "description": "The Sony LSPX Glass speaker is their most unique Bluetooth speaker with its candlelight shape appearance and glass tweeter. The sound is relatively decent, but it's probably one of the most aesthetically pleasing speakers we've seen so far.   Check out the Sony LSPX-S3 Glass Sound Speaker on Amazon at   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - Change my mind 0:20 - Unboxing 1:20 - Overview and first impressions 3:45 - App first impressions 6:00 - Touch controls 6:32 - Speaker impressions 7:21 - Pain 7:48 - More speaker impressions 8:50 - In-depth thoughts 10:03 - Bass mode impressions 10:35 - Sine sweep test 11:30 - Final thoughts",
    "description_links": [
        "https://geni.us/ORAaq",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- I initially thought it was a really, really stupid idea to have just a regular Bluetooth speaker with a candle on top, but what I learned is that the glass on top is actually part of the speaker system. So, I went from thinking this was a really stupid product to actually something that seems quite exciting. (box opening) Got a little strap in here. (paper rustling) Oh my god, look at that. - [Jono] Ooo! - It's certainly a lot girthier than I expected. I'm a little intimidated, honestly. It's really, really heavy, too. See what else we got in here. - [Jono] Whoa, it turned on! (Jono laughs) - [Dan] Oh my god, that's, uh, that's pretty bright. It's like a one-piece unit in there. Oh, and it even reflects up off the top of the little glass tuby thing. Okay, we'll just leave that over there. (Jono laughs) - [Jono] It's gonna burn you, Dan. - [Dan] Okay, we got a charging cable, USB-C, that's really nice. Nice fabric wrap on this. Bunch of instructions. It's a glass speaker. What's this? Ooh, comes with a cleaning cloth. - [Jono] Oh, you're gonna burn it. - Oh. I think it's just a light in there. Don't need that. (mumbles) (mumbles) Okay, so everything we need here. They call it an organic glass tube, and I don't really know what that means. It's plastic. You can hear that. I don't really understand why they would call it organic glass when it's just plastic. One of the interesting things about this is, it's got two speakers inside the unit. It's got this down-firing larger driver, which probably makes up most of the base here. So, you have a separate mid driver, and then you also have a tweeter that is attached- (speaker chimes) - Stop it. Attached to the plastic organic glass, uh, tube at the top here. So, instead of having a tweeter that fires up or 360 degrees around, this entire glass tuby thing, \"glass\" tuby thing, acts as your tweeter, which is, uh, actually quite exciting. - [Adam] Do you wanna weigh it? It's supposed to mimic, like, a candle? - Yeah, but the tube is actually the tweeter. - Oh, no way. - So, it's like they went, \"Okay, we'll make a giant tweeter\", and, \"Wow, this is kinda boring. I know, we'll put a candle in it.\" - It's kinda like, I-I, it's kind of, like, uh, vacuum tubes. Like, I Love Amp's, they have the vacuum tubes that glow when they're on and stuff. I think that's a nice aesthetic. This is, kind of, less of a nerdy version of that. - Yeah, I think they turned something that they designed from a technical standpoint into something that's more of an aesthetic piece. Uh- - Do it sound good? - I don't know yet. - Well, I ain't got time. - Okay. - So have fun. - I'll let you know. - Okay bye! - Yes. - Love you! Mwah! - Mwuah mwuah muwah. 1.111 kilograms. Two and a half pounds. Hefty. Good bludgeoning weapon. - [Jono] How does it connect? - Believe it's only Bluetooth. Doesn't look like it's got any auxiliary end, so you can't pass around the aux cord. Power button on the side. It's got a phone connection button, and it looks like you've got your volume adjustment here, too. One thing that did irritate me was that the Bluetooth connection button and the- I guess it's, like, a timer's off mode thing here, on the bottom. So, if I wanted to interact with it, I'd have to pick it up and, and repair it. I don't know why those couldn't be on the side. Just an aesthetic consideration, who knows. It takes 5 volts in, through this USB-C charger. So, theoretically, you could leave this plugged in all the time, but it is battery powered. Uh, Jono tells me that it's got 8 hours of battery life. I can imagine that you would fit quite a large battery in here, but I also believe that most of this internal volume is just the down-facing driver. This, uh, little fabric around the outside of it is where that downward-facing driver is gonna shpread the sound out. The speaker comes with an app called Sony Music Center, and it's already found it. I didn't even have to put it in pairing mode. I think it's already started in pairing mode, and it's come up here, so it wants set up, so let's do the set up. There it is. We're going to pair with it. Do you think it'll bing? - [Andy] Bing! - That was, that was Andy. (phone beeps) It did bing! There we go. Setting complete. There we are, the LSPX-S3. I think Bluetooth, initially, was not ever designed for high quality audio transmission. The new standards, I believe, are really pushing for high quality audio, and I guess LDAC is a Sony proprietary transmission. I see this Group with other speakers button, which is really exciting 'cause if this had been good, I would have absolutely loved to have a pair of them. To use them as actual speakers, and it looks like it supports that. - [Andy] Or you can make a lamp. - Yeah, we could glue five or ten of them together. I'm sure Sony would enjoy that. Uh, we got Party Connect: change anywhere to a party room with more powerful sound. So, I guess you could put 30 of them in a room and just murder people with the audio quality. But the stereo connection is what's most exciting, in my opinion. - [Jono] What makes it so exciting? - Oh, 'cause if it's a good speaker- they're small, they're weighty, they feel good. It would be nice to have a very simple Bluetooth connected stereo system that needs no wires. The app installed easy. It didn't make me make an account, which I would have just deleted it instantly. We got settings for the device itself. We got some sound settings. It's got a bass boost mode, so you can turn it into a Beats by Dr. Dre. Illumination setting. That's right, it's got a light in it. - [Jono] That's insane. - So, it's got lighting mode. And let's go candlelight mode. - [Jono] Romantic mode? - [Dan] Romantic mode. Oo! And we've got flickering. We've got delicate. Middle. - [Jono] That's lame. - [Dan] Middle flickering. (phone beeps) Bright? It beeps when you change it. (chuckles) Links with music. Oh, we're definitely doing that. Sleep timer, power options, auto standby, (with Irish accent) Bluetooth standby. I don't care about any of that. Touch sensor. So, I don't know, when you fondle it, does it, like, get annoyed with you? 'Cause it'd keep coming on when I was touching it, right? Oh, that's right. There's a little touch bar here that allows you to adjust the brightness. I think it's probably when it's in the other mode. (light beeping) Bim bum bum! Bum bim bim! Bluetooth connection quality. Prioritize sound quality. Yes, we definitely want that. Are we gonna measure it with our measuring measurer? I mean, it's intimidating, and so are the bananas. I got 'em at lttstore.com. Let's see. The glass tuby thing is, like, one banana. If you want to spend extra money, you can get them in a different color from lttstore.com. Should we listen to it? - [Jono] Yeah! - Woo! - [Jono] Let's put some crab rave, dude. (electronic music plays) (music stops) - (censored) (Jono laughs) Right at the drop! You stupid (censored)- (music starts playing) There you go. Man, that's pretty good. That's t-top volume. (music no longer playing) I'm honestly not too sure where the high band's coming from, because when I move it around, it's sort of coming from here, but the speaker's real emitty, like there's not enough high band. Whatever they've done with the not plastic tube is not as nice as I was hoping for, especially for 350? That's moving in there. - [Jono] Waa! - [Andy] Aah! - [Jono] Woa! - [Andy] Ah, no! - [Jono] Oh my god! - [Andy] Dan, don't! - Interesting. It's, like, held in with some sort of- (tube squeaking) something. - [Jono] Oh! Woa! - [Andy] I hate that sound. Stop! - (chuckling) It's a good sound, isn't it? - [Andy] Stop! - (laughing) Everybody's screaming. - [Andy] No! Does it come off? I feel like this would just break, in, like, 6 seconds, if this fell over. - [Andy] Ah! (tube squeaking) - Ha ha! He's wearing headphones. He's dying. Okay, let's get rid of the desk pad and give her another go. (electronic music plays) What? No change. (electronic music continues) (music stops) I don't know. Putting your hand on this, because it's supposed to be designed, like this is the tweeter, right? It doesn't really change the sound too much. It's a $350 Bluetooth speaker? - [Jono] Mhm. - It's sad. It's kind of sad. Especially if this is all max volume. I would want to be in physical pain. It's pretty, though. I don't know. I don't know. I'm gonna try one of my reference songs, that you can't use in the video. (electronic music plays) (music stops) Well, I think I know what's going on at least. There's a lot of really low bass, and we can feel that when the table moves and when there's a kick drum, and stuff like that. But, the mid-band, where this speaker here is, I guess, is just weak. When the whole song, sort of, filled out, it's just sort of sad. There's not enough, I guess, full body. You know what I mean? - [Jono] Yeah. - It's a watered down beer. I'll put it that way. - [Jono] Does it sound like some laptop speakers? - Hell no. This is very, very good for, like, a Bluetooth speaker. Problem is, it's 350 bucks. I mean, 50 bucks- I would definitely buy one of these for 50 bucks. Um, I'm concerned about this. I want to be holding it from here. The whole thing is bending. Picking it up is, is super awkward, and now I'm pushing all the buttons, 'cause they're here. Maybe that's why they put them on the bottom. I don't know. Uh, but- - [Andy] Ah, euh, ah! (tube squeaking) - You know, it's too heavy to have this as a- plastic. I mean, even as a- (speaker beeps) Shut up. Even as a glass, um, I think I would be concerned. I would really like a way to remove this. Oh, yeah, it's got bass boost mode. That might actually fix the whole thing, wouldn't it? Okay, uh, should we play it and try changing the sound while it's playing? (electronic music plays) - [Jono] What (inaudible). - That's bass boost mode. Normal mode. Bass boost mode. Okay. (music stops) That actually sounds a hell of a lot better. 'Cause, the, like, super low frequencies are still there, but the bass boost mode seems to be adding the ones that I think were missing, instead of just making everything worse, like I really expected. Let's do a sine sweep, see if we can hear when it starts, then we can get a perfect idea of exactly- - [Jono] What is, what is sine sweep? - So, this is just playing a pure sine wave, which is, like, the purest tone that you can do. And it's going through the entire frequency spectrum. Um, it's logarithmic, so it goes nice and even, but the frequency's increasing a lot faster. So, it started, like, 45s. That's really nice and bassy. And, what we're listening for, when we do a sine sweep, is, uh, the exact same level of volume through the entire frequency range. So, right now, through 45 to about 110, that it's at now, it's rising in volume. You can here that from over there, right? And now it's getting even louder. And then, there was a bit of a dip at 160 and another dip at 180. (high tone) 1000. There's a massive dip right there at 1600. Those, those highs are good. That's really good. So, it's got some weakness in the mid. Um, I'm not gonna take it any higher, 'cause we're all gonna go goddamn deaf, but I would say, for 350 bucks- (sighs) It's such a hard maybe. If you had no music in your place. If you had no living room stereo. If you had no bookshelf speakers. If you didn't have anything besides your phone. And you wanted something to listen to music, at a reasonable volume, at a reasonable level of quality, I'd say, for 350 bucks, this would be a really, really nice option. It's aesthetically pleasing. It's not gonna get full of dust and garbage, 'cause the top is nicely covered. Um, it seems well built, except for- (tube squeaking) - [Andy] Ah stop! (Dan chuckles) No! Don't! - Except for that. I wouldn't recommend it if you had kids, 'cause it's gonna be broken in, like, 8 seconds. The $400 space is really difficult. Uh, from the cheap crap, to $20, up to, like, $100 or more, uh, you also have a massive, massive market. But the $400 range is, sort of, where you start to get into good quality products. And, if you're looking for a speaker in the range of $300 to $400, or a pair of headphones - I would probably put them in the same category - you're gonna have to do a lot of research. And you're gonna have to, probably, go to a place and try a whole bunch of them, rather than just going, \"This one looks nice.\" Because the difference in quality you'll get, for the $400 range, is incredibly large. - [Jono] Until we get ltt labs going. - Then we'll just tell you, and you can buy what we tell you to.",
    "transcript_keywords": [
        "mode",
        "Bluetooth",
        "regular Bluetooth speaker",
        "Bluetooth speaker",
        "speaker",
        "glass",
        "good",
        "bass boost mode",
        "sound",
        "glass tuby thing",
        "nice",
        "boost mode",
        "thing",
        "quality",
        "speakers",
        "put",
        "volume",
        "regular Bluetooth",
        "tuby thing",
        "tweeter"
    ],
    "transcript_entity_values": [
        "5 volts",
        "400",
        "Group",
        "1600",
        "One",
        "five or ten",
        "one",
        "Bim",
        "20",
        "$300 to $400",
        "160",
        "Dan] Middle",
        "45s",
        "Two and a half pounds",
        "Andy",
        "350",
        "Irish",
        "max",
        "360 degrees",
        "8 seconds",
        "Jono",
        "50",
        "Sony Music Center",
        "350 bucks",
        "100",
        "Bluetooth",
        "Sony",
        "180",
        "two",
        "Andy] Bing!",
        "350",
        "30",
        "Andy] Dan",
        "6 seconds",
        "1.111 kilograms",
        "45",
        "Dre",
        "1000",
        "ltt labs",
        "USB-C",
        "LDAC",
        "8 hours",
        "Dan",
        "50 bucks",
        "about 110"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "NORP",
        "PERSON",
        "QUANTITY",
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "MONEY",
        "CARDINAL"
    ]
}