{
    "id": "yVcjVsk29XQ",
    "title": "Building the Brains of a Low Voltage System - Electric Hummer Conversion",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-08-25T13:45:03Z",
    "video_url": "https://www.youtube.com/watch?v=yVcjVsk29XQ",
    "category": "Howto & Style",
    "tags": [
        "Electric hummer",
        "ev conversion",
        "ev humvee",
        "electric hmmwv",
        "hmmwv",
        "uqm 220 plus",
        "12 volt system",
        "low voltage system",
        "tesla",
        "rivian",
        "Ford",
        "electric truck",
        "cybertruck",
        "low voltage components",
        "ignition",
        "how to wire key",
        "how to wire EV conversion",
        "electric vehicle",
        "electric hummer",
        "hummer ev truck"
    ],
    "views": 1442458,
    "likes": 66761,
    "comments_count": 3812,
    "description": "Its time to wire up the 12 Volt System inside my Electric Military Humvee.  Get your first month of KiwiCo for FREE!!:   We've accomplished a LOT on the Electric hummer, our electric motor and drive train are installed, and now its time to get the electrical working. Every electric vehicle has a 12 volt system. Just like a gas powered vehicle. The 12 volt system runs the headlights, windshield wiper motor, and all the accessories. Only the electric motor runs off of the super high 450 volt batteries.   Watch all the EV Humvee build videos in order HERE:   Get my razor knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.kiwico.com/JerryRig",
        "https://youtube.com/playlist?list=PL0vZL9uwyfOFezIOiBjkdW3TTdn0Q_AKL",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today we're going to start building the brains of the 12 volt system going inside of my military Humvee..the one I'm turning into an electric vehicle. What we're going to build today is the tree trunk of the 12 volt system that will supply power to everything through it's branches. This video is sponsored by KiwiCo. More on them later. The 12 volt system is going to be running everything not connected to the propulsion system inside of the Humvee The propulsion system will be powered by these guys 450 volt worth of Tesla battery modules. Electric vehicles have 2 systems, because if you tried connecting your headlights and windshield wiper motor to 450 volts...well...they wouldn't be headlights and windshield wiper motors for very long. You're much better off using a 12 volt battery for all of that stuff. Keep in mind as well that I'm not an expert in this. This is the first electric vehicle that I've built, so this will be a learning experience for the both of us. We'll start off with the battery, some relays, a breaker for the main power switch, the ignition, and a fuse block. As well as this guy. This is the DC to DC converter. This guy is going to be the bridge between the high voltage and low voltage system acting as kind of the alternator, taking that 450 volts, changing it into 12, and then charging our battery. This should be pretty interesting. Let's get started. [Intro] The flow of this video is going to be a little different because instead of taking something apart, or, you know, dismantling something, we are creating something new. And it's something that I've never done before so there's going to be a little bit of guessing and checking as we go forward. As we wire up the 12 volt system inside of this hummer, there is one thing we do have to remember though. Not all wire is created equally. Like it's not all created for the same stuff. You've probably heard of different gauges of wire. Gauge means how thick the wire is, you know, 18 gauge, 12 gauge. As the number goes down, the wire gets thicker and the more power it's able to handle through itself as it's connecting a power source to the load. For example, here is some 4 gauge wire with some copper in it, and then we have some 10 gauge wire which is thinner. Then we have 12 gauge, 16 gauge, and then some super super thin wire which I think this is like 20 gauge or something. But way down here on this end we have something called 2 aught wire, which is actually below zero gauge and it's super thick. And just for kicks and giggles, here is some 4 aught wire that's used to push some major pixies. You might have noticed as well that there's tons of tiny little copper strands inside of each of these cables. Well it's for two reasons. Electricity doesn't run through the copper, it actually runs on the outside of each of those tiny little strands. So the more strands there are inside of the cable, the more...the easier it is for electricity to flow through it. As well as, in automotive situations you don't want to use a solid strand wire because the wires inside of a car are always bouncing and flexing and the multiple strands give it more leniency before, you know, it breaks or snaps in half. And I'm definitely not the expert in any of this stuff, I'm just repeating what I read on the internet. So as I'm wiring up the 12 volt system, I have to take into consideration the thickness as well as the length of wire that I'm running. The longer it is between the battery and the load, the thicker the wire has to be, because as it gets farther away, the resistance of the wire goes up and the heat goes up. And I can show you an example over here. So this extension cord is a super super long extension cord that I was running to our barn. The problem was is that I attached another extension cord to this extension cord and the load on the end, since it was so long, the load on the end got super hot and melted the end of this cord. Which is why the farther away you get from the battery, the thicker the cable has to be. Luckily all wire comes with amperage ratings as well as the distance for how far it can carry a certain amount of voltage. Basically we're trying to keep this from happening inside of the hummer. Now the start of the 12 volt system is, of course, a 12 volt battery. This is just a regular truck battery that I've had for a while and it is going to sit down here in this compartment which is exactly where the 24 volt system from the Humvee used to reside. The reason Humvee use a 24 volt system, which this isn't really important to my video, but you can accomplish more work as the voltage goes up. What a 12 volt system can accomplish with 10 amps, a 24 volt system can accomplish in 5. So the higher the voltage, the less currant needs to be going through the wires which also lowers the heat and makes things...you can use thinner wires at that point as well. There's a lot going on. Now in order for me to run power to the 12 volt system, we need a bunch of 12 volt components, one of which is this relay. And I'll explain about what all of these do in a minute after I build this enclosure. But we also have busbars, we have a fuse block, and we have a breaker, which is going to take the power from the battery and distribute it to everything that needs power inside of the Humvee And all of that is going to be mounted to this 1/8th inch thick ABS plastic sheet. Now this plastic sheet does bend a little bit in the middle because of how long it is. But ABS is pretty easy to work with and I can just heat up along this end and bend it at a 90 degree angle which should stiffen the whole thing up. I like ABS because it's easy to work with. It won't melt on a saw blade when it's being cut and it's pretty easy to reshape and bend. I can use a heat gun to get this 90 degree angle. Or, you know, fire. Just enough heat to get it hot, but not enough that it actually ignites. Then we can shape it how we want, and when it cools down it stays there. So now, with the top and bottom both bent at at 90, it doesn't flex as much in the middle. Let me show you where this is going. And so right here is where I'm going to mount this plastic plate once I get the fuse box, relays, and busbars in place. So I'll explain relays more in a minute, but the middle wire is an always on connection which is something that we don't need in this particular set up, and so I'm just going to remove that so we don't have to deal with it. All the components on this board are pretty close together so any space we can save is a good thing. So this is underneath the passenger seat and right now we kind of have some wasted space over here in the corner. So what I want to do is bend this here and make a compartment for the battery so we can mount all of the electronics on that wall where they can go through the wall and power all of the other components. But in order for us to do that we have to drill out some rivets, then bend that piece of metal and then rivet it back into place. [Sawing and drilling sounds] Now there's much more room for activities. So along this wall should go most of the 12 volt control panel and this could be a little cubby for tools or something. The problem with this control panel is that there are so many different ways of doing it and all are correct, that it's difficult to settle on just one. But if we wait until the situation is perfect, nothing will ever get done. So we're just going to pick a design and go with it. [Drilling sounds] So one of the coolest things I've seen recently are these soldered seal connectors. They are a piece of heat shrink tubing with a piece of solder in the center of it. So when you have two wires that you need to connect together instead of crimping them, you put them into the center here, kind of mesh the metal ends together, and then apply a little bit of heat with a heat gun or a lighter and that causes the metal inside, the solder, to melt in between the little strands of wire and make a really solid connection. [Heat gun sounds] I have this strand right here that I connected together. And even pulling as hard as I can, that's not coming apart. Literal metal jointed together. So as long as there are no little strands of wire poking through the heat shrink tubing, than I should be fine with all of these connections on the back. This control panel is kind of going to be the whole brains of the 12 volt system. Kind of like the trunk of a tree, all of the 12 volt power has to come through this board before it gets divided out into the branches or the different locations where it needs to go. And if you think this low voltage control board looks intense, wait until you see the high voltage stuff. Alright. Now all the relays have power. I'll still explain what all of these do in a minute, but basically the power comes in through here, powers the fuses, the relays once I bridge this gap, there will be another fuse box here, and now all of these have power for when the signal comes in. Now's the time to wire those up. So for the signal wires and the power outs, I'm going to use these kind of busbar looking things. They are going to sit right here and these wires will clamp into this side, and then the wires going out to the hummer will clamp into this side. Makes it a little more modular and easier to repair down the road which is the kind of thing we like. I'm still going to explain what relays do in a minute, but now we have all of the white switch wires wired up and we can wire the load wires which will take me a couple minutes and you guys just a second. The blue wires are what's taking the power from the battery after the switch gets flipped, but I think it looks pretty good. One thing that's made this job a whole lot easier are these wire strippers. Basically they just grab a wire, pinch it, and then strip the tip off. They are super inexpensive and save a whole lot of time along with these crimpers. They have a different color at the end that you can just squeeze and crimp. And that color coincides with the pretty standard coloring of these wire connectors. So I think now is a good time to talk about how a relay works. It took me a while to mentally grasp the concept of a relay. But in my mind it makes sense that a relay is a very small switch that activates a larger switch. And I've taken apart a relay here so we can better visually comprehend how that happens from the inside. So the most common relays are 4 or 5 pin relays, and I have a bunch of 5 pin relays here which just means that there's 5 wires coming out the bottom. And if you remember, I removed the middle wire of my control panel because I don't need it. The middle wire would just be an always on, so when I said that this is a small switch controlling a larger switch, I mean that these two wires are headed to that first small switch. And when this circuit is closed or the switch is flipped, than that sends power to these larger wires, which powers a larger component, like the power steering, the radiator fans, or this water pump. It makes more sense when you can see it. So I'm going to take this relay that I've taken apart, and put it into a wire harness. Remember that we have the switch wires as well as the load wires which sends more power into whatever the switch is controlling. Once that's popped into the harness, I can take a quick look at the little crude circuit with the wires from the battery. And watch what happens here as I connect the battery to this circuit. So when the relay is sitting unpowered, this little gap right here is not bridged. But as soon as we add a very small amount of power to it, that gap closes and then the power is flowing out of these two larger wires. You can use fuses for the smaller things and relays for the larger things. Things that require a lot of power in order to operate need a relay. And this might make more sense when it's connected into the vehicle, but here I have my relays, which this one's going to the ignition. So this white wire, as soon as it receives 12 volts of power, it's going to click that little circuit inside and send a lot of power out through this blue line that's coming from the red line over here into this fuse panel. And this is how we get our keyed accessories turned on. This panel only lights up when the key is in the run position. And then when it's in the run position I can send power to these relays here that also are only supposed to operate when in the run position, like the power braking or the steering. It's a little sophisticated system of wires that all take the power from the 12 volt battery and distribute it where it needs to be. I put the switch lines and the power out lines on this little busbar type of thing so it's more modular and easier to remove the lines coming in. And a quick look behind. These are all the high power running to the 12 volt battery and then these are all the grounds, connected together, wrapped around, and attached here, which is going to go to the negative battery terminal. The reason I can connect all of the grounds together into one wire is because to switch this relay on only requires about .15 or .2 amps to manipulate the switch. So even by connecting 6 relays together, there's only one amp going through that wire with all 6 switches flipped...if that makes sense. And a relay can power anywhere from 30-60 amps depending on the relay, all with that .2 amp little tiny switch. It helps us avoid that fried wire situation we talked about at the beginning of this video. We can use shorter and thinner wires to power the relay and then use shorter lengths of wire for the accessories that need powering the higher power accessories. Shorter wires equal less heat, which gives us less probability for things starting on fire. So in summary, a relay is a small .2 amp switch that operates a much larger 30-60 amp switch, which keeps the vehicle safe. Now let me show you what a fuse does. So normally this fuse is helping to protect the wires down stream of it. So right now I have this hooked up to the positive end of the battery and this is going to be the negative end of the battery. Now if there's something normal attached to this, like let's say the headlights or the blinkers or something, the electricity will flow up this arch and down the other side without any problems. But if there's a problem down stream, and this grounds out of the frame, or the device starts malfunctioning and pulling a ton of power, then instantly...whew that scared me! Then instantly this bridge in the center will break, and it will cut the connection between the battery positive and the rest of the system, protecting the wires. For reference, this right here is the fuse for my 400 volt system, and this is one I will not be exploding...at least not intentionally. So as I'm mounting the battery underneath the passenger seat right here, remember the control panel's going to go over here, there is a small...shadow's in the way...probably half an inch gap between the bottom plate of the battery and the floorboard that need to fill so the battery is, you know, securely mounted. So I got on the internet for a minute and looked around trying to find something that was half an inch thick, a piece of plastic, a piece of rubber, turns out my gym floor mats are the perfect thickness. Should work. Perfect. Now the rubber pad is installed, the battery is installed, and I have room to remove the battery and spin these two little plastic hold downs. And of course, I will still bolt down the plastic plate for the battery. But at least it's solid. So right now we're going to work on mounting the control panel in underneath the passenger seat, and we're going to do that with 4 gauge wire. Wire is interesting because like I showed you earlier, if it's not thick enough if can heat up and catch on fire and we're trying to avoid that. I have this handy wire diagram here that shows me all the different lengths and gauges of wire and how much power they can handle. So hopefully that reference will help keep fires from starting underneath the passenger. First thing, we're going to take a razor blade and slice around the rubber insulation that's surrounding the copper stranded conductor. Then I can take my wire terminal ends and put them inside of my crimper. The hydraulic crimper is able to put 70 kilonewtons of force onto the terminal ends which creates a good connection between the copper wiring and the tin connector. The terminal is also made from copper, it just has a layer of thin around the outside which helps keep it from corroding. Normally you're also supposed to have some heat shrink tubing already placed on the wire before you put the terminal on, but luckily these terminals are pretty slim and I can fit it over the opening. This particular type of heat shrink, once I get it on, has glue on the inside, which helps keep the heat shrink attached to whatever it's covering and helps keep all the water out. You can see some of that glue peeking through the edges right there. So I've already taken the negative battery terminal and routed it over here up to the frame where it's going to be the frame ground, which means that it will be able to complete other circuits by just attaching ground wires to the frame and letting the electricity flow through the frame itself. And the control panel is kind of going to work the same way. We're going to stick it through the grounding wire so they both have a good connection with the battery over here on this terminal. Then we can take the control panel, feed the ground cable through the hole I drilled earlier. Goes right here. And I'll be able to connect it right there. And we'll get the 12 volt hooked up in a second. Right now there's no power going through this. Looks good. So this bank of the fuse panel is going to light up once the ignition turns on this relay. And then this bank on the fuse panel is going to light up constantly because it's connected with this breaker going to the 12 volt supply...which is over here. [Drilling sounds] So now we have the 12 volt control panel mounted underneath the seat. We have this clear tubing acting as kind of like a spacer cuz it won't compress passed a certain point as I tighten this down. And I can loosen up the super long bolts to give me access to work behind here. And since it can pull away from the wall like that with the super long bolts, it gives me access to push wires through and attach them to the fuse panel. Since, you know, this beast is probably going to be a work in progress for quite some time. And now that it's mounted, we can wire up the 12 volt power to the breaker. [Heat gun sounds] You might have noticed by now that I'm filming a couple videos about this project simultaneously. So even though it's been a couple seconds there have been some updates to this panel. I've changed things so that this entire panel now lights up with the key, and this entire panel is just always on. That way the components that always have to have power like some of my high voltage components can receive that through this tree of electricity. Ever since I was a little kid I've been told that the brain is a muscle and if you don't use it, you lose it. And just like any muscle, the brain needs to work out and solve hard problems in order to grow, which is one of the reasons I like KiwiCo. Huge thanks to KiwiCo for sponsoring this video. KiwiCo is constructive entertainment. They inspire kids and people of all ages to see themselves as makers. They provide fun monthly hands on projects designed to expose kids to concepts in STEM science, technology, engineering, art, and math. And the kits they provide are great for learning at home. KiwiCo offers 8 subscriptions lines catering to different age groups and topics, from toddlers to teenagers and also adults. The monthly crates are designed by experts and teaches kids through hands on projects. My wife has been giving these monthly subscriptions out as gifts for the past couple years. My favorite is obviously the Maker Crate like this one that we're building right now that teaches the basics of hydraulics with a claw. I'll leave a link down in the description so you can get your first month for free. It's an easy way for kids to learn at home and have a well rounded skill set for when problems arise in the future. Learning and expanding your mind today makes tomorrow's problems easier. That free first month with your subscription is down in the description. And speaking of tomorrow's problems, in the next video we'll be finishing off the 12 volt system, installing the headlights, ignition, and other small things before we move onto the big boy components in the high voltage video. This whole thing is just a giant puzzle. As always, hit that subscribe button if you haven't already. Turn on notifications. Come hang out with us on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "wire",
        "volt system",
        "power",
        "wires",
        "volt",
        "battery",
        "system",
        "volt battery",
        "relay",
        "panel",
        "switch",
        "relays",
        "military Humvee.",
        "control panel",
        "heat",
        "gauge wire",
        "inside",
        "volt power",
        "fuse",
        "Gauge"
    ],
    "transcript_entity_values": [
        "about .15",
        "first month",
        "12 volts",
        "90 degree",
        "6",
        "8",
        "Instagram",
        "two",
        "20",
        "16",
        "Humvee",
        "tomorrow",
        "a couple minutes",
        "Humvee",
        "DC",
        "a minute",
        "450 volt",
        "half",
        "only one",
        "a ton",
        "4",
        "monthly",
        "zero",
        "control panel",
        "10",
        "a couple seconds",
        "12 volt",
        "5",
        "some 4",
        "Tesla",
        "first",
        "some 10",
        "second",
        "30-60",
        "24 volt",
        "18",
        "today",
        "this 1/8th inch",
        "First",
        "90",
        "12",
        "Today",
        "One",
        "Humvee",
        "450 volts",
        "70 kilonewtons",
        "the past couple years",
        "half an inch",
        "one",
        "Twitter",
        "400 volt",
        "2"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "TIME",
        "ORG",
        "GPE",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL"
    ]
}