{
    "id": "ywAXzDKjc-M",
    "title": "The Cost of 1 Million Followers.",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-12-26T17:11:22Z",
    "video_url": "https://www.youtube.com/watch?v=ywAXzDKjc-M",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "tik tok",
        "tiktok",
        "hype simulator",
        "influencer",
        "how to get followers",
        "youtube",
        "instagram",
        "twitter",
        "followers",
        "subscribers",
        "Austin evans house",
        "house fire"
    ],
    "views": 81052,
    "likes": 5188,
    "comments_count": 182,
    "description": "Ever wonder what it would be like to be TikTok famous?! This Camera is INSIDE the Screen - ZTE Axon 20:  Trying $30 AirPods Pro from WISH:  You Should(n't) buy AirPods Max:  Opening a $500 pack for a $5000 Pokemon Card!  The End of the PS4:   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/DMjE_z-Hm6E",
        "https://youtu.be/fruqbEGQ92M",
        "https://youtu.be/sXGzHgrmOs0",
        "https://youtu.be/6DYslBz755s",
        "https://youtu.be/iSUQ67_cfiU",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome to This Is. Austin, no you guys, have you ever wished that you had millions of followers on TikToK? - MySpace? I hear that's big with the kids these days. - I miss MySpace more than certain relatives. I loved MySpace, but that's not what we're here for today. - Okay. - We're here, because there is a revolutionary app that is flooding the app store. But it was like the number one app for a while. - Okay. - And it's called... - Tiktok? - Instagram? - No. - YouTube? - No. - Twitter? - Facebook? - All of the above. It's called Hype Simulator, it's not a game, it's literally just a fake version of TikTok. - [Austin] Okay. (baffles) - I'm going viral right now. (clapping) (laughing) It's- - That was your mom liking your tweet, I know that's what happened. (laughing) - So, all of this is a fake version of TikTok. - Okay. - Where bots comment on your video. - Okay, let's try this, I need to know. - [Presenter] So I'ma let you... Just go through. - [Austin] Alright, okay let's get started. Okay, so any username. Okay, my username is thiswasmatt. - Thiswasmatt, okay. - [Austin] I wanna be a celebrity or going viral? I wanna be a celebrity. - It is actually different being a celebrity versus going viral, because- - I wanna be a celebrity. - Yes celebrity I believe you start off with like a much higher base. - Okay. So I'm gonna go ahead and take a photo, right here. (camera shutters) Okay. Wow I've got 1.5 million followers, Oh my God, look at all these people who are following me, this is incredible. - So immediately within 30 seconds, you have 1.5 million followers, so the title's not clickbait, right? - Give me some tips please. Subscribe to... Oh God, Linus. - [Presenter] Okay, what's one message, you would give your fans? - [Austin] Oh, I've got an ad, I've got an ad. How to live stream on Bigo live. A lot of ads on this, I gotta say. - Yes, it's like, literally, like after anything you do, is an ad, which if you were a true influencer, you would have just paid the 99 cents to get the paid version. And that's how you know you've made it when you can pay that 99 cents. - Oh, 23,000 people, 4,000. Look how- - Are we live streaming right now? - We're live. I bet you all recognize me. You know I'll recognize you. Okay. So what I'm really excited about here, is just how exciting it is to be alive with 23,000 people. - Are you interacting with your fans? - No am not. - You're not! - Am done. - You gotta read through the comments. - I got to say my first thought, this seems kinda cool but like, I can't have fun when I'm getting an ad every five seconds. - So my experience was, it was like, I, like, I was looking at it and trying to do anything. The notifications of people messaging me were getting in the way of me trying to do other things in the app. Like constantly, like I was trying to select different things, and just like up at the top bar, X person messaged you. You know, message, message, message. And I'm like, oh man, it is annoying, but also like, until you hit reset on that, it will actually give you notifications on your phone as well. - No, that sounds terrible, I don't want that. - Yeah. So like my phone was just buzzing for 15 minutes. - Okay, I get the idea here. That this is a cool way of trying to simulate what it would be like to be Instagram or Tiktok famous. My thought though, this, I mean, I will say I like that 95% of the questions you get are, \"Can you give me a shout out\" or you \"Can give me\", if it was more accurate, it would be, \"Hey can you please give me a free PC, a slash phone, slash PS5, because those are the 99% of the messages that I get, but I, who is this for? Is this for some kid who just wants to imagine being Tiktok famous? - Yeah, I think so. One thing that's actually different from when I tried it last night is all these people have profile pictures now. - [Austin] Oh, they didn't before? - [Man] When I tried it last night, it was all just one photo. - Ooh. - It was just the app's photo. So I actually, this is a nice touch from yesterday. - Yeah. - Most of them are the same exact message, there's only about 10 actual messages that you get, and so like, I wanna ask you, Austin Evans. Is it hard to be famous like you? Because I've been plenty of places with you. We've gone to lunch and someone's like, \"Oh man Austin Evans, can I, can, you know, can I take a picture?\" Like, you know, how many times have we gone to Micro Center, (laughs) and you get stopped at Micro Center? - It's weird. It's like, it's not something. If we're at all gonna be like friends here, it's not something that you can ever complain about. \"Oh, I'm too popular and famous, oh no\". Like that's a ridiculous thing to say, right? I mean, it's always cool when someone's like, \"Yo, \"what's up, I've watched your videos, \"can you say, Hey guys, this is Austin on camera for me\". Like, that's always fun. - [Man] He said it. - That's always fun, right? Like it's always cool. But there are certainly times in which that's not, sometimes it's six o'clock in the morning and I'm just wearing something dumb and my hair looks dumb, and I'm just like, I just don't wanna talk to anyone now. I wanna go to the Self checkout and go back to sleep. Like, yes, but I mean, I don't know, this is all like, that's a weird conversation for me, 'cause this all sounds incredibly douche, every word that comes out of my mouth. Like how can you not feel grateful and happy that people care about you enough to say hello or wanna take a photo. Right. I mean, I can complain about how a lot of times when people come up, they don't say hi, they don't do anything, they just want a photo, and then they leave. Or the creepiest thing is when I'm like sitting at like well, obviously not anymore, but when I would be sitting at like dinner with my wife, and there's some like kid over here taking photos of us at the table. I'm just like \"Yo, no don't do that. That's creepy\". - [Ken] That dude that talked to you at the urinal? - No, you don't have to tell that story, Ken. (laughing) - We have to tell that story. So someone talked to you at a urinal? (laughs) - Yes. Okay so, this was a little while ago. Okay. Here's the deal, here's the deal, right? (laughing) Me and a group of friends had gone out to watch a movie. And afterward we went to a restaurant, to go grab some drinks and some food afterwards. I walked into the bathroom and you know, I'm doing my thing, as you do, and this guy starts talking to me like, no introduction or anything. He just starts talking to me about like, a video that I had made, of like PC whatever. When you're at a urinal, I don't wanna talk to, if I'm having a conversation with someone walking at the bathroom, soon as I walk up to do my thing, I'm not talking to you anymore, I'm focusing. Often times, people would talk to me about, so I had a house fire, a number of years ago at this point. I did. Yes, I'm pretty sure everyone in the universe who knows me, knows that. I get a lot of people who would be like, \"Oh, Hey I saw your fire, is everything okay?\" And it's a weird thing for me, not that I mind talking about to me, it was ancient history, I don't, it's fine. But people always talked to me about it, as if it like happened yesterday and we're talking about six, seven years ago. I was just like, \"Oh yeah, it's fine, everything's cool\". And it's just like, I get that a lot of people know me as the guy whose house burned down, which is fine. Totally nothing wrong with that. But yeah, there are certain interactions which happen on a very regular basis, which are just it almost takes me a second to like, you know, I feel like if someone reminds you of something that happened like years ago, you always have to like pause for a second like mentally file back, like wait, what? Like it it's. - [Man] Yeah. - It's not your normal train of thought. - [Man] For you, you're, I don't wanna say over it. I mean like maybe you are- - I would say so, yeah. Yeah. - Okay. But still like, it's not like, it's not in your immediate cache of things in your mind. - Yeah. - But for them it's, the only thing in their cache of mind, for coming up to you. - Yeah. - So that's interesting. - It's weird coming back to Hype Simulator, right? Of like, it does I mean, I will say it gives you a little bit of a sense for what your Instagram, whatever can look like. But there's a lot of other stuff that, something like that can't give you a good sense of right. Of like, when you're working your ass off, you're on like, on Instagram and then it gets no likes, or quote unquote, no likes, like, you know. You spend all this time on a video and you know, you pour your blood, sweat and tears into it and it does worse than a video you posted, took you 30 seconds to make. Right, I mean, I think it's, there's a lot more to it, it's a much more nuanced kind of thing. I have no problem with Hype Simulator. And I feel like this whole video is just me complaining. So I do apologize for that. - No, this is the Hype Simulator was just something we saw, and we're like this is a good chance to talk about this. - Yeah. I like it in some ways, but I think no one should look at that and think, oh this is what it's really like. I mean, certain aspects are, but like, that's like saying that I learned how to be a professional race car driver, because I played 10 minutes of F1 2020 the game, right? Like it's obviously not really the whole experience, right? As like, influencing becomes like a bigger bigger thing. Obviously, there's a bigger slice of the pie, more and more people can make this a part-time job, a full-time job, whatever the case is. But the idea that you have some kind of following or you wanna get some kind of following, treat it like it's something that you wanna sort of aspire to, not like I am betting everything and this is my life. - Pretty much every kid is, playing around with Tiktok in some way. - Yeah. - They're learning video, they're learning basic editing. And every one of them is gonna have a leg up, compared to where you were compared to where I was. So for those of you who don't know, I was a college professor. One of the things I was stressing, which was not necessarily a popular thing at a film school, was teaching new media, you know, like one of my biggest assignments in a film class, which everyone's like, \"why would I ever need to know this\", was I was teaching kids how to do vines. Kind of everyone else, like all these kids do that now. - But I think that's something that again, coming back around to the idea that it's such a different place now, compared to when I was coming up, it's so much easier because, you have everything you need to build your career, on the smartphone that lives in your pocket, right? When I was starting out, that simply was not the case. You had to buy a camera, you gonna need a computer, you need all these other things. You can get away with so much just with your phone today. That it lowers the barrier to entry where, before if I wanted to really make YouTube a serious thing, I needed to spend, several hundred dollars at least. But you can get started right now, which is part of the reason why I think that while you shouldn't go into it again, benchmarking yourself against the Casey Neistat's of the world, I do think it's worth trying. Because, what's the worst case scenario? You develop a skill, of some kind of craft of creating content, that could benefit you in the future. Or, it could benefit you today, you never know. - So much goes into content creation that the skills you think of, you don't associate with content creation. Base one is like research. - Yeah. - You know, as much as people like to say, ah, you know, cite your sources when you're writing in English class, why do I have to do this? Blah, blah, blah. That was a huge thing. Especially, you know like, me especially being able to research as well as I've been able to do, especially in the early days of This Is. Like, that was a huge thing with content creation. - If this is something that you've made to this part of the video, you're clearly you're a different person than most, right? If this is something that is interesting to you, And when I say this I mean anything related to new media, right? I mean, that's super broad. I think there are a few things that are just very applicable, right? I think the idea of being able to write, and to research is something that will be useful in the vast majority of any kind of job. Right? I mean, those are just skills that are nice to have in life, right? I think like you said, time management is something that's important. But for me, the thing that's always pushed me through is the idea of having passion, and the ability to put some hard work in, right? I think that overcomes almost anything, right? I mean, I didn't know what I was doing. No one knows what they're doing when they start, but you've seen, like, I feel like it's time after time, when you look at someone who has achieved some level of success in any industry, right? The recurring theme for the vast majority of them is they put in a lot of hard work, right? Everyone wants the ticket to, you know, a viral Tiktok, to get them 30 million followers. Cool. Well, good luck I mean, if you hit that, but you can't engineer luck, you can engineer hard work. Right? You can always work harder. Obviously there's a culture that gets toxic, and you're working 18 hours a day, but like, I'm not saying that. - That's- - Don't be lazy. Go get it. - That's where, and that's what I always worry of like when I see like a big influencer, say like, \"Oh, you know, just pulled an all-nighter, \"doing the edit\", you know, \"blah, blah\". It's, yeah, sometimes that's a requirement. It is. But I think a lot of people take that as like the only like, \"Oh, you're not working hard enough \"because you didn't pull an all-nighter\", yeah. - Like, and you can also work, that can also go on the opposite direction of, I'm going to be a little rude, you might be making something that sucks. And no amount of hard work is gonna fix that thing. But if you're able to put the hard work in and constantly learn, maybe the next thing you make won't suck, right? - If you're gonna spend the all-nighter, spend the all-nighter tweezing it, making it you know, figuring out what works figuring out what doesn't work. - Or plan the next thing you're gonna do. - Right. Not just doing the same thing over again. - Yeah. - So like, I think it's good and, I think you're like a great example of just you know, what it is like to be like one of these influencers- - Oh thank you. - How it's different from this. - Yeah. - I wanna ask you just 'cause, I feel like other people would ask you this, and this is something I saw in the Hype Simulator. - Okay. (laughs) - If you're not doing this, what are you doing? - Oh, if like I stopped doing YouTube stuff? - Yeah. - Oh God. It's like, that's a question, that I've never had a good answer for. - [Ken] To be at the Micro Center. (laughs) - You know what, that was like legitimately before I ever made YouTube content, my main goal was like, \"I think I'm gonna work at Best Buy\". I would much rather work at Micro Center, but- - Having worked at Best Buy, don't do that. (laughing) And having worked at RadioShack, they're out of business. - So Micro Center is the future. Anyway, thank you very much, for watching the slightly unusual episode of This Is, if you found any of this entertaining or useful, please consider subscribing, ringding the bell, like us on Tiktok and MySpace. Until the next time we get a viral hit. Thank you very, very much for sharing your time with us here at This Is. I will catch you guys tomorrow.",
    "transcript_keywords": [
        "thing",
        "Yeah",
        "people",
        "Hype Simulator",
        "Micro Center",
        "TikToK",
        "work",
        "things",
        "lot",
        "hard work",
        "Give",
        "Hype",
        "video",
        "Simulator",
        "Micro",
        "Center",
        "kind",
        "hard",
        "time",
        "cool"
    ],
    "transcript_entity_values": [
        "the Hype Simulator",
        "several hundred dollars",
        "PS5",
        "Austin Evans",
        "one",
        "Micro Center",
        "millions",
        "yesterday",
        "only about 10",
        "95%",
        "MySpace",
        "today",
        "1.5 million",
        "Hype Simulator",
        "Yo",
        "So Micro Center",
        "MySpace",
        "a number of years ago",
        "the early days",
        "last night",
        "RadioShack",
        "2020",
        "the Casey Neistat's",
        "the Hype Simulator",
        "Thiswasmatt",
        "18 hours",
        "Austin",
        "Hype Simulator",
        "MySpace",
        "YouTube",
        "15 minutes",
        "six o'clock in the morning",
        "English",
        "One",
        "the 99%",
        "the Micro Center",
        "the 99 cents",
        "4,000",
        "Linus",
        "these days",
        "TikTok",
        "second",
        "every five seconds",
        "10 minutes",
        "Bigo",
        "YouTube",
        "99 cents",
        "first",
        "Ken",
        "Tiktok",
        "Instagram",
        "Best Buy",
        "seven years ago",
        "30 million",
        "tomorrow",
        "23,000",
        "30 seconds"
    ],
    "transcript_entity_types": [
        "EVENT",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "TIME",
        "ORG",
        "DATE",
        "FAC",
        "WORK_OF_ART",
        "GPE",
        "TIME",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "TIME",
        "TIME",
        "LANGUAGE",
        "CARDINAL",
        "PERCENT",
        "FAC",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORDINAL",
        "TIME",
        "TIME",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME"
    ]
}