{
    "id": "YwdXpuTf76M",
    "title": "Want better Cooling? Get this. - ASUS RTX 4070 GPUs",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-04-17T22:10:19Z",
    "video_url": "https://www.youtube.com/watch?v=YwdXpuTf76M",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy"
    ],
    "views": 547939,
    "likes": 13581,
    "comments_count": 1530,
    "description": "Thanks to ASUS for sponsoring todays video! Are you ready to flow to victory? With higher performance and lower GPU temperatures, ASUS's TUF Gaming GeForce RTX 4070 and ASUS Dual GeForce RTX 4070 are available now! Link:   Buy an ASUS TUF Gaming GeForce RTX 4070:  Buy an ASUS Dual GeForce RTX 4070:  Buy an NVIDIA GeForce RTX 4070 FE:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 THIS...is a 4070 1:32 TUF Gaming RTX 4070 Unboxing 2:36 DUAL RTX 4070 Unboxing 3:15 Size Comparison 5:41 GPU Install + Benchmarking 9:05 Gaming",
    "description_links": [
        "https://www.asus.com/us/site/Graphics-Cards/GeForce-RTX-40-Series/",
        "https://geni.us/1GTbZ",
        "https://geni.us/tBuoaTP",
        "https://lmg.gg/VBtQq",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- This is an RTX 4070 Founders Edition, the first 40-series card actually getting somewhere near that wonderful $500 price point for a graphics card. It's cool, but you know what it's not as cool as? (box thuds) These ASUS add-in board partner RTX 4070s with bigger coolers, overclocking. And our look at it today is sponsored by ASUS, so we actually get to try these out and see how they compare to the Founders cards with a little bit of gaming, a little bit of unboxing. We've got two of ASUS's 4070s here today. This one is the Dual. It's got two fans, as the name implies. It's the more affordable version. It matches the MSRP of the Founders card. It's still got lots of cooling. It's still got two fans. It's lots of I/O. It's an ASUS card, so it's gonna perform great. And then this is the bigger one. It's not quite Strix-tier, but it is TUF, so they use high-quality components. It's got a much bigger cooler, three fans. It's got pass-through cooling like the Founders card. Wow, is that an eight-pin? They both just use an eight-pin, hey? Yeah, they both use just a single eight-pin power connector, which is great if you have a power supply that might only have one or something that's a little bit lower wattage. The Founders card is the high-power 12-pin connector, but it does come with an adapter. However, that adapter needs two eight-pins. This is just one, which is great for compatibility. Like, if you don't need it, why would you bother including it, right? Let's get one of them open. I like the TUF one. This is the fancy one. I'm definitely more of a fancy products kind of guy. Ooh! There's a graphics card in here. No way. (antistatic bag crinkling) All right, TUF card. Anything else in here? Usual propaganda. Oh, they're little, like, cardboard cutouts. Is this, like, functional for something? ASUS always has these cool little, like, I don't know, little freebie things in the boxes. They'll give you big sticker packs or, like, just cool, little, cute things. Is this a phone holder? This might be a phone holder. Look at that. Wonderful. Certificate of reliability, oh, that's kind of cute. What else is in here? Oh, there's this. What is this? Oh, yeah, look at that. It looks like a tire pressure gauge, but it is actually... Whoa. Is that a, what? (laughs) It's a screwdriver too? (laughing) I've never taken this out before. It's a graphics card, like, anti-sag little mount that you put under your GPU. I didn't know it was also a screwdriver. That's kinda cool. So I guess everything you need to install this graphics card comes in the box. Look, you can even put it in the handle, and then you got a handle for the screw. (laughs) All right, the Dual. Both of these cards have 12 gigabytes of GDDR6X memory like every other 4070. They have a TDP of 200 watts each, which, I mean, it means you can, like I said before, you can use it with a pretty not-beefy power supply, which is really nice. Whoa. There's more stuff. Oh, is this another phone holder? Bell, now you can have one. Here. (Bell and producer laughing) And a quick start guide. How to install a graphics card in a book. Cool. Woo! (box slams) I'm so excited that there's peels. ASUS always has so many peels. (plastic crinkling) This little screwdriver is very helpful. Big fan. Size-wise, Founders Edition is still the smallest. This is a bit bigger but not crazy. And then, of course, the TUF is the big boy. It's large, but it also means it's gonna be very quiet and very cool. The Founders Edition is a true two-slot card. The Dual is a little bit bigger, so it's, like, probably a 2.5-slot card. It is pretty tall too. And then the TUF, it's hard to say, but I'm gonna go with, like, a 3.1-slot cooler. (laughs) Hey, look. I was almost right. The TUF card is 3.15 slots, according to ASUS. It's like, this bottom part is probably the .15. You only need the two actual physical slots, but you are gonna need enough space to fit this card in with the big honkin' cooler on there. In terms of the Dual, it's got an aluminum backplate, which is really nice to see on a budget card like this. The two fans we mentioned earlier, they're 11 blades each. It has a dual BIOS switch, which is nice 'cause you're gonna have, like, performance mode and quiet mode if you want it to be quieter. It'll have the clock speed limits and the power limits set a little bit lower to decrease the noise. Or if you're, like, in a small form factor build, that might be something you wanna try to use. Other than that, it's just a nice, cute little cooler. It's very short. By five years ago standards, this was a big card. But nowadays, I mean, look. It's only 267 millimeters long, which, in terms of compatibility, will fit in a lot more cases. It does also have the airflow pass-through over here like we've been seeing on the Founders cards for the, you know, last little while. Oh, yeah, I guess I/O is another thing. Three DisplayPort, two HDMI on the Dual. And it's the same on the TUF. The TUF has three of the 11-blade Axial Tech fans and is just 1 millimeter over 300. It's 301 millimeters. It also has a dual BIOS switch just like the Dual, so you've got quiet and performance mode. It has a new, fancy, where's the TUF logo on here? So this is an ARGB TUF logo, which is kinda cute. I mean, design-wise, I like it. I mean, this is what you're gonna see in your computer, a normal computer, and it looks nice. I like it. I'm not a huge fan of cards that are, like, super RGB. And this is nice and clean and simple, which is usually their TUF kind of look. This one, very similar, just blacked out. However, you can get this card in white soon, which is kinda cool. If you have, like, an all-white build, this will look pretty sweet in there. Cool. I guess let's put it in a computer. The Dual we have is the non-OC Dual. But the TUF card is the OC, which is the overclocked version. We get 105 megahertz over the Founders card, which is, you know, that's some megahertz. (PCIe slots clicking) Boom, graphics card. It's crazy in 2023 to be plugging in one power connector only. (laughing) This computer doesn't have a power button, so I figured I'd use my little screwdriver. (upbeat rock music) Hey, look at that. Oh, look at the, it's so cute. Can you see that? I lied. It's more than the logo. It's this bar too. That is a appropriate amount of RGB (laughing) compared to this. (laughing) We got GPU Tweak III installed here, which is ASUS's new, well, GPU tweaking software. And I was trying to figure out, ah, how do you put this thing in OC mode? I look right there. (mouse clicks) OC mode. Done. That's it. It increased our megahertz, 30. Look at that. You can also do cool things, like you just set the power target, like, higher. I'm not gonna do that. I'm just gonna put it in OC mode and leave it there. And then we can play some games. Just for clarification, for anything further, this is gonna be running at 1440p. It's a 4K monitor, but I just changed the resolution. I wanna try FurMark. I wanna just, like, make this thing hurt a little bit and see what it does. GPU boost clock, yep. OC mode, oop. Now let's do AA. Sure, why not, 4xAA. Yeah. Man, this thing sips power. It only draws 200 watts. That's it. See, GPU performance limiters. We are limited by power. Makes sense. We'll just let that simmer for a minute. (clock ticking) Look at that. That's so cool. You can see that it's drawing 140 watts from the eight-pin power connector. 141 watts, whatever. PCIe slot is providing 58, 59 watts. Huh. A lot of sensors on these things nowadays. It seems like we've leveled off at this point. It's not in a case. Obviously, that's gonna be a big factor. As soon as you put a box around whatever product you're heating up, there's a lot more thermal constraints. But on this open-air test bench, in the room, it's about 21 degrees in here, 56 degrees on the GPU. The fan, I don't even hear it. (laughs) (VRMs whining faintly) I actually hear, like, the VRM noise from the motherboard, like, coil whine, louder than I hear the graphics card fans, which is really impressive. It's kicking off, you know, a fair bit of heat. But then again, it's only 200 watts, which, for a modern graphics card, is very efficient. And a lot of that is because of NVIDIA's new Ada Lovelace architecture. You're also gonna get things like DLSS 3, which is great if you wanna, say, ray trace and you don't wanna spend $1,500 on a graphics card. Well, this $680 one can probably run those games ray traced with DLSS Frame Generation and still look really good. But yeah, overall, it's very quiet, very cool, open air, but yeah. The clock speed, too, where are around on that? Eh, 2760, 2770. We were power limited, which makes sense. It is set to a 200-watt power limit. We could go in, in GPU Tweak and turn our power target up to like 110. See, so it looks like 108 is the max. But I'm just gonna leave it for now 'cause we wanna see what this is like stock, mind you, stock but in the OC profile. Let's try \"Cyberpunk.\" Oh, we're boosting higher. 2835, let's go! Wait, 2835? Damn, boy. That's some clock speed. What's it supposed to be? 2580, oof. GPU Boost is doing its thing. It's giving us the boost. We're in \"Cyberpunk.\" We're on ray traced, ultra quality profile, 1440p. And we're getting 40, 47 FPS, 48 FPS. There's no DLSS on right now, no Frame Generation, no supersampling, nothing. This is just the raw performance of the card, which, to be honest, at 1440p, basically max settings, very good, totally playable. But if we go, let's turn Frame Gen on, and we'll leave it on auto, I think. Now how many FPS do we get? Oh, it's way smoother. 130, 135. What was I at before, 40? Three times the FPS? (laughing) That's a lot more FPS, and it looks good. Like, it doesn't feel, like, super slow. Like, the latency is almost so little that I don't even notice it. Especially in a game like this, this would not bug me at all. It's quiet the whole time too. I mean, let's see what kind of clock speeds we're getting. GPU Boost is obviously gonna go crazy. We're getting 2865 megahertz on the GPU. It looks like peak there. Sometimes we're at like 2850. GPU Boost is obviously gonna go past what the default boost is. You know, depending on where you are in the scene, this is probably where I was changing settings, but around 190, 200 watts, temps 55, 56 like we were seeing in FurMark. And again, it was super quiet the whole time. This is a great cooler, for sure, and good performance. (upbeat rock music) In terms of pricing, like I mentioned before, this TUF OC is $680. And the Dual non-OC, so there's an OC version, but this is the non-OC, is 600 US dollars, which is the same as the Founders card. The Dual comes in white or black, like we mentioned before. The TUF only comes in black. These are both available right now, so you can go and pick one up at the link down in the description. Or if you wanna wait for the Strix cards or the white version of the Dual, they're gonna be coming later this month. And that's pretty much all there is to say. It's a great cooler, it's quiet, it's fast. Thanks to ASUS for sponsoring this video, and that's why you get to see it, yeah. Get subscribed. Like it. Goodbye!",
    "transcript_keywords": [
        "card",
        "Founders card",
        "graphics card",
        "TUF",
        "Dual",
        "TUF card",
        "Founders",
        "GPU",
        "ASUS",
        "GPU boost",
        "power",
        "Founders Edition",
        "cool",
        "graphics",
        "cards",
        "bit",
        "ASUS card",
        "dual BIOS",
        "boost",
        "Yeah"
    ],
    "transcript_entity_values": [
        "DLSS Frame Generation",
        "130",
        "Three",
        "4",
        "Frame Gen",
        "NVIDIA",
        "Bell",
        "PCIe",
        "140 watts",
        "1,500",
        "58",
        "five years ago",
        "DisplayPort",
        "2.5",
        "some megahertz",
        "680",
        "59 watts",
        "today",
        "about 21 degrees",
        "2850",
        "FPS",
        "just 1 millimeter over 300",
        "2580",
        "56",
        "FurMark",
        "2023",
        "110",
        "TUF",
        "600 US dollars",
        "12 gigabytes",
        "TUF OC",
        "11",
        "max",
        "4070s",
        "first",
        "two",
        "55",
        "OC",
        "4xAA",
        "GPU",
        "Strix",
        "3.15",
        "ASUS",
        "eight",
        "2835",
        "301 millimeters",
        "ARGB TUF",
        "Ada Lovelace",
        "Axial Tech",
        "one",
        "VRM",
        "GPU Boost",
        "56 degrees",
        "only 200 watts",
        "200",
        "190",
        "later this month",
        "2760",
        "oof",
        "200-watt",
        "3.1",
        "141 watts",
        "12",
        "30",
        "500",
        "200 watts",
        "three",
        "40",
        "105 megahertz",
        "108",
        "48 FPS",
        "only 267 millimeters",
        "135",
        "2865 megahertz",
        "4070s",
        "47 FPS",
        "RGB",
        "FurMark"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART"
    ]
}