{
    "id": "yWgxSe0h3mY",
    "title": "Read the Room, Intel!",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-08-09T01:23:16Z",
    "video_url": "https://www.youtube.com/watch?v=yWgxSe0h3mY",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Intel",
        "Intel Arc",
        "Arc Pro",
        "Intel Arc Pro",
        "Arc GPU",
        "Intel Arc GPU",
        "Intel gaming graphics cards",
        "Intel Arc gaming",
        "Arc gaming GPUs",
        "Arc launch",
        "Arc GPU stock",
        "Arc graphics cards",
        "PC gaming",
        "DIY PC",
        "building PC"
    ],
    "views": 493704,
    "likes": 30016,
    "comments_count": 719,
    "description": "Learn more about MSI's back to school sale and giveaway here:    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 oh no 0:09 Intel Arc Pro GPUs 1:08 RTX 3090 Ti price 1:59 Steam Joy-con support 2:44 MSI's Back to School Sale + giveaway! 3:18 QUICK BITS 3:31 Apple Smart Display 3:50 Netflix Un-played Games 4:23 Xbox Series S VRAM boost 4:47 Nvidia finances 5:15 Sausage in Space!!  FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://msi.gm/3Q5BRWn",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/k8aQm",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "(soft jazz music) - (inhales) That's right, tech news man is back, (beep). (laughs) Intel has announced a lineup of all new Arc Pro graphics cards, since the launch of Intel's Arc GPUs for gaming was such a smashing success. Smirk, and then the script says, smirk. As the name implies, their professional tier graphics processors for content creation, design, and engineering, akin to Nvidia's RTX A Series and AMD's Radeon Pro. The cards had a, dare I say it, minimalist and utilitarian look, devoid of any RGB bling you could use to illuminate the gaping void in your soul. But they do have all the bells and whistles when it comes to encoding and rendering. However, as is still the case with the Arc gaming lineup, it might be a bit before we find out just how well these Pro GPUs actually work, considering Intel's now very well publicized issues with graphics drivers, and more recently, board partners. So you may wanna think about holding off on buying an Arc Pro, unless you're looking for architech. That wasn't John, I take full of responsibility. Hey, you know how you can save a thousand dollars right now, leave it in your bank account and don't spend it on anything, ba dum, tsss. Or you could buy an RTX 3090 Ti, which is getting a pretty insane discount due to the huge glut of inventory floating around out there that Nvidia wants cleared out ahead of the Lovelace GPU launch. Right now, two models from EVGA are going for less than $1,200, down from MSRPs around 2200 bucks, so it's quite a deal. But do keep in mind that the upcoming RTX 4070 is rumored to match the performance of the 3090 Ti, at a significantly lower price point. So if you've got $1,200 burning a hole in your pocket, maybe choose a wiser investment, like lottery tickets. That was not investment advice. John wrote this script and he went to law school, but still, I wouldn't. Valve has been quite good about allowing players to use many different kinds of controllers, but for a long time, support for the Nintendo Switches Joy-Cons has been notably absent. (laughs) Well, not anymore. The latest beta version of Steam finally features support for the popular controllers. So if you already own a Switch, it'll save you from spending extra money on something like an Xbox controller, if you don't want to use a mouse and keyboard. Do keep in mind though, that unlike most other controllers, you don't have the option to connect Joy-Cons to your PC via USB and will have to use Bluetooth. Hmm, I wonder if some indie developer will release a Steam game called Joy-Con Drift Simulator 2022. (imitates car engine) You like cars. Now it's time for Quick Bits, brought to you by MSI's back to school sale, which is on right now. Ah, so sad, that going back to school part, that is. The sale is great. MSI's got new laptops for your new semester and desktop PCs that are totally for school and not for gaming, mom, I swear. I think that's the whole product name. If you're into custom builds, they've got components on sale, plus a Gleam giveaway where you can win sweet prizes, like a full-blown gaming desktop, or an RTX 3080 Ti Gaming X Trio. Find out more about MSI back to school sale and how you can win at the link below. - Please let this be a normal Quick Bits. - With Riley, no way! - Awe. (laughs) (car horn beeps) - It looks like Apple is going to get into the smart display game to compete with products like the Amazon Echo Show and the Google Nest Hub. Insider, Mark Gurman has reported that such a device is in testing and could appear in the next couple years. Hopefully for Apple it'll be more popular than the complete debacle that was the original home pod. I can't even remember it, I was traumatized. You'd be forgiven for forgetting that Netflix has been offering some free games to subscribers for a while now. A new report has revealed that less than 1% of their subscriber base is actually playing them. Although Netflix's bread and butter is obviously streaming movies and series, not gaming, the company would surely like to see more folks downloading its games, as it seeks new revenue streams to counter recent subscriber losses, except that they're only offering a handful of Android games right now. You know what they should do is they pick up those old AAA games that Ubisoft stopped supporting, that I've, I've got 'em. The Xbox Series S obviously has appeal as a lower cost alternative to the Series X, but one massive trade-off is that the S doesn't have enough VRAM to keep up with all the fancy fixins developers are adding to games. But a recent software update has allocated more of the system's shared memory to VRAM, so hopefully you'll see a quality boost in your favorite titles, and never have to feel console envy again. It's my forever console. I'm sure that Nvidia is hoping for its Lovelace GPUs to be a hit, whenever they come out, as the crypto crash and resulting tank in demand for graphics cards led team green to finish the second quarter 1.4 billion dollars short of projections. That's obviously a lot of money, but keep in mind, their overall revenue is up, thanks to their data center business. So Jensen is in no risk of having to sell the leather jacket off his back. Can you imagine? And remember to verify that images you see on the web are actually what they say they are. Etienne Klein, a research director within the French government, shared what he claimed was a picture of the star, Proxima Centauri, taken by the James Webb's telescope, but it was actually a slice of Chorizo, posted as a joke, and as a lesson, not to blindly trust those with authority, seeing as Proxima Centauri is in fact a red dwarf, I wouldn't feel too bad if you were fooled by the vermilion colored sausage. But now, I'm suddenly in the mood for tapas. And if you're still in the mood for tech news, well, all I can say is come back on Wednesday. Trust me, binging tech news is a habit you do not want to get into. It's the beginning of a, of a dark spiral.",
    "transcript_keywords": [
        "Arc Pro graphics",
        "AMD Radeon Pro",
        "Intel Arc GPUs",
        "Arc Pro",
        "Pro graphics cards",
        "smashing success",
        "Arc gaming lineup",
        "Intel Arc",
        "Pro",
        "Radeon Pro",
        "Arc",
        "graphics cards",
        "Pro graphics",
        "gaming",
        "Pro GPUs",
        "back",
        "RTX",
        "Intel",
        "MSI back",
        "AMD Radeon"
    ],
    "transcript_entity_values": [
        "Joy-Con Drift Simulator 2022",
        "Mark Gurman",
        "3090 Ti",
        "Arc",
        "French",
        "Radeon Pro",
        "the next couple years",
        "Intel",
        "Proxima Centauri",
        "the second quarter",
        "the Amazon Echo Show",
        "Series",
        "less than 1%",
        "USB",
        "Switch",
        "one",
        "the Series X",
        "Apple",
        "1,200",
        "Lovelace",
        "John",
        "1.4 billion dollars",
        "EVGA",
        "less than $1,200",
        "Quick Bits",
        "Arc Pro",
        "Bluetooth",
        "AMD",
        "Jensen",
        "Etienne Klein",
        "Nvidia",
        "Netflix",
        "two",
        "MSI",
        "Ubisoft",
        "Android",
        "James Webb's",
        "Riley",
        "Wednesday",
        "GPU",
        "a thousand dollars",
        "RGB",
        "Xbox",
        "Chorizo",
        "The Xbox Series S",
        "Steam",
        "4070",
        "Joy-Cons"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "NORP",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "EVENT",
        "EVENT",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "MONEY",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG"
    ]
}