{
    "id": "YwL4Qnkv6AA",
    "title": "How to shut down a website",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-08-06T18:50:57Z",
    "video_url": "https://www.youtube.com/watch?v=YwL4Qnkv6AA",
    "category": "Science & Technology",
    "tags": [
        "8chan",
        "cloudfare",
        "4chan",
        "epic",
        "website",
        "websites",
        "internet",
        "the internet",
        "ban",
        "banning",
        "daily stormer",
        "white supremacist",
        "white supremacism",
        "dark web",
        "web",
        "chat rooms",
        "hate sites",
        "hate",
        "texas",
        "el paso",
        "dayton",
        "mass shootings",
        "shootings",
        "news",
        "dayton ohio",
        "mass shooting",
        "terrorism",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "mkbhd",
        "apple",
        "google",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 161317,
    "likes": 4566,
    "comments_count": 489,
    "description": "After a hate-fueled tragedy, web service companies are increasingly facing pressure to purge sites like 8chan from the internet. But keeping a site offline is harder than it sounds  and there are good reasons to be worried about companies making that call.  Learn more about how you can help or donate below  ADL:  El Paso Shooting Victims Fund:   Dayton Foundation Oregon District Tragedy Fund:  Hope Border Institute:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://www.adl.org",
        "https://payments.epcf.org/victims",
        "https://www.daytonfoundation.org/dayton_oregon_district_tragedy_fund.html",
        "https://www.hopeborder.org/",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- After the horrific shooting in El Paso, a small barely moderated forum became the center of attention. - 8chan. - After 8chan. - I mean it was on 8chan. - A site 8chan. - The killer posted a rambling essay on 8chan, laying out his hate fueled motives. And it wasn't the first time this had happened either. Since it's launch in 2013, 8chan has become known as a place where hate can thrive. Even it's founder has said we'd be better off if the site just disappeared. And any company that works with 8chan is under pressure to kick it offline. But how do you take a site off the internet? Running a website requires a whole stack of services. And if it gets blocked, or deplatformed at any level it can become either hard to use or completely inaccessible. At the bottom of the stack you've got the host. The server that actually holds information for the site. If you wanna reach that host by typing a link you need a registered domain which is handled by an organization called ICANN and a series of companies called registrars. In the middle, you've got other services that serve more specialized roles. If a site wants to collect money with credit cards for example it needs a payment processor, like Stripe or PayPal. If it wants to protect itself from denial-of-service or DDoS attacks, it needs a mitigation service from a company like Cloudflare. And on top on all that, there are big social networks, mobile app stores and search engines that can boost the sites reach. Opponents of sites like 8chan have targeted every level of that stack and they've seen some success. Cloudflare cut off 8chan's DDoS protection shortly after the shooting, leaving it open to attack. 8chan moved to a competing provider called Epik but that provider was leasing hardware from a different company called Voxility, which banned Epik as soon as it heard about 8chan. After that, 8chan just dropped off the internet. Is it going to stay offline though? Probably not. There are all kinds of internet infrastructure companies that specialize in keeping offensive or even illegal sites online. Sometimes just outside the reach of law enforcement. Anonymity networks like Tor can disguise where content is hosted or let sites bypass the traditional domain name system. There's usually no way to ban a site from the internet forever. One of the clearest examples of this happened in 2017. When the neo-Nazi blog, Daily Stormer was widely condemned for mocking the death of anti-racist protester, Heather Heyer. GoDaddy, Cloudflare, Google and others, all stopped working with the site. And for a while it couldn't find anywhere to register a domain name, which made it very hard to find. But once the controversy died down it found a new registrar and resumed operating. Members of a site can also just go form a new community. A lot of 8chan's members came from another message board called 4chan, which had tried to moderate some of its most toxic elements and ended up just sending them somewhere worse. If 8chan gets shut down, users can move on to other forums or launch private chat rooms. So, what's the point then? Well, there are a few major arguments for pressuring companies to deplatform hate sites. It makes it a lot harder for sites to collect money or run ads, even if they get traffic. It can also make it harder for people to encounter these dark corners of the internet in the first place. These aren't huge platforms like Reddit or Twitter. At the end of the day, 8chan is a pretty small place. And as we saw earlier this week, revoking things like DDoS protection can knock a site offline while it's experiencing a burst of publicity. Just because you can't keep something off the internet forever, doesn't mean you can't reduce its power. But there's also a dark side to deplatforming because it basically involves asking a handful of private companies or CEOs to act like internet gatekeepers. Cloudflare is incredibly powerful. Almost 20% of the top 10 000 internet properties use it right now. And it has no real system of accountability or transparency. When Cloudflare kicked off the Daily Stormer in 2017, Cloudflare's CEO, Matthew Prince essentially got mad, pushed a button and dropped the site. - I woke up one morning and got sick of these jerks using our platform and I flipped a switch and they were no longer on the internet. And I'm not sure that that's a power that any individual, especially any individual that isn't politically sort of, has a political legitimacy to them that any individual should be making. - Cloudflare is a private company, and it has every right to ban a customer. But Prince said that he wasn't comfortable making arbitrary decisions about which sites can stay online. These lower level infrastructure businesses have traditionally tried to stay out of content moderation. Because any decisions they make will have huge ramifications for freedom of speech on the internet. And while banning some ugly sites might seem like an easy call, these companies also face pressure to ban political dissidents across the world. And repressive governments use a lot of the same arguments to paint those groups as hateful and dangerous. It's certainly not ideal to have a few CEOs making huge decisions with no oversight or appeals process. Cloudflare certainly thinks so. When it kicked out 8chan it asked governments to establish better guidelines for when to pull a site offline. Lots of countries can access 8chan and if it weren't so easy to carry out mass shootings in America, online hate might not spill into deadly violence so often. But at least in the US, where Cloudflare operates, institutions don't seem sure how to deal with white nationalist terrorism. And when Congress has amended the law to keep bad content offline, it's often turned out badly. Like the FOSTA SESTA bill, which is meant to stop online trafficking. But has ended up making web companies marginalize sex workers or purge adult content in general. Crafting policies to address hate online and setting up systems to enforce them could take a long time if it happens at all. So if people wanna keep these sites off the internet they basically have to pressure companies like Cloudflare. Even if the companies don't want to be making those calls. Thank you for watching this is a very serious topic that goes far beyond just the internet. If you wanna help out some of the communities affected or fight hate groups please just check out the links in the description of this video.",
    "transcript_keywords": [
        "site",
        "Cloudflare",
        "internet",
        "sites",
        "barely moderated forum",
        "small barely moderated",
        "center of attention",
        "companies",
        "barely moderated",
        "Paso",
        "hate",
        "called",
        "offline",
        "making",
        "online",
        "site offline",
        "Daily Stormer",
        "company",
        "content",
        "horrific shooting"
    ],
    "transcript_entity_values": [
        "El Paso",
        "2013",
        "Epik",
        "Tor",
        "one morning",
        "GoDaddy",
        "Almost 20%",
        "8chan",
        "Twitter",
        "neo-Nazi",
        "ICANN",
        "Stripe",
        "DDoS",
        "Google",
        "Heather Heyer",
        "2017",
        "Daily Stormer",
        "US",
        "the end of the day",
        "Voxility",
        "Reddit",
        "Congress",
        "America",
        "Matthew Prince",
        "8chan",
        "One",
        "Cloudflare",
        "earlier this week",
        "first",
        "Cloudflare",
        "10"
    ],
    "transcript_entity_types": [
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "NORP",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "GPE",
        "DATE",
        "ORG",
        "NORP",
        "ORG",
        "GPE",
        "PERSON",
        "TIME",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL"
    ]
}