{
    "id": "YWmp9pX2zy8",
    "title": "The NZXT H510 Can FINALLY Breathe! - Flow Case",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-09-22T15:00:44Z",
    "video_url": "https://www.youtube.com/watch?v=YWmp9pX2zy8",
    "category": "Science & Technology",
    "tags": [
        "NZXT",
        "H510",
        "H510 Elite",
        "Flow",
        "H510 Flow",
        "Gaming",
        "PC",
        "Personal Computer",
        "Building",
        "DIY",
        "Component",
        "Fit",
        "Airflow",
        "Air Cooling",
        "Cooling",
        "Air",
        "Clean",
        "Minimalism"
    ],
    "views": 448908,
    "likes": 13132,
    "comments_count": 880,
    "description": "Get your Occhio True Privacy webcam today at:   The NZXT H510 case is famous for its extremely clean look, which made it extremely popular, but it was viewed as having poor airflow. NZXT apparently fixes that with the H510 Flow; let's find out!  Check out the NZXT H510 Flow at   Buy NZXT N7 B550 Motherboard On Amazon (PAID LINK):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy AMD 5600X Processor On Amazon (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy NVIDIA 3060 Video Card On Amazon (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy Gskill Trident Z Ram On Amazon (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy iFixit Pro Tech Toolkit On Amazon (Paid Link):  On NewEgg (Paid Link):   Buy Seasonic Power Supply Unit On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - Intro 0:42 - Unboxing 1:06 - First impressions 5:29 - Sponsor! - Arozzi Occhio 6:04 - Included hardware 6:44 - Continued impressions 7:18 - Installing PC Components 12:54 - Closing thoughts",
    "description_links": [
        "https://lmg.gg/ArozziSC",
        "https://lmg.gg/m8bGl",
        "https://geni.us/gWaJP",
        "https://geni.us/slpZyPc",
        "https://geni.us/hFTFzbl",
        "https://geni.us/zXwI",
        "https://geni.us/f4jpOm",
        "https://geni.us/DF3t",
        "https://geni.us/ocrvAC",
        "https://geni.us/wkX3H",
        "https://geni.us/ldYR6e",
        "https://geni.us/XEYS",
        "https://geni.us/fx7sAmj",
        "https://geni.us/quaBfVg",
        "https://geni.us/QDTyv",
        "https://geni.us/MBon",
        "https://geni.us/NuJzW8",
        "https://geni.us/zAOVZw",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- So this is the old NZXT H510, and I hate this case! It looks great, don't get me wrong, but oh my God, the airflow, like all you've got is a strip here. You've got this room for one fan on the top. Like, I think that might be room for a 140, but it's not enough. It's- come on. Especially with you know, the 30 Series, and your Ryzen 5000 processors. Like you need some more, if you want to air cool anything. Even liquid cool! Like what are you going to do? You gonna to put a whole radiator like, across the top here? No, 'cause that's just solid casing, and this is just not even usable. So today... Let's get the bad guy out of the way. Today, I've got the H510 Flow! Get it? For air flow. NZXT gets it. Oh, come on, please. Ah! It's a locking mechanism- is it actually? - [Jono] Almost. - This is based off the H510 Elite. So there's some slight differences, but not a whole lot. So I haven't even actually built in one of these, 'cause I don't, like I avoid them. I think they look amazing, but like I said, like I tend to air cool everything. Here's the big new front mesh panel that they've got here, and it looks good. They've got like a little actual filter behind the front mesh part of it here. We'll try to take that off later and see how easy it is to clean the filter out. They still haven't changed this top here, which is kind of a problem. Basically, a lot of AIOs, you don't want the 120 millimeter, they're not big enough. I mean they're big enough if you have a smaller CPU I guess, but you want to leave some head room. So just go to 240, like honestly, I don't think people should really bother with the 120 mms. I don't use many AIOS, so I could be wrong. - [Jono] Couldn't you just mount the radiator in the front of the case? - Yes, Jono, you could just mount the radiator in the front of the case, but sometimes it's not that easy, right? Like sometimes it's a lot cleaner if you can mount it on the top. 'Cause the tubes just go straight up, and you can hide all the wiring really easily. Whereas on the front, you've got the tubes going like all the way across, or all the way along the bottom. I'm just not a fan. It's a preference thing. But, hey, you do you. Back still comes off, no problem, it's just captive thumb screws, which is always nice. Some manufacturers have moved to more toolless designs recently. And I mean, that's always preferable. But hey, captive is good too! There it is, yep! So that just pops off. Internal bracket, this looks like it can be removed. Yeah, if you take these thumb screws off. And so you can mount stuff out of the case really easily on a radiator mount like that. So yeah, the old one, I mean, it might be a little hard to see 'cause the tinted glass, but it's got that too. So I'm having trouble finding what the big differences are. NZXT probably just took a whole bunch of their old cases that hadn't sold yet, grabbed the front and drilled them through. No, I'm kidding. They they've done some work here to actually, like, make this filter accessible, I'm guessing. Oh! Hey, okay. So yeah, that's pretty easy actually. That is nice. I take it back. They've done a good job here. I mean, it's toolless, and you can just like, pop it on, pop it off. Just comes out like this. Cool. So there you go. You've got your filter. You've got mesh front. Pretty much everyone's started making these mesh fronts at least a year or two ago. NZXT does make a really pretty case, so it's okay that they took a little longer to catch up. For the Rileys and the minimalists of you out there... You say that, but then, look, it's got like NZXT branding. I don't know, I'm just kind of against branding. I mean, I say that, but I'm wearing, you know- hey, the new dad hats? These are great. You should pick these up. I don't like the old caps cause they're too big for my head, but these guys are just right. They do still have the branding on the front. It all depends on how much you care about, like, showing off brand logos and stuff. It's still got their same cable running stuff here. There are cable ties that you can close up on them and stuff. You've got your SSD mounts, your front IO. They've just got a full-panel header. This is even better! Please, every case manufacturer out there, if you don't switch to just a preset or power switch, at least put it all in here! This thing is pretty nice, don't get me wrong, but the perfect case for me is probably... I'm a big fan of Fractal and Phanteks, but I also air cool everything. I just, I know it's relatively safe. I mean, not even relatively, it's safe these days, especially AIOS. I grew up with people water cooling with the most jank setups in like the early 2000s and stuff. You know, you're seeing like home hardware, hardware, and it's just like, no, I don't want to do that ever! And you hear all these forum posts about, \"Oh my God, my build leaked. And I don't know what to do!\" - [Jono] The Davids out there. - So what I do, instead, is I just air cool everything. 'Cause it's not going to fail, and you know, air cooling is going to get your hardware to a pretty nice and cool space most of the time, unless you're trying to do some crazy overclocking or something like that. My favorite case would probably be the new Meshify 2, maybe even the compact version. Those are really nice. Anything by Phanteks is typically pretty good as well, like the P500A or the P500A digital. I think the P600A is probably coming out soon too? So keep your eyes posted for that, I guess. Once again, I'm still really disappointed that they haven't added more mesh up here to let me put a radiator up top. 'Cause I typically go two or three fans in the front and then two up top and then one in the back, for like, pshoo, that kind of air cooling. Don't think of this as a new case you need to upgrade to. Think of it as, NZXT cases are... Well, The H510 specifically, is finally viable for air cooling, at least if you get the Flow version and you don't want to drill through it. It comes with one fan in the front and one fan in the back. So that's pretty standard for most cases these days that are worth more than like $60, really. You should get a fan or two at least coming with it. Otherwise, yeah, I mean, let's just throw stuff in here. But before that! A word from our sponsors. Thanks to Arozzi for sponsoring today's video. Arozzi wants to help you protect your privacy with their new Occhio True Privacy webcams. Take privacy into your own hands with the included magnetic lens cover, and use the front switch to turn off the electrical circuit to the webcam's microphone. You can be sure that you are only seen and heard when you want to be. It features auto-focus and light correction, and it also films at 1080p resolution at 30 frames per second. It comes in two versions, one with a ring light, and one without. Get your Occhio True Privacy webcam by visiting Arozzi.com or by visiting the link below. We've got a hardware box. This is okay. I don't even know where this was. It was just hidden in here somewhere, and it fell out while we were handling the case. This seems bare bones. We have a bunch of cables, what are these for? Oh, okay, so they do have another front panel header thing. Maybe if you've got an ITX board or something like that, and it's a little harder to reach, you can just add this on there. We're not going to use it, 'cause they've given us this nice front panel connector. And then this is a splitter, looks like an audio splitter. I'm honestly not sure why they would include this with a case. This is typically something that would come with like, your headphones or your speakers or something like that. But hey, maybe they're just like, \"Let's give them all the accessibility attachments!\" This is a big manual that gives me a lot of useful information that I don't need to know. Yeah, okay, so the cage comes in, pre-installed... Oh, and it screws! Okay. That's great. So these guys are for the HDD cages, which makes it really, really easy to just pull them out if you don't need them. 'Cause guess what? It's 2021 and yeah, hard drives. Some people still use them, but me personally, I'm trying to go to all SSD or even M.2 two NVMe SSDs. But! Let's remove them, why not? Oh, yeah, I'm not taking that. Okay, so, small thing. NZXT at the factory really screws these in tight! We'll leave the hard drive cage in there, that's perfectly fine. So this is just a 3060, and I think a 5600X. Get subscribed to LTT, because we're going to do a full shoot between this guy, the new Flow, and then we're going to put the same parts in the old H510, and we'll see how bad the thermals are. We're also checking to see just how much air cooling can actually air cool stuff in 2021, when you've got the most extreme components. So, stay tuned! Also subscribed to ShortCircuit, 'cause hey, you get more content like this, where I unbox stuff. Will it fit? It better fit, 'cause its NZXT's motherboard going into their case. The one thing I hate about this board... It's actually a pretty board and it looks great in here, 'cause you know, it's the white, like oh, just looks nice. Oh (bleep)! - [Jono] Ohoho! What are you doing? - I just lost a screw, it's okay. Magnetic tip, You can find the screws you lose, it's great. It's fine. Don't worry about it. Ooh, that's going to be close. Oh my God, it closes. Hey, beautiful! Let's throw the power supply and wire it up and see how it looks when it's running. They do give you a lot of room for cable management, which is nice. And these channels up here, it's nice that they've both added little cable channels in here, so you can route it like that if you wanted to. So another thing I'm not a crazy big fan of is a lot of people seem to like this, like, bar design, that kind of hides everything. But personally, I prefer nice rubber grommets that you can just feed everything through. It still looks really pretty! And the cable management actually does look really good, once you're done. I'm not a big fan of the ones that put their PCIE ones here. I like that it's got this one here kind of near the front, so that's neat. Now then, you've got the rest of your standard case audio. You've got a f panel header, which is very nice, 'cause we don't have to put in the little tiny, like two pin headers. You've got your HD audio, your USB 3. This is an RGB header, it looks like? No! It was a USB-C, cool. I don't know if this board has a USB-C connection on it, but we'll plug it in if it does. Front fan, these are only 3-pin fans. I would prefer if they were 4-pin PWM, but it's not the end of the world. NZXT, I would love, just love, a little bit more headroom. 'Cause I honestly don't even know if I can plug this in from here. I mean, that being said like, so far building in this thing, it's not too bad. Aside from the little, really minimal amount of space to get your 8-pin in. I mean, I also have a pretty beefy cooler, let's be real here. Let's take a fan out. This is a lot better, I actually have room to put my hand in there now. Plug your EPS, your CPU connectors in, before you do any top fans. If we had a fan there, there's no way... There's not a chance I could have gotten that in. This has gotta be one of the easiest to get to filters I've seen. So, definitely props to you guys for that inclusion. I almost didn't take out my slot covers! That's probably for like a vertical card, but I kind of hate these little extra slot cover systems. This stuff is all really tight! All these little things really kind of add up, right? So when you're trying to save a buck when building your PC, you'll think, \"Oh, I'll buy a cheap case and it'll be fine!\" Yeah, sure, once you're done building, it'll be fine. But building will be a nightmare. Like that was what I did for my first like real PC, was I bought like the cheapest case I could find, and it was a mistake! Before I cable manage anything, let's actually test it really quick. Sweet! Always test before you bother spending half an hour cable managing, or you're gonna hate yourself. You might get lucky! You don't usually, but you might. One thing that these guys do that a lot of others don't is this like, top and side channel here. Watch the LTT when we do this properly, 'cause it'll actually take more time to cable manage it nicely. But the Phanteks cases and the Fractal cases, these tend to go a little longer. So like right now, you don't have a lot of room to strap. The Velcro should extend up to right here up to this metal part, 'cause then you'd actually get much better contact. 'Cause like, as soon as I move this, it's going to pop out. So I'm just not going to move it! Another major complaint here is that, like, I'm trying to use their provided straps and their provided, like, loops. And even if these aren't meant for cable ties, in most other cases that have these little loops here, you can put cable ties through them. Or not cable ties, zip ties in them really easily. So I don't know why, even with these tiny ones, I'm like struggling to get it through. Let's just hide all that stuff with the panel! This is killing me. Oh, there we go. This wasn't the most intuitive panel I've had to attach though. But hey, it's an affordable, inexpensive case, that looks awesome, like here, check it out. It's clean. Yeah, so fresh and so clean, right? So this gets pretty easy to put in, it's mostly toolless except for this one screw at the back. And it's got little clips on the inside that it like, pops into when you push it in. I forgot to put this back panel on, too. The worst! I hate these things. We've got just one fan in the front, like this is full stock configuration, and the one in the back. And what I'd really recommend is, you want either positive or negative airflow. You just, you don't want it to be all the same. You don't want equal airflow. You want it to either be pulling through the back or like pushing from the front. So what I'd do is I put two 140s on the front, and then two 120s on the back. The one that's stock on the back here, and then put another up here, and you should have pretty good air flow. Like we'll let Steve tell you whether that's right or not, I guess, but that would probably do it for me. Would I buy an- (interrupted by yelling) (laughs) Hold on, we gotta peel. That was not an elegant peel at all. It looks great. It was okay to build in. Not my best experience, but far from the worst, like so far from the worst. Now that it's actually got this front mesh panel, yeah, I would actually go ahead and recommend the H510 Flow to friends of mine. You don't have to worry anymore about everything in this case just becoming way too hot. Are there better cases for airflow out there? Definitely! At this price point? Probably. But at this point, you're going to be looking more for looks and affordability. And I think NZXT is doing that here. And this was basically unrecommendable before, this gets in the recommendable category, which is better than it was. If you were afraid of this guy because there's no airflow, but you love the look of it? No more worries. Go ahead and get the Flow. I think it's a great improvement on NZXT's case line, and as long as they just keep it up, keep adding small features like this that make a huge world of difference while not breaking the bank, then they've got a pretty good product at the end of the day If you're interested in any of the stuff we showed here today, check out the affiliate links below. And thanks for watching! Subscribe to all of our other channels, and if you enjoyed this short circuit, maybe check out the Meshify that Alex just unboxed recently, that was pretty fun, that's probably my favorite case.",
    "transcript_keywords": [
        "front",
        "case",
        "NZXT",
        "pretty",
        "fan",
        "put",
        "air",
        "cable",
        "stuff",
        "nice",
        "Yeah",
        "cases",
        "Back",
        "Flow",
        "big",
        "cool",
        "lot",
        "air cool",
        "hey",
        "thing"
    ],
    "transcript_entity_values": [
        "Meshify 2",
        "half",
        "Steve",
        "Fractal",
        "USB 3",
        "three",
        "One",
        "4",
        "Series",
        "one",
        "AIOS",
        "8",
        "Davids",
        "Phanteks",
        "2021",
        "PWM",
        "240",
        "Alex",
        "Today",
        "120 millimeter",
        "second",
        "LTT",
        "only 3",
        "IO",
        "Ryzen 5000",
        "more than like $60",
        "two 120s",
        "Jono",
        "Arozzi.com",
        "H510",
        "first",
        "Occhio True Privacy",
        "these days",
        "PCIE",
        "two",
        "120",
        "1080p",
        "30",
        "ITX",
        "Velcro",
        "the end of the day",
        "3060",
        "ShortCircuit",
        "RGB",
        "CPU",
        "at least a year or two ago",
        "140",
        "Rileys",
        "NZXT",
        "Meshify",
        "the early 2000s",
        "today",
        "SSD"
    ],
    "transcript_entity_types": [
        "EVENT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "NORP",
        "MONEY",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "ORG"
    ]
}