{
    "id": "ywpZZZzUp-8",
    "title": "iPhone 7 Case Leak!",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-03-17T12:28:13Z",
    "video_url": "https://www.youtube.com/watch?v=ywpZZZzUp-8",
    "category": "Science & Technology",
    "tags": [
        "iphone 7",
        "iphone",
        "iphone 5se",
        "5se",
        "apple",
        "iphone7",
        "apple iphone 7",
        "i phone 7",
        "new iphone",
        "leak",
        "iphone 7 review",
        "iphone 7 unboxing",
        "iphone7 unboxing",
        "iphone7 review",
        "unboxtherapy",
        "unbox therapy",
        "iphone 7 plus",
        "7 plus",
        "plus",
        "iphone 7 rumors",
        "rumors",
        "iphone 7 vs",
        "vs",
        "iphone 6",
        "iphone 6s",
        "tech",
        "technology",
        "review",
        "unboxing",
        "iphone 7 features",
        "iphone 7 concept",
        "new",
        "iphone 7 leaked",
        "apple inc. (publisher)",
        "apple iphone",
        "iphone 7 vs 6s",
        "iphone 7 leaks",
        "iphone 7 hands on",
        "hands on",
        "leaks"
    ],
    "views": 2824909,
    "likes": 56637,
    "comments_count": 5287,
    "description": "Subscribe for iPhone 7 Unboxing -  Follow me on Twitter for updates -  MORE DETAILS BELOW  This iPhone 7 case leak appears to confirm some speculation that the upcoming iPhone 7 will feature some substantial changes. To start,  the camera layout looks to be enlarged (possibly to accommodate a second lens?). Next, the lack of an obvious headphone cutout on this case appears to confirm speculation that the iPhone 7 will be the first Apple iPhone without a standard 3.5mm plug for universal headphone compatibility. The case for the iPhone 5se is somewhat less interesting, it appears to resemble the current iPhone 5 and 5s almost identically. One last note - There is some thought that Apple will actually manufacture two separate iPhone 7s. An iPhone 7 and iPhone 7 Pro. If this is the case, we may still see a more traditional layout available for legacy minded users (either in the form of rebadged iPhone 6 or a stripped down iPhone 7). Nonetheless, if this case is any indication it appears that Apple will be making some significant moves in the tech space shortly. If Apple really does eliminate the headphone jack it'll be the first significant manufacturer to do so. This decision could further differentiate Apple and the iPhone 7 from Samsung (Galaxy S7) and the remaining Android marketplace. Alternately it may encourage Samsung and others to embrace a 3.5mm-less future. Maybe this is all just a ploy to sell more Beats headphones!  So how will this shift be met? Are consumers ready for an iPhone without a headphone jack? Could a dual lens iPhone 7 become a reality? Leave a comment down below! Are you excited for the iPhone 7 or is it just another iPhone?  iPhone 7 Unboxing - Coming Soon! iPhone 7 Review - Coming Soon!  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://bit.ly/SubUnbox",
        "http://twitter.com/unboxtherapy",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "- What's up guys? Lou here back with another video, and in front of me, I have a scary-looking box as you can tell. That's because it came from halfway around the world, and inside is something supposedly very exciting and dare I say exclusive. This is supposedly a case for the upcoming iPhone 7. That's only five. Seven! Somebody got in touch with me. You may have head of him. His name is Sonny Dixon. He's made a name for himself leaking out Apple components. This is no different. Well, my understanding is that these cases are fabricated in advance based on mock-ups of the upcoming devices. So, apparently, the iPhone 7 will be a little bit different than the last one. And, hopefully, this case will give us some insight into what those differences might be as long as I don't break it. Now, with these boxes from China, it's always a bit of a mystery on how to get inside. Found the right spot to cut. Alright, so. Ooh, seven. See the number seven? That says it all. Oh, and 5se. Apple rumored to also put out a smaller iPhone this time around to go with the flagship product. Okay. Ooh. Ooh! This, to you, probably looks kind of anti-climactic. And really it is. This is, you know, the initial stages of fabrication. The 5se on the other hand, as you see there, that's a dinky little iPhone. You mind passing me the iPhone 5? Loosely based on this device, it looks almost identical. Now, granted, the volume rockers here don't quite line-up. We are probably going to see some slightly different curvature to the body of the 5se. The previous version, this one here, kind of a block design. What we're probably going to see is something more similar to the 6 and 6s at least just in this variation here of the curvature around the side comparatively speaking. I do notice that the volume buttons on this guy are still circular. Now with the 7, what we really want to do here, is kind of compare the layout. I also have an iPhone 6 case for the purposes of this evaluation. One thing stands out to me is the unusual shape of this camera cutout. This time around, we have a much larger opening which would imply something interesting happening in the camera department. Potentially a bigger piece of glass. Potentially a coupla lenses? Volume rockers appear the same. Hold switch location very similar. Power switch, etcetera, and even the bottom of the device though... The bottom of this device here looks to have a pretty large cutout right in that location there a little bit larger than on the other case. Let us take an iPhone 6s, and see just how it fits. Exactly. This now is sticking-out to me along with the camera. Look at the camera. You see that? So, the camera is not lining-up at all. I'm fairly confident in saying we are gonna see some kind of overhaul in the camera department for the upcoming iPhone. The iPhone 7. Can you get a look at that right there? This cutout extends way up here onto the actual aluminum material that makes up the iPhone. Normally, that's what you're looking at. You're looking at something that frames the lightning port itself a little bit more obviously. Why, Apple? Maybe something to do with that rumored headphone change from the headphone jack to the lightning port exclusively. Maybe some kind of adaptor. Know what? I think I'm prepared to say something else as well. This headphone jack here doesn't look big, the cutout doesn't look big enough for it. This is a standard EarPod headphone connector. And I was right, that won't go in. Whoah, no dice on standard EarPods. Case itself doesn't allow for a set of headphones to be installed into that headphone jack. Whoah. I think you're just gonna have microphone here. Speaker here. Maybe two speakers and a lightning port. Headphone jack might be dead. Wow. Leave a thumbs-up down below if you like this content, and I will catch you on the next episode. (smooth instrumental hip-hop music)",
    "transcript_keywords": [
        "iPhone",
        "camera",
        "headphone",
        "headphone jack",
        "case",
        "kind",
        "upcoming iPhone",
        "bit",
        "Apple",
        "cutout",
        "jack",
        "upcoming",
        "Ooh",
        "device",
        "Sonny Dixon",
        "lightning port",
        "volume",
        "lightning",
        "port",
        "camera department"
    ],
    "transcript_entity_values": [
        "iPhone 7",
        "6s",
        "two",
        "One",
        "only five",
        "Sonny Dixon",
        "7",
        "China",
        "Seven",
        "seven",
        "iPhone",
        "6",
        "EarPod",
        "the iPhone 7",
        "jack",
        "Apple",
        "Lou"
    ],
    "transcript_entity_types": [
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON"
    ]
}