{
    "id": "yWVrQFrLsNk",
    "title": "Android P Hands-On: Swipe Right",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-05-09T08:54:52Z",
    "video_url": "https://www.youtube.com/watch?v=yWVrQFrLsNk",
    "category": "Science & Technology",
    "tags": [
        "android p beta hands-on",
        "android p hands-on",
        "android p review",
        "android p first impressions",
        "io 2018",
        "google io 2018",
        "google io",
        "android p",
        "mrmobile",
        "michael fisher",
        "teampixel",
        "io18"
    ],
    "views": 258204,
    "likes": 10619,
    "comments_count": 1094,
    "description": "The next version of Android is here, and if you use a phone that doesnt have the Apple logo on the back, this software brings big changes to the way you use it. Namely, a gesture-based interface that recalls the very best of webOS (and, yes, is clearly meant to battle the iPhone X), as well as a bunch of expected improvements from power management all the way up to the volume slider. From Google I/O in Mountain View, California, Im MrMobile  lets go hands-on with the Android P Beta!   [SPONSOR]  This video is brought to you by Thrifter, a new way to save money by shopping based on value (and not hype). Visit Thrifter for great deals on everything from gadgets to home goods, at    [LINKS]  How To Get The Android P Beta On Your Pixel Right Now [Android Central]:   MIchael Josh on Twitter:   SuperSaf on Twitter:    [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S ANDROID P HANDS-ON]  MrMobile's Android P Hands-On was produced following two hours with the Android P Developer Preview 2 / Beta release on a Pixel 2 review device at Google I/O 2018. Conclusions based on non-final software and subject to change.   [MUSIC]  Home Organ by Zach Nicita, available at Premium Beat:   Escapade by Vincent Tone, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "http://thrifter.com.",
        "https://www.androidcentral.com/how-get-android-p-your-pixel-and-how-roll-back-oreo",
        "https://twitter.com/michaeljosh",
        "https://twitter.com/SuperSaf",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.premiumbeat.com/royalty_free_music/songs/home-organ",
        "https://www.premiumbeat.com/royalty-free-tracks/escapade",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Mr. Mobile] The newest version of Android is here, and if your phone doesn't have an apple on the back, it's bringing big changes to the way you use it. From Google I/O in Mountain View, California, I'm Mr. Mobile. Let's go hands-on with Androiod P. (fun techno music) If you've been following along on the Mr. Mobile Instagram channel, you'll know I've been taking photos around the Google Campus this week with an all new Pixel 2. Well, I've just thanked it for its good service by lobotomizing it, and loading it with the Beta version of Android P, that's the sequel to Andriod Oreo due later this year. And it's still so young, it doesn't even have a dessert name yet. Personally, I'm holding out for Pepperidge Farm, but I think Michael Josh probably has me beat with his bet here. Anyway, the point is, this is not yet ready for primetime, but it is ready to show off a new interface. If you wanna do this with your own smartphone, I'll link you to the options at the end of this video. The reason Android P has me so jazzed is this, it's the first time the platform has fully embraced gestures. See, every current Android phone relies on buttons you tap. You tap to go home, you tap to multitask. It's a proven interface, it's one we're used to, but it's also one that can't help seeming crude once you've tried something like the iPhone 10, or the older Blackberry and Palm phones that that phone is based on. When it's done well, it's almost like dancing with the software instead of poking at it. I know, nerd alert, but it's true, these little details are super important. Now, a little tip here from my friends over at Android Central here, when you finish the update, this is not enabled by default. You need to drop in to settings to turn it on. Once you do, your buttons drop from three to two, home and sometimes back. Instead of tapping a square to pull up the multitasking ribbon, now that happens with a swipe. Your recent apps line up horizontally, you can scroll through them and close them by flicking 'em off the screen, it's all very familiar stuff. But there is something new and clever. The home bar is also now a slider, so you can browse your recent apps without having to extend your thumb so far. Bonus feature, you'll be able to copy and paste text between apps in the ribbon, eventually, as you can see it doesn't work at all on my device right now. So there's potential for even deeper interactions in these minimized states. Maybe in some distant future version of Android, these will even replace or augment widgets. Now, one of my favorite features of the current build of Android is the quick double tap to cycle between your two most recent apps. And that's been preserved in P, you just give the home bar a quick pull to the right and then release, like a spring-loaded switch. You even get a nice little haptic buzz when you do it. And if you're wondering how to get to your app drawer, now that the swipe-up is the home gesture, well it's just a slightly longer extension of your thumb. It takes some getting used to, but so does everything. Elsewhere, there are the usual re-thinkings, cosmetic details like the way the alerts pop up on the Always On display, the location of the clock is different, there's more color overall, and gentler, rounded corners, quick replies directly from notifications, which are only these three for now, and also the volume controls have been completely re-thought, they're now friendlier to one-handed users, well, right-handed users anyway. And also, whereas before the rocker adjusted ring volume by default, now it always controls media volume. You use the button on top to control Do Not Disturb mode, or the settings cog below to jump in to more granular sound settings. That's just scratching the surface though. There's a lot going on under the hood, like battery optimizations we get every year, and the new adapted brightness that learns your preferences over time. Again, generally I don't get too worked up over Android version updates, but I think that's because it's been so long since we've had an Android version that genuinely changes the way you use your phone, and does it, in my opinion, for the better. I've been waiting for a platform as fluid as webOS since Palm died in 2011. And while it's too early to say yet whether Android P is that platform, well it's nice that it's no longer just Apple trying to recreate it. To try this on your phone, visit the Android Central link in the description below, and there's a how-to there with a step-by-step guide. And, stay tuned for much more from Google I/O 2018 on my Instagram feed @themrmobile. This video was brought to you by Thrifter, Thrifter is a new way to save money on everything from gadgets to home goods by shopping based on value and not hype. Check out the latest deals at thrifter.com and tell 'em Mr. Mobile sent ya. You folks who stick around to the end are still the best and you get the explanation for my weird sounding voice. Yup, I'm still on the road, still in California, still at Google I/O, so I'm still using my road-mic. That's a Zoom H2n, not gettin' paid to talk about it, just tellin' you what it is, 'cause it's a pretty cool mic. Also, I'm talkin' into a pile of pillows on a hotel bed while kneeling on the floor. Don't ever tell me this career is not glamorous. Love every minute of it though. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "Android",
        "Android version",
        "bringing big",
        "Android Central",
        "Mountain View",
        "current Android phone",
        "Android version updates",
        "Android phone relies",
        "Android Central link",
        "Android phone",
        "home",
        "phone",
        "Google",
        "version of Android",
        "newest version",
        "version",
        "Andriod Oreo due",
        "Google Campus",
        "Mobile",
        "recent apps"
    ],
    "transcript_entity_values": [
        "2011",
        "Pepperidge Farm",
        "Instagram",
        "Palm",
        "Android P",
        "California",
        "three to two",
        "Apple",
        "Pixel 2",
        "Android Central",
        "Andriod Oreo",
        "the Android Central",
        "2018",
        "Mountain View",
        "Mobile",
        "the Google Campus",
        "Michael Josh",
        "one",
        "first",
        "two",
        "Thrifter",
        "later this year",
        "Mobile Instagram",
        "Blackberry",
        "Thrifter",
        "three",
        "this week",
        "Android"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "FAC",
        "ORG",
        "FAC",
        "DATE",
        "GPE",
        "PERSON",
        "FAC",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG"
    ]
}