{
    "id": "YZqBhR985Oo",
    "title": "LG Wing Review: Phones Are Fun Again",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-10-22T23:15:10Z",
    "video_url": "https://www.youtube.com/watch?v=YZqBhR985Oo",
    "category": "Science & Technology",
    "tags": [
        "lg wing review",
        "sliding screen phone",
        "slider phone",
        "slider phone 2020",
        "weird phones",
        "throwback phones",
        "lg swing",
        "swing phone",
        "wing phone",
        "lg vx9400",
        "vx 9400 review"
    ],
    "views": 357853,
    "likes": 15987,
    "comments_count": 967,
    "description": "Sponsored by Surfshark. Get Surfshark VPN at  and enter promo code MRMOBILE for 83% off and 3 FREE months!   [LG Wing Review]  The LG Wing is just the kind of phone Id feature on an episode of my When Phones Were Fun throwback series  if it hadnt just debuted this month! Yes, while the Wing mimics the form factor of 2008s VX9400, its very much a product of 2020, from its 5G chipset to its mammoth OLED displays to its surprisingly innovative Swivel Camera mode. In fact, reviewing the LG Wing was the most fun Ive had reviewing an LG product since I started this channel  and not just because it involved wine tasting, either!   Still, $999 is no small sum, and the LG Wing isnt a flagship so much as it is an experiment  a fact that becomes apparent when you look a little closer at the footage coming out of that special camera. To learn more, join me for MrMobiles LG Wing Review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILES LG WING REVIEW]  MrMobile's LG Wing Review was produced following one week with an LG Wing review device (North American model LM-F100VM) tested on Verizon in Brooklyn and Greenport, NY and points between. Preproduction sample running pre-release software.   MrMobile does not accept compensation from the manufacturers of the products he reviews in exchange for coverage; no payment was provided and no manufacturer or carrier was afforded a preview or copy approval rights concerning this content. The lone sponsor of the LG Wing Review is SurfShark.  Special thanks to David Cogen and David Imel.   [LINKS]  LG Wing Real World Test [TheUnlockr]:   LG Wing Review [Android Central]:   LG Wing Hands-On [Android Authority]:   Every Cellphone Form Factor [gGadget]:   CES 2007: LG VX9400 [Digital Trends]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford Future plc a commission should you make a purchase. This does not affect MrMobiles editorial content. See Future's disclosure policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #lgwing #wing #lg #dualscreen #weirdphone #tech #5g",
    "description_links": [
        "https://surfshark.deals/mrmobile",
        "https://www.youtube.com/channel/UCSOp...",
        "https://youtu.be/5o9rVXA8v6E",
        "https://www.androidcentral.com/lg-wing-review",
        "https://www.androidauthority.com/lg-wing-review-1159766/",
        "https://www.youtube.com/watch?v=A6APySiheqI",
        "https://www.youtube.com/watch?v=BwhD-nbep7k",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.futureplc.com/terms-conditions/",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- A portion of this video is sponsored by Surfshark. Earlier this year, I started a series called, \"When Phones Were Fun\", to kind of celebrate the lost era of experimental design in mobile tech. Well, unbeknownst to me, LG was also waxing nostalgic about some of it's own phones of fun times past including one that enjoyed a blink and you'll miss it cameo in the opening scene of \"Ironman\". Since then, years have gotten longer and phone names have gotten shorter. I'm Michael Fisher, the year is 2020, and the phone is the LG Wing. (electronic music) I spent part of my week with the Wing on a hundred mile adventure from Greenpoint to Greenport, New York. Mostly, so I could test it's gimbal camera in the swivel mode for which it was built. Starting a relaxing Sunday off right with the Zipcar with no coolant, no fuel, fuel card that doesn't work, kinda smells like weed. Good time! But before we hit the road, let's hit the basics. Under the hood, the Wing is essentially an LG Velvet same processor, same storage, similar battery capacity, and same size display, but where the Velvet needed an accessory to reach it's dual display potential the Wing's second screen is just a swipe away. The slider deploys with reassuring consistency and when you stow that screen, it locks into place with a slick clack that never fails to remind me of the T-Mobile Sidekick. (clack) (clack) It's very well built and while its IP54 rating doesn't give it the water resistance as other phones, it is rated to survive splashes from any direction which is at least a leg up over its weird phone cousins in the foldable category. My only complaints about the hardware are the use of a mirror finish on the glass back which is much too easy to smudge. Love how the IMEI sticker didn't come off cleanly so now I gotta Windex the back of the phone and hope it doesn't smudge forever. Am I scratching this? I hate mirror finishes! And it's cumbersome size. I use my Twelve South PowerPic Wireless Charger as a measure for whether a phone is too tall or not and yeah this scores 11 out of 10 Commander Rikers. Audiophiles will be disappointed to hear about the removal of the headphone jack and Quad DAC that LG typically includes in its flagships but this isn't really a flagship. It's an experiment. One which asks the same questions LG started asking a couple years ago, How can a second screen make a smartphone better? And for some use cases, the company's earlier offerings make more sense. For example, side by side displays are better for consulting one document while annotating another. The Wing excels when you wanna consume content while dabbling in another app. You know, stick CBS up top and Twitter down below so you can doomscroll while you disco. Or keep an eye on your Uber while you Telegram. Music while you map. Message while you meet. I don't need to keep going, you get it. LG's software definitely still has its trip-ups which I'll talk about in a moment but the concept makes sense. When its in basic mode it's your typical Android smartphone from feeds to phone calls but when you deploy the wing you get a custom launcher with a carousel of apps optimized for wide screen. Tap on a text field up top and the keyboard pops up down below or check this out, toggle the track pad and you get an honest to goodness mouse complete with pointer and two finger scrolling. It's not really useful in apps but on websites that haven't been optimized for touch its just brilliant. Of course, it's in the crazy gimbaled camera mode that the Wing truly soars, but that same camera is also in some ways a gilded cage. Join dual Davids and me for wine tasting with the Wing after a quick word from my sponsor. It's rare that I get to say this about a sponsor so listen up. I haven't stopped using Surfshark since the first time we partnered. There are plenty of great VPN's out there but Surfshark is the only one with this combination. One, traditional VPN features, like browsing safely from public Wi-Fi or watching geo-restricted movies or TV shows. Let's be honest, you probably got a lot of time on your hands right now. (air whooshing) Two, privacy beyond a simple VPN, HackLock scans the web and gives you a heads up if your email address or passwords are compromised so the first person to take action is you. (air whooshing) And three, consistent and reliable security, without crushing my speeds like so many VPNs. Try Surfshark now at the link below and use promo code MRMOBILE you'll get 83% off a year's subscription and three extra months free. Thanks to Surfshark for sponsoring this video. (electronic music) (clink) Oh ho, cheers. (electronic music) (camera shutter clicks) (electronic music) I shoot a lot of footage on smartphones and let me tell ya, filming on the Wing is more fun than on any other. LG obviously took its cues from the controls on gimbal type smartphone stabilizers so if you've used something like a DJI Osmo you'll know how this works. It quickly becomes second nature to execute a pan or tilt by driving the view with the joystick. As you can see here, it's quite a bit smoother than trying the same shot just by physically moving the phone and it's more comfortable as well. There's a pan follow mode that limits vertical movement so you can try a slow side to side move. There's a lock button to keep a subject centered in the frame even if you're moving the camera around. And there's also a voice bokeh mode to eliminate background noise when you're speaking directly to the camera. While I am speaking directly to the camera, let me tell you something I forgot to record in the voiceover, if you use the gimbal mode a lot, say, more than several times a day, for extending filming periods, you're gonna need charge the phone before the day is out. In basic mode, it's an all day smartphone like most of them are these days but that gimbal mode sucks a lot of power just be advised. My go-to for most of our two day country excursion was the FPV mode which just limits bounce in all axis so you get nice, smooth coverage that's perfect for casual vlogging. Or it would be perfect if this hardware was up to the challenge. As you've probably noticed video from the swivel mode is limited to full HD, which ain't the sharpest around. Just contrast it with the 4k video you can shoot in basic mode here. See, this is the detailed, dare I say crispy, video we've come to expect from a modern phone. Not this half focused mediocrity I have to settle for in exchange for the gimbal. The reason is simple. When the phone is in gimbal mode its using the 12 megapixel (camera frame clicks) ultrawide camera instead of the 64 megapixel primary. LG is doing this so it can offer the extensive stabilization required for the gimbal effect to work but the result is, you know, fuzzy footage. That's compounded by poor nighttime performance and a hobbled selfie shooter as well. It's high resolution and it's cool that it hides away in a little cubby hole when you don't need it and I also love that you can record simultaneously on front and back, but on a phone like this, you have to put an ultrawide lens on your front facing camera because those are the only selfie shooters worth anything to the kind of vloggers who the gimbal mode is expressly targeting. These design decisions are confusing this is an interesting device but it is a confusing device. - Yeah, but you also get to see emo David. - Yeah, that is- (laughs) Now, those compromises get a lot easier to understand when you remember that the Wing is an experiment. LG knows it not gonna move millions of these. The whole purpose of the company's Explorer program is to test the waters to see what flavor of weirdness sticks. So for $999 (cash register chime) this is whatcha get. The question to my mind is, would you pay more for the same phone with proper hardware that could support things like 4k and universal wide angle? For me, the answer is only if LG fixes problems that have been around for way too long. Its color processing on the camera is still too saturated. - Whoa. - [Micheal] Haha, potent. Low light performance, as I mentioned, is still mediocre. And beyond the camera, the software is sluggish. Touch response isn't the best. The Verizon version has a shameful amount of bloatware and the keyboard is just awful and yet despite all that this is my favorite LG phone since I started this channel four years ago. For years, I've memorialized not just the bolder days of the industry in general but specifically LG's experimentation with alternative form factors and bleeding edge materials. I liked the dual screen case, but it was a half measure. The Wing is a product purpose built to push the boundaries and it succeeds far more often than I'd have expected. For the money, most folks will be better served buying something more conventional but products like the Wing prove that phones are indeed fun again. And I couldn't be happier. Speaking of fun, the LG Wing makes a pretty great ping pong paddle as well. Credit to David Cogen at theunlockr for the ridiculous idea. His real world test video featuring this game and much more footage from our adventure in the countryside is linked in the description. As always, LG provided no compensation for this coverage, nor was it offered copy approval or an early preview of this video. They're seeing it for the first time right alongside you. Until next time, thanks for watching, and remember when you're near other people stay safe and mask up while you stay mobile, my friends. (electronic music)",
    "transcript_keywords": [
        "Wing",
        "phone",
        "mode",
        "gimbal mode",
        "camera",
        "gimbal",
        "basic mode",
        "Surfshark",
        "video",
        "Phones",
        "time",
        "Fun",
        "screen",
        "Wing makes",
        "years",
        "lot",
        "camera mode",
        "day",
        "swivel mode",
        "VPN"
    ],
    "transcript_entity_values": [
        "LG Velvet",
        "2020",
        "four years ago",
        "year",
        "Quad DAC",
        "half",
        "When Phones Were Fun",
        "4k",
        "Verizon",
        "the LG Wing",
        "Wing",
        "Wi-Fi",
        "12 megapixel",
        "two day",
        "HackLock",
        "CBS",
        "the year",
        "millions",
        "Twelve",
        "three",
        "my week",
        "10",
        "ho",
        "Ironman",
        "64",
        "one",
        "IP54",
        "the T-Mobile",
        "Sunday",
        "first",
        "One",
        "these days",
        "83%",
        "a hundred mile",
        "two",
        "the day",
        "VPN",
        "Surfshark",
        "years",
        "FPV",
        "the bolder days",
        "Rikers",
        "three extra months",
        "second",
        "VPN",
        "MRMOBILE",
        "Greenport",
        "LG",
        "Earlier this year",
        "New York",
        "Zipcar",
        "David Cogen",
        "Velvet",
        "IMEI",
        "Greenpoint",
        "David",
        "Two",
        "11",
        "999",
        "Twitter",
        "Explorer",
        "Michael Fisher",
        "Davids",
        "a couple years ago",
        "Android",
        "Wing"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "LOC",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "GPE",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "GPE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "ORG"
    ]
}