{
    "id": "Z07ZNsWGC80",
    "title": "xQc Broke his Computer AGAIN... so I Got on a Plane",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-02-22T17:49:29Z",
    "video_url": "https://www.youtube.com/watch?v=Z07ZNsWGC80",
    "category": "Science & Technology",
    "tags": [
        "xqc",
        "fixing a pro streamer's computer",
        "troubleshooting qxc's pc",
        "i went to xqc's house",
        "pc repair",
        "gaming pc",
        "streaming pc",
        "4090",
        "what's it like to shop at microcenter?",
        "how to troubleshoot a pc",
        "is my motherboard broken?"
    ],
    "views": 5159174,
    "likes": 201324,
    "comments_count": 9599,
    "description": "Thanks to Micro Center for sponsoring todays video! Shop Micro Centers BYO Deals:  Build and Save with Bundle Combos at Micro Center:  Check out Micro Centers Custom PC Builder:  Submit your build to Micro Centers Build Showcase:   Popular streamer guy xQc has a problem with him gaming and streaming PC, so I'm hopping on a plane (and stopping by Microcenter) to help him troubleshoot.  Discuss on the forum:   Shop AMD Ryzen 9 7950X 4.65GHz 16-Core Processor:  Shop ASUS X670E-E Strix Gaming Motherboard:  Shop Gigabyte NVIDIA GeForce RTX 4090 24GB Graphics Card:  Shop G.Skill Trident Z5 64GB DDR5-6000 Dual Channel Memory:  Shop Samsung 970 EVO Plus SSD 2TB M.2:  Shop Noctua NH-D15 Brown CPU Cooler:  Shop EVGA SuperNOVA 1300 Watt 80 P Plus Power Supply:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0-:56 What parts should we get? 2:45  we're going to his house... 3:30 I'll bet you $100  6:00 turning on the broken pc 9:03 SURPRISE 9:30 Suspect #1 10:33 I love stickers. 11:00 Clearing the CMOS 13:09 Beware the IO Shield 14:37 a Chicken PC incident 15:45 Let's Test it! 18:00 the $1000 bet 19:10 WE FOUND THE PROBLEM 21:30 New GPU 23:17 Quick Benchmark 25:50 Outro",
    "description_links": [
        "https://micro.center/8w2",
        "https://micro.center/fd5",
        "https://micro.center/y85",
        "https://micro.center/khc",
        "https://linustechtips.com/topic/1489895-xqc-broke-his-computer-again-so-i-got-on-a-plane/",
        "https://micro.center/ht7",
        "https://micro.center/jb2",
        "https://micro.center/84n",
        "https://micro.center/7ng",
        "https://micro.center/2rz",
        "https://micro.center/oin",
        "https://micro.center/3n4",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- [Linus] I tend to take a Chef Gusteau approach to PC building, but popular streamer xQC is challenging my beliefs. I've tried everything from responding to him via video, to popping into his stream of tech tips, to coaching him over the phone. At this point, anyone else would give up, but not me, which is why I. (upbeat music) Am at the airport. After his latest build attempt resulted in a PC that was crashing during his stream, I sprang into action. That's right. When I land, the first thing I'm gonna do is get in a car, drive to his house, and give him some tech tips in person so that hopefully, no one will ever have to watch him do this. - [xQC] It's gonna (beeps) break. - [Linus] Or this. - [xQC] Dude, it can't mount. It's too big. - [Linus] Or this. - [xQC] It literally just doesn't fit. - Ever again. And it's brought to you by our sponsor Microcenter, because we are gonna need some hardware. February is build your own month at Microcenter with great deals all month long. Stay tuned to learn more at the end of this video. It's been an hour since we landed. We've got our car and we've arrived at Microcenter, but we haven't heard back from xQC, so at this point, we don't have enough time to go to him, figure out what's wrong, come here and shop, and then go back. They're gonna be closed. So our only option is to kind of just get one of everything that he had in case something was broken and then bring it there. They have changed the layout of this place a lot. I am standing in what used to be like SSDs and RAM and GPUs land. He's probably got a working cooler, right? I would think so. This seems to be all more valuable. Oh. Oh my God. How am I supposed to get that? As a short person, I feel personally attacked right now. I usually keep my GPUs in the freezer too. This is the cold isle. Realistically, the guy's got no budget, so I assume we're just going 4090 here. I wonder whose money I'm spending right now. Really hope it isn't mine. He had to unlock two locks to get the GPU. There's no way lock picking lawyer could defeat this. One 7950X, please. - [Employee] There you go. - Perfect. And then a kit of RAM. Does he need more than 32 gigs of RAM? Like, he has 128? - [Andy] Yeah. - AM5 can hardly handle two sticks of RAM, let alone four. Microcenter's like, covering this, right? Yeah. Hope so. We've got a new power supply, RAM, GPU, motherboard, CPU. Probably not the SSD. Let's grab one just to get, we can't come back so we're gonna get an SSD too. So tell me something Razer, if I work at Razor and I like, stop gaming, do I get fired? - Do you guys need anything else today? - I don't know. Do you carry our screwdriver yet? - I have one in my car. - That doesn't count. And we're good. We've got everything we could possibly need. He couldn't possibly have screwed it up worse than what we can fix. Is there any wood I can knock on? In and out at only half an hour, but we haven't heard from xQC. So the good news is I got his address ahead of time, which means, I guess we're just gonna show up. You know, Andy, it occurs to me, he's probably not answering because he's probably freaking live right now. - Benchmark will crash a stream. No, no, no. Chat, Benchmark is dangerous. (indistinct) - Okay, well that explains why he doesn't answer my messages. So I guess, we're just gonna show up in the middle of the stream. Hopefully, that was the plan. Okay! Well, we tried dropping a message in the chat. We'll see if they manage to get his attention. Let him know we're on our way, but. - [xQC] Wait, what'd they just say? He's coming over? - Well, at least he knows we're coming now. (laughs) I love your networking setup, by the way. - Oh, the cabling? - This is tremendous. It's good. - If you're running, it's a hazard, but if you're walking, it's not. - Look, the truth is I'd rather see a crappy cable than good wireless. - Yeah, well, welcome to the office! - 'Sup. All right. Where's the broken computer at? This one right here. Okay. - [xQC] It's broken. - Can you explain to me what's broken about it? Because all I saw was you tweeting, \"Oh my god, my computer's broken again.\" - Basically, I think that the motherboard is fried. - You think the motherboard is fried? - How about make a bet? - Okay. - How about a hundred bucks, motherboard's fried. - How about a hundred bucks, it's not just snot on all of those tissue papers. (laughs) - I'm not gonna bet on that. That's unfair. - Ah, got him. No. So you're pretty sure it's the motherboard? - Yeah. - Okay, that's good because I brought a spare motherboard, just in case. - So I built this computer. - Yes. - The software was all Intel stuff. Then I swapped to AMD system. - Yes. Okay. - And I was kind of lazy, I just said, \"I'm just gonna plug it straight in, all the software and just use SSD.\" Just plug it, plug, and play. So then I launch a computer, everything starts jamming. Booting is janky. Finding windows is, everything is not working properly. (Linus laughs) - What happens then is every time it boots, it's really slow, but I get it to working, but then I'm like, let's just full reset. - By reset, you mean, like new windows install, everything? - Full install. Right. - Okay. - So I full reset the computer, but then, I open the PC, we see this like, error 9E46984698560205. It just keep cycling. - Okay. Tell me something. I say it's the RAM. - Yeah. - What do you want to bet? - I'll give you a Benji, I'll give you 100. Let's shake on that, yeah? - Okay. Yeah. The reason that I say it's the RAM, is that right now, AM5 is a very new platform and this is AMD's first generation DDR5 memory controller. And I think you have 128 gigs of RAM. - Yes, then. - Okay. - I did-- - Uh-oh, he didn't gimme all the information! - It was bad from the get-go. I took half the six outs. - Uh-oh. - Because that was my theory. - And even afterwards when everything was installed and everything was running properly, if the computer crashed or I restarted it, long time to boot, it's cycling, 984546981. - Yeah, okay. - And then the next day, I used the capture card. You know, what capture card is, of course? - Yeah, yeah. - The computer just goes. (imitating PC shutting down) And it just, dead. And then it says, \"USB over current.\" - I remember you mentioned that before. - Yeah. - Okay. - It says over current. I don't know what it means. I checked back USBs, top ones. I unplugged all the USBs directly from the mobile and the case itself. Nothing was working. I didn't get a singular good boot, ever. - Even if I didn't have all the information, I'm still gonna honor the bet because I'd love to have something on the line. And I guess, the next order of business for us, is to get this thing set up so I can actually observe some of this behavior. I'm gonna use my magic tech tips fingers and I'm just gonna go to turn it on and it's just gonna turn on and work perfectly, and then I'm gonna have come down here for nothing. Sorry, I'm just talking to your chat. That's cool. - I love that. - Where do you want my spot to be? - Oh, this is Bob. You move, Bob. You move, Bob. - Yeah, I like this guy. Let's go. Come on. - Everything-- - Whoa. He doesn't have water on the. There's no water in the bottom! Yeah, there's a drought here, right? There's always a drought here. - Yes. - I just assume there's a drought here. Is this HDMI only? - [xQC] Uh, yeah. - That's very unusual. - I got both, I got both. Don't worry about it. - Okay, since you have a platform I can use it to ramble. - Okay. - What is it with new GPUs and no HDMI parts? Yeah, it feels kind of lame to buy a $3,000, $2,000 piece of hardware, and like, the most normal HDMI port doesn't work on it. - You got an ethernet cable, by any chance? - What's up? - Ethernet cable? - Uh, yes. - Because I'm gonna have to steal some network. Are you bringing another monitor? - Yeah, because it's the slip boards. - Oh, here's a DP cable. Hello. All right. I'm gonna need a power cable, as well. - I think I have one. It's under my desk somewhere. - Okay. Oh, I know what you're talking about. Yeah, I forget. - It's a jumbo bumbo one. - Okay. Heck yeah, let's. - Okay. - Let's see if it fires up for me here, buddy. - Yeah. - Oh well, it helps to plug this into the wall. - Yeah. Unplug it. - Yeah. Might need to lose some-- - A little bit less festivity but more power. - I mean, it's not really holiday season anymore, so I guess that's probably okay. So we had a little flicker there. Yeah, all right. - You wanna take a look at that air code? 15 orange. - It's always orange. I do wanna open this up just so we can. - Now it's 00. Yeah. Show your numbers. - So 00 could be a bad mount on the CPU. By the way, this is the screwdriver you refused to let me send you. - Ooh. Okay, it's something, it's not cheap at all. It's actually a good product. - Well. - Look at that. And it reminds of the Valorant spike. You seen Valorant spike before? Chat, is that like a spike? - And then, this is our new line of size one that's coming. This one's 3D printed. - Oh, it's more my size. - But if you're into like a little space or something like that. - Yeah, of course. Yeah. - PC building. - Instead of going like this. - Yup. - Going in sideways. I've done a lot of that. - So we're just gonna use the onboard GPU. This could still be bad RAM, but this could be as simple as I just need to pop that CPU out, put it back in and. (finger snaps) we're ready to rock. - Okay, it makes sense. Yeah. - If what's wrong with it is like, kind of a loose connection, then that would explain kind of the flakiness that you're describing where-- - Ooh. - Eventually, it boots. We had an AMD server and this is wild. Wouldn't work every time. - [xQC] Yeah. - And then, you'd just leave it there, like trying a boot for 15, 20 minutes. - Yeah. - And it would turn on. Because the thermal expansion, as it heated up. - Ooh. - Made the pins make contact. (screams) - Don't you think of it? The Xbox ring of death. Remember that? - Yes. - Put the rings, right? You would put towels on the Xbox and boot it up and you would wait until the thermal plates melted a little bit, right? And reapply it, so it would actually boot properly. - So there we go. We're sitting at 15 for a while. We're still getting this USB device over current status detected. Now, when he told me about this, I went, \"Well, the troubleshooting step for this is quite straightforward.\" What you need to do is you need to start unplugging. - Wait, what? That wasn't that. - Oh wait, what the hell that was? It was very loose. - Well, it was loose 'cause it's unplugged. I unplugged all them one by one. I unplugged everything into the over current. And I was thinking, \"The only motherboard is in and it's saying that, it's must be busted.\" - Okay. - It's gotta be. - Now it can be a busted controller and then he's right. Or at least partially right, because it could be more than one thing. Those are the nightmare troubleshooting scenarios. When you've got two problems that can kind of mask each other or stack on top of each other. Wait, what the hell? You see this USB header? - [xQC] Yes, I see it. - It just has like a daisy chain running off it. - [xQC] It does. - This should have a cover on it. If this was just sitting grounded on something, it could be shorting. - I didn't plug it in at all. - Mind you, if that was ever plugged into something else. - Yeah. - Then it could very well be that might have fried the USB controller. - [xQC] Makes sense. - Come on, side panel. - You know what? Every time that I build a PC, actually I go, like, since I'm a streamer and I don't wanna deal with problems, I get a little bit overkill, right? But every time I get overkill, there's a competitive problem. There's something with something with the hardware. - You know what they say about the bleeding edge? - No, I don't know what that means. - Well, it cuts you. - Oh, okay. - We're gonna start with a motherboard swap. You've got some time. Go chill with your chat. Do things. You do whatever you gotta do. Because this is gonna be a little while. Man, I'm back to like my floor days. This is how I used to work on computers back before I owned a table. Okay, we got a lot of stickers in here. You did a good job with the stickers. - The stickers? You like them? - [Linus] Yeah, it's good, it's good. - I love stickers. - You did eventually end up getting this radiator in. Oh, there it goes. You did get this radiator installed eventually, So that's good. - The problem was the actual mount itself for the, but we figured it out with a DIY one or something. - Yeah, yeah. You're good, you're good. I mean, even the cable management. Actually not that bad, you know? - [xQC] Really? - Yeah. Not that bad! There's actually one more thing that I want to try really quick. I wanna do what's called a clear CMOS. So what you do is you pull your battery or some boards will actually have a button for it. This is really high end board, I bet it does. So, if there's a button you can just hold down then that's some convenient, but. - [xQC] So, maybe this right here? This one? - Bing? - It's this or not? - Oh. Oh, hold on. - [xQC] Okay. I'm done, no more touching. - There's not a lot of light in here. Is this kind of your mood? - [xQC] Oh, the lighting? - [Linus] Yeah. - [xQC] I think this house was built in the 1700's. - In the 1700's, okay. - [xQC] It came with the lights; I never changed them. - [Linus] Yeah, it's good. - [xQC] Why you saying it's good? Lighting is terrible. - I think this is gonna do exactly the same thing that it did before. You might actually be right. I think I'm gonna end up owing you a hundred bucks. - It's not too hard. How about you walk us through all the things that can short or burn your motherboard. - So, this over current error is generally caused by some kind of short that causes the controller to malfunction. It can be that you just have USB devices, like, if you've got too much USB on one thing, it'll kind of go. (Linus grunting) It's not really a fuse, but it behaves like a fuse. It'll say like, \"Hey, you're drawing too much here, bra.\" But what's more likely here, is actually that there was some kind of short, if the positive voltage and ground or really anything else, I guess, touched something metal at the same time with that thing that was hanging off there, it's possible that it would short out, which would cause current to just race through it. And then, it might detect an over current event every time. I can look at it a bit closer once I've got it out and we can see if we can find somewhere on the board-- - With a burn? - With like scorch marks. Yeah. - Yeah. - With a burn mark. But modern boards, they make them out of black PCBs now. It's in here. (laughs) - Something also I have noticed, motherboards have become like, just kind of finicky to work with. They just keep changing everything, making things weird. Mainly with like stickers and sticky, and screws, not screws. Like weird grays, what's up with that? - It's half innovation and half marketing bull. (beeps) But it looks cool. - Yeah, I mean, yeah, kind of, sure. I'm gonna get some socks because I think I'm getting, you know, I'm gonna have my feet up there. - Yeah, you do. Do what you got to do. I mean, I don't mind it. You heard it here first. Now one of the things that can cause this USB over current nonsense is if your IO shield has one of those little prongs for grounding, just sticking in and touching the pins. But this board has a built-in IO shield and I did have a look at it and there doesn't appear to be any kind of defect. All of the theories that I've had so far about what might be going on here have not panned out. - Technically speaking, could there be a possible short that isn't like visual, it just kind of happens like a miniature scale? - Yeah, it could just be, I mean. (beeps) Happens, right? Like, it seems to happen to you a lot though, you know? All right, let me just grab my replacement board. So did you pull your boot drive out of here? - Look at you. Are you having fun with this? - Oh, yeah. - All sticky and it leaves residue, it's not one of those stickies things that leaves residue. - If this wasn't there, putting this heat shield over top of it, would actually make it run hotter. - They made a problem, at least they fixed the problem with this. - Correct. You know, you're much smarter than the character you play on TV. - Well, I mean, I. - One of the first things we're going to do is, even though we are going full xQC style and building on the carpet here, we're gonna avoid putting the actual motherboard on the carpet. And I'm also just gonna make sure that I'm touching the chassis, which is connected to the power supply, which is connected to the wall. Okay, now, one of the things we want to do is, we make sure this CPU is super clean, which it is. And I didn't see anything obvious in the socket on the old board that would lead me to believe that it wasn't contacting properly. If I run into any trouble with the liquid cooler, I'm just gonna go straight to this because I know for sure we have the right mounts. And in terms of reliability, air cooling, man. - Yeah. Unless there's like a chicken PC incidence. Sometimes it'll happen in the past. I've had chicken PC, so I had Chipotle and dropped the chicken on the PC and I was doing something, at the time I was busy, and I forgot the chicken was there, and over time, it cooked. And then. - You promise me you won't spill chicken, squid, or coke in my computer, right? - No chicken. - Man, I really hope we don't ruin this board or anything because that would be super awkward. I do not have a way to get another one tonight. - Playing with this goo, like the thing that he put in and, you know, it just kind of dissipated. I thought I would able to play with it, but yeah. And I'm greasy. Chat, look at this. - The main thing here is we're just gonna go slow and steady wins the race. This is a simple operation, board swap. I'm just gonna put this motherboard in. We're gonna run off the onboard audio. That's it. Put like two screws in. Just a little bit of light might be nice. But I got it, there we go. - Oh, but I got these lights like Tom Raider. - Oh, like Tomb Raider? - Oh yeah. Tomb-- - Yeah. - Tomb Raider. - Yeah, yeah. I mean, Tom Rader is like the male version. - Ooh. - With Tom Croft. - Ooh. - All right, we're at the stage now where we can run a quick test and just see if we get the same error. If the hardware is possessed. - Yeah. - If it makes no sense at all. - Yep. - It's the power supply. - Okay. - Okay. 15. Our old friend is back. It will probably power cycle once. It's probably memory training. Anytime you have a new board, it'll do that, memory training. - Oh! - Okay. New CPU installed. - Oh, Isn't it already recognized? - Yeah, oh, yeah. Oh, yeah. This is normal. This just means we have a new CPU in the system. No problem. - It booted. - Yes. - This is farther than the computer's been since the problem happened. - All right, that's good! - That's-- - That's progress! - Okay, progress then. - I love this, repping the Red dragon, man. These guys have fricking taken over. They were in Microcenter today! - Really? - Yeah! Not that long ago these were like, a weird online only brand, right? These guys. Yeah, these guys are freaking everywhere. They have some good stuff. They have some that's just absolute garbage. It's kind of all over the place. Yeah, it's. Don't touch. It's updating bios right now. Then I'm gonna connect something to the keyboard and then you're gonna touch that. - Ah! - You're gonna (beeps) up the whole thing. Don't (beeps) up my motherboard. - I will not. - We don't have a USB over current error anymore, so it does seem like you were right, but jokes on you because I don't carry American money, so. - Jokes on you. - You're getting a hundred Canadian dollars. - Ooh. - Utterly worthless. Good luck spending it. - I was half right, but I'll take the money. - Yeah, well. Okay, hey. - Also, it smells good. - I can still be right too. - Oh, well, I mean, I don't carry cash of any kind. Even if you won, I would've probably been like, \"You know, you got Venmo, PayPal, or I can just scam you, one or the other.\" Before, I've never had a boot under five minutes. It never happened before. - That's weird. That's not right. - [xQC] Oh, there you go. - Hey! All right. Okay, we're going to kick things up a notch and we're gonna plug in a mouse. - [Andy] Is there a way to dim the monitor a little bit more? - Yes, sir. We're all the way down, Andy, that's as much as you get. - [Andy] Yep. - Oh (beeps). What was that? - [xQC] Did it reset? - Yeah. Nothing's perfect. Just like Microsoft. Windows? It's not perfect, but darn it, they're doing their best. - Yeah. - They can build some pretty crap stuff if they really set their mind to it. Teams. Okay. - Are you hating on Teams? (Linus scoffs) - I love Teams. - You like Teams? - Yeah. - Okay. How many people you got on Teams? - Zero. Where's Bing? You use Bing? - No. (scoffs) Bing is about to get amazing. And this, I will bet you a thousand dollars. - Oh, man. - You know how I know? You know Chat GPT? Microsoft has invested over a billion dollars in open AI. - [xQC] Oh, wow. - Bing is going to be the (beeps). I only needed one piece of hardware? That's amazing! - You bought a. Why did you buy GPU for? - I didn't buy nothing. Mirocenter was just like, \"Oh, okay, you're doing a video. Sure. Whatever.\" - Oh, okay, yeah. - And they loaded me up, man. This should be a fast restart. I'm banking on it. - When you're streaming, you have 90 seconds to come back. Stream crashes. - Yeah. - And I could never meet it with this computer. This is why it was important that I get a fast boot. - Well, so, we should time it. Let's let it finish. - Yep. - And then we'll time it and we gotta beat 90 seconds. We can do that. Stream crashed. Now. I am going to shut her down. Oh my God. This does not track on the carpet. I am hurting my chances here. - I would be still, I'd be nervous if this happened to me, So. - Yeah. - We're still on pace. - Okay, sure. So this is a fair test. We're at 11 seconds. 12. - [xQC] Oh, my. - Oh, 40 seconds. - Okay that was. Holy! - 40 Seconds. You wanna reboot again? - OBS, five, wait. - Yeah. - Then I'd be logged in it. - The next thing I wanna do is I wanna shut it down and then I want to get everything hooked back up. Did you ever have the front USBC working? - You know what? No. - Okay, well that makes sense. Oh. - [xQC] Oh, no. - I think it was facing the wrong way. So if you went hard and tried to put that in there. Okay. Can you see how all the little ends? So you can see all the little pins sticking out of-- - Yeah. - The little ends there? They're either crunched or they're burned. - [xQC] Oh my God, I see them! - [Linus] Yeah. - [xQC] Oh, wow. You think that's it? - [Linus] I think that's it. - [xQC] Ooh. - So I think what happened was you pushed on it and then those wires are probably shorted and that's why I couldn't find it, because I only looked at these ones down here because I was trying to chase down that red herring there. - Oh, okay. Yeah. - The one that had the leads coming off because I thought maybe that's what shorted, but it was the USB type C connector. So we don't get to blame Asus for your problems because you can see, I had to bend it back the other way in order to put this in here. We got it. I don't like mysteries. I don't like mystery problems because then if it's solved, but you don't know what you did, you don't know how to reproduce it! And it could come back! - There's not a lot of other wires I feel that are similar to that one. Is that one new? Is that a new thing? - It's pretty new, yeah. - Okay. - Now, do you not hook up your reset switch? Is that a conscious decision? Because you don't wanna bump it? - What's a reset switch? - The reset switch is this one right here. It just hard resets the system. - Okay, yeah. So in terms of the little connectors, is it bing, bing, bang? I only did one square, one square, one rectangle. - You had your power switch and your power LED plugged in. So would you like your reset switch and your drive activity LED? Because I'm here and I can do it really easily. - No. - You do not want them? - No. - Even the drive activity LED? - No. - I can plug it. - No. - I was really worried that we were just going like, to come all the way out here and I'm gonna go. - What? Chat says, \"Show him the clip.\" Oh, okay. You want to see something? - Oh, no. My brother in Christ, what are you doing? (loud thumping) - 'Cause didn't want to go in and it worked out! - If you don't have a Dremel. - Yeah. (loud thumping) - Yeah. It's called percussive maintenance. - Oh, there's a word for that? - Yeah. I found an extra thumb screw in the bottom of your case. That's what was rattling around before. - Oh, yeah, yeah. - Good. We've liberated that. No, I found it already. I found it. - Yeah. I noticed you're using an old phone. - Okay, so what GPU do you wanna put in here? - No, I'm not gonna, you know, suck you guys dry. - Don't worry about it. - Okay. Well. - He wouldn't even let me send him a screwdriver. - Okay, fair enough. Well, you open the box already, so. - Microcenter said goodbye to everything that I left the store with. - Okay, well, a big thanks to Microcenter for the GPU. We're very, very thankful that we can have a test PC then. Well, I mean, we'll end up using it, but yeah. - Phew. These GPUs though, right? - They're massive. - Is this ridiculous or what? Like you could kill a man! (Linus yells) - No, I would die, I would die. I'm impressed You were able to fit those in and as you put in without losing your mind It took me about an hour and my hands were bleeding. I was bleeding. - If you build a computer and you don't bleed a little, I don't know. Did you really build a computer? Okay. Where's my back panel at? You know what? No, that's bad jeebees. - Especially when you're tuck all the wires and you're pushing them in. - Yep. Yep. - Ever seen one of these videos, with the trains, whatever, and they're putting people in? - We're not going to do that. We're going to peel this spicy card. Love it. Hey, thanks Microcenter. - Yep. - Do you keep your start menu in the center or do you move it over to the left? - I'm more of a left guy, but now, I'm learning to use this new thing, I guess. Middle. - Because you can move it. - Oh! - You want it on the left? - Yeah. - Okay. It's on the left now. - Because sometimes you don't want leak. You don't want to have live leaks whenever you're streaming, right? - And there have been some incidents recently that have. - Yeah. - Not gone over very well with that sort of thing. - Yeah. Heard about that. - I've not heard about anything like that though. Yeah, I don't even know what anyone's talking about. - What? - Yeah, what? - What? - Sorry, what? Okay, so this is it. This is your one free one. Next time, it's gonna cost you, if I have to fly down here again. - No chicken and no dragging on the ground. Then, I think I'm good to leave it like that. Just plug it in and never touch it again. Just don't touch. - Should we run at least one game? Just to make sure it doesn't, you know. - Why not? - Whatever. You know what? I'm gonna grab a quick application that's just gonna test a little bit of our temperatures and all that hardware info. 64. - It's called Torture Test. - CPU 100%. No thermal throttling. This is what I like to see. - What does that do? Does it open a bunch of applications that do nothing? - It's calculating prime, prime numbers. Yeah, so there's other stuff like that. Like, you can calculate pie to hundreds and thousands or millions and decimals and it'll just flood your CPU with calculations and help cause it to heat up. - You're busy mining, but nothing. - (laughs) I guess so. Yeah, that's one way of looking at it. This is a good looking game. - It is a good looking game. What? It's actually stable 60. It's not a really going down from 60 and it's like, super harder quality. - And don't forget, I cranked the render resolution. - Yeah. - Man, the physics of these ladders falling apart. Okay, that's not how wood works. I mean, they look more like styrofoam or whatever, but still, it's kind of cool the way they fall apart. - Yep. - [Linus] It gets warm in here. - [xQC] It does. - I really like your acoustic treatment, by the way, in here. - Oh, yeah! - You've got the like three pillows on that wall and then you've got some mattresses over here with Skelly. - [xQC] This is a mattress for that. - And there's a mattress behind the dock. Which is great. Got your body pillow. Our CPU capped out at 85 during that test. I'm not worried about the CPU though. I want to see our GPU hit 56. Okay! (Linus claps) We're good! - I think we're good, yeah. - Yeah! - I'm gonna give you a hug. - All right, let's do it. - Thanks so much for everything. Thanks for coming out. - He's gotta come down like this to hug me. - Yeah. - Embarrassing. It's emasculating. - Thank you very much for coming in. - Thanks, Andy. - And filming everything. - And thanks to our sponsor! Thanks Microcenter for sponsoring today's video. February is Build Your Own Month at Microcenter. They have month long great savings to help you build a new PC. Whether you're a seasoned PC builder or a first time shopper, Microcenter is there to help with their knowledgeable associates. They've got a great variety of products and even better prices, meaning that they can be your one stop shop for all the tech you need. Laptops, computer components, monitors, TVs, networking equipment. You name it, they've got it. And if you want the customization of a DIY build, but you don't want the hassle of putting it together, for a small fee, Microcenter will have one of their trained associates do the work for you. You can even submit your build to their Build Showcase and get 25 bucks off your next in-store purchase. And if you're having any technical difficulties, they've got your back with their certified technicians at their knowledge bar. So what are you waiting for? Head over to the description box and check out Microcenter's Build Your Own Month Long Deals. - You guys are afraid. You guys are so easy to work with, and very, very chill. - This was a blast. - Yeah, thanks. - Hopefully, we'll encounter each other again. - [xQC] We will. - I mean, I know you don't travel much, but if you're ever in Vancouver, hit me up. We'll hang out. - I might be, I have friends there. - Oh yeah? Oh, okay.",
    "transcript_keywords": [
        "Chef Gusteau approach",
        "Yeah",
        "Chef Gusteau",
        "good",
        "Microcenter",
        "thing",
        "Gusteau approach",
        "kind",
        "time",
        "USB",
        "RAM",
        "computer",
        "build",
        "back",
        "motherboard",
        "CPU",
        "things",
        "current",
        "Put",
        "GPU"
    ],
    "transcript_entity_values": [
        "one",
        "I.",
        "Stream",
        "American",
        "100",
        "SSD",
        "Asus",
        "One",
        "Valorant",
        "Tomb Raider",
        "one square",
        "56",
        "GPU",
        "Andy",
        "25 bucks",
        "15, 20 minutes",
        "AI",
        "Christ",
        "64",
        "Xbox",
        "AMD",
        "Middle",
        "three",
        "1700",
        "the next day",
        "Linus",
        "Razer",
        "Microsoft",
        "half",
        "Skelly",
        "Gusteau",
        "CMOS",
        "Tom Croft",
        "first",
        "I. - One",
        "Razor",
        "9E46984698560205",
        "Build Your Own Month",
        "xQC",
        "about an hour",
        "Venmo",
        "Mirocenter",
        "Benji",
        "hundreds and thousands or millions",
        "CPU",
        "six",
        "Vancouver",
        "60",
        "USBC",
        "DIY",
        "Intel",
        "Build Showcase",
        "more than one",
        "four",
        "90 seconds",
        "Chipotle",
        "2,000",
        "Tom Raider",
        "IO",
        "Microcenter",
        "a thousand dollars",
        "984546981",
        "February",
        "100%",
        "PayPal",
        "only half an hour",
        "15",
        "under five minutes",
        "11 seconds",
        "12",
        "HDMI",
        "two",
        "month",
        "128",
        "Tom Rader",
        "Dremel",
        "a hundred Canadian dollars",
        "Microcenter",
        "3,000",
        "today",
        "a hundred bucks",
        "4090",
        "about a hundred bucks",
        "at least one",
        "RAM",
        "tonight",
        "Torture Test",
        "AMD",
        "more than 32",
        "85",
        "USB",
        "40 seconds",
        "five",
        "over a billion dollars",
        "Bob"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "PERSON",
        "NORP",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERSON",
        "MONEY",
        "TIME",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "NORP",
        "MONEY",
        "PERSON",
        "GPE",
        "PERSON",
        "MONEY",
        "DATE",
        "DATE",
        "PERCENT",
        "ORG",
        "TIME",
        "CARDINAL",
        "TIME",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "GPE",
        "MONEY",
        "DATE",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "MONEY",
        "PERSON"
    ]
}