{
    "id": "z0c0mw42iXQ",
    "title": "Ronin-S Unboxing and Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-06-08T00:20:05Z",
    "video_url": "https://www.youtube.com/watch?v=z0c0mw42iXQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "ronin-s",
        "dji",
        "dji ronin",
        "review",
        "gimbal"
    ],
    "views": 489830,
    "likes": 14139,
    "comments_count": 875,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it going? It's Justine. And today we are unboxing and trying out the new DJI Ronin. And I am so excited about this. I know a lot of you guys have been very patiently waiting for it. But guess what? It is here, and we're gonna try it out. But first we have to do the unboxing. So, here it is. (knife snaps open) We're wasting no time today. We're getting into this. (knife slices) (box pops open) Oh, wow. Here it is. Let's do the official opening. (lock clicks) Everything is so perfectly organized. So the great thing is this has fast charge, so in two hours and 15 minutes that will give you a full charge. So since this probably isn't charged, I'm gonna have to do that after I unbox. First things first, let's see what we have in here. Looks like this is our little USB pouch and cables. Extra bolts, screws, little accessories, allen wrench. There's a lot of stuff in here. Next, we've got our mounting plates. So this is where you would actually put your camera. Got some velcro. Got a charging brick. USB is right there. So, we've got this handle here which also doubles as a tripod. So this is great, because if you are out in the field you don't have to completely rely on handheld. You can actually set it down. K, so here's the handle. So this is where you'll actually be attaching the gimble to. The battery's also inside of here. And this can just screw right here into the tripod. Here's our battery levels, which is only at one, so we're gonna definitely have to charge this. Here is the gimble itself. Let's get this thing outta here. As gently as possible. You gotta come out of here bud. So you just attach the gimble right here to the handle. (clicks into place) There's a little lock switch right here, so you can just flip that there to make sure it's locked into place. And there you have it. So, I think the trickiest part for me is usually getting these things to balance properly. I'm hoping that it won't be too difficult. So, let's see what we can do. Let's get this thing to balance, without having a camera on it or it being turned on. That's pretty good. So the Ronin retails for $699. There'll be a bunch more accessories available later this year. Like a dual handle system, external focus motor, and a gimble mounting system. It has four modes. These three are customizable. And of course, it does have sport mode. It has superior stabilization. It can hold up to 8 lbs, and has an integrated camera control. There's automated features like panorama, timelapse, motionlapse, track, and rule 360. And with USB, it has the ability to power your camera and accessories. So with the joystick, this is really great, because this will give you one-handed controls. So you don't have to worry about messing around with other things. You can just basically control everything with one hand while you're on the go. So the camera that I'm using, this is the A73 and I have this 18 mm on. And this is going to be a nice wide angle view. It's also fairly light cause I didn't wanna have anything that was too heavy. I did set this up inside of the house, just to make sure everything was working, but I'll give you guys a quick little run down of how this all works. So you basically want everything to be perfectly stable before you turn it on. So we have these two base plates. There's this little riser one that I put on, because this lens is a little bit wider. So now we're gonna slide this on. There's arrows to tell you (laughs) which way is forward. Thank you DJI. So now we want to make sure this is pretty stable. And you can adjust-- Oh gosh! Ever so slightly, but don't worry because there is a catch here, so your camera will not fall off. That looks pretty good. There's a little lock over here. So, once you're happy with how everything is looking, lock it up. There's other adjustments that you can make, but I already have those pre set up so this would be fairly simple. That looks pretty stable. Now let's turn it on. Turn this one on first. And then there's also a power button on the gimble that you have to turn on. (camera dings) Yes. That's a sound that I like! So, what's great about this is you can use it in handheld mode. There is a little trigger here, so you can basically control the entire camera right here with one hand. There's a record button. There's also this little M button which will switch into different user modes. Right now I'm in three, cause that's the first one that I set up, which you think that I would have set up number one first, but I didn't. (laughs) One of the most important things to know is this. (camera button clicks twice) The double tap of the trigger. That'll bring your camera back to center. So, if you think things are not going the way that they should, just double tap and it will bring it back. Hold the trigger down, and that will keep the camera just how ya have it. Super smooth. Super steady, and locked on. And here's what happens if you don't have it locked. Yup, (laughs) it won't stay locked. The triple tap is pretty much a vlogger favorite. It'll bring the camera all they way around. So now, it's a selfie Ronin. I'm sure most of you filmmakers, and really serious cinematographers, you're going to be using that a lot, for sure. Double tap, bring it back to the center. Let's talk about the tea. Is that what the kids say? One of the things about some other gimbles, is there is an obstructed view of the screen. So with this there is an unobstructed view. It's a little bit lower, so you can actually see what you're filming. So that, my friends, is the tea. Am I using that properly? So when you first set it up, you wanna connect it to the Ronin app. Mine's obviously already connected. But in here there's a bunch of configurations. Here's where you can customize user one, two and three. You can also go in here. This is where you can do some of the automated features. Capture, panorama, timelapse, motionlapse, and track. So in all of these there's so many different settings that you guys can get into. We're definitely not gonna be able to get into all of these in today's video. There's so many things to do. That would be a four hour video if we went through all of these things. The tea. Sip the tea, drink the tea. I don't know. That's the tea. That's the tea! Let's go make a video. (energetic rock music) Guys, thanks so much for watching. I hope you guys enjoyed this quick little review of the Ronin S. I'm really excited to try this out and shoot some really fun stuff. This thing can do so many things. So I probably will be covering some more of that in another video. But for now this is it. It's pretty awesome. I'll put a link in the description where you guys can check it out and get more information. If you guys have any questions feel free to leave those in the comments below. And if you have anything else you'd like to see me try with this, also leave those in the comments. Don't forget to subscribe. Make sure you like the video, and of course hit the bell cause this is YouTube. I gotta tell you what to do cause they change everything every day. Anyway, let's go. (upbeat rock music) Wow. - Wow. - [Justine] This is so cool. - Me? - [Justine] No. The Ronin. - Oh. - Nah, you have to skip Act like you're excited about it. - Oh, I didn't know I was skipping. (people talk in background) - I feel like if I jump around, it just makes it more dramatic. We're going to lunch. - [Cameraman] Do you want to cut before we're in here, or? - Yeah, you can cut. - [Cameraman] Cool. (upbeat rock music)",
    "transcript_keywords": [
        "things",
        "camera",
        "Ronin",
        "guys",
        "tea",
        "make",
        "pretty",
        "set",
        "thing",
        "gimble",
        "video",
        "USB",
        "Hey guys",
        "handle",
        "great",
        "bring",
        "turn",
        "tap",
        "locked",
        "DJI Ronin"
    ],
    "transcript_entity_values": [
        "18 mm",
        "two hours and 15 minutes",
        "Ronin",
        "one",
        "DJI Ronin",
        "four hour",
        "Justine",
        "three",
        "YouTube",
        "699",
        "four",
        "today",
        "later this year",
        "Ronin",
        "two",
        "the Ronin S.",
        "allen wrench",
        "8 lbs",
        "first",
        "USB",
        "First",
        "One"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL"
    ]
}