{
    "id": "z0ktDGFdTuQ",
    "title": "This Car Changed My Perspective! - Electric Mini Cooper SE",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-07-07T22:33:32Z",
    "video_url": "https://www.youtube.com/watch?v=z0ktDGFdTuQ",
    "category": "Science & Technology",
    "tags": [
        "Mini",
        "Mini Cooper",
        "Electric Vehicle",
        "EV",
        "Range",
        "Battery",
        "Anxiety",
        "Charging",
        "Steering",
        "Driving",
        "Drive",
        "Performance",
        "Comfort",
        "Race",
        "Corner"
    ],
    "views": 537763,
    "likes": 24903,
    "comments_count": 1449,
    "description": "Start your build at   Mini Cooper is a fairly iconic car, but they are small so it's the perfect electric vehicle right? Alex borrowed the Mini Cooper SE for a week to find out.  Thanks to our friends at Openroad Mini Langley for lending us the car for a week! Check them out at    GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.buildredux.com/linus",
        "https://lmg.gg/vbBQc",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- [Alexander Clark] Interesting week to be doing an EV review. It was what like 43 degrees here this week, living in BC, set Canada's temperature record three days in a row and then burned to the ground. Yeah, I'm, I'm, I'm pretty over the temperatures, which is why we need good Ev's, And man, we've got one here today. I'm kind of shocked to say it. Honestly. It's the mini EV and I really like it. Let's have a look. This is more of an old stock EV. It wasn't built from the ground up with electrification in mind. We don't get a frunk. Instead we get a big 'ole battery management system. Oh, it just comes up. It's this right here. If we pulled off the, you know, pedestrian protector, it looks basically like an engine, but instead of fuel rails, it's these high electricity lines. Pretty cool, but also like it has its problems. They claim 180 kilometers of range. It's more like 150. I thought it would be a deal breaker, but in practice, it's not as bad-- more on that later though. One second. This is really hard to get back on. The look overall is, well, it's a mini. You either love them or hate them. It's got this nice little bubbly headlights, kinda looks like a fish, maybe a carp or something up here. It's cute. I like it. Is it $40,000 nice looking? Maybe not. But I guess that is what you get when it's an electric car. Around, you've got like, you know, these nice little mirrors and over here, come on, Andy. Pretty much everything also looks standard, except here you have a plug instead of a normal gas cap. Here, you have support for up to 50 kilowatt, fast charging, which given the size of the battery in this thing is really fast. And around back, you have those nice union Jack tail lights and that's about it. Oh yes. And EV plug logo. It is called a mini and it's certainly lives up to that name with the amount of space you have in the trunk. So you can fit what, maybe two, two fours in here. If you're going into the cabin with your buddies, not that you can make it to your cabin with the range on this thing, but you know, then you lift this up and you have a nice little charging table, and quite a bit of space below that. I almost regret that at this point in the review, I normally get in the back seat 'cause that's going to be, you don't want to use the back seats in this thing. That is for, do I even try Andy? If I'm honest, this isn't as bad as I expected. The seats feel nice. There's not a lot of room, if you're over about four and a half feet tall, you're gonna really struggle sitting back here. But that's fine. I wouldn't expect you to be in there more than like, well, never, if you own this thing. Getting in the driver's seat though, it's, it's a bit of a mixed bag. The seats, I really like, even though they are cloth, they're not all leather. And there's no like electronic adjustments. I don't really care. They're comfortable seats. In here, there's some hard plastics, but overall, the bits that you actually touch are very nice. Like the center console is squishy, right over here it's squishy and goes all the way back. So your elbow, no matter where it is, is comfy. This one has the piano black package which is, $400 for whatever reason. Don't get it. It's terrible. It looks great for about a day, and then someone does... That. And you have a fingerprint for the next six years. It's terrible. Especially these buttons here for the 2021 one, they were like, yeah, we have these nice new piano black steering wheel buttons that are, yeah, it looks terrible after you touch it once. Manufacturers, no piano black, please just, ugh. Now it is pretty clear that the last big generation leap for the mini was in 2014. They have had two facelifts since then, but this really does not feel like a car from 2021, but that's not necessarily a bad thing. You have these super tactile hilt buttons for every single thing that you want to do. It's just so satisfying to use them like this switch for the sun visor. It's just, I would believe that cherry made this switch. It's just so great and like hard buttons for every single thing, you have this little knob down here that lets you go through all of the different screens on this. So you have touchscreen and the knob, both of them kind of suck, but together after using it for a couple of days, you sort of figure out where each one works kinda well and using this infotainment, it's shockingly good. It looks terrible. It's just one of the most putrid looking satin apps that I've seen in quite a while, but it does the job. I would rather use this than what's in the Porsche. One thing that's kind of cool that Andy just told me is that if you zoom out on the map, it shows you your range in the car. So apparently we can get to Whistler right now. I would not try that, but apparently you could. I quite enjoy that when you move the steering wheel, the little display, it moves with the steering wheel. So no matter what you do, you don't have to worry about not being able to see it. That was a huge problem in the Taycan. Another fun little thing you have to sun visors, I guess? Can this one just not go? Oh. That one goes-- Sure. Cool. Let's drive it. But not until after I tell you about our sponsor. Build Redux builds PCs for gamers that deliver high frame rates without breaking the bank, you pay the same price as if you built it yourself. Plus a $75 build fee. Through their online builder, you can select your budget, pick your games, see how they perform and let them build your PC for you. All builds come with a two year warranty. So check the link in the description to start building your PC today. In here we have got my absolute favorite thing, adaptive dampers. So I just put them on soft as they can go. We've got a speed bump here. Speed bumps still aren't amazing. You can't overcome that with a wheel base that's this short, but on the road, it's really good. I quite like the suspension. Now it is slightly annoying that you can't tune the dampers and the steering and the throttle input differently. I do wish that there was individual setting, but for the most part, I just set it to mid mode or sport and call it a day. Actually, we've got a corner here. This thing is hilarious. It is legitimately one of the most fun cars I've ever driven. So you have this fantastic steering, especially in sport mode where it just tightens everything up a bit. And although it's not fast, it is exceptionally quick. Like just, it feels like you have little like two cylinder turbo engine that's always making its maximum boost. It's great. It gives you this nice, fine control to just sort of tuck it into a corner. This is without a doubt the perfect, being a dick hole in traffic car, because you have that instant torque and also pretty excellent sight lines all around you and an incredibly small car, especially with the BMW turn signal that doesn't actually click all the way over. If there's 1.2 car lengths between the people in the lane beside you, you can make it into that spot. You are such an asshole traffic in this thing, and it is fantastic. If you're just going nice and slow and then you hit it, you get like a tiny bit of torque steer. This thing's just fun to drive. They really delivered on that. Now the range, you only get like 150 kilometers. They advertise 180, but then you have to use green mode, which makes the steering bad and the damping settings bad and the throttle response bad. So it's not a fun car anymore. So just don't use it. Now even though like the Taycan had 300, 400 kilometers of range, and this only has 150, my range anxiety was a lot less than this because the battery is small and pretty efficient, so you're not using a whole lot of electricity, but you can just plug it in pretty much anywhere, not have to worry about how fast it is and not at all long after you have a good bit of charge. Cars like this will make a lot more sense for a lot more people as chargers just get installed everywhere. I would really not hate never having to go to a gas station again. But then we come to the most brutal part of this car and that is the price. So this one right here as spec'd is 46,000 Canadian dollars. You are not getting $46,000 worth of car here. Like you saw the interior, you've seen the ride quality. It's not super fast. That's like A-class money. That's Golf R money. You can very easily tell that this is a $20,000 car, with $20,000 worth of battery and motors jammed into it. That said, in BC, you might be able to make a case for it. If I was to charge us at my house on my normal commute, it would cost me between five and $10 a week to keep it charged. Given, I'm normally spending about $70 per week to get to and from work. That's pretty freaking sick, especially given that, you know, all our power is done through Hydro. This is incredibly clean. So I guess how much it makes sense, kind of depends on where you live. Like yeah, sure. It is a lot of fun, but I could have this car with $20,000 in my pocket, if I just got the gas version. If you don't have a charger at your house and you don't have another car and you don't live somewhere where the government gives you good kickbacks, it's really hard to recommend this thing. Now, will we be getting EVs as fun as this in the future? I actually don't know. It's clear that it can be done, but at the same time, this is a 1400 kilogram car. And that definitely adds to the feeling of engagement where you're going around corners. In theory, you can have a lot of fun with an electric car that has about the amount of horsepower a normal person could have. You know, this has 200 foot pounds of torque, 200 horsepower. That's what you're going to get when EV's start becoming mass market. You're not going to have 500 horsepower like a Taycan. I guess, mission complete. EVs can be fun. And I really hope that more fun ones come out in the future. Also massive shout out to Mini Langley and open road for giving this to us. I was able to drive it for a week which, was invaluable because, I really hated it for the first day. And then I got to actually use it and be like, okay, kinda fine, actually. So yeah, I hope that you guys liked this video. Hit like, get subscribed. Have a fantastic day. Let us know in the comments how we can make these better in the future. So long. Oh wait, you guys probably thought that I was going without a Crab Rave! No, it's not! Harman Kardon system in here. It's awesome. Here's some Crab Rave for ya. Have a good day.",
    "transcript_keywords": [
        "thing",
        "car",
        "nice",
        "fun",
        "pretty",
        "kind",
        "lot",
        "Canada temperature record",
        "back",
        "bad",
        "steering",
        "range",
        "good",
        "mini",
        "Canada temperature",
        "make",
        "day",
        "bit",
        "set Canada temperature",
        "Yeah"
    ],
    "transcript_entity_values": [
        "400",
        "EV",
        "46,000",
        "One",
        "1.2",
        "Harman Kardon",
        "one",
        "Whistler",
        "Hydro",
        "the first day",
        "150 kilometers",
        "180 kilometers",
        "2021",
        "Jack",
        "46,000 Canadian dollars",
        "BMW",
        "a Crab Rave!",
        "Taycan",
        "Andy",
        "a couple of days",
        "150",
        "second",
        "Porsche",
        "between five",
        "200",
        "today",
        "Taycan",
        "three days",
        "40,000",
        "the next six years",
        "Alexander Clark",
        "BC",
        "300",
        "20,000",
        "a good day",
        "180",
        "two",
        "two year",
        "Canada",
        "200 foot pounds",
        "Ev",
        "about a day",
        "2021 one",
        "Redux",
        "10",
        "1400 kilogram",
        "this week",
        "500",
        "2014",
        "about $70",
        "Mini Langley",
        "400 kilometers",
        "a week",
        "75",
        "up to 50 kilowatt",
        "about four and a half feet",
        "43 degrees"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "PERSON",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "NORP",
        "DATE",
        "MONEY",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "GPE",
        "QUANTITY",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "MONEY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "QUANTITY",
        "DATE",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY"
    ]
}