{
    "id": "z1oydWSfO4o",
    "title": "The Most Shocking Mystery Tech Yet",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-09-05T15:03:11Z",
    "video_url": "https://www.youtube.com/watch?v=z1oydWSfO4o",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "amazon",
        "tech",
        "mystery",
        "shocking",
        "unboxing",
        "gadgets",
        "mystery unboxing",
        "mystery box",
        "new gadgets",
        "smartphone",
        "projector",
        "drowse buster",
        "umidigi",
        "umidigi z2",
        "ulefone power 5",
        "apeman",
        "austin evans",
        "how to waste on amazon",
        "how to waste"
    ],
    "views": 891675,
    "likes": 20407,
    "comments_count": 688,
    "description": "This episode of Ken likes to shock me features Mystery Tech mailed in from viewers. Oh joy. UMIDIGI Z2 Android Smartphone on Amazon:  Apeman Portable Projector on Amazon:  The DrowseBuster shocking...thing on Amazon:   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://austin.tech/umidigiz2",
        "http://austin.tech/apemanprojector",
        "http://austin.tech/drowsebuster",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin, and today on Mystery Tech, something from the Telly Awards? Yo, okay, okay okay. This... The Telly Award 2018 \"Is The iPhone X Worth It [4K HDR].\" What did you do? - I sent an email, I said hey, we made a thing, and then they were basically like, good job! - So, we won an actual award for the iPhone X video? - Yeah, we got a bronze award which means we did pretty okay. - [Austin] So, for those of you guys who did not watch the iPhone X is it worth it, that is a giant production we did last year when the iPhone came out where we rented an Airbnb. We shot the entire thing on amazing glass, all mastered in HDR. Wes and Ken put a lot of work into making that look nice and now, there's a super shiny award to show it off. The UlePhone Power 5. Whoa! 13,000mAh battery? Thirteen thousand? Wait, what's this? Umidigi Z2. Oh, we got a double cheap smart phone. Well, I'm assuming this is cheap, right? What? (Laughing) Do you see how thick that is? Okay, for reference. This is an iPhone. And this is the Power 5. It actually, not gonna lie, kind of doesn't look terrible. This is going to be the heaviest phone I've ever tried. I mean you've got a USBC port, although no head phone jack? On a phone that's this thick? Okay. I mean we've got a 21 pixel sensor and honestly, it's actually not that bad. It's a touch soft but I mean that's not bad at all. I'm kind of torn with this one because on one hand you're getting a phone that is legitimately different. It's so heavy. It's so thick. It's got such a giant battery. But on the other, does anyone want a phone that's this big? On the other end of the spectrum, we have the Umidigi 2. Yo, whoa! Okay. Well that's definitely a look on the back. Hold on a second. Wow. That's actually super cool. I don't know if you could see that on camera but it totally changes color based on how you sort of adjust it. I can't even imagine two phones being more different. This is super small, sleek. It's got that cool color changing back. This is the giant brick that you use to ask people for money. Threaten people for money. You threaten people for money, that's right? So wait, they're both about $250? Aw man. Okay, you know what? Executive decision. I'm going to spend some time with these. Stay tuned. Next item, please. Letters? Oh wow. These are actual-- I don't want to show them 'cause they have people's addresses on them but these are actual real letters. Oh, this one's from Hong Kong. Building the ultimate Xbox 1x. Whoa! A letter straight from Hong Kong giving me instructions on my next video? Alright. I like this. There's no name, there's no anything. It's just an Amazon parts list with all the things I need to build the ultimate Xbox 1x. We actually should legitimately see if we can do the Xbox 1x based on this. Digital Projector. The Ape Man. Mmmm. Not sure I like that name. As far as a projector goes, it's hard to imagine something being that much smaller than this. Oh yeah, so it looks like it's going to be fully portable. At least based on first glance, it does look kind of bright. I mean, that's not bad. Although if we move it out here, maybe not quite so much. Let's not project on my hand. Let's find something a little bit better. I mean, for video it's not too bad as I watch a Slack ad. Alright. You're gonna want to use this in a very dim environment. And probably the smaller the screen the better. But, especially considering it's going to be fully portable it's not that bad. It's just kind of, well, small as you expect. Alright, this looks very suspicious. The Drowse Buster? The Drowse Buster? What? Drowse Buster is a gadget that can be easily attached to your ear lobes and provide a comfortable massaging effect through a combination of traditional Chinese medicine and modern smart technology to eliminate your drowsiness and prevent you from falling asleep. (Laughing) Wait, wait, wait. Wait, wait, wait. It attached to your ear lobes and keeps you from falling asleep? I feel this is gonna be in the thumbnail, my friends. So, we just pull it out like this. Oh wow, that's it. This is what attaches to your ear. Is this going to shock me? Wait, how does this work? Hold on, hold on. I'm reading some more instructions. I've been burned by this once too many times. Whoa! Whoa! It's like little electrical like shocks to my ear. (Vocalizing discomfort) It's like...It feels almost like a vibration. But it's like shocking me. I can tell, the hair on the top of my ear is standing up. It's not like...(grunts) Okay, it actually hurts a little bit. (Laughing) Man, why does everything always having to be shocking me? I mean, you're not going to fall asleep with that on your ear. You're definitely not going to fall asleep. I kind of want to try it again though. So, gonna hit the button. Oh, I could change the power. Oh no. AH! That's a lot of power, okay. Shouldn't have done that. Ah!",
    "transcript_keywords": [
        "Mystery Tech",
        "today on Mystery",
        "Wait",
        "Telly Awards",
        "Austin",
        "Tech",
        "Mystery",
        "Award",
        "phone",
        "iPhone",
        "Drowse Buster",
        "ear",
        "Whoa",
        "Telly",
        "Power",
        "bad",
        "kind",
        "Hong Kong",
        "Xbox",
        "Buster"
    ],
    "transcript_entity_values": [
        "The Drowse Buster",
        "21",
        "iPhone",
        "Slack",
        "Chinese",
        "first",
        "Amazon",
        "Ken",
        "jack",
        "Xbox 1x",
        "Austin",
        "the Umidigi 2",
        "two",
        "Hong Kong",
        "the Telly Awards",
        "Xbox",
        "USBC",
        "iPhone X",
        "4",
        "Austin",
        "The Telly Award 2018",
        "second",
        "13,000mAh",
        "Drowse Buster",
        "Umidigi Z2",
        "Thirteen thousand",
        "Digital Projector",
        "last year",
        "Yo",
        "about $250",
        "the Power 5",
        "Mystery Tech",
        "Wes",
        "today",
        "Airbnb"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "EVENT",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "MONEY",
        "EVENT",
        "ORG",
        "PERSON",
        "DATE",
        "ORG"
    ]
}