{
    "id": "Z2Cmf_fYgvE",
    "title": "Huawei P9 vs Galaxy S7 Edge Camera Test - Side by Side",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-07-09T05:04:04Z",
    "video_url": "https://www.youtube.com/watch?v=Z2Cmf_fYgvE",
    "category": "Howto & Style",
    "tags": [
        "Huawei P9",
        "Huawei Leica",
        "Camera test",
        "Camera compairison",
        "monochrome",
        "RGB",
        "dual camera",
        "S7 vs P9 camera test",
        "slow motion",
        "Huawei",
        "Lecia",
        "lie",
        "Samsung",
        "Galaxy s7 edge",
        "S7",
        "Android",
        "Smartphone",
        "test"
    ],
    "views": 628645,
    "likes": 6376,
    "comments_count": 1074,
    "description": "There has been a lot of media hype over the Huawei P9 when it was released.  But... has Huawei's 'creative' advertising gotten ahead of them?   Leica didnt manufacture the camera:   Its just *Co-engineered*:   Here is the DSLR Cannon 5D Mark III Fiasco:   Specs of the Huawei P9 can be found HERE:   Either way, lets jump into a side by side video camera comparison.  Its difficult to compare these two cameras on a video level, because the 4K resolution of the Samsung Galaxy S7 Edge is HUGE compared to the 1080p resolution of the Huawei P9.  I upscaled the 1080p footage with my editing software so at least we will be able to check the color and general quality... but just keep in mind that these are two VERY different cameras.   I did check to see if the monochrome lens was adding any detail to the video footage... but from my very basic test, I did not see any difference.  So it is probably only effective for still images.  Ill let you be the judge.   I walked through the stabilization, the front facing camera, and the slow motion features on the cameras as well.   Camera Test Playlist:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://phandroid.com/2016/04/19/huawei-p9-leica-cameras/",
        "https://www.reddit.com/r/Android/comments/4fu43h/joint_statement_leica_and_huawei_coengineered_p9/",
        "http://bgr.com/2016/07/05/huawei-p9-camera-controversy/",
        "http://amzn.to/29pF4LB",
        "https://www.youtube.com/playlist?list=PL0vZL9uwyfOF4-WDmn2MevDJDTZyoP8Gq",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "So today were going to do a camera test between the Huawei P9 and the Galaxy S7 Edge. This has been one of my most requested phones for a while now so Id figured Id give it a shot. So what sets this phone apart from most of the other smart phones? Well the first fact is that it has dual camera lenses. So let me talk about that for just a second. So the lens on the left is a monochrome lens that only takes black and white pictures. And the lens on the right is a color lens that takes color pictures and hypothetically speaking, when you take a picture it combines the images from both lenses into one picture, or one image, so that you get more detail in it. The phone also has Leica printed on it. Leica is known for being a very expensive, but quality, camera company. So Huaweis always been a little creative with the wording on their advertising. In the past theyve said that the Nexus 6P had a solid metal body which turned out not to be true. Theyve also inferred that an image taken with a 4,000 dollar DSLR camera was from this phone. They posted that to their Google Plus page. Ill put a link down in the video description for that fiasco. Once there was proof that the image was taken from a DSLR camera, they retracted their statement, took down the image and issued an apologybut the proof is there. They are creative with their advertising. So lets do a camera test between the Galaxy S7 Edge and the Huawei P9, put them side by side and test and see if the images are really coming from both lenses at the same time. Theres only one way to find out. So both these cameras are mounted in the same rig to it holds them equally as Im walking around. And both phones are fully updated. So the P9 was released a couple months ago so Huaweis had plenty of chances to update their cameras to get them optimized and functioning at the top quality. So were going to start off by recording in 4K. The Huawei P9 does not do 4K, it only shoots in 1080P. So the video size is actually 4 times smaller than what can be produced with the Galaxy S7. So what Im going to do is Im going to upscale the image on the Huawei P9 to 4K so that the images will be the same size. Im not going to lower the quality on the Galaxy S7 to 1080P because I dont want to cripple the test and use less power than what the phone is capable of doing cuz this video is going to be rendered in 4K. So now that both images are the same size Im going to do a walking test. The Galaxy S7 does have OIS, optical image stabilization. The Huawei P9 does not have OIS which means that there is no camera gimbal inside of the phone compensating physically for the image. Both phones do have EIS and Ill show you that in a minute. So the Huawei P9 is supposed to be really good with close up shots. So right now I have both cameras focused in on this white ball right here. You can see how well the macro shots do. So I just dropped both phones down to 1080P. Right now the electronic image stabilization is not enabled so its just using the OIS stabilization. Im going to shake the cameras a little bit. And now Im going to enable the EIS on top of the OIS. Now the EIS, the electronic image stabilization, is turned on on both phones. So Im going to try walking again. Remember that both phones are filming in 1080P. I dropped the Galaxy S7 Edge down to 1080P from 4K. Well do a slow pan in 1080Pbring it up to the skydo a little sun flare. You can also check the white balance with the clouds and see how the colors contrast with each other. So one thing that I really like about filming in 4K is the ability to zoom in on things. Im going to do a little freeze frame and zoom in on that sign. Remember that the P9 is filming in 1080P which is the max resolution and the Galaxy S7 Edge is filming in 4K which is the max resolution that it hasand it has 4 times as many pixels as the 1080P so you can zoom in quite a bit farther. So right now I want to do a little test with the camera lenses themselves. So like I mentioned before there are two lenses: one with a black sensor and one with a color sensor. So if I put my finger over one lens, right now its over the color sensor, the black and white image should still be showing if its using both lenses at the same time. Now Im going to take my finger and put it over the black and white lens. And while Im just watching the footage on my phone, my finger is completely covering up the black and white lens right now. The image is not changing. Now it is uncovered.and covered. Uncovered.and covered. So it looks like that black and white lens isnt doing anything at all while the phone is recording in 1080P. Thats unfortunate. Im going to take some still images as well. This picture is with both lenses uncovered. And this picture is with the black and white sensor covered. Let me know down in the comments below what you thinkis that black and white sensor doing anything to this image quality? Now the phone can also take monochrome pictures, which are black and white pictures, using just one lens. But thats an independent setting on the camera that I had to go into and enable and that turns off the color lens altogether. Before we go any farther, what the heck is this? Its pretty gutsy of a smartphone manufacturer to watermark every single picture you take. Luckily there is an option to disable this wonderful feature, but seriously, this is the equivalent of this. Huawei has had some real crappy ideas. So right now were filming in slow motion. The Huawei P9 can shoot at 12o frames per second at 720p. The Galaxy S7 shoots at 240 frames per second at 720p. You can also check the bit rate as well. So lets try out the front facing cameras for a second. The Galaxy S7 shoots in quad HD which is quite a bit bigger than the 1080p that the Huawei P9 is shooting in. So there are a lot more pixels to work with when youre shooting. So check out the depth of the image, like see how far back the quality goes behind me, as well as the color balance, the white balanceall of the quality that cameras can have. So which camera do you think is better: the Huawei P9 or the Galaxy S7 Edge? Do you think both lenses are being used at the same time? Or is the Leica name and the dual camera just a bunch of marketing shenanigans? Let me know down in the comments below. I have a ton of other camera comparisons you can watch. I will leave that playlist down in the video description as well. Hit that thumbs up button if you enjoyed this test and thanks for subscribing.",
    "transcript_keywords": [
        "Huawei",
        "Galaxy",
        "image",
        "camera",
        "white",
        "black and white",
        "lens",
        "phone",
        "black",
        "phones",
        "cameras",
        "lenses",
        "Edge",
        "images",
        "test",
        "white lens",
        "DSLR camera",
        "image stabilization",
        "color",
        "OIS"
    ],
    "transcript_entity_values": [
        "the Huawei P9",
        "Nexus",
        "12o",
        "two",
        "Leica",
        "Leica",
        "one",
        "1080P",
        "Uncovered.and",
        "Huawei",
        "only one",
        "a ton",
        "4",
        "EIS",
        "Google Plus",
        "a couple months ago",
        "1080P",
        "1080Pbring",
        "The Galaxy S7",
        "first",
        "second",
        "the Galaxy S7",
        "240",
        "the Galaxy S7 Edge",
        "today",
        "DSLR",
        "The Huawei P9",
        "The Galaxy S7",
        "1080P.",
        "P9",
        "the Galaxy S7 Edge",
        "Huaweis",
        "4,000 dollar"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY"
    ]
}