{
    "id": "Z2vlynTXjqA",
    "title": "Asus UX501 Review - A 4K Gaming Laptop?",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2015-05-26T21:57:16Z",
    "video_url": "https://www.youtube.com/watch?v=Z2vlynTXjqA",
    "category": "Science & Technology",
    "tags": [
        "Review",
        "ASUS (Computer Manufacturer/Brand)",
        "Razer",
        "UX501",
        "Gaming notebook",
        "Laptop (Product Category)",
        "Razer Inc (Business Operation)",
        "Gameplay",
        "G501",
        "razer blade",
        "retina",
        "15 macbook",
        "video editting",
        "2016 UX501",
        "2016",
        "UX501VW"
    ],
    "views": 575653,
    "likes": 6617,
    "comments_count": 730,
    "description": "The Asus UX501 and G501 rock GTX 960M video cards and are marketed as thin/portable gaming notebooks. Are they worth the money? Enjoy! Purchase Link -   Music track: Sunset Blvd. - FILI Intro track: Robotaki - Raton Laveur  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/1X5N4Yv",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going guys? This is Dave2D and this is my review of the Asus UX501. So I was really excited for this notebook when it was announced. I think it's spec'd well, I think it looks good and it's made by Asus, a very reputable company. So I was really excited to give it a shot. Now I want to preface this review with one note. There is a twin to this machine called the G501 and that is very similarly spec'd, it's just aesthetically a little different. It's black and red, it's got some red LEDs, but for the most part if you're interested in the G501, this review of the UX501 will probably cover you. Alright, let's do this. This is a pretty plain box, considering that the notebook is from their more premium line, but the unit here has a 2.6GHz i7, a 4k IPS touchscreen, a GTX 960M, 16 gigs of ram and 512 gigs of storage. All of this for $1,500. Underneath the notebook there are three compartments and Asus gives you an Ethernet dongle, mini display to VGA adapter, cleaning cloth, some straps for the AC adapter, some pamphlets and the AC adapter itself. You may not use some of the stuff but they always throw it in, because that's just how ASUS rolls. The top of the notebook is aluminum and like the UX305 it has a brushed radial pattern, but this time it's more of a subtle gray color. The ASUS logo itself is plastic. Now, one thing I really like about the brushed finish is that fingerprints do not show up easily on the surface. The bottom of the notebook is also aluminum. There's two down-firing speakers on the left and right here and four rubber feet that are really grippy. Now, instead of a radial finish like the top, the bottom panel has a more linear brushed finish. Same thing though, fingerprints don't show up easily. Here's a close-up of the bottom. If you're watching this in 4k, you can probably see the finish, but if you're watching this in like 240p well then my footage won't help you. You just have to trust me. And this is a close-up of the top lid with that radial finish. The UX 501 is reasonably thin. It's definitely one of the thinner 15-inch Windows based notebooks at 0.81 inches, but it's still a little thicker than a 15 inch retina MacBook Pro. The build quality and design are really solid and it does feel durable. The edges of the main body around the keyboard have a chamfer to it. It reminds me of the edges of the iPhone 5 and I actually really like this design feature. It kind of removes the sharp edges of the device where you'd be like resting your wrists and stuff and it gives it some style. You can remove the bottom plate there's some T6 screws here around the edge and you got to remove two rubber feet for the last two screws. Inside over here you have the Samsung SM 951 SSD. This is a super-fast drive that we'll get to in a bit. And over here there's 8 gigs of ram that you can remove. The other 8 gigs are soldered on board, but you can't go higher than 16 gigs anyway, so this is more of a replacement thing instead of an upgrading thing. The battery here is a 96 Wh battery. Now they do make a variant of this notebook with a smaller 45 Wh battery to make room for a second drive, but I'll show you later you really want to get the bigger battery. The length and the width are pretty average for a 15-inch Windows machine but it is a little heavier than I thought it would be judging by its looks. It's not that it's a heavy notebook, but Asus markets this device as a pretty sleek and portable gaming machine, and it just feels heavier than you think it would be. On the right side we have a headphone jack, SD card slot, and a pair of USB 3 ports. The SD card does stick out quite a bit when you insert it, like over half the card juts out, so you want to be careful with that. On the left side there is a power connection, mini DisplayPort and an HDMI 1.4. Sadly it's not 2.0, so if you use this HDMI port for 4k output, you're going to be stuck at 30 Hz. And lastly there's one more USB 3 slot. Now supposedly the notebook has an option to support Thunderbolt 2 on the mini DisplayPort. Now I tried connecting it to my Thunderbolt Drive, I couldn't get it to work, so maybe this unit doesn't have that option installed, I'm not sure. I tried to use the mini DisplayPort to connect this notebook to my monitor but I got some weird artifacts. I tried a couple different cables and even a different monitor but the artifacts are always there, so my guess is that it's more of a driver thing, but I don't think this will be a normal problem long-term. The HDMI connection works properly, but, again, it's 30 Hertz at 4k, so yeah it's not very useful to me. The keyboard has a number pad, which is a nice addition, but the overall keyboard positioning gets shifted because of this. You can see that all the keys are kind of shifted over to the left and the directional keys have a weird position as well. I was hitting the up arrow pretty often when I was trying to press shift, but over time I got used to it. And I think most people will as well. The keystrokes feel good, there's plenty of travel and it's pretty tactile, but you do need a little more force to depress the keys than a lot of other notebooks that I've used. And in case you're wondering, the black dot pattern you see on the top of the keyboard is not like a speaker or a fan grill or anything. It's just dots printed on as a design. I should also mention that the backlighting has three brightness levels, even at the max setting it's kind of dim, but it gets the job done. The trackpad is surprisingly not horrible. It's glass, it has a good texture and clicking feels pretty good. I complain about Windows trackpads a lot and even though this one's not perfect. I am content with it and at the very least this one doesn't do that thing where the cursor jumps around randomly, so my books this is actually a pretty decent trackpad. And the webcam, it seems to work fine, so all I know is that it's better than the 12 inch macbook webcam, but yeah 720p and it works. Alright let's talk a little bit about this 4k screen. First, color accuracy isn't great out of the box, after calibration looked better, but I still found it to have like a slight greeny yellow tint. Then secondly and more importantly, this is one of the most reflective glossy screens I've ever seen and it was really hard to film the screen in regular daylight, so I want to apologize up front for this. Now, when you're not in a brightly lit environment, the screen isn't bad. It's an IPS panel 3840 by 2160 touch screen, very vibrant colors, viewing angles are good because it's an IPS, but the brightness isn't quite there. So, when you combine a not so bright screen with a bunch of reflections, it can get really hard to see things in brightly lit rooms. In this shot here you can see the issue clearly. It's a bright window and the reflection on the UX 501 is pretty fierce. The MacBook has a brighter screen and it has an anti-reflective coating. So, it's noticeably reduced. It also costs $1000 more but the bottom line is the reflection struggle is pretty real on the UX 501. At the bottom of the screen hinge you can see that there's an exhaust vent. This design works really well functionally and it keeps the aesthetics clean, so you don't see dents on the back or the side and stuff. The 501 is nearly silent on idle, it's around 20 decibels. But when the fans kick in during renders or gaming it's about 34 or 35 decibels. It's audible, but it's relatively quiet for a gaming notebook. I used the Flir One for some thermals and I ran some gaming benchmarks for about 30 minutes before getting this footage. The UX 501 is on the left and the 15 inch retina MacBook is on the right. Both of these notebooks have similar temperatures at around 45 degrees Celsius at its hottest point. So they have very similar cooling mechanics and even the fan sound pretty similar. I think ASUS did a really good job cooling the UX 501 quietly. The AC adapter is 120 watts. It's pretty average size and weight, but, because it's 120 watts, this thing gets really hot during games, like 50 degrees Celsius hot. I generally don't like down firing speakers. I find the sound quality and the volume really depend on the surface that you place the notebook on. So, if you put the 501 on a table, the speaker sound ok and they can get reasonably loud. When you put it on your lap, because the sound gets projected down towards the ground or directly into your thighs, it kind of muffles the sound and it just makes everything worse. Asus has the Ice Power audio software, but when you're listening from speakers, the different settings don't really make much of a difference. Alright, let's talk about performance. So, remember that Samsung drive, that SM951? This thing is fast. It's faster than my desktop drive. It's faster than my 2014 MacBook Drive and it's similar in speed to the 2015 MacBook Drive. Review of that coming up soon. So, when you combine a supersonic drive, with quad-core processor and a fatty GPU, you get a really good 4k video editing machine. Scrubbing around is snappy and let's don't bug it down very much. All in all, it's a very well-balanced setup for mobile video editing. You just don't want to do it outdoors on a sunny day. Renders are also pretty quick, it takes about 45 minutes for a 10 minute 4k video, and I actually feel like this is one of the best Windows notebooks I've ever seen for 4k video editing. And if you want, you can always hook up an external USB Drive for more complex edits. Playing games in 4k is a different ball of wax. I think we just have to accept that. Mobile gaming in 4k isn't going to happen with this generation of hardware. I mean, it runs, but for any modern game the frame rates are just really crappy. Witcher 3 and 4k gets around 10 to 15 frames per second with stuff on high. But running it at 1080p gets around 45/50 frames per second. But if you want to get over 60 frames per second you want to drop the quality down. You can comfortably hit 60/70 frames per second if you go into medium settings for 1080p. And on a side note I highly recommend this game, I only played it for a bit, but it's really cool if you're into RPGs. Less demanding games do really well on this thing at 1080p, like you can easily hit 80 frames per second on basically anything, like Dota, League, CS:Go, Diablo, all these things run really well at 1080p. Lastly, I want to touch on battery life. So, they claim six hours for regular use, and I got pretty close, around five hours, doing some work and some web browsing, four hours in a bit for watching movies with screen at max brightness and volume at about a third. And I got about an hour and 15 minutes playing games at 1080p, with the screen also at max brightness, volume at around 1/3. Obviously this isn't a perfect notebook, but is it worth you spending 1,500 bucks? Let's do a recap. The UX 501 has a good quality aluminum build. The 4k touch screen has nicely saturated colors, but it's not very bright and the glossy finish is really reflective. The keyboard is positioned a little weird, because of the number pad, but when you get used to it, it's comfortable to use. The trackpad has no physical buttons but for a windows-based notebook it's pretty good. Inside this guy you have 16 gigs of RAM, which is more than enough for gamers and a good amount for video editing. You get 512 gigs of extremely fast storage, which once again, is really nice for video editing. Speakers here... and... they sound okay, but they're definitely not all about that bass. The quad core i7 runs at 2.6 gigahertz and a combo is nicely with the gtx 960m, which is not the fastest mobile video card for games, but it's very respectable and it keeps temperatures manageable. And there's a 96 watt hour battery here that gives the notebook a pretty unexceptional battery life. For $1500 you get some pretty good tech in a nice-looking package. Now, there are some problems, the super reflective screen, the battery life that isn't that great, some speakers that are pretty mediocre, and the whole package is a little bit heavier than we would like it to be. But if you hear things that you don't care about or you just kind of get over them, then this is actually a pretty good pickup. That's the end of the review. I hope you guys liked it and if you did, give me some thumbs, if you didn't give me some of the bad thumbs and if you loved it, hit that subscribe button. It's been nice and I'll see you guys next time",
    "transcript_keywords": [
        "pretty",
        "notebook",
        "good",
        "pretty good",
        "Asus",
        "screen",
        "drive",
        "thing",
        "battery",
        "gigs",
        "video",
        "notebooks",
        "video editing",
        "finish",
        "bottom",
        "review",
        "MacBook",
        "bit",
        "sound",
        "Windows"
    ],
    "transcript_entity_values": [
        "2.0",
        "MacBook",
        "six hours",
        "2014",
        "0.81 inches",
        "501",
        "AC",
        "96 watt hour",
        "around 45/50",
        "15 inch",
        "T6",
        "Wh",
        "MacBook Pro",
        "501",
        "SM951",
        "UX",
        "DisplayPort",
        "1,500 bucks",
        "the Asus UX501",
        "UX305",
        "around 45 degrees Celsius",
        "League",
        "120 watts",
        "about 30 minutes",
        "Ethernet",
        "240p",
        "Hertz",
        "two rubber feet",
        "96",
        "First",
        "UX501",
        "15-inch",
        "2.6 gigahertz",
        "SD",
        "60/70",
        "50 degrees Celsius",
        "around 1/3",
        "3",
        "IPS",
        "four hours",
        "RAM",
        "8",
        "USB 3",
        "four rubber feet",
        "GPU",
        "one",
        "about 45 minutes",
        "1,500",
        "10 to 15",
        "macbook webcam",
        "12 inch",
        "1080p",
        "secondly",
        "about a third",
        "2015",
        "Dota",
        "VGA",
        "45",
        "512",
        "MacBook Drive",
        "1000",
        "HDMI",
        "4k",
        "three",
        "a sunny day",
        "Ice Power",
        "USB Drive",
        "Asus",
        "30 Hz",
        "around 20 decibels",
        "Samsung",
        "around five hours",
        "Thunderbolt 2",
        "Witcher",
        "over 60",
        "80",
        "DisplayPort",
        "about an hour and 15 minutes",
        "second",
        "16",
        "G501",
        "2.6GHz",
        "GTX 960M",
        "two",
        "30",
        "10 minute 4k",
        "2160",
        "35 decibels",
        "ASUS",
        "1500",
        "960",
        "MacBook",
        "about 34",
        "max"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "FAC",
        "TIME",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "TIME",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "TIME",
        "MONEY",
        "CARDINAL",
        "FAC",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "TIME",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON"
    ]
}