{
    "id": "Z3I4CyDWsTU",
    "title": "Speaker Made Of Cardboard - Does It Suck?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-09-19T17:04:35Z",
    "video_url": "https://www.youtube.com/watch?v=Z3I4CyDWsTU",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "speaker",
        "speakers",
        "wireless speaker",
        "bluetooth",
        "bluetooth speaker",
        "best speaker",
        "does it suck?",
        "does it suck",
        "best",
        "2016",
        "apple",
        "iphone",
        "futuristic",
        "invention",
        "iphone 7",
        "smartphone",
        "android",
        "cool gadgets",
        "innovation",
        "inventions",
        "cool",
        "new gadgets",
        "amazing inventions",
        "things",
        "new technology",
        "wireless",
        "new inventions",
        "awesome inventions",
        "amazing",
        "future",
        "samsung",
        "galaxy",
        "awesome",
        "top",
        "s7",
        "test"
    ],
    "views": 2082323,
    "likes": 51024,
    "comments_count": 4340,
    "description": "Unboxing every iPhone 7 -  Pulpop Cardboard Speaker (USA link) -  Pulpop Cardboard Speaker (International) -   Here's a weird one... The Pulpop cardboard speaker. I'll admit it looks pretty cool, unfortunately the sound is not cool at all.  From the manufacturer -  Other than its unique donut shape, this USB rechargeable MP3 speaker is made of recycled pulp. It is ultra light despite its look and size. The sound is amplified by the vibration inside the hollow space of the speaker. After a series of trial and error processes, this speaker was born with unexpected potency of sound volume and quality.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/vv_MLOAytl0?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://amzn.to/2cklBlF",
        "http://geni.us/3uPLyj6",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "*begins video with a beautiful intro* Closed Caption Creators: O_O You know I'm always looking for the weird stuff! Because I got your back in a world of weird. Where else would you find it? And who would you trust? Maybe the ghost busters? Or may be us... PFH Can get an- *imitates explosion(?)* This is a speaker made out of cardboard Why? I have no idea Probably because they could Combined, recycled, pulp material and flat panel speaker technology It's incredibly light! *thud* I have a hard time believing it's going to sound very good to be honest with you. USB to power it up and then it has a 3.5 millimeter jack, to play the music. It's made in Taiwan. Let's check it out. The pulp-pop-, pulp speak- the pulp, pop, pulp speaker PHA You know- PHA *opens box* Okay, what the- *laughs* What the? You know what's weird? When you got a speaker made of cardboard, you send in a card- in some cardboard. *rattles* *paper falls out* There's a manual. *box thuds* CCC: Why would you do that?! That box had so much to live for! _ And then that cardboard gets recycled, and it probably turns into one of these! Isn't that beautiful? One day, you'll become cardboard too. CCC: Oh that's nice- Wait what? Do not disassemble, do not bend, drop. IF the product produces an odor, immediately turn off the device. *laughs* You have a USB as well with a mini jack over here And it looks like a power button on the back here. *clicks* This is more of a hipster type thing Where people come over and you're like, \"You hear that music you're listening to, dude?\" \"Speaker, yeah, it's made out of, uh, cardboard paper...\" \"It's renewable,\" \"My vegetables are raw\" \"Are you getting enough-\" Jack's having a good time today! So we have power, and we have mini jack. Where am I going to this so it stays up here I mean you know... Today we will find out why or why not cardboard has not been the standard material in speakers everywhere. Alright here we go. *clicks* *horrible and loud sounding 'music' plays* *Lew ponders, why someone made this* *lowers volume on cardboard monstrosity* *music changes to 'normal'(?) sounding music* *holds up to camera, and makes it louder to the viewers* *changes to different music, quality still sucks* *stops music* *tries to muster up words, but can't think* This might be the WORST THING That's EVER been on Unbox Therapy It sounds TERRIBLE! But- I- is it ambitious I don't know! Is it like an art piece? Is it only for, the people with raw vegetables? Probably... You're not gonna lose yourself in the music in this baby right here I'll tell you what It ain't gonna happen *tries one more time* You know what the crazy part is? That little tiny cube that you can attach to any surface, sounded way better than this The Rocket-IT (3.0) speaker *'music' plays* CCC: Don't know what that is? Check a few videos before this one. Here's the phone speaker *music plays better* *laughs* The phone speaker sounds better than this giant thing! *static noise* *cardboard speaker plays soft, but still bad music* Listen, I made like, a 1,000 videos here on YouTube Okay? And you order stuff up! I gotta make the moves so you don't have to So you don't see this Amazon page and wonder, \"What is-, what is the world of cardboard speakers like?\" Now you know It ain't that great, and now you have no need to dive into it. Cuz' I did it for you I saw the hot lava And I dove head first And I did it for you CCC: Thanks Lew! :D (We think..) So you can stay away God bless CCC: I thought That speaker sounded ok.",
    "transcript_keywords": [
        "Closed Caption Creators",
        "Closed Caption",
        "Caption Creators",
        "speaker",
        "music",
        "cardboard",
        "CCC",
        "Closed",
        "Creators",
        "Caption",
        "made",
        "weird",
        "jack",
        "pulp",
        "speaker made",
        "plays",
        "pulp speaker PHA",
        "beautiful intro",
        "begins video",
        "thing"
    ],
    "transcript_entity_values": [
        "Amazon",
        "3.5 millimeter",
        "USB",
        "today",
        "Lew",
        "3.0",
        "1,000",
        "first",
        "PHA",
        "Taiwan",
        "PHA *",
        "CCC",
        "jack",
        "Jack",
        "know-",
        "one"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL"
    ]
}