{
    "id": "Z7dlTnCa-Vc",
    "title": "A Charger With Unusual Features...",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-06-12T16:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=Z7dlTnCa-Vc",
    "category": "Science & Technology",
    "tags": [
        "zus charger",
        "iphone",
        "iphone charger",
        "car charger",
        "quick charge",
        "quick",
        "fast",
        "charger",
        "iphone 6",
        "iphone 6s",
        "zus",
        "nonda",
        "smart",
        "smart charger",
        "tech",
        "technology",
        "unbox therapy",
        "unboxtherapy",
        "iphone 7",
        "iphone 6 plus",
        "iphone 6s plus",
        "iphone plus",
        "plus",
        "apple",
        "android",
        "review",
        "unboxing",
        "smartphone",
        "samsung",
        "6s",
        "new",
        "phone",
        "best",
        "galaxy",
        "test",
        "s7",
        "gadgets",
        "apple iphone",
        "galaxy s7",
        "apple inc. (publisher)",
        "android (operating system)",
        "vs",
        "edge",
        "top",
        "smartphone (video game platform)",
        "s7 edge",
        "apple iphone 6s"
    ],
    "views": 967393,
    "likes": 23162,
    "comments_count": 1479,
    "description": "Video you might have missed -   Nonda ZUS Smart Charger -   Yes, the ZUS costs a little more than the average car charger but given the extra features, I think it's worthwhile. You'll still probably find a way to get a parking ticket though.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/UvG_rTTmvmg?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://amzn.to/1VSXUjJ",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys, Lew here back with another video and today, I have something for you, which, I think, I hope is the most advanced, possibly the greatest car charger for your devices. Car charger? Lew, what's the big deal here? I charge in my car, been doing it forever. The drawback, in many cases, is that those chargers are not powerful, they're not fast, not like your wall chargers. That's where this guy comes in. This is a smart car charger. It's called \"Zus\", and it comes with an app. Ensures that you don't misplace your car! This, on the app, has a tracking device. On top of that, it has a parking time alert. If you're like me, you tend to forget that that meter might have run out and now you're getting parking tickets. And one single parking ticket and you basically pay for this thing. Think about it, Jack. The app is available on iOS and Android, this is originally a Crowdfunded device. Charge 2 iPads at full speed, that is, supposedly, 2 times faster than your average car charger. This is the kind of thing where you just take an everyday device like a car charger, been around forever, and you just amp it up a little bit, you just improve it a tiny bit. Well done on the simple packaging, look at the thing. Serious packaging, holy smokes! They said military grade, they meant it. Military grade. Stop yelling at me. So it powers up and it chargers itself and the battery necessary for the bluetooth via the port that it's inserted in. Couple of LEDs up at the top and then 2 USB ports, so 2 people can charge off this beauty. Alright, so I'm gonna go plug this baby into my vehicle outside, come on back with the app booted up. See if we can lose my truck? Okay, this is kinda cool. I went outside, plugged it in, left it there so it's in the little charge port right now, grabbed the location, then I walk away and it tells me exactly how far away I am. So you can see, the truck is in that direction. I park right out front of the office, so that's like 75 feet right now. It'll lead me back if I wanna go there, but the coolest part for parking, I select this little icon here and I can say I paid for 30 min, an hour, 3 hours or I can set a custom time, and then 10 minutes before that time is up, this app will say to me, even running in the background, it'll say: \"Hey, you're running out of parking time, head back and put some more cash in the meter.\" And I can also add multiple Zuses. If I click this little button on the bottom, it'll show me a map and I can either use this area here, just to like guide me, manually like that, or I can use Google Maps to bring me back to that location. Not showing you where that is, at the moment, because we are currently in the Batcave. So let's do- Let's go ahead and set a little parking timer here. This can charge up 2 iPhone 6Ss in 2 hours, where as most car chargers it would be 3 to 4 hours. There we go. We're running out. Yeah, 9 minutes left to go, car's nearby. Okay, so go and uhh... Yeah, deal with your business. Put some more money in the meter. Of course parking is free here, but... Anyway, there you have it! The Zus charger. I dunno, I think it's the perfect gift for Father's Day, I think your father's gonna love you just a little bit more. Like I said, you skip one parking ticket, you pay for the damn thing, right? You gotta pony up the dollars in the first place, of course. 30 bucks for a car charger. But i think it's worth it! (Laughter) It's a thumb, from one of our videos!",
    "transcript_keywords": [
        "car charger",
        "car",
        "greatest car charger",
        "possibly the greatest",
        "parking",
        "charger",
        "greatest car",
        "app",
        "chargers",
        "charge",
        "back",
        "Lew",
        "time",
        "thing",
        "parking time",
        "device",
        "parking ticket",
        "hours",
        "meter",
        "bit"
    ],
    "transcript_entity_values": [
        "Lew",
        "Zuses",
        "75 feet",
        "Crowdfunded",
        "3 hours",
        "today",
        "USB",
        "first",
        "6Ss",
        "3 to 4 hours",
        "9 minutes",
        "Jack",
        "Android",
        "30 bucks",
        "Zus",
        "iPads",
        "2 hours",
        "2",
        "10 minutes",
        "one",
        "30 min"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "QUANTITY",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "TIME",
        "TIME",
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "QUANTITY"
    ]
}