{
    "id": "z_Us_JTMj1I",
    "title": "Sony XZ Premium Review: Clock Stopper",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-07-28T23:01:07Z",
    "video_url": "https://www.youtube.com/watch?v=z_Us_JTMj1I",
    "category": "Science & Technology",
    "tags": [
        "xz premium review",
        "xperia xz review",
        "sony premium review",
        "sony xz review",
        "best smartphone 2017",
        "slow motion video",
        "time warp",
        "mrmobile",
        "michael fisher",
        "android central",
        "best sony smartphone"
    ],
    "views": 558446,
    "likes": 13876,
    "comments_count": 1055,
    "description": "The Sony Xperia XZ Premium is the first Sony smartphone to hit MrMobile's review roster, and it's not playing around. Cutting-edge silicon and a 4K display crammed into an ostentatious and water-resistant mirrored chassis means the XZ Premium makes quite a splash the moment you open the box. But it's only when you fire up the XZ Premium's super slow motion camera and shoot your first video at an absurd 960 fps that you truly understand what a monster this smartphone really is. Join MrMobile for the XZ Premium review!  Special thanks to Clove Technology for loaning the review device used for this video. Get your XZ Premium at    [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  Sony Xperia XZ Premium [Clove]:    [ABOUT THE XPERIA XZ PREMIUM REVIEW]  MrMobile's Sony XZ Premium Review was produced after 14 days with a Sony Xperia XZ Premium review unit on loan from Clove Electronics. The phone was occasionally paired with a Toyota Prius Prime and Casio ProTrek WSD-F20 smartwatch, and received a software update on the final day of testing.   [FURTHER READING]  Android Central's Sony XZ Premium Review:   Here's why Sony phones in the US don't have fingerprint readers:   Rapidnadion's Super Slow-Mo Boats video [shot on XZ Premium]:    [MUSIC]  Up Top by Tonemassif, available at Premium Beat:   Sensational by Cymatix, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "http://clove.co.uk",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/330",
        "https://www.androidcentral.com/sony-xperia-xz-premium",
        "https://www.androidcentral.com/sony-fingerprint-sensors-us-deals",
        "https://www.youtube.com/watch?v=ta7i3RRsbIQ",
        "https://www.premiumbeat.com/royalty_free_music/songs/up-top",
        "https://www.premiumbeat.com/royalty_free_music/songs/sensational",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Voiceover] Do you believe that time is a predator, that stalks us all our lives? Or a companion, that goes with us on the journey? Either way, I think you'd agree that it goes by much too quickly. While there's not yet a machine that can arrest that ceaseless forward motion there is one that can slow it down. I'm Mr. Mobile, and this is the Sony XZ Premium, the smartphone that can almost stop time. (upbeat electronic music) This phone is on loan from Clove Technology over in the UK, and even if they hadn't lent it to me, I'd suggest that interested Americans consider buying it from them anyway, because many of you will not want to get the US version of this device. I'll come back to that later though, because I want to jump right in to what makes this phone special. Spec wise, the camera is similar to many previous modules we've seen on Sony phones with a superior auto mode, to help with photos. And fun toys like augmented reality overlays, so you can see your backyard overrun by dinosaurs, whatever, it's fun stuff. On the more practical side, Sony is one of the last to include a hardware button for its camera, and it's so convenient. Without even unlocking the phone, you can press and hold it to launch right in to the viewfinder, and then half press to focus, and full press to capture. Every phone should have this. Now for that slow mo. While your smartphone probably has a slow motion mode in its camcorder, it probably doesn't shoot any more than 120, maybe at 240 frames a second. That matters because the higher your film speed, the smoother the playback in slow mo. This phone can shoot video at 960 frames a second. That means that one second of video captured on this camera takes between 16 and 32 seconds to play back at normal speeds. I've spent about two weeks with the XZ Premium, and the novelty of high speed filming hasn't worn off yet. I love watching time slam to a crawl when I hit that slow mo button, all those invisible details in the world around us suddenly made visible. It's particularly engaging if you're filming something with a lot of texture variations, like water. I used the XZ Premium to shoot a video for my other YouTube channel featuring scale model boats, and the results were striking at 960 FPS. Now, warping time is hard, even for a phone with the powerful innards of the XZ Premium. See, you can just set it to record in 960 all the time, that only happens when you tap the slow mo button, and even then, you're only getting 0.15 seconds of it, so it can be very difficult and frustrating to master the art of capturing the shot just at the right instant. Also the phone takes a moment to save the footage, so that you can only hit the button about once every three seconds. Finally, the resulting video is a closely cropped 720p, and as with all high speed photography, you need very bright lighting, otherwise you get a noisy mess. But in a world of ever decreasing differences between smartphones, properly done slow motion really is a solid standout. Plus, I'm one of those people who's kind of a sucker for this look. Yeah, the phone's got huge bezels, blocky corners, the glass is slippery and very scratch prone and fingerprinty, there's a lot wrong with it, but to my eye, there's real balance and beauty in Sony's design. A design that's also water and dust resistant. There's more to the package too. It's the only phone you can buy with a 4K HDR display, which is overkill, but is, of course, gorgeous. It also doesn't waste battery rendering ordinary stuff like the UI at that resolution, you only get 4K when appropriate video apps are open. The speakers flanking that display are rich, and offer good separation when you're watching a movie. And the battery life is actually pretty solid, it never died on me before the end of one of my 16 hour days, and there are stamina boosting tricks hidden away in the software. There's also Qualcomm QuickCharge 3.0 aboard, and on the flip side, if you don't need that rapid refill, say if you're charging overnight, Sony will protect your battery health by slowly charging it up to 90%, and then gradually trickling up to full by the time you wake up. Let's talk downsides. The Sony's custom software hasn't changed much in years. It looks really dated, and sometimes forces you to take more steps than you should to go get something done. Switching the camera to 4K mode is a good example. Not only is it an extra step, but you can't switch resolutions while the phone is locked. There's also no optical stabilization in the camera, and photos shot using Superior auto mode have a tendency toward more grain and noise, and I'm annoyed that you can't force HDR mode. Outdoors, the screen backlight isn't bright enough. So the same sunlight you need for slow mo will totally wash out your display. On speakerphone calls, the speakers are too quiet, which is disappointing given their high quality for media playback. My review model also has a bug that turns off the Bluetooth radio the moment the connection goes idle. Finally, the US model has a disabled fingerprint sensor, due to some legal or contractual conflict, which is just crazy, it makes it annoying to unlock and a total nonstarter if you're using banking or payment apps that leverage a fingerprint scanner. If you do get the XZ Premium, and you don't mind a warranty sacrifice, I'd say try to import the international version. That's the one I tested, and the fingerprint sensor works like a dream. Clove is selling this deep sea black version for the equivalent of about 700 bucks. That puts it up in Galaxy S8 territory, and I think in most respects, Samsung has the better overall package, but if you're like me and prefer to carry something a little different, or you're at all interested in slow motion video, you should definitely give this phone a shot. It's kind of a one trick pony, but you gotta admit, it's a pretty cool trick. (boat engine) Jeez. (laughter) Thanks again to Clove Technology for the review device loan, that link is down in the description, right near the subscribe button, please click it, for more videos just like this one landing every week. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "phone",
        "slow",
        "Sony",
        "Premium",
        "time",
        "slow motion",
        "video",
        "Sony phones",
        "slow motion video",
        "camera",
        "button",
        "mode",
        "slow motion mode",
        "Clove Technology",
        "motion",
        "superior auto mode",
        "Clove",
        "speed",
        "press",
        "high speed"
    ],
    "transcript_entity_values": [
        "UK",
        "3.0",
        "Clove Technology",
        "about 700 bucks",
        "up to 90%",
        "half",
        "16 hour days",
        "Qualcomm",
        "Samsung",
        "every three seconds",
        "every week",
        "about two weeks",
        "YouTube",
        "960",
        "more than 120",
        "Mobile",
        "FPS",
        "one second",
        "US",
        "the Sony XZ Premium",
        "0.15 seconds",
        "240",
        "overnight",
        "4",
        "UI",
        "between 16",
        "years",
        "Galaxy S8",
        "second",
        "32 seconds",
        "Americans",
        "the XZ Premium",
        "Sony",
        "one"
    ],
    "transcript_entity_types": [
        "GPE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERCENT",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "TIME",
        "GPE",
        "ORG",
        "TIME",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "TIME",
        "NORP",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}