{
    "id": "ZahGI6vlkqw",
    "title": "Why Do Computers Die? (ft. The 8-Bit Guy) - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-07-30T23:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=ZahGI6vlkqw",
    "category": "Science & Technology",
    "tags": [
        "Why Do Computers Die? (ft. The 8-Bit Guy) - Krazy Ken's Tech Talk",
        "The 8-Bit Guy",
        "Hugh Jeffreys",
        "TRS-80",
        "Apple III",
        "Apple Computer",
        "Mac",
        "PowerBook",
        "Capacitor",
        "Clock Battery",
        "PRAM Battery",
        "Battery Leak",
        "Capacitor Leak",
        "Soldering",
        "Motherboard",
        "Hardware Failure",
        "Broken Computer",
        "Computer won't turn on",
        "Vintage Computer",
        "Vintage Electronics",
        "Mac84",
        "Branchus Creations",
        "Macintosh IIvx",
        "Commodore",
        "Computer",
        "Tech",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer Clan"
    ],
    "views": 268801,
    "likes": 11185,
    "comments_count": 882,
    "description": "The first 1000 people who click the link will get 2 free months of Skillshare Premium:  Why and how do computers die? You go to turn it on and suddenly it's making weird noise, or the screen is flickering, or it just does nothing. How does this happen? Today, Krazy Ken will show you the \"computer killers\", with help from: The 8-Bit Guy, Hugh Jeffreys, Mac84, and Branchus Creations.  Join our channel and get cool stuff (including bonus material with The 8-Bit Guy)!   Subscribe for more tech videos!   Watch more videos like this!    Follow us on Twitter   Like us on Facebook    Krazy Ken's Tech Talk - Why Do Computers Die? (ft. The 8-Bit Guy)  Awesome Tech Channels (Thanks for Helping!): The 8-Bit Guy   Hugh Jeffreys   Bruce (Branchus Creations)   Steve (Mac84)    Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!*   Contact Us    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?    This video was sponsored by Skillshare.  Amazon links are powered by the Amazon Associates Program. *not all Patreon tiers qualify for all rewards #KrazyKen #ComputerClan",
    "description_links": [
        "https://skl.sh/computerclan",
        "https://bit.ly/clan2JGWYhz",
        "http://subscribe.thecomputerclan.com",
        "http://bit.ly/clan2UrG7G5",
        "http://twitter.com/thecomputerclan",
        "http://facebook.com/computerclan",
        "https://bit.ly/clan3hV99qa",
        "http://bit.ly/clan2Ocqo8W",
        "https://bit.ly/clan39Ii2jZ",
        "http://bit.ly/clan2Kdph8z",
        "http://Patreon.com/KrazyKen",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- This episode of Krazy Ken's Tech Talk is sponsored by Skillshare. This is the PowerBook 100 from 1991. This is Apple's first notebook product they ever released. So, let's go ahead, boot her up quick. Plug her in. (ticking) Oh no. (upbeat electronic music) Hi guys, how are you all doing? Really? That's just great. You know, I'm doing pretty great today, too. But this PowerBook 100 has seen some better days, you know. It clearly doesn't want to turn on anymore. So, this sent me down a rabbit hole. I got curious, and I wanted to explore why computers and other electronics break. Like why do they just stop working all of a sudden? So, thanks to the help of Steve and Bruce from the Mac Yak show, Hugh Jeffreys, and the 8-Bit Guy, I was able to get these questions answered, and I will now reciprocate the information I learned back to you right into your eyes and ears. So, what causes a computer to die? Well, for starters, throwing them down the stairwell kind of does the trick. This quote unquote lightly, I guess, used MacBook Air is in pretty bad shape. But, let's be honest, I think we all knew that if you throw a computer down a stairwell, it's just going to break. So, let's go a little bit deeper into discovering what these computer-killing culprits are. And to start, I will be busting out my 8-Bit Guy teleporter. Yeah, it only teleports me to wherever The 8-Bit Guy is. It's kind of limited technology. (teleporter whooshes) So I paid The 8-Bit Guy a visit to learn more about the factors that can harm electronics. But I also wanted to learn about some simple tactics he uses to protect his collection. I tell you, he's got some cool stuff. - This is a prototype of the Commander X16, a Lobo Max, which was donated to me, but that's one of my more proudest possessions. (laughs) This looks like almost something out of a horror movie. These are Teddy Ruxpins. (laughs) But I wrap up a lot of stuff that I store up here in this plastic wrap, try to keep the dust out. Got a Tandy Coco here and a Magnavox Odyssey 2 under there. I do have very heavy UV filtering tint on these windows because I do store a lot of stuff up here. You may notice a lot of these of course are wrapped up in foil and plastic wrap. And I usually do that if it's something that I've already restored or something that's in really good shape because I'm trying to keep it from getting yellowed. I bet you can guess what this one is by the shape. That's the B. Meowsic Board. (laugh) - Yeah, that's the cat one. (laughs) The whole dust-proof thing was a good idea. That got me curious about how dust can affect a computer. And one way is it can actually be an accomplice to moisture. If your computers are in a damp or humid environment and dust is present, which it usually always is, the moisture can absorb into the dust. And the computer's airflow can suck it in. Even if the computer isn't operating, moisturized dust can still settle inside the computer which can increase the possibility of damage such as electrical shorts or corrosion. This damp dust will just cake itself onto surfaces. Okay, so that culprit was a little easy, too. But now let's crank it up a little bit and talk about a critical component that can cause hardware failure: capacitors. If you've ever asked people about your broken vintage computers, you've probably heard the phrase \"recap the board\" a billion times. General, good advice there, excellent. Because capacitors, if they're broken, leaking, old, they can cause a slew of issues. And we'll take a look at those problems in a sec, but first, what exactly is a capacitor? - Believe it or not, I was considered the capacitor specialist back when I worked at Mouser Electronics. Well, it depends on the type of capacitor, actually, but like the electrolytics, the can-like capacitors, they've just got basically two pieces of foil that are very close together enough that there can be a charge going between them. And of course they're separated by a dielectric. You can unroll a capacitor and, you know, because it's all rolled up inside that can. You can unroll it and it'd be very long and it'd work just as well, like, unrolled, it just wouldn't be a very efficient package design. - So now we know what a capacitor is. Good. But what exactly do they do for us? Well, the short answer is they help our electronics work properly. Capacitors are kind of like mini batteries. They store and release energy. Generally, they store less energy than a battery, but they can charge and discharge way faster than a battery can. For example, a camera flash. A capacitor quickly discharges energy and that energy is converted into a quick flash of light. Many capacitors use highly conductive electrolytic fluid to help them carry out their mission of smoothing the flow of electric current, which is essential so the complex and sensitive components inside your computer can work properly. Think of a faulty faucet. If the water pressure keeps changing, the water will come out sporadically. But if you put a bucket under the faucet and you puncture a hole near the bottom of the bucket, the water will flow out of the bucket smoothly regardless of the faulty faucet's performance. The water resembles electric current, and the bucket resembles a capacitor. So how do capacitors affect our electronics and computers in a bad way? Well, basically, capacitors can only live for so long. The lifetime of a capacitor is generally measured in hours. For example, a 1,000-Hour Cap. This means the capacitor can operate at its maximum operating temperature for at least 1,000 hours. But that doesn't mean at hour 1,001 it just magically fails. It's just a general measurement used to indicate you may experience less than optimal performance after 1,000 hours of use. But truly, this measurement isn't gospel. Capacitors will die when they want to die. And when they start to malfunction, electric currents can't be smoothed out. In our homes, electronics take alternating current, AC, from the outlets, and convert it to direct current, DC. During the conversion, there's often pulses or spikes in the power. Without the capacitor to smooth that flow, components won't function properly. In my Macintosh IIvx, for example, I need to leave to leave this computer plugged in for about an hour before I can even turn it on. This is a symptom of capacitor failure with this particular machine. And yeah, I should get that fixed someday. Bad capacitors can also cause leaks. If you've ever observed old mother boards, you've probably seen tons of corrosion and stains. This type of corrosion can be caused by electrolyte leaking from the capacitors. Capacitor containers have a sealant which holds them together, but over time the sealant could dry and crack due to numerous conditions like excess heat energy, or impact from the computer being dropped, et cetera. And once the container cracks and the electrolyte leaks, it will corrode the board. And remember, electrolyte is highly conductive, that's the point of it. So if it's leaking onto the board, that means the electric current that's in the other components and in the traces on the board is just going to start jumping around and traveling through the fluid, which is just spreading wherever it wants to spread. And that could accelerate the corrosion. So even if it seems like your computer is working properly, there could be a silent killer working its way through the machine. And one day you go to turn it on, and it just doesn't work. However, there are some capacitors that can warn you. They're built in a certain way to let you know that they need to be replaced. For example, in the common can-shaped aluminum electrolytic capacitor, excess hydrogen buildup will bulge the top of the cap. Thankfully, these caps can vent out the gas, so the capacitor doesn't just burst. But it also serves as a warning that the capacitor should be replaced soon. It's also important to note that if you want to clean that fluid off your board, that's great and all, you can do that. But replace the caps still. If you just clean the fluid and you don't replace the caps, well, that's kind of like filling a leaking tire with air. You can fill it with air, but it's just going to leak again. So, you've got to fix the caps, you've got to replace those first, then clean the board. And you'll be good to go. Since we're on the topic of capacitors, I do want to talk about that period of time from 1999 to 2007 where a bunch of faulty capacitors were manufactured. - Gosh, I mean, computers that were made like around 1999 to 2001 or so, there was that whole capacitor-gate thing that a lot of people might be familiar with. And I worked at a computer store as a service manager back then. We were replacing capacitors left and right on like Compaqs and Dells and ViewSonic Monitors and stuff like that because they were just leaking and blowing up all the time. - This \"capacitor plague\" affected non-solid aluminum electrolytic capacitors produced between 1999 and 2007. One of the alleged causes behind this problem was an unknown scientist who left the Rubycon Corporation in Japan. The scientist stole a formula for electrolytic capacitors, and then the formula got stolen from him, and then somehow it ended up in Taiwan, and the formula was actually miscopied sometime during this whole process. And because of this corporate espionage, a bunch of defective hydrogen-leaking capacitors were mass produced. Or so I'm told. You know, part of this story could actually make for a good action thriller. Well, at least a good action thriller for us computer and electronics enthusiasts. And to be honest, until an exaggerated fictional movie is made about this whole thing, I don't know how much I can believe it. (epic orchestral music) Huh. Look at that. All right, so we covered throwing a computer down a stairwell, moisture, dust, capacitor failure, and capacitor leaks which could cause corrosion. And really, you could argue there's a million reasons a computer would die. But there's still two big reasons I want to cover. But I also want to say, yeah, I know I'm covering a lot of stuff in this episode, and I don't want to get too far down the rabbit hole with a single topic too much just because we're going to be here forever otherwise. But, I will say, if you do want to learn more about electronics, then you definitely have to use Skillshare. If you want to learn about electronics, Skillshare has classes for you. If you want to do what I do and make videos and motion graphics, Skillshare can teach you that, too. You can learn about illustration, photography, graphics, programming, programming graphics. Wait, you can do that? Skillshare offers thousands of inspiring classes. It doesn't matter what your skill-level is, beginner, pro, doesn't matter. All you have to do is be curious. I also love that Jordy from the Cinecom YouTube Channel has his own awesome Skillshare classes. I like the way he presents, and I like using him for when I need to brush up on my after effects expression skills or when I want to learn more about the psychology behind creative framing in film. So, if you'd like to get started, feel free to subscribe to Skillshare with the link in the description. And the first 1,000 of my subscribers to click the link will get a two-month free trial premium membership so you can explore your creativity. During the break, I was actually on the phone with Hugh Jeffreys and he would like to share one of his worst hardware horror stories with us later. So, that should be fun. Hey, maybe he can fix my PowerBook 100. Anyway, while we wait for him to get back, let's talk about the next culprit on the list: batteries. Now, I'm not talking about your typical lithium-ion rechargeable batteries like you see in laptops. Although, these do have their own slew of problems. I'm talking about clock batteries. Similar to capacitors, batteries can leak and cause corrosion. Heck, sometimes they'll even explode. Why is this? Well, think of a battery like a small fuel tank. It houses a chemical reaction. These chemicals react and generate power. Over time as the liquid electrolyte breaks down, it produces hydrogen gas, which creates pressure. In addition, the corrosive chemicals inside the battery will slowly eat at the battery's case. With these two factors combined, it's only a matter of time before the battery spits its chemicals out onto your delicate electronic components. Different batteries use different chemicals, but a very common electrolyte in batteries is potassium hydroxide. And when that leaks from the battery, it will react with the carbon dioxide in the air, and it forms potassium carbonate. Another thing to note about battery leaks is how you store your electronics and computers. So, if you have a board, for example, with a battery on it and it's built vertically or it's stored vertically, well, if that battery ruptures and all the chemicals leak out, well, gravity's just going to pull that stuff down and it's going to destroy more of the board. So, keep that in mind when you're storing your computers. So, if you're like me, or The 8-Bit Guy, and you like to collect vintage computers, it's a good idea to make sure those batteries are replaced as soon as you can. Even if they look fine, even if the computer is working properly, really, it's only a matter of time before those things may rupture and cause damage. Now, we come to the final culprit on my list. Cracked solder joints. You know the age-old trick where if something's not working, you just give it a good smack and then it magically starts working again? Well, actually, with a little bit of luck, that trick could work. Solder joints allow electric current to travel between components on a board. If a joint is cracked, the current will struggle to cross that air gap. But depending on the situation, you might get lucky. Gravity might just pull the cracked metal together enough to conduct electricity again. Or maybe that good old smack on the computer just helps that happen and the metal touches and now the current's flowing again. These cracks in the solder joints can be caused by extra stress, such as your computer getting banged around or dropped on the floor. And the damage may be further accelerated by excess heat energy causing the metal to expand. And sometimes, honestly, components just suck. Take the Apple III for example. Apple had a really ambitious goal to design this business computer with a lot of performance with no vents or fans. You know, I wouldn't be surprised if this was a Steve Jobs move because Steve Jobs hated fans. He didn't think they were elegant. But you didn't hear that from me. - Yeah, they're boat anchors, man, they are heavy. It's hard to get this thing up here. They overheated a lot, yeah. - [Ken] I also heard like one of the fixes the technicians told people to do, yeah, you know where I'm going with this. - Yeah. - [Ken] To drop it, like. - Pick it up and drop it. I've heard the same story. Don't know if it's true, but. - Yeah. So because of the overheating, the Apple III received a very negative reputation. And the heat was just so intense inside the computer, the sockets, the metal sockets would just expand enough where the chips become loose and dislodged and the computer starts glitching out. Also, in one of my Tech Misadventures episodes, I though the RAM in this MacBook Pro was faulty. Turns out, the RAM was just fine, but the DIMM slot was cracked. Jay from House of Moth informed me about a common issue in certain Mac models. The solder pads used to connect the slots to the board were just garbage, and they separated easily. If certain components can't contact the board, the computer may still operate, but it will act kind of glitchy. At this point, it's best to re-solder the components and you'll be fine. And with that, it's now time for Hugh's hardware horror story. Huh, that could be like a TV show or something. Anyway, hey, Hugh! - Hey, Krazy Ken! - Hey man. So, now that we're all here, how about you share that story with us? - Now, I've repaired a lot of computers over the years. And there's quite a number that could be classed as the worst sort of repair that I've had to do. Behind me are a few MacBooks that might take that spot. One of which is totally shattered. The screen, the track pad's broken, It's bene hit with something various times and been totally abused. It does still somewhat turn on, so hopefully I can get that one up and running. I've also got a Retina MacBook Pro which is also in a similar state. The screen is falling to pieces. But it also shows signs of life and I was able to get a display output from it, so that should be a very fun MacBook to fix up in the future. I reckon what takes the number one position is a 2011 MacBook Pro that I repaired. I paid only $100 for the item, and it came with a brand new charger, which I already saw as a fantastic deal considering the chargers are around $110 dollars here in Australia anyway. Now, it did require pretty much a complete overhaul. Now, I could have got away with just throwing in an SSD and cleaning it up, but I wanted to make it look as new as I could. I think it looks pretty good now. I've put a custom logo, a custom keyboard in it, an SSD. And it's definitely a MacBook that I'll be keeping around 'cause it's a custom design that I've integrated into it. Thanks, Ken! I'll hand it back to you. - Well, that was truly horrifying. Hugh Jeffreys, ladies and gentlemen. (fake crowd applauds) So really, there's a billion things that can kill a computer. Everything is finite. But I still hope that you had fun taking a look at this stuff with me, and I hope you learned something today, too. And hey, if you want to share your own hardware horror stories, feel free to let me know down below in the comments because I like to hear about those. And I want to give a huge thanks to The 8-Bit Guy for helping with this episode. If you haven't watched his channel, you have to. And while I was over there, I filmed some other bonus stuff, too, so I may post that stuff on a rainy day. In addition, thank you very much, Hugh Jeffreys, for helping out, too, and thank you very much to Steve and Bruce from the Mac Yak show for helping me write this episode. Links to all of these awesome guys are in the lovely description down below, and I highly recommend you check them out. And if you want to support this channel, plus get some perks, feel free to click the Join button below the video. And if for some reason, the Join button isn't there, there's a link in the description for that, too. And if you liked the video, you know what to do. Thanks for sticking with me. Catch the crazy and pass it on. (upbeat electronic music) (electronic tone rings)",
    "transcript_keywords": [
        "computer",
        "capacitors",
        "capacitor",
        "computers",
        "Board",
        "good",
        "electronics",
        "Hugh Jeffreys",
        "Guy",
        "battery",
        "Skillshare",
        "Yeah",
        "stuff",
        "current",
        "lot",
        "Hugh",
        "components",
        "batteries",
        "time",
        "dust"
    ],
    "transcript_entity_values": [
        "Skillshare",
        "Jordy",
        "Ken",
        "Mouser Electronics",
        "around 1999 to 2001",
        "one day",
        "this MacBook Pro",
        "Tech Talk",
        "the Rubycon Corporation",
        "Bruce",
        "Jay",
        "the years",
        "at least 1,000 hours",
        "MacBook Pro",
        "Hugh Jeffreys",
        "Hugh",
        "around $110 dollars",
        "two",
        "Apple",
        "SSD",
        "8",
        "1999",
        "1,000",
        "Retina MacBook Pro",
        "the Cinecom YouTube Channel",
        "about an hour",
        "a million",
        "Teddy Ruxpins",
        "Macintosh",
        "1991",
        "the B. Meowsic Board",
        "between 1999 and 2007",
        "today",
        "Mac",
        "Japan",
        "Krazy Ken's",
        "Krazy Ken",
        "IIvx",
        "some better days",
        "House of Moth",
        "AC",
        "thousands",
        "only $100",
        "first",
        "one",
        "Dells",
        "RAM",
        "Steve Jobs",
        "Taiwan",
        "1,001",
        "MacBooks",
        "1,000-Hour Cap",
        "100",
        "One",
        "1,000 hours",
        "DC",
        "Lobo Max",
        "hours",
        "MacBook Air",
        "2011",
        "ViewSonic Monitors",
        "MacBook",
        "Australia",
        "Compaqs",
        "sec",
        "DIMM",
        "two-month",
        "Steve"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "TIME",
        "EVENT",
        "PERSON",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "PERSON",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "GPE",
        "PERSON",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PERSON"
    ]
}