{
    "id": "ZBDjYzY_6-k",
    "title": "The Best Bluetooth Speaker?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2015-08-02T17:40:34Z",
    "video_url": "https://www.youtube.com/watch?v=ZBDjYzY_6-k",
    "category": "Science & Technology",
    "tags": [
        "ue megaboom",
        "ue roll",
        "ue boom",
        "ue",
        "megaboom",
        "boom",
        "roll",
        "ultimate ears",
        "megaboom review",
        "ue roll review",
        "review",
        "ue boom review",
        "best bluetooth speaker",
        "bluetooth speaker",
        "bluetooth",
        "speaker",
        "speakers",
        "2015",
        "vs",
        "ue megaboom vs",
        "test",
        "unboxing",
        "unbox therapy",
        "best",
        "best bluetooth",
        "sound",
        "bose soundlink",
        "logitech ue",
        "wireless",
        "bluetooth speakers",
        "ultimate ears ue",
        "bose",
        "ue megaboom bluetooth",
        "ultimate ears megaboom",
        "portable bluetooth",
        "bluetooth speaker review"
    ],
    "views": 5081872,
    "likes": 59027,
    "comments_count": 5530,
    "description": "UE MEGABOOM -   These bluetooth speakers from Ultimate Ears are quite surprising. In this video I test out the UE Boom, UE Megaboom and the UE Roll.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/1WB3qbv",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Open your eyes Lew, It's time for another video! What's up guys, Lew back here with another video. And as you can tell, I've got a few items today, it's not just one. This is a big chunk of the lineup, as far the Ultimate Ears portable Bluetooth speakers are concerned, AJ actually put me on to it, he was like: \"Dude, these are the speakers.\" So you can hold him accountable if these things end up sucking. Which I'm pretty sure they don't... popcorn in my teeth... We've got a $100, $200, and $300 price points. And this one... This is the top dog in the food chain over here. It has IPX7 waterproof functionality, 20 hours of battery life, 100 feet of range, And, you can connect multiple units to create a stereo experience. Now the other ones have similar features as well. This little guy here... Which is called the \"Roll\", is also IPX7 waterproof. It's got a little bit less battery life, and a little bit less range. Because it's smaller of course, and less expensive. But, there is an accessory to actually make this one... A \"floatable\" speaker. Floatable... Floatable... Is that even a w-... Floating? But maybe you're in a lake or something, or on a boat... Or even on your pool and you want your music close by. You've got this little guy floating around. It's kinda cute... This one on the left is probably the most boring at all. Also happens to be the one that AJ owns and raves about... Everyday. It doesn't have waterproof capabilities, But... It's water resistant, which is better than nothing. Still got decent battery life... Decent range, And it fits kinda in between price-wise. I assume it fit in between sound-wise as well. I'm g- I'm... I'm gonna do this big one first... Let me see if I-... What I'm doing here... Aww, man. Oh yeah... The names. This is the \"Megaboom\". The \"Boom\". \"Boom\", \"Megaboom\", And \"Roll\". Look at thi- Whoa! Is this also a carrying case? Whoa... OK... That's... Wow... There's a little sticker here... This w- Oh! Look at this! Got a little flat cable... nice and bright, USB... Micro USB... For charging it up, and fits right in there... This thing feels solid as well. Couple of flaps... One for auxiliary and one for your micro USB. You've got your power on this side here as well as a Bluetooth button. GIANT buttons for volume... The power brick, look at that... Bright... You're not gonna lose that. That's gonna me tough to lose. Let's do the little guy here. Real quick... There are applications for each of these, That you can install in Android and iOS. I'll be booting those up very shortly. They ship the whole thing in like... WHAT? Wow! Wow, feels solid... *music playing* Oh... Cool... Same cool cable, no power brick. Let's pair this up...There's three applications installed up here. UE Boom, UE Roll, and Megabooom. I'm gonna launch the \"Roll\" app... Oh! Look at that loading... There's nothing better than... Bluetooth pairing bloopers. Shows the battery life, that's useful... I like it! Pretty straight forward, simple app, power button... Assuming- Volume... Double up, if you wanna add another speaker, EQ... HOW DOES IT SOUND? Sorry, I'm gonna flip it over. What do you say, Jack? Oh... Sensual... (Music Playing) OK... I'm impressed. I feel like... Size to sound ratio is actually pretty impressive. The design may be not for everybody but... They do come in a number of different color combinations. And... The fact that it's waterproof, I mean who can hate on that? Take a look at this guy here... Which is the Boom... The Boom? The Boom? This is a different color combo than last, obliviously much different than the bigger one. Still have this nice oversized volume buttons, which I like. Just like before, it's a question of sound. Hello! (Music playing) (Device warns) Critical battery please charge. Whoa! Hands down... The best \"critical battery\" warning I've ever heard in my entire life. AJ probably has that on loop. -\"AJ critical battery warning man\" The sound is way better on this! Way better! Forget about that thing! This is not that much bigger, this sounds way better than that. Now I am insanely pumped, For the big boy... The mega burrito. (Device warns) Critical battery, please charge. More depth... More low-end... A step up in a big way. In a bigger way that I expected. This though... Look at this... You have the flaps to protect the auxiliary port and the micro USB. And we are fully waterproof. For how much money AJ? (Offscreen:) 300. 300 dollars. That's expensive... Most people they spend that kind of money on their phones... I don't know how many people on the market for a speaker that's this price. That said... It's about the sound right? So let's pair up... Same song? Same song! Same song... OK... (Music playing) You already know... Wha- What do I need to tell you at this point? You already know! You heard it... This is the one to get. I don't know what you have to do... Maybe you have to borrow a few bucks from your parents. Maybe you have to ask for it from Santa Claus. Hanukkah, Ask for it for- for Kwanzaa... Listen... A lot of times this is like... Not your main music setup, And it's something you wanna take with you and this is- This is cool, I will get this one over this one. I'll take sound over the waterproof. Put away a few extra bucks... Get a paper route, right? Get a paper route! Wow! When you hear 'em in this kind of environment, one after the other, You really start to appreciate the differences. You're sitting, um... On the picnic tables outside your high school with this joint, And then someone comes along with the Megaboom? You're out! You're out of comission, they send you home, you're suspended, You might even be expelled... You show up with this one you're expelled. (laughs) Alright, let's listen to it one more time... but you heard what I have to say, alright? This is my- This is the one! We're gonna roll out on the Megaboom! (Music playing)",
    "transcript_keywords": [
        "eyes Lew",
        "Boom",
        "Open your eyes",
        "battery",
        "Lew",
        "Lew back",
        "battery life",
        "Roll",
        "SOUND",
        "USB",
        "Micro USB",
        "waterproof",
        "Megaboom",
        "life",
        "Critical battery",
        "Ultimate Ears portable",
        "Ultimate Ears",
        "guy",
        "video",
        "Wow"
    ],
    "transcript_entity_values": [
        "Lew",
        "Santa Claus",
        "300",
        "100",
        "200",
        "AJ",
        "today",
        "USB",
        "Micro USB",
        "UE Roll",
        "the \"Roll",
        "Jack",
        "100 feet",
        "Android",
        "One",
        "300 dollars",
        "AJ",
        "300.",
        "20 hours",
        "one",
        "Hanukkah",
        "three",
        "a few bucks",
        "Kwanzaa",
        "Megabooom",
        "EQ"
    ],
    "transcript_entity_types": [
        "PERSON",
        "GPE",
        "MONEY",
        "MONEY",
        "MONEY",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "GPE",
        "PERSON",
        "ORG"
    ]
}