{
    "id": "zbDwsJm-hMg",
    "title": "Xbox One X Hands on - 5 Things Before Buying!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-06-12T05:21:36Z",
    "video_url": "https://www.youtube.com/watch?v=zbDwsJm-hMg",
    "category": "Science & Technology",
    "tags": [
        "Xbox",
        "Xbox One X",
        "Xbox One",
        "Xbox One X Review",
        "review",
        "unboxing",
        "xbox one x unboxing",
        "xbox scorpio",
        "reveal",
        "xbox one x reveal",
        "microsoft",
        "microsoft e3",
        "e3 2017",
        "xboxonex",
        "e3",
        "xbox360",
        "playstation",
        "ps4 pro",
        "2017",
        "gameplay",
        "xbox one x specs",
        "xbox e3 2017",
        "xbox one s",
        "games",
        "assassin's creed origins",
        "microsoft press conference",
        "xbox project scorpio",
        "forza 7",
        "scorpio",
        "4k",
        "tld",
        "jonathan morrison"
    ],
    "views": 476799,
    "likes": 14388,
    "comments_count": 2064,
    "description": "Hands on with the new 4K Xbox One X aka Project Scorpio!  The Nintendo Switch Gaming Desk!  Subscribe!    Xbox One X Pre-order link:  Full Xbox One X details & specs:   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/zKfngCb56Xk?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "http://www.youtube.com/tld",
        "http://amzn.to/2r9uWQN",
        "http://www.xbox.com/en-us/xbox-one-x",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo guys, Jonathan here. This is not an Apple product. This is the brand new Xbox One X, and here are five things to know before buying. (pop music) So first up, I'm gonna kind of sandwich three things together in one. Name, pricing, and then availability. Prior to today's announcement, this was known as Project Scorpio. Now we have the official name, Xbox One X. The now big brother to the Xbox One S. Although, this technically isn't born yet. It doesn't come out until November seventh, so does that make it the little but better brother? Anyways, it costs $499. So next up at number two, even though this is the most powerful Xbox ever, it is also the smallest Xbox ever, which is kind of crazy if you think about it. Also strangely enough, there was a ton of people who really, really wanted a black finish on the Xbox One S. That of course has not happened yet, and it's debuting here with the Xbox One X, so if you're holding out for that, that may have made your decision for you. Now even though this looks very similar to an Xbox One S, the only component that they share that is the exact same is the blu ray drive. Everything else inside this is completely different. Now one that I thought was particularly cool with this, is even though it's more powerful than the Xbox One S, even though it's drawing more power, something like 125 watts more, if you look on the back, the power cord is exactly the same, and to take that even further, the layout and the outputs are the exact same as well. So in theory, if you wanted to unplug and pop your Xbox One S out and replace it with this, it is gonna be seamless. Now next up at number three, is for those who wanna get down and dirty, and know the specs and what is inside this Xbox One X. This is packing a six teraflop GPU clocked at one point one seven two gigahertz. 12 gigabytes of memory. What's nice about that is nine of those are going straight to games. So it's kind of refreshing to see even though they're packing in the specs and the hardware, there's a good amount of allocation going to the gaming side. With that memory, you're also getting 326 gigabytes per second of memory bandwidth. So the key message here is true 4K gameplay, and yes I guarantee you one guy out there is gonna say I'm just gonna build a gaming PC. And that's fine, you can do that. But the fact that there is this much power packed inside a console I think is awesome. Here at E3 they debuted Forza 7, which is pumping out 4K, 60 FPS gameplay, and I don't care what side of the fence you put yourself on, whether it's a console gamer or PC gamer, if you enjoy tech, that is a really great thing. Now, next up at number four is backwards compatibility. All Xbox One accessories will work with the Xbox One X. Of course your games are gonna work. They're gonna look better. But what was special today, is on top of the backwards compatibility with Xbox 360 games, Microsoft announced compatibility all the way back to the original Xbox, and tons of loud beeping too. (beep) Is on top ... Will work with the Xbox One X. Now, last up at number five is even if you don't own a 4K TV but still want to pick up an Xbox One X, that's okay. Firstly, gameplay is gonna look better. And the best way I could describe that from a video standpoint, it's very similar to where if you shot in 4K, and then output it in 1080P, it's still gonna be crisper, it's still gonna be sharper, and that is definitely not a bad thing. On top of that, you're gonna get much better framerates on the Xbox One X, simply because there is more power. So maybe you've been holding out, and you haven't bought an Xbox One S yet, this is definitely gonna be the better future-proof option. Lastly, something I haven't talked about is there is a faster hard drive packed inside the Xbox One X. It's gonna ship with a one terabyte option. And what that's gonna equate to are faster load times. All in all, the Xbox One X looks really good. I am not a crazy gamer by any means, but this looks really, really tempting. If you guys are excited for this, let me know by dropping a like down below. As far as where you could pick one of these up, I am not sure yet. Amazon may have leaked it, but I'm not sure if that link is still there. That will also be down below. This is Jonathan, and I will catch you guys later.",
    "transcript_keywords": [
        "Xbox",
        "powerful Xbox",
        "smallest Xbox",
        "original Xbox",
        "Apple product",
        "number",
        "inside",
        "Xbox One accessories",
        "power",
        "Project Scorpio",
        "kind",
        "guys",
        "memory",
        "top",
        "work",
        "gameplay",
        "games",
        "compatibility",
        "inside the Xbox",
        "gamer"
    ],
    "transcript_entity_values": [
        "1080P",
        "two",
        "Xbox One S",
        "Project",
        "Xbox One S.",
        "Forza 7",
        "FPS",
        "Xbox",
        "five",
        "4",
        "K TV",
        "Xbox One",
        "Xbox 360",
        "Apple",
        "Xbox One X",
        "four",
        "a ton",
        "Scorpio",
        "number five",
        "six",
        "E3",
        "Xbox One",
        "nine",
        "three",
        "first",
        "125 watts",
        "one",
        "one point one",
        "GPU",
        "Firstly",
        "Amazon",
        "today",
        "November seventh",
        "60",
        "Microsoft",
        "326 gigabytes",
        "499",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "LAW",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "MONEY",
        "PERSON"
    ]
}