{
    "id": "ZbfPImDmj0k",
    "title": "Unboxing ALL 7 M1 iMac Colors!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-05-18T13:00:32Z",
    "video_url": "https://www.youtube.com/watch?v=ZbfPImDmj0k",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 1607134,
    "likes": 66760,
    "comments_count": 4578,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. And today's video is going to be so exciting. If you can't tell, we have every color of the new M1 iMac right here, and guess what? We're gonna unbox them, so let's get started. This is a fort of iMacs. It's honestly the coolest thing ever. (soft music) It's like a golden egg! Wow! Oh, that's gold. That's gold. Ooh, yellow accessories! It's exciting every single time. This is just a pure golden egg. This reminds me of the Easter egg hunts that we used to have with my family 'cause we'd always hide a golden egg. Jenna, golden egg. Found it! Now that is yellow. That is some yellow if I've ever seen it. Wow! If you like the color yellow, you're gonna be really into this. Hello. This is a nice subtle yellow; this is aggressive. That's kind of the theme here. We've got subtlety and then we have this aggressive darker color. Look at you! It's so beautiful! It's like I'm holding nothing. I think the iPad 12.9 inch is heavier than this. Hello. This is so light! Look how pretty this is! It's the ethernet port. Look how pretty! It's a braided cable, lightning to USB-C, to match this braided cable for the extension. Time to unbox the purple one. I think I actually might need my knife for this. I just got a peek of this color, it's so pretty! (gasps) These colors are so awesome. You're seeing these things in the photos but in person, it's really hard to even explain how beautiful they look. Hello, goodbye. I have a feeling I'm gonna be saying that I like each color more than the last every single time I unbox. I love that they decided to make everything match and look consistent. It really works. And now we've moved on to the orange iMac. Whoa, this is more of like a peach kind of color. Oh, this has Sara Dietschy's name all over it. I actually really like this color now. Wow! It's exciting every single time. This is so orange. It's a nice peach. Stickers! I mean, they color-matched this perfectly. Onto the next color. And now we've got the silver iMac. It looks very nice so far. Oh yeah, look at this! Look at you! I feel like this is probably gonna be one of the top sellers just because it's a very simple basic color but I'm gonna just advise you guys, take a look at these other colors. They're beautiful. Or be basic, do whatever you want. You do you. Jenna is off on the side of the camera, setting up all the computers behind the scenes. Jenna. So if you do decide to get the silver iMac, you're only gonna get one sticker. The silver's nice, it's actually all one consistent color. So on the other colors, the back was darker, but this is all one very nice solid color. I've said every single one looks great. And here's the silver. This one really does look really nice. I love it 'cause it kinda has that minimalistic look. The back is the same color as the stand. So everything's very minimal and it looks really sleek. So this is the blue iMac. It's so pretty! What a great blue! Ah, it's like the ocean. It's a beautiful baby blue ocean. I know I've already unboxed six of these but I just can't get over the beautiful matching accessories. This blue is also really pretty. Surprise! Goodbye. Check out these colors. These two blues looks so pretty together. I love this dark blue. We have one more to unbox. Time for the green iMac. Oh man, every single time I am shocked by the color what it actually looks like with my real eyes. Wow, this color's great! Absolutely love it! Like, everything is beautifully color-coded, even the instructions. So this looks like one of the lower-end models because it only has two thunderbolt and USB 4 ports. So I'm glad that we have a variety. This is really nice. I love this color in teal. Look at this, man! So pretty! - [Jenna] Okay, is that a wrap on green? - [Justine] I think so. All right green, you're wrapped. Round of applause for green, everybody. Woo! (applause) So now let's set up all of these iMacs. So now it's time to boot all of these up. It's kinda like a little race. I've got 'em all plugged in. My cable management is very subpar but that is not important today. Let's go! Thank you, guys, so much for watching. I hope you guys enjoyed this video. If you did, make sure to give it a thumbs up. Be sure to subscribe and hit the bell, so you'll be notified when I post a new video. I would love to know from you guys, though, which color is your favorite? I think that the pink is my favorite, next purple, blue, teal, the silver, then the orange, and then the yellow. Obviously, these computers are beautiful but they're also equally as powerful, so I will be doing a full review. So make sure you guys check out that. I'll put a link in the description. And with that, I will see you guys in my next video. (upbeat music)",
    "transcript_keywords": [
        "color",
        "Justine",
        "time",
        "pretty",
        "nice",
        "guys",
        "yellow",
        "iMac",
        "golden egg",
        "love",
        "blue",
        "beautiful",
        "single time",
        "egg",
        "colors",
        "single",
        "silver",
        "golden",
        "Wow",
        "unbox"
    ],
    "transcript_entity_values": [
        "M1 iMac",
        "iMacs",
        "Sara Dietschy's",
        "Time",
        "iPad",
        "one",
        "USB 4",
        "USB-C",
        "six",
        "today",
        "iMac",
        "Justine",
        "two",
        "Jenna",
        "12.9 inch"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "QUANTITY"
    ]
}