{
    "id": "Zbv-MpokrC4",
    "title": "Kobo Aura One: The Best Kindle Alternative",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-10-05T19:38:51Z",
    "video_url": "https://www.youtube.com/watch?v=Zbv-MpokrC4",
    "category": "People & Blogs",
    "tags": [
        "kobo aura one review",
        "kobo aura one",
        "kobo aura one vs kindle",
        "kobo aura one pdf",
        "kobo",
        "kindle",
        "kobo review",
        "aura one review",
        "mrmobile",
        "michael fisher",
        "captain2phones",
        "mister mobile",
        "android central",
        "imore",
        "windows central",
        "best e-reader",
        "best ereader",
        "e-reader review",
        "kobo vs kindle",
        "kindle vs kobo",
        "pocketnow"
    ],
    "views": 456072,
    "likes": 7376,
    "comments_count": 525,
    "description": "Amazon's Kindle might dominate the e-reader space, but it's not the only option out there. The Kobo Aura One packs a 7.8-inch display and water resistance, two things no current Kindle can offer  and it comes with some pretty cool conveniences to boot. Is that enough to overcome Kobo's challenges in pricing and ecosystem? Watch the MrMobile Kobo Aura One Review to find out!   [SUBSCRIBE]     [ABOUT THIS VIDEO]  MrMobile's Kobo Aura One review was produced after seven days with a Kobo Aura One review device on loan from Kobo.   [PRODUCTS IN THIS VIDEO]  Kobo Aura One:   Google Pixel C:   udoq Docking Station 400:    [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"e-business\" by Olive Musique, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/2j",
        "http://mrmobile.tech/2k",
        "http://mrmobile.tech/2l",
        "http://www.premiumbeat.com/royalty_free_music/songs/dubday",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [MrMobile] Fun fact: While MrMobile lives almost entirely on video, Michael Fisher is actually more of a reader than a tube dude. So I jumped at the very first chance I got to review a dedicated eReader. This is the Aura One, a water-resistant eReader from Kobo, and I think it's the Kindle competitor to watch for the foreseeable future. (synthesizer music) Before I talk about the Aura One itself, I wanna tackle the question that some of you might be asking. Why get an eReader if I already have a tablet? And, after all, it's common now to read eBooks inside an app, and it's a lot simpler to carry one device that does it all. That's where I'm coming from. I've been reading my books on a tablet since I bought the first iPad over five years ago. And if you've gotten used to that experience it's unlikely any eReader would change your mind. But there are definite advantages to ditching the tablet when it comes to books. The biggest one for me is giving my eyes a rest. I stare at displays of various sizes all day long, and when I wanna read a book, I don't really want it to be on another display. At the same time, I want something more portable and less clumsy than an actual book. While the 7.8-inch E Ink panel here is technically a display, it's the closest thing you're gonna get to looking at printed words on paper. In daylight it's perfectly readable, it uses no battery power at all unless you're turning a page, and you can adjust the temperature of its backlight. That's a rarity, and it's a big deal. The warmer setting is much more comfortable than the bluish-white default when you're trying to relax at night. You've got a variety of typefaces to choose from, too, and the pixel density is plenty high enough, no matter which one you pick. Also, this display is big, almost two inches larger on the diagonal compared with every modern Kindle. That makes the Aura One a bag device, not a pocket one, but it also gave Kobo the space it needed to make the reader water-resistant. Honestly, given how many people make a habit of seaside reading, it's surprising more eReaders don't offer this. It's not dust-proof, though, so keep the sand out of the charging port. Speaking of charging, this is another area that eReaders have tablets beat, because they typically measure battery life in weeks, rather than hours. It took me 11 days to deplete the Aura One's battery, over 4.4 hours of reading. Now, that reading figure is way low, because I used the thing like a tech reviewer. You know, I fiddled around with menus and explored the interface, and kept WiFi on all the time, and 100 percent of my reading was done at night, with the backlight turned on. If you're a little more cautious you might even be able to hit Kobo's estimate of one month's use between charges. And, bonus, the big battery life doesn't mean it's a brick. The Aura One is lightweight, reasonably thin, and that basketball-like finish on the rubber makes it easy to keep a grip on. Now, just as it reaps benefits common to all eReaders, the Aura One suffers in familiar places, too. The slow refresh rate of E Ink means doing anything other than flipping a page is really slow, especially when it comes to beta features like the web browser. Also, the automatic brightness is a little oversensitive, so you might end up switching it off, like I did. And at very low settings, the panel has inconsistent backlighting. I initially thought it was intentional texturing, but, no, it's just kind of janky. And then there's the ecosystem question. My tastes are fairly diverse, and I found every title I was looking for in the Kobo Store until I dug just a little bit deeper. Do a search for Deepwater Horizon, for example, and you'll see that, not only does the Kindle Store have more available books, but several are cheaper, some significantly so. That's Amazon's scale at work, I imagine, and it's important to consider if you're thinking long-term. Now, Kobo does make up for that a little. It's got better Pocket integration, it's easy to sideload EPUB or PDF files using a computer, and there's also built-in support for OverDrive. It lets you borrow digital books from your local library right on the device. It's cool, it works well, and it lead to me getting my first library card in a long time. Kobo also has partnerships with some indie booksellers, so if you register with a certain store, they'll get a small percentage of every purchase you make. That's a nice little gesture of support. Still, the stumbling blocks to the Aura One are significant. First, its a 230 dollar device. Three out the four currently available Kindles are cheaper. Yes, they're all smaller, and none of them are water-resistant, but the added depth of the Amazon ecosystem is a pretty big counterbalance. Now, factor in that Kindles also work with OverDrive and Pocket, albeit in a more clumsy way, so for mainstream folks in the market for a competitive eReader, I'll still recommend the Kindle first. But, if you live in a market where Amazon doesn't do business, or you don't like how Amazon does business, or you just wanna do something different than everyone else is doing, I get it, I carry a Windows phone, then the Aura One's superior hardware, bookstore-friendly attitude, and those little baked in niceties make it the best Kindle alternative there is. If you own an Aura One, share your experience in the comments, and remember to subscribe to MrMobile on YouTube for more tech videos just like this one. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "Michael Fisher",
        "Aura",
        "Fun fact",
        "tube dude",
        "Kobo",
        "Kindle",
        "Michael",
        "Fisher",
        "eReader",
        "make",
        "Amazon",
        "reading",
        "books",
        "eReaders",
        "time",
        "big",
        "Kindle Store",
        "battery",
        "device",
        "Kindles"
    ],
    "transcript_entity_values": [
        "eReader",
        "First",
        "weeks",
        "Aura",
        "Deepwater Horizon",
        "the Kindle Store",
        "five years ago",
        "night",
        "Kobo",
        "100 percent",
        "11 days",
        "eReaders",
        "230 dollar",
        "four",
        "4.4 hours",
        "almost two inches",
        "EPUB",
        "all day long",
        "Kindles",
        "Three",
        "Aura One",
        "first",
        "One",
        "7.8-inch",
        "Kindle",
        "one month's",
        "rather than hours",
        "MrMobile",
        "iPad",
        "the Kobo Store",
        "PDF",
        "Windows",
        "Michael Fisher",
        "one",
        "Amazon",
        "YouTube",
        "OverDrive"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "FAC",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "PERCENT",
        "DATE",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "DATE",
        "TIME",
        "PERSON",
        "ORG",
        "FAC",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG"
    ]
}