{
    "id": "ZC5Zr3NC2PY",
    "title": "The Best Easy Way to Capture Analog Video (it's a little weird)",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2019-07-06T13:56:50Z",
    "video_url": "https://www.youtube.com/watch?v=ZC5Zr3NC2PY",
    "category": "Science & Technology",
    "tags": [
        "VHS to DVD",
        "VHS capture",
        "analog video capture",
        "converting home movies",
        "digital convert",
        "camcorder convert",
        "home movie digital",
        "digitizing",
        "video capture",
        "archiving"
    ],
    "views": 871080,
    "likes": 31250,
    "comments_count": 3050,
    "description": "You can support this channel on Patreon! Link below.  After much annoyance dealing with fiddly capturing methods, I thought Id show you the method I stumbled upon that works amazingly well, is fairly cheap, and awfully easy. Ive been thrilled with it, and I think youll be too.  This here is the composite to HDMI upscaler I got. Note that in the product description, it says it cant improve image quality, even though upscaler in the title. Go figure.   And heres the capture doodad:   These links worked as of 7/4/19. In the future, you may need to search for similar alternatives.  How about some other links?  Technology Connections on Twitter:   The TC Subreddit   Technology Connections 2 (the channel where I sometimes talk about stuff and generally dont prepare for anything):   You can support this channel on Patreon! It has been amazing what Patreon has done for this channel, but also for me (your dorky host) personally. Through the support of people just like you, Technology Connections has become my job and I am so excited and thankful for it! If youd like to join the fine folks in a pledge to help the channel grow, please check out my Patreon page. Thank you for your consideration!   And thank you to the following Patrons!  Trey Harris, Peter Pfundstein, Wilhelm Screamer, Mat Stu, Charlycobra, Thomas Kolanus, William Kisley, Daniel Johnson, Potch, Reemt Rhmkorf, Jack Nichol, Robin Rattay, Bruce Justyn, Rae McIntosh, Justin D, Adam Zawisza, LordJakson, Triancia, Max Barnash, Microfrost, MrSonicOSG, Sinirlan, Mitch Schenk, Juan Olivares, Mike Bird, Emmett Ray, Michael Shaffer, Steve Trambert, Sputnik, Jason Spriggs, Danny S., Gregory Kumpula, Chris Zaremba, Tom Burns, Daniel Pf, Yung Kim, John W Campbell, Matthew Jones, Dave Redmond, Slappy826, Steven Ingles, Robert Howcroft, Troy King, Some Random, Jeremy Heiden, Vince Batchelor, Peter Sarossy, Favian, Tracy Cogsdill, Matt Allaire, Guy, Benjamin Gott, Luke, Zach Le, Fredrik strem, Anil Dash, Simon Safar, Michael Wileczka, John Ehler, William Matthews, Fred Leckie, Julian Zielke, John Rogers, Kenneth Morenz, Andy, Adam Merolli, Greg Stearns, Zack, Robert L LaBelle, Chris Satterfield (Compgeke), Brian Johnson, Cameron Benton, Samuli Suomi, Keith McCready, Jeffrey Glover, John Marshall, Hsin-Kuei Chen, HenryD, Damian, David Anez, Josiah Keller, M T Bono, Conall  Maiti, Struan Clark, Keeb, Tarrien, Jason Viterna, DrMoebyus, Biking With Panda, Chris Larsen, JH, Michael Romero, Jonathon Mah, Jonathan Polirer, Derek Nickel, Marc Versailles, Ian Pirner, Mark Stone, Arthur Zalevsky, John Fruetel, Christopher Swenson, Andrew Diamond, Cole Campbell, Christopher Beattie, Paul Bryan, Samuel Kirzner, Gus Polly, Daniel Pritchard, Brandon Tomlinson, Eric Loewenthal, Jeremy Samuels, Malcolm Miles, Matthew Lloyd, David L Jones, Matthew Burket, Mike Burns, Noah Corwin, Andrew Roland, Luke Whiting, John Cockerill, Smith8154, David Groover, Michael Wehner, Kyle Creasey, Rainbow Warrior, jacob kamphaus, Slysdexia, Alex Hurley, D.z, Andrew Bobulsky, Matthew R, Richard Sams, Andy Kettu, On Ice Perspectives, Brian Wright, TheGreatCO, Marcus, Ethan R, Petteri Hjort, Daniel DeLage, Nathan Obuchowski, Sam Tran, Shaun Puzon, Bret Holmes, Vlycop, Alexandra Stanovska, Tom Ebenhoe, Casey Blackburn, Matthew Jensen, Devon Hodgson, Paul Macejewski",
    "description_links": [
        "https://www.amazon.com/CSRET-Composite-Converter-Upscaler-Supporting/dp/B0152E8UEG/ref=sr_1_24?keywords=composite+video+upscaler",
        "https://www.amazon.com/1080P-Video-Capture-Recorder-Compatible/dp/B07JW5BBYG/ref=sr_1_12_sspa?keywords=hdmi+capture+box",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "[sound of VHS cassette being inserted into VCR and heads spinning up] As the world steadily moved from the realm of analog signals to digital information, we kept facing the challenge of how to convert our beloved and wholesome analog recordings into sterile, never-changing strings of ones and zeroes. Remember kids, vinyl is better because its imperfect! Anyway, converting analog *audio* to digital audio was no big deal. I mean, technically it all starts as analog signals from microphones anyway, so once we figured out how to record sound waves as a series of instantaneous intensity samples taken at a frequency of at least twice the highest sound frequency wed like to capture and bandlimiting the input and output which guarantees the sound will be reproduced exactly as it was captured because the Nyquist-Shannon sampling theorem proves that to be the case once we figured out how to Digital Sound it was simply a matter of recording an analog source and then all your favorite artists are now immortalized on Compact Disc! It is almost hilariously easy to get a decent digital sound recording from an analog source. Need to digitize a cassette? Just plug a walkman into your laptop, download everyones favorite open-source audio software, hit play, hit record, and look at that! Sound waves make samples, samples make soundwaves. Of course if youre not using a $10,000 ADC and the latest in gold plated Oleum Anguis cables, youre really not getting the true experience. Pfft. People who listen to music for what it IS. But, converting analog video into digital video has remained a frustrating process full of forum posts about which deinterlacing algorithm is the best, which video capture cards work best and which dont, dealing with audio synchronization issues, and even once youve settled on something that works reliably, it almost never looks like analog video actually looked. No one is pretending that captures from a VHS tape should look as good as this gorgeous video youre watching right now. But, Id say a good 90% of the VHS captures Ive seen floating around the Interwebs look washed out, kinda blocky, and in general just a lot worse than VHS actually was. [ upbeat music ] It doesnt have to be this way! With this one weird trick, youll find out how to take your VHS captures from this -- to this. Now as is the usual case with this channel, were gonna go into far more detail than a casual viewer may need so if you really just want to know what I use to get captures like this go ahead and skip to here, but be warned that in some ways this is very easy, and in other ways its frustrating and in either case will likely require video editing software of some kind to produce an output file worthy of publishing anywhere. But I mean. Those results. Mmmmm Alright, so lets start with what makes the process of analog video capture so gnarly. An analog video signal is far more complicated than simple audio signals. Since its designed to synchronize the raster pattern of a television set and define the intensities of the red, green, and blue electron guns in a CRT, all the while doing so with weird complicated math designed to produce a color output from a single monochrome signal, its not as easy as taking some samples of the signals intensity and reconstructing them later. Especially because digital video is nothing like digital audio. Any video capture device has to take that analog signal, actually build an image with it by approximating how a CRT would natively draw it, break that image up into an array of logical pixels, take RGB values of each one, and then encode that as digital video however you like. And because thats not difficult enough, it also has to decide whether to keep it as interlaced video and let whatever device will play it back decide how to deal with that, or whether it should deinterlace the video now and then be stuck with however good its native deinterlacing algorithm is. Oh right. Interlacing. That thing we did in the analog video space because it was the 1940s and bandwidth wasnt just growing on trees. We needed the CRT to refresh fast enough to make flicker imperceptible, so we drew the image in alternating lines called fields twice as frequently as we could if we filled it all in at once. Said the engineers of the day, that wont ever cause a problem down the road, will it? Well here we are in the 21st century and its a problem. Captain Disillusion just made a really greater primer on interlacing if you want to know a little more about it, but now that we use televisions, computers, and smartphones with LCD, OLED, and *future* displays that stay constantly lit and thus dont have to deal with flicker, deciding how to deal with an image source that effectively is doing this can be a tricky thing. And yet, even now in 2019, new television sets include a composite input, and they manage to spread those 480 interlaced lines into 1,080 or even 2,160 rows of progressive pixels with grace and dignity. And once you process that a little bit, youll start to wonder why video captures tend to be so bad. See, this television doesnt have an electron gun blindly following orders from the little yellow cable. Its got a giant grid of pixels, so just like any capture device, it has to take this incoming signal, approximate how a CRT would draw it, and then draw it. And of course it also has to de-interlace that signal because the panel runs at 60p not 60i, so it does everything an analog-to-digital converting capture device does. But it doesnt make blocky video. Its not weirdly interlaced. And the colors are vibrant. It looks fine. Dare I say it, it looks GOOD. I bought this TV just a couple of weeks ago, and I put some pictures of it up on Twitter praising how good its composite input is. And the responses to it (particularly this one) got me thinking. See, almost by accident, Ive been using a pair of devices to capture analog video for various clips here on YouTube, and one of them probably uses the same methods this TV does to get that analog signal turned into digital video. And if my memory is right, this all got started from a video Techmoan made about (or perhaps simply featuring) a new A/V receiver which upscaled composite video and spat it out to the TV over HDMI. Ive looked for that video and cant figure out which one it was but suffice to say I was intrigued by the prospect of a device which could upscale composite video, but I wasnt in the market for an A/V receiver. So I went to my friendly neighborhood Amazon and spent a whole $30 on this thing. Tried it out. Wasnt overly blown away by it. It seemed perhaps marginally better than what my TV could do on its own, but nothing so extraordinary that I couldnt live without. But then it hit me. If this thing is outputting to HDMI, that means its done analog-to-digital conversion, and clearly it doesnt suck because its actually a little bit better than what my TV could do on its own. So, I went back to my friendly neighborhood Amazon and looked for something which could capture HDMI and spit it onto something. These exist because gamers, and in my case I wouldnt have to worry about any sort of HDCP compliance because the signal its getting isnt copy protected, so I went with cheap. Even then it was around the $70 mark. These things in general just arent very cheap, but all-in now were at $100. I tried it out, and whoa. This is it. This is how to capture analog video when quality matters over all else. For those of you just joining us, heres how to capture analog video with the same quality that your TV displays it. Find yourself a composite to HDMI converter. You may want to use the search term upscaler. This $30 one works reasonably well enough, though there might be --nay, certainly are better options. Next, get some sort of HDMI capture device. Ive been using this cheap stand-alone thing that records to a flash drive and while it presents some limitations, its perfectly fine for my needs. If you want, you could get one that allows your computer to directly record the source. Whatever floats your boat. Just make sure it can record whatever your chosen digital-spitter-outer thing spits out. And thats it. Now for my use case, this is extremely hassle free. I have my composite-to-HDMI converter attached to the output of my A/V receiver, and the actual capture device sits atop this VCR. Now, anything that goes through the A/V receiver can be captured just by plugging in a flash drive and hitting that button. And when Im done, I hit the button again, wait for the flash drive to stop writing, and boom. Theres my file. You might also be happy to know that Macrovision doesnt bother this thing. I of course dont know why that might make you happy, but if it does, well now you know. And now is where things may or may not get a little weird. My capture thingy only records 60 frames per second in 720p, so I have the output of my digital-spitter-outer thing set to 720p. Which honestly, were dealing with 480i footage so thats still capturing the whole thing and then some. But, the output file is stretched to 16:9 because one of these two devices isnt smart enough. And that means you probably want to un-stretch it. If you dont want to we cant be friends. Also of note is that, at least in my situation, the audio level in the resulting recordings is really, really low. I can boost it well enough in Premiere but noise does start to poke through. I havent tried running the audio separately into the line-input of the capture device which I think would almost certainly fix that, but Im just warning you could run into this. The biggest inconvenience is that the files do eventually get split. Depending on what you want to do this may or may not be an issue, and for how I use this its no big deal at all. Im typically just grabbing one or two minute clips to put in a video, and then Im only using 10 or so seconds at a time. But if youre looking to backup home videos or other longer content, youll have to stitch these files together. If you dont have any experience with video editing software this might seem daunting, but youll pick it up quick. Plus, other solutions such as USB devices for your PC which capture HDMI may not do this, but I dont have experience to comment with authority on that matter. For me, if for instance theres a home video I want to back up, Ill start a new Premiere project, and throw each file on the timeline. Now I want to un-stretch this. I personally am OK with them being rendered as a widescreen video with black bars on the side, so Im not going to bother resizing the output file into a 4:3 aspect ratio and suitable resolution. Instead Ill keep it at 720P widescreen, but with the actual video source scaled correctly. In Premiere, you can save a preset so you dont have to keep doing this manually, and apply it to multiple clips at once. Another small wrinkle I deal with is the fact that the image isnt perfectly centered and theres a black bar along one edge, but if youre placing it on a floating background of black that isnt visible anyway. As it currently stands I put a big audio gain on all of the clips so that theyre not super quiet, and now Im done. Ill re-render this into whatever video format I like. If Im just putting this as a clip into an existing project (like Im doing for this very video) I simply take the original file and scale it accordingly. And thats it. For me personally, this is the best situation imaginable. The capture device stays as part of my video equipment setup, always ready to capture from a Laserdisc, VHS tape, PS2, or whatever else I may throw at it. All I need is a flash drive. And the output files are not only better than any conventional capture method Ive used so far, theyre more convenient. There are two small caveats, though. The first is that its deinterlacing is very close to perfect, but not quite. Every once in a while there will be a frame showing two fields at once. Ill take that over bad deinterlacing any day, especially because its only noticeable under certain circumstances. PLUS, and this is especially important, since it produces a non-interlaced file, its easier to incorporate these into a progressive video like everything we do today, so youll be sure that the output file isnt deinterlaced poorly upon being converted to 30 frames per second, or 60 frames per second should you decide to preserve the analog smoothness we all know and love. And the other thing is that, on some occasions, its produced output files that Premiere does NOT like. It hasnt happened in a while, so it may be that Premiere updates have fixed it, or perhaps it improved with time somehow, but whatever the case, I was able to run the file through Media Encoder and get something out that Premiere would import without crashing. Weirdly, Windows never had a problem playing the files as they were. But, worst case scenario, just capture it again. So, if you do a lot of video capturing and are looking for quality above all else, you might want to consider trying this. Ive been quite pleased with it, and while it may seem a bit absurd compared to more conventional options, I really think this is on the whole among the best options right now. My previous method for capturing analog video, which you saw in the earlier comparison clip, involved recording onto a DVD-RAM disc at the highest bitrate possible and then importing that into a video editor to be re-exported as natively interlaced video. I had previously considered this to be the best option for quality, (and it was used in some of my earlier videos) but Im eating my words now. And given the convenience advantage of my admittedly kinda weird capture setup, Ill deal with piecing clips together if I have to. Now, is this night-and-day better? Not quite. I find it to be much less blocky, particularly with scenes involving motion, but thats mainly down to the fact that its encoding these clips with more modern h.264 compression. You can still notice some blocks in areas like the sky here or other almost-solid-color areas, but for my money, this looks far truer to real analog video than does my old method of capturing, and many others Ive seen. Since this method might very well be improved with a better upscaler and/or a better recorder, Im pretty confident in saying this is worth a try. Thanks for watching, and I hope this video will be helpful to some of you. There are a lot of dedicated people who are archiving all sorts of analog video recordings, which is increasingly important as those old recordings wear out or degrade and may be lost to time. While this solution may not be the best for doing large amounts of archival work, Id say for personal use (particularly for saving home videos, etc) its added hassles make it worth it. Ill be back with a full-on video soon. For now, enjoy a selection of VHS and Laserdisc captures done with this device. progressively smooth jazz",
    "transcript_keywords": [
        "video",
        "analog video",
        "capture analog video",
        "analog",
        "capture",
        "capture device",
        "digital video",
        "video capture",
        "world steadily moved",
        "capture analog",
        "analog video capture",
        "digital",
        "device",
        "VHS captures",
        "VHS",
        "thing",
        "output",
        "file",
        "analog video signal",
        "audio"
    ],
    "transcript_entity_values": [
        "2019",
        "USB",
        "two minute",
        "30",
        "16:9",
        "two",
        "a couple of weeks ago",
        "4:3",
        "RGB",
        "100",
        "the 21st century",
        "Media Encoder",
        "ADC",
        "LCD",
        "YouTube",
        "$70 mark",
        "any day",
        "today",
        "2,160",
        "a good 90%",
        "Premiere",
        "VHS",
        "Laserdisc",
        "HDCP",
        "first",
        "Compact Disc",
        "one",
        "Techmoan",
        "Windows",
        "30",
        "Amazon",
        "480",
        "Nyquist",
        "60i",
        "the 1940s",
        "CRT",
        "Macrovision",
        "Oleum Anguis",
        "60p",
        "10,000",
        "1,080",
        "un",
        "second",
        "Twitter",
        "60",
        "10 or so seconds",
        "the day"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE"
    ]
}