{
    "id": "zEtzITaWbcE",
    "title": "Chrome's Address Bar Is Changing In A BIG Way",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-07-07T17:11:52Z",
    "video_url": "https://www.youtube.com/watch?v=zEtzITaWbcE",
    "category": "Science & Technology",
    "tags": [],
    "views": 1066605,
    "likes": 53671,
    "comments_count": 3916,
    "description": "Get 20% OFF + Free Shipping at Manscaped.com with code TQ20 -   Why is Google Chrome ditching full URLs?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://mnscpd.com/TECH",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Web browsing has changed a lot over the years. There's no more Home button, we browse with tabs instead of opening a new window every time, and a GeoCities page, with lots and lots of animated GIFs is no longer the pinnacle of cool. But one thing that stuck around is the venerable address bar that shows you exactly where you are on the Wild West, that is the internet. However, Google has been making headlines recently due to reports that they're considering fundamentally changing the address bar by showing only the domain of the site that you're on. So instead of reddit.com followed by a bunch of slashes and text showing exactly what thread or subreddit you're visiting, you'll only see reddit.com. How does that make any sense? I mean, isn't this kinda like ripping the numbers off the front of your house, and all you have to go by is the street sign on the corner? Well one big thing Google is concerned about is security. You see, phishing attacks, where users are directed to a fake page that looks like the real deal are a very common way that attackers fool people into giving up personal information. And since some phishing pages look very legitimate, one of the few ways to tell that you're not on the correct website is to look at the URL in the address bar, specifically the domain, as attackers can easily tinker with the rest of the URL to make a page look real. Spoofing a domain, on the other hand, that's much harder. So the idea is that by only showing the domain, it will be much easier for a user to tell that they're connected to an attacker instead of their bank or email, since they don't have to pick through a lengthy URL to figure it out. Remember not everyone knows which are the important parts of the URL. Google has actually already been experimenting with cleaning up the address bar in different ways. It's been standard for a while now for the address bar to leave out the scheme, which is the part at the beginning that either says H-T-T-P or H-T-T-P-S. Instead, Chrome uses a little padlock to indicate that the page uses the more secure H-T-T-P-S protocol and gives a warning when unencrypted H-T-T-P is in use instead. And if you're browsing the web on a mobile device, many pages use Google's accelerated mobile pages program, or AMP, which you can learn more about up here. These are pages that have been optimized for mobile so that they will load faster. And notably, these pages are actually hosted by Google. But the domain that you see in your address bar is the domain of whatever the original site is, so as not to confuse the user. So they've actually been chipping away at the traditional address bar for some time. Of course, there's predictably been a fair amount of backlash to these proposed changes. Critics are saying it's not exactly that difficult to just scroll over and see what the domain is if there's a concern about phishing. And hiding URLs has the potential to make the internet less decentralized and transparent, since the idea of the individual URL would become more irrelevant, as we instead rely on search engines more and more to get us to the page that we need. And hey, wait a second, doesn't Google happen to run the most popular search engine in the world? What a coinkydink! Before we get too cynical about the changes, you'll still be able to show the whole URL by just clicking on or hovering over the address bar. And it's not fully rolled out yet. Currently, the hide the URL feature is only present as a flag in prerelease versions of Chrome, so that's a hidden setting that you get to by typing this address into your browser. And besides, if the feature does become standard, Google has already confirmed that it'll be easy to change it back. So you can put the pitchforks away for now. Just like you can put away your hair for now. Check out the MANSCAPED Weed Whacker Nose and Ear Hair Trimmer. It has proprietary skin-safe technology to reduce nicks and tugs and a 9,000 rpm motor with a 360 degree rotary dual blade system. One charge lasts a full 90 minutes plus it's water resistant and has an easily replaceable blade. Also check out their Performance Package, which includes the Lawn Mower 3.0 Trimmer. You can learn more at the link below or at manscape.com and you can get 20% off and free shipping on the Performance Package with code TQ20. Nice! Thanks for watching, guys. Like, dislike, check out our other videos, somewhere around there. Leave a comment if you have suggestion for a future Fast as Possible, and don't forget to subcribe, and follow, subscribe, subscribe!",
    "transcript_keywords": [
        "address bar",
        "URL",
        "address",
        "Google",
        "bar",
        "domain",
        "page",
        "pages",
        "Wild West",
        "venerable address bar",
        "lots",
        "Home button",
        "Performance Package",
        "traditional address bar",
        "changed a lot",
        "thing Google",
        "showing",
        "HTTP",
        "HTTPS",
        "big thing Google"
    ],
    "transcript_entity_values": [
        "Chrome",
        "Google",
        "MANSCAPED",
        "AMP",
        "a second",
        "the Performance Package",
        "GeoCities",
        "9,000",
        "One",
        "3.0",
        "a full 90 minutes",
        "one",
        "20%",
        "the Wild West",
        "Weed Whacker",
        "Home",
        "the years"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "EVENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PERCENT",
        "LOC",
        "PERSON",
        "ORG",
        "DATE"
    ]
}