{
    "id": "zExw0KHUlss",
    "title": "These have a WORLD'S FIRST - LG TONE Free T90 & Fit TF8 Wireless Earbuds",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-09-01T20:33:31Z",
    "video_url": "https://www.youtube.com/watch?v=zExw0KHUlss",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "LGTONEFree",
        "Comfortable",
        "Earbuds",
        "Wireless",
        "Best",
        "Sport",
        "FitforSound",
        "FitforAction",
        "BestEarbuds2022",
        "NoiseCancelling",
        "Bluetooth",
        "UVearbuds"
    ],
    "views": 218803,
    "likes": 8268,
    "comments_count": 449,
    "description": "Thanks to LG for sponsoring this video! Check these products out at   LG TONE Free T90:   Amazon:  UK Link:   LG TONE Free Fit TF8:   Amazon:  UK Link:     Follow LG TONE Free on Instagram!: @lg_tonefree /   Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 LG TONE Free Intro 0:26 Unboxing 1:26 Case 1:56 Cleaning 2:30 Comfortability 2:50 App 4:04 Audio Testing 5:54 Ambient Sound Test 6:30 Microphone 7:19 TONE Free Fit IPX4 Rated 7:40 Checking out the other model 8:30 Fit Testing",
    "description_links": [
        "https://bit.ly/LGTONEFree_T90_SC",
        "https://amzn.to/3cnPuC5",
        "https://bit.ly/LGTONEFree_UT90_SC",
        "https://bit.ly/LGTONEFreefit_TF8_SC",
        "https://amzn.to/3Kuk3SV",
        "https://bit.ly/LGTONEFreefit_UTF8_SC",
        "https://bit.ly/LGTONEFree_Instagram",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Y'all ready for this? (clapping) LG sponsored this video 'cause they're trying to get in your head, with the new TONE Free wireless ear buds. There's two types, guys. The TONE Free Fit, also known as the TF8's, and the TONE Free Non-Fit, also known as the T90Q's. Don't call them that. Check out this cool knife that Andy has. He should sharpen this one. So the T90Q, regular TONE Free, is the more premium one. So let's open them first. Really digging this cardboard packaging, it looks very compostable. Ooh, here we go. And then what's under here? Oh, a bunch of stuff. So this is your charging cable, it's USB-C to A. And then here's a not regular thing, it's a USB-C to 3.5-millimeter audio jack. And this is interesting, because it's a feature of the case on both of these earphones, where, let's say you're in a plane that doesn't have Bluetooth, or has really crappy Bluetooth. What you do is you plug the case into that source, like your airplane armrest, and then it'll feed in analog to here, and then the case will act as the Bluetooth transmitter, to the earbuds that you're wearing. So that is super cool and super useful when you're in a bind and your phone dies, or airplane mode or whatever. You can watch movies, and not have to use some crappy other airline provided headphones, so that's awesome. Comes with some extra ear tips. These are special ear gel tips, that we'll talk more about in a minute. And on the inside, this is actually smaller than it looks in the picture case. It's like the size of like a, what are those called? Macarons? Those expensive cookies? Weird, there's like a little switch on it. That looks like a audio jack. I think that's probably to do with this guy. There's your port, and then there's a little UV nano light. What I said about these, these are I think called ear gel tips, and they get cleaned by a light inside here. So, over the first 10 minutes of charging, this light will shine and will clean the ear tips. Just the ear tip part, which is pretty cool. A little bonus, I'd say. I wouldn't buy it for that. But, bonus. 99.99 percent of bacteria killed by this light. You can see the sound's by Meridian. These are pretty slick. They're really glossy and smooth. They're very light. 5.5 grams on each earbud. Sporting a lot of battery life. Nine hours of playtime on the buds and, their words, not mine, an extra 20 hours of juice in the cradle. (laughing) LG claims that these are super comfortable for all day listening. And the lightness is a part of that. Now how do I pair them? Oh, I guess I'm supposed to have these in here. Here they are! Connect. Set 'em up. Let's do it. Oh, there's a user manual. One touch is gonna answer a call or play and pause. Touch twice, to end a call and do volume control. That's interesting. I guess is, will be a double tap on one for up, a double tap on the other for down. Touch three times to play. Three times for the next song. You're breaking convention there. Usually that means means back. Long press is for ambient sound noise-canceling, on models that support it. That's page two of this manual. Connect the cable. I know how to charge, you guys. Oh, here's what these lights mean. Green light, when you have more than 80 percent battery, yellow light, when you have 20 to 80 percent, and red light, when you have less than 20 percent. You just wanna stay in that yellow zone. That's how you're gonna preserve your battery life. So, if you're using the cable thing plugged in, then your touch controls kinda change. It'll be one touch for play and pause, and touch twice for volume control. And I get and that's about it. Yeah. That makes sense. You can't control the source as much as you could. Okay. So there's some EQ settings here. Immersive natural treble boost, bass boost, 3D sound stage. Natural mode delivers authentic and balanced sound. That toast. I can't read that fast. It's gone. Now, this is like the big feature of these. Dolby Atmos head tracking on wireless earbuds. Let's do it. Earbuds track the direction of your head, giving listeners the immersive feeling of - I couldn't finish reading that, guys! I'm not a speed reader. It's the feeling of being in a concert hall or a theater. So the idea is that the audio is kind of fixed in place, spatially. So, if I'm sitting in a home theater and I have surround speakers and I hear a little mosquito buzzing by over here, I turn to look, it's still gonna stay there. It's not gonna track my ear. That's what would happen with normal earphones. So with these, I can go, \"What's that?\" And look at nothing. (laughs) But it'll sound like I'm getting closer to it. Holy! These are blasting right now. These definitely go loud. I'm only at halfway. I don't even wanna go this loud. Whoa, this is super spatial. He's like, \"Take my breath.\" And it's like bouncing around, like, at different corners of my brain, over the top. That's pretty cool. Andy says I listen to music too loud. Tap, tap, it goes down a step. Tap, tap, goes down a step. That's cool. Okay. I'm looking forward. The voice is kinda like, right here at my forehead. And now it's over here. It's still there. It's like there's a tiny Weeknd just standing on an invisible stage over there. You know, like in the song, \"Sussudio\", where it goes like, \"Sus-Sus-Sussudio\", to different ears? You can do that yourself. Every song can be \"Sussudio.\" You go like this. There's this cool feature with the noise cancelation, where it will detect the sound around you, the noise level of the sound around you, and it'll ramp up or ramp down. How aggressive the active noise-canceling is, you're walking down the street, and suddenly, you're in a construction zone. What do you do? Don't fall down the hole! It will increase the sound of the ANC to compensate for that. So that's cool. There's two microphones on the outside. And then there's two microphones on the inside, for a total of four noise-canceling mics on these bad boys. Of course there is a transparency mode. So you can see in the app here, it says noise-canceling, which is on right now. Noise canceling off. Gives you a little, \"hoo doo\", kind of sound. And ambient sound. Actually, two different ambient sound modes have come up. Now, there's listening mode, says you can hear ambient sound while listening to music. Or there's conversation mode. You can hear the voice more clearly. I don't wanna talk to people. I wanna listen to music. Yeah, that works pretty well. Switching to conversation mode. Yes. - [Jake] Hello. - Jake Bell. - [Jake] You're doing a great job. - You're too far away. - [Jake] Dang, that's too bad. - I wonder how you would sound if I turn this off? - [Jake] Hello, I'm talking again. - You sound kinda the same. Another really cool feature that I've never used before, is whisper mode. So you can take one earbud out, and basically just use it as a microphone. Looking really cool on the sky train. There's a guy over there. (laughs) He's only wearing one sock. (laughs) And so you're listening through one and you're just speaking directly into another one. So your mouth is that much closer to the microphone. Pretty cool. And here is an audio recording of what the microphone sound like. All four of 'em. I can whisper a little bit. I can get really gravelly. Or, maybe I'm like Sebastian! (laughs) Got 'em. And that is them. They have these cool graphene. That's right. The G-word. Graphene drivers, super stiff. They're saying that makes 'em more accurate and less distortion. Very cool. IPX4 rating. Which is pretty typical on wireless earbuds. Means that you can sweat in these puppies. They're gonna be fine. Some splashes, they're okay. However, if you think, for $229, you deserve more than IPX4, then you know what? Spend $200 and get the TONE Free Fits with IPX7. When you put them in the wrong ones. Let's check out the TONE Free's. They're for fitness. Fitness, this whole macaron in my mouth. Hold on. This is a different looking case. It's bigger. It's got a lot of the same features. It's got that little switch guy, and the plug. Kinda different finish on it. This is just really smooth, and matte. This is almost like woven, but it's like super tight. It's cool though. Very, very fidgety. Woo! Look at that nice little line inside. And here they are. They got the UV thing as well. No Dolby Atmos on these things, but you'll see that they do have this special little, \"under the sea.\" It's called SwivelGrip technology, folks. There's a lot of friction, because it's like this silicone fin, and it's in contact with your ear across this entire length. So it's really very secure. Sticky. They're in there, dammit! What if I had my hands tied behind my back? I can't take them out! They're just, I'm under arrest and my ears are blocked! Look at that. It says around the box, IP67. I said X7 before. That was wrong. Six, seven. So they do have maximum dust protection. Six is the highest rating of dust protection. So yeah, these things are hardcore. They also have noise-cancelation. They also have the Meridian audio. How are battery life on these? Also 20 hours of juice in the cradle, but a little more on the buds. It's 10 hours on the buds. And as I tap it, it's going tick, tick, tick. You're not connected to anything though, but the surface that your finger lands on is - Pad just wants to land all that. It's just like shaped like a finger. Boom. All right, that's it for these guys. $200 for the TONE Free Fits. $229 for the Non-Fits. Check them out at LG's website. You can see that link below, and thanks to LG for sponsoring this video. If you didn't like those cables in white, we got 'em in black, too. Like, and subscribe. Isn't this a great channel? (laughs)",
    "transcript_keywords": [
        "TONE Free",
        "TONE Free Fits",
        "sound",
        "cool",
        "TONE",
        "Free",
        "ear",
        "light",
        "Free Fits",
        "ambient sound",
        "mode",
        "tap",
        "regular TONE Free",
        "TONE Free wireless",
        "pretty cool",
        "touch",
        "pretty",
        "kind",
        "super",
        "TONE Free NonFit"
    ],
    "transcript_entity_values": [
        "seven",
        "Meridian",
        "Six",
        "less than 20 percent",
        "Three",
        "Weeknd",
        "all day",
        "three",
        "the TONE Free Fits",
        "One",
        "one",
        "99.99 percent",
        "the Non-Fits",
        "20 to 80 percent",
        "Andy",
        "ANC",
        "Jake] Dang",
        "229",
        "Jake Bell",
        "5.5 grams",
        "LG",
        "SwivelGrip",
        "Nine hours",
        "Bluetooth",
        "first",
        "more than 80 percent",
        "Sebastian",
        "the TONE Free's",
        "20 hours",
        "an extra 20 hours",
        "3.5-millimeter",
        "two",
        "Sussudio",
        "200",
        "four",
        "10 hours",
        "IPX7",
        "USB-C",
        "the first 10 minutes",
        "Dolby Atmos",
        "IP67",
        "jack",
        "Meridian",
        "X7"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "ORDINAL",
        "PERCENT",
        "PERSON",
        "ORG",
        "TIME",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL"
    ]
}