{
    "id": "zF3EAhMHLG4",
    "title": "Sony got SO CLOSE! - Sony Playstation DualSense Edge",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-03-08T20:42:01Z",
    "video_url": "https://www.youtube.com/watch?v=zF3EAhMHLG4",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "Sony",
        "dualsense",
        "dualsense edge",
        "controller",
        "elite",
        "cool",
        "gaming",
        "console",
        "ps5",
        "playstation",
        "esports"
    ],
    "views": 715918,
    "likes": 18187,
    "comments_count": 1722,
    "description": "Get a $100 60-day credit on your new account at:   The DualSense controller is one of the best controllers available right now, and Sony's new DualSense Edge on paper looks like an upgrade in almost every way. Is almost close enough to make this the king of controllers or does David think that this misses the mark?  Want us to unbox something? Make a suggestion at   Buy a Sony Playstation DualSense Edge Wireless Controller:  Buy a Sony Playstation DualSense Wireless Controller:  Buy an Microsoft Xbox Elite Series 2 Wireless Controller:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Can you improve perfection? 0:19 Unboxing 2:14 Design and customization overview 9:25 Sponsor - Linode 10:05 Software settings and customization 14:34 Trying the controller in game 16:14 Why the locking cable is cool 17:45 Battery life 19:09 Pricing and overall thoughts 20:31 Outro",
    "description_links": [
        "http://linode.com/shortcircuit",
        "https://lmg.gg/7s34e",
        "https://geni.us/f491Ce6",
        "https://geni.us/ZhlqBB",
        "https://geni.us/AKBBiY",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- In my opinion, the DualSense is the best first party controller that's ever been made. So what if I told you there was a better version of it? This is the DualSense Edge. This is Sony's answer to Xbox's Elite controller, which is proven to be a pretty sweet option. This is the the best of the best that Sony has to offer currently and it comes in this nice little cardboard box. Oh, what else is in here? Paper, cool, paper. (box crashing) The controller comes in this nice little travel case. I think that's a great idea. If you are fancy and you have a DualSense Edge, you're gonna want to carry that around, show off to your friends. That being said, I don't know how often I'm going anywhere to play console games anymore. Split screen multiplayer is not really a thing, but when it is, you can do so in style. On the top we have this 2.8 meter long braided cable. It has a feature that's part of this controller's most compelling use case to me that I'm actually really excited to explore. We'll talk about that later. Outside of that, you have the four extra domes. I believe these are different heights, right? So the controller comes with three complete sets of different domes, different heights but then also the Xbox style concave ones. I've gotten used to these so I don't imagine I'll be switching, but I'm excited to try. Outside of that we have the little locking doohickey that allows you to lock the USB-C cable in place on the, no, that's not the DualSense Edge. Ew. Onto the DualSense Edge making it that it's not just gonna pull out in the middle of gameplay, which can be an issue. We'll explore it a little bit more about that. We'll take this out to keep exploring this case. We have the different types of paddles, two different sets, little half ones, and then the regular trigger type paddles. Outside of that, this case feels pretty premium. This would be a nice little travel case. They should maybe consider selling this as a separate accessory. I'd pay like 20 bucks for this thing. There's a QR code, you know what that means? - [Bell] Rick roll. Rick roll. - Oh my gosh if Sony had that sense of humor, I would be so happy. Oh my gosh, it is. No. It's a link to the DualSense page, which is neat. All right, here's the meat and potatoes of this video. We have the DualSense versus the DualSense Edge. I think the DualSense Edge is kind of ugly. (laughs) I don't like this glossy plastic. Much prefer the look of the matte. I also know my controller is not the most sanitary thing in my life so I imagine that this is going, that's user error, let's be fair. Everyone relax. (item clicks in) Oh, that was a good click. I really like the look of the touch pad as a bunch of the PlayStation symbols really small. I can feel my fingers going across it. It doesn't feel obtrusive, but it looks really premium. I like the black on white highlights. Kind of a similar visual design. I mean, it's exactly the same controller except for these little pieces. I think I like the white on white a little bit more than the black on white. Because I'm not used to looking at it, it feels almost like a third party knockoff. The buttons look like they're made of the same plastic. They feel exactly the same. Same with the D pad. One of the things I really like about PlayStation's controllers is that they're great all-rounder controllers. I much prefer Xbox controllers for shooters and racing games. I think those triggers especially in the past, have been superior. I think that PlayStation has done a good job from the beginning of having strong D pads. They're not the best. The Sega Saturn has the best, but it's a very usable D pad. So when you're playing older games on your PlayStation or even when you connect it to a PC, this is a really good controller for pretty much everything. At first glance, the analog sticks look like they're exactly the same, but as you can see here these ones come off and that's part of what makes the DualSense Edge such an appealing product is that you can customize it. But also its repairability. The original DualSense has potentiometer analog sticks so that means that they wear and tear as the the parts inside are rubbing and eventually you get stick drift. It hasn't been a huge issue on the DualSense like it's been on the Joy-Cons, but it's definitely still an issue and will persist to become a bigger and bigger issue as the generation goes on. On the bottom we have these function buttons that'll allow us to toggle between custom profiles or set different macros. We have the same headphone jack and accessory pins that we can use for charging. The DualSense Edge will work on your first party PS5 charging dock. On the back we have the trigger sliders that allow you to quickly toggle between how far the travel of the trigger will go. At the top we have the full action, middle and a middle and the bottom, kind of hairpin trigger. If you're playing Warzone and you're pulling the trigger and you want the minimum amount of time between your brain, your finger and the controller making an input on screen happen you know less travel is gonna be a little bit faster. Is it gonna be a material difference? I'll leave that up to you. Another thing of note is that the DualSense still has the adaptive triggers. If you don't know what that does basically it adapts the resistance of the trigger so that you can simulate different gun trigger pulls or pulling a bow. It'll create more resistance as you pull back. It's pretty neat and there's been some games that have done a pretty good job. I think Returnal and Astro Bot have done a pretty neat job of utilizing some of these controllers' features. But it's one of those things, especially if I'm playing competitive, I just turn them off. But it's nifty, it's nifty. I'm trying to imagine the middle of a game if I would ever switch profiles, probably not, but I think if I was playing tons of Apex on console or something I would have it right at the top. This feels a lot more reminiscent of the Dual Shocks one through three. I'm glad we have the triggers now, I think it's a much more enjoyable experience engrossing in some ways, especially when you've paired with the adaptive triggers. On the back you can see the design is a little different. On the DualSense, we have this black line to kind of show that it's premium. But more importantly we have the slots for the paddles. I don't play competitive games on consoles but I can appreciate that your fingers are resting there. They might as well do something. I think there's a lot of use cases for these paddles. It's definitely a preference thing. You can use either the half paddles or the full paddles. If you don't know what they're used for, for a lot of competitive games, you can just remap different buttons so it's a little easier to access. So you'd be able to map something that you're using a lot on the face to the back, meaning you don't have to take your thumbs off the sticks. Basically allowing you to keep aiming, stay focused on the right thing while you still perform your actions. These feel pretty good. I've used the SCUF controllers with their paddles and I always found they felt really cheap. I think that whole controller feels really cheap. I really don't like the SCUF controllers. I think the DualSense feels very premium. It's a $70 controller, $10 more than what controllers used to cost but it's always felt very comfortable in my hand. I'm glad they didn't drastically change the shape. My middle fingers land pretty naturally right on the triggers while my fourth and fifth pinger. Pinger. (laughs) While my fourth and fifth finger grasps the handles pretty tightly. With your eyes closed you'd have a pretty hard time telling the difference between the DualSense and the DualSense Edge other than these extra plastic flourishes and the slight weight difference. However, in your hands they feel about the same. The DualSense Edge 325 grams 328 on our scale, that's marginal error. And the DualSense is 280 grams. 281. 281 grams. (mumbles) They feel pretty similar in the hands. There's that phenomenon of heavier things feeling more premium, but it's so slight I wouldn't really describe it as that. As I rub my palm, which is not a realistic use case, I can feel the seam on the side a lot more on the DualSense Edge. The black also has a seam. It's not as pronounced, like it doesn't feel as uncomfortable. It's definitely there but it almost feels advantageous where it adds an extra grip point. Overall, if you've held a DualSense, you've basically held a DualSense Edge. Here's where things get interesting. Modern controllers have a plague. Stick drift. As long as we're not using hall effect sensors that use magnets to detect stick motion and instead we're using potentiometers that rub against each other, we're always gonna have stick drift in some way or another. Unfortunately, even though this is a premium product they're still cheaping out and using potentiometer-based analog sticks and that sucks. The great thing about the DualSense Edge is that you can swap them out. We gotta figure out how to do that. On the bottom there's a little release latch that just frees up this flace, this face plate. Why did they go glossy black? It looks so (bleep). This is trash. I'm actually upset. Underneath we have this latch that releases the little analog stick module that Sony will be selling separately for $20 each. The construction's quite good and you can see this little port. It's quite a nice little device but it sucks that it's so expensive. GuliKit has mentioned on their Twitter that they're intending to sell their own version of these modules with hall effect sensors. That's pretty exciting. So far we've had a pretty good experience with those controllers and those sticks so being able to swap them in and out as easily, that's pretty great. This is a very nice little mechanism and I'm quite impressed. Once the face plate goes on. Honestly, can I just game without it? It honestly looks way cooler without it. That pretty much covers the physical exploration of the device. I am so excited to get on a PS5, customize the software and really experience it after I tell you about our sponsor, Linode. Thanks to Linode cloud computing from Akamai for sponsoring today's video. Linode is a powerful Linux-based cloud computing service from Akamai that's affordable and easy to use. They have a large marketplace with one-click apps to quickly deploy servers for website development, file hosting, database management, video hosting or even video game servers. Linode's affordable pricing has no hidden fees and you only pay for what you use. Best of all, Linode has worldwide data centers and a hundred percent human 24/7, 365 customer service. That's every minute of every day where customer service is reachable by phone, email or social media. Sign up for a free account today and get your hundred dollar, 60 day credit on a new Linode account at the link in the description below. That's pretty cool. There's a separate menu inside the settings to just adjust your DualSense Edge stuff. So let's kind of go through. One thing I didn't realize is that the more paddle like ones, you can have them in this orientation where they stick out more from the controller and it's more of like a vertical press. Or you can have them a little more flush to the controller kind of along the natural edge and then your finger will kind of more naturally fit there. I think that's what I'm gonna go to. Adjust the input sensitivity. That's neat and then set the input rate for your controller. Sure. It's prompted me to hit the function button. If you hold it, it'll bring up these profiles that you can switch between. It gives you a little indicator that makes it a little easier to remember. I was kind of wondering that myself. I'm like, I won't remember what profile I have all the time If I'm switching between five or six profiles. That's pretty nifty. Setting up your controller by creating a custom profile. Let's do it. We're gonna go through the whole journey. So I'm gonna call it short perky for no apparent reason. Customize button assignments. I'm a big fan of not having the left stick be my sprint button where you click down and push. I find there's just a loss of control. I would way prefer to have it be tied to a trigger so you hold the trigger while you're pushing, you can sprint. I'm gonna assign the left stick press to my left paddle and I'm assuming that it's just as simple as selecting L3 and that's gonna assign L3. I'm going to unassign. Interesting. You can turn on and off the left stick itself. I imagine that's more for accessibility reasons if you wanted to tie it to something else in the game. I don't have a use for that but I do wish to turn off the left stick button. One thing I'm curious about is turning off and on the touch pad. This is actually something I would very much enjoy. There's lots of games that have functions tied to the touch pad and I often accidentally engage them you know, as your finger swipes across them. Having a profile where you turn off touch pad. I'm gonna also disable the right stick button. Next we have stick sensitivity and dead zone for short perky. As I push the stick in a direction you can see the amount it's going. I genuinely enjoy a little dead zone. We have the different sensitivity curve so default, quick, precise, steady, digital, dynamic, and they're all accompanied with a little neat graphic indicator to kind of give you the idea of the curve. I'd imagine if I was playing competitive shooters on consoles, I would definitely play around with these. A big advantage that mouse and keyboard has over controllers is how quickly you can adjust your aim. So being able to have these different profiles where pushing the stick all the way to one direction gets you moving really fast but in the middle there's like a little bit of a more sensitive area I think could be really, really useful. I'm gonna leave it on default for now. I am gonna boost my dead zone a little bit cuz I very much enjoy having games not immediately move when I press the stick. There is a natural dead zone built into most controllers and games, but sometimes especially when I'm playing on a PC, there's the issue of I move the stick a tiny bit and it just starts rotating the camera a lot. Like on PC, things aren't designed to work as well together so sometimes you can get a controller with no dead zone but a game that is expecting the controller to have a dead zone and it can just be a little bit unwieldy. I was playing High-fi Rush recently and I had to kind of go and adjust my controller settings quite a bit to make it feel okay. You can also adjust the trigger effect intensity. But as it says, once you adjust your sliders for the triggers, it'll stop the effect. The nice thing is switching between profiles is as easy as holding down the function button, pressing a face button, switch to short perky, switch to default profile. Let's go short perky for now. I'm gonna go to mine 'cause I don't think this one actually has any games. This is great. Even though I've switched profiles, the controller is storing the different profile settings. Another thing of note is if you hit function and the options button it's gonna bring you into this customization menu and you can create your profiles here. It's kind of neat, even in the menus it'll switch the buttons around. I had disabled my right stick and in this password menu the right stick is the switch to symbols button. So I had to remind myself that I'd switched it to the back. PlayStation controllers have always had the issue of because their sticks are in symmetrical location if you have really big hands your thumbs can kind of rub. It's not super common like I don't have big hands but I've never come close to having that issue. PS5 controller, the DualSense fixed that by having these a little bit further. I think I liked it more just on the right stick. I think it pushes my thumbs off so that it feels less ergonomic. I think the DualSense is a very good natural hand shape and this forces my thumb to be just a little more elevated. What we have set up right now isn't really gonna change anything in the lasso so I'm gonna go back, see how easy it is to change my profile. The right stick doesn't do much so I'm actually gonna assign circle to the right stick. That's kind of your crouch and your prone button. Okay it immediately works. That's kind of neat. I imagine if you are someone that's interested in this you like the nitty gritty of going in and changing every setting so having it be so easy to go from game to changing your settings is very important. If you had to leave your game or even suspend it so you could make adjustments, that'd be a pain. Because where lots of games will totally be fine just using the DualSense controls, I imagine some will be better off using some in-game customizations and some controller console level customizations. Now we're gonna try the different trigger travel settings. We have it all the way to the default. This is something I'm very familiar with. I play a fair amount on my PS5. Let's go middle setting. I don't really like the feel of that. Last of Us isn't a game I probably would change my trigger settings too much on. Of the three settings, I personally, especially in a more narrative game, would leave the triggers on full travel. If I was playing something competitive I don't really see the point of having the middle setting. I think I would go all the way to the top setting. It's not like the middle setting has haptic triggers or some kind of middle ground. It's still everything disabled so I might as well take the most advantage of the shortened travel for better control. These paddles feel good, they feel premium. Way better than the SCUF controller. Screw you SCUF. For a game like Last of Us I would want my triggers to have the full travel to be immersive. But if I was playing something competitive I can definitely see the benefit of the shorter travel. PlayStation controllers. The Dual Shock 4 and the DualSense are both highly sought after controllers for a variety of applications. They are good for reliability and input latency. And like I said their button configuration and the button quality is good for a variety of different genres. However, if I was playing games competitively, wired controllers are the best. And there hasn't been a first party Sony wired controller since the PS2 era. The PS three, to my knowlEdge didn't have a wired first party controller and the Dual set Shock 4 has not. So this is the first one. Basically you take the wire, you put it in there, close it up. There's a little toggle here from unlock to lock. You push it in and then you slide it to lock. It clicks and it's pretty solid. That's pretty good. With the Dual Shock and the DualSense you can run them in wired mode and it actually transmits the data through the wire. It's not just power. Although it made almost no difference and my skill level was always the barrier. I liked knowing that that was true. So this is just kind of a perfection of that idea. Even if you get upset, you know, you yank on the cable it's pretty solid in there. I don't like doing that because it's an expensive thing. I don't wanna like damage it. But that feels pretty frigging solid. (laughs) This is a pretty nifty engineering design. It means that the top isn't a whole mechanism it's just two holes. Although I bet those get gunked up real quick. Although I guess if you're dipping your thing in cheese dip. Don't do that. And having it plugged in is kind of ideal because what was the biggest weakness of the regular DualSense is the even bigger downfall of the DualSense Edge. This battery in this bad boy, this much more expensive bad boy, is almost 30% smaller than this. This is 1560 milli amps and this is 1050 milli amps. Sony claimed that this is 12 to 15 hours. That's total B.S. I get tops eight hours. Realistically, five, six. So I just plug this in every single game session. And they claim this is five to 10 hours so it's gonna be even less. Outlets are claiming around five hours but as the battery degrades, that's just a pain in the butt. I think it's a huge missed opportunity to have the pro version of this controller not have a bigger battery, not have an interchangeable battery, not have some way for this to be a way better user experience. That is not enough battery life and Sony really has to figure out some better system cuz their controllers are awesome and all these extra features are nifty. Like having a built-in mic and speaker, having these like cool LEDs, having accessory docks and stuff. Those are cool, but it sucks that I have to charge my controller in every single time and I do that but there's other people in my house that don't. So sometimes I pick up my controller and it's dead and then I have to spend a few minutes, either like three feet away from my console 'cause that's how long my cable is to play it or just wait and I don't want to wait. And I don't to wait. I don't have time to wait. This solves a few of those issues. You get like a a three meter cable, that's cool. You can play with it wired. But it doesn't solve all of that and I think that's a huge downfall in a controller that is better in every way essentially to the DualSense to have this one major flaw. But is it enough to warrant having it be almost triple the price? The original DualSense is $70, this is $200. Big pluses. I think the switchable analog sticks are great. I think the extra customization and the software for the right people is a huge, huge, huge deal. Having this wired mechanism, that's pretty nifty. But I really don't think it's worth $200. I don't feel like it's that much more premium. I don't think it looks better. I really hate this stupid plastic finish. I have a hard time justifying the upgrade from a DualSense to a DualSense Edge. Just like it's harder to justify the DualSense Edge in the light of the Xbox Elite controller. It has the four back paddles, it has the switchable D pads. I think the Xbox Elite feels much more premium than the base one. It also has a 40 hour battery. It's not apples to apples. The DualSense has so many more little stupid features that are nifty but aren't that important to me and having a 40 hour battery would be really (bleep) nice. Thanks for watching \"The Short Circuit\". If you like fancy (bleep) controllers, why not check out Linus' unboxing of the Elite series 2 controller? - [Bell] Bye. - Bye.",
    "transcript_keywords": [
        "DualSense Edge",
        "DualSense",
        "controller",
        "Edge",
        "pretty",
        "stick",
        "kind",
        "Xbox Elite controller",
        "feel",
        "trigger",
        "thing",
        "games",
        "game",
        "button",
        "feels",
        "triggers",
        "good",
        "sticks",
        "pretty good",
        "Sony"
    ],
    "transcript_entity_values": [
        "half",
        "five",
        "Akamai",
        "328",
        "60 day",
        "20 bucks",
        "hundred dollar",
        "The DualSense Edge",
        "Rick",
        "three",
        "the DualSense Edge",
        "One",
        "around five hours",
        "4",
        "one",
        "DualSense",
        "20",
        "DualSense Edge",
        "three meter",
        "2.8 meter",
        "DualSense Edge",
        "325",
        "fifth",
        "Us",
        "281",
        "281 grams",
        "L3",
        "almost 30%",
        "365",
        "eight hours",
        "Elite",
        "a DualSense Edge",
        "five to 10 hours",
        "Twitter",
        "Xbox",
        "70",
        "Linux",
        "Astro Bot",
        "Apex",
        "280 grams",
        "PS5",
        "1560 milli",
        "first",
        "Saturn",
        "SCUF",
        "Sony",
        "a few minutes",
        "The Short Circuit",
        "three feet",
        "two",
        "Returnal",
        "between five or six",
        "200",
        "four",
        "12 to 15 hours",
        "1050 milli",
        "almost like a third",
        "24/7",
        "Xbox Elite",
        "a DualSense Edge",
        "a hundred percent",
        "the Dual Shock",
        "Linode",
        "every minute",
        "40 hour",
        "Linus",
        "Linode",
        "Xbox",
        "six",
        "the Joy-Cons",
        "jack",
        "2",
        "10",
        "PlayStation",
        "today",
        "fourth"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "TIME",
        "ORG",
        "FAC",
        "TIME",
        "ORG",
        "FAC",
        "MONEY",
        "GPE",
        "PRODUCT",
        "LOC",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "TIME",
        "TIME",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "DATE",
        "ORDINAL"
    ]
}