{
    "id": "ZHgdxomXWOM",
    "title": "YouTube, Fix This.",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-10-14T18:09:55Z",
    "video_url": "https://www.youtube.com/watch?v=ZHgdxomXWOM",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 92472,
    "likes": 4774,
    "comments_count": 630,
    "description": "Do you think YouTube has a problem? The WORST Xbox:  The WEIRDEST Consoles of All Time:  WISH Needs to CHILL:  The WEIRDEST Smartphones:  WEIRDEST Products on Instagram:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Millions and BILLIONS 0:10 YouTube is NOT helping 1:44 Youtube Handles 2:50 Handles DONT work.. 3:42 Youtube is LOCKING 4K 4:24 This is NOT a bid deal.. 5:10 Our DARK secret 6:05 YouTube is EXPENSIVE 7:12 I remember when we DIDNT have ads 8:14 Its not as bad as Twitch 9:42 Why we didnt switch to 4K 10:42 What people DONT realize 11:42 DONT get the pitchforks out 12:53 Its easy to be negative 13:41 TikTok is WAY worse 14:44 YouTube Red didnt work 15:11 What do you think?",
    "description_links": [
        "https://youtu.be/AtgmhuBrJPY",
        "https://youtu.be/sneLZ8Toeaw",
        "https://youtu.be/Lhb_pp0A47A",
        "https://youtu.be/-A7CIS2C2bc",
        "https://youtu.be/FlKv4BFM4Hc",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- Billions and millions of billions. Say it with me now. Billions and millions and billions. - Billions and millions and billions, that's how many views we'll have when you subscribe to \"This Is.\" - YouTube has finally decided to crack down on spam bots that have littered all of the comment sections for months, except they're doing it in a way that probably is not gonna do anything to fix it. - Yeah. So the problem has been for a while that on most popular YouTube channels, as soon as the video goes live, you'll see spammers who are pretending to be you. Right? So you'll see a \"This Is.\" - \"This Is\" is popular enough that we have our own spam bot, which is so much better to me than the play button. - It's a thing that's, like with most scams, most people don't fall for it, but enough people fall for it to make it very much worthwhile. And I'll tell you, for the last several months, every time I post a video, I pretty much keep an eye on comments for the first few hours, almost less so to actually reply to people, I do a little bit, but it's almost more so of banning the spam accounts. And I'll see some of it's automated, but I think a lot of it's actually just people just sitting there creating new accounts, commenting, getting banned, and trying over and over. - So even when you ban one, you know, 12 more take their place. I do the same thing. It's really been annoying. And I mean, I know you get messages from this, I get messages from this and be like, \"Hey, did you know that someone is commenting on videos pretending to be you?\" - No, it's worse, man. I've gotten people who've said like, \"Hey, I sent you the hundred dollars. Where's my iPhone?\" - Really? - Oh, I've gotten several times. Yeah, people have fallen for it. - No, I haven't gotten that. - So all the scams are different. Everyone can have the same name. Like I could theoretically, even though they've kind of banned now, you could have 300 accounts that all have the \"This Is\" name. Now, they've kind of cracked that down a little bit. But the sort of display names are not unique, which they've changed now that they've introduced \"handles.\" Handles are unique IDs per channel that everyone gets and keeps, right? So if I make, you know, \"AustinEvans\" as a handle, which hopefully I will have by the time this video is live, although I think they're still- - I already got \"ThisIs\" as a handle. - There you go. It's rolling out, I believe, over the next month or so. But essentially, if you see \"AustinEvans\" as the name, you know for a fact that that is the true authentic person. - Which we already have that because we had verified check marks. People just don't look at that, and they don't look at the check mark, and they don't look at what's verified. But also, the problem is, like there's multiple channels with similar names. You're gonna fight over it the same way you fight over a Twitter handle, the same way you fight over an Instagram handle. What happens when a cooler, better kid named Austin Evans comes along? You have the Austin Evans handle. So now this guy's gotta go, \"What's his options?\" He doesn't want to have like a dumb name like, you know, whatever. - He should change his name to Duncan. Those are the rules. - Yeah, like he doesn't wanna have a dumb pseudonym, Duncan333333... He wants to go by his actual name. So now he's gonna have to go AustinEvans01, AustinEvans02, whatever. The scam bots are just gonna go and scoop up AustinEvans, 1, 2, 3, 4, 5, 6, until the end of time. And then we're just gonna have the same problem. - I think the idea for YouTube here is that they're going to try to make these handles more forefront, so that you should be used to seeing, you know, AustinEvans or one of these like sort of regular kind of names. And if you see something that looks a little weird, it's gonna stand out a little bit more than the current system. YouTube has gotten a lot of flack, rightfully so, for the spam problem. Because it has been egregious over the last year, two years or so. And this is a step forward as are some of the like comment moderation tools they've had and whatnot. - They've gotten a little better. There's like some AI bots that- I just love that they have like an AI system that's fighting the bot. So you like you have this weird mechanical civil war that's happening- - Bot versus bot. - Yeah. And then on top of that, YouTube, like they're already under some like bad press because of that. But then they go and say, \"All right, you know what, if you want your precious 4k, you're gonna have to finally bite the bullet and you're gonna have to get YouTube Premium or whatever it is we're calling it this week.\" - So I have a bunch of thoughts on this- - I also do, and none of them are gonna be popular with the audience. - Before we get super deep into it, this is not an official policy yet. I don't believe YouTube- - [Matt] It's rolled out and there's some like alpha, beta, zeta, sigma test going on. - Because they're testing something doesn't mean it's necessarily coming, it's pretty likely that's gonna come. But YouTube do a lot of wacky, weird UI tests and stuff all the time and they backtrack on some of it. So let's just be clear that we're recording this at a time where it seems likely but not certain that 4K will be pay-walled behind YouTube Premium. - Here's why this is not the big deal that you all think it is. - Okay, enlighten me. - Again, I know that this is not gonna be a popular opinion and I don't really care. - Spicy. - One, if you're watching on a cellphone, you're not benefiting from that 4K whatsoever. - \"But, Matt, my Sony Xperia has a 4K resolution OLED, I need all my pixels.\" - And I'm telling you, Nathan, shut up. I'm gonna spill some tea. - Woo! Matt's getting spicy. Everybody subscribe and ringaling, 'cause you better be buckled up for this one. - Everyone's like, \"Oh, well 4K is just such a higher fidelity.\" This is uploaded in 4K- - Shhh. Don't say that. - For years. - Matt, don't say it. Don't say it. - \"We recorded in 1080.\" (Austin laughs) We shot with Canon C100s, they're pretty old cameras. And they would shoot 1080 at a fairly low bitrate, it looked pretty good, and then we would just export it as 4k. There was no, you know, AI upscaling. There was nothing fancy going on other than, we stretched those pixels out. And then the comments were, \"Thank you for finally uploading in 4k! It looks so much better! Everything looks so much better!\" - Let me be clear, we are no longer doing that. We would never deceive you like that. - No, we're actually shooting in 4k now. - We actually shoot true 4k, which if you're a YouTube Premium subscriber, I guess you're gonna find out soon. So my argument for 4K is actually nothing to do with the resolution, but it's the bitrate. YouTube runs at a very low bitrate. Now mind you, while we all take YouTube for granted, and us as content creators fork over a very significant chunk of our AdSense revenue to fund YouTube, which is rightfully so, I'm not paying for bandwidth and everything like that, but the bandwidth costs for YouTube are astronomical. You talk to someone like Linus, who, you know, runs Floatplane, they host all their own things. And even when you're self hosting, even doing something like that, bandwidth costs are obscene. And I think that YouTube having allowed you to upload content for free- - Billions of videos, trillions of hours, like it's absurd how much content goes through this platform. It's very easy to get mad at YouTube a lot for, \"Oh, they're showing us two, three ads in the beginning of it.\" Keep in mind, the content that you're consuming on a daily basis, and I would say most of our audience, YouTube is the primary source of content for them. It's still a free platform. I see more ads per 10 minute span on a cable package that I am paying $70 a month for. You guys don't realize how good you have it to watch as much content as you- And this is like, this is me being old, because also, like I remember when YouTube didn't have all these ads, the content sucked. We had old Austin Evans and that was the best content on there. - Ouch. Now the one thing I can say, that I would be appreciative of from YouTube, is if they paired this with an improvement to the bitrate of videos. Because here's the thing, 1080p as a resolution, totally fine. 1080p YouTube content? Pretty mushy. Now mind you, it's fine. Right? And I think most YouTube content is not cinematic enough in nature that it's going to make a massive difference if I'm being super honest with you. They put this effort into improving bandwidth, especially taking advantage of codecs such as AV1, which I do know that YouTube are doing, specifically on Android, which is a very efficient codec that will allow you to get with small data sizes much, much more quality. This is one of those things I think could make a bigger difference. But I just think, and this is sort of my general life philosophy, as much as it's nice to get the pitch forts out and be angry that something's being taken away or blah, blah, blah, I do think sometimes it is worth thinking about the health of the platforms that we use and also being appreciative for the things that we have taken for granted, right? You look at what's happening with Twitch right now, where it is a pretty open secret that Twitch are sort of running into financial difficulties. - [Matt] It dumpster fire. Let's not mince words. - It's easy for us as consumers to be like, \"Oh, I've been used to it, it's been like this.\" But like, these companies are spending unbelievable amounts of money, and you look at a platform like Twitch where people are like, \"Oh, they're owned by Amazon,\" or whatever. So what? Amazon bought them to make a profit, not to pile more money in to keep this thing like alive. I feel like we're being very defensive of YouTube here, and I do think it's coming off a little bit more negative than I think it should be. - I agree, I agree. - But I just think it's so easy to get used to something without thinking about or appreciating what it is. And the fact that YouTube has offered 4 and 8k content, streaming for free, in a lot of cases it's not even monetized. - HDR. - Exactly. I do think is something that probably in hindsight was not going to be super sustainable for a long time. Especially as YouTube think about like, \"Oh, Google needs to save a couple billion dollars.\" What do they do? They put 4K behind a pay-wall. Like I don't think that's an unreasonable thing for a free platform. Now you may disagree, and if you do, feel free to let us know in the comments below with your shiny new handle and tell us exactly how wrong we are, but like just for me, I'm certainly biased because YouTube I have a deep sort of personal relationship with, I mean, I think without YouTube my life would be wildly different. So I think I'm always gonna have a little bit of a soft spot there. But also, as someone who runs a business, I can tell you that if I could flip a switch and upload all our stuff in 1080p instead of 4K and save massive piles of money, I would do it, right? - Which, for the record, is why we originally on \"This Is\" were shooting in 1080 because it saved us so much money. Not just in the fact that we got used cameras, that was part of it. The amount of data, you know, we shoot multi-cam, you got a camera here, you got a camera here, you got a camera here, we got a camera over here for some reason, even though we never use it. - And Kenzie's got a camera over here. Back when we recorded \"This Is\" at 1080p, the cameras themselves were like half the price. We had one recorder instead of five individual recorders. - Yes. A single recorder which could take a quad-stream, 4 camera signals, and make one video file. - It was all on one SSD where as now we have five different pieces of media to do. Like we've spent serious money and we spent serious time moving around, offloading, storing these massive data files. Now mind you, we do it because we do want to deliver true 4K and not the fake 4K that we were maybe doing for a little bit. But that's only because \"This Is\" has hit a level of success that's made it easier for us as a business to justify investing in 4k. - So many people just don't realize that pixel count, it's certainly a number, but like, the bitrate changes that so drastically that like you can have very crappy looking 4K video. You do see that on the spot, like Netflix is not great 4K video. We hear it constantly whenever we talk about any type of internet-based thing like cloud gaming or whatever, and everyone's like, \"Well, my internet's not that great and I can't stream that.\" The data rate for like X Cloud is actually lower than the 4K version of of YouTube, which is already a pretty low bitrate. So if you're telling me that you don't have the data-rate for cloud gaming, that means you don't have the data-rate for 4K anyway. Like Austin said, we were kind of negative on this. And it's not to say like, \"Oh, we're trying to convince you that you don't need 4k.\" We're not trying to convince you that 4K sucks and we're not trying to convince you to go get YouTube Premium. What we're saying is, don't get the pitch forks out quite yet. Remember that you still have a platform where you can watch literally an infinite amount of content for free. Yeah, it does suck when a company takes something away from you that you used to have. But I feel like most of you aren't going to actually really recognize the change. This is, again, not trying to defend YouTube and whatnot, but keep in mind, those ads that you guys complain about or YouTube premium, that directly pays our salaries. So when you're watching a creator that you like and you wanna support them, when you have an adblocker on, yeah, it hurts YouTube, but it also directly hurts the person you're watching because they don't make that money. Keep that in mind. - It's an ecosystem. If you are watching content, you are part of that ecosystem, right? YouTube is a big part of the ecosystem, the creators are a big part of the ecosystem, and there needs to be some equilibrium in the space. If we are creating tons of content that we love, we're making lots of content that you watch. But YouTube is like, \"You know, we're outta money. We gotta shut down or we gotta start cutting things down.\" That's a big problem, right? Now, I'm not gonna tell you that YouTube needs to make billions and billions of dollars a year and it's great, I mean, they probably need to- - No, and they do. - But like, we need all elements of this to be a successful kind of thing. It's so easy to be negative. It's so easy to be entitled to what you've been used to. And I know, again, this is gonna come off as incredibly pro-YouTube, and I don't really mean for it to be like that, but I just get really irritated when I see people just constantly clowning on YouTube and never giving it any kind of props or appreciation. - It's like, \"I'm never gonna use YouTube again.\" Like, where are you gonna go? - If you're gonna get upset about 4K versus full HD? I mean, I agree it's not a good move and I would very much be much happier with it if YouTube paired it with higher bitrate HD videos, which you think would be just as good. 'Cause honestly, 4K on YouTube is only really about the same quality as like a high quality HD sort of stream on something. So they could kind of fiddle around with that. But just people love to pull the pitchforks out. (Austin mumbles angrily) I'm just like, \"Appreciate what you got sometimes maybe.\" - For me, it's the double standard of, TikTok video quality is garbage. - It's garbage. - And no one mentions it. Because there's an expectation of, in order to be successful on YouTube, you need to have this production quality. Because people treat this like television nowadays. And a lot of people say, \"Well, TikTok doesn't show me 12 ads in a row. And they didn't take quality away,\" or whatever. But they also don't pay their creators. - [Austin] Yeah. - Just recently I had a 1.5 million view TikTok. - Congratulations. - Thank you. How much do you think I got paid for that? - 35 Cents? - I mean it was more than that, but it's $12. - There you go. - $12 for 1.5 million views. - If you get 1.5 million views on YouTube, you're talking about thousands of dollars. - You're set for a couple months. The real problem here is that, YouTube has tried to incentivize people to get Premium, they've been trying to push Premium forever. They've tried to incentivize them with unique content which no one watched, for the most part. Like there are some really good shows. - [Austin] \"Could You Survive the Movies?\" is a great one. I'm in two seasons. - So they tried to like, \"Oh, we'll take away ads.\" They tried to give you the value proposition. - Yeah. - And that didn't work. So now they're taking things away. Like here's what I'd love for them to say, \"Oh, this move is helping us save billions, which we now can reinvest into the shorts creator fund.\" That's what the optics need to be. If you're taking something away, you need to show that that is actually gonna benefit the people who use your platform. And they didn't do that. But again, just asterisk, we don't know if they're actually taking away 4k- - Yeah, here's the thing- - All of this can be moved- - The gist of this, kind of debate, which I feel like we just turned into the 4K YouTube show, is that, yes, these changes may be coming, and yes, I agree they are not good. Let me be very clear. Downgrading the video quality if you are not a YouTube Premium subscriber is not a good thing. But this is not happening in a vacuum. And I think, as with most things that people get upset about on the internet, it is worth taking a little bit of time to educate yourself on the entire picture. It also is one of those things where it's very easy to get used to the way things are and to feel like you are owed something that YouTube is doing or whatever, when that's just not the case. YouTube has to do what they need to do to make sure they are a successful business so that we can continue creating content and you can continue watching it. And if YouTube needs to make this change and save themselves billions of dollars a year, which maybe is an exaggeration, I don't know, but I bet that 4K download and uploads- - I wouldn't be surprised to be honest. - Then by all means, YouTube, go for it. Just maybe throw me a a few extra bits in my 1080P video and I'd be happy. I'm very curious, what do you think about YouTube and their very expensive bandwidth problem, and what do you think about the spam bot problem? If you see anyone talking about Telegram in the comments, I can assure you that it is Matt and do not Venmo him any money. - Venmo me money so I can do things. (mellow music)",
    "transcript_keywords": [
        "YouTube",
        "YouTube Premium",
        "content",
        "people",
        "Billions",
        "thing",
        "Premium",
        "things",
        "make",
        "video",
        "Yeah",
        "YouTube content",
        "YouTube Premium subscriber",
        "money",
        "Austin Evans",
        "time",
        "problem",
        "kind",
        "bit",
        "handle"
    ],
    "transcript_entity_values": [
        "Twitch",
        "Android",
        "three",
        "two seasons",
        "10 minute",
        "UI",
        "1080P",
        "billions of dollars",
        "TikTok",
        "YouTube",
        "zeta",
        "Floatplane",
        "this week",
        "4k",
        "the last year",
        "Nathan",
        "Twitter",
        "Duncan",
        "the next month",
        "Google",
        "3",
        "Matt",
        "35 Cents",
        "YouTube Premium",
        "the first few hours",
        "daily",
        "Austin",
        "YouTube",
        "4",
        "12",
        "Netflix",
        "sigma",
        "Instagram",
        "Could You Survive the Movies",
        "the hundred dollars",
        "4K-",
        "a couple months",
        "2",
        "1.5 million",
        "trillions of hours",
        "about thousands of dollars",
        "K YouTube",
        "pro-YouTube",
        "Sony Xperia",
        "6",
        "1080p",
        "the last several months",
        "Kenzie",
        "AustinEvans",
        "300",
        "4",
        "Linus",
        "billions",
        "five",
        "millions of billions",
        "1",
        "Venmo",
        "billions and billions of dollars",
        "Austin Evans",
        "one",
        "free- - Billions",
        "Canon C100s",
        "1080",
        "5",
        "AustinEvans",
        "two years or so",
        "12",
        "years",
        "months",
        "YouTube",
        "half",
        "70",
        "two",
        "Amazon",
        "a couple billion dollars",
        "iPhone",
        "8k",
        "Billions and millions",
        "about 4",
        "millions and billions"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "MONEY",
        "ORG",
        "TIME",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "TIME",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "GPE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL"
    ]
}