{
    "id": "zHky9TCfT68",
    "title": "Surface Book 3 (13.5-inch) first look",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-05-19T14:00:35Z",
    "video_url": "https://www.youtube.com/watch?v=zHky9TCfT68",
    "category": "Science & Technology",
    "tags": [
        "surface book 3",
        "microsoft surface book 3",
        "microsoft surface",
        "surface book",
        "surface book 3 first look",
        "surface book 3 hands on",
        "surface book 3 review",
        "microsoft",
        "surface",
        "hands on",
        "first look",
        "review",
        "intel gen",
        "core processor",
        "processor",
        "gpu",
        "laptop",
        "laptop hands on",
        "microsoft laptop",
        "screen",
        "display",
        "price",
        "battery life",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "iphone",
        "verge",
        "the verge",
        "dieter bohn"
    ],
    "views": 720891,
    "likes": 11396,
    "comments_count": 960,
    "description": "Microsoft updated the Surface Book 3 with new 10th Gen Intel processors and new GPU options. In this first look, Dieter Bohn talks about the whole idea of this laptop with a detachable screen. If your laptop screen turns into a tablet, what are the tradeoffs?  Read more:   If you buy something from a Verge link, Vox Media may earn a commission. Seeour ethics policy:   Order the Surface Book 3 at Microsoft:   Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/3e0YsA8",
        "http://bit.ly/2TQsqjB",
        "https://bit.ly/2WBSjTW",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "(upbeat music) - This is the Surface Book 3 which Microsoft updated for 2020 with new and faster components on the inside but left the outside pretty much exactly the same. Actually, exactly exactly the same. It's the same. The idea here is you're supposed to get a full power pro laptop with a GPU and lots of horsepower battery in the base, but if you want, you can detach it and turn the screen into a tablet. Now, this idea the first time we saw it was like \"whoa\" and then the second time we saw it, it was like \"okay, yeah\" and now I feel like with this third iteration, we finally understand the trade-offs. The Surface Book 3 isn't a traditional laptop and that means different trade-offs. You have to ask yourself how important this really is. (upbeat music) Alright, first trade-off with the Surface Book 3, when you're in the standard laptop mode, I just think there's little too much bulk. It's like the volume to power ratio is just a bit off. It's big and it's thick, even this 13.5 inch version. Now, the reason for that is because there's so many, you know, computer guts in here behind the screen which does make it just a little bit top-heavy. It's never tippy, but you can really feel it's a little bit odd when you carry it around. But, look, it's very well made and the keyboard here is great. The trackpad is a little tiny bit on the small side for 2020 but it is super smooth and accurate, precise, I love the trackpad. I do wish that there were thunderbolt ports, but Microsoft has some evidence that says that thunderbolt ports are insecure. At least there's usb-c and there is an sd card slot. Thank you. No, really, seriously, I mean this. Thank you. The screen is great, it's 13.5 inches and a three by two aspect ratio so it actually feels really really big, bigger than other 13 inch laptops even though the bezels here are substantial. It also feels really really big when you use it as a tablet. This is not like your ultra portable tablet thing. This is substantial. Finally, the whole reason this entire system works is because of this very fancy strong snake hinge on the locking mechanism and all that and as neat and cool as it is, I sort of feel like this isn't the final form of what a tablet laptop hybrid is meant to be. When you close it, the hinge gap here is just really big, a whole bunch of stuff can get in there, and it makes the whole thing thicker than other modern laptops. It's very very nicely built. Hardware, I really like surface hardware but it just feels like it's a little bit ungainly. (subtle electronic music) So okay, what's new here? Well, because it's all internal changes, we have to talk about some specs. Here we go. The big thing is Intel's 10th gen processors. The basic model of the Surface Book 3 has a Core i5, Intel standard Iris plus Graphics. Eight gigs of RAM, 256 of storage, and that goes for 1600 bucks. This review unit is $2500 which gets you a Core i7, 32 gigs of RAM, 512 of storage, and the keyboard base here has a basic Nvidia GTX 1650 Max-Q GPU. The 15 inch can have an even better GPU. (sighs) So, you can spec one of these up to be, a bit of a beast, but like, the X-Men live-action movies version of the beast. Not the super burly one from the comics or the cartoons. It's a smaller, more refined beast. Because the thing about the Intel Core i7 chip that's inside the Surface Book 3 is that on the 13.5 inch and even the bigger 15 inch, it's the 15 watt version of the Intel chip. The kind that you usually see in Ultrabooks. It's not the 45 watt version that you might see in a Dell XPS 15 or a 16 inch Macbook Pro. Of course, the reason for that is you can detach this and they need to keep the processor with the screen and so, they can't fit, you know, the higher thermals inside this little tablet here. So, that is the second trade-off. You get a slightly less powerful CPU. Now even with this separate special Nvidia GPU, this is still not like a traditional gaming laptop. I mean look, you could definitely do way more gaming on this thing than you could on an Ultrabook or a Surface laptop or something like that, but a traditional gaming laptop, like a Razer is gonna give you way more power for way less money. But if you do a bunch of stuff that leans heavily on the GPU, like I don't know, CAD drawing or something, this will be able to take advantage of that, make your work flow a bit faster when of course, the thing is docked. We are gonna run some benchmarks for the full review and by we, I mean Tom Warren and Monica Chen who are actually reviewing this thing so stay tuned for that, but, tell you what. Here's the Geekbench score and here's the Cinebench. You may now debate in the comments. Bottom line, there's three main downsides to the Surface Book 3. Price, a little bit of power, and bulk. It's pretty big for a 13 inch laptop. But in exchange for that, you get really good quality hardware because it's a Surface. You get a clean, Microsoft software experience without all that extra junk on it. And, of course, you can remove the tablet. That's the whole point of this thing, which means that there's no clean one-to-one, heads up comparison that I can give you to another laptop, because the extra cost that you pay for a Surface Book 3 doesn't really fit on a spec sheet. Instead it's about, you know, trade-offs. Hey everybody, thanks so much for watching. Let me know in the comments, are the trade-offs on the Surface Book 3 interesting to you or do you want something more traditional? Also if you missed it, I reviewed the Surface Go 2, an entirely different set of trade-offs and you can click and watch that somewhere, here.",
    "transcript_keywords": [
        "Surface Book",
        "Surface",
        "Book",
        "laptop",
        "bit",
        "thing",
        "GPU",
        "inch",
        "big",
        "tablet",
        "Surface laptop",
        "Intel",
        "Microsoft updated",
        "tradeoffs",
        "Microsoft",
        "screen",
        "Core",
        "traditional gaming laptop",
        "power",
        "version"
    ],
    "transcript_entity_values": [
        "Surface",
        "Iris plus Graphics",
        "Dell",
        "one",
        "third",
        "The Surface Book 3",
        "Cinebench",
        "GPU",
        "three",
        "Geekbench",
        "13 inch",
        "the Intel Core",
        "15 inch",
        "10th",
        "Monica Chen",
        "1600 bucks",
        "16 inch",
        "Razer",
        "2",
        "2500",
        "Nvidia GPU",
        "2020",
        "512",
        "CPU",
        "Eight",
        "3",
        "15",
        "13.5 inches",
        "the Surface Book 3",
        "two",
        "13.5 inch",
        "256",
        "15 watt",
        "Tom Warren",
        "Core",
        "32",
        "second",
        "GTX 1650",
        "Macbook Pro",
        "Microsoft",
        "first",
        "Ultrabook",
        "Nvidia",
        "45 watt",
        "Intel",
        "RAM",
        "XPS"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT"
    ]
}