{
    "id": "ZhWNlhLLjy8",
    "title": "I got a glimpse into the future of mobility with BMW at CES 2020!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-01-07T15:37:11Z",
    "video_url": "https://www.youtube.com/watch?v=ZhWNlhLLjy8",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "CES",
        "ces 2020",
        "bmw",
        "BMW i interaction ease",
        "#bmw #bmwi #changeyourperception #bmwpartner"
    ],
    "views": 477364,
    "likes": 13867,
    "comments_count": 802,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey it's Justine and I am here at CES 2020 with BMW and today we are gonna be finding out just what 'CHANGE YOUR PERCEPTION' means one of the things that I'm so interested in is car tech the future of cars is so amazing and we are gonna see what BMW has here at CES this year. (upbeat music) This crazy entryway is where BMW is gonna be doing a top secret reveal later on and I'm going to be one of the first people to get a chance to see what it is which means, you guys, if you are watching this you are gonna be the second people to get a chance to see what it is. I guess let's just wait until the event's already in and I will get to show you. Behind me is the BMW i3 Urban Suite, this is a concept car and we are gonna get a chance to check this out it's street-legal, it's awesome, let's hope in. The interior in this thing is the first thing that you are gonna notice it is modeled after boutique hotels I mean it really does look, like a mini hotel in wheels. Everything about this car was made with sustainability in mind this leather, was tanned with olive tree extracts this oak, is certified sustainable even the carpet, is made of 100% renewable materials. This car was 100% assembled using wind power and the carbon fiber was manufactured using hydropower. Now let's get into some more of these little comfy features this really does feel like a hotel and, no hotel is complete without a TV this is connected to Amazon you use this little remote right here I can watch TV, I can watch Amazon shows I can shop, I can watch Netflix, I can watch You tube this is, amazing and to go with the TV, down here with the car's iOS we have this special port that will allow you to mirror you phone. We also have a USB-C and a USB-A and of course a nice power adapters I would get so much editing done if this was my daily commute in Los Angeles traffic you've got the plug to plug things in and this is also equipped with internet I'd be uploading YouTube videos on the go okay bye-bye TV we've got some more things to show them. When I first got in this car this is something that caught my eye this is a little lamp, it is touch sensitive so I can turn this on and off and in the ambience, this is just, so futuristic it's such a simple detail, but something about the aesthetic is just so comforting and warm and I feel like, I could see myself living here you can definitely tell by the attention to detail is this isn't something that they wanted to feel like you're in a car it's more of a luxury ride experience there's even a place to hang up your coat there is a coat hanger on the back of this chair nothing to see here, just my footrest. I mean how many cars do you know have a footrest that can be controlled by these buttons right here this is so cool. (laughs) And of course, I'm sure many of you guys were wondering this because it's one of the first things that I was wondering where do you put the seat belt at it's like a normal seat, safety first. There's something else I need to show you there are heated and cooling cup holders so I've got my lovely iced coffee right here currently cooling and if Tyler up there who's filming he might have a hot coffee, he can put his right there this is a small detail, but I'm a huge fan. One of things that I love so much about this is yes it is a concept, there are a bunch of these right now currently on the road it is a completely street-legal vehicle there's 20 of them right now going around CES and there's an app that people can download and they can call one of the cars and if there happens to be one in the area they can pick them up, they can decide what they want the temperature of the car to be what kind of drink they would like to have ready for them in the car and then it picks them up and it takes them to their destination. Even though this is a concept we already have ridesharing cars so, why not take that ride-sharing experience and elevate it and make people more comfortable. I'm sure many of you guys have had some ride-sharing experiences that are, maybe not the best but could you imagine, if you called a car and this is what showed up there's even a personal speaker in the headrest so when I'm watching my movie only I'm really able to hear it, not the driver speaking of drivers there's actually an autonomous version of this where there's no driver at all so, let's go check that out. Oh, my drink oh, my phone (upbeat music) oh my goodness, oh hold on, I need to adjust my footrest so right now we are doing an autonomous drive here this thing is so amazing like this is gonna change the game especially for people who have long commutes I could be editing an entire video by the time I would get to Burbank, from the Westside amazing, so how do I make it go - [Speaker] we will do it for you - Okay (laughs) We're about to take a ride in the BMW i3 Urban Suite and this is, it's driving itself oh my gosh, I didn't get to finish my Instagram story no one is driving this car right now this is so awesome we're going through obstacles and the car is driving itself. Is there anybody in the driver's seat, negative it's so crazy 'cause this is the future like we're gonna be, not having drivers in the cars it's going to be driven, by a machine. These are my feet, they are lounging 'CHANGE YOUR PERCEPTION' that is what I'm doing. wow! That was amazing. - Did you like it? - oh my gosh, yes I need one of these. I had so much fun checking out BMW's i3 Urban Suite right now we're gonna wait for the event to set up and we'll head back here tonight to see what it is the BMW is gonna be revealing for all of us to see here at CES. (upbeat music) We're back here where the press conference is happening and we're gonna get a chance to see what they're releasing to the public before anybody else so let's go see if we can sneak around the back and get in. (dramatic music) (dramatic music) Oh, Wow! let's go check this out so this is the BMW i Interaction EASE and I'm not really sure what to expect so I'm just gonna get in, see what happens. We need to find out more about what this is immediately where's Paul? Paul - What you have behind you is our BMW i Interaction EASE what this is, is our vision of the future of autonomous mobility looking far out, understanding when autonomous mobility is more commonplace, how do you actually interact and understand, and enjoy that environment. (upbeat music) (upbeat music) - What this is, is a concept of what it would be like in the future when there's no steering wheels what are you gonna do with all of that free time when you're sitting in traffic BMW potentially has the answer to that we're gonna do three key demos here we're gonna explore, entertain and ease let's go check this thing out, oh it's so awesome looking. (upbeat music) They even have a cup holder this is very important, where will I put my coffee no way what is happening so there's like a ton of LED lights it's nice - [Car Robot] Hi Justine welcome to the future of mobility - Did it just say my name - [Car Robot] when you are ready to begin our journey, tap here. - So I tap on this seat, this is so cool okay it's reacting right now to my gaze so I'm gonna check this out we're gonna go to the Aurora theater, upcoming event - [Car Robot] You will be in town for the next concert, if you would like to go. - Ironically I actually, will be in town on January 11th so, I would like to go. - [Car Robot] There is still some time left until your arrival would you like to watch the video you started? - Well, yes of course I would - [Car Robot] To adjust the volume simply wave your hand left or right. - I'm adjusting the volume, with gestures so being able to control this, I'm using my gaze I'm using gestures, I'm using touch these are buttons that I can interact with the screen. - [Car Robot] You can spend the rest of the trip relaxing should I make the space more comfortable for you? - Yes, I am relaxing now no way - [Car Robot] If you tap again I will put the seat up right. - What if I wanna stay here forever fine (button clicking) Like this whole entire experience is just that it's an experience. - [Car Robot] I hope you enjoyed the experience traveling with us we will see you soon. - I don't wanna leave I'm so excited about the future of mobility and what BMW is doing, to push this movement forward I'm so here for it but, I have to go right now because now, the rest of the world gets to experience this. (upbeat music) (upbeat music) (upbeat music)",
    "transcript_keywords": [
        "BMW",
        "car",
        "Urban Suite",
        "cars",
        "car tech",
        "things",
        "experience",
        "CES",
        "future",
        "thing",
        "chance",
        "amazing",
        "people",
        "check",
        "watch",
        "seat",
        "watch Amazon shows",
        "Interaction EASE",
        "concept car",
        "tech the future"
    ],
    "transcript_entity_values": [
        "Paul",
        "second",
        "one",
        "Amazon",
        "Aurora",
        "Justine",
        "tonight",
        "Burbank",
        "CES",
        "i3 Urban Suite",
        "January 11th",
        "Instagram",
        "100%",
        "20",
        "2020",
        "three",
        "YouTube",
        "Los Angeles",
        "Netflix",
        "Westside",
        "daily",
        "today",
        "this year",
        "BMW",
        "Tyler",
        "first",
        "One"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL"
    ]
}