{
    "id": "ZifujZQqQMo",
    "title": "Apple Vision Pro first look",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-06-05T23:33:52Z",
    "video_url": "https://www.youtube.com/watch?v=ZifujZQqQMo",
    "category": "Science & Technology",
    "tags": [
        "apple vision pro",
        "apple headset",
        "apple vr headset",
        "apple vr",
        "apple ar",
        "apple virtual reality",
        "apple ar headset",
        "apple",
        "apple vr 2023",
        "apple mixed reality headset",
        "apple headset 2023",
        "apple vr price",
        "wwdc 2023",
        "apple vr release date",
        "apple glass",
        "vr headset",
        "apple meta",
        "vr",
        "apple leaks",
        "apple vr headset release date",
        "the verge",
        "first look",
        "wwdc",
        "wwdc announcement"
    ],
    "views": 1033307,
    "likes": 15288,
    "comments_count": 1602,
    "description": "We got a first look at Apples new Vision Pro headset at WWDC. It features a separate battery pack and is controlled with eyes, hands, and voice. It will start at $3,499 and launch early next year in the US. #apple #wwdc23 #technology   Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://trib.al/nhbaDv2",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "(contemplative ambient music) - Apple just announced its long-rumored spatial reality headset. It's called the Vision Pro. It costs a whopping $3,500. We haven't gotten to try it yet, but we have gotten to see it here at the Steve Jobs Theater at Apple Park, its headquarters in Cupertino. This is by far the best looking headset in this category. Apple's calling it spatial reality, but really, it's mixed reality. It blends augmented reality, which is showing the world around you with virtual objects, with full virtual reality. So think having a giant TV floating in front of you. The really distinct thing about this device though is this front-facing display and what it can do is show your eyes as you're wearing the headsets so that other people around you can see where you're looking in real space. This frankly has some creepy Black Mirror vibes to me initially, but it remains to be seen how it's going to be more broadly accepted as this device rolls out. Apple isn't shipping this thing yet until the beginning of next year, 2024, only in the US to start. So it's a long time before you're gonna see this in the wild. Apple is really positioning this as a general computing device similar to the MacBook or the iPhone. They want you to think of it for FaceTime, entertainment, gaming, productivity, even mental wellbeing. And really, all this is gonna be up to third party app developers to eventually make experiences for this headset, which is why Apple announced it today at WWDC, its developer conference. So developers are gonna get some time with this to experiment. And then starting early next year, you're gonna start to see the things shipping out. The headset is powered by this detachable battery pack that attaches with a cord and a magnet to the actual headset. It powers it for up to two hours on a single charge, which isn't a lot, especially at that price point. It's really showing how new this technology is. Apple has packed a lot of new sensors, optics, display tech, and hardware in this thing. There are a bunch of cameras that can scan your face and your eyes to recognize that it's you. When you initially put it on, it scans your face so that it can then show an accurate 3D representation of you in FaceTime calls while you're wearing it. So Apple's also envisioning this for collaboration, for working together, but across the world potentially. And that's been the real promise of this category for a long time is that companies like Meta have been saying we see these headsets as a way to feel more present with people even when they're far away or not near you in the same room. Apple is characteristically a little late to this market. It's really been Facebook a la meta out there for a long time with its Quest headset. It just announced the Quest 3 recently to preempt this Apple Vision Pro announcement. But Apple's coming in at the high end. They're pricing this thing super expensive, way more than the Quest 3 coming out later this year at around $500. Apple talked multiple times about people wearing this thing on airplanes, so I guess in the future, you may see people in your rows next to you with their eyes peeking through this display watching a movie or Ted Lasso or something like that. Remains to be seen. That's gonna be an interesting social evolution, one could say, for a product like this. But Apple sees this for entertainment as well as productivity. And for people with glasses, Apple has developed this proprietary prescription lens system that clips on the inside of the headset. I haven't gotten to try it yet, but it's the only way you can use the headset with your prescription because it's so snug on your face that you can't wear it with glasses, which is also something different from how Meta and all the other headsets have worked today. You know, Apple is Apple. They know how to design beautiful hardware. And for a headset, this is by far the best looking one I've seen. I'm not surprised that it costs this much money. It has all these really fancy materials behind it and technology. That said, it remains to be seen whether something that looks good and costs this much is something people are actually gonna wanna buy in the year 2024 when it actually ships, especially when Meta is coming in with the Quest 3 later this year at just $500. It's interesting to see Apple come in at the high end. They do this traditionally in technology. They did it with the iPhone, they did it with the original Mac, they did it with the iPad, and eventually they bring the cost down. And Apple is already working on a cheaper version of this Vision headset for an undetermined date. So eventually, they're gonna be competing on price. But for right now, this is a device for the early adopter crowd that doesn't mind its spend. Thanks for watching. We've got plenty more on Apple's Vision Pro on The Verge's website and all of our social channels. - [Vjeran] Very good, very good. (laughing) Love it. - Okay. - [Vjeran] Oh, no, audio wasn't rolling. I'm kidding, I'm kidding.",
    "transcript_keywords": [
        "Apple",
        "Apple Vision Pro",
        "headset",
        "Steve Jobs Theater",
        "Apple Vision",
        "Vision Pro",
        "longrumored spatial reality",
        "reality",
        "Quest",
        "Vision",
        "Apple Park",
        "people",
        "thing",
        "Meta",
        "year",
        "Steve Jobs",
        "Jobs Theater",
        "Pro",
        "time",
        "device"
    ],
    "transcript_entity_values": [
        "third",
        "Apple",
        "WWDC",
        "Cupertino",
        "Quest",
        "Quest 3",
        "Love",
        "Vision Pro on The Verge's",
        "today",
        "FaceTime",
        "up to two hours",
        "the year 2024",
        "US",
        "Black Mirror",
        "iPad",
        "3,500",
        "the beginning of next year",
        "the Steve Jobs Theater",
        "around $500",
        "Meta",
        "the Vision Pro",
        "2024",
        "Quest 3 later this year",
        "Ted Lasso",
        "early next year",
        "Apple Park",
        "Facebook",
        "MacBook",
        "later this year",
        "Vision",
        "iPhone",
        "Mac",
        "just $500"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "DATE",
        "GPE",
        "WORK_OF_ART",
        "LAW",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "FAC",
        "MONEY",
        "ORG",
        "PRODUCT",
        "DATE",
        "LAW",
        "PERSON",
        "DATE",
        "FAC",
        "ORG",
        "FAC",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY"
    ]
}