{
    "id": "zIj2tK2lJOI",
    "title": "Tech We Wish Would Come Back",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-07-06T18:08:08Z",
    "video_url": "https://www.youtube.com/watch?v=zIj2tK2lJOI",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 145499,
    "likes": 5521,
    "comments_count": 390,
    "description": "Forget the latest iPhone or PS5 Pro, here is the tech that we wish could make a comeback The WEIRDEST Custom Keyboards:  Ranking the WORST Controllers of All Time:  Shark Tank Scams Tested!  I got SCAMMED on Instagram:  The Smallest Xbox Yet:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Hello and Welcome 0:10 Nintendo Power Glove 1:21 Turbo Controllers 2:16 Phones With Keyboards 3:12 CRT Displays 3:54 MySpace 4:47 LimeWire 5:42 Mechanical Mice 6:26 RSS Feeds 7:24 Adobe Flash 8:33 Roman Concrete 9:28 IR Blasters on Phones 10:11 GameCube Handle 11:05 Phone Charms 11:36 What do you think??",
    "description_links": [
        "https://youtu.be/hzX6AOx0Pk8",
        "https://youtu.be/xJBcNbS-uTM",
        "https://youtu.be/w1-NoqAL5fE",
        "https://youtu.be/5dd1GmKPsIw",
        "https://youtu.be/iw4gjl2aako",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- There's a bug on the table. There's literally a bug crawling on the table, right beside you. I am not a merciful god. - Hello, welcome- - Whoa! - I have stolen the intro and today we're gonna be taking a look at some tech that we should bring back. Starting with- - [Matt] The Nintendo Power Glove. So this came out in 1989, the year I was born. When's the last time they made a game controller, that was this cool. It's starred in its own movie. The Wizard - We're headed for the video championship, - This guy - What is that? - Power Glove - But it's 2022. We have the technology. We can make this better. We can make it work so much better. - This is actually like kind of what VR controllers need to be today to give you that full hand presence. You need the individual fingers and the power glove gave you the individual middle finger. - We have to have the finger blasting power. - Okay, Let's not say- - Nintendo Power Glove. - That's actually not the phrase that you should use on that one, in fact. - This is one of the best products ever. And I love that- - No, it's not Matt. You can't say that with a straight face. Straighten your face, straighten your face. Fully straighten it. Straighten it. - This is the best product that's- (Matt laughs) - You can't do it. He couldn't do it. The Power Glove is lame and stupid. Nintendo has been doing weird stuff forever, but this was about two decades ahead of its time. You know what was not two decades ahead of its time, Matt? You know what was timeless? - Literally everything on this list is two decades ahead of its time. That's the whole premise of the list. - This is five decades ahead of its time. Our next item is Turbo Controllers. Yeah, baby, we're going there. Have you ever found yourself furiously mashing the B button in hopes that you will be able to capture that Mewtwo in the pokeball? Well, guess what? With turbo time you'll know exactly what to do. Turbo was a button which is still available in some controllers, but it's, it's kind of lost. It's been out of favor. They'll allow you to rapidly spam a button, hundreds of times per minute, with little to no effort from you. - Some of you youngsters who watch our channel, never grew up having to have this number two controller, the B controller, - The Mad Catz - The little brother Mad Catz controller. Some of you never had to experience that and it shows - I think it's time for Turbo to come back, 'cause you know what? I don't want to be using my fingers all the time. I might be needing to do things with my Power Glove. - Sounds like you were saying, you need the Power Glove, which is better than the Turbo Controller. - Well, I- - Point to Matt (bell rings) What actually needs to come back is our next product. Phones with keyboards and physical buttons. You know? No, no. Ready? Straight face time, straight face time - Straight face it up. - This is the hill I will die on. - Sorry Matt. I'm getting a call on my non-touch screen, physical- Oh yes. Oh hello? Oh yes. Is this 2022 calling? Matt's wrong? What else is new? - It's more accessible. - What? People should subscribe to This Is and ringling the dingling button. That seems like a great idea. - With a T9 controller, I could just be like under the table just like- - What? You can't do that with a touchscreen? - No, I can't because I can't feel where I'm going, 'cause there's not enough haptic feedback. Having the little nubbin to keep you centered on the T9. - The nubbin? Yeah. I don't know what it's called. It's a little nubbin. Mobile gaming on phones would be so much better. - Yeah. You know what's not better, when your screen is two inches tall because the keyboard takes up their screen. - They foop. - They foop? - They foop - The swipe- - You walk around with cargo shorts? where you gonna keep that big phone, Matt? - In my cargo shorts - You know what we really need to bring back, the actual piece of tech that will revolutionize the world, CRT displays. - [Matt] That's not fair. - [Austin] Friends, first of all, CRTs, aren't this nonsense digital technology, that needs like frames of latency or something. No, it's instant because it uses electrons and positrons and - What are you gonna say, the all spark? - Cathode-Ray Tubes CRTs had a bunch of advantages. Not only were retro games really designed for CRTs. They weren't crystal clear. They weren't perfect. There was a little bit of nuance to those pixels Color accuracy was great, especially in something like the Trinitron CRTs are great. - They weighed more than me. - No comment. - You had a 700 pound monitor for a 12 inch screen, but you know what actually actually was so cool, that needs to come back is MySpace. All right. MySpace is the one true social media. - You think Elon's about to drop $50 billion on MySpace? You could buy MySpace for $11 and a half eaten turkey sandwich and it would still be too expensive. - Look, look, look, MySpace taught an entire generation how to HTML. Facebook and Twitter have just rottened our minds and just poisoned the well - Taught people other things- - Tom never had to sit in front of Congress and answer questions about why he's spreading misinformation about how 5G turns frogs, I don't know,- (Austin laughs) - I was not gonna say that but all you true super fans out there. I am currently taking applications for my top eight. Tom had it, right He sold the company. - He got out before- - Got out - He became the villain. - He's retired ever since, - You know what was more popular than MySpace, Matt? - Nothing. - No, no, no, no Lime Wire. - [Matt] Oh, here we go. - [Austin] Yeah, friends we're going there. Now, of course, I would never condone downloading illegal activities because that's illegal and I can't say that, but theoretically, cast yourself back to the mid 2000s. Windows XP was around. Imagine Spotify, except that it's the Russian roulette version. Sometimes you get that sweet download of the black album. Sometimes you get George W. Bush saying mission accomplished or Bill Clinton tells you that he did not- - My fellow Americans, I do not have sexual intercourse with that girl, However, I did get great deals over at whatever- Like that was- You'd wait like three days to download one song and it'd just be that. - You never know what you'd get. If this wasn't some scummy NFT today and the actual scummy download service that it used to be, we'd all be better off for it - 'Cause that was better - [Matt] Moving on to what wasn't better. I messed that up, but it turned out to be true. - [Austin] Please argue this one, Matt. - [Matt] Mechanical mice. - I just like the idea of mechanical mice sounds so weird. Most people don't even know what this is. - The really, the only beneficial thing to having a track, like an actual track ball mouse, - You could do it. You just do it like on your leg, anywhere, anywhere. - What was great about mechanical mice, they had heft. You could smack it down, send that AOL chat, and people will be like, Wow, Matt means business today. - I didn't have like actual AOL because for a while my only internet was from Kmart. If you bought enough groceries from Kmart, they gave you internet discs and it was blue light. And for like years, that's how I got the internet. - I stand corrected. You know what I'm not standing corrected on though. RSS feeds. Yeah, friends. Yeah. Think it's gone. Think again, RSS never left us. Now, Really Simple Syndication, as it was known, was Twitter before Twitter was cool or ruined. Essentially, this allowed websites to give you a syndicated feed of all their different articles and news, and blah, blah, blah. Instead of having to go to gizmoto.com and ingadget.com and kotaku.com and all the other sites that are probably dead at this point. Instead, no, you could just open up your RSS feed. It would give you in a neat and orderly fashion, all the articles about Half-Life 2 and Battlefield 7 that you could ever hope for. Well, you know, what's great Matt, is that while algorithms may dominate the day, RSS feeds actually don't need to come back 'cause they're still here. You know that every podcast player, pretty much, on the internet is sort of like, something like Spotify, still uses RSS. - Is this a disingenuous one? - It's not really] It was never gone. - Then why do we wish it would come back? Kinsey, can we please get the list to be accurate next time? Here's what does actually need to come back? Adobe Flash. (Austin laughs) Yeah. Yeah. Know what, No. Adobe flash needs to come back because so much of the internet has been lost. Adobe Flash stood, so you could run now on YouTube. You wouldn't be here- - YouTube did start off Flash - If it wasn't for Adobe Flash and bring what showed like what could be fun on the internet. - Back in the early days of the iPhone and the iPad, It was a huge talking point that did not support Flash. Which obviously in hindsight- - I couldn't play Blooms on my iPhone 4. So that's why I went to Android for a while. - Steve Jobs personally killed Adobe Flash, but here's the problem with Flash- - Flying volleyball. - It was horribly unsafe and insecure. Like flash was built- - Kitten Cannon - On tape, duct tape, spit- - Learn to Fly - Glue, more tape, and then- - Heli Attack 3 - And then a layer of wallpaper on top and it fell apart all the time. - It did. - What people made with flash was amazing. - Flash animations, flash games, flash video. It was a very cool thing. But again, the layers of nonsense, eventually collapsed. And I'm glad it's gone. HTML5 is just, does everything better Matt avert your eyes. The Flash is gone, because next item is even better. It is Roman concrete. - [Matt] What? - [Austin] Roman concrete was a lost to the ages art form. The Romans knew their sh- Look how many Roman buildings are still around. There might be a recipe to make it, but no one knows how it was mixed. And it is legitimately impressive that 2000 year old plus concrete still exists, especially stuff in the sea, right? The fact that you built something in the sea and 2000 years of (wave sounds), hasn't gotten rid of it, Matt, that's pretty impressive. Roman concrete was the OG concrete. - I'm gonna tell you why that's the dumbest thing that you've ever said. Pull out your phone real quick. - My concrete phone? - Pull out your other phone real quick. What do you got on your wrist there? That has cellular doesn't it? Imagine we're in all these buildings of Roman concrete. We wouldn't get a damn wifi signal out there. You wouldn't be able to go and watch all your episodes of This Is and make sure you like and subscribe for these. (Matt laughs) You're just dumb on that one. You know it wasn't dumb, IR blasters on phones. - That is quite the transition. - Yeah, because these things were great. Oh no! Where's the remote control? I don't know. Doesn't matter. Click. - Matt, I'm actually gonna completely agree with you on this one. I was a absolute menace. I had my HDC1 and it also had the IR Blaster. I would be in like bars or hotels- - You're chaotic evil- - Or whatever, and just changing the channel to like Blues Clues or something. And I thought it was hilarious. - You're a gremlin - Look IR Blasters were great. And the fact that they're gone is really sad. These were very popular in like the early 2010s, right? So Samsung had it for a few years. - [Matt] LG had it for a while. - [Austin] A lot of companies put this on 'cause it was tiny. - It was just useful to have. Why get rid of it, bring it back. - You know what they will bring back, Matt. - No, they won't. - They will 100% bring back the Nintendo GameCube handle. Not the GameCube. Nah, that's gone. But the handle itself. Will this look a little weird on the Switch when you glue a handle? I think so, but you know what? Nintendo nailed the GameCube. This was a portable powerful console. Let's not forget, the GameCube was, I think, more powerful than the PS2. It had the portability, it had the GameCube, the Game Boy Player on the bottom. If you were so rad as you wanna play Game Boy games on your TV. Imagine the Purple Fury- - It did come in purple, which was great - It could unleash on the world. If every PS5 had a handle. If I had a GameCube handle in my hand right now I could beat someone to death with it. And that's not something you can say about, I don't know, like, an Xbox series S or something. - I think I could yeet a series S at you and do more damage than you- - But I have the handle, I have the precision. - Ah, right. - It's not a blunt instrument. It's a weapon of tactical capability. - You know what wasn't a weapon. - Fine. Yeah, yeah, yeah. What's better than GameCube? - Yeah. What's an actually good product. - Go for it. - [Matt] Attachment loops on phones. - [Austin] A lanyard strap, Matt? - If you're like me and have been to space, I really wish I did have a lanyard strap on my phone when it was floating around and hitting me in the face while we were floating in zero gravity. There was so many little charms you could get for your phone. An entire industry suffered on this. You know who it is? - Who? - All the mall kiosk - Mall kiosk - All of those people went starving. They- - On borrowed time as soon as the 3310 lost its face plates. Well, you know, what's even better than attachment loops on phones. Do you know what's better than- - Can it beat Jesus - Every single item on this list. It is the end of this video. - Nothing. Attachment- - Thank you very much for watching Make sure to subscribe to the channel, so that you never miss another spicy upload like this. And until next time friends, I'm gonna think about what needs to go away, which is most of the internet at this point. Badger, badger, badger, badger mushroom, mushroom, badger, badger, badger, badger, snake, snake. Oh, it's a snake. (upbeat music)",
    "transcript_keywords": [
        "Power Glove",
        "Nintendo Power Glove",
        "Matt",
        "Flash",
        "Yeah",
        "time",
        "back",
        "Adobe Flash",
        "Power",
        "Glove",
        "Nintendo Power",
        "great",
        "face",
        "Straight face time",
        "bring back",
        "Badger",
        "controller",
        "Roman concrete",
        "power glove gave",
        "straight face"
    ],
    "transcript_entity_values": [
        "Game Boy",
        "zero",
        "1989",
        "Android",
        "about two decades ahead",
        "the day",
        "GameCube",
        "OG",
        "NFT",
        "5",
        "a few years",
        "Mad Catz",
        "Romans",
        "MySpace",
        "Steve Jobs",
        "Turbo",
        "Nintendo",
        "five decades",
        "the Power Glove",
        "YouTube",
        "George W. Bush",
        "XP",
        "Blues",
        "hundreds",
        "CRT",
        "Twitter",
        "Tom",
        "Nintendo",
        "Matt",
        "two inches",
        "Kmart",
        "iPad",
        "Austin",
        "Bill Clinton",
        "Samsung",
        "RSS",
        "The Power Glove",
        "Xbox",
        "Roman",
        "first",
        "about Half-Life 2 and Battlefield 7",
        "Power Glove",
        "Mewtwo",
        "Elon",
        "PS5",
        "Turbo Controllers",
        "Badger",
        "Americans",
        "Kinsey",
        "Blooms on my iPhone 4",
        "LG",
        "IR",
        "VR",
        "the early days",
        "100%",
        "Congress",
        "Adobe",
        "$50 billion",
        "Facebook",
        "2000 year old",
        "Russian",
        "Adobe Flash",
        "the Turbo Controller",
        "the IR Blaster",
        "the early 2010s",
        "the year",
        "HTML5",
        "one",
        "two decades",
        "Switch",
        "Trinitron",
        "The Mad Catz - The",
        "MySpace",
        "3310",
        "S at you and",
        "today",
        "AOL",
        "Spotify",
        "eight",
        "3",
        "two",
        "700 pound",
        "11",
        "the mid 2000s",
        "iPhone",
        "12 inch",
        "2022"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "NORP",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "NORP",
        "ORDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "NORP",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "NORP",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "GPE",
        "PRODUCT",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE"
    ]
}