{
    "id": "ZiksU8Afr-4",
    "title": "What makes the Note 7 Waterproof? Ultimate Test!!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-08-22T06:36:11Z",
    "video_url": "https://www.youtube.com/watch?v=ZiksU8Afr-4",
    "category": "Howto & Style",
    "tags": [
        "Note 7",
        "Galaxy Note 7",
        "Samsung Note 7",
        "WaterProof Note 7",
        "Note 7 water damage",
        "What makes the Note 7 waterproof",
        "water proof",
        "Water resistant",
        "IP68 Note 7",
        "Ingress Protection",
        "can the note 7 get wet?"
    ],
    "views": 1070590,
    "likes": 19063,
    "comments_count": 1293,
    "description": "Samsung Galaxy Note 7 just recently was released.  The phone claims to be IP68 Water Resistant. What does that mean? Is the phone Water Proof? Can I swim or shower with my cell phone? This video will explain how the Note 7 received its water resistant rating. And what you can realistically expect from your cell phone.   What do you think? Do you think its safe to call the Galaxy Note 7 Water Proof? or is it better to play it safe? Let me know in the comments.   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/1R7Ltic",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "So what makes the New Galaxy Note 7 water proof? I have a fully stripped Note 7 in front of me. So lets see how it is sealed. Note 7 has an IP rating of 68, which means that it is totally protected against dust, And continues submersion in water. Samsung says As long as its less than 5 feet deep and in the water for less than 30 minutes, you should be golden. Remember that Samsung has never said that the phone is WaterPROOF, just that it is water Resistant. The terminology and distinction between the two terms is very important. If your phone gets wet, and breaks, the standard warranty will not get you a new phone. In the itty bitty print of your warranty booklet included with your phone that nobody ever reads, is this little tidbit: Your warranty does not extend to defects or damages to your device including exposure to liquid. Cracked screens, or physically broken charging ports. So, if your phone gets wet, dropped, or plugged in wrong, you are out of luck, unless you purchased additional insurance on top of your standard warranty. So now that we know the basics, lets see how this phone is water resistant, and how Samsung will be able to tell that your phone has ever been wet or not. Lets start at the bottom of the phone. There are a few entry points for water down here, including the headphone jack, the charging port, and the loud speaker, and a new one, the S-Pen Slot. The charging port and head phone jack sit down here at the bottom of the phone held tightly in place against the frame by 3 little screws. If these little screws are removed and we look at the headphone jack itself, we can see that the opening is surrounded by a little rubber lip. The pressure from the screw holding it in place will keep water out, as long as the phone is less than 5 feet deep of water. Any deeper and the water pressure will be too great, and liquid might seep inside the phone. The back of the headphone jack is sealed as well. Water WILL be able to get inside of the jack, but wont be able to transfer into the rest of the phone. The USB C charging port is the same way. It has the two screws holding it tightly into place, and then has a thick rubber ring around the port itself. So as long as you arent in water over 5 feet deep, water shouldn't be able to push itself inside. The deeper you are in water, the more pressure there is, and the more risk. The microphone is off to the side of charging port. And rests up against a white rubber seal, and a little water resistant screen. This has plenty of adhesive holding it against the microphone hole in the frame. Lets take a look at the bigger screen next to it that is used to keep water out of the loud speaker. As we know, speakers need air to function, BUT there cant be an airtight, watertight, compartment for the speaker, or else we wouldn't be able to hear it. So this screen allows air to pass through, but will not let water through. The water would rather stick to itself through cohesion than to get cheese grated through the screen and into the speaker. But you guessed it, this only works at low water pressure. If there is a jet of water, or you are deeper than 5 feet of water... the liquid can still get inside of your phone. Looking at the loud speaker itself, here is the little hole that rests up against the screen and the metal compartment is where the speaker itself sits. Now how in the world would Samsung be able to tell if your phone has ever been wet? You would be surprised at the amount of people who try and dry off their dead water damaged phone and try and say that it died of natural causes. But this little sticker doesn't allow lies. The stickers are placed at the weakest points on the phone. Ill show you where the second sticker is in a second. But this one sits right between the charging port and the speaker mesh. So if this sticker gets wet, the little red x's bleed out. Notifying anyone who opens up the phone that you sit on a thrown of wet lies. So what about the S-Pen compartment? That has a huge hole at the bottom of the phone that water can enter. It looks like Samsung took that compartment and sealed it up entirely. So water can surround your S-Pen, but it will not actually get inside the important part of your phone. The same adhesive holding the screen into place holds the plastic lid on the s-pen compartment. So what about the other side of the phone. If we follow this extremely thick and sturdy aluminum frame up the side, we can find the volume buttons. Another access point for water that needs protection. If we pop out the guts of the button mechanism we can see that it comes in 3 parts. The first of which is the actual button itself that comes in from outside of the phone. The second component is the rubber bit that the button presses into. The little curved hook at the end of the metal keep the rubber pressed against the frame for the water tight seal. Then the third and last part of the button contraption is the electronic part that plugs into the motherboard. This is the part that needs to stay dry. So the exterior button presses into the rubber seal, which press into the electronic switch. Maintaining the water resistance. Thumbs up for this clever piece of Samsung ingenuity. Now lets check out the top of the phone. The two biggest holes we immediately see are the sim card trey, and the top microphone. The top microphone is using the same type of screen that we saw at the bottom microphone to protect against water. Now the sim card trey has a thick rubber seal around the top edge to help keep water out. Even the sim card extraction pin has the same rubber ring. Now, remember how I sad Samsung puts those water damage indicators at the weakest ingress points on the frame? There is another one right here below the sim card trey. And this one is actually visible from the outside of the phone. So the representative who looks at your phone wont even need to take it apart to see the indicator is tripped. This one does the exact same thing as the bottom indicator. If it gets wet, the x's will bleed out and go red. Indicating that it has touched liquid, sweat, steam, soda, bodily fluids, showers, toilets, oceans, lakes, bowels of cereal, or anywhere else that phones tends to end up. Now if we look at the screen iteslf, we can see two holes. The ear piece and the home button. Lets start with the ear piece. The little metal grill offers little to no protection for the speaker itself. Just the fact that it has little holes so the water isnt super inclined to penetrate. But if we look at the earpiece speaker we can see that there is a whole lot of adhesive holding it in place and that it has the same type of mesh that covers the front and back of the speaker. So as long as the water pressure isn't greater than 5 feet... it should keep liquids on the exterior instead of the interior, which is where we want them. The home button is pretty simple. The plastic under and around it is pretty sealed, so just a little extra adhesive around the button and around the edge of the glass is sufficient to keep the water out. The front glass and the back glass have a ton of adhesive around the edges, which also helps keeps the water out. If you watch my Note 7 teardown video you'll know how hard is to get inside of this thing. Its very well sealed by the screen and the back glass panel. Now that we've checked all the ingress points on the frame, lets check the most important part of the phone... the main board. The brain of your device. Now if you want to truly waterproof electronics, you can coat the PCB's or circuit boards with a hydrophobic spray. The problem with this hydrophobic spray is that it is very time consuming to apply, and it is pretty expensive. And would be very difficult for Samsung to do on a large scale with the massive volume of phones they produce. And as we can see from this water droplet on the motherboard... it is clinging to the circuits. Which means that it is not coated with any kind of waterproof sprays. So if water somehow gets inside of your phone, there is a very real chance of electronic failure. Electronics don't like water. And there is no internal protections. If any one of the entry points along the edge of the frame is compromised or fails due to a drop or crack in the glass or dent in the frame, water will be able to enter and potentially destroy your phone. I reviewed some waterproof headphones a few days ago, and this is what hydrophobic PCB looks like. The water droplets literally roll off, and don't cause damage because they cant cling and corrode or short anything out. In Summary: I definitely approve of 'water resistant' devices, the added layers of protection like water resistance help make the phones more durable and last longer. Water accidents DO happen and are fairly common. BUT you should only think of it more as just a layer of protection, and not an invincible fail-safe. So swim and shower with your phone at your own risk, the normal warranty will not protect you. I review the inside of every major cell phone, so if you have not yet subscribed, it is completely free and you can stay updated on all the latest devices. What do you think about the Note 7? Does the water resistant features validate the price? Behind the scenes and extra tidbits of information can always be found on my Instagram and twitter. Thanks a ton for watching! Hope to see ya around.",
    "transcript_keywords": [
        "water",
        "phone",
        "Galaxy Note",
        "water Resistant",
        "Samsung",
        "Note",
        "speaker",
        "water pressure",
        "screen",
        "button",
        "inside",
        "rubber",
        "frame",
        "charging port",
        "water resistant screen",
        "water damaged phone",
        "Galaxy",
        "wet",
        "water proof",
        "phones"
    ],
    "transcript_entity_values": [
        "the S-Pen",
        "5 feet",
        "Instagram",
        "two",
        "jack",
        "a ton",
        "bitty",
        "trey",
        "a few days ago",
        "over 5 feet",
        "68",
        "first",
        "second",
        "the S-Pen Slot",
        "PCB",
        "Samsung",
        "third",
        "less than 5 feet",
        "3",
        "less than 30 minutes",
        "7",
        "IP"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG"
    ]
}