{
    "id": "zioaiMofWQ0",
    "title": "Is Xtra-PC 2.0 a Scam? (Nope! But…) - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2022-04-28T15:59:18Z",
    "video_url": "https://www.youtube.com/watch?v=zioaiMofWQ0",
    "category": "Science & Technology",
    "tags": [
        "Is Xtra-PC 2.0 a Scam? (Nope! But…) - Krazy Ken's Tech Talk",
        "Linux",
        "Ubuntu",
        "Unix-like",
        "LXDE",
        "Linus Tech Tips",
        "Scam Tech",
        "Scam",
        "USB",
        "Flash Drive",
        "Apple",
        "Mac",
        "MacBook Pro",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer",
        "Tech",
        "Computer Clan",
        "Xtra-PC",
        "Scam Ad"
    ],
    "views": 463188,
    "likes": 14044,
    "comments_count": 1014,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below Xtra-PC claims to bring new life for old computers. And does it work? Actually, yes! I say it's not a scam. But there's more to the story  Watch more tech scam-busting episodes   Download our epic wallpapers   Support our channel and get cool stuff    Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1riKzQK3dHt6c9_6D2lVwr78",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- This flash drive claims it can transform outdated PCs and make them run like-new. Now, before anyone goes, \"Wow, that's amazing,\" or, \"Hey, that's BS,\" we need to dissect this because there's a lot more to unpack here. Sponsored by Linode. (techno music) Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken, and this is the Xtra-PC 2.0 USB flash drive. Many people have requested that I dive into this product, but also many people have informed me that other leading brands of tech channels have already covered this product. Here's the interesting thing though, this is a 2.0 product. The videos I saw earlier showed the original product, which looks different. The sales videos also look like they have been improved, so it appears we have some new juicy stuff to dive into. So, here's the deal. We're gonna take a look at the two sales videos. Then, we'll take a look at the Xtra-PC websites. And then of course, we're gonna test the product out for ourselves. So, if you're ready, let's go. Various Xtra-PC ads have been posted in the past, but there's currently two sales videos on their website; a whiteboard style video, and a live-action demo. The whiteboard sales video explains how the Xtra-PC works, mentioning that it runs off Linux, and you simply plug it into a USB port on your PC. And it also explains that you boot into the flash drive and bypass the operating system on your PC's internal drive. And it mentions the built-in applications, such as a web browser, Open Office, and media players, the basic stuff you'd see in practically any Linux distro. And the video says Xtra-PC works on nearly any 64 bit Windows PC or Mac. And that's it for the whiteboard video. Short and sweet, right? Now, let's take a look at the live action demo. This is Corey, and he's gonna talk to us about Xtra-PC. He says he has this old HP laptop and it's running really slow. And to demonstrate this, he opens a video file, and yes, it does take over a minute to open up. So, then Corey wants to boot into Xtra-PC to demonstrate how much faster it is. And he explains it runs off Linux, just like the whiteboard video. - What is Linux? Well, Windows is an operating system. Linux is an operating system. - I'd just like to interject for a moment. What you're referring to as \"Linux\" is in fact GNU/Linux, or as I've recently taken to calling it GNU plus Linux. Then, he boots off the USB drive and loads the desktop. He opens the video file and voila, it opens fast. And that's pretty much it. So, let's take these one at a time. What's wrong with the whiteboard video? Nothing really. I mean, the claims aren't crazy. Everything seems plausible. The only mistake I saw was the distro actually comes with LibreOffice, not OpenOffice, so minor mistake, no big deal, I guess. Now what about the live action demo? Sure, the editing and cross dissolves were a little awkward and some of the acting was maybe a little cheesy. - Here's my desktop! No way! - But the claims aren't false. I've booted off of USB flash drives many times, it's absolutely doable. The only other weird thing I noticed is their speed test timer actually starts before Corey double clicks the file. But I think that was just an honest editing mistake. Now I have a feeling some of you are screaming at me right now saying, \"Ken, why would anybody spend money \"for a Linux distro, which is typically free?\" Don't worry. I hear you. I'm gonna address that problem later. Let's not stop there. Let take a look at their websites. I've seen two websites for this product, though I'm sure there's more. Xtra-PC.com and getxtra-pc.io. The Xtra-PC.com website looks simple and clean, way less sketchy than other stuff I've investigated in the past. And if we scroll down a little, it shows the three versions of the product, starting at less than $35. Yeah, one cent less. Okay. We have the Turbo 16, Turbo 32, and Pro. Then out of curiosity, I clicked the about us section and learned that Xtra-PC is owned by Prairie IT, and that company owns another product called The Photo Stick. Everything seems okay. But before I purchased the product, I wanted to check out the other website. This website more specifically says Xtra-PC bypasses the existing operating system on your computer, which I think is important to mention, so it doesn't appear like the USB drive is magically fixing your current Windows or macOS installation. There's an important distinction there. When you scroll down, you see the three tiers again, this time with the prices; $34.99, $49.99, and $79.99 for the Pro, which they value at $159.99, which I think is overvalued in my opinion, but they're just really using that as a scarcity marketing tactic to try to make it seem like they're getting a discount when really that discount will likely never expire. It's a tactic used by practically every marketer. So, that brings us to the topic of pricing. Generally speaking, Linux distros are free. Anyone can download them from the internet. So, tech savvy people are probably wondering why the heck you would spend money on this. And if you're wondering that, congratulations, this product isn't for you. This product is for the less tech savvy individual like a grandparent, someone who just wants a convenient, easy, turnkey solution, and customers will pay for that. Everyone wants to pay for convenience in one way or another. If you've ever purchased a bottle of water, you know what I'm talking about. Why spend $2 on the bottle of water when you can drink the water practically for free from the tap in your house? Well, it just depends on whatever's convenient at the time. People pay for convenience. People pay for easy. That's just how life works. And the same thing applies here. People will pay for a turnkey solution like this if they really need it. And let's be honest, most end users do not know how to flash an ISO to a flash drive, let alone make it bootable. And that's okay. It's our job as tech enthusiasts to be patient with others and help them out. So with that aside, is the $159 value stupidly high? Yes, I would humbly say it is. Sure, you get free shipping and a bonus file recovery tool, and sometimes those can be a little bit expensive. But in the end you're not paying that price anyway because you're getting that discount, right? But pricing aside, is Xtra-PC really a good solution to fix a sluggish PC? Not really. And the main problem is it runs Linux. Don't get me wrong, Linux is awesome. It's everywhere. Everybody uses it whether they know it or not. But to a typical user who is used to Windows or maybe Mac OS, switching to a Linux environment may just be really confusing to them because it's not familiar. And if that user has programs that are only compatible on Windows or maybe macOS, using a Linux distro is just gonna complicate things further. Ultimately there are better, more long term solutions to fix a sluggish PC, and we'll discuss those soon. But first let's check out the product. Oh yeah, I went ahead and bought one. Just kidding. I bought two! The Turbo 16 and the Pro. So, let's take a look at these guys. We'll start with the Turbo 16. You can boot into the device from your computer's boot menu. And if you need assistance, there is a program on the flash drive which will guide you through the boot process, though you will need a working operating system to run this application. Then the desktop loads, and you're greeted with an installer for additional software like Flash Player. The layout is pretty simple with a panel, app menu, and a few desktop icons. Software wise, Xtra-PC is running Ubuntu 18.04.2 LTS with a Linux 4.18 kernel. Firefox is pre-installed for web browsing, and Thunderbird is the default mail client. Synaptic Package Manager is also present, so you can install more software if you'd like or you can use the good old fashioned internet. In addition, the Pro version comes with that file recovery tool we talked about earlier called FileRez. So, the product page mentions there's a speed and storage difference between the Turbo and the Pro. The Pro's startup time was 40.4 seconds versus 58.5 on the Turbo 16. And the shutdown time was 5.7 seconds versus 16 seconds. The Turbo 16 did have a couple of hanging issues with applications where they would just freeze up temporarily, but I rarely noticed that on the Pro, so I guess the pro really is faster or at least more responsive, which is generally perceived as faster. Storage wise, the Turbo 16 has about 6.5 gigabytes of free space on the startup volume, and the Pro has 15 free on the startup volume, but it has an additional 37 gigabytes free on a separate FAT 32 volume. A couple of oddities I noticed when dragging a window around, there is a little bit of window tearing sometimes. And for some reason I cannot change the screen resolution. On my 2013 MacBook Pro with a retina display, it's a really high resolution display, so everything's really small, right? And I couldn't find a way to scale the UI that was built into the settings. So, I thought, okay I just changed the resolution. Make it lower so everything appears bigger, right? But when I did that, everything glitched out and the system was useless. I tried it on a lower resolution monitor as well, and I couldn't change the resolution on that either. Very strange. Overall, pretty basic, right? I have no problems with how these things were advertised. The claims aren't false, at least in the two videos they had on their website. But like I was hinting at earlier, this is kind of a temporary bandaid fix. So, what are some more long-term solutions to fixing a slow PC? If the physical hard drive of the computer is still working and it's running slow, you may need to defrag the hard disc. I've had better luck using Auslogics defragging tool compared to the built in Windows tool. But your mileage may vary. I actually just used Auslogics on a friend's PC like a week ago, and it's running much faster. It worked great. But every techie is gonna have their own bag of tricks, right? And that's great. And sometimes you just need to do a good old fashioned reformat and reinstall and start fresh. But sometimes it can be a physical hardware problem, like a bad hard disc. That happened to me with an iMac someone donated to me. The hard drive was failing and everything was running very slow. So to fix that, simply replace the hard drive. And while you're at it, you might as well put a solid state drive in there because those will perform much faster than a mechanical disc. Yes, these fixes can take a little time and money, especially if you have to buy parts or hire a technician, but overall I think it's a better long term solution, so you don't have to keep plugging stuff into your computer when you want to use it all the time. But if you do want to go the external route and have a USB stick, but at the same time, you don't wanna spend money on an Xtra-PC, yes, you can look up a tutorial on how to make a bootable Linux USB drive. It's certainly doable. However, that might outweigh the cost of just buying the Xtra-PC in the first place. It really just depends on your skillset. So, we talked a lot about Linux in this episode, and, you know what else runs on Linux? About 90% of the internet. And that's actually what my friends at Linode specialize in. If you have an application or a website that you need to scale and deploy, Linode has the infrastructure and the 24/7 technical support for you. And don't worry about doing everything from scratch. They also have packaged applications to get you started. Linode offers out-of-box apps for game servers like TF2, CS:GO, and even Minecraft. You can run your own virtual private network with open VPN, build an online application with Joomla's content management system, or build a video streaming site with a multitude of app choices. There's so much you can do with Linode's affordable Linux virtual machines. And to boot, they offer award-winning 24/7 technical support. To put it simply, if it runs on Linux, it runs on Linode. Visit linode.com/computerclan and click the create free account button, and they'll give you a 60 day $100 credit just for watching this episode. And when you do that, you're also supporting the Computer Clan, so thank you very much. So Xtra-PC, I don't think it's as bad as many people were making it out to be, but overall I think there's better solutions out there. And which one you use will depend on your budget and your skillset. But that's kind of how it is with everything, right? If something breaks around the house, sure, we can look up a tutorial and try to figure out how to fix it, or we can hire someone to fix it for us. That's just kind of how things are. I, however will be doing the former. So, I'm about to head off into the layer and fix the 14 toilets that I have. And don't ask me why I have 14 toilets. That's private. Catch the crazy and pass it on. (techno music)",
    "transcript_keywords": [
        "Linux",
        "Linux USB drive",
        "XtraPC",
        "transform outdated PCs",
        "Pro",
        "drive",
        "product",
        "video",
        "flash drive",
        "Turbo",
        "USB drive",
        "Linux distro",
        "USB",
        "Linux USB",
        "flash",
        "bootable Linux USB",
        "USB flash drive",
        "Windows",
        "time",
        "whiteboard video"
    ],
    "transcript_entity_values": [
        "USB",
        "159",
        "Ken",
        "Linux USB",
        "Xtra",
        "4.18",
        "Firefox",
        "Turbo 32",
        "32",
        "VPN",
        "Linux",
        "40.4 seconds",
        "Turbo",
        "GNU",
        "60 day",
        "about 6.5 gigabytes",
        "two",
        "Linux",
        "GNU/Linux",
        "Flash Player",
        "Ubuntu 18.04.2 LTS",
        "24/7",
        "100",
        "ISO",
        "Xtra-PC",
        "79.99",
        "FileRez",
        "Mac",
        "2.0",
        "49.99",
        "Synaptic Package",
        "2013",
        "TF2",
        "Mac",
        "Open Office",
        "14",
        "Krazy Ken",
        "a week ago",
        "HP",
        "34.99",
        "16 seconds",
        "159.99",
        "Joomla",
        "first",
        "OpenOffice",
        "Windows",
        "one",
        "Windows",
        "58.5",
        "Thunderbird",
        "Auslogics",
        "iMac",
        "Corey",
        "64",
        "15",
        "less than $35",
        "Prairie IT",
        "over a minute",
        "Minecraft",
        "Linux",
        "LibreOffice",
        "5.7 seconds",
        "Linode",
        "Xtra-PC.com",
        "The Photo Stick",
        "one cent",
        "an additional 37 gigabytes",
        "2",
        "About 90%",
        "UI",
        "Linode",
        "the Computer Clan",
        "three"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "MONEY",
        "TIME",
        "MONEY",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "TIME",
        "ORG",
        "GPE",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL"
    ]
}