{
    "id": "zLFG068HtgM",
    "title": "The Electromagnet in Your Toaster",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2019-03-15T15:38:11Z",
    "video_url": "https://www.youtube.com/watch?v=zLFG068HtgM",
    "category": "Science & Technology",
    "tags": [
        "toaster",
        "technology connections",
        "toast",
        "kitchen appliance",
        "appliances",
        "rival",
        "sunbeam",
        "black and decker",
        "how toasters work"
    ],
    "views": 564289,
    "likes": 26704,
    "comments_count": 2064,
    "description": "You can support this channel on Patreon! Link below         Ya ever wonder about whats in a toaster? No? Well, too bad cause youre gonna find out right now!  Would you like some links? Have some links!  The datasheet for our IC in question:   Heres a link to the Sunbeam ad. I didnt realize that LIFE magazine is all in Google Books now, or at least a good chunk of it. Kinda fun to go through the old ads.   That toaster, by the way, has some dedicated fans. Learn more about it here:   Heres that patent I talked about:   And here are some more pressy pressy fun times:  Technology Connections on Twitter:   The TC Subreddit   You can support this channel on Patreon! It has been amazing what Patreon has done for this channel, but also for me (your dorky host) personally. Through the support of people just like you, Technology Connections has become my job and I am so excited and thankful for it! If youd like to join the fine folks in a pledge to help the channel grow, please check out my Patreon page. Thank you for your consideration!   And thank you to the following Patrons!  Jib Systems, Lars Kuur, Alan Nise, Matt Dancer, Andrew Rosenwinkel, Fran Rogers, Tero Janhunen, Bob B, Mike Noe, Alan Smith, Philip Cosgrove, Joshua Doades, Andreas Lunderhage, Ennex The Fox, LEONARD PEZZANO, Steve Kralik,  , Hank Eskin, Kirill Polstainen, Felix Winkelnkemper, Christopher Lawhead, BoostCookie, 98abaile, JustWusky, Dan Jones, Exilis, Owen O Byrne, Project A118, Charles, Sebastian Sparrer, timeslapsey, George Stamoulis, Paul Moffat, Linh Pham, Laria, Michael Greb, Max, Alessandro Robert Nilsen, Ryan Benson, fussel, Brannan Barber, Jonathan Haas, Neil Forker, Vincent Beetle, Warmo, James Pinakis, Bruce Davis, Conor Kileen, Johnni Winther, Marke Hesse, Brian M Knoblock, Sean Sandercock, Robert Wolfanger, Cannon Fodder, Andre van Soest, lululombard, Nicholas Boccio, Armando Fox, Nelson, bluegoose, Kajico, Jason Hughes, Eli Krumholz, Angelo van der Sijpt, William Evans, Philip, Martin, X39, Richard Lantz, Gideon Rigger, Oliver Lee, AJay Janschewitz, Lennart Sorensen, Mitch Radoll, Viorel, Reachan Kekeis, Loh Phat, Vivian Pypher, Torin Zaugg, John Donaldson, Brandon Whiting, Robert Tait, Zachary Hazlett, Nathan Blubagh, Joel, Peter Stewart, Liam OFlynn, Russell Brower, Brannan Barber, Patrick Barry, Tyler, Robin Johnsen, Brian Wolman, Deryn Rouge, Eric, Phia Westfall, Markus Schumacher, Besenyei Adam, Colin Grimshaw, Mats Svardal, Shannon Potter, Jeremy Hastings, Mark Wayt, Matthew Reynolds, Andrew Mertzenich, John Lavalle, Dave Howlett, Matthew E. Cooper, Sonic the Anonymous Hedgehog (nice), Guilherme Vieira Dutra, Lee Tustain, Nathan Bruer, Lauren Hahn, Scott Rowland, Will Wren, Weird shortwave listener, kalleboo, Colin Hill, William Gray, Vaughn B., Sven Slootweg, Braden McDorman, Stephen Bank, Matthew Walster, Julien Oster, Joseph Dufour, Dr. Bjoern Bieber, Anders Enger Jensen, Phil Sowers, Juan Molinari, Jake Hickman, Trae Palmer, Ray, Robert McCullough, Gary Hampson, Lennart Rosam, Chris Wallace, Matt Shea, PJ Gunasekera, Charles Zilinski, Aaron Helton, Michael Holmes, Reto Jost, Thomas Beaver, AwesomeGuy64, Trey Harris, Benjamin Kier, Fredrik Grufman, Peter Pfundstein, Carlos V, Wilhelm Screamer, Jeffrey Frasure, Mat Stu, RYAN NGOGLIA, Harald E. Westlie, Charlycobra, Thomas Kolanus, Jeff Bigs, Brett Morgan, Isabell Reine, William Kisley, Daniel Johnson, Jesse Kempf, Tyler DeWitt, Reemt Rhmkorf,Jack Nichol, Robin Rattay, Mikko Wilson, Bruce Justyn, Rae McIntosh, Mathieu Vignau, Justin D, Adam Zawisza, Thomas Ausweger, Kyle Joynt, Matthew Holder, shawnski, Max Barnash, Microfrost, MrSonicOSG, William Bevans, rusty shakelford, Tim Alston, Mitch Schenk, Burak Laciner, Juan Oliveras, Charles Ball, Robert Holt, Mikhail Lavrentyev, Mike Bird, Vance Vagell, Emmett Ray, Michael Shaffer, Tianyu Ge, blaluu, Taylor Martin, Racecar378, Steve Trambert, Sputnik Dont see your name?  Dont worry!  To keep this little perk alive, the $5 patron shoutout is now on a rotating basis!  If youre not here, you should be here in one of the next two videos.  If youve slipped through the cracks, dont hesitate to send me a message via Patreon and Ill fix it!",
    "description_links": [
        "https://www.datasheet4u.com/datasheet-pdf/ETC/A0201F/pdf.php?id=716573",
        "https://books.google.com/books?id=LlIEAAAAMBAJ",
        "http://www.automaticbeyondbelief.org/gallery.htm",
        "https://patents.google.com/patent/US4518849",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "One of my favorite things in life is when I discover an unexpected piece of technology in everyday household items. Many of us have so many interesting things around us that may go unnoticed. Take kitchen appliances, for example. Theyre often a lot simpler than at first they seem, but in at least one particular case, that simplicity is accomplished with wondrous ingenuity. Im talking, of course, about toasters. Yes, the toaster, perhaps the silliest household appliance. A single-purpose receptacle in which you place sliced carbohydrate media to be partially burned for your enjoyment. Delicious. Electric toasters have come a long way from their 19th century roots-- good grief thats terrifying-- wonder no more when the toast will pop up. The jumpscare potential has been completely eliminated with this digital display. And wanna toast more than bread? What about a bagel? Be amazed as the side elements turn off, toasting only the cut side. Innovation at work! Of course, if you actually go back a mere 70 years in time, youll discover a toaster that is better than modern toasters in nearly every single way. Youre right, sally, it is like magic. But ignoring the surprising backward steps we seem to have made in the tantalizing territory of toaster technology, lets get to the point of this video, shall we? This toaster was a mere $8.88. Thats only $4.44 per slice! Now, perhaps its not surprising to you that a toaster can be manufactured so cheaply. It is after all simply a small box with a bit of nichrome wire (thats an alloy of nickel and chromium) forming bread-singeing heating elements. How complicated can it be? All it has to do is turn on the heating elements for a while, then shut them off and lift the bread. Ah, but see, its the way the simplicity is accomplished thats so ingenious. First, have you ever tried to push the lever down while a toaster is unplugged? If you do, youll notice that it simply wont stay down. No matter how hard you force it, the lever simply springs back up. Why is that? Well, it turns out that this single lever is performing the roles of bread lowering and lifting mechanism, power button, switch contact, retention latch, circuit breaker, and thing-that-moves-the-little-bread-squeezing--centering-things-in-and-out. Uh, to explain how it does all those things, well need to take this apart. And through the magic of buying two of them, I have an already-taken-apart one right here. Under the plastic covering is a sheet metal box containing the heating elements, as well as a small circuit board. This circuit board doesnt do all that much, but the way it has been integrated into the device as a whole is simply fascinating. First, notice these two pairs of contacts. These are what actually provide power to the toaster. In this state, there is no completed circuit. If you look at where the power comes in on the board, it goes right to this contact, and then its got nowhere to go. This contact must be pushed down to complete the circuit. Actually both pairs of contacts must be, as the other one breaks the connection on the neutral side as well, a smart move to protect against the potential for a power outlet with the hot and neutral wires reversed. If, when its plugged in, I manually engage the contacts using these high-tech insulated poking devices, now power can flow through the toaster. Youll hear a slight buzz and see that the heating elements begin to glow. [buzzing of toaster] Not only do the elements receive power, but so does the rest of the board. But what is responsible for normally engaging those contacts? Why, the lever of course. Also, Ive just realized this isnt technically a lever. Why do we call it a lever? Wait, do we call it a lever? Lets double-check that Sunbeam ad. Yeah, lever. Hmm. Anyway when the lever reaches the bottom, a set of its own insulated poking devices press the contacts down, and thus complete the circuit. Thats not the interesting part, though, ho no. The interesting part is how it stays down. Remember, with the toaster unplugged, the lever refuses to stay in the down position. It just pops right back up. But with it plugged in, now it will. How? Well, watch closely. Did you see that metal plate suddenly stick to the yellow thing? Watch again. That yellow thing is an electromagnet, and so long as it has power, it will hold the lever in place which keeps the contacts pushed in and allows power to flow through the heating elements. Now you may have already figured out the double whammy of genius here. If the only thing holding the lever down is an electromagnet, and the only way the toaster will work is with the lever held down, then by shutting off the electromagnet, it will let go of the spring-loaded lever, shut off the power, and of course eject the bread, now toast, in a violent fashion without warning. Fascinating. Which brings us to the other stuff on the circuit board. Though we dont need much in the way of circuitry in here, we do need a way to determine how long to hold down the lever, and thus how long to toast the bread. These days its handled with specialized components, like this (in a high-pitched, altered voice) MULTIPLE FURNACE DISABILITIES TIMING IC, which features such marvels as CMOS, TO-94, and Bagel. Google Translate wasnt much help here, but in any case we do know this is suitable for all types of toaster, and it appears to support a bagel mode but I cant see exactly how the chip itself is going to handle a bagel mode given that it only has the one output. In any case, the main thing this chip is doing is looking at the output from the potentiometer here to determine how long to stay on. And as we know from the datasheet, roast the development of the time interval: 0-300 seconds. Also, lets just get it out of the way that these numbers do not correspond to minutes. Tom Scott already did a video on this, but this should give you further proof because if the max time is 300 seconds, thats 5 minutes, not 6, so these are just arbitrary numbers. And funnily enough the box suggests there are only 6 settings, when in reality there are probably 300, as this is not a 6-position switch, it is an infinitely variable potentiometer. But I digress. Anyway, most of the other stuff on the board is support equipment for the main IC, such as its power regulator and smoothing capacitors, though surprisingly there is a diode connected straight up to this yellow lead going into the toaster body. This might be designed to halve the available current to part of the element through half-wave rectification, and indeed the middle section doesnt glow as intensely as the outermost sections so perhaps that connects to the middle section, but I cant say for sure. If Im following my traces right, the actual electromagnet is connected to this little transistor on the bottom, which is itself connected to the output of the main IC we were looking at earlier. So, the IC is in control of the electromagnet and when it decides the toast is done, it kills the output to the transistor, which kills the power to the electromagnet, which kills the power to the everything. Oh, and this little switch here, activated by turning the darkness dial all the way to the left, will interrupt power to the electromagnet and immediately release the toast. Theres a bit of a poetic sadness to the way this circuit works. When you press the lever down, it comes to life and says Oh! Hello world! Lets see, first Ive got to send power out on pin 1. It looks like Im getting 2.4 volts in on pin 3 so Ill just count to 137. And then 137 seconds pass and it says Times up! Now Ill just stop sending power out on pin 1 and Before we were putting self-aware digital circuits in toasters, mindless analog circuits would do the same thing but more crudely. Often the timing was accomplished through charging a capacitor, and the setting of the darkness dial, being a potentiometer, would change the rate at which this capacitor was charged. Once its past a certain voltage level, the power gets cut to the electromagnet via a transistor, and pop goes weasel. And before that, a simple mechanical clock timer would suffice. And I havent even gotten into this complication; some toasters use more than just time, or dont use time at all! Sometimes theres a bimetallic thermostat near where the bread sits, and adjusting the darkness adjust the temperature at which the thermostat would open the contacts. No timer required. Newer toasters with digital circuits can use use a thermocouple to determine if the toaster is cold and thus if it will need more time for the first toast, and less time for subsequent ones. The skys the limit when it comes to todays totally technical temperature-tied toaster technology. In fact, if youre looking for something to read, check out the description for a patent on time-based temperature compensation circuits from 1982! This design uses a second capacitor that is charged up fully whenever the toaster is used, and slowly discharges after the toaster has finished toasting. If the toaster is immediately used again, it wont have discharged much at all. The charge on this secondary capacitor effectively gets transferred into the main timing capacitor and thus will shorten the overall toasting time, helping to compensate for an already-hot toaster. If it hasnt been used in a while, the capacitor will be fully discharged, and thus the toaster runs for the normal period of time. You may have spotted the chip with temperature compensation earlier, so even our $8.88 toasters probably have a similar hot-toaster-taming-timer. If anyone wants to look at this schematic and reverse engineer how it could do that, be my guest, but Ill throw my supposition into the ring and suggest that the chip probably can stay awake for a while between toasts thanks to energy stored in one of these capacitors, and thus can keep track of how long its been between toasting sessions. Anywho, I think Ive had enough toast for one day. Actually, I dont even really like toast. I havent used my toaster in close to a year. In fact, Im pretty sure the last time I used it was to hold up the multi-colored flashlights in the these are not pixels revisited video. Yikes. And of course, Id like to raise a toast to the wonderful people on Patreon who keep these videos and my terrible puns coming. With the support of people like you, Technology Connections is about to see a pretty major upgrade. Ill fill you in on the details pretty soon but for now, if youd like to support the channel with a pledge of your own and get perks like early video access, occasional behind-the-scenes footage, as well as find out what that upgrade is Im talking about, please check out my Patreon page. Thanks for your consideration, and Ill see you next time! toasty smooth jazz And, through the magic of buying two of them, I have an already taken apart one, right here! (cord hits the microphone) That went really badly! Often the timing was accomplished through charging a capacitor. [toaster pops up] So it definitely is temperature compensated. We figured that one out. Before we were putting self... [toaster pops up] (bleep) its that fast! Ah, but see its the way that simplicity is accomplished thats so ingenious. First, have you ever tried to push the lever down while the heater is unp. Toaster. Often timing was accomplished through charging a capacitor, and the setting of the darkness dial, being a potentiometer [toast pops up], would change the rate Yeah I shoulda known",
    "transcript_keywords": [
        "toaster",
        "lever",
        "power",
        "time",
        "toasters",
        "toast",
        "circuit",
        "capacitor",
        "everyday household items",
        "contacts",
        "heating elements",
        "electromagnet",
        "elements",
        "circuit board",
        "toaster technology",
        "Ill",
        "unexpected piece",
        "board",
        "bread",
        "long"
    ],
    "transcript_entity_values": [
        "one day",
        "137",
        "half",
        "ho",
        "1",
        "Times",
        "8.88",
        "their 19th century",
        "two",
        "max",
        "Sunbeam",
        "CMOS",
        "6",
        "a mere 70 years",
        "These days",
        "TO-94",
        "close to a year",
        "Patreon",
        "300",
        "sally",
        "at least one",
        "first",
        "one",
        "Technology Connections",
        "300 seconds",
        "0-300 seconds",
        "One",
        "Tom Scott",
        "2.4 volts",
        "only $4.44",
        "only 6",
        "137 seconds",
        "1982",
        "First",
        "second",
        "5 minutes"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "TIME"
    ]
}