{
    "id": "Zo4u578ZqrU",
    "title": "Lytro: The $360 Million Company That Died - Krazy Ken’s Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2023-05-11T14:59:28Z",
    "video_url": "https://www.youtube.com/watch?v=Zo4u578ZqrU",
    "category": "Science & Technology",
    "tags": [
        "Lytro: The $360 Million Company That Died - Krazy Ken’s Tech Talk",
        "Lytro",
        "Lytro Camera",
        "Light Field",
        "Adobe",
        "Apple",
        "iPhone",
        "HTC",
        "Photography",
        "Tech Fail",
        "Tech Startup",
        "Venture Capital",
        "Investor",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Tech",
        "Comedy",
        "Humor",
        "Funny",
        "Computer Clan",
        "iOS",
        "Android",
        "Chicago",
        "3D",
        "Lytro Immerge",
        "Lytro Cinema",
        "VR",
        "Virtual Reality"
    ],
    "views": 1034341,
    "likes": 21165,
    "comments_count": 1348,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below The Lytro Light Field Camera lets you focus a photo after you shoot it. Sounds neat! So what went wrong at this $360 million dollar company?  Magic Cube episode   See rare & retro tech   Patreon!    Buy my Wallpaper Mega-Pack!   Download my Lytro files    Follow me on Twitter   Facebook   Shop for cool stuff on my store   Hey! I have a Discord    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Special thanks to Brad for helping me film this episode!  Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear I use   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "https://youtu.be/KK7n1HZf2Pk",
        "https://youtube.com/playlist?list=PLFWeyvvxf1rj0b0ROShJvi0E60KAyiwbn",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/megapack",
        "https://bit.ly/41uAJkr",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Hey, Gino, this photo you took is completely out of focus. - [Gino] Forget about it. Just refocus it with the Lytro app. - Lytro doesn't exist anymore, Gino. - [Gino] No, they're worth about $360 million. They have too much money to fail. - Wanna bet? Sponsored by Linode, cloud computing from Akamai. (energetic upbeat music) Hey everyone, how are you all doing? If you're new here, welcome, my name is Krazy Ken and this is the Lytro light field camera. This special camera lets you focus a photo after you already shot it. So today we're gonna explore the company's history, see what the camera is really capable of and talk about why a $360 million company died. Lytro's original name was Refocus Imaging founded by Dr. Ren Ng in 2006. Refocus Imaging specialized in light field cameras. A technology we'll dive into more in a bit but the short of it is, a light field camera lets a user refocus an image after it's been shot, like we see with the confetti during an onstage demo in 2008. Now, necessity is the mother of invention, right? So why did Ren want to make this thing? Ren Ng had a hard time photographing his family friend's daughter's smile with a digital camera. This was probably due to slow auto-focus motors and shutter lag, which is an issue Refocus Imaging will frequently mention when they released their first camera later, in 2011 the company changed their name to Lytro and Ren was the first CEO. Charles Chi joined as executive chairman. Kurt Akeley joined as Chief Technology Officer and Ben Horowitz, Patrick Chung and Mike Ramsay joined the board. In short, there were a lot of big names with a lot of dinero getting in on this. In October, 2011 Lytro officially unveiled its first product the Lytro Light Field Camera, a groundbreaking new camera which captures interactive living pictures. And it went on sale on February 29th, 2012. Now, how much does it cost? The wealthier you are the less expensive it'll seem. CollegeHumor reference, anyway, it was 399 for the 8-gig model and 499 for the 16-gig. So now let's test out what this camera is capable of and what better way to do that than to escape the layer, go outside and take some pictures. I'm working with my fellow cinematographer friend Brad, who helped me test the iPhone 12 Pro when it came out. Our mission is twofold. Try to capture in the moment photos and try to be creative and compose staged photos, all with the Lytro Light Field Camera, and no other hardware. (upbeat energetic music) (camera clicks) It's break time. Hey, we're in Chicago so we have to have some deep-dish pizza, right? But we can't eat it before we take a picture of it with our amazing 1.16 megapixels. Mm-mm, scrumptious, serve us up that slice, Brad. - All right. - I'm gonna need a lot of megapixels for that. (Brad laughs) So we tried portrait shots, wide shots, macro shots, telephoto shots, indoors and outdoors, all sorts of different things. And that gave me a great idea as to how the Lytro functions. So let's talk about the hardware and the software and then I'll tell you about the user experience. (laughs) The original Lytro camera came in three models, Red Hot, Electric Blue and Graphite. Blue and Graphite had eight gigabytes of internal storage whereas Red Hot had 16, which accommodated approximately 750 pictures. The camera has a built-in 1.52 inch glass touchscreen and an internal battery, which will last for about 400 pictures and it can be recharged with the USB port on the bottom. And I will say after using it in Chicago all day the battery was only half dead. The design is long and rectangular with a lightweight aluminum chassis in a silicone rubber grip. It's 4.41 inches long and weighs less than eight ounces. And I will say, one of the coolest aspects of this camera is the design, it's kinda funky and you don't see this kinda camera like, anywhere else. So, it definitely grabs your attention. The Lytro's longness accommodates an 8X optical zoom with an effective focal length of 43 to 342 millimeters, with the camera's 6.5 by 4.5 millimeter CMOS sensor, which is about double the size of the iPhone 4S's camera sensor. But despite the sensor being about twice as big as the iPhone 4S, the picture resolution was about 1/8th the size and we'll talk about why in a sec. Lytro uses a constant f2 lens, meaning the aperture size remains the same at any focal length. The more open the aperture, the more light can hit the sensor and the depth of field will be more shallow. And the shutter speed ranges from eight seconds to 1/250th of a second. Longer shutter equals more light, but more motion blur. There's also a built-in neutral density filter, which I did not expect. This filter lowers the exposure of an image without needing to adjust the ISO or shutter speed. And lastly, we'll talk about ISO, the sensors sensitivity to light. It ranges from 80 to 3,200. The higher the ISO, the brighter the image will look but more noise will appear. So those are the specs and the design of the camera. But now let's talk about the big feature, which makes this thing different from every other camera that was on the market at the time. The light field sensor. A light field is the volumetric information of a scene, in traditional photography, two dimensions of an image are captured, in light field photography, a third dimension is captured, the angle of all light rays in the scene. This idea was first proposed by Gabriel Lippmann on March 2nd, 1908. Under the original term \"Integral Photographs,\" there's several ways a light field photo can be captured. For example, Google's rig of multiple GoPros aligned on an arc. This is the rig they use to make the welcome to light field application. In Lytro's case, they use an MLA, a micro lens array, instead of multiple cameras with multiple lenses and sensors, an MLA uses multiple small lenses that share one sensor. This produces a single image that's constructed of hundreds of sub images. Each sub image captures light at a slightly different location in space. Essentially, the camera is seeing the scene from many slightly different viewpoints. The Lytro camera's, light field sensor captures 11 million of these light rays or 11 Megarays, as Lytro calls them. And the light field engine software processes all the the data in camera. And this allows us to achieve the refocusing and 3D movement effects Lytro advertises. So that's the hardware, but what does hardware need? Software, the camera software lets users tap to change exposure and set focus, an upward swipe reveals a dock with wifi settings, the creative mode toggle, which we'll talk about soon. Status icons for storage and battery and a timer. An upward swipe also shows a settings gear which lets you turn on manual mode, change languages, erase the storage and reboot the camera. Swiping down reveals the shutter speed and ISO sensitivity settings. You can manually set them or use auto mode and even enable an ND filter. However, the manual shutter and ISO settings were not in the original software. Those features came in a later October, 2012 update. And swiping left let's you scroll through your photos. Now, I felt dumb for a while because I was trying to figure out how to actually zoom in to take a photo and I was tapping around the screen and like pinching and zooming like a moron. So I finally read the manual. It turns out there's these little bumps on the silicone rubber grip and when you move your finger left and right on those, that's what lets you zoom in and out. The zoom control also lets you zoom in on previously shot photos and you can zoom out to browse everything in a three by three grid. So what's this creative mode thing? When creative mode is off, this is referred to as everyday mode. In this mode, the user cannot tap to focus on a specific subject. When creative mode is on, you can tap to focus on exactly what you want. This is useful for portrait shots with really shallow backgrounds and macro photography. And I'm assuming this exaggerated blur is more optical than it is computational to an extent because when you turn on creative mode you can hear the auto-focus motors moving. They barely move at all in everyday mode. (auto-focus motors whirring) And yes, you're able to change the focus of a photo after you shoot it but that only applies to computational blur. If you're in creative mode and you optically have a background or a foreground subject out of focus, that blur cannot be reversed in the software because that's not being done computationally. That's purely being done optically by the lens and the aperture. So now you have all these pictures. What do you do with them? Well, that's where the Lytro desktop software comes in. When you plug in a Lytro camera to your computer an installer image mounts like a virtual cd. The image contains an HTML file, which guides the user on how to install the software but it doesn't work properly nowadays because it's trying to access an old webpage that was shut down. Thankfully, archives exist and I was able to download the installer from lightfield-forum.com. Specifically, I'll be using version 5.0.1 from 2015. After installing the app you can import the images off your camera via USB. Then you can browse the images in thumbnail view, picture view, and filmstrip view. The info button lets you view metadata for pictures. And the adjust button lets you have all the fun. You can make basic adjustments like exposure, shadows, and saturation. But truly, we're here to play with focus, right? That's the whole point. You can click on any part of a photo to adjust the focus. And since we're capturing a 3D model of the scene, you can click and drag around to change the perspective of the photo slightly. There's also a sidebar with more controls. You can change the F-stop for a photo, even after it's been shot. You can also adjust the focus spread, which lets you blur the background and foreground of an image independently. These features let you fix an out of focus picture but they also let you get creative with making more blurry backgrounds and making the subject pop more. You can also animate your pictures. You can stimulate camera movements and rack focusing inside a timeline editor. But the fun doesn't just stop in the editing software. People could share these living pictures online too. When a picture is exported from the software, users can upload them and viewers can interact with them simply inside a web browser. No special software required. You can also export your animation to a movie file and you can export still images as TIFF and Jpeg, even a lenticular image sequence, you know, so you can create beautiful works of art like this. This is an example of a lenticular image. (notification dings) I didn't shoot this with the Lytro, by the way. Sonic's not real, yet. So that's the hardware and the software. But how do these features come together and work in the real world? In a sentence, the Lytro camera is very... What do the kids say these days? Mid. Before I criticize the Lytro Light Field Camera too much, I will say the design is very pretty and the light field technology is well implemented for a one of a kind tiny product. And the camera is fast within a second I can wake it from sleep and take a photo. And the macro mode works well. The details from this flower petal are preserved and even this tiny film cell looks good. With all that aside, the rest of the Lytro camera is sadly not that great. For starters, the output resolution is 1080 x 1080. That's only 1.16 megapixels, which is less than the first Gen iPhones camera in 2007. So no matter how good your photos turn out, they're still gonna be very small compared to other 2012 camera capabilities. The next big drawback is the display. It's very low resolution and it's very small, making it difficult to actually see what you're trying to compose. And since it's a touchscreen your finger is gonna block a large part of it when you try to press the touch buttons which I found cumbersome at times. And I was willing to overlook the display's shortcomings. But the more I used it, the more I realized it gets worse. The display is not bright and the glass is very reflective. It was difficult to see the display while taking photos outdoors, and it was an overcast day. If it was sunny, it would've been even more difficult. And the viewing angle is terrible. If you're not looking at the display straight on, the image gets washed out now it's time to discuss image quality, buckle in, The dynamic range is very low. When increasing the foreground exposure the sky will easily wash out. And cloud details, for example, are lost. Or when photographing a kitty cat in the sun the highlights clip and you lose fur detail. And I know on an overcast day it's hard to judge cloud detail but even in my layer, highlights from this simple light bulb are completely lost. There's also some weird speckle and line artifacts appearing in some of the images. And the process blur sometimes leaves little fringes of unblurred pixels around the foreground subject. My theory is the micro lens array is causing this weird pattern because this flies eye effect looks awfully similar to an MLA design. Color accuracy is also sporadic. Sometimes color will look okay and sometimes color will look dull. This can be corrected in editing software but it's more steps the user has to perform. And the optical zoom is handy but operating it is a huge pain in the butt. You have to constantly swipe your finger across these little notches to get it to zoom in all the way. I don't know, it just feels a little slow. And the final problem, this camera makes my head look big. Oh wait, that's just my head, nevermind. And I can't imagine many consumers would wanna go through all of their photos and fix the focus after the fact and do other changes. I consider myself decently versed in the software space and even I found the software tedious and I'm using a newer version. The rendering times for the movies are very slow if you have the quality set to best, even for just a six and a half second clip, this laptop is a higher end system, a higher spec system and it came out a year after this camera, right? But it still took several minutes for it to export the six and a half second clip. And I don't think consumers are gonna want to deal with that. Similar to the Magic Cube situation, it seems like Lytro spent so many resources getting the light field technology to work, that they didn't spend enough resources on the rest of the product. The innovation of great tech is awesome but that's just one aspect of a product. But we're just getting started. This was just Lytro's first product. So what happened next? On April 15th, 2013, Jason Rosenthal became the CEO of Lytro, and Ren became executive chair. Jason was a partner at North Bridge Venture Partners, which would play a big role in a future investment round. According to All Things Digital Rosenthal said the camera sales were ahead of the company's internal plan but the official sales figures were never released publicly. And you know, they are a private company, so that's their right, but they seemed totally willing and happy to announce how much money they raised. On November 20th, 2013, Lytro announced they raised $40 million from North Bridge along with existing investors. Rosenthal stated this money would help fund a new generation of Lytro hardware. And the beginning of this new generation was this. The Lytro Illum, announced on April 22nd, 2014. It featured a more familiar camera shape design with a larger four inch screen and a 30 to 250 millimeter lens and a 40 Megaray image sensor, compared to 11 in the previous gen. There's also a flash hot-shoe, a removable battery and an SD card slot and the price was 1,599. And it was only 1,499 during pre-orders. And first gen camera owners received a 20% discount. And those features sound like an improvement but I still can't get over how small the pictures are. The resolution was 2450 x 1634. That's only four megapixels in 2015. My Cannon EOS 7D Mark II, which came out a year before the Illum, by the way, can shoot 20.2 megapixel images. So being stuck with four megapixels is a huge drawback. Heck, even the iPhone 6 Plus, which was the latest iPhone at the time of the Illum's release, had an eight megapixel camera. And I know megapixels aren't a direct measurement of quality, but come on! Again, Lytro never announced the sales for the Illum, just like with the first gen and they pivoted away from it pretty quick. So it seems like they could not grasp the pro/semi-pro market, which, according to the videos on Lytro's website is the type of market they were going for. But I hope you all can drive stick because Lytro is changing gears again. In 2015, Ren Ng stepped down from his full-time duties at Lytro to focus on a professorship at Berkeley. Around the same time, dozens of employees were laid off from Lytro, as the company pivoted to light field virtual reality and video. On November 5th, 2015, Lytro announced Immerge, which the company described as \"The world's first professional light field solution for cinematic VR.\" And this thing went nowhere. I'm not trying to sound like a pessimistic dick but I have not found any photos or videos of anybody using this product anywhere. So did it even get manufactured also? Where are the lenses? Quick, fast forward to 2017 Immerge 2.0 looked much more practical, definitely not as pretty as the original but it actually looked like it was a real piece of hardware, featuring 95 cameras and 120 degree field of view. Back to 2016, Lytro announced Lytro Cinema, which gained a lot of attention at NAB. Lytro Cinema was a high-end camera with a 755 megapixel sensor, which can shoot up to 300 frames per second. And all the footage you shoot can be adjusted in post-production software, as if you were physically adjusting your camera settings in the studio. You can refocus the shot, change the shutter angle, you can even replace backgrounds without a green screen. The downside is to capture all this data Lytro Cinema required 400 gigabytes of storage for one second of video. So to no surprise, this thing flopped too. I mean, the thing again, was huge, it was 6 feet and sometimes 11 feet long. Also, 400 gigabytes for one second of video is not practical for a lot of facilities. You know, the more I look into this Lytro story I see a pattern of over ambition. It just seems like they keep trying to do all these cool things, but at the same time, they're pivoting and not actually landing on something that the market truly needs. And in the case of the Illum, for example, that camera fell short of pro and semi-pro needs. And then what does Lytro do? They overcorrect with the Lytro cinema, and now it was too overwhelming and it's just like polar opposites and they just can't find the sweet spot. They can't win. But despite all of these problems, the company was still valued at $360 million, but not for long. In a March, 2018, blog post, team Lytro stated they are winding down the company and not taking on new productions. There were reports that Google acquired Lytro for $40 million but I can't confirm that, according to TechCrunch Lytro was being sold for between 25 and 40 million. But it was a hiring deal, not a formal company acquisition. Google declined to comment and no price was confirmed. Lytro also had 59 patents. So the people in the patents is probably what Google wanted more than the whole company. So that leads us to the big question. Why did Lytro as a company fail? Okay, yeah, you could say they ran out of money and it was harder to find more investors because they were losing so much cash. But I like to go deeper than that, and I meditated on all of the information I found, and I boiled it down to one key point that started with their first product. Lytro was a 2006 vision living in 2012 and the world changed so much during that time with two big products that revolutionized the tech space, iPhone and Android. If Lytro somehow could have launched this camera in 2006, would it have been a bigger success? Yeah, probably, consumer expectations were different back then. This camera could only produce 1080 x 1080 images and it was not connected to wifi for easy sharing and transferring. But in 2006, that was likely more acceptable. But it launched in 2012. Smartphones were in the hands of about a billion people at that time and they conveniently had cameras and wifi built in. Not to mention, the average price of a smartphone in early 2012 was $378. So justifying a $399 separate camera purchase was likely not in consumer's best interests. To give Lytro credit, eventually they did enable wifi capabilities in their first gen camera via a software update. Apparently wifi hardware was always built in it just wasn't being enabled initially. And they also launched a mobile app but in the long run, it didn't save the product. And within the next several years smartphone started integrating similar focusing features that used depth data with dual camera systems like the HTC One M8 in 2014 and the iPhone 7 Plus in 2016. So all of these factors led to a lack of adoption, which is something I talked about in my laser keyboards episode. If a product can't cross the chasm and fulfill the needs of the early majority of users, it will likely fail. And a failed product equals no sales. And no sales equals no revenue. The company can't survive. And adoption wasn't just an issue with the first camera, it was an issue with all their products. But Ken, how were they valued so high? Yeah, I know it sounds ridiculous, right? Look, I'm not a venture capitalist guru. And again, they're a private company, so they didn't announce their financial information publicly. So I can't give a true answer. But my quick and dirty answer is, let's just say tech startups have a notorious history for being overvalued. And that's probably what happened here. And for investors, sometimes it's a game of faith not black and white numbers on a balance sheet. So it can be hard, especially at the beginning of a company to truly target a good valuation. In fact, during a Lytro board meeting on January 29th, 2015, GSV Capital investor, Mark Flynn said, \"We invested in Lytro because we were excited about the potential of light field technology and believed in the team, not because we wanted to be in the consumer electronics business.\" So the faith was there but unfortunately that faith didn't save this company. On the bright side, we can experience similar benefits to light field technology with our smartphone cameras today, like shooting in portrait and cinematic mode on the iPhone, where the blur is generated computationally. Do those features exist because of Lytro? Maybe, it's hard to say for sure but I will say this was still a very fun camera to play with and I encourage you guys to try it out too. And if you wanna download the files that I generated with this thing, you can check out the link in the description. And also, if you have nothing else, this will suffice because the best camera is the one you have with you. And I know Lytro wasn't technically acquired by Google but another L company that was acquired recently was Linode. They were bought by Akamai. And if you have an application or website that needs to be scaled and deployed, Linode has the 24/7 support and infrastructure that you need. Linode offers out-of-box apps for game servers like TF2, CS:GO, and even Minecraft. You can run your own virtual private network with OpenVPN, build an online application with Joomla's content management system or build a video streaming site with a multitude of app choices. There's so much you can do with Linode's affordable Linux virtual machines. And to boot they offer award-winning 24/7 technical support. Visit linode.com/computerclan and click one of the signup buttons. And when you do that we'll give you a 60 day $100 credit just for watching this episode. And you're also supporting the Computer Clan. So thank you very much. Catch the crazy and pass it on. (energetic upbeat music) The cheese is under the sauce.",
    "transcript_keywords": [
        "Lytro light field",
        "Lytro",
        "light field camera",
        "light field",
        "camera",
        "Lytro camera",
        "Lytro light",
        "Lytro announced Lytro",
        "light",
        "field camera",
        "light field technology",
        "field",
        "Lytro Cinema",
        "original Lytro camera",
        "light field sensor",
        "software",
        "company",
        "image",
        "Lytro announced",
        "light field photo"
    ],
    "transcript_entity_values": [
        "378",
        "Gen iPhones",
        "HTML",
        "November 20th, 2013",
        "dozens",
        "All Things Digital Rosenthal",
        "only 1,499",
        "2015",
        "only half",
        "My Cannon",
        "Android",
        "ND",
        "Rosenthal",
        "up to 300",
        "60 day",
        "NAB",
        "two",
        "399",
        "CMOS",
        "2006",
        "Chief Technology",
        "HTC",
        "about 400",
        "80",
        "20%",
        "6 feet",
        "TechCrunch Lytro",
        "40",
        "four inch",
        "one",
        "499",
        "399",
        "16-gig",
        "4S",
        "the Lytro Light Field Camera",
        "EOS",
        "an overcast day",
        "a year",
        "Lytro Cinema",
        "eight gigabytes",
        "2014",
        "400 gigabytes",
        "43",
        "2450 x 1634",
        "only 1.16 megapixels",
        "Patrick Chung",
        "Linux",
        "The Lytro Illum",
        "all day",
        "8",
        "100",
        "Mark Flynn",
        "Refocus Imaging",
        "North Bridge",
        "4.41 inches",
        "120 degree",
        "Charles Chi",
        "April 15th, 2013",
        "11",
        "2017 Immerge 2.0",
        "February 29th, 2012",
        "Google",
        "Akamai",
        "less than eight ounces",
        "Joomla",
        "first",
        "only four megapixels",
        "these days",
        "a later October, 2012",
        "16",
        "11 feet",
        "$360 million",
        "Illum",
        "59",
        "Linode",
        "sec",
        "three",
        "Red Hot,",
        "USB",
        "Jason Rosenthal",
        "Ken",
        "early 2012",
        "January 29th, 2015",
        "about 1/8th",
        "Gino",
        "six and a",
        "North Bridge Venture Partners",
        "Chicago",
        "Megarays",
        "20.2 megapixel",
        "24/7",
        "Sonic",
        "ISO",
        "1080",
        "GoPros",
        "1,599",
        "GSV Capital",
        "November 5th, 2015",
        "Brad",
        "TIFF",
        "hundreds",
        "TF2",
        "eight megapixel",
        "today",
        "Krazy Ken",
        "October, 2011",
        "Integral Photographs",
        "Lytro Light Field Camera",
        "the next several years",
        "March, 2018",
        "Kurt Akeley",
        "the iPhone 7 Plus",
        "about $360 million",
        "2016",
        "iPhone",
        "approximately 750",
        "Ren Ng",
        "Minecraft",
        "several minutes",
        "2011",
        "Jpeg",
        "between 25 and 40 million",
        "the Computer Clan",
        "6.5",
        "third",
        "2007",
        "Immerge",
        "Ren",
        "Magic Cube",
        "one second",
        "Berkeley",
        "about a billion",
        "Jason",
        "Mike Ramsay",
        "3,200",
        "Lytro",
        "four megapixels",
        "CollegeHumor",
        "from eight seconds",
        "Ben Horowitz",
        "2008",
        "SD",
        "Gabriel Lippmann",
        "4.5 millimeter",
        "March 2nd, 1908",
        "MLA",
        "April 22nd, 2014",
        "30 to 250 millimeter",
        "1.52 inch",
        "One",
        "$40 million",
        "755 megapixel",
        "second",
        "signup",
        "11 million",
        "95",
        "2012",
        "1.16 megapixels"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "FAC",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "DATE",
        "CARDINAL",
        "EVENT",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "GPE",
        "LOC",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY"
    ]
}