{
    "id": "Zpc6_-u7sw4",
    "title": "Apple's iPhone XS keynote was about story, not specs",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-09-14T15:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=Zpc6_-u7sw4",
    "category": "Science & Technology",
    "tags": [
        "apple",
        "iphone xs",
        "iphone",
        "marketing",
        "apple event",
        "apple keynote",
        "iphone xr",
        "xs max",
        "xr",
        "xs",
        "steve jobs",
        "tim cook",
        "steve jobs story",
        "event",
        "keynote",
        "iphone xs max",
        "apple watch",
        "watch series",
        "watch series 4",
        "apple watch series 4",
        "ios 12",
        "iphone event",
        "apple 2018",
        "iphone 2018",
        "processor",
        "dieter bohn",
        "2018",
        "what to expect",
        "apple ipad",
        "ipad",
        "apple history",
        "steve jobs inspirational",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "mkbhd",
        "google",
        "first look",
        "hands on",
        "verge",
        "the verge",
        "review"
    ],
    "views": 370817,
    "likes": 12101,
    "comments_count": 858,
    "description": "Processor is back! After a long week of Apple coverage, Dieter Bohn dives into the question: Why does Apple keep doing these big hype-y keynotes? Apple does more than just present the phone, read the specs, and let us come take pictures of it. It tells a story.  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- By the time you watch this video, you'll already know what I've seen inside here, the Steve Jobs Theater at Apple Park in Cupertino, California. It's the new iPhones, but here's a question. How badly does Apple really need to do these big, hype-y keynotes anymore? And why do they do them? (electronic beeps) Okay, so the keynote is over. It happened behind me and I'm walking into the hands-on area, and I'm doing this because I wanna show you the first answer to that question, why does Apple hold the events. Well, it's really obviously, honestly. The most obvious answer is hype because look at this hype, there's just a lot of it. And Apple wants to have all these people here. It wants to show off all its phones, it wants to have a big media moment, and so of course they do a keynote. They invented this thing. Everybody's copied it. But I think hype is just one part of it. I don't even think it's the most important part. See, this is an S year, which means that the updates to the phone aren't as obviously exciting as they were in a bigger year. So the iPhone 10 came out. It was a whole new design, blah, blah, blah, blah. This year the new features are better camera, faster processor, slightly nicer screens, slightly nicer glass. You know S updates, and so in order to make that thing build up this level of hype, Apple needs to do more than just present the phone, read the specs, and let us come take pictures of it. Apple needs to tell a story, because if Apple can tell a story that means Apple can set a narrative, and there are a couple of moments in this keynote where Apple set a narrative that I really wanna talk about. (electronic music) (crowd applauses) - Welcome to the Steve Jobs Theater. Let's get started with the Apple Watch. Everything about it has been redesigned and re-engineered. (crowd applauses) This is iPhone 10S. We are very excited to show you the iPhone 10R. (crowd applauses) - We're back. We're back in the studio. Processor is back, I'm back, it's good to see you, except I can't see you. You can see me, anyway. In this video, I wanna talk about that narrative thing I mentioned. I'm not making a video about the specific specs or features of the iPhone 10S, not really. There's a lot to get into, and we're going to do all that in the official VRG interview. Instead, I wanna talk about how Apple tells a story because I think it's just as important as the specs and the features of that phone, especially in an S year. So, the first note I wanna talk about in the keynote is when Apple introduced the new camera system on the iPhone XS, 10S, whatever, the name is bad. Every time Apple introduces a new feature, they tend to go through a three step process. Step one is look at all the amazing stuff we've done in the past. Step two is look at all this cool tech and specs and crazy stuff that we've enabled on this new thing. And then step three is you get to participate in this amazing future. So, watch this clip and when you do, don't think about the specific features, think about the way that Apple is talking about them. - Over 10 years customers have been taking incredible photographs with their iPhone cameras, like this. It is a remarkable new dual-camera system. It has a 12 megapixel wide camera, a 12 megapixel telephoto camera, and an even more improved true tone flash. (crowd applauses) This is a new era of photography. Some people call it computational photography. And the benefits of this are not only for photography, but for video as well. It's a new ere of videography as well with this new sensor and the power of that A12 bionic chip. - Okay, so why is this three step narrative important? Well, first of all, the big innovation on the iPhone 10S is the camera, really. And what's interesting is they're trying to do some very similar stuff to what the Pixel 2 already does. It takes multiple photos at once, stitches them together. It does a whole bunch of computation on it, but do you know what didn't get mentioned at all in Apple's keynote? Any other smartphone cameras. In Apple World, there's only iPhone cameras and DSLRs. To me the clearest example of this whole Apple World thing was when Schiller was introducing this new feature on the 10S that lets you take a portrait moto photo and then edit it after the fact to change the background blur on the picture. - I'm gonna slide the depth of field and watch the background as it changes the depth of field of your photo. This is done after you've taken it. This has not been possible in photography of any kind of camera. This is something that iPhone can now do with the power of the A12 bionic chip. - Now, maybe he was referring to all the features being a first, whatever, but we all know, well at least, I know, that Samsung has let you do this after the fact foca editing thing since at least the Note 8 last year, just saying. The point here isn't to dunk on Apple because honestly I was super, super impressed with how the blur editing worked in my hands-on at the event. No, the point is to see how Apple introduces a feature. It's always part of a story, and again that story is always how Apple was great before, how it has great tech now, and how it's gonna get better in the future. The term for this is framing, basically, which has always been a thing in politics. Political framing, framing a narrative. In this method, Apple sets the terms of the world and the things that exist in it. That's the frame. And then within that frame it tells a story, where one thing leads to the next. A little bit like the plot of a movie. All that means is that even in a S year keynote where the announcements aren't really that game-changing, Apple can still use this narrative setting structure to change and shape how people think about their products. Here's another example of how all this works. It's the moment where Apple introduced the new heart sensing features that are coming on the Apple Watch Series 4, and specifically the new EKG feature. - The optical heart sensor has been essential to Apple Watch from the beginning. We've added electrodes into the back sapphire crystal and the digital crown allowing you to take an electrocardiogram. (crowd applauses) When you open the app, this is what you see on the watch face. It's really beautiful. People in general don't like things that are medical. This kinda makes you want to take an ECG. - Because narrative framing is a commonly used tactic in political discourse, it's a pretty short jump from talking about this rhetorical method to assuming that it's just propaganda to cover up lies or that it's there to cover up a pretty meh set of product announcements. Now to be clear, I am not saying that at all. What I am saying is that Apple is pretty masterful at this method and it does it over and over again in its marketing. Sometimes it's super effective, and sometimes it's not. But the funny things is, I think Apple executives really do believe the stories that they're telling. I mean, I don't know, look at any other tech company keynote, or LG or Samsung or whoever is targeting a new feature. It feels way more scattershot. Apple takes its time in its keynotes. It goes a little bit slower, because those keynotes don't exist just so you know what the new feature is. They exist so that you can see yourself as a character in Apple's story. And you know what? Apple's always done it this way. Here's a way older keynote that uses the same method. - It has the same great design of the iPhone 3G that we just launched last summer, but what's inside is entirely new. It has amazing hardware and software that work together as Apple is known to do. We make these things work hand in hand, and this has auto-focus, auto white balance, auto exposure, to take such a gorgeous photo for you. (kids laughing) You can take videos with you everywhere you go, (crowd applauses) it's just as simple as that. That was taken on an iPhone 3GS. You just tap to record and when you're done, the best thing is you can now share it with anyone right here from your iPhone. - You know the long running joke about Apple keynotes. They create a reality distortion field and back in the day with Steve Jobs, that field was mostly created by sheer force of charisma. - Yes, I'd like to order 4000 lattes to go, please. (crowd laughs) No, just kidding. Wrong number, thank you. Bye bye. (crowd applauses) - And yeah, now there's just a little bit less charisma maybe. But there's still a story that Apple wants to tell and that's why they do these keynotes every September. Hey, thank you so much for watching. It's really great to be back on the YouTubes with ya'. Leave a comment down below. What did ya' think of this keynote? And you know what? Honestly, you should hit that subscribe button because we're about to enter silly season for new product announcements and we're gonna have a ton of videos and you're gonna wanna know about 'em.",
    "transcript_keywords": [
        "Apple",
        "Park in Cupertino",
        "Apple Park",
        "Apple Watch",
        "iPhone",
        "Steve Jobs Theater",
        "Apple World",
        "Apple World thing",
        "Apple Watch Series",
        "keynote",
        "thing",
        "Steve Jobs",
        "watch",
        "story",
        "Apple introduces",
        "features",
        "feature",
        "Apple keynote",
        "California",
        "Cupertino"
    ],
    "transcript_entity_values": [
        "4000",
        "the iPhone XS",
        "one",
        "Apple",
        "a bigger year",
        "Cupertino",
        "last summer",
        "an S year",
        "three",
        "the day",
        "iPhones",
        "LG",
        "ECG",
        "A12",
        "the Steve Jobs Theater",
        "8 last year",
        "a S year",
        "the Apple Watch Series 4",
        "California",
        "VRG",
        "Samsung",
        "10S",
        "Steve Jobs",
        "two",
        "Apple Park",
        "Schiller",
        "10S",
        "foca",
        "Apple Watch",
        "This year",
        "12 megapixel",
        "Apple World",
        "the Apple Watch",
        "10 years",
        "first",
        "iPhone",
        "silly season",
        "YouTubes"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "FAC",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "FAC",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG"
    ]
}