{
    "id": "ZQFn1Z-x9DQ",
    "title": "Dell Inspiron 7567 Review - $800 GTX 1050 Gaming Laptop!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-01-29T17:25:15Z",
    "video_url": "https://www.youtube.com/watch?v=ZQFn1Z-x9DQ",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Dell",
        "Inspiron",
        "7000",
        "7567",
        "7566",
        "GTX",
        "1050",
        "GTX 1050 TI",
        "cheapest gaming laptop",
        "Best gaming laptop",
        "7559",
        "Acer",
        "VX15",
        "versus"
    ],
    "views": 1884824,
    "likes": 29608,
    "comments_count": 3489,
    "description": "Dave2D review of the Inspiron 7567 with GTX 1050 or GTX 1050 TI. Is this the best gaming laptop to buy under $800?! Magnetic Hourglass -  Inspiron 7000 -   Be sure to check out my other GTX 10 series Laptops: ASUS GL553 (GTX 1050 / TI) -  Razer Blade 14 (GTX 1060) -  MSI GS63 (GTX 1060) -  ASUS GL502 (GTX 1060) -   Music Credits: Intro: Matanoll - Clearness (Robotaki Remix) Background: Fili - Push  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2kHhBQe",
        "http://amzn.to/2j8Tp8f",
        "https://youtu.be/EnhtpjbNHWY",
        "https://youtu.be/G_VUD7r0gVA",
        "https://youtu.be/lvkZRMPM8aQ",
        "https://youtu.be/IDJd_9CMkEg",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "(clack) (Intro music playing) Hey, how's it going guys. This is Dave2D, and this is the 2017 Inspiron 7000. So the model last year, the 7559, was a huge hit. $800 gaming laptop that kind of hit most of the points pretty well. And it was just a really good budget gaming laptop. This model, the 7567, it's been redesigned. The exterior is a little bit different. The interior is revamped: new hardware, new Kaby Lake chips, new GTX 1050 cards. But the price has stayed the same. Let's take a look. So it's red and black again. Or kind of like dark gray. But, I actually like this design. It's got this sleek, minimal look going on, and the red accents aren't in your face. They're angled away, or hidden behind grills. But if you still want to go super red, they have that option as well. So last year's model was already a very solid-feeling device. The new one is equal, if not better, in build quality. Everything feels sturdy. There's very little flex on the screen and chassis. The one weakness, I would say, would be this hinge. It's built well, I'm not seeing any play here. But, the hinges are positioned closer to the center like this. So there's more opportunity for it to twist every time you open it up. There's soft touch plastic again. I was worried about this last year because, when you scratch it, it leaves a mark. But it seems to hold up nicely if you're careful. It does show fingerprints pretty easily though. It has a standard port selection for the price point. There's three USB-3's, HDMI, audio, ethernet, and an SD card slot. There's no USB-C port, so there's no Thunderbolt 3. It's super easy to get inside. Single screw, and you get two RAM slots. It's now running DDR4 memory, so speeds are a little bit faster. And you can go up to 32 GB because of this. The 2.5\" SATA drive is here, and there's an M2 slot for a second drive. Both of these drives are replaceable and/or upgradable. The battery's pretty big. It's 74 Wh, and it'll get you around 6 hours of battery life of normal use. If you're playing games, it's closer to an hour and a half. This uses a 1080P TN panel. It's the same panel as the 2014 Lenovo Y50, and it's not very good. It doesn't get very bright, and the color accuracy out of the box is weak. Calibration makes it better, but the viewing angles are poor. There's a very noticeable color and contrast shift when you tilt the screen both up and down, and left and right. Now, keep in mind that this is an $800 laptop with a GTX 1050 in it. They gotta make some compromises to sell it at that price. And in this particular case, it's the screen. It's not that the screen is like superbad or anything. I've definitely seen worse. But because of how good the rest of the hardware is, this sticks out as being the weakest link. So if you really need a good screen, you gotta upgrade this thing to the 4K panel It's obviously more expensive, but you gotta do that if you can't stand a mediocre screen. The webcam up top is 720P Looks okay. The keyboard feels really similar to last year's model. There's nothing I really dislike about it. The layout is good, backlighting is red, keys feel pretty comfortable. A little stiff on the response. You have to tap harder than normal, but it's a very good keyboard overall. There's one issue that's not really related to the keyboard itself. It's this bottom left corner. So, it's pretty pointy. My natural resting position doesn't hit it. But if you have big forearms, or if you have like a wide resting position for your left arm, this might bug you. The trackpad is good. It uses Windows Precision drivers. I like seeing that. But, it's a plastic surface again, not glass. The tracking is decent. It performs fine, it just doesn't feel premium. But the thing that makes this trackpad good is the click mechanism. It has good pressure activation, and it's a very snappy click. It's satisfying to use. When I'm playing games, my palm sometimes makes contact with the trackpad, but the palm-rejection software works well. Okay, so for $800, you're getting a Kaby Lake i5, and a GTX 1050. And if you want to bump that up to the 1050 Ti, it's an extra $100. And then, if you want the i7, like the quad core i7, it's $50 on top of that. Now, it doesn't matter, all of these are kind of like decent purchases. But, I would highly recommend trying to get the 1050 Ti, Because it's just a good value for what you're getting, in terms of gaming performance. So, compared to the 960M from last year, the 1050 is about 25% better. And then the 1050 Ti is another 25% on top of that. So playing on that chip, at 1080P, lighter games like Overwatch will comfortably float over 100 fps on high graphics. Bumping it up to Ultra will still get you over 60 fps. Titanfall 2 also runs near 60 fps, on high graphics, on the 1050 Ti. But basically most modern titles, as long as they're optimized, can hit 60 fps with very nice looking image quality, at 1080P. If you want to know more about these video cards, be subscribed and watch my next video. There's also something pretty special there. The thermal management is fine. There's no real CPU throttling during games. Idle fan noise is pretty quiet, and isn't too bad, even on load. But there's no option to manually control it. It's done automatically. Surface temperatures also comfortable. There's no nasty hotspots that I could see. Speakers are not bad. There's a pair up at the front, behind the red grill, with a sub on the bottom. They're pretty loud, and the lower frequencies from the sub are present. It's not super powerful bass or anything, but you can tell that it's there. All right, with the Inspiron 7567 from Dell, we're looking at a budget gaming laptop that uses a lot of plastic, but has surprisingly good build quality. The 1080P screen is a TN panel that looks decent head on, but has poor viewing angles and doesn't get very bright. The backlit keyboard is a little stiff, but it has a good layout. The trackpad is solid. Inside, the Kaby Lake CPU options, and the GTX 1050 or 1050 Ti, deliver very good gaming peformance for the money, and are well-cooled. The RAM and the two drive slots are incredibly easy to access for upgrades after purchasing. And the 74 Wh battery gives you around 6 hours of battery life. So, here's the deal. For $800, you're getting a device that can play most games at 1080P, at 60 fps or higher, with really good image quality. And if you want to, you can pay that extra $100. So that's, what, 10%, 12% more money, for 25% more performance with the Ti. So, if you wanna do that, I mean, I would kind of steer most people towards getting a 1050 Ti, But, if you can't, the base model's still really good. Overall, great device. Great components, aside from the display. Great build quality. Good performance. Good value. I think they did a really good job on this one. Hope you guys enjoyed this video. Thumbs if you did. Subs if you loved it. See you guys next time.",
    "transcript_keywords": [
        "good",
        "pretty",
        "screen",
        "Kaby Lake",
        "GTX",
        "red",
        "model",
        "year",
        "quality",
        "gaming",
        "fps",
        "games",
        "gaming laptop",
        "Kaby Lake CPU",
        "laptop",
        "Kaby",
        "Lake",
        "battery",
        "hit",
        "kind"
    ],
    "transcript_entity_values": [
        "Ultra",
        "HDMI",
        "2.5",
        "three",
        "800",
        "32 GB",
        "Windows Precision",
        "Dell",
        "60",
        "4",
        "an hour and a half",
        "this last year",
        "1080P",
        "Inspiron",
        "10%, 12%",
        "2014",
        "CPU",
        "another 25%",
        "100",
        "50",
        "one",
        "74",
        "7567",
        "second",
        "100",
        "last year",
        "TN",
        "GTX",
        "SD",
        "Overwatch",
        "M2",
        "two",
        "1080P",
        "2017",
        "the 960M",
        "7559",
        "Titanfall 2",
        "1050",
        "RAM",
        "Kaby Lake",
        "around 6 hours",
        "25%",
        "last year's",
        "Kaby Lake",
        "7567",
        "about 25%"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "PERCENT",
        "DATE",
        "ORG",
        "PERCENT",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "TIME",
        "PERCENT",
        "DATE",
        "FAC",
        "CARDINAL",
        "PERCENT"
    ]
}