{
    "id": "zQK_w4j8UGk",
    "title": "This is my new daily driver! - Promise87",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-09-13T20:07:51Z",
    "video_url": "https://www.youtube.com/watch?v=zQK_w4j8UGk",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "keyboard",
        "promise87",
        "build",
        "tenkeyless"
    ],
    "views": 357044,
    "likes": 12345,
    "comments_count": 1076,
    "description": "Get your next PC built with LYTE:   The Promise87 keyboard comes with a ton of customization options, immaculate packaging, and a moissanite gem embedded in the keyboard, but it also comes with a lofty price tag. Can Plouffe recommend this, or should you save your money?  Check out the Promise87 at:   Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Plouffe has expensive taste 0:26 Unboxing accessories/extras 1:51 Unboxing the keyboard 4:00 Exterior impressions 5:25 Sponsor - LYTE Gaming 6:04 Build timelapse 6:40 Pricing update and build quality impressions 7:35 Build experience impressions 8:49 Typing test and impressions 10:53 A wild Linus appears 11:30 Overall thoughts 13:00 Outro",
    "description_links": [
        "http://lytetechnology.com/shortcircuit",
        "https://promisetkl.com/",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Do you like expensive keyboards? I like expensive keyboards. And we've got a big old box from Wuque Studios. Makers of some other boards, like the Aurora and the Mammoth. Not the most expensive, but they're over $200, sometimes in the four or $500 range, especially for their- I think the Balance keyboard is like $465. We've got the Promise87 here in this box today. And it is- So far there's just been an interest check, I think. But they've sent us like an initial sample to take a look at. This box is pretty big though, so there's definitely more than just a keyboard in here. And I'm really curious to see what else they sent. Let's check it out. Oh, okay. So we got some switches. Don't know what these are, but they're boxy. Let me open one. They are lubed, which is great. I don't have to do anything. I mean, okay, if you do your own lube job, it's probably gonna be better in the long run. But factory lube, at least in my opinion, is like, okay, it's serviceable. Yeah. That's all right. I don't know what these are. They're just some linears. We've got a whole bunch of these guys. One, two, three, four, five. Okay. And then this is something else entirely. This is really heavy. What's in here? What? Oh, it's like a holder. That's actually great. I just complained recently about how I don't like most organizers because they're are pain in the ass to get everything into each individual socket. But with this, you can just put like, all your bottom housings here, all your top housings here, and then take- put the stems in there if you want to. Cool. I don't know if we'll use that for anything, but that's neat. Oh, we got more switches. Wow. Wait. No, these aren't switches at all. These are stabs. See, we've got some stabilizers as well as what looks like bandaid mod. I don't know what to call these anymore because you used to just call it band-aid mod. But these days it's, they've got an actual name for them. Basically. You just take those little tabs, kinda like the band-aid mod and you put 'em on your PCB and then you put your stabilizers over them. Oh, it's hefty. Let's get this ugly box outta the way. Oh my God. I can like barely hold it up with one hand. Yeah. I love the box already. It's got these nice pink or rose gold letters with a cool emblem in the center with like, I don't know weird angular hearts or something. You've got the Wuque Studio logo right there. And oh, a really minor detail is, if you can see this, it's angled, the slit down the side here. And that's because apparently the the bottom weight can be split. And then you get like two different kinds or something. Like you can get two different materials. We've got an engraving. So I think we have the more expensive version but I'm really curious to see and find out. Oh my God. So, we've got two boxes here. This little box, which I'm not sure what's in here. Looks like gaskets. One cool thing about this guy is they've got their new slip on gasket design. I haven't actually seen these yet. So instead of like applying your gaskets you just slip them onto the plate. Very, very cool. They've made these open source as well. So anyone can make them if they want to. I'm very intrigued to see how these feel. It looks like they've given us black and white options. This is probably just like a poly carb plate and some other stuff like that. Yeah. PCB probably as well. Ooh, this is very nice. I'll give them this. You know, you're paying a lot for this board. The packaging is absolutely beautiful. Look at this. You've got like a wax stamp. Oh, that's beautiful. So here's our foam. Here's our PCB. I think this was the plate right here. Yeah. And then this is more foam probably. Cool. That's all of our materials. Here's the big boy. Oh my God. Oh my God. Oh my God. It's so heavy. Oh. Wow. So it's like a little carrying case. Beautiful. Yeah, for the money, honestly you're- you're expecting a lot. And so far I'm kind of getting a lot. Oh my God. Okay. How does that look? Oh, we didn't get the design. I thought they were gonna give us a design. They're probably like, yeah, that's too much money. Basically. There's a bunch of different finishes. You can get like silver or gold. You can get this really cool one, like here. You can get a mirror finish as well. And then when you've got the 800 or the $900 version you can get an engraving too. So you do get a little extra for paying more. And then the big extra that we've got is this moissanite right here. It's got a USBC port right in the middle of the board. So if you prefer yours to the side, this might not be the board for you. This one is a TKL and it's being heralded as like the next level of customization in a TKL. I don't know how much I agree with that but there are a number of features that you can customize. So basically these little accents here with the moissanite, you can get them in silver or gold or the same color as the case. And then you can change them here. You can change them here And you can also get different chamfered edges. Looks like we've got the silver ones. I'm gonna take this thing home and build it. And then I'll give you guys a much better understanding of how the build experience went, how the quality of all of the little extras we've got are, like the stabilizers and whatnot, and the switches, I'll use the switches they included as well. And then I'll give you all the whole rundown on how it feels and whether or not I think it's worth, well this one particularly, $900. But, first a word from our sponsor. LYTE Gaming. LYTE offers both pre-configured and custom PCs, build kits and custom accessories. They focus on being a hundred percent transparent with their prices. Such as their builds where they show prices for each part and their nominal $100 build fee. On top of that, they offer build kits. Where pre-selected parts are delivered to you for building. Taking away the stress of tracking each part down. Each LYTE PC comes with a one year warranty and a 30 day free return period, alongside quick replacement service, in case you need it, with shipping fully covered. Check out LYTE at lytetechnology.com or by using the link in the description below. Okay, I'll be right back. (upbeat guitar music) Yeah. So I built it. Built the Promise87. It's pretty sweet. I have a couple complaints but mostly it's all praise. Particularly because, the biggest news is they've actually lowered the price. I talked to someone from Wuque recently and they said, yes the group buy price that we originally posted on Reddit is not what we're going with. Oh man, it does look nice. It's uh- it's gonna be I think $380 for the regular version. And up to 570 for the bespoke version with all the bells and whistles. Which is expensive, that's still a really expensive keyboard but it's not $1,000, $900 expensive. If I was, you know, talking about this from the $900 price point, I would say, it's not worth it. It's a really nice keyboard. And I think at 380 or even $500, it is really good. But yeah, take a look at this thing. We didn't have a full key cap set. They sent us most of that Irish set, like I showed you guys. Which was like specialty keys and like control and stuff like that, but it didn't have alpha numeric. But in the meantime, what we got was our ceramic. We got our ceramic key caps from Cerakey. And I'm really excited to say that I actually rather enjoy them. As for the build experience itself. It was pretty solid. I- my one issue is, I tried to insert every screw a little bit and then tighten it all down. And what happened to me was, I had the top two inserted first and I pressed down a little bit and I'm pretty sure I stripped a tiny bit of the housing inside. So these two screws right around here are not fully seated. Everything else is screwed down nice and tight. And it's still pretty good in terms of like tolerances on the case. But you can see here in this top left corner that ours isn't fully closed. And you can close it with your hands. And I tried that. I tried pressing down as much as I could. Thought maybe just the top- what do you call that, tooth on the screw was just not there anymore. And I figured, oh I push down and get it to seat, but no, not quite, but it's still really good. And the reality is I really like it. I kind of want it at my desk. We should probably do some kind of typing test now. And it feels really great. We use their Wuque Aurora switches. They sent a whole bunch of those. They're just a linear switch. And I like the feel of them. I like the sound of them. Let's type on it. Can we type on it? Where's the typing tool? Where's the laptop? Give me the laptop. One of the nice little features is there's actually an RGB or I don't know if it's RGB, but there's an LED below the moissanite. And so it shines red, just barely. I don't know if you can turn that off or not. Another nice thing about the ceramic key caps is they have really good light shine through, apparently. And you can see here, there's not a bunch of RGB on this board to show you that, but the Caps Lock lights up. And the light is all the way on the left, so there's only that one portion there. But I have to think that a full RGB keyboard is actually gonna shine pretty nicely. As for the feel. I like it. It's like glass, kind of. And now I want glass keys just to try those, but they're pretty heavy. They sound really nice. My only issue is there's no bump for the home row. So if you're trying to find it blind, that can be a little tough. But like, going from the- I think they're PBT at the top here that came with this and then down to the ceramic, it just- your hands kind of sit in them really nicely too. They don't, there's not, they don't slide away very much. So there's kind, they're kind of grippy in a sense. But yeah, let's type on it and see how it sounds. (keyboard clicking) 112, 97%. It's not my fastest, it's not my most accurate. But, man I like these things. When you've got the ceramic, as soon as your fingers start to sweat, they do get a little slippery. So, based on this really quick test, I can't tell you whether I really like them or not. I know that I like the sound and the initial feel and I do like the look. So, I'll have to test drive them a lot longer to give you a more definitive answer. The only other really minor issues that happened with this unit, probably because it's an early sample. Ours came with the feet pre-installed and then it didn't come with any sort of Allen key. So I, luckily, had keys at home and it was fine. I could tighten everything down, no problem. But that was an issue. And then on top of that, it doesn't come with a cable. You're paying a lot of money for a very expensive keyboard that does not come with a cable. But the reality is, you're going to instead buy your own that then fits in that. Hey Linus, you wanna try to type on the really nice keyboard? - Did you just justify it not including a cable? - Yeah, because you're gonna want to buy your own that matches the keyboard and your desk set up. - Well, why don't they provide one that matches the keyboard? - They could, yeah. - Hmm. - Yeah. - There's no bumps on the home row. That's stupid. - I mentioned that already. Those are ceramic key caps. Okay. Let's give it a quick weigh and see how heavy it is. It's gotta be like at least 10 pounds. Maybe not 10 but it's pretty close. 8.2 pounds. So not quite 10, but it's a pretty hefty piece of gear. I'll be frank, if I didn't already own a $500, $350 keyboard, I would be very tempted to buy this. I've actually already convinced one or two people to at the very least think about it once the group buy opens. Yeah, I love it. I would get it if you can and you don't already have a big TKL that you really want, like a nice higher end one. This could be the option for you. It's gonna come in a bunch of different colors. Even if you don't pay the extra to customize it they will have like the most popular ones kind of pre-made that you can choose from. The plate is maybe something I would change. Ours came with an extra poly carb plate. So I would maybe try that out instead just to see if I prefer it. But otherwise, it's pretty sweet. As for the key caps themselves. These are a completely different product from a completely different brand. I like them. They are expensive. I don't know if I would personally- Well, no, that's not true. I Kickstarted them. So I've got my, I've got my own set coming but at a reduced price because of the Kickstarter price. I think mine were like $100 or something. The full Indiegogo price is $140. These do come in a number of different styles. Right now we've just got white with legend. But they come blank. They can come glazed with a number of different colors and options. I think I got a blue set with legend on the way. And yeah, that is the Promise87 from Wuque. I really like it. I think that it's definitely a good keyboard. Justifying spending that much money can be difficult but if you're into the hobby then yeah, maybe pick it up. Thanks for watching ShortCircuit. If you wanna watch another video about a keyboard that I don't necessarily recommend but I do like for the aesthetics, check out the POP Keyboard from Logitech.",
    "transcript_keywords": [
        "Yeah",
        "keyboard",
        "pretty",
        "nice",
        "expensive",
        "God",
        "kind",
        "Wuque",
        "give",
        "top",
        "key caps",
        "key",
        "box",
        "ceramic key caps",
        "price",
        "switches",
        "build",
        "expensive keyboards",
        "Cool",
        "ceramic"
    ],
    "transcript_entity_values": [
        "USBC",
        "Reddit",
        "500",
        "Wuque Aurora",
        "570",
        "TKL",
        "Wuque Studios",
        "three",
        "One",
        "380",
        "over $200",
        "one",
        "Wuque",
        "Caps Lock",
        "140",
        "at least 10 pounds",
        "465",
        "LYTE Gaming",
        "Logitech",
        "Indiegogo",
        "900",
        "112",
        "Kickstarter",
        "four or $500",
        "380",
        "Irish",
        "30 day",
        "1,000",
        "100",
        "Allen",
        "Aurora",
        "10",
        "8.2 pounds",
        "first",
        "97%",
        "these days",
        "two",
        "Built the Promise87",
        "Cerakey",
        "350",
        "four",
        "one year",
        "Wuque Studio",
        "a hundred percent",
        "RGB",
        "Linus",
        "ShortCircuit",
        "five",
        "PCB",
        "Mammoth",
        "LYTE",
        "today",
        "800"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "NORP",
        "DATE",
        "MONEY",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL"
    ]
}