{
    "id": "ZRmRamdNFHg",
    "title": "Dell XPS 13 9350 Review (Skylake) - Is it still the Best 13\" Ultrabook?",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2015-12-24T16:29:34Z",
    "video_url": "https://www.youtube.com/watch?v=ZRmRamdNFHg",
    "category": "Science & Technology",
    "tags": [
        "Review",
        "XPS 13",
        "Skylake",
        "Broadwell",
        "9350",
        "9343",
        "Macbook Air",
        "XPS 13 versus Macbook Air",
        "QHD Screen",
        "InfinityDisplay",
        "Lightest Laptop",
        "Dell Ultrabook",
        "Ultrabook Review",
        "Dell"
    ],
    "views": 592419,
    "likes": 8263,
    "comments_count": 632,
    "description": "The Dell XPS 13 had LOTS of bugs at launch that have been fixed with recent updates. Finally.. my review of the updated Skylake XPS 13 9350 Laptop. Enjoy! Purchase here -   A review covering an unboxing, build quality, internal hardware, screen, keyboard, trackpad. With gaming performance tests.  Specs of unit: i5/8GB/256GB/HD520   Is the Skylake update worth it? Is it the best ultrabook? Is it faster than the broad well version? Watch this video to find out! =)  Be sure to check out my other ultrabook and 2-in-1 reviews: Surface Pro 4 -  Surface Book -  HP Spectre -  Yoga 3 Pro -    Music Credits:  Intro: Robotaki - Raton Laveur Background: FILI - H2O  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/1QOkZSB",
        "https://youtu.be/i_HzXNRI1DE",
        "https://youtu.be/57ISNozMfYk",
        "https://youtu.be/mH_swkTcsFw",
        "https://youtu.be/9F1k53y4Rf8",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, How's it going, guys? This is Dave2D and this is my review of the Dell XPS 13. So this has been updated to Skylake. It's the 9350 model. I did a review earlier this year on the 9343 model, but because they're so similar, I'm not going to do like a super comprehensive video on this one, but I've been using it for the past couple of months and I wanted to highlight some things that they've changed and some things that haven't changed. Let's do it. Ok, so it comes in the same black boxes before there's no accessories and the same 45 watt AC adapter with its cool light up tip but the 3-position duck head from before was discontinued so you have to just use this long extension cord. The exterior is unchanged, it's got the same premium aluminum finish on the exterior with that air intake and the serial number hatch on the bottom the screws come off but just like the previous generation only the storage drive is upgradable, the ram is soldered on. The build quality hasn't changed: everything is still really well engineered and it feels tight and rigid. It's good stuff! The ports on the outside are unchanged for the most part and the only noticeable difference is the mini display port which has been replaced with a USB 3.1 type C lightning port. So this port has a ton of bandwidth and has potential for future connectivity. The laptop can also be charged using this port if you have an appropriate charger. The unit I have here is a Core i5 6200U running at 2.3GHz, a 13.3 inch QHD touchscreen, Intel HD 520 graphics 8 Gigs of RAM, 256 Gigs of storage, all for $1400 and going with the 1080p screen instead of the QHD screen will save you about $300-$400. Opening it up you get the same carbon fiber material as the previous generation. It's durable, it looks good and it has a nice rubbery finish to it. I love this stuff. The screen options are the same as before, so my review unit last time had a 1080p screen which is good but nothing super special! This unit here has the Quad HD screen, now this higher res screen doesn't come cheap and it drains batteries quicker but it's really nice so it's an IPS panel with great color reproduction, good viewing angles and it's really bright like brighter than a 13-inch Macbook Pro. Both of these screen options still have this amazingly thin bezel which is like the signature feature of the XPS line right now and the webcam is still down here. But it doesn't bother me too much. The keyboard hasn't changed! It's a decent backlit keyboard and the typing experience is something that most users will get comfortable with after a little bit of use. The glass trackpad is unchanged in terms of the hardware but there's been a slew of updates since the first iteration launch. So if you were an early adopter of the XPS 13 back in February and you hated this track pad it's had significant improvements since then. It's still not an amazing track pad and the one of the XPS 15 is noticeably better, but for 13 inch Windows-based ultrabook this one's pretty good now. Drive performance has improved, the previous generation used an M.2 SATA slot, this one uses a PCIE slot, which is a much faster interface, but the drive they have in here is the 256 gig PM951 drive from Samsung. And if you've seen my XPS 15 review, its right speed is a little slow for a PCIe drive, it's still a step up from the previous generation, but if you need super fast write speeds, you should upgrade this. The interface can push much faster write speeds. The new SkyLake processors are faster and more energy efficient, cpu performance is around 10/15 percent better than Broadwell chips, but combined with the new HD520 graphics, it's around twenty percent increase in gaming performance. At least theoretically. It's not a gaming laptop but lightweight games can hit 50 to 55 frames per second at 1080p if you're running on low graphics settings, but moderately demanding games like Rainbow Six or Fallout 4, those get around 35 to 40 frames per second on low graphics settings and really demanding games like Witcher 3 are basically unplayable. Speakers are the same as before, they sound pretty good and they get loud and the fan noise has improved a lot. It still idles at around 20 decibels but under load this thing is much quieter than before. The older model used to break 40 decibels, now it's around 30 decibels. The thermals haven't changed. It still gets a little warm but it's not too bad. There's a slightly bigger battery on the inside now. It used to be a 52Wh battery, now it's a 56Wh battery and for the first month I used this I was actually getting less battery life than the previous generation. But in early December a BIOS update came out, which fixed a battery drain bug. So now the battery life is very similar to the previous generation, with screen at seventy-five percent brightness, you can expect around eight hours of regular use on the quad HD screen. And about 10 to 11 hours of regular use on the 1080p screen, and also got around two hours of playing games with screen at maximum brightness. So with the updated XPS 13 we're getting the same aluminum and carbon fiber materials with excellent build quality. We're going have the same screen options as before, both of them with that super thin bezel. The 1080p screen is good, the quad HD screen is great. The keyboard and trackpad are unchanged but the trackpad software has improved significantly over time, they're both pretty good now. They're running SkyLake chips now that are slightly faster than the Broadwell chips and they support USB 3.1. The RAM still isn't user upgradeable, so make sure you get enough when you order and the storage drive is still upgradeable and now it uses a much faster PCIe interface. The battery life is really solid for an ultrabook and lasts about the same as the previous generation. So to wrap this up, this is still my favorite 13-inch Windows-based ultrabook. It's not a super budget-friendly device, but it's really well built, it's got a good performance and looks good and it's actually one of the few devices that have top-tier build quality top tier performance at a reasonable price. That's the end of this review. Hope you guys liked it. Thumbs if you did, subs if you loved it. It's been nice, I'll see you guys next time.",
    "transcript_keywords": [
        "screen",
        "previous generation",
        "good",
        "XPS",
        "previous",
        "Dell XPS",
        "generation",
        "battery",
        "screen options",
        "drive",
        "pretty good",
        "changed",
        "review",
        "faster",
        "super",
        "performance",
        "port",
        "battery life",
        "ram",
        "unchanged"
    ],
    "transcript_entity_values": [
        "HD520",
        "40 decibels",
        "Dell",
        "XPS 15",
        "SkyLake",
        "Rainbow Six",
        "6200U",
        "around 30 decibels",
        "PCIE",
        "9350",
        "M.2 SATA",
        "the first month",
        "about 10 to 11 hours",
        "around 20 decibels",
        "one",
        "AC",
        "Macbook Pro",
        "Samsung",
        "2.3GHz",
        "13.3 inch",
        "XPS",
        "Witcher",
        "Broadwell",
        "around twenty percent",
        "56Wh",
        "9343",
        "second",
        "1080p",
        "35 to 40",
        "1400",
        "around eight hours",
        "Core",
        "QHD",
        "256",
        "Fallout 4",
        "a ton",
        "13 inch",
        "3",
        "first",
        "IPS",
        "about $300-$400",
        "13-inch",
        "XPS",
        "seventy-five percent",
        "52Wh",
        "3.1",
        "RAM",
        "50 to 55",
        "February",
        "SkyLake",
        "USB 3.1",
        "around two hours",
        "Skylake",
        "Intel",
        "earlier this year",
        "15",
        "around 10/15 percent",
        "XPS 13",
        "8",
        "early December",
        "45 watt",
        "the past couple of months",
        "1080p"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "LOC",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "FAC",
        "LAW",
        "TIME",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "CARDINAL"
    ]
}