{
    "id": "ZUDHLP1JMZE",
    "title": "$2,300 iPhone Case?!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-01-26T16:16:31Z",
    "video_url": "https://www.youtube.com/watch?v=ZUDHLP1JMZE",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iphone xs case",
        "most expensive iphone case",
        "gray international"
    ],
    "views": 771963,
    "likes": 15556,
    "comments_count": 2322,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today, we are checking out a very expensive iPhone case. The contents of this box is $2,283 for an iPhone case, and you might be like, \"Justine, have you officially lost your mind?\" These are sort of more like an art piece, like you buy an expensive piece of art, you're paying for an expensive piece of art. So if you like art, buy art. If you like expensive iPhone cases, I guess buy expensive iPhone cases. What's so special about these is they are in limited quantity and they are made of aerospace titanium. So does that mean that my phone can go to space? This also comes in a titanium color, a stealth, a gold, and an aurora, and the one that I got is gold, so they did send me this to check out. They also sent me one of their cases before that I was super in love with, so let's just open this up. (gasps) I mean, this case alone feels like a million bucks. I'm so excited. This is so industrial. Like, look at this. Wow. Oh my gosh, and there's like, the pieces to, like, put it all together. So just take a look at this. Grade five titanium. There's little screws. I'm assuming this is right where you unscrew and then you have to actually screw this into your phone. This is gonna look so good. I mean, it better look good because I could buy 17 iPhones for that. My god, look at this tiny little screwdriver. (gasps) This is so cute. What's in here? More extra screws. This is cool; look at this. It's like a little card. This is so sharp. \"A person who follows the crowd is doomed \"to go no further than the crowd.\" That's actually a really great quote. So let's put this on our phone. Oh my gosh. It's so beautiful. I hope it's for the 10S Max or I'm gonna have a problem. Oh shoot, is this for the 10S? (exclaims) I bet it is, guess what? So I have a 10S. Yeah, that's a problem because it's for the 10S, not the 10S Max. So I guess the good news with that is that means that this one is actually cheaper than this, the 10S Max version. I think it's like $100 less. I wish that it would fit on my phone. I mean, this is also my phone. That's upside down. I have done it wrong. I've missed something. This is what you need. You need these little bumpers. I was like, \"This isn't right.\" So you put this on first. Oh yeah, there we go. That fits much better. It looks so cool and futuristic. Like, my phone looks like, I don't know, a Power Ranger or something. Oh, I love how this feels, too, 'cause it's like a nice grip. I wish this was for the 10S Max, but honestly, this looks great. Like, this looks so cool. But since it is the 10S, it's a little bit cheaper. Let me see how much this one is. It is $2,283 whereas the 10S Max is $2,531. If you wanted to buy both of them, it would have been $4,813. Oh my gosh. Anyway, thank you guys for watching. I just wanted to show you this case because I feel like it is definitely something that is a work of art. I love the aurora color that they had, too. It's kind of like a purplish tint. This is number nine of 100 of these cases, so there's only 100 of these out there. How much do you think is too much for an iPhone case? I would love to hear. So I'm on the website right now, and I'm reading. It says, \"Aerospace grade titanium. \"It has two blocks of aerospace grade titanium. \"The intense four-axis operation requires 12 hours \"to undertake overseen by one of our most trusted artisans.\" If you had this, you could also have a cryptocurrency wallet. Like, how much is that? Okay, let's see, the gold cryptocurrency wallet. Oh, that's only $1,500 for the gold one, so right now I have a cryptocurrency wallet and I have two iPhone cases with a total of $6,300 and some dollars. (gasps) (exclaims) Let me know if there's anything else crazy that you would love for me to check out. I mean, this is pretty insane, but all things considered, it is really beautiful. Like, it does look so good on my phone. I even love this case. Like, wow. It looks so good. I will see you guys in my next video. If you're not subscribed, be sure to do so already and make sure you hit the bell because I think that's the only way that you'll get notifications of when I post a new video. Super, super excited for 2019 tech. I keep saying that, but it's like, I'm just, like, counting down the days until all of the cool stuff starts coming out. Really, the end of last year, it was just so overwhelming with everything. There were so many phones. (beep) What is that sound? Like, what is that? I don't know. Well, I'm gonna go and investigate. See what that sound was, and I'll see you guys later. I'm gonna go put this in a safe somewhere. Very, very precious cargo. (gentle, peaceful music)",
    "transcript_keywords": [
        "expensive iPhone cases",
        "expensive iPhone",
        "iPhone case",
        "art",
        "buy expensive iPhone",
        "expensive",
        "Justine",
        "Max",
        "iPhone",
        "phone",
        "case",
        "cases",
        "buy",
        "expensive piece",
        "love",
        "titanium",
        "good",
        "guess buy expensive",
        "buy expensive",
        "buy art"
    ],
    "transcript_entity_values": [
        "2,283",
        "6,300",
        "only $1,500",
        "one",
        "17",
        "12 hours",
        "Justine",
        "only 100",
        "iPhone",
        "100",
        "the end of last year",
        "the days",
        "10S",
        "100",
        "4,813",
        "a Power Ranger",
        "four",
        "number nine",
        "five",
        "today",
        "two",
        "2019",
        "million bucks",
        "2,531",
        "first",
        "Max"
    ],
    "transcript_entity_types": [
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "MONEY",
        "ORDINAL",
        "PERSON"
    ]
}