{
    "id": "zV2VEOHNCJU",
    "title": "Goodbye, Adobe Flash ☹",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-01-02T01:54:57Z",
    "video_url": "https://www.youtube.com/watch?v=zV2VEOHNCJU",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "2021",
        "Adobe",
        "Flash",
        "Adobe flash",
        "dead",
        "flash is dead",
        "Adobe kills flash",
        "flash support",
        "flash support ending",
        "end of support",
        "flash games",
        "play flash games",
        "flashpoint",
        "INternet Archive",
        "best flash cartooons",
        "best flash",
        "games"
    ],
    "views": 735557,
    "likes": 46541,
    "comments_count": 2110,
    "description": "Head to  and activate Honey for free to start saving today! Thanks to Honey for sponsoring this video.  Watch the Techlinked Christmas Special!   GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   Timestamps:  0:00 New Years Realization 0:11 Flash is dead. 1:11 Foldable iPhone rumors 2:02 Intel could outsource CPU manufacturing 3:07 Honey 3:41 QUICK BITS 3:47 New RTX GPUs incoming 4:12 EU wants to make CPUs 4:42 Windows 7 is the Nazgul 5:08 Chinese apps + stuff 5:33 Ticketmaster fined for sucking  NEWS SOURCES  OUT OF FLASHION Adobe flash      FOLD AN APPLE? THATS A PIE Foldable iPhone prototypes      ITS TIME TO STOP Major Intel stakeholder tells Intel its time to outsource manufacturing      QUICK BITS  DONT RAYS YOUR HOPES RTX 3080 Ti models spotted  RTX 3050, 3050 Ti, 3060 on the way    WELL CALL THEM CHEUPS Apples even got the EU wanting to make its own chips    GET OUT OF THERE, ITS DANGEROUS Why cant I quit you, Windows 7    SIBLING RIVALRY Huawei fought with Tencent? But theyre both Chinese  Meanwhile Apple has to remove 90,000 games from the App Store   PILFERMASTER Ticketmaster hired competitors employee, then hacked their networks with his login   ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "http://joinhoney.com/techlinked",
        "https://youtu.be/Fd1sXtkzgHw",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://linustechtips.com/topic/1288284-rip-adobe-flash-you-changed-the-internet-forever-but-you-will-not-be-missed/",
        "https://www.bbc.com/news/technology-55497353",
        "https://www.howtogeek.com/700229/adobe-flash-is-dead%C2%A0heres-what-that-means/",
        "https://www.fastcompany.com/90590201/how-to-use-flash-to-play-old-games-after-adobe-discontinues-it",
        "https://www.macrumors.com/2020/12/31/two-foldable-iphones-reportedly-pass-tests/",
        "https://pocketnow.com/two-foldable-iphone-designs-have-allegedly-passed-internal-durability-tests",
        "https://appleinsider.com/articles/20/12/31/foldable-iphone-may-use-geared-hinges-to-fold-inwards-or-outwards",
        "https://www.techradar.com/news/apples-foldable-iphone-is-once-again-tipped-to-show-up-in-2022",
        "https://arstechnica.com/gadgets/2020/12/activist-hedge-fund-advises-intel-to-outsource-cpu-manufacturing/",
        "https://www.cnn.com/2020/12/29/tech/intel-third-point-letter/index.html",
        "https://techcrunch.com/2020/12/30/third-point-intel-venture-fund/",
        "https://www.ft.com/content/afa50509-afbc-4e7c-b57d-ac74ccbc6e6f",
        "https://www.kitguru.net/components/graphic-cards/matthew-wilson/gigabyte-and-aorus-rtx-3080ti-models-spotted-on-eec/",
        "https://linustechtips.com/topic/1287971-lenovo-confirming-support-for-new-rtx-30-series-cards/",
        "https://videocardz.com/newz/lenovo-confirms-geforce-rtx-3050-ti-6gb-rtx-3050-4gb-and-rtx-3060-12gb",
        "https://linustechtips.com/topic/1287864-eu-made-cpus-eu-signs-%E2%82%AC145-billion-declaration-to-develop-next-gen-processors-and-2nm-technology/",
        "https://ec.europa.eu/digital-single-market/en/news/member-states-join-forces-european-initiative-processors-and-semiconductor-technologies",
        "https://www.zdnet.com/article/windows-7-a-year-after-the-end-of-support-deadline-millions-choose-not-to-upgrade/",
        "https://hexus.net/tech/news/software/147214-windows-7-nears-eol-anniversary-still-100-million-users/",
        "https://www.engadget.com/huawei-removes-tencent-games-following-dispute-111228570.html",
        "https://www.reuters.com/article/us-apple-china-games-idUSKBN2950P1",
        "https://www.theverge.com/2020/12/30/22206955/ticketmaster-songkick-crowdsurge-hacking-deferred-prosecution-fine",
        "https://variety.com/2020/digital/news/ticketmaster-10-million-fine-hack-songkick-competitor-1234877108/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Okay, no resolutions, but I do have a new year's realization. - [Colton] What's that? - Do you want to hear it? - Yeah. - With the vaccine rolling out, I've never been more excited to have strangers breathe on me again. New year, new internet. And unfortunately, for some, that means websites devoid of Flash. Yep. Adobe officially discontinued support for the venerable web plugin. Are you sad? - I'm sad. - Which enabled endless animated cartoons games and security problems. Because unlike \"Homestar Runner\", hackers do have hands. What was your favorite Flash thing, Colton? Seems like you were remembering something. - [Colton] Games, all the games. - Every game. (Colton mumbles inaudibly) You played every game? (Colton laughs) Wow. Flash is no longer available to download. Although Adobe won't actually start blocking Flash content from running until January 12th. But don't worry, there are actually a lot of ways to keep the Flash fire burning including desktop players like Flashpoint and the internet archive, which will keep thousands of games playable online, via emulation. So you can be reminded of a simpler time when the most entertaining thing you could find on the internet was stick figures murdering each other in frankly, awesome ways. - Stick Tack that's the one! - Yeah. - Yeah. - It was like Shao Shao, I think it was called. Apple, in their infinite wisdom has apparently deemed that the world is ready, now it's ready for foldable phones. Reports are emerging that not one, but two foldable iPhone prototypes have passed internal tests for durability. One with two separate displays connected by a hinge that may be able to fold forwards and backwards. And another clamshell style phone with a truly foldable screen about the size of the Galaxy Z flip or Motorola Razr. Insiders seem to think that Apple will go with just one of these designs which may or may not be called the iPhone flip. But I don't think that's true. They wouldn't just let Samsung have the satisfaction of knowing that they copied their name. That wouldn't be revolutionary at all. Well, whatever the phone is called we may see it launch in 2022. There's lots of mays and mights in this story. You know, Colton, you shouldn't be so wishy-washy in 2021. - [Colton] I'll try. - Just take a stand. - Maybe. - like Apple. - Maybe. Have the courage. And one Intel stakeholder has taken a stand and told team blue that it's time to stop. That is to stop trying to manufacture their own chips. That stakeholder is Daniel Loeb, founder of activist hedge fund Third Point, which recently acquired a nearly $1 billion stake in Intel. In a letter to Intel's chairman Loeb argues that Intel has fallen behind its manufacturing competitors such as TSMC and Samsung, who are already working on five and three nanometer process nodes. While Intel has gotten stuck at seven nanometers. Pfft. I can do seven nanometers. Colton does seven nanometers- - Every day. - Every day, he wakes up, seven, seven nanometers. (grunts) But the real hurtful stuff is when Loeb points out that Intel management gave themselves extravagant compensation packages this past year while the company lost $60 billion in market value. Dang boy! Now Intel had already said they're considering outsourcing CPU production but this letter might just tip the scales. Sometimes you just need a letter from an angry rich person to give you a kick in the pants. I'm sorry, Elon Musk I'll do better. Now it's time for quick bits brought to you by Honey, the free shopping tool that finds the best promo codes whenever you shop online. \"Oh sure\", you say, \"but not where I shop\". Well, I don't know whether you exclusively shop at Walter's knickknack shop down by the river, but Honey works on over 30,000 sites, including Amazon, eBay, Newegg, Razor, Best Buy, Walmart and more. And it's free because Honey gets a small commission from sites where you use them to save money. It's easy to use and installs in just two clicks. So there's literally no reason not to use it. Get Honey for free right now at join honey.com/tech link or at the link below. Wait. You're telling me we've done 2021 quick bits. Incoming graphics cards watch out! Listings for G-Force RTX 30 ADTI models from gigabyte have been leaked and Lenovo let slip some specs for the RTX 3050, 3050 TI and RTX 3060 non-TI all of which are unannounced. Nvidia's having a gaming focused event on January 12th. So they've got to announce some of these. We all know they're coming and that there won't be any stock. So why are we even talking about this? Apple making its own processors has started a trend in the tech industry. And now the European Union is jumping on with the signing of a declaration to allocate 145 billion euros towards the design and manufacture of semiconductors built on two nanometer process nodes. That's a lot of euros and frankly, I don't know how they're going to eat them all before they go bad. That was the only joke I could think of for that one. Euros kinda sounds like eeros. - I got you. - Flash just died, but windows seven has continued to exist in some kind of wraith-like state after Microsoft officially ended support for the beloved operating system one year ago. ZD Net found that there may be over 100 million users still using Windows seven, despite Microsoft doubling the cost for extended support this month. They are neither living nor dead, they care not for money, only Windows Media Center. Due to a breakdown in negotiations Huawei pulled games made by Tencent from its app store, but that's not supposed to happen, they're both controlled by the Chinese government aren't they? Well, a day later Huawei restored the games, So I guess Daddy CCP made them kiss and makeup. Meanwhile, since the summer, Apple has pulled about 90,000 games from its Chinese app store that weren't granted a license by Chinese authorities. So that's authoritarianism for you. And Ticketmaster has agreed to pay a $10 million fine for hiring the employees of its competitor CrowdSearch and using their logins to infiltrate CrowdSearch's network and steal information with the intention of choking off the smaller company's business. Awesome. That's awesome. That's what I need to start off my new year with. I know it's shocking, right? We don't need to start off the new year with a reminder that people are horrible. Great! Why did you put that story in Colton? - [Colton] I'm sorry. - I'm so frustrated. This episode needs to end. So come back on Monday for more tech news. Oh, but also if you want to check out what we think the biggest stories of the year were check out the Christmas special. I wear a robe. Colton was there too. - [Colton] It was fun. - So if you want to hang out. - [Colton] Are you Santa Claus? - Am I Santa Claus? That's a reference.",
    "transcript_keywords": [
        "Intel",
        "Flash",
        "games",
        "year",
        "Apple",
        "Colton",
        "year realization",
        "Honey",
        "nanometers",
        "Santa Claus",
        "Loeb",
        "RTX",
        "Chinese",
        "shop",
        "Intel chairman Loeb",
        "windows",
        "Yeah",
        "internet",
        "game",
        "resolutions"
    ],
    "transcript_entity_values": [
        "two nanometer",
        "five and three nanometer",
        "Loeb",
        "2021",
        "the European Union",
        "Amazon",
        "Pfft",
        "Colton",
        "Walmart",
        "Samsung",
        "CrowdSearch",
        "Chinese",
        "Nvidia",
        "Homestar Runner",
        "2022",
        "30",
        "Galaxy Z",
        "Walter",
        "seven nanometers",
        "Lenovo",
        "Tencent",
        "G-Force",
        "this past year",
        "about 90,000",
        "this month",
        "Newegg",
        "$60 billion",
        "Adobe",
        "the year",
        "two",
        "over 30,000",
        "Elon Musk",
        "Monday",
        "eBay",
        "January 12th",
        "3050",
        "3060",
        "CPU",
        "Third Point",
        "Colton",
        "one",
        "iPhone",
        "Honey",
        "ADTI",
        "the summer",
        "Huawei",
        "Windows seven",
        "Shao Shao",
        "145 billion euros",
        "Microsoft",
        "Flashpoint",
        "thousands",
        "Daniel Loeb",
        "Ticketmaster",
        "$10 million",
        "Santa Claus",
        "the new year",
        "Best Buy",
        "Apple",
        "nearly $1 billion",
        "seven",
        "Windows Media Center",
        "Intel",
        "One",
        "New year",
        "Motorola Razr",
        "TSMC",
        "Colton",
        "TI",
        "one year ago",
        "Razor",
        "Stick Tack",
        "a day later",
        "just two",
        "Flash",
        "Christmas",
        "a new year's",
        "CCP",
        "Colton] Games"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "GPE",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG"
    ]
}