{
    "id": "zV7y4Oex1DQ",
    "title": "2022 Tech I'm Ready For!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-01-05T20:55:27Z",
    "video_url": "https://www.youtube.com/watch?v=zV7y4Oex1DQ",
    "category": "Science & Technology",
    "tags": [],
    "views": 2955536,
    "likes": 111503,
    "comments_count": 4753,
    "description": "The best tech upcoming in 2022! Sponsored by Cash App: Download from App Store/Google Play store - Use code MARQUES for $15 and $10 goes to Girls Who Code!  Mark Gurman's newsletter:   MKBHD Merch:   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "https://www.bloomberg.com/account/newsletters/power-on",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat synth music) - Okay, 2022. There's no way it's not better than 2021, right? Right? Hi, what's up? MKBHD here. We made it to 2022, all right? So, there was plenty of tech happening still in the past year. In 2021, we had some truly great new computers. We had plenty of interesting and unique smartphones. The mirrorless camera world took a step up. There were a bunch of good EVs and a bunch of even better EV promises. The PS5 is a whole year old and still impossible to get. But now, it's time to look forward. This is a little tradition I've started, at sort of the beginning of each new year, where I look forward at the next year in tech. Actually, usually there's a bit of a frenzy right at the beginning of the year, in the form of CES in Las Vegas, every January. This is actually the first year in like a decade that I'm not going to CES. As fun as it probably still could be, it doesn't seem like the most responsible thing to go do for me right now. But nevertheless, I just looked at the calendar, there's a lot of new fun tech to look forward to for 2022. So, I'm just gonna start off at the top of my list, which is Apple Silicon. So, the Mac transitioned to Apple Silicon, started in June, 2020. It was announced onstage at WWDC, and they said onstage that this transition would take two years. That announcement was a year and a half ago, so they gotta be finishing it up now, right? So we have an Apple Silicon MacBook Air, MacBook Pro, baseline iMac, next up or last up, would be a bigger iMac or iMac Pro and the tower, the Mac Pro. So the iMac Pro, I think, probably has the simplest formula, right? All they really have to do is put the new M1 Pro or M1 max chip in there, and then give the larger display with the squared off design, kind of like the Pro display XDR. You probably also give it black bezels, and a higher fresh rate and call it a day. I mean, a couple extra ports, and mag safe, and keeping the SD card slot and the headphone jack would also be great. That's a new iMac. We've seen lots of mock-ups and renderings of what something like this could look like. Some of them have a notch, some of them don't. I mean, on a display that big, you probably don't need to do a notch cut out, but I could totally see them doing it. Either way, I think that iMac Pro will be great for a lot of people, and I think it will be very tempting for me, but I won't be switching to it because I'm waiting for the tower. So, the developing background information seems to be pointing toward a pretty beastly Apple Silicon Mac Pro finally coming this year. It would actually be smaller than the current Intel Mac Pro tower, since Apple Silicon is so efficient, but would also be for sure the new largest chip they've ever made. We're looking at up to a 40 core CPU and 128 core GPU. Really, the main reason I'm so excited for these machines, is we've seen what is so impressive about Apple Silicon in the past, which is that they're so powerful and so efficient compared to these Intel and AMD chips. But, that's because they're in laptops, and things that are battery powered and they have to be efficient, but for the iMac and the Mac Pro, of course you still want to be relatively efficient so people plugging them into their setups aren't getting higher electricity bills, but now you're working with way more wattage, way larger thermal envelopes. It's like the best, most unlocked version of Apple Silicon possible, and I just can't wait to see how they perform, I'm ready. This is the definition of tech I am ready for. Please drop one in my set-up right now. There's also rumors of a new, slightly smaller high refresh rate, like Pro display too, to go alongside it to match, may or may not happen alongside, but I think that'd be pretty cool too. But I think we just keep forgetting that machines like this are not meant to be bought and used by regular people for regular, everyday computing things. Like, I don't have a Mac Pro at home. I just, you get a regular computer, you get a laptop, you get a little, even a baseline all-in-one, totally fine. But, when I use that huge Mac Pro at my desk, it's a workhorse. It's, it's been a rock, it's been churning through things, but even now that thing kind of feels slow, in some single-threaded tasks, compared to, like even the M1 MacBook Air. So, very excited to see what they do. All that being said, this is all Apple stuff, and I've gotten a lot of the information of like, what I really trust and hope to see from Mark Gurman. He's kind of the only one I trust with this stuff. So, also from his newsletter, iPhone 14. So, this could be an interesting one. One thing that always comes to mind with the iPhone is okay, new year, new iPhone, what are they gonna phase out this time? What are they gonna try to get rid of? Does the lightning port have another year of life left here? Maybe. I heard, they might be also trying to get rid of the physical SIM card in the SIM card tray. That wouldn't shock me at all, but there are a couple of things I'm specifically looking forward to in the next iPhone, because number one, they would make it a better phone, but number two, because the, the iPhone effect sort of tends to have the rest of the industry follow, and I think it would be a good thing to follow. So for one, they could potentially be adding the promotion display across the whole lineup, across all the new iPhone 14s, even an iPhone 14 mini, if they do another mini. And this would be really nice to see if these were all, presumably, LTPO displays all the way across the board too, for better life of course. So, it's a subtle thing, but LTPO displays allow you to ramp up, not just to a higher fresh rate of 120 Hertz, but at different refresh rates underneath that in between, depending on what's going on, on the screen, all of that to save you battery life. In the last video, I gave my impressions of the galaxy S21 fan edition, and I accidentally put LTPO in my graphic. That's actually incorrect, that's my bad. It's a standard, regular 120 hertz ammo led. So I pinned to comment to correct that, but really you only find LTPO, or this variable refresh rate, on the highest end phones. So the Fold 3s of the world, the Galaxy S21 ultras, the OPPO Find X3 Pros. The cheapest phone out right now, offering LTPO, is the $800 OnePlus 9 Pro. So, if we do see Apple bring that down across the entire iPhone 14 lineup, to the cheapest iPhone, iPhone 14 mini, if it's what it ends up being, that would be very impressive and something that I hope the others copy too. It's funny how we go from seeing Apple so far behind on higher fresh rate to maybe leading the next wave of it. But also, iPhone 14 cameras. This could, this could be the first year in a long time that we see the iPhone megapixel bump. Here's a chart, from my reviewing every iPhone ever video, of megapixel counts of the iPhones cameras. Every single iPhone, since 2015 has had a 12 megapixel sensor, and that's not a bad thing. They've got this really dialed over the years, in low-light performance with these large pixel sizes is great. The rumor this year is we may see, finally, a 48 megapixel iPhone camera. I love this of course, but the more I've thought about it, the more I feel like this may potentially be handled in a kind of weird Apple way. See, Apple's been sticking to the 12 megapixel sensors for so long, and they've got lots of good reasons. It's high enough resolution to look really great anywhere you might send it, in a text message, social media, whatever, and if you blow it up and you want to print one, then it'll look okay. So, why would they switch? Well, presumably this could be a year where Apple really focuses on having a Pro camera, and a Pro camera offers you the ability to do much more with your photos, so you can have, you can have that super high resolution Pro-mode. Of course, it will typically just be binning everything to 1200 megapixels anyway, for normal people and normal shots, but that Pro-mode would be sweet. And then on top of that, you know what 48 megapixels unlocks for you? 8K video. So, if they're getting really serious about Pro video, they can of course join the club of smartphones being able to shoot in 8K. But now imagine how much storage space 8K, Pro res video on the iPhone would take up. I mean, we already have an absurd amount, if you've ever shot 4k Pro res on the iPhone, it's a lot. And you can't even shoot 4k pro res on the baseline 128 gig Pro iPhone. So, I'd imagine they would have some other restriction to shoot 8K pro res. Maybe you'd have to have the 1 terabyte iPhone. I don't know, but the most fascinating iPhone 14 rumor that's gaining steam, is probably that they'll be moving to a hole punch camera on the front, and moving the rest of the face ID system underneath the display. Huh, now to me that's actually, that actually seems to work perfectly, it's really clever. It almost makes you wonder why they didn't do it earlier because we know the cameras that exist underneath displays today. You know, they've been okay, but they're really not the best quality or resolution, as far as actual images that you can get out of them. Now, the face ID sensor is really just working with projecting a bunch of infrared dots. So, they don't have to have this super high clarity or resolution to work just as well. So in theory, yeah, you can already just move those right underneath the display glass with today's tech, they'll keep working fine. And for the pristine, actual selfie image quality, you give that little hole punch cut out and still have a normal selfie camera. So that'll be cool, but let's get out of Apple camp. Galaxy S22 is right around the corner. Following up on their winning the smartphone of the year award with the Galaxy S21 Ultra. And I see that this design change that's pretty heavily rumored is probably happening. I don't hate it. I don't love it, but I don't hate it. Maybe I'll like it more when I hold it. I think phones tend to always look better in person than they do in the renders, but pretty much everything that was already really good about S21 Ultra is rumored to be upgraded in this phone again. It's the classic Samsung way, better chip set, better specs, better display, better cameras, 8K 60 FPS video is slated, so they can already do 8K 24, but 30 would be cool and 60 would take a lot of space, but it'd be cool too. So, that's the typical Samsung through all the hardware added way. And then there's also the possibility of including an S pen. This one, not so sure about, maybe it is included with support or maybe there's an S22 Note addition, or something like that. So, we haven't seen a Galaxy Note in at least a year, but maybe this is their way of bringing it back. The S pen lives on as long as that happens. So, that'd be pretty cool. I just really hope they don't curve the display over the edges again. I've seen a bunch of different mock-ups, and 3-D renders and leaked posts, and the one thing a lot of them have in common, is a really curved display. Now, I liked that it's a boxier design, kind of like the Note always was, and I like the flat top and bottom, but Samsung really got it right by reducing the curve in the S21 Ultra display, and it would be a weird move to go back on that to a huge curve again. We do now have official OnePlus 10 Pro design and specs. So by the time you're seeing this, we've got the official numbers and photos from OnePlus. This is sort of following up and going for redemption for the lackluster year of the OnePlus 9 series. I don't hate this design. It clearly was inspired a lot by what Samsung just did with their cameras, but it's sort of their own take on it, but it's definitely different. I'm okay with it. I'm sure you'll all have your own thoughts on this in the comment section below, but I'm okay with this. But the spec sheet is absolutely nuts. It's all maxed out specs. I'll just toss it over here or something, so you can see it. I think the most impressive part though, is 80 watt wired charging, and they're calling it super VU charging, instead of what they used to call OnePlus fast charging, which is dash charging. So, this is yet another step in the OPPO-ification of the one successful brand under that umbrella in north America, which is OnePlus. But that's enough phones, I got one more thing that I'm really excited and ready for in 2022, which is Evs, electric vehicles, and specifically this sort of trio of trucks, so that would be the Rivian, the F150 Lightning and the Cyber Truck. Now, Rivian has started shipping their R1T pickup truck, which I literally loved, honestly, on my list of EVs I've ever driven, It's gotta be top 5. I mean, there's Plaid Model S, Taycan, Etron, I'm putting Polestar in there, but then this is definitely got to be in there in no particular order. So, they're officially delivering them. We should start seeing them more and more on the streets this year, also alongside the R1S, which is essentially on the same platform, but it's the SUV version. It's even lower volume then the pickup truck, but that's also anticipated for 2022. And then I also got my first look at the F-150 lightening last year. And just today, I saw a headline that they're planning to double their production. So, clearly they're seeing a lot of interest, and that's all assuming no delays. So, they're saying something like spring 2022, that's assuming, assuming no delays. And then the Tesla Cyber Truck is the most delayed so far out of all these three. Last we heard Elon tweeted that it would be coming out late 2022, barring unforeseen delays. But then again, also last week, Tesla removed the 2022 estimate from their website. So, hopefully not delayed, maybe? Also technically the, the electric Hummer that we just looked at this, this past year is also coming out, so that's 4. I think this would be really fun if we did a new thousand mile road trip comparing gas versus electric, but this time do it with trucks. I mean, we can get a regular F-150, but we can also do these electric trucks and do it while towing something, so we can learn something again from this road trip. I think it would be pretty fun. The first one was a lot of fun and we learned a lot. So, maybe leave a thumbs up if you want to see that in 2022. Actually, it might be kinda hard to do all that while towing stuff, cause then you still need to like back into a charger, but then that's tough with a trailer. Maybe we'll just do this with a bunch of weight in the bed. I think bottom line is it'll be, it'll be pretty next level. Next level, like our current channel sponsor, Cash App. Cash App is the easiest way to spend, send and save your money. We already know it's great for sending your friends some money, or having them pay you back for something, but also you can buy Bitcoin, and save money and invest on Cash App. That's probably right in line with your new year's resolutions too. So, join Cash App, you can use code 'Marques' to get 15 bucks dropped into your account right away, and 10 dollars will go to Girls Who Code. So, there's a bunch of other little small things I'm interested in. There's maybe a Quest 3 coming this year from Meta since they've... It's still weird saying that. I'm so used to saying Oculus Quest, but a Meta Quest 3, considering how important the metaverse is to them. Maybe if we get a Pixel 7, we also get a Pixel Watch alongside that. That's probably not happening, but generally a lot of really cool stuff coming for 2022. Let me know in the comments section below, what you're most interested in seeing this year. I definitely want to cover as much of it as I can, but I want to get a sense of what you guys want to see too. So that's been it. Thanks for watching. Welcome to the new year. I'll catch you guys in the next one. Peace. (upbeat synth music fades)",
    "transcript_keywords": [
        "Pro",
        "Mac Pro",
        "Apple Silicon",
        "Silicon Mac Pro",
        "year",
        "Apple",
        "Apple Silicon Mac",
        "iPhone",
        "Intel Mac Pro",
        "iMac Pro",
        "Pro res",
        "Pro display",
        "Mac Pro tower",
        "Pro camera",
        "display",
        "lot",
        "Pro display XDR",
        "Mac",
        "Silicon",
        "Mac Pro finally"
    ],
    "transcript_entity_values": [
        "Apple",
        "late 2022",
        "2015",
        "iMac Pro",
        "Cash App",
        "One",
        "the Cyber Truck",
        "the lackluster year",
        "an Apple Silicon MacBook Air",
        "the years",
        "Marques",
        "a new thousand mile",
        "first",
        "Mark Gurman",
        "2022",
        "iPhone",
        "June, 2020",
        "PS5",
        "Tesla",
        "hertz",
        "1",
        "this past year",
        "the Mac Pro",
        "Polestar",
        "the iMac Pro",
        "LTPO",
        "Samsung",
        "iPhones",
        "120",
        "Quest 3 coming",
        "5",
        "today",
        "F150 Lightning",
        "Intel Mac Pro",
        "the Galaxy S21 Ultra",
        "a whole year old",
        "one",
        "Taycan",
        "iMac",
        "WWDC",
        "new year",
        "Evs",
        "Galaxy S22",
        "2022",
        "M1 Pro",
        "Galaxy S21",
        "the Mac Pro",
        "Las Vegas",
        "48 megapixels",
        "48",
        "Meta Quest 3",
        "80 watt",
        "a year and a half ago",
        "12 megapixel",
        "60",
        "two years",
        "M1 max",
        "Apple Silicon",
        "two",
        "last year",
        "F-150",
        "at least a year",
        "Meta",
        "three",
        "OnePlus 9",
        "every January",
        "Plaid Model S",
        "Mac",
        "4k",
        "number one",
        "CES",
        "MacBook Pro",
        "M1 MacBook Air",
        "Pro iPhone",
        "the first year",
        "XDR",
        "this year",
        "Intel",
        "another year",
        "Rivian",
        "north America",
        "OPPO",
        "$800 OnePlus 9 Pro",
        "3",
        "2021",
        "SD",
        "iPhone 14",
        "14",
        "GPU",
        "1200 megapixels",
        "the past year",
        "the next year",
        "10 dollars",
        "Mac Pro",
        "Elon",
        "jack",
        "the new year",
        "spring 2022",
        "AMD",
        "Hertz",
        "a year",
        "8",
        "Hummer",
        "iMac Pro",
        "128",
        "LTPO",
        "S21",
        "15 bucks",
        "SIM",
        "EV",
        "Etron",
        "OnePlus 10 Pro",
        "4",
        "OnePlus",
        "the Tesla Cyber Truck",
        "Apple Silicon Mac Pro",
        "the beginning of the year",
        "CPU",
        "up to a 40",
        "Bitcoin",
        "last week",
        "30"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "NORP",
        "CARDINAL",
        "LAW",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "FAC",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "NORP",
        "LOC",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "LAW",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "NORP",
        "DATE",
        "CARDINAL"
    ]
}