{
    "id": "ZwxfAvrTaP0",
    "title": "I Tried Not to Like This - MAINGEAR Rush GAMING PC",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-07-11T19:00:22Z",
    "video_url": "https://www.youtube.com/watch?v=ZwxfAvrTaP0",
    "category": "Science & Technology",
    "tags": [
        "PC",
        "Gaming",
        "Maingear",
        "Rush",
        "Desktop",
        "DIY",
        "Water-cooling",
        "Hard Tube",
        "Liquid Cooling",
        "AMD",
        "Ryzen",
        "3950X",
        "CPU",
        "Processor",
        "NVIDIA",
        "2080 Ti",
        "SLi",
        "Performance",
        "Game",
        "Unboxing",
        "Alex"
    ],
    "views": 711746,
    "likes": 26880,
    "comments_count": 1221,
    "description": "Enter Teamgroup's giveaway at  and check out the Teamgroup Dark Z DDR4 Ram at    What can you get with $10,000 USD for a PC Building? A lot of performance, cooling, and best of all.... so much RGB! What would be the first game you play with this rig?  Check out the MAINGEAR RUSH at   Buy ASUS ROG Crosshair VIII Formula On Amazon (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy AMD RYZEN 9 3950X On Amazon (Paid Link):  On Best Buy (Paid Link):  On BHPhoto (Paid Link):   On NewEgg (Paid Link):   Buy NVIDIA GeForce RTX 2080 Ti  On Amazon (Paid Link):  On BHPhoto (Paid Link):   On NewEgg (Paid Link):    Buy HyperX Predator DDR4 Memory On Amazon (Paid Link):   On Best Buy (Paid Link):  On BHPhoto (Paid Link):     On NewEgg (Paid Link):    Buy 2TB Seagate FireCuda 520 Gen4 M.2 NVMe On Amazon (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):    Buy 4TB SAMSUNG 860 PRO Series SSD On Amazon (Paid Link):  On Staples (Paid Link):  On BHPhoto (Paid Link):   On NewEgg (Paid Link):   Buy 6TB Western Digital Black HDD On Amazon (Paid Link):  On Staples (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy EVGA 1200W SuperNOVA P2 On Amazon (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):    Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/W43Dj",
        "https://lmg.gg/aY4Xw",
        "https://lmg.gg/fQUpN",
        "https://geni.us/LgpasSl",
        "https://geni.us/vnoU",
        "https://geni.us/tBGWE7L",
        "https://geni.us/GkwDdK",
        "https://shop-links.co/1725432002844677619",
        "https://geni.us/jjMlp",
        "https://geni.us/JNBvNkS",
        "https://geni.us/IAyMIv",
        "https://geni.us/dZsrYFM",
        "https://geni.us/vxj28T",
        "https://geni.us/YAzjLJ",
        "https://shop-links.co/1725432003262682838",
        "https://geni.us/E5Fz8",
        "https://geni.us/8QkjG",
        "https://geni.us/UcOPvG",
        "https://geni.us/DBn9hM",
        "https://geni.us/rsVNMXH",
        "https://geni.us/1HneTk",
        "https://shop-links.co/1725432003743401724",
        "https://geni.us/YYJsLj",
        "https://geni.us/Q76f",
        "https://geni.us/3pF8jW",
        "https://shop-links.co/1725432005077053260",
        "https://geni.us/B6gcZ",
        "https://geni.us/1MbBO",
        "https://geni.us/DOESqZ",
        "https://geni.us/liDw3r",
        "https://geni.us/Awoz",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "(grunts) (box clangs) - Wow, sorry, table. I am all about building your own computer, but there comes a certain point when you're getting into custom liquid cooling, it's a huge pain. You need to buy not only the computer and all the stuff to go in it, but also, a custom water cooling kit, so that you're able to do it. Which I guess is kind of the only situation where you might wanna buy a pre-build. So this right here is the main gear rush. And let's get right into it. This is a pretty fun hat. (calm, jazzy music) This thing, I believe, is 10 grand worth of computing. How do you even spend 10 grand on a computer? I guess we're gonna find out here, pretty soon, but holy crap, that is a lot of money. We have a computer here. (tearing) Comes with CableMod cables, I guess. These are kind of CableMod cables. We also have some tubing. Here are cables. I'm guessing these are just spares, if you do upgrades. Oh yeah, and we have, see, the cables here. We also have a couple trays, I think. Oh yeah, for additional hard drives, so there's three trays right here. I believe there's already one hard drive in there, so I'm guessing four is the total that you can put in. Oh and cooler mounting stuff that would've came with the motherboard, so this will be pretty nice if you decide to sell the motherboard and want to include the stuff to put an air cooler on it. (cardboard sliding) Proudly designed in New Jersey. So we got a little baggy thing here. Oh, this is a gift. (tears) I guess you spend 10 grand, they can pay a bit extra for fun inclusions. Got a pen. Feels like I'm going to summer camp. Little coaster. (chuckles) Okay yup, more SATA cables, lots of those. I guess if you wanna just toss your hard drives In the back of the case, you can. Wi-Fi adaptor thing. Another ROG coaster. (chuckles) And a Windows Recovery USB, which is kinda fun. I don't trust this table. (grunts) Okay, one moment. There we go. Be good, table. (grunts) This is really heavy. All right, so here it is, the Maingear Rush. I guess that we got the black version. There's a black and a silver. With a nice warning here. Before powering, you must first remove packaging from inside of the computer. I think we're gonna do that. So to take off the top panel, you first unscrew these and there's a little latch here, so you just kinda flip that down and boom, that's off. I'm guessing the tempered glass panels come up and out now. (clicking) Yes. Back panel's coming off, too, I guess. (chuckles) We've got a almost singularity computer desk, kind of like a distribution plate here. I'm actually pretty surprised that this is a Bitspower block because EK Water Blocks has their own custom distribution panel for this case that goes in the back here. But it looks like Maingear's decided instead to put the distribution block up front, and then add a radiator in the back where the other distribution plate would go. (packaging crinkles) This might look a big excessive as far as packaging goes, but it's absolutely necessary. I think that we have a custom pink color for this. It's called crystal pink or something like that. But either way, this is a seg spec computer right here. Holy crap, look at these fittings. Sometimes you can do sort of stuff like this, where you get these fittings chains and it can look kind of like you just cheated and didn't bother with the hard line tubing. But here, it just looks so sick because of these awesome Bitspower fittings. So this is just like a little adaptor that just moves the hard line connection up a couple millimeters so that this tube can run perfectly straight across. I have to say, I really appreciate how compact this whole machine is, given that you get, what, one triple radiator, a dual, and another dual 140, it looks like there. (pats computer) So you have a massive amount of cooling, given the amount of space that it takes up. This is only slightly larger than your average desktop. And this cooling loop, how does it work? So we have the pump back here, it then pumps out there, it goes to this radiator up here, through the G fuse, so these are in series. And then it comes up through here. So the VRMs on the motherboard are also cooled, as well as the CPU. So it's in parallel between the CPU and the VRM, so it's going in there, out there, but also in, around and back out. And then it's being cooled by this radiator and then this one back here. I might have my flow direction wrong. No, it wouldn't make sense, it would have to, you want all this to be above the pump so that it always comes in right there. Then if you want to fill it, there's a nice little fill port here that you just stick a funnel into, and you're all good. And a little drain port down here. This is actually a really well-engineered loop. Let's get to what's in the computer. I kind of forgot about it, honestly, because all the cooling was so sick. Here we have two 2080 Tis and those are in SLI. Then in here, we have AMD's Ryzen 9 3950x, so that's their 16 core CPU and it's on Asus' Crosshair VIII Formula. This is the one with the VRM cooling, so you'll be able to really over (mumbles) processor. All that's finished off by 64 gigabytes of RAM, a two terabyte NVMe SSD for boot, a four terabyte SSD for storage and a six terabyte hard drive for less faster storage. In order to, (grunts) you know, power all of that, they have an EVGA SuperNOVA 1200 watt and we have our four hard drive base here, which seem like they're really easy to access. That's actually really easy hard drive swapping. Tiny bit more on the front here, we have USB type C. Is this lighting? (clicks) It's probably lighting control. Power, reset and two USB type As. On the back, we've got just heaps of IL on the motherboard. We've got eight, nine, 10, 11 USB type As, a type C. You know, there were all of those cables and accessories, but I actually don't remember seeing a (chuckles) power cord in here, (packaging crinkles) aha. Got one here, but that would be kind of annoying if you didn't happen to have one around. (clicks) Oh, there's probably gonna be so much RGB in here. But if you don't want RGB, TeamGroup's got you covered. The TeamGroup DarkZ gaming memory has aggressive styling with an aluminum heat sink. It comes with a lifetime warranty and works with both Intel and AMD processors. Right now, they have the Be Invincible giveaway. Three winners who enter get a chance to win a TeamGroup product. Don't miss out and enter at the link below. Oh, I just realized that I have a peel to do. Woo! (crew member exclaims) Damn. (scoffs) This is what dreams are made out of. (plastic tears) All right, we've got it set up. Games are installed. I'd like to say we're going to play the latest of the latest, but I've been playing Descenders lately and I wanna play (chuckles) that, so we're going to. This is not a very pretty-looking game. At the same time, it's a poorly-optimized game, so it's actually a pretty good test for this. At my house, I have a 1080 and it kinda struggles to keep the frame rate up on high around there. So we're gonna just put this (key taps) on ultra at four K and see if it can do it. If it does, I'll be impressed. And it looks like we're sitting right around 150 FPS, which is pretty awesome, given that this is kind of an unoptimized piece of garbage. So you just get put on a procedurally generated trail and then you have to do something like here, not braking. It can get pretty tough sometimes, 'cause I'm going pretty fast right now. How are our temps doing? Let's see, hardware info here. Looks like processor's been up around 4.7 gigahertz. And the maximum temperature has been 72 degrees, dropping fast at, seems to be more around 60 or so for the most part. VRMs are at 30 degrees, (chuckles) no problems there at all. Bah bah bah, where's the GPU? Maximum temperature on the GPU is 44 degrees, hot damn. The other GPU, 46 degrees. So I guess with this configuration, the second card is getting a tiny bit hotter, but at the same time, it's at 46 degrees. (chuckles) Like, what the hell. And so you're going to have absolutely no problems with this turboing down or anything like that. I don't think anyone's surprised that this is an excellent (chuckles) gaming machine. I friggin' hope so, for 10 grand. So this thing is really sick. As far as just amazing-looking water cooling goes, I haven't seen something this nice and clean for quite some time. Now before we leave here, there's something that (panel rattles) I have been really looking forward to. We've had the side panel off, just so you guys can see what's on the go here, but we're gonna put it on for a second, (panel clicks) there we go. Well, I hope you guys liked this video. Hit like, get subscribed, have a fantastical day and yeah, this thing's sick. (plastic tears) (scoffs) Wow. Best outro ever. (plastic crinkles)",
    "transcript_keywords": [
        "kind",
        "guess",
        "computer",
        "back",
        "hard",
        "pretty",
        "hard drive",
        "cooling",
        "cables",
        "put",
        "USB type",
        "USB",
        "thing",
        "degrees",
        "drive",
        "grand",
        "stuff",
        "panel",
        "CPU",
        "custom"
    ],
    "transcript_entity_values": [
        "two terabyte",
        "Wi-Fi",
        "Intel",
        "Three",
        "three",
        "RAM",
        "the Maingear Rush",
        "72 degrees",
        "one",
        "USB",
        "a couple millimeters",
        "VRM",
        "seg",
        "2080",
        "Bitspower",
        "second",
        "SLI",
        "EK Water Blocks",
        "EVGA",
        "11",
        "4.7 gigahertz",
        "nine",
        "IL",
        "46 degrees",
        "Maingear",
        "ROG",
        "64 gigabytes",
        "30 degrees",
        "10",
        "first",
        "AMD",
        "AMD",
        "Asus",
        "16",
        "SuperNOVA 1200 watt",
        "two",
        "1080",
        "four",
        "Descenders",
        "GPU",
        "10",
        "44 degrees",
        "SATA",
        "RGB",
        "CPU",
        "New Jersey",
        "Bitspower",
        "140",
        "six terabyte",
        "eight",
        "TeamGroup",
        "SSD",
        "CableMod"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "GPE",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG"
    ]
}