{
    "id": "zxDTitg2MeE",
    "title": "Google Pixel Fold Impressions! $1800 of Pixel?!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-05-10T18:50:48Z",
    "video_url": "https://www.youtube.com/watch?v=zxDTitg2MeE",
    "category": "Science & Technology",
    "tags": [],
    "views": 3513061,
    "likes": 107400,
    "comments_count": 4952,
    "description": "Google has made an $1800 folding phone. This is my hands-on and first look   MKBHD Merch:   Tech I'm using right now:   Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(bright music) - Hey, what's up guys, MKBHD here and welcome to your first look at Google's first foldable phone. It's almost wild that it's finally here, and I got to hold it and play with it for the first time after all these months of rumors and hype. So the phone is exactly what it sounds like. It's a Pixel with a folding screen on the inside, and we were curious, just waiting to see what it would look like just because this is the official Google take on what a folding Android phone would look like, so now we've got it. So for a phone like this, there's basically three categories that matter, design, hardware specs and software, and I guess also, probably price, but we'll get to that at the end, because that's also important. It's an expensive phone, but with my hour or so of hands-on-time with the phone, I did get a pretty good sense of all three of these things. So for design, this is a more compact folding phone, I would say. It's in the same style as the Oppo Find N2 but a little bigger and a little thinner. So there's a 5.8 inch OLED display on the outside, pretty thin bezels, power button and fingerprint reader and volume buttons on the side. And there's a pretty firm hinge that can stop at just about any angle to hold the phone open for easel mode. But then, this is where it gets interesting, Google made a pretty big design choice in the hinge mechanism to put a lot of the parts of the folding hardware above and below the middle instead of behind it. So, that's what makes the hinge itself and the entire phone so thin, but that also means there is extra hardware now above and below the hinge. So, when you open up the phone, yes, that means there's a bit more bezel than usual above and below the display. Now it's a pretty generous 7.6 inch display, unfolding on the inside here, but I think that it'll be slightly controversial, because people are going to freak out about the bezels. That's one of the things you can count on for the internet. But honestly, looking at it and using it, I'm totally fine with it. It lets them put an actually good front-facing camera in the bezel on the inside here, and it gives you a bit of something to hold onto and rest your thumb when you're holding the phone open. Anyway, around the back is the camera bar that doesn't quite span the whole width of the back, but it still looks very Pixel, plus on the side there's an LED flash and a microphone array, and it comes in two colors basically, black and white. Honestly, I think it's a pretty-good looking phone. I'm someone who liked the looks of the older Pixels, so that falls right in line with that. And I keep coming back to this Oppo Find N2. This is a phone whose form factor I've loved so much, and the Pixel is both a little bigger and a little thinner, which is really interesting, and we're gonna have to see how this thinness trade-off pays off, because that naturally means not so much battery. Well, we'll get to the next category. Let's talk about the next section of things, which is just hardware specs. So the story of the hardware here is it's mostly flagship or just short of it. So the 5.8 inch display on the outside is a 1080P 120 Hz OLED with over 1500 nits peak brightness, which is great, and the 7.6 inch OLED on the inside is also 120 Hz. It's also just over a 1440P, and this six by five aspect ratio. I think these screens are awesome. But then on the inside you've got Tenser G2, which has been in the Pixel for several months now and 12 gigs of RAM. And then there's a 4,821 million power battery inside. Now, just for context, that's an interesting number, 4,800, that would make it the largest battery we've ever seen in a foldable. But, at the same time, the Pixel 7 Pro has a 5,000 million amp power battery and the same Tensor G2, and average battery life, I think we can say. And so, having a smaller battery and a much bigger, brighter screen in this Pixel Fold does give me some pause about battery life. That's a question that I have to actually use it to find out and review it. But I think also, wireless charging, good to see, but it's also kind of slow wired charging, 30 watts max. And then, with the triple cameras at the back, there's actually all new sensors throughout here, which Google says are flagship-grade, but we're definitely gonna have to test these out for the full review. But we're looking at a 48 megapixel main camera, then a 10 megapixel ultra wide, and a 10 megapixel 5X telephoto. So overall, as a package, teetering on flagship, but not completely maxed out, obviously. The displays I think looked really, really good, in person, super smooth, super bright and responsive, but there are clearly concerns. I think the battery is the big question in my head, which is always just gonna be a combination of physical capacity, but also software optimizations. And so of course, software is a big part of what makes a phone good, especially in a folding phone, because it's a phone and also a tablet at the same time. So this Pixel Fold is gonna have all the Pixel stuff, the Google Assistant, Now Playing, Hold-for-Me, Material U, the customizable-looking version of Android that we've seen in the Pixels that make it the smartest smartphone in the world. And I love all that, but of course, on the inside screen, we're talking about basically, a tablet, and Android tablets, let's be real, have always been a little bit lacking in the software department, so I was curious to see if there was new stuff here, and there is some stuff to pay attention to. So first of all, the expected stuff like side-by-side multitasking feels really smooth and intuitive. The apps resize however you want them, but that's not new. What's new is this doc behavior at the bottom. So you can now long press that bar at the bottom of Android that's normally for gestures, and it brings up a doc of apps, which I think I need to play with more to understand better, but I'm gonna guess it's your most recent apps, and it's not fully customizable, but we'll see. Either way, you can quickly launch and bounce around other apps here and jump right into split-screen multitasking, just like what Samsung did with the permanent doc on the fold, it's just this one takes up less space. And also during my time with the phone, I was talking with some people on Google's team about it, and they talked a big game about optimization, which I feel like we hear this story a lot, but they've worked with a lot of developers on optimizing tablet versions of their apps to look good on the Pixel Fold. They're also launching a tablet, so that should help both devices. And also, they've updated something like 50 Google apps to all work on the larger display, whether that's a column layout or just something that takes advantage of the entire display instead of just looking like a stretched phone version of the app. So I think good news on the software TBD, when we test it, decent hardware overall and I think a pretty nice design. But then of course, we should get to the price, which I mentioned at the beginning. I felt like it would overshadow the whole thing, which is how crazy it is, but this phone will cost $1,799. It is an $1,800 phone, and 1800 bucks is a lot for a phone. That's at the top of the market. I'm pretty sure that's the exact same price that Samsung's Fold4 launched at, but now that's probably dropped in price since it came out. So, this is gonna bring comparisons to every other $1,800 folding phone option. So if I'm just guessing from my first impressions, this is gonna be a tough sell for anyone who isn't specifically interested in the Pixel software experience, which to be fair, I'm one of those people. I love that, but it's the same tough sell that the Pixel 7 Pro was. But at least this was sort of undercutting some of the most expensive ultra phones out there where this Pixel Fold is the same price as the most expensive, best flagship folding phones. But all in all, very interesting, very interesting. Google's first entry into the folding phone space. Definitely get subscribed to this channel, so you can see the full review when I actually get my hands on this phone for a longer period of time and test it. But for now, that's your first look. Lemme know what you think. Is this gonna be able to sell at this price or is this just another one first option in the first gen pile that people probably shouldn't buy? Lemme know what you think. Thanks for watching, catch ya on the next one, peace. (bright music)",
    "transcript_keywords": [
        "phone",
        "Pixel",
        "Pixel Fold",
        "folding phone",
        "Google",
        "folding Android phone",
        "battery",
        "pretty",
        "folding",
        "inside",
        "good",
        "Fold",
        "MKBHD",
        "display",
        "hardware",
        "apps",
        "phone open",
        "software",
        "Android",
        "price"
    ],
    "transcript_entity_values": [
        "Pixel",
        "Pixels",
        "three",
        "1,799",
        "Tenser G2",
        "1,800",
        "the Pixel Fold",
        "one",
        "5.8 inch",
        "1800 bucks",
        "5,000 million",
        "this Pixel Fold",
        "12",
        "Android",
        "five",
        "4,821 million",
        "1440P",
        "first",
        "10 megapixel",
        "several months",
        "the Pixel 7 Pro",
        "1500",
        "Google",
        "4,800",
        "50",
        "Pixel Fold",
        "1080P 120 Hz",
        "RAM",
        "7.6 inch",
        "120 Hz",
        "six",
        "48 megapixel",
        "two",
        "30 watts max",
        "Samsung",
        "10 megapixel 5X"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "MONEY",
        "FAC",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY"
    ]
}