{
    "id": "ZxeT3dUC8Xg",
    "title": "Moto Mods 2017: Your Phone Is Fun Again",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-06-30T23:33:47Z",
    "video_url": "https://www.youtube.com/watch?v=ZxeT3dUC8Xg",
    "category": "Science & Technology",
    "tags": [
        "moto mods review",
        "moto mods 2017",
        "moto mods jbl",
        "jbl soundboost 2",
        "mrmobile",
        "michael fisher",
        "motorola",
        "z play review",
        "z2 play review",
        "moto z2 play"
    ],
    "views": 252384,
    "likes": 7389,
    "comments_count": 484,
    "description": "If youre searching for the funnest phones around right now, you neednt look any further than Motorola. It was just one short year ago that the company launched its Moto Z line of smartphones, along with the slap-on magnetic \"Moto Mods\" that gave them their special talents. Well cover the Moto Z line in more detail in my forthcoming Moto Z2 Play review ... but for now I wanna talk about the 2017 Moto Mods, the snap-on accessories that make your phone fun again  for a price.   [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  \"Stay Mobile, My Friends\" T-Shirt:   Motorola Moto Z2 Play:   Motorola Moto Mods 2017:   Fonesalesman Qi Wireless Charger:      [ABOUT MRMOBILE'S MOTO MODS 2017 REVIEW]  MrMobile's Moto Mods 2017 Review was produced following 48 hours with the new official Moto Mods for 2017, on loan from Motorola. Initial conclusions are preliminary, with followups scheduled for the Moto Z2 Play review and further Motorola coverage later in the year.   [FURTHER READING]  Android Central's Moto Z2 Play Review:   Moto Mods homepage on Indiegogo:   Moto Mods Homepage at Motorola:     [MUSIC]  \"Urban Odyssey\" by Jake Silver, available at Premium Beat:   E-Business by Olive Musique, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://teespring.com/mrmobile-stay-mobile-pink",
        "http://mrmobile.tech/2s8",
        "http://mrmobile.tech/2s9",
        "http://thrifter.com/suRJ",
        "https://www.androidcentral.com/moto-z2-play",
        "https://www.indiegogo.com/campaign_collections/transform-the-smartphone-challenge",
        "https://www.motorola.com/us/products/moto-mods",
        "https://www.premiumbeat.com/royalty_free_music/songs/urban-odyssey",
        "https://www.premiumbeat.com/royalty_free_music/songs/e-business",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Narrator] If you're looking for the funnest phone around right now, then let's face it, phone hardware could use a little fun injection. You needn't look any further than Motorola. It was just one short year ago that the company kicked off the Moto Z line of smartphones along with the slap on magnetic modules that gave them their special talents. We'll talk about how well the Motorola family has aged soon once I've spent more time with this Z2 Play. But for now, I wanna talk about the new Moto Mods. (beat music) The three Mods Motorola sent over are direct sequels to last year's and each is a pretty big improvement, at least on paper. But before we talk about how well they all work, let's drop some props on Motorola for keeping its word. It promised that all Moto mods from last year would still work on this year's phones and that holds up. The 2016 mods all snap on to the Z2 Play with no trouble. While the 2017 mods lock onto the older Moto Z just fine too. So if you have any kind of Moto Z, new or old, and you want to save a little money on your mods, you can totally go for last year's leftovers and they'll work just fine. But you will be missing some stuff. I instantly fell for the new SoundBoost 2, with its fun color palette and ergonomic hand feel. Fun fact, it's actually a little thicker than last year's SoundBoost. Spec-wise, it's almost identical. Batter size, frequency response, peak loudness, all the same. The two big upgrades for the sequel are splash resistance and the new companion app which gives you a few equalizer presets as well as an immersive sound mode. No, sorry, the app does not work with the old SoundBoost. As for the audio itself, it's incredible. (\"A Request\" by Pinback) I've only got one concern about the SoundBoost 2, that smooth soft fabric is bound to get dirty mighty quick. As for the price, it's free if you buy a Moto Z2 Play from Verizon Wireless before July 26th. Otherwise, it's a penny shy of $80. (delightful music) Alternately you could spend that 80 bucks on the TurboPower pack. A big energy reserve, a built-in power meter, and it's own USB-C port, which you charge it independently. There's also a higher peak charge rate compared to last year's super slow Tumi pack. But don't expect any miracles. Even in turbo mode, you're looking at about a 1% per minute average since charging slows as your onboard battery fills up. If you wanna make the most of the power reserve, use it in efficiency mode to maintain your phone at 80%. And if you're thinking 80 bucks is a steep price to pay for a battery this size, I can't really argue with you. Batteries with five times this capacity regularly sell for half the price and you can't share the TurboPower mod's reserve with others as you can with external battery packs. Really, this is a convenience play. Sticking a batter right to your phone is much more elegant than stringing a cable from your pocket but you've really gotta want that convenience to make it worth the price. The last mod has less to accomplish in that it's just there to make your phone look good. The style shell comes in two kinds of wood or floral print or the subdued nylon I was sent. If this were last year, that'll be all she wrote but this year, Motorola stuck in an inductive loop for Qi and PMA wireless charging so you can top up without cables whether you're at home or at Starbucks. Hey, wouldn't it have been great to have wireless charging built into the TurboPower mod as well? Yeah, it's not, but that would have been awesome. Anyway, one last bit of good news, Motorola took NFC into account when designing the mods so you don't have to take them off to use Android Pay. Keep in mind that the mods I have in the studio are just the conventional ones. The gamepad accessories due later this summer for 80 bucks and lots of community-developed mods are under development. Like a sliding physical keyboard with integrated battery, a magnetic e-paper back called Digiframe to give your phone a second screen. An off-network walkie-talkie called Linc and others. Still, the ecosystem seems stuck in first gear. The keyboard mod barely made its Indiegogo goal, Linc actually felt short, and others are still working through all the various hurdles of hardware development. I'll drop links to all these projects in the description so you can support them if you like. And then there's the underlying philosophy of mods. They sound like a lot of fun, they are a lot of fun, but in order to get the most out of your phone, you basically have to take a backpack full of mods with you everywhere you go. The Novo for its parts, has mods are selling well and that sales of the Moto Z family are actually increasing as it resurrects the Motorola brand. We'll have to wait until the company unveils its next flagship to get a sense of what the rest of the year looks like for the Moto Z. But thanks in large part to Moto Mods, its place as funnest smartphone seems secure. Subscribe to MrMobile on YouTube for the Moto Z2 Play review coming soon and many more mobile tech videos landing each week. Until next time, thanks for watching and stay mobile, my friends. (delightful music)",
    "transcript_keywords": [
        "Moto",
        "Moto Mods",
        "Mods",
        "Motorola",
        "year",
        "Mods Motorola",
        "phone",
        "Play",
        "mod",
        "fun",
        "TurboPower mod",
        "fun injection",
        "work",
        "SoundBoost",
        "price",
        "battery",
        "talk",
        "older Moto",
        "Motorola family",
        "Motorola stuck"
    ],
    "transcript_entity_values": [
        "year",
        "2017",
        "TurboPower",
        "SoundBoost",
        "last year's",
        "Android Pay",
        "half",
        "PMA",
        "Novo",
        "short year ago",
        "1%",
        "2016",
        "SoundBoost 2",
        "the year",
        "last year",
        "Pinback",
        "USB",
        "Indiegogo",
        "each week",
        "Verizon Wireless",
        "Moto",
        "80",
        "this year",
        "Motorola",
        "Moto Z",
        "Starbucks",
        "first",
        "the power reserve",
        "Tumi",
        "five",
        "July 26th",
        "two",
        "Moto Mods",
        "Digiframe",
        "Qi",
        "Linc",
        "second",
        "80 bucks",
        "MrMobile",
        "later this summer",
        "NFC",
        "three",
        "one",
        "80%"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "DATE",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "LOC",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "MONEY",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT"
    ]
}