{
    "id": "zXm7OsY7TQ0",
    "title": "Samsung Galaxy S21 and S21 Plus hands-on: price drop",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-01-14T15:00:19Z",
    "video_url": "https://www.youtube.com/watch?v=zXm7OsY7TQ0",
    "category": "Science & Technology",
    "tags": [
        "Samsung Galaxy S21",
        "Samsung Galaxy S21 Plus",
        "Samsung Galaxy S21 Ultra",
        "Galaxy S21 vs S20",
        "The Verge",
        "Verge",
        "Samsung",
        "Unpacked 2021",
        "Samsung Unpacked",
        "samsung galaxy s21",
        "samsung galaxy s21 ultra",
        "galaxy s21 ultra",
        "samsung galaxy s21 plus",
        "galaxy s21",
        "s21 ultra",
        "samsung s21",
        "galaxy s21 plus",
        "samsung s21 ultra",
        "galaxy s21 ultra camera",
        "galaxy s21 first look",
        "samsung s21 price",
        "galaxy s21 release date",
        "samsung s21 plus",
        "one ui 3.0",
        "samsung galaxy s21 ultra unboxing"
    ],
    "views": 264647,
    "likes": 4721,
    "comments_count": 552,
    "description": "Samsungs two new entry-level flagships, the Galaxy S21 and Galaxy S21 Plus feature the new Snapdragon 888 processor, 8GB of RAM, and a triple camera array. But the most significant change this year is the $200 lower starting price. Chaim Gartenberg takes an early look at the new phones and compares both models. They will be available for preorder on January 14th with prices starting at $799 and will start shipping on January 29th.   **Correction: At 2:14 the back of the S21 Plus is glass, not aluminum. The S21 (non Plus) has a polycarbonate back.  Samsung Galaxy S21 Ultra:  Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:   #TheVerge #GalaxyS21",
    "description_links": [
        "https://youtu.be/-a_uyxDEuYk",
        "http://bit.ly/2XFjo9G",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(gentle music) - The Galaxy S21 and S21 Plus are officially here and Samsung has brought all the latest improvements that you'd expect from a flagship Galaxy design. New specs, better designs, the works. But the biggest thing about this year's new phones isn't actually the phones themselves, it's that after years of prices that have been steadily creeping upwards, Samsung has reversed course on this year's flagships. They start for $200 less than last year's Galaxy S20 models. The S21 starts at just 799 and the S21 Plus at 999. Now that's a big change and that's despite the fact that these phones are actually more advanced in some ways like the new Snapdragon processor. So what's the catch? (bright music) Well, there are a couple of changes that Samsung has made to help hit those lower price points. For starters, that base Galaxy S21, it's back is made out of polycarbonate plastic instead of aluminum. And both phones have shifted from the curved screens that Samsung has been using for years down to a flat panel. Now, I happen to personally like flat panel phones but if you're a fan of the old curve designs it's something that you wanna be aware of. There are a couple of bigger changes to specs though, that Samsung has made here. Both panels are lower resolution than last year's models. Down to 2400 by 1080 resolution instead of 3200 by 1440. They also come with less RAM, just eight gigabytes instead of 12. Now, does any of that actually make a difference in daily use? I don't know, but we will definitely have an answer for you when we're able to fully review these devices soon. Of course, there's still a lot of new things to like. There's the new design which we'll talk about in a minute, there's the Qualcomm Snapdragon 888 processor which promises to be even faster than last year's and there's improvements to the already really good cameras from last year. (gentle music) Now, at least head-on the S21's do broadly resemble their predecessors with edge-to-edge OLED dispalys, hole-punched cameras and the same 6.2 inch and 6.7 inch screen sciences. Although again, they're flat panels not curved. Flip it over though, and you'll see some differences. Gone is the back piece of glass. Now it's just either aluminum or polycarbonate depending on which model you get. Which in theory should be less fingerprinty but for some reason isn't, but the biggest design change on the S21 models is the camera bump. Now for years, as long as smartphone manufacturers have been trying to cram in better lenses and bigger sensors into our phones, we've been stuck with these big ugly protruding camera bumps and last year's S20 lineup was particularly egregious with that massive squircle thing that just stuck out of that otherwise beautiful glass back. Now, the S21 and the S21 Plus still have a camera array, but instead of jutting out, Samsung has made it this seamless piece of metal that smoothly flows from the metal rails of the phone onto the back and a spiffy two-tone design that looks great, especially on that purple and gold model. Look, it's not perfect. No camera bump ever will be, but if I do have to get stuck with a camera bump, and if you want good pictures on your phone, you probably do. I'd really love it to keep looking like this. As for those three cameras, there's a 12 megapixel wide a 12 megapixel ultra-wide and a 64 megapixels telephoto lens along with a 10 megapixel selfie camera in that hole-punch on the front display. Now, if those sounded a little familiar to you, it's because that these are virtually identical, at least hardware-wise to the cameras on last year's S20 and S20 Plus. That said, Samsung says that it has made improvements to things like AI processing and added some new camera features, so there are some things to look forward to. (bright music) As for the phones themselves, they're really polished pieces of hardware, which again, this is Samsung's big flagship. So it's sort of what you would expect from that. Of the two, I prefer the S21 size, but unfortunately that plastic back just has it feeling cheaper than the S21 Plus, which is a shame because it's just a little too big for my taste. Both phones are also surprisingly light, possibly because there's no slab of glass on the back. Those lighter weights are despite the fact that the S21 has a 4000 milliamp hour battery the same as last year's model. And the S21 Plus actually has a bigger 4800 milliamp hour battery. As for ports, they're what you would expect from a 2021 smartphone which is to say, limited. There's a USB-C port. There's also a power button and volume buttons no weird Bixby buttons here, no headphone jacks although there is wireless charging. If you need another way to charge your phone. If you're getting the base Galaxy S21 you'll have a choice of four colors, white, grayish black, pink, and my personal favorite the purple and gold, which looks fantastic. The S21 Plus has three colors which are slightly different and in my opinion, a little better. There's the same purple and gold and the same black and gray but the S21 Plus's silver option is this really nice almost pearlescent silver, that shimmers in different colors in the light. It looks really good. Both phones fully support 5G with support for both sub-6 and millimeter wave 5G, thanks to the integrated Qualcomm Snapdragon 888 processor. So it should work with basically whatever phone network you have. The Galaxy S21 and S21 Plus are different type of flagship for Samsung, instead of just chasing the absolute best phone that they can make, and don't worry, they're also doing that with the Galaxy S21 Ultra, which check out our other video on that, but it really speaks to a different philosophy that Samsung has taken here. One that we started to see with last year's Galaxy S20 FE which is to say that they're looking to make these great phones a little more affordable to the average consumer which in a world of $1000 flagships or $2,000 foldables is a really appealing prospect. Now, whether or not the trade offs that Samsung has made here are something that we will definitely have to get into and definitely have to see but at least on paper, the S21 is exciting and at least compared to last year, far more affordable flagship than we've seen from Samsung in a long, long time. To the ones on last year's, dear God! (indistinct) Our video producer, Becca has told me that I'm wrong and that the flat white one is better but I'm on the camera right now. - [Becca] It's true!",
    "transcript_keywords": [
        "Samsung",
        "year",
        "Galaxy",
        "phones",
        "Samsung has made",
        "year Galaxy",
        "camera",
        "made",
        "phone",
        "back",
        "Qualcomm Snapdragon",
        "Samsung has brought",
        "cameras",
        "camera bump",
        "base Galaxy",
        "flagship Galaxy design",
        "Snapdragon",
        "Samsung big flagship",
        "years",
        "design"
    ],
    "transcript_entity_values": [
        "last year",
        "the S21 Plus's",
        "3200",
        "the same as last year's",
        "S21",
        "The S21 Plus",
        "four",
        "64 megapixels",
        "888",
        "three",
        "Snapdragon",
        "1440",
        "Bixby",
        "1080",
        "year",
        "S20 Plus",
        "5",
        "999",
        "both sub-6 and millimeter",
        "the Galaxy S21 Ultra",
        "years",
        "6.2 inch",
        "Becca",
        "The Galaxy S21",
        "daily",
        "Qualcomm",
        "just 799",
        "the S21 Plus",
        "Samsung",
        "the S21 Plus",
        "Galaxy S20 FE",
        "Galaxy S21",
        "1000",
        "two",
        "2,000",
        "Galaxy",
        "12",
        "2400",
        "12 megapixel",
        "200",
        "6.7 inch",
        "10 megapixel",
        "S20",
        "last year's",
        "RAM",
        "4000 milliamp hour",
        "2021",
        "Galaxy S20"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "LAW",
        "ORG",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE",
        "PRODUCT"
    ]
}