{
    "id": "ZzpDWZtOn7M",
    "title": "OnePlus 7T: Honestly? You Don't Need A Pro",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-09-26T15:01:53Z",
    "video_url": "https://www.youtube.com/watch?v=ZzpDWZtOn7M",
    "category": "Science & Technology",
    "tags": [
        "oneplus 7t review",
        "oneplus 7t hands on",
        "oneplus 7t first impressions",
        "oneplus 7 review",
        "oneplus 2019",
        "best smartphone 2019",
        "best phone 2019",
        "mrmobile",
        "android central"
    ],
    "views": 574413,
    "likes": 14587,
    "comments_count": 915,
    "description": "Sponsored by Visible. Join the future of wireless here:     [ONEPLUS 7T FIRST LOOK / ONEPLUS 7T HANDS-ON]  I may not have the conviction of my colleague Hayato at Android Central, who recently declared the OnePlus 7T to be his favorite phone of 2019  but I do get where he's coming from. For $599, the OnePlus 7T gets a lot right, and it feels more in line with the company's device lineage than the slightly \"extra\" OnePlus 7 Pro. In fact, I'm in agreement with Michael Josh Villanueva over at GadgetMatch: the OnePlus 7T also feels like the phone OnePlus should have offered *instead* of the OnePlus 7 Pro (at least at first). But with the Pixel 3a trailing it by $200 and the new iPhone 11 at just a Benjamin more, the OnePlus 7T has to nail almost every detail to justify its pricing ...  and the toughest part for any phone  the camera  has never been OnePlus's strong suit. Join me for part one of MrMobile's two-part OnePlus 7T Review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S ONEPLUS 7T HANDS-ON / ONEPLUS 7T FIRST IMPRESSIONS]  MrMobile's OnePlus 7T First Look / OnePlus 7T Hands-on was produced following two days with a OnePlus 7T review sample provided by OnePlus. Preproduction unit running prerelease software. MrMobile does not produce paid or sponsored reviews; OnePlus was not offered copy approval and no compensation was requested or provided in exchange for this coverage.    [LINKS]  OnePlus 7T Review [Android Central]:   OnePlus 7T Hands-On / Unboxing [GadgetMatch]:   OnePlus 2 Review [Pocketnow]:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links, which afford Mobile Nations a commission if you make a purchase. See Mobile Nations' disclosure policy for more details:   #oneplus7t #oneplus #oneplus7 #oneplus7pro #smartphones #tech #technology",
    "description_links": [
        "https://phon.es/mmvisible",
        "https://www.youtube.com/channel/UCSOp...",
        "https://youtu.be/IvccyG7EMfo",
        "https://youtu.be/khidD3DuvJQ",
        "https://www.youtube.com/watch?v=O_A5Eo9dcr4",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] This video is sponsored by Visible. OnePlus got where it is by starting with a pitch no one could ignore. It offered a phone almost as good as the most expensive ones out there and it sold it at literally half the price. Well the six years since have seen some changes, people are keeping their phones longer. Less expensive phones are rising in quality, and OnePlus phones, they've gotten more elaborate and more expensive. Well this is the OnePlus 7T. It comes out on October 18th. It costs $100 less than the cheapest iPhone 11, but it also costs $200 more than Google's excellent budget Pixel. Is it the perfect middle ground? I'm MrMobile, my thoughts after 24 hours. (upbeat music) The OnePlus 7T strongly resembles the more expensive OnePlus 7 Pro, but those pro features, I don't miss 'em. I mean that pop-up camera is kinda cool, but the only purpose it serves is to eliminate the notch on the Pro, and I don't mind this little teardrop one on the 7T. Ditto the pros curved glass screen. Sure, it looks cool, but it's more prone to accidental inputs. The flat screen on the 7T and the fact that it's slightly smaller makes it easier to use. It's still AMOLED for excellent color in contrast and it still refreshes 90 times a second, for the fluid responsiveness that the hardcore OnePlus user expects, and even people who don't know any difference appreciate. Even the fingerprint sensor is the same. In my experience, the quickest and most reliable under display scanner out there. The only downgrade I can see is the reduced display resolution, but even when I'm looking for it I can't tell the difference enough to be bothered by it. And the higher max brightness of this display, brighter than anything OnePlus has fitted to a phone before, more than makes up for it in my view. It's too early to say how well the battery holds up, but I'm not all that worried. First it's only 5% smaller than the big battery on the Pro and second, the newer phone's battery optimization means you'll get from zero to a 100% in just one hour, that's the claim anyway I still have to test it. And OnePlus probably should have called this the 7O, as in oh my god, look at that camera. Like it or not this seems like it's gonna be de rigor for 2020. More importantly the eyeballs inside the Oreo are again, familiar from the Pro. It's the same 48 megapixel primary, flanked by the same 16 megapixel ultra-wide and a 12 megapixel telephoto. The only notable step-down, it's got 2x instead of an 3x magnification. But, and this is becoming a habit, there's a new capability too. Macro photography that lets you get closer to a subject than with any other phone. Well with the exception of the newest Huawei phones. I asked that this could come to other OnePlus phones, it turns out OnePlus had to use custom hardware for this. A motor which changes the physical distance between the lens and the sensor in the ultra-wide camera. I'm looking forward to taking some foodie shots with this. Not that I'm saying I'm really excited to be back on a OnePlus camera. For a little context, I used that Galaxy Fold review device that you saw in my previous video for these few side-by-sides. The Fold has the same camera arrays the Galaxy S10, so it makes sense, many will be cross shopping the two phones. Now the good news for OnePlus is that it has improved its camera software and it'll be adding new features like 4k wide-angle video and super slow-motion soon. That means you shouldn't take these samples as representative of final software. The bad news for OnePlus though is the iPhone 11 and Google Pixel 3a that bracket it, have some of the very best mobile cameras you can buy. So the 7T is going to have to deliver in a way that frankly, we've never seen OnePlus do before. The phone does play to the company's strengths in the areas you'd expect and I'll go into that after a quick word from a carrier whose sim you might want to consider popping into this phone. That carrier is today's sponsor Visible. If no annual contracts, no hidden fees and no pushy salespeople sounds good to you, visible is a wireless carrier you should look into. For $40 a month you get unlimited data, messages and minutes on Verizon's 4G LTE network. That includes mobile hotspot. I've been using it from the city to the boonies for a few weeks and I've been very impressed with everything from coverage to speeds. And if you sign up soon you'll get no speed caps, so you can use that network as fast as you like for as long as you stay a member. You can even get $100 in virtual credit if you bring your own phone. Like the OnePlus 7T, which will be compatible with Visible in the coming months. Join the future of phone service at the link in the description below, and thanks to Visible for sponsoring this video. Like I was saying OnePlus does play to its strengths when it comes to software. The 7T ships with the latest Android 10 right out of the box, on top of which sit only those customizations its customers want. Like a customizable shelf, user-defined accent colors, a dedicated switch to silence the ringer, and if that's not enough to keep your heart rate in check, a put your phone down Zen Mode, that frankly, I could really use about now. Wrapping it up, the phone runs on the expected top-tier hardware, absent the typical omissions like micro SD, water resistance and wireless charging. Typical, that is, for OnePlus. I asked if this obsession with chasing the top tier silicon and the fastest storage available was really worth it, when phones like the Pixel 3a deliver great performance on much more modest hardware. And OnePlus told me its users appreciate a phone that performs well not just today but down the line as well. To run not just everyday apps but the demanding stuff too. How well the 7T delivers on that front is one thing I wanna cover in my follow-up video. Along with phone calls, audio, battery life and the ultimate worth of those cameras, running unfinished software. But if I sound bullish on this phone right now, I am. I mean it didn't really like the 7 Pro, but otherwise OnePlus has a great track record for really good products. Like my friend Michael Josh at GadgetMatch, I think this is the phone the company should have released instead of the 7 Pro. But I'm not quite as enamored as my friend Hayato Huseman at Android Central, who calls it his favorite Android phone of the year. High praise, I look forward to reading his review, which I will link alongside Michael Josh's, down below. If you're already sold you can pick this up via T-Mobile or unlocked on October 18th for a buck shy of $600. Please subscribe to themrmobile on YouTube, so you don't miss my video follow-up. This first look made possible by a OnePlus 7T review sample provided by OnePlus. But MrMobile does not produce paid reviews nor provide copy approval to companies whose products that cover. That means OnePlus is seeing this for the first time, right along with you. Special thanks to Android Central for additional footage. Until next time, thanks for watching. And stay mobile my friends. (relaxed electronic music)",
    "transcript_keywords": [
        "OnePlus",
        "phone",
        "Pro",
        "phones",
        "OnePlus phones",
        "Visible",
        "camera",
        "video",
        "Android",
        "expensive",
        "Android Central",
        "Android phone",
        "expensive OnePlus",
        "Pixel",
        "OnePlus camera",
        "expensive phones",
        "Michael Josh",
        "battery",
        "good",
        "software"
    ],
    "transcript_entity_values": [
        "Huawei",
        "200",
        "OnePlus 7 Pro",
        "2020",
        "First",
        "3a",
        "LTE",
        "7",
        "Galaxy Fold",
        "half",
        "GadgetMatch",
        "Oreo",
        "4k",
        "T-Mobile",
        "12 megapixel",
        "the six years",
        "Zen Mode",
        "a few weeks",
        "Hayato Huseman",
        "the year",
        "YouTube",
        "90",
        "the Galaxy S10",
        "10",
        "only 5%",
        "the OnePlus 7T.",
        "Android Central",
        "October 18th",
        "annual",
        "the coming months",
        "today",
        "OnePlus",
        "Michael Josh",
        "first",
        "Fold",
        "max",
        "Michael",
        "Google",
        "the 7 Pro",
        "two",
        "3x",
        "4",
        "2x",
        "Pixel",
        "just one hour",
        "OnePlus 7T",
        "40",
        "100%",
        "600",
        "zero",
        "second",
        "Visible",
        "Google Pixel 3a",
        "48 megapixel",
        "100",
        "16 megapixel",
        "Verizon",
        "MrMobile",
        "Michael Josh's",
        "micro SD",
        "one",
        "Android",
        "24 hours"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "EVENT",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "TIME",
        "PRODUCT",
        "MONEY",
        "PERCENT",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME"
    ]
}