{
    "id": "ZZUMv6RAKa4",
    "title": "IF THE SAMSUNG Z FLIP 5 SURVIVES…  I'll Switch.",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-08-28T13:47:00Z",
    "video_url": "https://www.youtube.com/watch?v=ZZUMv6RAKa4",
    "category": "Howto & Style",
    "tags": [
        "Z Flip 5 durability test",
        "Samsung Z Flip 5",
        "Z Flip",
        "Folding smarpthone",
        "Folding phone",
        "Z flip 5 scratch test",
        "z fold 5",
        "mobile game",
        "iphone",
        "apple fold",
        "flip 5"
    ],
    "views": 2077440,
    "likes": 54947,
    "comments_count": 2236,
    "description": "After 4 Long Years - It might be time to Upgrade My Phone... If the Samsung Z Flip 5 survives.... Ill use it. If you're interested in one of dbrands Grip casaes for the Flip 5 - this link is for you:  If you're looking for a teardown skin - I got you HERE:  Teh Samsung Z Flip 5 is a 5th generation folding phone from samsung - The smaller brother to the Z Fold 5. A pretty cool little flexible folding smartphone. Ive had my eye on it for awhile... It might just be time to upgrade... IF the Z Flip 5 survives.  Get the Z Flip 5 at Samsung:   Follow me for updates!  Instagram:   Facebook:   Twitter:    LARGE tool kit:   Travel Tool Kit:   Mega Tool Kit:   Plastic Pry tools:   Metal phone opening tool:   The camera I used to film this video:  (GH6   The Lens I used for this video:   Wide angle lens:   And this Metabones adapter:   This is the drone I use:    TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video. JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video. Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result. Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://www.dbrand.com/shop/grip/galaxy-z-flip-5-cases",
        "http://www.dbrand.com/teardown",
        "https://howl.me/ckF4arLCxC8",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://amzn.to/3JEuTXs",
        "https://www.youtube.com/@JerryRigEverything/about"
    ],
    "transcript": "I've been using this Samsung Galaxy Note 10 for the past 4 years, and it's done a great job. No complaints. My dbrand grip case has kept it totally safe...minus the time my phone accidentally dropped face down on a granite threshold and shattered the curve of the glass. But that's more Samsung's fault for making a curved screen in the first place. However, that one drop left my screen totally inoperable, meaning I was completely off-grid, away from home on a business trip. If I had this phone, however, the Flip 5, the outer screen might have broken while still leaving the inside screen fully functional since there's two. It would have been very convenient. Today we're doing the durability test on the Samsung Z-Flip 5. And if it survives, it might just be my next daily driver. Let's get started. [Intro] Like usual, and like with any Folding Phone, the first time we turn the thing on it gives us a massive list of things we can't do...like don't press too hard on the screen, don't fold the phone with things inside, and sand may cause damage...all of which sound like really fun activities. Comparing the Flip 5 with the Motorola Razr Plus, we see that the form factors are nearly identical. The Flip 5 is just slightly shorter, but the thickness is basically the same, and the width, with just some slight differences in the front screen shape. The red Motorola has a bit more pixel real estate, but both are great looking phones. And I'm a big fan of the form factor. Looks don't matter very much though if it can't survive being in my pocket for the next 4 years, since I do keep my phones for a long time. The biggest changes Samsung has made is obviously that larger front screen and a redesigned hinge which allows the phone to fold completely flat. So let's start with the front screen. This is the surface that will most often be rubbing against the inside of a pocket or a purse. So it's good to know how scratch resistant the glass is. Plastic scratches at a 2 or 3, sapphire scratches at an 8 or 9, and luckily, like we see here on the Flip 5, we start seeing scratches at a level 6 with deeper grooves at a level 7. Samsung is using Gorilla Glass Victus 2. I thought about writing out a new number strip for the inner screen, but we all know that would be a waste of paper since the inner flexible screen historically doesn't make it past a 3. You can see the point of my plastic tip Mohs tool marring the surface at a level 2, and leaving deeper grooves on this $1,000 smartphone at a level 3. Fingernails leaving marks are still very much an issue with the Flip 5 flexible display, and Samsung is very right to warn everyone about pressing too hard on the surface. You can see a pre-installed screen protector near the front facing 10 megapixel selfie camera. Remember, this is the one we're not supposed to remove. The plastic screen protector is also applied over another layer of plastic, so even if it was gone, the screen would still be scratching at levels 2 and 3. Samsung does offer a one time free screen protector replacement though, which unfortunately has to be done by them at their repair facilities. The front bumper which keeps the soft screen layers from touching while closed is made from plastic. I may regret this comment in 50 years, but I don't think we are ever going to see a folding smartphone with a screen made from something harder than a 2. The armor aluminum is scratchable. The power button doubles as a fingerprint scanner and is located right where it should be. The metal volume rocker is removable. Kind of fun. The top of the Flip 5 has more anodized armor aluminum, along with the entire left side. It's interesting that the SIM card tray is kind of scrunched over off-center over to the edge of the frame...probably to make room for the expandable storage. Just kidding. It's only a singular SIM card. There is a rubber ring for water protection, but it's a huge bummer that memory can't be upgraded, especially when I plan on using the phone for years to come. I feel like this move is intentional on Samsung's part to keep people from using their phones as long as I do. I'm not a fan. The bottom of the phone has our microphone, 25 watt USB-C charging port, and the lower stereo loudspeaker. The back panel is made of another slab of Gorilla Glass Victus, so no Art Class with Jerry today. The spine of the newly designed flex hinge is made with aluminum. Making our way up to the rear cameras, which can both be classified as selfie cameras since we have another screen on this side. There's a 12 megapixel ultra wide angle lens, and a normal 12 megapixel camera, both protected by glass, along with one single tone LED flash. I posted a video last week on my studio setup, so if you want to see a bit behind the scenes, I'll leave a link at the end of this video. Now with folding phones I usually do a fun little dirt test since dirt can really grind some gears, literally and figuratively. But since Samsung asked so nicely for no dust when we turned the phone on, I decided we should skip the dirt test and keep the phone clean. Just kidding. Playing in the dirt makes me happy and it also makes the Flip 5 happy as we can all very clearly see. The 8 in the IPX8 water resistant rating of this phone means that it would probably sit just fine, about 1 and meters deep in fresh water for 30 minutes. But the X of the IPX8 raiting probabaly means that X marks the spot so we should throw it in a hole and bury it like a pirate. We got the Flip 5 munching rocks like a Graveler Goron or unsupervised 2 year old. And even then the 5 is still mostly able to avoid any dirt inside the hinge. I do feel a little more resistance and hear more noise than usual, but nothing that's killed the phone yet. I think Samsung is definitely right to suggest not letting it get dirty, but at the same time this test shows that it doesn't need a sterile clean room either, which is good news for me. The inner screen of my Flip 5 is a flexible 6.7 inch AMOLED 2X 120 hertz at 1080p, and lasts for about 15 seconds before the outer plastic layer starts bubbling and melting. This test is relevant because...oh, hey look! We have another screen to light on fire. The front display is an oddly shaped 3.4 inch 720p super AMOLED panel, which also lasts about 10 seconds before the pixels start to go black and turn off and mostly not recover. Speaking of not recovering, we have already scratched up the power button which doubles as a fingerprint reader, and with that minimal damage it was able to scan and set my fingerprint relatively normally. But after adding additional scratches, the capacitive sensor completely lost all functionality and is not allowing me to enter the phone anymore. Some scanners do survive the extra abuse so it's just something to be aware of. Not a deal breaker, but what would be a deal breaker though is if the phone actually broke. If you remember last year with the Flip 4 durability test, we heard some strange noises during the reverse flex. If we try the same thing again this year with the Flip 5...so far so good. Even with all the scratching, burning, dusting, and now flexing, the Flip 5 new hinge and rear slabs of glass keep the phone from bending too far back, avoiding the absolute catastrophes we saw on the Pixel Fold. The Samsung Z Flip 5 survives. I am sad about losing the SD card slot, but if the Flip 5 has battery pull tabs inside like the Fold 5, it looks like I just might have found my new phone. We'll find out for sure during the teardown. Luckily, even though this Folding phone is incredibly complex, the smart folks over at dbrand have still been able to send me a pre production grip case, which means not only will my outer screen now be protected from drops, bumps, and abuse, it also means I can keep using my own Teardown Skin. Teardown is exposing the insides from the outsiders now on more than 100 different devices. I'll leave a link down in the description if you want to grab a Teardown for your own phone or tablet. True happiness resides on the insides. And you can buy that inner happiness down in the description. Hit that subscribe button if you haven't already. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Samsung Galaxy Note",
        "Galaxy Note",
        "screen",
        "Flip",
        "Samsung Galaxy",
        "phone",
        "Samsung",
        "front screen",
        "Gorilla Glass Victus",
        "screen protector",
        "Folding Phone",
        "glass",
        "phones",
        "Galaxy",
        "Note",
        "front",
        "Plastic",
        "test",
        "inside",
        "time"
    ],
    "transcript_entity_values": [
        "AMOLED",
        "Motorola",
        "3.4 inch",
        "Samsung Z-Flip 5",
        "Graveler Goron",
        "Flip",
        "9",
        "1,000",
        "6",
        "8",
        "SD",
        "next daily",
        "Flip 5",
        "1080p",
        "Folding Phone",
        "two",
        "Teardown",
        "the Fold 5",
        "2X",
        "Jerry",
        "IPX8",
        "Folding",
        "IPX8",
        "years",
        "25 watt",
        "Teardown Skin",
        "6.7 inch",
        "about 15 seconds",
        "12 megapixel",
        "the past 4 years",
        "30 minutes",
        "last week",
        "4",
        "SIM",
        "the Motorola Razr Plus",
        "this year",
        "the next 4 years",
        "5",
        "50 years",
        "USB-C",
        "the Pixel Fold",
        "Galaxy Note 10",
        "first",
        "last year",
        "Samsung",
        "today",
        "2 year old",
        "the Flip 5",
        "Today",
        "3",
        "10 megapixel",
        "one",
        "7",
        "about 10 seconds",
        "more than 100",
        "about 1 and meters",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "LAW",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "DATE",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "EVENT",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL"
    ]
}