{
    "id": "ZZWMxwcFZOc",
    "title": "We've NEVER seen cooling like this! - Poco F2 Pro Teardown!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-06-05T13:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=ZZWMxwcFZOc",
    "category": "Howto & Style",
    "tags": [
        "Pocophone f2 pro",
        "poco f2 pro",
        "pocophone",
        "cheap smartphone",
        "best android",
        "F2 pro teardown",
        "Pocophone 2",
        "Pocofphone F2 Pro Teardown",
        "F2 Pro cooling",
        "heat pipe",
        "vapor chamber",
        "best smartphone cooling",
        "take apart poco f2 pro",
        "disassembly f2 pro",
        "poco f2 pro battery",
        "flagship killer",
        "poco f2"
    ],
    "views": 1951804,
    "likes": 81392,
    "comments_count": 4439,
    "description": "The Pocophone F2 Pro is ready to be taken apart. You can see the inside of your own phone with my dbrand skin HERE:  Its much safer. The Poco F2 Pro had a motorized camera. I say 'had' because between this video and the and the durability test... the PocoPhone F2 pop up camera stopped working. Today we are going to see what went wrong with that pop up camera. And see if this Poco Phone F2 will still work when we put it all back together again.   For real though. Be nice. Listen. And VOTE for the change you want to see. Visit  it takes less than 2 minutes to register to vote.  PocoPhone F2 Pro durability test:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.dbrand.com/teardown",
        "https://www.vote.org/",
        "https://youtu.be/PKZr3RQdci0",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "*pen click* *writing sounds - pen on paper* Some things are more important than technology. Today we're going to be taking apart the new Pocophone F2 Pro. The camera has totally stopped motoring up and down it's just broken...you know...kind of like the United States right now. We'll have to see what's causing the problem from the inside. Let's get started. [Intro] The Pocophone F2 Pro doesn't have a water resistance rating, but it does have adhesive holding down the back glass panel just like we see on every glass sandwich design. Poco has said they have a vapor chamber inside that coves 28% of the phone. So it should be interesting to uncover that as well. Once the adhesive is sliced all the way around the outside, I can start to twist the back panel off. The camera units do have adhesive on them as well, which is outside of the norm. This phone looks pretty darn good inside with the quad camera array and the orange battery pull tab. Up here at the top we can see that the pop up camera still won't press down inside of the phone. It's very securely sprung up into place. We'll have to remove these 17 screws holding down the plastics, and once those are unscrewed the plastic protection can pull away exposing the stepper motor in charge of moving the camera. The camera contraption is still very much stuck. Interesting that it's got a red rubber ring around the motor housing. I'll disconnect the battery and the two other ribbon cables down along the bottom of the motherboard...just like little Lego's. The camera mechanism itself is mounted underneath the motherboard, so I'll pop off 2 more screws, once of which is a large silver standoff, you know, one of those screws within a screw. I'll use a flathead screwdriver to twist this around at an angle. Once it's gone I can pop off the large camera ribbon and the earpiece ribbon and very carefully start maneuvering the motherboard out of the phone. We can see now that the camera has a built-in spring probably for safety to help keep the motor from getting damaged. Or to protect the internal shaft of the motor from getting bent if the camera accidentally hits anything while protruded. Removing the motor shows that this is definitely the component that's causing all the issues. It's totally seized up. Normally we can manually slide this mounting point up and down the threaded screw cuz the motor usually rotates freely. But this time it's very much stuck. Even my large channel locks can't get it to budge. It's strange that one little component can cause so much frustration. I thought we might be able to swap the motors with another phone. So I grabbed a K20 Pro from last year which has the exact same motor size and shape as the Pocophone F2 Pro, but it turns out after opening up the entire phone that the contact points for this motor are in different spots, which makes them impossible to interchange. Rather unfortunate. We'll just have to see if the selfie camera will still work without the motor installed when I turn it back on. The camera does slide up and down freely...it just won't motor anymore. Now we know that we shouldn't be pile-driving fragile moving parts. Learn something new every day. Xiaomi has made the battery easy to remove with these pull tabs. The adhesive is still pretty strong underneath though. Strong enough to break the pull tabs. But even if it does break, at least the glue isn't permanent. I can still pry it out with a pry tool easy enough. This 4700 milliamp hour battery can charge up at 30 watts. The bottom loudspeaker can pop off next. This guy does have water-resistant mesh. It's good to see some layers of protection, but there are no sound dampening balls inside. I'll remove the two wire cables and unplug the optical underscreen fingerprint scanner. And of course, take out the SIM card tray. Finally, the USB-C charging port can lift up and away from the phone. The dual SIM card slot is actually pretty cool. It has pins on both sides of the metal housing so it can read from more than one SIM card at a time if they're both inserted. This is more common on international phones for people who travel between countries or have more than one phone number. The small circular vibrator is here right in the center of the phone. And the underscreen fingerprint scanner is actually sitting between the metal frame of the phone and the screen, and definitely not accessible without removing the display. It's interesting to note however that the vapor chamber of the Poco F2 Pro is strangely not made from copper. It is massive but it's made from aluminum...still metal conductive and efficient at removing heat, but not copper like we see on most other phones. It's placement though is pretty brilliant. Instead of the vapor chamber being sandwiched between the processor and the frame of the phone, this F2 Pro has the entire vapor chamber right underneath the screen so it can dissipate the heat more quickly and efficiently through the screen without having to go through extra layers of foam, since each of those internal layers acts as a little blanket keeping the heat inside. Plus, if you look closely, there is copper inside of the chamber, along with liquid that you can see quickly evaporating as it's exposed to the air. It uses that internal copper mesh to wick its way between the hot and cold areas inside of the chamber. Pretty darn cool. Thumbs up for that. The size and location might make this the best implementation of a vapor chamber that we've ever seen. I'll get the charging port board put back into place. It's time to see if the camera will still work without the camera motor. Now, you might be thinking, 'Hey Jerry, isn't it like super dangerous to put that lithium battery back on top of the sharp slices of exposed metal?' And the answer is to that is yeah. Lately some people respond to dangerous situations by closing their eyes, saying fake news, rolling out the military, and hoping the problem just disappears. So we're going to try that method here with this dangerous situation. You know, just trying to avoid it like a child would. The phone might work for a second, but yeah, eventually it's going to blow up because facts, just like humans, really do matter. There is quite a bit of copper on the back side of the motherboard. This is what comes in contact with that vapor chamber. The depth sensor, wide angle and 64 megapixel main camera, along with the 5 megapixel telephoto camera all do not have optical image stabilization. So that would be something to consider if planning on buying this phone. OIS is kind of important. I'll get the motherboard situated down into place over top of where that camera motor used to be. And I can gently clip in the front facing camera sensor along with the earpiece, long extension ribbon, loudspeaker, and finally the last thing I plug in is the battery connector. I'll get the top plastics in place, and lucky for us the whole thing still turns on and functions just like normal. I'll open up the camera app. It does tell me that the selfie camera can't open, which is kind of to be expected since the motor is literally sitting outside of the phone. And if I poke the Pocophone's top camera just right with my razor blade, I can still pry it up and take pictures with it. Rather impressive actually. I'm impressed that the Poco F2 Pro survived all of this, even if I do now have to use a razor blade to take a selfie. I've got a massive international giveaway coming up with an absurd amount of phones. So make sure you're subscribed so you don't miss it. Gotta spread some joy during these unique times. If you want to see the inside of your own phone without all the risks of taking it apart, I'll leave a link for my Teardown Skin in the video description. We cover basically most every major smartphone, but most importantly, let's all be nice to each other. Protest peacefully. Vote. And good things will happen. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "camera",
        "phone",
        "motor",
        "writing sounds pen",
        "camera motor",
        "Pro",
        "pen click",
        "vapor chamber",
        "inside",
        "Pocophone top camera",
        "chamber",
        "Pocophone",
        "pen",
        "battery",
        "vapor",
        "back",
        "selfie camera",
        "pen on paper",
        "motherboard",
        "phones"
    ],
    "transcript_entity_values": [
        "30 watts",
        "64 megapixel",
        "Lego",
        "17",
        "Instagram",
        "Pocophone",
        "two",
        "Jerry",
        "the stepper motor",
        "Pocophone F2 Pro",
        "SIM",
        "5 megapixel",
        "more than one",
        "Poco",
        "the United States",
        "this F2 Pro",
        "last year",
        "second",
        "Xiaomi",
        "28%",
        "Today",
        "the Poco F2 Pro",
        "one",
        "Twitter",
        "2"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "GPE",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "PERSON",
        "PERCENT",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}