{
    "id": "-7bFulM8a7k",
    "title": "Weirdest MYSTERY TECH yet!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2022-07-16T15:06:58Z",
    "video_url": "https://www.youtube.com/watch?v=-7bFulM8a7k",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "tech",
        "unboxing",
        "austin",
        "austin evans",
        "amazon",
        "how to waste",
        "wish",
        "ebay",
        "inzone",
        "sony inzone",
        "roboraptor"
    ],
    "views": 723945,
    "likes": 22870,
    "comments_count": 725,
    "description": "Thanks to Samsung for sponsoring this episode of MYSTERY TECH! Samsung US -  Amazon US -  Samsung UK -  Amazon UK -    Subscribe to Ken's channel @Denki!  More shenanigans on @thisis:   Subscribe for more!  TikTok:  Instagram:  Twitter:   Chapter Titles ------------------------------- 0:00 Sega Dreamcast 1:35 World's Biggest Mouse (and keyboard?) 3:03 HydraLight 5:06 Samsung T7 Shield SSD 7:14 Codi Robot 8:14 HidrateSpark Bottle 10:05 Sony InZone monitor and headsets",
    "description_links": [
        "https://www.samsung.com/us/computing/memory-storage/portable-solid-state-drives/portable-ssd-t7-shield-usb-3-2-2tb-blue-mu-pe2t0r-am/",
        "https://www.amazon.com/dp/B09VLJ7VBM/ref=twister_B09YW47129?_encoding=UTF8",
        "https://www.samsung.com/uk/memory-storage/portable-ssd/t7-shield-2tb-blue-external-storage-nvme-1050-mbs-mu-pe2t0r-eu/",
        "https://www.amazon.co.uk/dp/B09SBJJ4JW?ref_=cm_sw_r_cp_ud_dp_NBYBQ708BZF5KSK4WA33",
        "https://www.youtube.com/denkitime",
        "https://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "(gentle music playing) - A Dreamcast! That was about eight decibels higher than I thought it was gonna be. I have not actually ever opened a Dreamcast, I was a GameCube kid. Well really, I was a PS1 kid. Whoo! Oh wow, this actually is pretty much complete in box, isn't it? Everything, right? - [Ken] In this complete kit was about like $350, $400, but we bought more stuff. - \"Sonic Adventure\" for the Dreamcast? So here's the big problem with the Dreamcast. It, unlike the PS2 and the GameCube which used its own proprietary thing, basically just use CDs. You could just copy-paste CDs, rip them all day long. But when it came to piracy prevention, eh, it didn't really exist. That is an old school keyboard, and it does have the controller port. Good luck trying to use this with your fancy Windows XP computer. I feel like they just took a regular keyboard, smacked a Dreamcast sticker on it, and then just soldered on a different cable. - [Ken] I mean, it was the cheapest way to make this right? - Yeah. Alright ready, and... - [Matt] Oh, listen to that baby purr! Oh, oh, oh, that was fast! Dreamcast - Alright, play please. I did... Uh-oh, that's not good. I'm not feeling great about our \"Sonic Adventure\" right now. This feels like an adventure- - [Matt] To be fair, he gave us this for free. - Ken, I swear, if you hit it one more- (static crackling loudly) Ah, he just got ran over! (Austin laughing amusingly) - [Ken] This is like every Uber that I've been in in San Francisco. - Yo, this is so much fun. This game absolutely holds up. - [Matt] What are you doing? - Okay, you literally just hit Roboraptor in the- - [Matt] Is his [blank] in his big toe? - Roboraptor's back, okay? I see your comments, everyone's like, \"Bring back Roboraptor!\" My little unboxing buddy is right here. So this item is in a generic box. Is this the world's largest mouse? - [Matt] I found a website that just makes big things of things. - This is a great idea! I love it. Roboraptor, it's a little bit too big for your tiny hands, but he's gonna try to use it. Yo, he's not happy with it. - [Ken] I forgot how on point he is. - Everyone thinks the Roboraptor's remote controlled! He's just this good! I'm gonna lose my job one day and Roboraptor's gonna take my place. - [Matt] Yeah, we would love that. - Yeah, okay. I'm gonna stop joking for one second. This is actually not terrible. (Ken laughing amusingly) - [Ken] It actually looks like it fits your hand. - Okay, okay, okay, you're good, you're good. You're good, buddy. Do I have a computer that can use... Oh my... Wait, no, no, that's too big. - [Matt] What's a big mouse without a big keyboard? - Oh that is... Ah! Actually wait, is this that big of a keyboard? I've lost all sense of scale. I mean, the font is large. Is that that big? - [Matt] I would say that it's maybe like 10% larger. - Ken, you may vomit if you touch that. Capital \"M\" membrane. - Oh, that is the worst membrane too. Roboraptor's about to jump off the table. - Ah, ah, ah! Right, don't step in lasers, I forgot. I've not played \"Portal\" in a very long time. I've gotta do a lot of this hand motion. Look how much I have to twist my hand! - [Ken] But that's how eSports guys actually use their arms to move around a lot. - Ken, at what point do you think I'm an eSports guy? The May 22nd episode of \"Mystery Tech.\" Thanks, man. - [Matt] That poor table. - This table is coming with me to the new set. Do you know what memories have been made on this table, Ken? - [Ken] Look, we're moving- - My son was made on this table. - [Ken] Oh my God. (Austin laughing amusingly) - Jared, please zoom out. I've got an avant guard intro for this episode of \"Mystery Tech.\" Ah! Stop hitting me with things! I'm not ready for it, Ken! The Hydralight runs on water, no batteries required. Did you just get this from like the as-seen-on-TV section of Target? No batteries, no charging, runs on water, lasts for hundreds of hours. That's not how water works. Is this how water works? - [Ken] I mean, hydroelectricity. It's like a dam. - Why does it need to be this big? So essentially it uses water to soak up the fuel cell, but then only works for a little while. Alright. I'm teabagging. - [Jared] Just get everywhere, why don't you! - [Ken] Stop. - No. Someone help me! Not my table! Oh God, it's dripping everywhere! This table has seen too much! Alright- - [Matt] It said shake it vigorously to get off excess water. - [Ken] That's a different light. - Ah. (Austin breathing tiredly) Oh! (Austin spitting dramatically) Ah! Aw, it's so salty! What did I just spray all over myself? - [Matt] Those are the electrolytes! - There's so much salt in my mouth right now. Okay, we've now activated it. Let's see if my Hydralight works. - [Ken] Oh, wow. - Whoa! - [Ken] Who's to say that that already didn't have power though? - Hey you, this is the police! It's actually not that bright of an LED though, like for a flashlight. You can see on camera... I mean obviously, the camera's a little darker than my eyes, but this is not that bright. This is definitely an emergency tool. - [Matt] Yeah. - It's good for 25 years, you put it in your prepper bunker or your tornado shelter. All I can think of right now is how like sticky I now am based on the water that just- - [Matt] Your salty brine water is definitely ruining that desk right now. - Yeah. It's the get paid segment! - Money. - Did you just carefully place an item on the table for the first time in the history of \"Mystery Tech\"? Did you just place two items on the table for the fir... Did you place three items on the table for the first time in \"Mystery Tech\"? These are the Samsung Portable SSD T7 Shield, the sponsor of today's \"Mystery Tech!\" We've had a lot of wonderful, terrific sponsors on \"Mystery Tech\" in the past, but rarely is it a product that we have legitimately used for almost 10 years! The Shield specifically is a more armored more durable, more rugged version of the SSD, which is perfect because I'll tell ya, we don't always treat these things nicely. Up to 1,050 megabytes per second read and 1,000 megabytes write speed. So basically, just over one gigabyte per second over USB, so this is 3.2 Gen2, AKA 10 gigabit. IP65 rating for water and dust resistant. So we typically use these for video editing. However, you can actually connect these to something like your phone, say a Galaxy S22. But I think the real claim to fame here is the fact that these are supposed to be really durable. - [Ken] Oh, that looks nice! - Oh, it's rubbery! Oh, that's cool! I'm just gonna plug this directly in and let's see what happens. USB storage added. Open. There we go. But the nice thing is this works with pretty much any device you wanna throw at it, Windows, Mac, Linux, PS5, you name it. One of the things you have to be a little bit mindful of when it comes to super fast, tiny SSDs like this is the thermals. They can get super toasty. But this nice rubber finish, I bet is gonna help to kinda dissipate some of that heat. And this says it will support a fall/drop resistance up to three meters. Hello friends, I'm gonna do a drop test now. Ready, and... (explosions blasting powerfully) - [Ken] That made a loud noise, oh my God. - That was pretty beefy! It chipped the table, but I bet that if I plug this in right now... I'm gonna plug it directly in and see if the files are still on it. I bet it's fine. I'm gonna plug it in via USB-C. And it pops up immediately, wow. So if you'd like to up your game, definitely be sure to go check out these Samsung T7 Shields available at the link of the description. - [Matt] Why is your phone sticking so far out of your butt? - This? I'm just sitting here, minding my own business. - [Jared] Austin, get down from there, it's a bad influence for your child! - And this is a good influence? The Codi by Pillar, what is this? - [Matt] So this is a product from \"Shark Tank.\" - Wait, but I already have a robot friend. His name is Roboraptor. - [Matt] This is not your robot friend, this is your robot babysitter. This guy here, he's got you covered. - [Ken] Oh, that is adorable though. - [Jared] It looks like a Chao from \"Sonic Adventure!\" - I had to downloaded the Codi parent app. Also micro USB, which as we've established, is illegal and should be prosecuted to the fullest extent of the law. - Please connect me to your wifi! - [Ken] Aw, I did not wanna hear that. (easy-going music playing) (\"Mystery Tech\" crew laughing amusingly) Is it the wifi song? (easy-going music playing) - [Ken] Oh? Oh, let's go! - It's the cult classic, \"The Wheels on the Bus!\" (\"Mystery Tech\" crew laughing amusingly) - [Matt] It just keeps going! - Hold on guys, I feel a hot item coming in. I just gotta like warm up the table. - [Jared] Austin, all that working out, you must be thirsty! - I am for some HydrateSpark Steel! Is it a water bottle? - [Ken] Mm-hmm, a smart water bottle. - Oh, jeez. - [Jared] Did you really have to question if that was a water bottle? - [Matt] Remember when we tried the fork that told you when to eat? - [Austin] Yeah, it didn't work. - [Matt] Yeah, it did! - [Ken] It actually really did. - It really worked! Who needs to be told to drink? - [Matt] Sorry, when's the last time you had a glass of water today? - [Ken] Yeah. - I haven't had anything to drink besides caffeine today, so. - [Matt] So you are the target person for this water bottle. - So you pop it open on the bottom. That doesn't seem like a good idea. So you've got yourself a little connector, a magnetic connector for the USB port. - [Matt] Oh, like proprietary? - It is most definitely proprietary. It's a little magnetic puck that you're gonna lose. - [Ken] Why? No. - [Matt] Yeah. - [Jared] Hey wait, you have to take it out to actually charge it? - You do. - [Ken] That's so dumb! - [Matt] No, dumb! This should just be able to be wirelessly charged on any Qi charger. - Oh my God, yeah. - Yes! - That is 100% what you should do. Oh my God, that's bright! - Okay, that's bright. - To be fair, plugging it in, it immediately synced. Okay, \"Recalibrate your bottle if it is reading low or inaccurately.\" So I need to empty and refill. So, can you please empty the bottle? (gentle rhythmic music playing) Oh, oh, it's starting to leak, it's starting to leak around the lips! Alright, empty. Thank you very much. Okay. We'll put the lid on. It is calibrating, 10 ounces and 10 seconds, or whatever it's doing. So right now, it says that we have to drink 56 ounces of water. Matt, can you come back and drink one more bottle of water for me? (Austin laughing gently) Drink something and then we'll see if it works. Can you get closer to Matt? - It's hard to drink from the straw, (Matt laughing amusingly) like it actually limits the way you can drink. - It's not connecting to the bottle anymore. Also, how do you turn on the RGB? - [Matt] Through the app? - [Ken] Oh, you know what? No, no, no, we didn't finish charging it, that's why it was actually dead out of box. - [Matt] So you're saying I drink all that water for nothing. - For your good health, Matt. Do not throw that, do not throw that! Gently place it. Gently. - [Matt] Oh no! - Gentle, gentle. See, was that so hard? So this is the Sony InZone M9. Now I know a little bit about this because this is part of Sony's brand new gaming line of products. Not to be confused with PlayStation. They've canceled PlayStation, that's over. Instead, InZone is the future! They've got a couple monitors and then I know there's some headsets as well. Oh, speaking of... Okay, so we've got the InZone, the H9, and... I caught that one, the H3. Wow, it's a PS5! - [Matt] It looks exac... No! - [Ken] Wow! - From this angle in particular, that just looks like we stretched a PS5, So one of the things I like about this is that it is a 27-inch monitor. Now, nothing against you if you like larger, big format gaming displays. But for me, 27 inches is the perfect size. - [Matt] Mmm. Mm-hmm. - It's definitely not a normal looking stand. So if you're up against the wall, look how much farther out it has to be to not hit the wall. - Touch the wall, it's fine. - Well, you're now in the wall. - Put it in the corner, put it in the corner. If you look at it on the back, not only do you have what I actually would say is a pretty nice stand. Although it is a little front heavy, so it's a little wobbly when you're actually trying to adjust it. But on the backside, there are a ton of ports. So this has a built-in KVM, which means that you have three USB-As, as well as you have an upstream, and a USB-C. So you could theoretically have say your PS5 and your PC, or maybe your desktop and your laptop all connected to this monitor, and easily switch all of your actual USB accessories and your video at the same time. This does really feel like they're trying to make a do-everything monitor. Alright so actually before we fire up the monitor, why don't we actually take a look at some of these headsets? The thing with the H3 is that this is a fully wired headset. Which at $100, is a little bit of a tough sell? $100 is a fair bit for a wired gaming headset. But I actually will freely admit that I actually typically like to use wired instead of wireless headsets. So we've got nice, easy swiveling cups. I'll say immediately, nothing is creaky or particularly crazy. You've got a decent amount of adjustment. Oh wow, that feels... - [Ken] Air traffic control over here. - No I'll say immediately, they're lightweight. They feel very comfortable, like I could instantly tell you I could wear these for a long period of time and it would not be a problem. While these don't have any kinda like noise cancellation, the passive I can also tell is relatively good. - [Matt] I gotta compare it at $100 to the Xbox ones, which are also fully wireless but also have both Bluetooth and the radio in it. So, you can be connected to literally both your devices at the same time. - And that's something that the H9 does, but that's $300. - [Matt] Yeah. - Alright next up, we have the H9. So this is the high-end InZone gaming headset. Now this I will say is expensive, $300 for a fully wireless headset. But these better be awesome, or otherwise... No, I'm being serious. So you've got a little switch between PC and PS5. But as far as I know, this is the way to connect it. Although like some of the other higher end headsets lately, you can also pair them via Bluetooth to your phone. So theoretically, you could have like Discord on your phone and you could route it into the headphones, as well as getting your game audio from PC or PS5. - [Ken] You actually need for PS5 play a lot. - You don't obviously need that for PC really, but for PS5, it is nice. And now, we have the headset itself. Surprisingly light, even though it's full of like active noise canceling and everything. Maybe a touch heavier than this one, but honestly it feels very similar. In fact I would say not even similar, it feels basically the same. Supposedly between the headsets, you're not getting a big difference in audio quality, it's more so the features. So we've got the headsets, we've got the monitor. Let's actually plug all this in and see. So as soon as I plug the PS5 in, it shows up with the HDR settings. So the following settings have been optimized for your TV. - [Ken] Ooh, it's bright! You can't even see the text on camera! Oh my God. That's very bright, still no. - I'm all the way down. - [Ken] What? Oh. - With the monitor connected to the PS5, it's able to communicate what kind of HDR settings. So as you can see, it immediately popped up and set everything correctly theoretically. On top... Jared, did you just install the PS4 version of \"Gran Turismo Sport\"? I'm turning on active noise cancellation 'cause I don't need to hear this anymore. That's noise cancellation. Alright, talk to me. - [Ken] Test. Hi, can you hear me? - Alright, so that's... Okay, so I've got ambient sound on which sounds pretty good. - [Ken] Alright, can you hear me now? - Standard and active. Okay I can still hear you, but active is cutting out a lot. Now one of the things that the headset does is if I bring this down, you'll see it unmutes myself and I now have TalkBack. So I'm actually listening to myself in the headphones right now. Although there is a dial, I can dial that out. Volume controls and everything with the headset are all communicated. As you expect, these are designed to work well with PlayStation, but you know if you especially have the InZone software for PC, it should work there too. Ken, can you commentate my race? - [Ken] Going into turn one, he hits the RX7. - [Matt] And just immediately crashes, oh God. - [Jared] Oh my God! - [Ken] Oh Jesus, I didn't know he could bend like that. Are you okay? - I'll say the monitor is terrific. But I will say though, the headset does sound good. Obviously, playing \"Gran Turismo\" might not be the best way to evaluate the sound quality- - [Ken] Especially \"Gran Turismo Sport.\" - Yes, 'cause \"GT7\" does sound a lot better. But that being said, looks good, sounds good. I mean if you wanna know more, you can follow Denki's wonderful video all about these products. And I'm sure Ken will be much more illuminating on his \"Gran Turismo\" experience. - [Ken] I'll be playing \"GT7.\"",
    "transcript_keywords": [
        "Mystery Tech",
        "water",
        "Good",
        "table",
        "big",
        "God",
        "Yeah",
        "Roboraptor",
        "Dreamcast",
        "Alright",
        "Gran Turismo",
        "Sonic Adventure",
        "headset",
        "Mystery",
        "Tech",
        "water bottle",
        "Ken",
        "bottle",
        "things",
        "drink"
    ],
    "transcript_entity_values": [
        "first",
        "Ken] Look",
        "Windows, Mac",
        "one second",
        "two",
        "Matt",
        "about eight decibels",
        "Up to 1,050 megabytes",
        "one",
        "a ton",
        "Jesus",
        "10%",
        "Gran Turismo",
        "Portal",
        "eSports",
        "Mystery Tech",
        "about like $350",
        "Chao",
        "Pillar",
        "56 ounces",
        "27-inch",
        "KVM",
        "Linux",
        "PlayStation",
        "Ken",
        "USB",
        "Austin",
        "May 22nd",
        "Codi",
        "Shield",
        "Windows XP",
        "Bluetooth",
        "HydrateSpark Steel",
        "Gran Turismo Sport",
        "SSD",
        "Hydralight",
        "Target",
        "Yo",
        "Denki",
        "100",
        "Ken] Alright",
        "today",
        "10 ounces and 10 seconds",
        "PS5",
        "just over one gigabyte",
        "InZone",
        "3.2",
        "The Wheels on the Bus",
        "one day",
        "10",
        "400",
        "GameCube",
        "RGB",
        "300",
        "Xbox",
        "100%",
        "RX7",
        "Sony",
        "Ken] Mm-hmm",
        "Qi",
        "Dreamcast",
        "25 years",
        "H3",
        "One",
        "up to three meters",
        "Sonic Adventure",
        "USB-C.",
        "almost 10 years",
        "Jared",
        "three",
        "Codi",
        "Dreamcast - Alright",
        "Samsung T7 Shields",
        "Roboraptor",
        "27 inches",
        "Samsung",
        "PS4",
        "Shark Tank",
        "hundreds of hours",
        "second",
        "San Francisco",
        "Ken] Stop",
        "Bring back Roboraptor",
        "Gen2",
        "Ken] Ooh",
        "H9",
        "1,000 megabytes"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERCENT",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "GPE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORDINAL",
        "GPE",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "PRODUCT",
        "QUANTITY"
    ],
    "vector": [
        -0.08848254382610321,
        -0.026127291843295097,
        0.0701625719666481,
        -0.0556788295507431,
        0.0268898606300354,
        -0.06132414937019348,
        0.10147472470998764,
        0.02005024254322052,
        -0.016626404598355293,
        0.06928800046443939,
        -0.006387451663613319,
        0.007304237689822912,
        0.07232648134231567,
        -0.026107339188456535,
        -0.04689965397119522,
        -0.08175887912511826,
        0.06213058531284332,
        -0.10297681391239166,
        -0.02937363088130951,
        -0.004086396656930447,
        0.013022825121879578,
        -0.0321962870657444,
        0.016302485018968582,
        0.01550618838518858,
        0.02105259895324707,
        0.08607561141252518,
        0.011350583285093307,
        -0.06439805030822754,
        -0.05015839263796806,
        -0.04866986721754074,
        -0.04619951546192169,
        0.07235309481620789,
        0.018374959006905556,
        0.008693931624293327,
        -0.007882357574999332,
        -0.08044511824846268,
        0.0620570182800293,
        -0.027392802760004997,
        -0.10003982484340668,
        -0.048864856362342834,
        -0.0329851433634758,
        0.0170780960470438,
        0.0007905359379947186,
        0.0285359937697649,
        -0.05105506256222725,
        -0.01317130122333765,
        -0.036872297525405884,
        -0.16587994992733002,
        -0.013932159170508385,
        0.00031902463524602354,
        -0.04731779545545578,
        -0.05496819689869881,
        0.09954587370157242,
        -0.0014591687358915806,
        -0.013080147095024586,
        0.013905521482229233,
        0.03112325444817543,
        0.01663936674594879,
        0.09322179853916168,
        0.019903477281332016,
        -0.04763008654117584,
        -0.07836524397134781,
        0.0009800471598282456,
        0.019877558574080467,
        0.06198912858963013,
        -0.0204271599650383,
        -0.009729737415909767,
        0.0018043979071080685,
        0.043448612093925476,
        -0.060032740235328674,
        -0.0485311895608902,
        0.07171112298965454,
        0.10045156627893448,
        0.07202739268541336,
        0.07691426575183868,
        0.007031488232314587,
        0.015893619507551193,
        -0.04945652186870575,
        0.058882102370262146,
        0.02370297536253929,
        0.018085842952132225,
        -0.08121410757303238,
        -0.12405494600534439,
        0.006388432811945677,
        0.026880668476223946,
        0.06655700504779816,
        0.016856463626027107,
        0.0029608982149511576,
        -0.05140442028641701,
        0.02921631932258606,
        -0.06579922884702682,
        -0.034253597259521484,
        0.06698644906282425,
        0.05481506884098053,
        0.0016537971096113324,
        -0.03765663877129555,
        -0.019514871761202812,
        -0.0536615215241909,
        -0.03343918174505234,
        0.02001412771642208,
        0.009927798993885517,
        0.03607308119535446,
        0.10016794502735138,
        -0.029256707057356834,
        0.014845659956336021,
        -0.068690724670887,
        -0.048210568726062775,
        0.004526722244918346,
        -0.010524807497859001,
        -0.010431342758238316,
        -0.05700289085507393,
        -0.05874856561422348,
        -0.047308266162872314,
        0.03979640081524849,
        -0.007493126671761274,
        0.04154367372393608,
        -0.013929826207458973,
        0.09633186459541321,
        0.004642008803784847,
        0.018294939771294594,
        0.09995251893997192,
        0.04136790335178375,
        -0.06279630959033966,
        -0.04250557720661163,
        0.040345530956983566,
        0.013878385536372662,
        -0.032676346600055695,
        1.704388932191575e-33,
        0.018119554966688156,
        0.05661053583025932,
        -0.022028880193829536,
        -0.005275677889585495,
        0.04059739410877228,
        0.02302231453359127,
        -0.020987164229154587,
        0.12298791110515594,
        -0.02724318578839302,
        0.08182595670223236,
        -0.0667685866355896,
        0.03790709748864174,
        -0.07154112309217453,
        0.056517764925956726,
        0.03644110634922981,
        -0.024943144991993904,
        -0.06549809128046036,
        0.031061703339219093,
        -0.09352558851242065,
        -0.0071946061216294765,
        0.04676821827888489,
        0.08328497409820557,
        0.029962848871946335,
        -0.06472118943929672,
        0.0756082683801651,
        0.06312067806720734,
        -0.10258587449789047,
        0.013829831965267658,
        0.11166791617870331,
        0.04742495343089104,
        -0.15096615254878998,
        -0.020147712901234627,
        -0.0009321050602011383,
        -0.0019910831470042467,
        0.01506554801017046,
        -0.03970389813184738,
        0.05697479844093323,
        -0.13440963625907898,
        0.01489921286702156,
        0.01648331992328167,
        -0.01274067908525467,
        -0.015821369364857674,
        -0.09771601855754852,
        -0.03710254654288292,
        -0.06162387132644653,
        0.0014776521129533648,
        0.02758575975894928,
        -0.037598636001348495,
        0.009813463315367699,
        0.029752561822533607,
        -0.07347440719604492,
        0.03172962740063667,
        0.012491165660321712,
        -0.03793104365468025,
        0.03553467243909836,
        -0.10922235995531082,
        0.06255119293928146,
        -0.014367509633302689,
        0.09678948670625687,
        0.08379519730806351,
        0.05427855998277664,
        0.052086543291807175,
        0.07589864730834961,
        0.017965320497751236,
        -0.019798092544078827,
        0.013970990665256977,
        0.08993640542030334,
        0.06154422461986542,
        -0.0008304191287606955,
        -0.003909958992153406,
        -0.02923901006579399,
        -0.017695624381303787,
        0.009561890736222267,
        -0.050557442009449005,
        0.03911568224430084,
        0.007490171585232019,
        -0.037244994193315506,
        -0.006090117618441582,
        -0.10299030691385269,
        0.0003474268887657672,
        -0.04194188117980957,
        0.02035178430378437,
        -0.029386315494775772,
        0.04661345109343529,
        -0.013109554536640644,
        -0.02047865465283394,
        -0.011793894693255424,
        -0.05441832169890404,
        -0.07968030124902725,
        0.013536665588617325,
        -0.06317982822656631,
        -0.07353002578020096,
        -0.0008377628400921822,
        -0.004949563182890415,
        -0.07839937508106232,
        -3.399149830965946e-33,
        -0.021327629685401917,
        -0.027354421094059944,
        -0.020517751574516296,
        -0.026558885350823402,
        0.014545736834406853,
        -0.05008199065923691,
        -0.00030480639543384314,
        0.013616750948131084,
        0.004230722784996033,
        -0.044207438826560974,
        0.03162806108593941,
        0.026437940075993538,
        0.030457016080617905,
        -0.03264471888542175,
        0.014139979146420956,
        -0.009682307951152325,
        -0.011535718105733395,
        0.009963910095393658,
        0.04551634192466736,
        -0.03954288363456726,
        0.08309017866849899,
        0.0316578671336174,
        -0.03698479384183884,
        0.03619996830821037,
        0.015203803777694702,
        0.018658874556422234,
        0.036150094121694565,
        0.08366093039512634,
        0.03374866768717766,
        0.051018182188272476,
        -0.006345893256366253,
        0.005664113909006119,
        0.021332884207367897,
        0.009076724760234356,
        -0.0006887144991196692,
        0.01587856560945511,
        0.03642333298921585,
        -0.035356972366571426,
        0.009013191796839237,
        -0.09426753968000412,
        0.019090134650468826,
        -0.023937992751598358,
        0.0011708646779879928,
        0.06498012691736221,
        0.0008448120206594467,
        -0.03801235184073448,
        -0.02938907966017723,
        -0.0026043385732918978,
        0.06000502035021782,
        0.0021689122077077627,
        0.03217993676662445,
        0.013516820967197418,
        0.004523636307567358,
        -0.07225911319255829,
        -0.0780123695731163,
        -0.025908270850777626,
        -0.06103667616844177,
        0.036300837993621826,
        0.04986846446990967,
        0.0032692253589630127,
        0.07091929018497467,
        -0.01826607808470726,
        -0.031328313052654266,
        0.008483619429171085,
        -0.037914030253887177,
        0.033758144825696945,
        0.12828239798545837,
        0.0295780748128891,
        0.007343384902924299,
        -0.04588261991739273,
        0.04104994982481003,
        0.023040395230054855,
        -0.03297673910856247,
        -0.018649563193321228,
        -0.0038960673846304417,
        0.06762323528528214,
        -0.054358694702386856,
        -0.029953936114907265,
        0.03921903669834137,
        -0.03316078335046768,
        9.245909313904122e-05,
        0.028712859377264977,
        0.08063090592622757,
        0.013840763829648495,
        0.06901760399341583,
        0.028195301070809364,
        -0.0053579965606331825,
        0.043811313807964325,
        -0.04206058010458946,
        0.04128088429570198,
        -0.012708887457847595,
        0.04092005267739296,
        -0.06377269327640533,
        0.10584783554077148,
        0.01023371983319521,
        -6.393281637429027e-08,
        0.055110421031713486,
        0.04960564896464348,
        -0.006505495868623257,
        -0.02352972701191902,
        0.06078779697418213,
        -0.08091855049133301,
        -0.023366762325167656,
        0.06118106469511986,
        -0.04906976595520973,
        0.02082500047981739,
        0.00805780477821827,
        -0.054751768708229065,
        -0.007302111480385065,
        0.01748720556497574,
        0.11894576251506805,
        0.056423354893922806,
        -0.09633824229240417,
        0.07629670202732086,
        -0.06304898858070374,
        -0.06022978201508522,
        0.05587168037891388,
        0.046578679233789444,
        0.037069711834192276,
        -0.09835813194513321,
        0.022878320887684822,
        -0.0029812194406986237,
        -0.06877714395523071,
        0.04573419317603111,
        0.040425192564725876,
        -0.02744659222662449,
        0.015354108065366745,
        -0.09307267516851425,
        -0.04223307967185974,
        -0.023135799914598465,
        0.006958770100027323,
        -0.09579669684171677,
        -0.058628443628549576,
        0.016793368384242058,
        0.047793615609407425,
        0.0162328090518713,
        0.001308070495724678,
        -0.11669953912496567,
        -0.026500651612877846,
        0.03665464371442795,
        -0.08580304682254791,
        -0.03994189575314522,
        -0.08761142194271088,
        -0.09544750303030014,
        -0.010087837465107441,
        0.030908500775694847,
        0.0001533725153421983,
        0.04047860577702522,
        -0.0344490110874176,
        -0.000855867110658437,
        0.0986860990524292,
        -0.0011763228103518486,
        -0.014781930483877659,
        0.00431288406252861,
        -0.09167024493217468,
        0.04896152764558792,
        0.044622424989938736,
        0.002388045657426119,
        -0.06486432999372482,
        0.12022864818572998
    ]
}