{
    "id": "-EhDlXx3okU",
    "title": "I made my own RAM! - Micron Factory Tour",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-12-11T18:00:19Z",
    "video_url": "https://www.youtube.com/watch?v=-EhDlXx3okU",
    "category": "Science & Technology",
    "tags": [
        "labs",
        "micron",
        "tour",
        "facility",
        "fab",
        "crucial",
        "memory",
        "gamer",
        "gaming",
        "office",
        "sever",
        "lab",
        "build",
        "DIY",
        "bts",
        "behind the scenes",
        "DDR4",
        "DDR5",
        "cool",
        "tech",
        "gadget",
        "exclusive"
    ],
    "views": 2506915,
    "likes": 111778,
    "comments_count": 5108,
    "description": "Thanks to Micron for sponsoring this video! Learn more about how Crucial by Micron can make upgrading your setup easy by checking them out at:   Linus doesn't travel for projects often anymore, but when Micron invited him out to their 200,000 sq. ft. facilities in Boise, Idaho to make his own RAM from scratch, he knew that he had to go. Making RAM isn't easy, so sit back and take a look at how RAM goes from raw components to powering the device you're watching this on!   Discuss on the forum:    GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:20 Fab 4 tour 3:40 Wafer probing 5:18 Manual probing 7:59 Grinding down the wafer 10:22 Characterization testing 13:08 Checking for issues using X-Ray scanning  14:26 Testing and binning machine 16:01 Assembling and manually fixing our modules 22:15 Cutting machine 24:01 Validation labs and MoBo hall of fame 26:04 Anechoic chamber testing 27:08 Putting our RAM into a PC! 30:29 Outro",
    "description_links": [
        "http://crucial.gg/LTT",
        "https://linustechtips.com/topic/1473331-i-made-this-ram-you%E2%80%99ve-never-seen-before-micron-factory-tour-sponsored/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Idaho is well-known around the world for chip production, (chip crunches) but here at Micron's memory R&D Center of Excellence in Boise, it's a different kind of chip that gets all the attention. Behind me is over 200,000 square feet of cutting edge silicon development, fabrication, and testing facilities. And thanks to Micron's sponsorship, I will be bringing you guys deep under the hood. Not just theoretically, very lithography, much soldering, et cetera. A key condition of my visit today was that I would be allowed to actually use the equipment and build my own DDR5 memory kit for my next system upgrade. And well, I'm here, aren't I? So, let's go! Oh my goodness. (laughs) This is a really big parking lot. Boise main site, as it's known, already hosts a small army of high-tech workers, nearly 9,000, and many more are coming as part of a $15 billion investment plan that we'll see up to 600,000 square feet of sustainable clean room manufacturing space brought online starting in 2025. But it's raison d'etre today is completely different. I'm about to enter Fab 4, which contains many of the same incredible etching, polishing, and implantation machines that we saw in our Intel Fab tour. The difference is that not a single wafer that comes out of these multimillion dollar machines will ever touch the hands of a Micron customer. That's right. This entire Class 100 clean room exists for the sole purpose of testing new production techniques that Micron can then deploy at their manufacturing centers in Taiwan, Singapore, Japan, and Virginia. They couldn't even tell me the names of some of the emerging memory technologies that they're validating in here. But what I will tell you is that it's way more advanced than even the high density 1-beta node DRAM and 232-layer NAND that Micron is currently shipping to customers. What they were able to tell me though is that as part of the development of their upcoming 1-gamma and 1-delta nodes, they're currently installing one of ASML's state-of-the-art extreme ultraviolet or EUV lithography systems. And EUV is absolutely wild. This is worth more than my car, my house, my office, and my life. One of the challenges with EUV is that the wavelength of the light is so small that it gets absorbed by glass. So then, with lenses out of the picture, ASML had to resort to a system of mirrors that are manufactured to literally atomic precision in order order to direct the light through the mask. They were giving me some fun speeds and feeds for this boy. Apparently, it weighs over 180,000 tons and took three 747s just to ship all the parts here for it to be assembled. Unbelievable. Now, you might think then that with the right equipment, manufacturing REM is simple, right? I mean JEDEC creates a specification and assuming you've got deep enough pockets for ASML's shiniest new toy, you just follow the recipe, right? Well, I asked some Micron folks if that's how it worked and... (Micron staff laughs and claps) That's fair enough. I mean, even ignoring the challenges inherent with building something that's never been built before, a lot goes wrong when you're building nanometer scale features onto silicon, and specialized tools are needed to diagnose these problems. Meet the UF 3000 wafer probing machine. This thing is super cool. Our FOUP full of dies comes in here, gets sucked into the machine, aligned via the notch on one side of the wafer, Then, slid over here under one of these guys. Then, through a combination of machine vision and manual input, these little tiny wires are actually lined up with the individual dies, which can then be tested to ensure that they're functioning as expected. Spoiler alert, a lot of the time, they don't. From this screen, I can pick any die I want anywhere on the wafer. Say, that one. And the chuck will reposition, so that my probes should be exactly above the contact points on that die. We can actually check this by going to, it's image display change. Is that right? And there it is. You can actually see we tested this one, because there are ever so light contact points from the last time those tiny hairlight probes touched them. That's all you need to make, electrical contact with these things and find out just how well they're working. Once everything's aligned, the engineer uses this station to run test patterns, which can either reveal a fully working die or one that needs further investigation, investigation that may not be able to be done automatically. That's where manual probing comes in. Now, to be clear, if you're just running basic tests, you would never set up at a station like this. This is for deep investigations into what's going on with brand new silicon out of the Fab. And there are a couple of key benefits to doing it this way. One, you don't tie up an auto-prober for hours or days at a time. And two, we're actually able to probe the die even more precisely than with the auto-prober. So, we just need to look around. Actually, can you guys show me one of the picoprobe points? - Yup. - Oh, I gotta zoom in. I can't even see it. - So, if we change the focus here... - [Linus] Holy crap. - So, if we go back out, and then you zoom in. - Are you flipping kidding me? You guys already saw how small those probe pads were? These are picoprobe points. These will tell us not just what's happening on the IO of the die, but what's happening inside the die. All right, you guys see this? That's a picoprobe. It looks like a piece of dust on the glass. You're never gonna see it, Andrew. - [Andrew] Yeah. - You don't stand a chance my man. Wait, so you guys are expecting me to land this? It seems like you're setting me up to fail. Was that enough? They started movin'. Moving magic. We're moving over to one that they already landed for me, 'cause they were apparently expecting me to ram the probe into the die, which I did not do by the way. Anyway, the point is this is super cool. You can see this one's landed. You can also, see the scribe marks that help with machine vision orientation, and that will disappear when swamp, swamp, the space between the die is actually cut away. It's extremely small. My bud here is gonna try and land the picoprobe. What's really cool is you don't even have to hit probe points with picoprobes. You can actually hit individual wires if the wafer has not been passivated yet, which is like a protective layer that goes over top of it. Man, it's amazing how big that probe looks relative to the die. Like what? Oh. Oh, you missed. - Yup, that's... You have to get the angle just right. - Yeah. - So, it has to just bend on the top of it. - That's fine. I think, the people get it. It's really hard. Now, the keen-eyed among you might have noticed that this wafer on the manual probe machine here has been cut in half. That's for good reason. When you're working on early parts, every wafer is precious, and you want as many engineer's eyes on them as possible. So, by cutting them in half, you double the number. And so on and so forth, until finally as a team, you've managed to find and squash all the bugs, yielding a working wafer from the Fab. And here it is. But before we can encapsulate these dies and build them into working memory modules, there are a couple more things we need to do. Starting with thinning. You see this is too thick to build into a working memory die, especially if you're stacking them on top of each other, something micron is intimately familiar with. So, our first step is to put it in this machine where a thin plastic protective film will be applied to the entire wafer. After that, our wafer gets flipped upside down onto that plastic layer, and goes into the grinder. As advertised, it grinds our wafer down to a thickness Micron would not specify for me, but suffice it to say a lot thinner, and applies it to a blue sticky back piece of plastic just like this one. And the reasons for this are twofold. First of all is the fact that thinned wafers tend to do what they call an Idaho potato chipping where they (chuckles) curl up like this. And number two is that they need a way to hold all of the individual rectangular dies in place during and after the slicing process. That takes place in here with saws that have diamond blades that are literally the width of a human hair. And I'm not talking a head hair, I'm talking one of the tiny, little wimpy end of your finger hairs. Probably the most impressive thing about it is how precisely controlled it is. Not only does it cut all of our dies perfect on the x and y-axis, it cuts to a perfect depth such that the dies are fully cut and yet still adhered to our sticky back. Once we reach this stage, we're ready for encapsulation or packaging. Now, obviously, we can't even see some of the features on these dies with the naked eye, let alone solder a wire to them. So, packaging is a whole other branch of black magic unto itself. They don't do any of it here unfortunately, but in a nutshell, for a 3D product, you would stack these dies, thermally bond them with incredible precision, attach these bond wires, so that you can actually solder the bloody thing to aboard. Then, embed the whole thing in an epoxy or a mold compound, so that it stays safe, not just in transit, but also during use. You can see this one right here has actually had that mold compound sanded away, so that you can see the bare die material. But this familiar plain black rectangle is what's actually gonna make its way to the next stage, the characterization tester. Now, up until now, we've gone ahead and we've probed these dies to ensure that they do work as intended, but that's just for show. After encapsulation, we should be left with the familiar black square that looks just like what you'd find on a finished memory module, except that all the testing we've done on it up until now is not sufficient. You see, the issue with our probes is that their long leads are susceptible to signaling interference and crosstalk, which means that they need to be run at a much, much lower speed than what Micron's customers demand. So, while we know that these guys work in theory, we need to plug them into one of these to see if they still work at speed. I'm not gonna put it on this one. - Yeah. - Do you guys have another one? They dug me up a DDR4 load board that I can't do too much damage to at this point. They also gave me a DDR4 die. Basically, the purpose of this board is to make it much, much easier to probe all the different pins on the bottom of our packaged die. So, we put that little guy in there like that. Then, this hold down mechanism clamps it onto the board, so that we don't have to solder it and throw these away every time or de-solder them or whatever the case may be. The load board then goes onto our testing table here and, man, I'm gonna need an explanation of exactly what it is that is going on with our scopes here. There's obviously a lot more to it, but the basics are that our yellow line is our data strobe, our blue is our clock, and our green and red lines are input and output. And what we want to see is we wanna see these lines as vertical as possible. a theoretical perfect digital signal would actually have flat peaks and valleys, and straight lines between them. But in the real world, it takes a little bit of time to go from your low target voltage to your high target voltage, especially when you're operating at speeds in excess of billion cycles per second. Another fun bit is the kind of oscilloscope that you need in order to run this kind of testing is worth a pretty penny. This bad boy apparently do 33 GHz. Now, obviously, Micron's not gonna out their suppliers for their exact pricing, but I've been told that this scope with probes and software, and all the other bits and bobs you might need could be in the neighborhood of a half a million dollars. So, to be clear, this is not the kind of thing that they're running at mass production. This is an R&D process where you know what? This kind of cost, honestly, compared to the equipment it took to make that one decent wafer with a couple usable dies, absolutely dwarfs this. Of course, not every issue can be diagnosed with probing. That is where this x-ray machine comes in. Whether we're looking at an individual die or a full module, this gives us a 3D non-destructive look at where our problem might lie. All we have to do is load our sample onto this carrier, pop it in here, blast our sample with x-rays, which are captured on this side, while this pedestal slowly rotates generating over here. This is made of lead, so (chuckles) it's very heavy. (metal clinks) I'm just gonna be careful. Oh. Closing that. Generating this 3D model that's a composite of all of the individual scans. So, this is the PCB under here. This right here is a PMIC module, and this right here is our solder joint. And if we look closely, you can see the whole thing cracked apart during a stress test. That's no good. What's really wild though is that's one of the lowest resolution tools in this lab. Behind this door, which unfortunately, I'm not allowed to open, are scanning electron microscopes that can go down to the gate and transistor level, helping to diagnose any problems in the dies until finally, we get maybe one or two good wafers, at which stage we move to our next station. But while the characterization tester tells us what an experimental design may handle the DDR6 6,000 and something, who knows, that doesn't mean that it's ready for prime time. They might've just gotten lucky. So, the next step is to go back to the Fab and say, let's run a larger batch, maybe 100 wafers this time. Encapsulate those and send them over here. This is a bending machine, and it helps Micron's engineers figure out what the variation is with a much larger sample size. I mean, maybe absolutely everything that comes in here runs on target or above, but what's more likely, there's gonna be some failed dies or other corner cases. So, this machine takes in trays of packaged dies and puts 'em through hell, intensive operations, hot, cold, the works. Then, the guys get sorted according to the engineer's parameters in the outputs down here. Some of these problems might be fixable ones. Maybe this bin could be sold as a slower part, or maybe this bin has fuses that you could blow. So, you got a 16 Gigabit die and you know, half of it's fine, but you just disable the other half. And (finger snaps) now, it's an eight Gigabit die. That stuff happens all the time, but when it does, that's not a prime die anymore. The dies that go into Micron's consumer Crucial branded DIMMs, those are all going to be prime dies. And on that subject, I think, we've actually got some here. So, it might be time for me to go build my modules. Now that we have trays upon trays of these packaged dies that will run perfectly at their rated characteristics, I am so excited right now. It is time for us to build some actual modules. Ah, not like that. For that, we're gonna need the machine behind me. This is a multi-stage automated PCV production line, very similar to what Crucial might use to build the server memory modules that are powering the machine that you are watching this video from right now. The first age of silk screening, which is pretty much the same process that we use to print our T-shirts on lttstore.com, except instead of shirts, we use what I'm informed is called a panel of memory module PCBs. And okay, actually, this part's pretty much the same. So, we pop our panel down here. An electronic eye detects that it's correctly placed. Then, my lovely assistant over here presses the button. Normally, this machine would not operate with the cover open like this, and I have been cautioned to keep my hands well away from it, which I will do. Oh, there it goes. Wow, that's really fast. So, you can see that there's a little squeegee that's wiping solder paste shmoo. It's like already done. Wait, is it already coming out the other side? Oh my gosh. Going all the way into the other machine already. We didn't even get a chance to look at it. Fortunately, I know what's happening here. This is, oh, not good. We got a defect. This is so cool. I'm so glad we got a defect. This machine creates a 3D computer vision model of our panel of memory sticks, and you can see here, it can actually detect everything from two contacts that are bridged like right here. That would be a big problem when we soldered our chips onto it, to ones that that actually have too much or too little solder paste applied to them. It looks like all of the errors we got were bridging errors, which means we're gonna have to try again, I guess, or can we go in and fix it? We can fix it. This is more fun than I expected. I've got permission to just open this up. We're just gonna take our soon to be modules out. Okay. So, where's our... Is this the thing we're looking at here? Must be. I'm just figuring this out in real-time here. Oh, yeah, I see it. And given that this is part of the power management of the DIMM, I pretty much promise you this thing lights on fire and lets out the magic smoke the second you plug it in. Okay, so what do I do now? Unfortunately, I can't show you guys exactly what's going on here. Oh, man. Am I even gonna be able to... Okay. This is some precision work and I can't even rest my hand on the rest of the panel, so, okay, I got one of them, I think. Now, you would never do this in mass production, would you? Is this just for test batches? - [Micron Representative] Yes. - Thank goodness. Now that I think, I fixed the problem, it's entirely possible that A, I didn't, and B, I screwed up something else. So, I'm gonna go ahead and load this back on here and see if we nailed it here. Yes, yes, yes, yes, yes, yes, yes, yes, yes. Not good? Oh, wait, I never actually fixed the ones that were the defects last time. I fixed something else. They apparently thought it was charming how much fun I was having, so they didn't stop me. But this board is bad because of that. That is not something I can fix with an Exacto knife. Time for round two. I asked about the solder paste they're using, by the way, even this stuff is cool. It comes out of a refrigerated tube that is surprisingly cold and really, really heavy. They won't tell me exactly what it's made of, but we know for sure it isn't lead. So, I'm fairly certain you can eat it without dying, or at least without dying a lead poisoning anyway. 76 errors this time. Oh, boy. Actually, you know what? This might not be that bad. Most of these look like they say insufficient solder and it's pretty clear they're probably fine. Can I just try? Can I try it? - [Micron Representative] As long as (faintly speaks) - As long as there's no bridges? Okay. So, if I fix the bridges, then we can go for it? The worst case scenario is I make my own defective memory. It's not like you guys are shipping it to anyone. Final attempt and we're going forward no matter what happens here. What do you think? We got this? - Yup. - All right. (claps) Let's try it. Okay, so, right, I click pass? Okay, so I have overridden the machine. Take that, machine. Next up is our assembly robots. These helpful guys pick surface mount components off of these reels that are loaded into the bottom of the machine here. And then, depending on the type of component, they have different heads that you can put on them. So, this is obviously for a very small component, whereas this is for a large one. And the robot knows what kind of head it has using machine vision and reading these dots on the back. So, it's got a little vacuum that allows it to pick up one single part, and then, place it onto our memory modules. That's why they're more formally known as pick-and-place machines. Although I like my name too. That process with the tape loaded components actually takes a few minutes, because there are so many of them. Then, when it's done, we're going to pull instead from a tray of packaged dies, which is loaded in over here, and then the real good stuff goes on. Now, we're ready for the last step, which is basically a fancy pizza oven. There it goes. It's designed to bring our panel up to exactly the perfect temperature, hold it there for a while, then drop it back down, heat it back up, and cool it down. Now, this isn't one of the fancy gravity defying ones that allows you to pick and place parts on both sides using kind of like a tacky solder paste. You'd be more likely to find something like that on a mass production line, but the test engineers have a pretty cool solution to their single-sided oven. They can actually prepare ahead of time dozens or wow, actually, even hundreds of PCBs that have all the little picky components on one side, and then the other side's blank. So, all they have to do is pick and place the eight-packaged dies, throw them through the oven and they're ready to test. This is it. It's cooked. But obviously, putting this into a computer is gonna be a bit of a problem. So, they have a solution for that. It's this little CNC cutter that I have not been briefed on how to use yet, but it couldn't be that hard, right? I mean, everything so far has gone in this way. So, surely, it goes in head first. And the, oh, well, hopefully, I put it in the right way. - Okay. - Okay, so start. I'm getting surprisingly little supervision here, so I'm just doing it. Here we go. Oh, this thing's sick. Get over here, Andrew. Okay, so it goes what? It goes and gets the right cutting tool or what are we looking at here? It's a board gripper. Ah, so, it's gotta get the right board gripper. you might be doing SODIMMs or DIMMs or DDR4, DDR5. Okay, here comes my module. (machine beeps) Oh, am I too close? That error was caused by one of the safety checks that prevents the wrong profile from running for the kind of memory that you have. So, it actually reads the type of modules that are coming in and if it's got the wrong gripper bit loaded, it's gonna say, hey, whoa, whoa, whoa, you can't do that. But it's really cool that we got that error, because it gave us an excuse to open up this machine and take a closer look at it. From the top, it's just a gripper hand. From the bottom, there's actually a router head that cuts off all the extra little tabs. And then, the gripper is gonna take the finished modules and move them over to that conveyor at the back. Okay, you guys can go ahead and close it. Let's run it. This is cool, by the way. Remember that video that we did on gold recovery from electronics manufacturing back in Taiwan? Well, this is exactly the kind of stuff that would get shipped to them to be broken down and turned back into usable materials. Here they are. And these are ready for my computer at home? No? Oh, right. I don't even know what I've built yet, but before I can find out, we've got one more really important stopover. The long-term burn in and validation lab. They are constantly building out more capacity, because you know what? Theoretically works is not good enough. So, Micron is constantly adding more real servers, the exact kind that their customers might put their memory in. And then, just absolutely pummeling these things. We're talking hundreds, thousands upon thousands of hours to see what exactly could possibly go wrong. Ideally, nothing. Knock on metal. I'm not allowed to tell you how many server racks they have in here, but let's just put it this way, there's a lot of electrical panels and they're testing a lot more than just current gen. And the same goes for consumer motherboards. On the wall of fame here, they've got validation boards, ah, for basically every platform that has ever existed, so that even if years down the line, a customer complaint comes through, they can go back to the board maker, the chip set, and CPU maker, and work together to figure out who's causing the problem and what the solution might be. What really blew my mind in this room though wasn't the environmental chambers or the collection of old motherboards, but rather, the collection of weird motherboards, the likes of which I'd never seen. The thing is, you think Micron, they've probably gotta collaborate with friends you think of, like an Intel or an AMD or an Apple, but these days, pretty much everything has a chip in it and every chip needs RAM. So, they also work with brands you might not think of, automotive companies, dishwasher companies, you name it. It's probably got Micron hardware in it. And so, there's wild stuff in here like this thing. We can't show it to you, obviously, but it's three times the size of a standard ATX motherboard and absolutely covered in IO, but I have never even heard of. What even is it? Just because it's functional doesn't mean it's compliant. It might seem like Micron is just flexing their sick three meter by three meter anechoic chamber on me, 'cause they know, mine is broken, but no, this is an incredibly important part of the development process. So, we load our system or our module or our SSD or whatever the case may be onto this turntable, load up an exerciser, which is a program that stresses the component, and the turntable spins around with this antenna here, detecting the highest emissions off the product from every direction. This ensures that it meets regulatory requirements and perhaps more importantly, ensures that it doesn't spew radiation that could cause bit flips or other gremlins to pop up in a given system. Oh, on that subject, by the way, they also intentionally bombard their parts with EMI while monitoring for abnormal behavior or instability, either of which would of course be unacceptable. That is one hell of an antenna. You're compensating for something? Hilariously, it was a real challenge to find anywhere to test my modules. See, the thing is, DDR5 is very current, and so all the DDR5-capable gear is busy having the crap kicked out of it in one of Micron's testing labs that is chock-full of unreleased hardware. So, we weren't gonna be able to film there. Fortunately, we found a single test bench and a quiet corner that hopefully has working power where we are gonna hook up these modules and see if we can actually post this thing. This is amazing, by the way. People just set up a test bench for you? I have to set up my own test benches back at the office. This is ridiculous. I still have no idea what we built, but they did tell me they had these guys flown in specially. So, maybe there's something pretty cool? 82. Hey! We got something. CPU memory changed. Look at that. We went straight for gold and we got it. Did you guys test these ahead of time? No. We just went for it. Oh, wow. You guys are ballsy. I like it. Uh-oh, we have 96 Gig. Wait, what the hell? Am I reading this right? These are 24 Gigabyte modules? No one's volunteering. What the hell is a 24 Gig module? Explain yourself. - I can't. (laughs) - That's why nobody volunteered. Okay, so how did... What? What? (chuckles) Now, this is obvious bull (beep) 1337 for the part number. Eight terabytes DDR9, 9,000. That's a missed opportunity. It should have been over 9,000, obviously. (Micron representative laughing) Okay, but for real, you gotta gimme something to work with here. - So, (speaks in gibberish) - And that is why we had to bleep all of that. I really am not allowed to explain this to you guys any further than these are in fact 24 Gigabyte memory modules. And am I allowed to run them like in my system? Is there any reason I couldn't? - [Micron Representative] Yeah, just can't... Don't sell them. - And these are XMP (beep) - [Micron Representative] Bleep that. - Oh, bleep that too. (Micron staff laughing) All right then. I hope you guys enjoyed this behind the scenes look. I wanna give a massive shout-out to Micron for making this possible. This is not an easy thing to pull together. And we had a ton of fun, but I don't wanna let that distract from the serious work that they're doing here. This wall is all of the 50,000 patents that Micron holds in storage and memory and associated technologies. This is literally the largest R&D facility for memory and storage products in the Western Hemisphere. And it's pretty clear to me based on seeing it that no matter what your budget is, Idaho has everything you need for your next PC, be it a top-of-the-line SSD and memory kit from Crucial or a literal potato. These stickers are great, but literally everything about them is a lie from the part number to the fact that it says Crucial on it. That's their consumer brand and no consumer is ever going to touch these modules. I have been specifically instructed to destroy these if I ever take them out of my computer, because (chuckles) they were not supposed to leave this lab. If you guys enjoyed this video, you might also enjoy our Intel Fab tour where we went into a little bit more detail about the actual lithography process. That one's also wicked cool.",
    "transcript_keywords": [
        "Micron",
        "dies",
        "die",
        "machine",
        "guys",
        "memory",
        "time",
        "thing",
        "modules",
        "wafer",
        "back",
        "memory modules",
        "cool",
        "part",
        "test",
        "kind",
        "module",
        "Fab",
        "solder",
        "pretty"
    ],
    "transcript_entity_values": [
        "232",
        "Idaho",
        "one",
        "100",
        "Micron Representative",
        "multimillion dollar",
        "SSD",
        "eight",
        "One",
        "9,000",
        "chuck",
        "PCV",
        "Exacto",
        "1",
        "CNC",
        "three meter anechoic",
        "dozens",
        "Micron",
        "6,000",
        "three",
        "Singapore",
        "96",
        "NAND",
        "24",
        "half",
        "600,000 square feet",
        "years",
        "Apple",
        "first",
        "Andrew",
        "First",
        "3000",
        "the Western Hemisphere",
        "EMI",
        "Micron",
        "XMP",
        "over 180,000 tons",
        "Eight terabytes",
        "FOUP",
        "hours",
        "CPU",
        "Gigabyte",
        "2025",
        "33 GHz",
        "hundreds, thousands upon thousands",
        "Fab 4",
        "Intel",
        "hundreds",
        "ATX",
        "over 9,000",
        "DDR5",
        "76",
        "over 200,000 square feet",
        "Japan",
        "ASML",
        "16",
        "billion",
        "24 Gigabyte",
        "a ton",
        "EUV",
        "Virginia",
        "$15 billion",
        "DRAM",
        "Taiwan",
        "number two",
        "two",
        "these days",
        "PCB",
        "second",
        "Boise",
        "Crucial",
        "three meter",
        "a few minutes",
        "today",
        "up to",
        "RAM",
        "JEDEC",
        "50,000",
        "nearly 9,000",
        "Fab",
        "AMD",
        "DIMM",
        "Intel Fab",
        "DDR5",
        "IO",
        "REM",
        "a half a million dollars"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "LOC",
        "ORG",
        "NORP",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "GPE",
        "MONEY",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "GPE",
        "ORG",
        "QUANTITY",
        "TIME",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "QUANTITY"
    ],
    "vector": [
        0.023567350581288338,
        -0.006086481269448996,
        -0.06464053690433502,
        -0.017977282404899597,
        0.018336284905672073,
        -0.006261313334107399,
        -0.030122175812721252,
        0.06471759080886841,
        -0.014005037024617195,
        -0.022750472649931908,
        -0.007207596208900213,
        0.03853316605091095,
        -0.04045184701681137,
        -0.07798825204372406,
        -0.012893321923911572,
        0.06537186354398727,
        0.0172409750521183,
        -0.03731034696102142,
        -0.05505603179335594,
        -0.026132822036743164,
        0.062071360647678375,
        -0.05138625577092171,
        0.02525579370558262,
        -0.02284984476864338,
        -0.01457136869430542,
        -0.011235170997679234,
        0.0658799409866333,
        -0.04292939230799675,
        0.02668888308107853,
        -0.06707872450351715,
        0.030066831037402153,
        0.043691132217645645,
        0.003057847497984767,
        0.02928837016224861,
        0.08940862119197845,
        0.04383888095617294,
        0.025400152429938316,
        -0.05618630722165108,
        -0.0340830534696579,
        -0.03726823255419731,
        0.037159230560064316,
        -0.015653055161237717,
        0.05917344242334366,
        0.030379097908735275,
        0.03587496653199196,
        0.03374308720231056,
        0.04859158396720886,
        0.0102532422170043,
        0.03935259208083153,
        -0.028099771589040756,
        0.00974158477038145,
        -0.024974871426820755,
        0.0290469229221344,
        -0.0007717018015682697,
        -0.08915973454713821,
        0.11040773242712021,
        0.015301399864256382,
        -0.04561692476272583,
        0.0056936852633953094,
        -0.02572675608098507,
        -0.0018710030708462,
        -0.027391500771045685,
        0.015573256649076939,
        0.004204459022730589,
        -0.03268297389149666,
        -0.05167902633547783,
        0.05025443062186241,
        0.024065855890512466,
        0.018565982580184937,
        0.03956817090511322,
        0.0008254385320469737,
        -0.07612862437963486,
        -0.03536345809698105,
        0.03288327530026436,
        -0.048963628709316254,
        -0.012033778242766857,
        0.03201759606599808,
        -0.03612601011991501,
        0.048079218715429306,
        -0.06549514085054398,
        -0.055472370237112045,
        -0.016380377113819122,
        0.00767558254301548,
        -0.06800798326730728,
        0.06350000947713852,
        -0.04444471374154091,
        0.09463319182395935,
        -0.009681767784059048,
        0.0038759829476475716,
        -0.04697360843420029,
        -0.011741185560822487,
        0.03234700858592987,
        0.05081747844815254,
        0.025714116171002388,
        0.044947173446416855,
        0.08516346663236618,
        -0.015748200938105583,
        -0.04950936883687973,
        -0.03235609084367752,
        0.04364631325006485,
        0.059123631566762924,
        0.11319424211978912,
        0.0269487202167511,
        -0.05143502727150917,
        -0.0626266747713089,
        -0.0331687405705452,
        -0.008968704380095005,
        0.10587319731712341,
        -0.007626018486917019,
        -0.01869567111134529,
        0.014486869797110558,
        0.1019279733300209,
        -0.011889046058058739,
        0.028169138357043266,
        0.0659235343337059,
        -0.02339327707886696,
        -0.1026160717010498,
        -0.09209863841533661,
        0.012112989090383053,
        0.020327720791101456,
        -0.038681838661432266,
        0.004185087513178587,
        -0.017635995522141457,
        0.03125189244747162,
        -0.059852857142686844,
        0.05354910343885422,
        -0.11539251357316971,
        2.3667114895998e-33,
        -0.030864575877785683,
        -0.01960703730583191,
        -0.03453558683395386,
        -0.006830467842519283,
        -0.013402770273387432,
        0.0004315008409321308,
        -0.02540496550500393,
        -0.03478756174445152,
        0.0007488354458473623,
        0.03976918011903763,
        0.03625514730811119,
        -0.06321271508932114,
        -0.05627483129501343,
        0.06771905720233917,
        0.0320264957845211,
        -0.09938264638185501,
        -0.015125160105526447,
        -0.10165148973464966,
        0.04552071541547775,
        0.019275331869721413,
        -0.034825172275304794,
        -0.0057310317642986774,
        -0.03391013294458389,
        -0.07141593843698502,
        0.09099087864160538,
        -0.040831346064805984,
        0.047912973910570145,
        0.033760715276002884,
        0.03719068691134453,
        0.031386587768793106,
        -0.03451862186193466,
        -0.08744584769010544,
        -0.022959671914577484,
        -0.0679330825805664,
        0.013968933373689651,
        -0.004579239524900913,
        -0.05962873250246048,
        -0.07664128392934799,
        -0.0007786173955537379,
        -0.03460657224059105,
        0.04973671957850456,
        0.049531880766153336,
        -0.06216159835457802,
        -0.15842169523239136,
        -0.11027814447879791,
        0.028868742287158966,
        0.03949032723903656,
        0.028055338189005852,
        0.05791395902633667,
        -0.059697870165109634,
        -0.044434573501348495,
        -0.030097391456365585,
        -0.06831329315900803,
        0.02240414172410965,
        0.05896798148751259,
        -0.029686765745282173,
        0.03432459384202957,
        -0.03976675122976303,
        0.10810092836618423,
        0.08068669587373734,
        -0.0005390769219957292,
        -0.024655843153595924,
        -0.015700429677963257,
        -0.00011457338405307382,
        -0.003514817450195551,
        0.07059080898761749,
        0.07481955736875534,
        0.10069363564252853,
        -0.08842440694570541,
        -0.06744106113910675,
        -0.015699289739131927,
        -0.06044192984700203,
        0.008192203007638454,
        0.018530482426285744,
        -0.014829580672085285,
        0.023745568469166756,
        -0.05790282040834427,
        -0.003373488551005721,
        -0.10280562192201614,
        -0.012051058933138847,
        0.06796083599328995,
        0.022404002025723457,
        0.02293817512691021,
        0.046480145305395126,
        -0.026920145377516747,
        0.04161585867404938,
        0.030581001192331314,
        -0.025184253230690956,
        0.01111175213009119,
        0.015409661456942558,
        -0.007074852008372545,
        -0.06069765239953995,
        0.04921797290444374,
        -0.047878630459308624,
        -0.13283830881118774,
        -6.34890009008887e-33,
        -0.06521850824356079,
        0.01992587372660637,
        -0.03994813933968544,
        0.07963915169239044,
        -0.005401763133704662,
        -0.004154432099312544,
        -0.035489968955516815,
        -0.010343515314161777,
        -0.04873170703649521,
        -0.08310819417238235,
        -0.0682283565402031,
        0.004882111679762602,
        -0.013949455693364143,
        -0.061588361859321594,
        -0.008166809566318989,
        0.0014931709738448262,
        -0.0035661892034113407,
        0.015865035355091095,
        0.06085558608174324,
        -0.020662769675254822,
        0.049832575023174286,
        0.09696014970541,
        0.07235182821750641,
        0.0014151172945275903,
        -0.024096250534057617,
        0.0008632757235318422,
        -0.027530111372470856,
        0.12257204949855804,
        -0.08154696226119995,
        0.01633019931614399,
        -0.004103014245629311,
        -0.039964303374290466,
        0.004013620782643557,
        0.017207620665431023,
        -0.03534870967268944,
        -0.09891043603420258,
        0.05781691148877144,
        -0.002210903912782669,
        0.04859494790434837,
        -0.06300405412912369,
        0.10073049366474152,
        0.005089782178401947,
        -0.028959518298506737,
        -0.06315632909536362,
        -0.03886938467621803,
        -0.007300384342670441,
        -0.09921786189079285,
        -0.08073011040687561,
        0.02525031752884388,
        0.0024094225373119116,
        -0.020452069118618965,
        -0.03973168507218361,
        0.059711046516895294,
        -0.013974768109619617,
        -0.002853519283235073,
        -0.07366868853569031,
        0.08595593273639679,
        0.08183146268129349,
        0.07176610827445984,
        -0.06797301769256592,
        0.010159065015614033,
        -0.07361011952161789,
        -0.0018490549409762025,
        -0.100491963326931,
        0.0032007726840674877,
        -0.08327684551477432,
        -0.00549062667414546,
        0.033425796777009964,
        -0.05267513915896416,
        0.055809587240219116,
        -0.028825411573052406,
        -0.0003033704124391079,
        0.044509708881378174,
        0.006404133513569832,
        -0.06929552555084229,
        0.06328500807285309,
        0.03800809383392334,
        -0.020158637315034866,
        0.012518977746367455,
        -0.08723543584346771,
        -0.024526560679078102,
        0.02307085506618023,
        0.01039151195436716,
        -0.048640523105859756,
        0.034282393753528595,
        0.034678008407354355,
        0.023370282724499702,
        -0.06701236218214035,
        -0.036362893879413605,
        -0.05213538557291031,
        -0.06813641637563705,
        -0.03495075926184654,
        -0.05769558250904083,
        0.048933498561382294,
        -0.06761020421981812,
        -5.878261077896241e-08,
        0.01118282601237297,
        -0.061890073120594025,
        0.010980641469359398,
        0.023238271474838257,
        0.022657152265310287,
        -0.07870735973119736,
        -0.009449884295463562,
        0.039625924080610275,
        0.07566341012716293,
        -0.038498979061841965,
        0.10167035460472107,
        -0.08867407590150833,
        -0.017250243574380875,
        -0.0032158454414457083,
        0.03983904793858528,
        0.04511034116148949,
        -0.00034338008845224977,
        0.060268063098192215,
        -0.0007038179319351912,
        -0.1291612684726715,
        -0.09138716012239456,
        0.08259622752666473,
        0.09566029906272888,
        0.05187161639332771,
        0.10946756601333618,
        0.016754448413848877,
        0.0706985592842102,
        0.05673273652791977,
        0.08405134081840515,
        -0.06097063422203064,
        -0.05431928113102913,
        0.006628589704632759,
        -0.009023009799420834,
        -0.008197053335607052,
        0.009262891486287117,
        0.0039678714238107204,
        -0.05517354607582092,
        0.04314403235912323,
        0.12687896192073822,
        0.02189253829419613,
        -0.04229874536395073,
        -0.023930810391902924,
        0.04845595732331276,
        0.020564952865242958,
        -0.013860590755939484,
        -0.061141420155763626,
        -0.038866959512233734,
        -0.013354789465665817,
        -0.03777225315570831,
        0.055544670671224594,
        0.0023780714254826307,
        0.009599319659173489,
        0.010362382046878338,
        0.02170317992568016,
        0.07801513373851776,
        -0.034002963453531265,
        -0.11472474783658981,
        0.05798663571476936,
        -0.006114451680332422,
        0.06453569233417511,
        0.01729915663599968,
        -0.05652318522334099,
        -0.08016914874315262,
        0.03860483318567276
    ]
}