{
    "id": "-evZD-qK5LA",
    "title": "10 Reasons I Daily Drive a Foldable",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-09-14T21:15:23Z",
    "video_url": "https://www.youtube.com/watch?v=-evZD-qK5LA",
    "category": "Science & Technology",
    "tags": [
        "Samsung",
        "Apple",
        "Google",
        "Phone",
        "Foldable",
        "Folding Phone",
        "Pixel",
        "Galaxy",
        "Flip",
        "Mobile Device",
        "Smart Phone"
    ],
    "views": 1248133,
    "likes": 49203,
    "comments_count": 2539,
    "description": "Get 3DEXPERIENCE SOLIDWORKS for Makers (20% Off $99USD/year!)at  or learn more at   Foldables are pretty cool, but are they worth the money? Linus has been daily driving one for a few years and thinks he might be able to convince you.  Discuss on the forum:   Buy a Google Pixel Fold:  Buy a Samsung Galaxy Z Fold5:  Buy a Samsung Galaxy Z Flip5:  Buy a Google Pixel 7 Pro:  Buy a Samsung Galaxy S23 Ultra:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:05 #1 1:40 #2 2:25 #3 2:45 #4 3:45 #5 4:10 #6 4:42 #7 5:47 #8 6:09 #9 6:25 #10 7:03 #11 7:35 Conclusion 10:46 Outro",
    "description_links": [
        "https://lmg.gg/3DSW",
        "https://lmg.gg/f03c8",
        "https://linustechtips.com/topic/1531461-folds-have-problems-here%E2%80%99s-why-i-won%E2%80%99t-stop-using-them/",
        "https://lmg.gg/3zXeI",
        "https://lmg.gg/8x1Mb",
        "https://lmg.gg/IcxOO",
        "https://lmg.gg/sMBTW",
        "https://geni.us/lYu0zh",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "The trend toward larger and larger phone screens cannot be stopped and something needs to be done. I mean, it's clear at this point that you all would keep a tablet in your pocket if you could, but you can't. Well, okay, you can, but there's a wrong way to do that and there's a right way. I'm gonna be talking about my experiences daily driving a folding phone over the last three years because I have a lot to say about it, including some bad stuff, though with that said, obviously I can't seem to put these things down. So I think it's high time that I sat down and gave you all the reasons that I think you just might want to consider a foldable, even if you consider it and ultimately do not pull the trigger. But you should pull the trigger on supporting our sponsor. Solidworks, 3D experience Solidworks for makers delivers professional grade design tools for your hobbies, personal projects, experimental prototypes you can't let the government discover and more. Check them out at the link below. Starting with number one, it's a tablet that fits in your pocket. Actually, no, that's very obvious. So let's move on to something less obvious if you've never used one of these. I do this all the freaking time. Ah, ah, and it's useful for more than just the flashlight. How about if you want to take a timed picture, for example. Now, instead of trying to find some random thing to lean your phone up against and then hope it doesn't tip the wrong way and come crashing to the ground, you can just turn the whole device into its own stand. Or if that's not necessary for you and you don't mind holding your phone, there's reason number two, ha ha, taking selfies where you can actually see the preview on the front screen while taking advantage of the more robust rear camera. No more trade-offs between image quality and making sure that you've got your shot framed right. I mean, don't get me wrong. To keep these things as thin as possible, they don't always have the best cameras around compared to slab phones, but they're solid as long as you just make sure that you don't drop them in the process of taking your picture. A downside of foldables in general is that especially if you have smaller hands, they can be just a little bit unwieldy. With that said, for folks with bigger hands, advantage number three comes in clutch, the extra width. If you're the kind of person who struggles to type on your phone without turning it sideways, you are going to love having all of this thumb space without losing your chat to the keyboard and needing to scroll back up and reread the last few messages before you finish typing your reply. Everything is just right there. And speaking of chatting, number four is that folds are fantastic for messaging apps. You get more of a, I don't know how to describe it other than to say a desktop-like experience where you can both see your current conversation and interact with someone and also your contacts list or your other recent conversations. Wanna search for a phone number to text someone without closing your current chat? No problem. Can't remember who sent you that funny meme that you wanna pass along? Search away all without going offline to whoever you're actively chatting with, whether it's Teams, WhatsApp, Discord, I mean, everything is just plain a richer experience on a fold, which I guess kind of goes without saying given how much they cost off contract. That would be a downside, but we'll get into that a little bit more later. You know what's free? Doom scrolling social media apps like Reddit, Instagram, or Twitter, which, oh, sorry, I am apparently legally obligated to call it X now. Anywho, with a foldable, you can, number five, double your doom scrolling power and use split screen to get two candy bar size apps going at the same time. It's not perfect. Things can get a little cramped, but it is certainly better than not having the option and when it works perfectly, it is pretty dang sweet. Kind of like our adorable and compact new stubby LTT screwdriver, lttstore.com. Ooh, another here's one you didn't think of is retro content. Man, I get so much use out of this. Whether you wanna emulate older games or watch episodes of your favorite classic TV shows without the visual gags freaking cut off, it's awesome. I mean, okay, six by five isn't quite four by three, but it's at the point where those annoying black bars aren't nearly as annoying. And if you wanna watch more modern 16 by nine content, the larger screen still helps whether it fits perfectly or not. Bringing us to our next advantage, the screen, it is huge. And there are a ton of ways that this is useful. This is actually more like three or four different points. I mean, looking at Google maps, reading comics or manga, even just for text reading. I kid you not guys, I legitimately started reading more once I switched to a fold. Oh, oh, and the productivity. It is great for spreadsheets and greater for remote desktop access. Like I can have like my whole monitor up, it's awesome. There are certain activities where more screen is more better, full stop. One that comes up very frequently for me is sharing pictures and videos with my elderly relatives. All I gotta do is crank the brightness, whip open my pocket tablet, and they can actually see their grandkids dance performance instead of like smiling and nodding. Then when I'm done, I slip it into my pocket. Good luck doing that with a tablet. Oh, okay, yes, yes, yes. But I don't look ridiculous right now. Speaking of tablets, while foldables are notorious for not being perfectly flat, number eight is still valid. There is plenty of space to draw or take notes on them. And being in your pocket means that you are much more likely to have one on hand compared to your full setup if the urge to doodle strikes you. And it's that versatility that I love so much about these things. Like how about number nine? I'm not often the kind of parent to hand my kids a device to keep them quiet. But for my daughters, with a foldable, they can both draw on the same canvas or the same color by numbers sheet, which actually leads me to number 10, two-player games. Again, I'm not super down with phones during family time, especially at the table. But the problem is not that I'm allergic to screens or something. Thank goodness, right? Woo, I'm not allergic to screens. It's the asocial aspect. So I don't mind if they're playing a game with each other, and I can't even count the number of times that we've whipped out the aptly named two-players app to kill some time while we wait for food to arrive. And it is so much better if you're gonna have two hands on the screen to have it be a bigger one so we can sit and play without being buried in our separate devices. Finally, number 11 is more of a bonus round kind of thing. But it's funny, even several generations into these things, they are pretty unusual and they are an instant conversation starter. We just hosted our LTX Expo, and surprise, surprise, lots of the people had them there, but even then the effect was clear. People constantly wanted to talk to me about it, and I even saw other attendees just explaining their folding phones to people. They're just plain cool. I mean, it's one of the first times in years that we've seen anything remotely exciting in phone design. A couple of decades ago, I mean, companies were trying everything to stand out and do something different while also offering desirable features. But most of the time then, it just seemed to make the device hard to use. And now we've gone full swing the other way where it's just boring. With a foldable, you really are getting the best of both, the phone and tablet worlds. And if you can look like a cool baller doing it, congrats, I guess. I mean, I've never really managed to pull that off. Though of course, I'm not done yet. I've got a few more downsides that came up in some of the instant conversations that I started with my foldable at LTX. How many of you out there with a candy bar replace your screen protector every six to 12 months? No, not many of you? Well, with one of these bad boys, that may be necessary. Like me, Elijah from our logistics department recently had to remove his because the center eventually bubbled up and cracked. Like mine, his still worked fine, but I mean, who spends this kind of money on a phone to have it look gross and crusty? And we've seen a bunch of reports from others who have experienced the same thing. Actually, I had some people at LTX walk up to me and show them as well. On top of that, after removing the screen protector on my own foldable, I was too lazy to replace it, so I'm just running it bare, eventually the screen itself started to crack. And since I just can't go back to a regular candy bar at this point, I am now that guy daily driving a cracked screen unless I wanna replace the whole thing. I can't speak for the newer generation panels, but that's the experience that I had with mine, which is a couple of generations old. Another issue is much more obvious. We talked about how you can fit more screen in your pocket since these tend to be shorter, especially the Google Pixel Fold. This thing is like, it's tiny. It's also significantly thicker than your average smartphone these days, and it's pretty heavy to boot. Finally, we've touched on this before, but it bears repeating. The software can have the odd issue. One of the two player games that I would like to play on my folding device, doesn't work, it's this free checkers app, and they are expensive. I personally love using folds, but they are not for everyone. So I hope this video helps you make an informed decision. Just like how I'm going to inform you about our sponsor. Solidworks, if you're a maker, hobbyist, or tinkerer, put your tinklers together for the new affordable way to use Solidworks and so much more. 3D Experience Solidworks for Makers includes the digital tools you need for your hobbies and personal projects. And you can save 20% off the usual $99 a year or $9.99 a month, access everything you need to create anything you can imagine. Anything? Anything? Use both locally installed and browser-based tools for designing, fabricating, and rendering. Access dedicated online support to help with any questions you may have. And connect with an active design community full of fellow makers where you can connect, share your work, get tips, and become inspired. Please note, 3D Experience Solidworks for Makers is not for commercial use and limited to a maximum of 2,000 USD profit per year. Elevate your maker game on your terms without compromise and within your means. Save 20% today at the link below. If you guys enjoyed this video, maybe you'll also enjoy this cringe video I did nine years ago on the Galaxy Mega. Remember the Mega? It walked so that this thing could run. This is not how you talk on this on the phone.",
    "transcript_keywords": [
        "screen",
        "phone",
        "number",
        "experience Solidworks",
        "Solidworks",
        "experience",
        "thing",
        "foldable",
        "time",
        "kind",
        "pocket",
        "things",
        "tablet",
        "makers",
        "larger phone screens",
        "phones",
        "screens",
        "phone screens",
        "device",
        "phone number"
    ],
    "transcript_entity_values": [
        "nine",
        "Twitter",
        "99",
        "WhatsApp",
        "one",
        "four",
        "Google",
        "the last three years",
        "first",
        "9.99",
        "Reddit",
        "One",
        "Discord",
        "2,000 USD",
        "number eight",
        "nine years ago",
        "daily",
        "number one",
        "every six to 12 months",
        "today",
        "16",
        "five",
        "11",
        "10",
        "number five",
        "a ton",
        "3D",
        "Instagram",
        "number three",
        "the Galaxy Mega",
        "20%",
        "LTT",
        "3D Experience Solidworks",
        "three",
        "Elijah",
        "Solidworks",
        "six",
        "number two",
        "about number nine",
        "Makers",
        "two",
        "A couple of decades ago",
        "number four",
        "these days",
        "years"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "MONEY",
        "GPE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE"
    ],
    "vector": [
        -0.17945252358913422,
        -0.04326688498258591,
        0.08852377533912659,
        -0.060787320137023926,
        0.08621225506067276,
        -0.011702999472618103,
        0.03769268840551376,
        0.10947564244270325,
        -0.0238287802785635,
        0.02452072873711586,
        -0.028792571276426315,
        0.06163094565272331,
        0.0049430010840296745,
        -0.02224091626703739,
        0.030757920816540718,
        -0.01752103678882122,
        0.03230961039662361,
        -0.0767766535282135,
        -0.07857687026262283,
        -0.005731579381972551,
        0.048211563378572464,
        -0.06672348827123642,
        0.028383586555719376,
        -0.03371034190058708,
        0.05377917364239693,
        0.006680777296423912,
        -0.031246092170476913,
        -0.0944451093673706,
        0.04150507599115372,
        -0.0262796301394701,
        -0.0024014858063310385,
        0.14606326818466187,
        -0.003650984028354287,
        -0.0515601821243763,
        -0.014966463670134544,
        -0.0607416108250618,
        0.02744106948375702,
        -0.014092613942921162,
        -0.08036049455404282,
        -0.028917472809553146,
        0.021435871720314026,
        -0.0410388819873333,
        -0.01718936488032341,
        -0.05515209212899208,
        -0.020234927535057068,
        -0.08174373209476471,
        0.03776774927973747,
        -0.06514987349510193,
        0.035367902368307114,
        -0.0004907696275040507,
        0.0016309471102431417,
        -0.08085927367210388,
        -0.00262597668915987,
        -0.0840541273355484,
        -0.08895564824342728,
        0.048301562666893005,
        -0.04037468507885933,
        -0.01963740773499012,
        -0.005775916390120983,
        0.02669631689786911,
        0.04143458232283592,
        -0.09583780914545059,
        -0.05095000937581062,
        0.06489711254835129,
        0.05513785034418106,
        -0.02298588678240776,
        0.011270420625805855,
        -0.03460415080189705,
        -0.059668730944395065,
        -0.0225366298109293,
        0.00012461814912967384,
        0.010824655182659626,
        0.029015645384788513,
        0.0604952797293663,
        0.015035807155072689,
        -0.058361198753118515,
        0.10041959583759308,
        -0.06456196308135986,
        -0.03063640557229519,
        0.02756970189511776,
        0.011946622282266617,
        -0.023935727775096893,
        -0.03645804151892662,
        0.017905203625559807,
        -0.01316530816257,
        -0.04308885335922241,
        0.0013292096555233002,
        0.04393500089645386,
        -0.03408529981970787,
        -0.04929313436150551,
        0.08013976365327835,
        0.10219251364469528,
        0.038895606994628906,
        0.044024307280778885,
        -0.056102290749549866,
        0.04663839191198349,
        -0.053446024656295776,
        -0.001793803065083921,
        0.0028363210149109364,
        0.04202847555279732,
        0.006155142094939947,
        0.0532933846116066,
        0.09108297526836395,
        -0.030788591131567955,
        -0.06865803152322769,
        -0.08359384536743164,
        0.0287703238427639,
        -0.0007514406461268663,
        0.012554752640426159,
        0.057169459760189056,
        -0.03169069066643715,
        0.0348186232149601,
        0.004461176227778196,
        0.0017009163275361061,
        -0.013643912971019745,
        -0.020578056573867798,
        -0.06724681705236435,
        0.01174500398337841,
        0.07407882064580917,
        0.0006298779044300318,
        -0.044474922120571136,
        0.0026827878318727016,
        0.018590562045574188,
        0.007604325655847788,
        -0.027020473033189774,
        -0.028713881969451904,
        -0.055431466549634933,
        -1.1475825588862488e-34,
        -0.015414686873555183,
        0.11659488826990128,
        -0.021718010306358337,
        -0.027368362993001938,
        -0.005518917925655842,
        0.026137245818972588,
        -0.03143640235066414,
        0.016827654093503952,
        -0.012661871500313282,
        0.03592847287654877,
        -0.02619871310889721,
        0.07339826971292496,
        -0.05570349097251892,
        0.029579509049654007,
        0.08288316428661346,
        0.005330250132828951,
        -0.035938575863838196,
        0.0006954039563424885,
        -0.05172516033053398,
        -0.07980161905288696,
        -0.007824885658919811,
        -0.019009683281183243,
        0.06189454719424248,
        0.01388085912913084,
        0.029243050143122673,
        -0.071184441447258,
        0.03257482498884201,
        0.009243938140571117,
        0.06779828667640686,
        0.019305065274238586,
        -0.0835132747888565,
        -0.004354197531938553,
        -0.016584087163209915,
        -0.05515269935131073,
        0.0008582816226407886,
        0.07415559142827988,
        -0.09119708836078644,
        -0.09706738591194153,
        0.011336540803313255,
        0.007384872529655695,
        -0.053327009081840515,
        0.027743449434638023,
        -0.04439916834235191,
        -0.03251117095351219,
        0.006819036789238453,
        0.04448834806680679,
        0.06854400783777237,
        0.01097442489117384,
        -0.05628436803817749,
        0.017927376553416252,
        -0.028242841362953186,
        0.004685667343437672,
        -0.10453975200653076,
        -0.04980885237455368,
        0.0007407894008792937,
        0.011771095916628838,
        0.04199572280049324,
        -0.08948598802089691,
        0.03304236754775047,
        0.04728733375668526,
        -0.0048709833063185215,
        0.024079767987132072,
        0.009049036540091038,
        0.02524150349199772,
        -0.11345530301332474,
        0.12031862139701843,
        0.0915248766541481,
        0.02328856661915779,
        -0.06939560920000076,
        0.023546937853097916,
        -0.03324278071522713,
        0.005068650934845209,
        -0.05811946839094162,
        -0.056020352989435196,
        0.06719563156366348,
        -0.005571594461798668,
        -0.04858725517988205,
        -0.03260786086320877,
        0.05043463781476021,
        0.024112695828080177,
        -0.019784385338425636,
        -0.001336491433903575,
        0.01788591593503952,
        0.021701937541365623,
        0.01909312978386879,
        0.03836376965045929,
        0.02372852712869644,
        -0.028839100152254105,
        -0.009920849464833736,
        0.039368484169244766,
        -0.02618717961013317,
        -0.04531002417206764,
        -0.03816573694348335,
        -0.015518371015787125,
        -0.05067889764904976,
        -2.0532214725728966e-33,
        -0.04694690182805061,
        -0.02466258965432644,
        0.0030166245996952057,
        0.028420109301805496,
        0.03268741816282272,
        -0.03121373802423477,
        0.018628740683197975,
        -0.041037704795598984,
        -0.03665575012564659,
        0.00032012895098887384,
        -0.04593583196401596,
        0.08433378487825394,
        -0.026943691074848175,
        -0.017177924513816833,
        0.006995873525738716,
        -0.11634021997451782,
        0.04192894697189331,
        -0.1179480031132698,
        -0.0038557695224881172,
        -0.058953963220119476,
        0.09359069913625717,
        0.018586548045277596,
        -0.012666958384215832,
        0.0348089300096035,
        -0.04832284525036812,
        0.006044200621545315,
        -0.06686066091060638,
        0.01834103651344776,
        0.056985221803188324,
        0.08362424373626709,
        0.06653586775064468,
        -0.06753659248352051,
        -0.013743254356086254,
        -0.0245373472571373,
        0.054996490478515625,
        0.004335180390626192,
        0.018772995099425316,
        0.0501343235373497,
        0.027942871674895287,
        -0.07860365509986877,
        -0.023966249078512192,
        -0.0008130532805807889,
        0.03821111097931862,
        -0.07866546511650085,
        0.04404127597808838,
        -0.061573855578899384,
        -0.03820570930838585,
        -0.014214758761227131,
        0.011844702064990997,
        0.009687826968729496,
        0.032493144273757935,
        0.04225790873169899,
        0.06784021854400635,
        -0.05171151086688042,
        -0.0689450055360794,
        0.0274898000061512,
        -0.010093014687299728,
        -0.0018695852486416698,
        0.018769342452287674,
        -0.018411872908473015,
        0.06025036796927452,
        0.042600542306900024,
        -0.03778722882270813,
        -0.03307458385825157,
        -0.039625026285648346,
        -0.007626771926879883,
        0.07064995169639587,
        -0.006799777969717979,
        -0.04399700090289116,
        -0.047301284968853,
        -0.003237576922401786,
        -0.049495577812194824,
        -0.0098918117582798,
        -0.10608454793691635,
        -0.10176343470811844,
        0.12877784669399261,
        0.011108088307082653,
        0.005990258418023586,
        0.00752789992839098,
        -0.04978008195757866,
        -0.0008223649929277599,
        0.006658297963440418,
        0.08108685910701752,
        0.009855806827545166,
        -0.015946991741657257,
        0.03609708696603775,
        0.012593011371791363,
        -0.039097681641578674,
        0.04817594960331917,
        0.044061142951250076,
        -0.022270265966653824,
        0.020958049222826958,
        -0.06440206617116928,
        0.1073797270655632,
        0.010008839890360832,
        -4.843008127863868e-08,
        -0.0002411647146800533,
        0.06079905852675438,
        0.05494271591305733,
        -0.00028949082479812205,
        -0.028383657336235046,
        -0.08695480227470398,
        -0.007056426722556353,
        -0.018648434430360794,
        0.06988601386547089,
        0.03911162540316582,
        0.07750940322875977,
        -0.10828325897455215,
        -0.09752646833658218,
        0.10570653527975082,
        0.06279163807630539,
        0.06709970533847809,
        -0.012813972309231758,
        0.0567159540951252,
        -0.003721684217453003,
        0.022521737962961197,
        0.03603101894259453,
        0.013476241379976273,
        0.029472559690475464,
        0.01463059987872839,
        0.012279649265110493,
        0.014426608569920063,
        -0.011568132787942886,
        0.04559391364455223,
        0.0887807235121727,
        -0.040779855102300644,
        -0.06801868975162506,
        0.01570739410817623,
        0.04893069714307785,
        0.09093772619962692,
        0.026460008695721626,
        -0.08937247097492218,
        -0.039098162204027176,
        0.00026075070491060615,
        0.05479413643479347,
        0.0768677294254303,
        0.036848340183496475,
        0.04472445324063301,
        0.027397343888878822,
        0.05129203200340271,
        0.0211931262165308,
        -0.07116841524839401,
        0.01825842633843422,
        -0.05090583860874176,
        -0.008139403536915779,
        0.10991019755601883,
        -0.0680861696600914,
        -0.03105267696082592,
        -0.05078382417559624,
        0.033307597041130066,
        0.05316052585840225,
        0.001988905481994152,
        -0.006062252447009087,
        0.03381197899580002,
        -0.08399387449026108,
        0.10153192281723022,
        -0.038637932389974594,
        -0.1614660620689392,
        -0.03856493905186653,
        0.1225171834230423
    ]
}