{
    "id": "-EZ_3Tq9a8c",
    "title": "Dope Tech: Weirdest Earbuds I've Ever Tried!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-03-02T21:33:32Z",
    "video_url": "https://www.youtube.com/watch?v=-EZ_3Tq9a8c",
    "category": "Science & Technology",
    "tags": [
        "MKBHD",
        "Dope Tech",
        "dope tech",
        "Sony Linkbuds",
        "linkbuds",
        "earbuds",
        "AirPods Pro",
        "AirPods vs",
        "transparency mode",
        "xbox series s",
        "xscreen",
        "xbox screen"
    ],
    "views": 2939801,
    "likes": 126359,
    "comments_count": 3767,
    "description": "Enter the giveaway by following at the links below!  Twitter:        Instagram:        YouTube:            Facebook:        Visit  for giveaway details. It's free and worldwide!  xScreen for XBox:  Sony Linkbuds:  Asus ROG Flow Z13:  USB-C cable with screen:   Intro Track:  Playlist of MKBHD Intro music:   xScreen provided by UPSpec Gaming. LinkBuds provided by Sony. Z13 Provided by Asus.",
    "description_links": [
        "https://twitter.com/Mrwhosetheboss",
        "https://twitter.com/dbrand",
        "https://twitter.com/MKBHD",
        "https://instagram.com/Mrwhosetheboss",
        "https://instagram.com/dbrand",
        "https://instagram.com/MKBHD",
        "https://youtube.com/Mrwhosetheboss",
        "https://youtube.com/MrwhosethebossShorts1",
        "https://youtube.com/dbrand",
        "https://youtube.com/MKBHD",
        "https://www.youtube.com/c/MKBHDShort",
        "https://facebook.com/Mrwhosetheboss",
        "https://facebook.com/dbrand",
        "https://facebook.com/MKBHD",
        "https://dbrand.com/winners",
        "https://upspecgaming.com",
        "https://amzn.to/3ISRL3f",
        "https://rog.asus.com/laptops/rog-flow/rog-flow-z13-2022-series/",
        "https://amzn.to/3HBUexo",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5"
    ],
    "transcript": "- All right, what's up, I'm Marques here, welcome back to Dope Tech. And yes, this is an Xbox Series S, fully portable, in the shape of a laptop with a display on it and everything. This is sent to be by the creators of the xScreen And for a certain group of people, this is really cool. So obviously, hand-held gaming's having a bit of a moment right now. I am also currently testing this little guy called the Valve Steam Deck. You might have heard about it. Leave a thumbs-up if you're excited for that video. But this thing, well this is exactly what it looks like. It's called the xScreen for Xbox Series S and it basically turns the console into a laptop form factor for you hardcore gamers that wanna play Xbox games but not just on the couch. So basically, all you have to do is plug it in by connecting this piece to the Xbox like a puzzle piece. It has a USB plug and an HDMI plug in the back. And you plug them in to align the whole thing up and there's two, bonus, little thumb-screws, one on either side to help hold everything in place. And then you use, literally, the original cable that came with the Xbox and then boom, the whole thing can light up just like this, the screen turns on and you're gamin' on the go. Now this screen, it's not the highest end screen in the world on paper. Like, the numbers, it's an 11.6-inch diagonal screen and it's 1080p, it's an IPS at 60Hz, right? But it matches the size of the Xbox, obviously, to achieve this form factor. And then if you think about it, 1080p right, so that this screen, you might be already gaming on for a console like this is 1080p but this is obviously way smaller, so it's actually significantly sharper, the higher pixel density, and so you can sit much closer to it like I am, here. And so it's really just about convenience to match the size of the Xbox. It's got the stereo speakers up top. It also has an optional stand mode to help you get a better angle. And it's got a cross-hair mode to help you better aim in shooter games, if you're into that. You basically just have to plug it in and light it up, and it starts gaming. So yeah, it's not a 4K or 120Hz screen or anything like that, but I wasn't really expecting that much from something that plugs directly into an Xbox. And you know what, it still does have this nice matte finish which makes it easy to see in a variety of lighting situations it might face. The audio gets surprisingly loud. Honestly, it's easy to have a lot of fun playing this almost anywhere that you could fit a normal or super thick gaming laptop. Well, except for the fact that you do pretty much always need to be plugged in. I did see a video on the Creators YouTube channel where they have this massive 99-watt-hour battery and so you could, in theory, bring it and the battery on a flight, you know, get that seat back tray table goin', but it lasts about 40 minutes. So if you have the seat on a plane with no outlet, this isn't exactly great. But overall, you know, aside from the rear USB and ethernet ports being blocked, and the white color not quite exactly matching up the same as the Xbox plastic, but being really close, this thing is really well built and it's 250 bucks for the whole kit. So it's on Kickstarter right now. That's basically the same price as the Xbox Series S is going for. It's a little bit pricey, but I'll say if you have the outlet in the back of your car and you want to play Xbox games on the go like this is, yeah, this is the best way to actually do that. Until maybe, of course, Tesla finally ships that gaming feature they've been promising for so long. So overall, I'm gonna give this seven out of 10. If it's actually shipping and people are playing Xbox games on the go, that's pretty dope. All right, these might be the strangest but coolest earbuds design I've ever seen. These are called Sony LinkBuds. They're brand new, you might have seen me tweet about them the other day. And right away, you can tell they're pretty different from normal earbuds. You're seeing things correctly. The earbud is a circle, the part that actually goes into your ear is a circle. I'll explain. So a lotta headphones we use right now have active noise cancellation but then a separate feature that they started adding more and more often, which is some sort of transparency mode. So it uses the microphones around the earbud to pump in sound from the outside so you can walk around on the streets and still hear the cars around you or hear when your bus or train stop gets called. So these, well, these are designed so you can always hear your environment around you even when you're wearing them. So they have an 11-millimeter circular driver and a hole in the middle. So when you put the earbuds in, without playing any music you can still hear a lot of the outside world around you. Then when you play music, well, yeah, it sounds like the headphones are on with the transparency mode. Now, I found it's not actually as good as, say, AirPods Pro because those microphones are actually amplifying your environment, so with these, if there's music playing, you still hear a little bit of what's around you, but you can actually drown it out if you turn the volume up loud enough. But I really have been impressed with how well these actually work. I mean, clearly the physics makes sense, there's a hole through it, but yeah, now you're letting in constantly a non-adjustable amount of sound from the outside world. So it's great for listening to music while cars are around you or on public transportation so you can still hear when your bus stop gets called or something like that. It's consistent. So then the idea with these is even when you're done using them, done listening to music or taking a phone call, or whatever it is you're doing, you can just leave them in your ears because you'll have transparency mode, you'll have the ability to hear what's going on around you all the time, even when the earbuds are in and it doesn't take extra battery power to do that. So now you're just having a normal conversation. Now the other thing you may have noticed is these earbuds are pretty tiny, like, the buds themselves are very small, and the recycled plastic case they fit in, as a result is also very pocket-able. But the down side is that there's no space on the buds, themselves, for media controls anywhere. But that's where the second crazy feature comes into play. You can adjust volume by tapping the skin around your ears. So the Sony Connect app lets you program a double-tap or a triple-tap of your own skull on the right or left-hand side, and these earbuds are sensitive enough of their own position that you can map a double-tap on the right-hand side to be volume, a double-tap on the left-hand side could be skipping tracks or even opening Google Assistant or accepting a phone call. It's awesome. Overall, as crazy as these are, they are surprising;y usable. They're 179 bucks, small case, no wireless charging but it does have USB type C, and it gives you a five-hour total battery life with these. Sound quality is solid. If anything, it's lacking a little bit of bass 'cause it's not getting into your ear like normal earbuds might. But yeah, if you can get the touch controls to work well, they're finicky sometimes, so you gotta tap like, right up next to your ear, they're pretty cool. I'm gonna give these an eight outta 10. Okay, this next product I know is absolutely not meant for me, but I can still inspect it anyway. This is a super high end gaming tablet. And I just need you to know that this is real and this is something that actually exists. So this is the Asus ROG Flow Z13. This thing has an up to 14-core Intel Core i9 processor, a GEForce RTX 3050-Ti graphics card, a 1080p 120Hz display or a 4K, 60Hz option, up to one terabyte of M.2 SSD storage and a vapor chamber cooling solution on the back. So yes, it's a full-fledged gaming computer running Windows. You can think of it kinda like a Surface Pro but just way more gaming focused. Now, I can't imagine battery life will be killer on something like this most of the time, but hey, gaming laptops don't typically have amazing battery life, either, so that's not a huge surprise. I'm really into this design, though, the aesthetics of how they managed to shove all that power into a tablet-size package. It's got some thickness to it, of course, and it's definitely not lightweight, but it's a reasonable layout. There's a power button and volume rockers on the right side, along with a combo microphone headphone jack and a speaker at the bottom, and then there's a single USB type C Thunderbolt port on the left side, along with this labeled XGM port which is gonna let you plug in different external GPUs. There's pins and magnets at the bottom for docking a keyboard accessory, just like the Surface, and there's no ports up top, but just heat dissipation, just heat sinks, heat radiating out the top. And look at that. LEDs, PCB, and the angular cutout, and a kickstand. That is a really nice touch. And I'm not just saying that 'cause it's red and black, although that certainly helps, but they've made as many clever incisions for ventilation and angular gamer aesthetic as possible, and they seem to have gotten away with it. Now the 3050-Ti isn't the highest end graphics card in the world, I get that. If you wanna play \"The Witcher 3\" or \"Cyberpunk\" or something like that on high settings, you're gonna need more power, probably something in a laptop form factor, but that's why this thing can plug into those external GPU attachments, the same stuff that the ROG Flow thin and light laptop could plug into, 'cause this is meant to actually game on. You should definitely Dave2D's full video on it. He gets 120 fps on this tablet in overwatch. It's a tablet, it's hilarious. I'll link it below. So the thing is a tablet when you want it to be, but can plug into this ROG XG mobile graphics dock which gives you up to an RTX 3080. Basically, you're buying a gaming laptop in two parts, if that makes sense. But I keep coming back to everything I like about just the back of this tablet. The subtle texture of the metal, the rock-solid stand with this window cutout, and under the kickstand, there's a bunch of outlines, giving you a peek at what's inside, so the M.2 SSD, the battery, and of course, an opening to a micro SD card slot. There's also a set of coordinates on the back which, if you Google them, appears to direct you to Asus' headquarters in Taiwan. Best part though, they still included the camera on the back 'cause somewhere out there, there's somebody who would spend a bunch of money, there isn't even a price for this thing yet, but a bunch of money, probably, on a super high end gaming tablet, but still would take pictures with it. Anyway, I'm giving this thing like, a nine outta 10 just for the aesthetic, I'm a huge fan. But then the last thing I wanna mention, this USB-C power cable with the display readout on the end has been awesome. So basically, ever since I showed it in my everyday carry video, I've been carrying it and it's low-key, just like nerdy fun to just be able to plug in and see exactly what sort of wattage you're getting from your charger on any device. You know, we always talked about peak charging versus actually overall average charging rates, and this is so obviously unnecessary and overkill, but being able to see exactly what type of power you're drawing at any given moment, maybe it's 30 watts, maybe it's 22, maybe it's your laptop, you're pulling over 100 from low battery, I dunno, it's just so entertaining. Now the thing about this, every time I link it anywhere it sells out, so I'm tryin' to do my best to keep an updated link in the description for wherever I can find it in stock. I'll do that again with this video but no promises. If you want this, you'll probably have to act pretty fast. Good luck. Okay, really truly last but not least, as a reward for making it this far into the video, giveaway time. What better way to cap it off? So I'm teaming up with Aaron from \"Mr. Who's the Boss\" who just recently hit 10 million subscribers, huge shout out to him and congrats, it's an incredible milestone, and we're also gonna be teaming up with dbrand the logistics kings in tech that make this all possible. And why not just do a massive giveaway to celebrate it all? And by massive giveaway, I mean possibly the biggest tech giveaway of all time. So up for grabs is 10 iPhone 13 Pro Maxes all with matte black dbrand skins applied; 10 Samsung Galaxy S22 Ultras, all with the new atomic grip case, which is super nice, but then there's way more. 20 PlayStation 5's with dbrand's dark plates, don't ask me how we got these, 30 of the new OLED Nintendo Switch; 50 dbrand grip cases made for whatever phone you've got right now; 80 pairs of the latest AirPods 3, all dbranded; and 100 T-shirts. But not just any T-shirts, 50 limited edition of a new design from Aaron and 50 of the iconic histogram shirt from myself. All you have to do to enter is hit the link in the description, tons of chances to win, and it's super easy to hit the link and come back and just to check on the progress of who's been winning what, as the giveaway goes on. Now as a bonus, Aaron's idea was that for every single one of you that enters, he'd be donating two cents to a charity called SolarAid which gives solar-powered lights to families in need who would otherwise have to burn dangerous fuels and risk fires, so this is a great cause. And for me, it was kind of a no-brainer that I would match that. So between the two of our channels, two cents from him and two cents from me for every single one of you that enters this giveaway, that's a pretty positive impact we're able to make. How 'bout that? Tech giveaway that actually has a little bit of a positive impact on the planet. So get entered below, good luck. Thanks for watching Dope Tech and I'll catch you guys in the next one. Peace.",
    "transcript_keywords": [
        "Xbox",
        "Xbox Series",
        "play Xbox games",
        "Xbox games",
        "thing",
        "plug",
        "gaming",
        "back",
        "play Xbox",
        "battery",
        "earbuds",
        "Valve Steam Deck",
        "playing Xbox games",
        "laptop",
        "hear",
        "side",
        "pretty",
        "giveaway",
        "screen",
        "Marques"
    ],
    "transcript_entity_values": [
        "120",
        "60Hz",
        "Kickstarter",
        "250 bucks",
        "Nintendo Switch",
        "ROG XG",
        "30",
        "PlayStation 5's",
        "The Witcher 3",
        "XGM",
        "one",
        "AirPods 3",
        "3050",
        "Asus",
        "the Valve Steam Deck",
        "179 bucks",
        "C Thunderbolt",
        "22",
        "Xbox Series S",
        "1080p 120Hz",
        "about 40 minutes",
        "two cents",
        "seven",
        "nine",
        "13",
        "Sony",
        "five-hour",
        "eight",
        "Aaron",
        "10",
        "10 million",
        "SolarAid",
        "Intel Core",
        "20",
        "xScreen",
        "one terabyte",
        "over 100",
        "the other day",
        "80",
        "Xbox",
        "4",
        "Surface",
        "11-millimeter",
        "11.6-inch",
        "Cyberpunk",
        "ROG Flow",
        "Xbox Series S",
        "PCB",
        "100",
        "SD",
        "Google",
        "Xbox",
        "14",
        "GPU",
        "AirPods Pro",
        "99-watt-hour",
        "3080",
        "Samsung Galaxy S22 Ultras",
        "50",
        "120Hz",
        "Windows",
        "second",
        "Taiwan",
        "30 watts",
        "Tesla",
        "Connect",
        "Dope Tech",
        "jack",
        "two",
        "Xbox",
        "Pro Maxes",
        "USB",
        "1080p",
        "Marques",
        "GEForce"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "TIME",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "GPE",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.06785885244607925,
        -0.03424571081995964,
        -0.01810097135603428,
        -0.0818619430065155,
        0.06202768534421921,
        -0.04592692106962204,
        0.111483134329319,
        -0.0036004194989800453,
        -0.013791484758257866,
        -0.03718725964426994,
        0.019852375611662865,
        0.01653238944709301,
        -0.025486910715699196,
        0.003520856611430645,
        -0.06686727702617645,
        0.016092762351036072,
        0.08724670857191086,
        -0.09044227004051208,
        -0.01966264471411705,
        0.03419233486056328,
        -0.059041254222393036,
        -0.026260865852236748,
        0.020327238366007805,
        0.005907203070819378,
        -0.04422350227832794,
        0.016918595880270004,
        0.012064071372151375,
        -0.027450619265437126,
        -0.0722307488322258,
        -0.015407170169055462,
        0.014841501601040363,
        0.037488315254449844,
        -0.012071460485458374,
        -0.0032810738775879145,
        0.003867453197017312,
        -0.07279642671346664,
        0.0558248832821846,
        -0.01622796431183815,
        -0.09802938997745514,
        -0.08183550834655762,
        -0.044990431517362595,
        -0.02418508008122444,
        0.03623431175947189,
        0.04405128210783005,
        -0.010524595156311989,
        0.00403901282697916,
        -0.03459477052092552,
        -0.12559214234352112,
        0.012735936790704727,
        0.04297240823507309,
        0.03699902817606926,
        -0.08708921074867249,
        0.08684606105089188,
        -0.013619966804981232,
        -0.05235033109784126,
        0.03586293011903763,
        -0.021151147782802582,
        0.03474292904138565,
        0.04096211865544319,
        0.024472154676914215,
        0.12029732018709183,
        -0.04371534287929535,
        0.05183520168066025,
        0.005849729757755995,
        -0.009108704514801502,
        -0.0031852363608777523,
        0.011625900864601135,
        -0.0229423176497221,
        0.03273831307888031,
        -0.0711745023727417,
        -0.01794649474322796,
        0.016332468017935753,
        -0.030657188966870308,
        -0.03688034787774086,
        0.01802811399102211,
        0.021695982664823532,
        -0.02833363227546215,
        -0.04935440421104431,
        0.005311117507517338,
        0.08886300027370453,
        -0.025863926857709885,
        0.04308808967471123,
        0.012617025524377823,
        -0.06346020847558975,
        -0.03292868286371231,
        0.05243978649377823,
        0.013875368982553482,
        0.0027079805731773376,
        -0.044060610234737396,
        0.027167122811079025,
        -0.08983688056468964,
        0.054959241300821304,
        0.0358244888484478,
        0.033518362790346146,
        0.09865394979715347,
        -0.06258770078420639,
        0.04761837422847748,
        -0.06862971186637878,
        -0.010937296785414219,
        0.053769443184137344,
        0.019359810277819633,
        0.03368128091096878,
        0.09506609290838242,
        -0.004218749701976776,
        0.015452750958502293,
        -0.06607209146022797,
        -0.09841223061084747,
        0.023470157757401466,
        -0.03999089449644089,
        -0.028414838016033173,
        -0.049781493842601776,
        -0.029852233827114105,
        -0.033143267035484314,
        0.03229401260614395,
        0.013735559768974781,
        -0.024625767022371292,
        -0.056009791791439056,
        0.05979610234498978,
        0.030700892210006714,
        -0.045975491404533386,
        0.08140137791633606,
        -0.01831335574388504,
        -0.02837863378226757,
        -0.04004921391606331,
        0.06187155470252037,
        -0.030567169189453125,
        -0.08952268958091736,
        3.690727898609553e-33,
        -0.01718851551413536,
        0.009298882447183132,
        -0.023657849058508873,
        -0.002976346993818879,
        0.015790777280926704,
        -0.022264551371335983,
        0.0066001839004457,
        0.07156873494386673,
        -0.017443060874938965,
        0.12414046376943588,
        -0.0375799834728241,
        0.0035939523950219154,
        -0.062183890491724014,
        0.022427275776863098,
        0.0094490647315979,
        -0.08478625118732452,
        -0.03626269847154617,
        0.016199709847569466,
        -0.10437285155057907,
        0.012483482249081135,
        0.06295939534902573,
        0.02103509195148945,
        0.020280713215470314,
        -0.09319962561130524,
        0.04300212860107422,
        0.0651639923453331,
        -0.1114281639456749,
        -0.032863788306713104,
        0.10872600972652435,
        0.02774599753320217,
        -0.10955512523651123,
        -0.06881871819496155,
        -0.02474971115589142,
        -0.05396589636802673,
        -0.03735113516449928,
        0.0006478138384409249,
        -0.02195183001458645,
        -0.040738772600889206,
        0.00035031299921683967,
        0.024134056642651558,
        0.010382583364844322,
        -0.019619129598140717,
        -0.059056174010038376,
        -0.03735054284334183,
        -0.0084636639803648,
        0.025317152962088585,
        -0.03081100434064865,
        -0.03180268034338951,
        -0.028328975662589073,
        -0.01891389861702919,
        -0.0515538714826107,
        0.014253717847168446,
        0.020648173987865448,
        -0.00606530113145709,
        -0.0007855649455450475,
        -0.07460575550794601,
        0.03256503865122795,
        0.03174063563346863,
        0.06631556153297424,
        0.05746111646294594,
        0.06083221733570099,
        -0.002977370982989669,
        -0.03931531682610512,
        -0.01822969689965248,
        -0.0672660619020462,
        -0.00479730311781168,
        0.07407695055007935,
        0.06267452239990234,
        -0.05137312039732933,
        -0.057807911187410355,
        0.018220890313386917,
        0.059385694563388824,
        0.0025402705650776625,
        -0.06740685552358627,
        0.06688595563173294,
        -0.00912138819694519,
        -0.06741777807474136,
        0.05353734642267227,
        -0.021106624975800514,
        -0.09540773183107376,
        0.006160822696983814,
        0.03362457826733589,
        0.04775653034448624,
        0.013868328183889389,
        -0.03189036622643471,
        -0.017650527879595757,
        -0.08220651745796204,
        -0.08427933603525162,
        -0.0720374658703804,
        -0.00954317394644022,
        -0.03768715634942055,
        0.035669632256031036,
        -0.024794520810246468,
        -0.00547544052824378,
        0.02592426724731922,
        -4.45534252543931e-33,
        -0.00452057970687747,
        -0.04913891479372978,
        0.016929492354393005,
        -0.04825586453080177,
        0.05859161540865898,
        0.05318917706608772,
        0.08547542244195938,
        0.048376526683568954,
        -0.010036173276603222,
        -0.02758839726448059,
        0.008447284810245037,
        0.1067470833659172,
        -0.11103291809558868,
        0.033536918461322784,
        0.03480801731348038,
        -0.02948235534131527,
        0.06681971251964569,
        -0.07059001177549362,
        0.022018680348992348,
        0.007696921471506357,
        0.058593787252902985,
        0.030649056658148766,
        0.025929678231477737,
        -0.03792653605341911,
        -0.04563222825527191,
        0.06417147815227509,
        0.02887593023478985,
        -0.03687962144613266,
        0.05470532923936844,
        0.0465555414557457,
        -0.0025855235289782286,
        0.0745239183306694,
        0.038482435047626495,
        -0.04524695500731468,
        0.0838494822382927,
        -0.012612614780664444,
        0.04848704859614372,
        -0.014625911600887775,
        -0.074769988656044,
        -0.06642904877662659,
        0.03238114342093468,
        0.08527644723653793,
        -0.01635264791548252,
        -0.03779945522546768,
        0.014914778992533684,
        0.03974824398756027,
        -0.0778239518404007,
        -0.017298273742198944,
        0.016364436596632004,
        0.04319828376173973,
        0.025509653612971306,
        -0.04093822464346886,
        0.013289124704897404,
        -0.06499454379081726,
        -0.05557743459939957,
        -0.013206960633397102,
        -0.08712957799434662,
        0.05405281111598015,
        0.021902453154325485,
        -0.04037247970700264,
        0.08242767304182053,
        0.011865105479955673,
        -0.0811762809753418,
        -0.06410630792379379,
        -0.009678106755018234,
        0.08334953337907791,
        0.056111447513103485,
        0.03270478546619415,
        0.010575393214821815,
        0.00041129006422124803,
        0.00396856851875782,
        -0.005872485227882862,
        -0.037623003125190735,
        -0.05806082859635353,
        0.02428087592124939,
        0.020650343969464302,
        0.013604754582047462,
        -0.08656533807516098,
        0.0902923196554184,
        -0.010210583917796612,
        -0.011932577937841415,
        -0.024120470508933067,
        0.10336058586835861,
        0.05299174040555954,
        0.10025252401828766,
        -0.013564437627792358,
        0.007330050226300955,
        0.03115200810134411,
        -0.07894854992628098,
        0.004204417113214731,
        0.06560435146093369,
        0.05285456031560898,
        -0.02350238896906376,
        0.1394924372434616,
        0.10410446673631668,
        -5.981912210017981e-08,
        0.01789625734090805,
        0.008650600910186768,
        -0.015467366203665733,
        -0.024984022602438927,
        -0.07013938575983047,
        -0.07191763818264008,
        0.018533866852521896,
        0.009951775893568993,
        0.022182079032063484,
        -0.07977458834648132,
        -0.0036352735478430986,
        -0.08616181463003159,
        -0.004810489248484373,
        0.05502045527100563,
        0.035334423184394836,
        0.08998055011034012,
        -0.09629394859075546,
        0.08135491609573364,
        -0.050270773470401764,
        -0.07484869658946991,
        -0.01436258852481842,
        0.09174181520938873,
        0.11720236390829086,
        -0.05436798557639122,
        -0.01763172447681427,
        -0.0405251570045948,
        -0.03530158847570419,
        0.06638087332248688,
        0.07156117260456085,
        -0.005430860910564661,
        -0.04265734553337097,
        0.00666681258007884,
        -0.03583168983459473,
        -0.032519951462745667,
        0.019933627918362617,
        -0.04203137755393982,
        0.010094990953803062,
        -0.002143773017451167,
        0.08525127917528152,
        0.025760537013411522,
        -0.03041676990687847,
        -0.14785261452198029,
        -0.05286130681633949,
        0.024110477417707443,
        -0.01012579258531332,
        -0.006252445746213198,
        0.04707001894712448,
        -0.0710909515619278,
        -0.04394569620490074,
        0.051158349961042404,
        -0.0018095375271514058,
        0.08187473565340042,
        0.06557174772024155,
        0.0021987254731357098,
        0.06952528655529022,
        0.034795667976140976,
        0.035397790372371674,
        0.07774405181407928,
        -0.045422062277793884,
        0.02601812593638897,
        -0.02040490135550499,
        0.006203141063451767,
        0.014713111333549023,
        0.12257588654756546
    ]
}