{
    "id": "-FHkBz5X45A",
    "title": "Streaming sucks now: Ads, bundles, price",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-05-09T14:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=-FHkBz5X45A",
    "category": "Science & Technology",
    "tags": [
        "Netflix",
        "Hulu",
        "Disney Plus",
        "Max",
        "Apple TV Plus",
        "Paramount Plus",
        "Peacock",
        "Streaming",
        "Stranger Things",
        "movies on hulu",
        "disney streaming",
        "netflix original series",
        "tv on hulu",
        "apple tv",
        "hulu shows",
        "paramount +",
        "amazon",
        "what's on disney plus",
        "streaming services",
        "netflix series",
        "hulu movies",
        "official trailer",
        "disney hulu",
        "hbo max",
        "hbo",
        "shows on hulu",
        "commentary",
        "review",
        "the verge",
        "tech",
        "taylor swif",
        "streaming on hulu",
        "youtube premium",
        "hulu tv",
        "video streaming",
        "apple tv app",
        "paramount+"
    ],
    "views": 118354,
    "likes": 4800,
    "comments_count": 426,
    "description": "With higher prices, more ads, and unwanted bundling it really seems like streaming is becoming dangerously like cable. Last year alone, all of the major names in streaming  Netflix, Hulu, Disney Plus, Max, Apple TV Plus, Paramount Plus, and Peacock  have raised their prices. This all leads to one big question: is there an end in sight to this streaming hellscape? #Technology #TV #Streaming   00:00 My Netflix 00:46  How We Got Here 2:54  An Ad Business 5:34  Bundling 6:37 Is There Hope?  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz",
        "https://www.theverge.com/ethics-statement"
    ],
    "transcript": "(upbeat music) - What does your Netflix queue look like right now? Mine's got, \"Killing Eve\" on it, which was an awesome show that I adored when it premiered on AMC in 2018. It's got, \"Brooklyn Nine-Nine,\" another fantastic show that I really loved when it premiered in 2013 on Fox. And here's, \"Monk.\" \"Monk's\" awesome, I love, \"Monk,\" Tony Shalhoub, mwah. But also that premiered in 2002 and that's a lot of my Netflix right now. It kind of looks like cable and that seems like a problem to me because the last time TV looked like this, I was looking to cut the cord. So it got me thinking, why is streaming turning into cable? How did we get there and is there any hope for us to get out? Okay, so to understand things, first, we need to take a quick trip back to 2007 because the movies were popping, but piracy was kind of outta control. Like, remember all of those commercials at the theater about you wouldn't steal a car. That was 2007. But also in 2007, Netflix was doing something really interesting. They had their really successful DVD business, but they had noticed that a lot of people were tired of DVDs. They wanted things faster, quicker, and so they launched their own streaming service and it worked. Netflix started doing really well. They had, \"House of Cards, and, \"Orange is the New Black.\" They started winning Emmys. They started having huge pop culture phenomenons, like, \"Stranger Things,\" and, \"Bridgerton.\" They were even winning Oscars for major motion pictures. As they became this massive titan of the entertainment industry, other streamers started following suit. We got an HBO Max, which became Max, and we got CBS All Access, which became Paramount Plus. We got Peacock, which thankfully never changed its name. We even started to get really niche, weird little streaming services. My personal favorite was DC Universe, which was only DC comics and shows based on DC comics. I really miss, \"Swamp Thing.\" There was just something for everybody. Bob Iger, who I think at the time, was the former CEO of Disney, but is now again the current CEO of Disney, said he looked out at streaming and realized that there was a possibility for just infinite content. - And infinite consumption. - Basically anything you wanted to watch when you wanted to watch it. And he thought that was a wonderful idea. So he at Disney and a whole lot of other streaming companies started to make a lot of content. They started to try to realize infinite content, infinite content, but all of that was actually fueled by the fact that we had kind of 0% interest rates throughout the industry. So it was really cheap to borrow money to make all of this content, but then the interest rates went up and everybody started to want their money back. Specifically shareholders, who had invested a lot of their own cash. So they need to make money. How do you make money? Well, there's two ways. Advertising. Advertising just makes money. It's how broadcasting has worked for 50 years and the other was subsidies. And that one's actually a little confusing. So hold up a second, we're gonna get to that. First, let's talk about the ads. Okay, so the ads, Netflix introduced them back in, what was this? November 3rd, 2022. And since then, they've done a lot of work to make sure that we watch those ads, rather than just pay a subscription and get straight into, \"Bridgerton,\" season three. It's sick as hell, guys. And to be really clear here, Netflix wants you to watch the ads. That's why the cheapest tier is 6.99 and the next cheapest tier, without ads, is 15.49, more than double the cost because those ads make Netflix a lot more money than your subscription. Why is that? Well, it's because those ads are super hyper-focused in a way that cable and broadcast TV ads can't be. When I go and I turn on my TV and I try to watch, \"Grey's Anatomy,\" they know that I live in New Jersey and I'm watching, \"Grey's Anatomy.\" That's all the broadcasters know about me. When I go and I try to watch, \"Grey's Anatomy,\" on Netflix, they know that I also watched, \"Killing Eve,\" earlier. I just finished, \"Dead Boy's Detectives,\" last night and it was great. They know a lot of information about me, which means they can target me a lot better, which means Netflix can charge a lot more for those ads because those ads are way more lucrative and it's not just Netflix. Like, Amazon Prime Now charges you, what is it, 2.99 a month just to skip ads? Max has ads now. Peacock and Paramount actually introduced ads from the very beginning. Same with Hulu, and it's no mistake that those are also all the companies that came from broadcast TV. They always knew the inherent business of television is in advertising. It just took Netflix and Amazon and some of the others a little longer to catch up, which is also why, \"Killing Eve,\" is on Netflix's top 10 right now. And it's why a lot of these older shows are popping up again, because those older shows are cheaper for Netflix to license, which means they get a lot more of your advertising dollars for every minute that you watch the show versus something like, \"Bridgerton,\" which is really, really good, but a lot more expensive for Netflix to make. It's also why FAST TV is becoming such a thing. FAST TV, for the record is free ad-supported television. It's basically all of the reruns, just on demand. And you can go and you can watch 12 hours of, \"I Love Lucy,\" without hitting pause. You see it everywhere. Tubi, Pluto, even Disney is exploring some always on channels. Again, Peacock and Paramount, they've been doing this for ages, but they also understand the game, I think a lot better than a lot of the other streamers do. So yeah, streaming is effectively becoming an advertising business, which is also what cable was. But another thing that streaming is doing now is the same as what cable was doing, which is bundling stuff you don't want with stuff you do. Let's talk about those subsidies. Okay, when I talk about subsidies, what do I mean? Well, in the cable days, let's say I really wanted to watch FX, but the cable company would say, okay, you get FX, but you also have to pay for Fox Sports, and I don't really want Fox Sports. The same thing is happening now. Netflix, I think spent what, $5 billion on WWE rights because they really wanna get more audience and they think having WWE will bring in that bigger audience. That's also why Amazon Prime has Thursday night football, which I didn't even know was a thing because I don't watch sports. These companies really wanna figure out as many ways to get audience as possible, including with sports. And that's also unfortunately why your subscription fees are going up because they need your money, but they also need your money to subsidize all those sports. And that brings us to today, where unfortunately we are paying way more for our subscriptions, we're watching a lot more ads while we do it, and we're subsidizing a bunch of content we don't wanna watch, just like we were in 2007. But just like in 2007, I do think there's some hope. Back in 2007, Netflix came along and it made watching TV a lot easier, and I think there's actually some cool technology coming along that's gonna do the same now, I hope. First, I'm gonna have to like, pause a moment because this stuff is about to get really, really geeky. I'm gonna talk about something called ATSC 3.0, and I know your eyes just glazed over. Stop, this is cool, I swear. ATSC 3.0 has a horrible name, but it is a really, really interesting broadcast standard. I know, no, no, broadcasting standard, that sounds stupid, but don't worry, it's cool. What it means is that more information is streaming directly into your TV over the airwaves. No additional money to your ISP, no additional equipment on your TV, provided it has a tuner that works with ATSC 3.0, which a lot of newer TVs have. So it's okay. A lot of people are probably judging me right now. Don't judge me, it's cool. So what does ATSC 3.0 actually mean? Well, if you can get past all those letters and numbers, it effectively creates a DVR on your TV. Again, no additional equipment required, and that's really sick because if you have a DVR in your TV, that means you can just sit down and start watching the news whenever instead of having to sit down at exactly six o'clock to watch the six o'clock news. I know you all do that, but eventually, there's a lot more potential because some companies, like one called Roxi, are actually shipping apps over the airwaves, and right now, it's just a weird little music app and it's got some karaoke built in. But imagine if NBC did that with Peacock or CBS did that with Paramount Plus, or Disney did that with ABC. Imagine if you had Disney Plus on your TV, that would be pretty sick, right? But yes, the big caveat about ATSC 3.0 is that it's taken a long time to get to where it is. So it might not necessarily be the technology that saves us from our streaming healthscape, but it's one type of technology. It could be some other kind of technology because as in 2007, when people get tired, they start looking for new ways to get the content. That's why piracy's on the rise again. When that happens, someone inevitably comes in to disrupt the market and change things. In 2007, it was Netflix. In 2024, it could be ATSC 3.0, or it could be some whole other new technology or new company with a really big idea on how to get you to watch content without necessarily having to pay a ton of money to a whole bunch of companies. Are you also fed up with streaming prices? Are you also a fan of ATSC 3.0? I need to know. Please let me know. Everybody rise up, sound off in the comments.",
    "transcript_keywords": [
        "Netflix",
        "lot",
        "ads",
        "watch",
        "money",
        "ATSC",
        "streaming",
        "Disney",
        "started",
        "Killing Eve",
        "Grey Anatomy",
        "content",
        "make",
        "Netflix queue",
        "Monk",
        "ads make Netflix",
        "cable",
        "Thing",
        "Sports",
        "Paramount"
    ],
    "transcript_entity_values": [
        "Grey's Anatomy",
        "2013",
        "DVR",
        "HBO Max",
        "one",
        "0%",
        "I Love Lucy",
        "2002",
        "Emmys",
        "exactly six o'clock",
        "three",
        "FX",
        "today",
        "Bob Iger",
        "Dead Boy's Detectives",
        "Paramount",
        "CBS",
        "Disney",
        "Fox",
        "last night",
        "NBC",
        "Oscars",
        "House of Cards",
        "Paramount Plus",
        "Roxi",
        "Hulu",
        "AMC",
        "ages",
        "6.99",
        "New Jersey",
        "ABC",
        "night",
        "the New Black",
        "2024",
        "two",
        "Thursday",
        "Access",
        "Swamp Thing",
        "Amazon",
        "every minute",
        "12 hours",
        "the cable days",
        "Monk",
        "November 3rd, 2022",
        "$5 billion",
        "WWE",
        "Tony Shalhoub",
        "ATSC",
        "ISP",
        "3.0",
        "3.0",
        "DC",
        "2018",
        "second",
        "15.49",
        "Netflix",
        "2.99",
        "Disney Plus",
        "first",
        "Max",
        "2007",
        "50 years",
        "six o'clock",
        "Bridgerton",
        "Fox Sports",
        "Peacock",
        "a ton",
        "First",
        "10"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORG",
        "TIME",
        "LOC",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "TIME",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.012713366188108921,
        -0.16377218067646027,
        -0.017014317214488983,
        -0.045160938054323196,
        0.12498359382152557,
        0.01848645508289337,
        -0.027054650709033012,
        -0.02924814075231552,
        0.018457399681210518,
        0.013824806548655033,
        -0.037448178976774216,
        0.09461386501789093,
        -0.05251367762684822,
        0.019946740940213203,
        0.030090728774666786,
        -0.06514222919940948,
        0.09588248282670975,
        -0.12298936396837234,
        -0.09806694090366364,
        -0.029467696323990822,
        -0.03817543759942055,
        -0.04763674736022949,
        -0.022531474009156227,
        0.014337081462144852,
        -0.002061674604192376,
        -0.013345849700272083,
        -0.04799153655767441,
        -0.04079734906554222,
        -0.01799626462161541,
        -0.0517265610396862,
        -0.020337751135230064,
        0.055037736892700195,
        -0.0026208192575722933,
        -0.03658600151538849,
        0.01913050375878811,
        -0.12460579723119736,
        -0.03276711702346802,
        -0.07589500397443771,
        -0.05617814511060715,
        0.005615009926259518,
        0.10080038756132126,
        -0.06859754025936127,
        -0.07918251305818558,
        0.001498413155786693,
        -0.039681412279605865,
        -0.06576155126094818,
        0.029934730380773544,
        -0.03869282454252243,
        -0.0086810989305377,
        0.04611493647098541,
        -0.027829574421048164,
        -0.022030211985111237,
        0.04612082615494728,
        0.022899435833096504,
        -0.034905146807432175,
        -0.04702269658446312,
        -0.008510473184287548,
        0.054031774401664734,
        0.03828757256269455,
        0.018661392852663994,
        0.029369156807661057,
        -0.07872042804956436,
        -0.028212549164891243,
        0.037985824048519135,
        -0.02401844970881939,
        0.0027214232832193375,
        -0.02266606129705906,
        0.07797882705926895,
        -0.030397990718483925,
        0.014147615060210228,
        -0.02970711700618267,
        0.03102785162627697,
        0.023592807352542877,
        0.035906970500946045,
        0.07022462785243988,
        -0.01693391427397728,
        0.1174028217792511,
        -0.005915775895118713,
        0.006751160603016615,
        -0.04377884790301323,
        0.047003861516714096,
        -0.04320883750915527,
        0.005175868980586529,
        -4.640366023522802e-05,
        0.020951705053448677,
        -0.03429770842194557,
        0.026139046996831894,
        -0.039260994642972946,
        -0.009999982081353664,
        0.007003100123256445,
        -0.06604314595460892,
        0.10797031223773956,
        0.048479411751031876,
        0.013021794147789478,
        0.004268394783139229,
        0.0433465801179409,
        -0.08976785838603973,
        -0.07882528007030487,
        0.005849230568856001,
        0.019611213356256485,
        -0.0014312673592939973,
        0.0016173339681699872,
        -0.007068917155265808,
        -0.047939661890268326,
        0.014247212558984756,
        -0.08355545997619629,
        -0.0013582915998995304,
        0.11387483775615692,
        0.07653298228979111,
        0.054759252816438675,
        -0.03976492956280708,
        0.07174436748027802,
        0.03348568081855774,
        -0.03719411790370941,
        0.041102729737758636,
        0.050278402864933014,
        0.006402221973985434,
        0.003898394061252475,
        0.12697984278202057,
        0.047161947935819626,
        0.009359150193631649,
        0.08135276287794113,
        0.009853373281657696,
        0.002038549864664674,
        0.04976385831832886,
        -0.010025512427091599,
        -0.07762474566698074,
        4.6261609563969895e-33,
        -0.05435996875166893,
        0.0606953427195549,
        -0.030600138008594513,
        -0.09173925220966339,
        0.014855064451694489,
        0.01339798979461193,
        0.013931217603385448,
        0.05075288563966751,
        -0.08338375389575958,
        0.029795443639159203,
        -0.02209918014705181,
        0.05084754526615143,
        -0.051725104451179504,
        0.030021214857697487,
        -0.05994151905179024,
        -0.10005053132772446,
        -0.011739496141672134,
        -0.007010226137936115,
        -0.06574710458517075,
        -0.026110175997018814,
        0.029069101437926292,
        -0.006657548248767853,
        -0.042964644730091095,
        -0.04094367101788521,
        -0.03311336040496826,
        -0.08099444210529327,
        -0.01718415506184101,
        -0.020084960386157036,
        0.11796963959932327,
        0.04730656370520592,
        -0.0871478021144867,
        0.006178117822855711,
        0.04569336399435997,
        -0.04701982066035271,
        -0.004973742179572582,
        0.01107072178274393,
        -0.07155851274728775,
        -0.045070286840200424,
        -0.016844041645526886,
        -0.0369112566113472,
        -0.04526231065392494,
        0.024890171363949776,
        -0.13788525760173798,
        -0.017818810418248177,
        -0.03351388871669769,
        0.04037286341190338,
        0.07901380956172943,
        -0.05395583435893059,
        -0.037839800119400024,
        0.006040083710104227,
        0.016153352335095406,
        0.033674996346235275,
        -0.00013219102402217686,
        0.007386064622551203,
        -0.03039894439280033,
        0.028038056567311287,
        -0.009279451332986355,
        -0.018545566126704216,
        0.023409653455018997,
        -0.05765068531036377,
        0.05122028663754463,
        -0.02283509261906147,
        -0.04418523237109184,
        -0.048070721328258514,
        -0.09848302602767944,
        0.056257277727127075,
        0.09149976819753647,
        0.05399531126022339,
        -0.04293058067560196,
        0.03573242202401161,
        -0.05638352781534195,
        0.03292634338140488,
        0.004833419807255268,
        0.010420911014080048,
        -0.002254132181406021,
        0.05280395597219467,
        -0.08838389813899994,
        -0.025999056175351143,
        0.05378863587975502,
        0.05660229176282883,
        0.03793562576174736,
        0.010271735489368439,
        0.10058538615703583,
        -0.024446429684758186,
        -0.0064439489506185055,
        -0.013233519159257412,
        0.03268188610672951,
        0.006414990406483412,
        -0.01371259056031704,
        -0.0015878702979534864,
        -0.04553695395588875,
        0.05141468718647957,
        0.006609161384403706,
        0.08924435079097748,
        0.030998876318335533,
        -5.564404180366861e-33,
        -0.0719432681798935,
        0.01848709024488926,
        -0.030127009376883507,
        -0.005328782834112644,
        -0.09325399994850159,
        -0.04058099538087845,
        -0.0025852711405605078,
        0.018708376213908195,
        0.08969205617904663,
        -0.03064850904047489,
        -0.051014505326747894,
        -0.04963567107915878,
        -0.08156595379114151,
        0.038515716791152954,
        -0.03725790977478027,
        -0.07517416775226593,
        -0.013041387312114239,
        -0.032951585948467255,
        0.059550825506448746,
        -0.00016741610306780785,
        -0.051008496433496475,
        -0.00435712281614542,
        -0.09285631030797958,
        0.026797348633408546,
        0.05081431195139885,
        0.04040587320923805,
        0.07452424615621567,
        0.09800692647695541,
        0.025444209575653076,
        0.017436185851693153,
        -0.012077920138835907,
        -0.049056682735681534,
        -0.061927586793899536,
        -0.04002177342772484,
        0.03345426917076111,
        0.06492451578378677,
        0.06788131594657898,
        0.036287106573581696,
        -0.05273719131946564,
        -0.08160851150751114,
        -0.02834968827664852,
        0.0012988343369215727,
        0.04695279151201248,
        -0.03653882071375847,
        0.023603422567248344,
        -0.04067942500114441,
        -0.04464306682348251,
        0.012936336919665337,
        -0.08420611172914505,
        0.012292062863707542,
        0.015426835045218468,
        0.016353879123926163,
        0.038777437061071396,
        0.029099732637405396,
        -0.035187024623155594,
        -0.010008634999394417,
        -0.019037434831261635,
        0.05780525878071785,
        0.02144954539835453,
        -0.009889732114970684,
        0.01750011183321476,
        0.024309303611516953,
        -0.07762185484170914,
        -0.03824424743652344,
        0.014268928207457066,
        0.015053531154990196,
        0.12839332222938538,
        -0.03577011078596115,
        -0.0063586728647351265,
        0.007178975734859705,
        0.024436701089143753,
        -0.05384521931409836,
        -0.07856492698192596,
        -0.08398466557264328,
        -0.03718361631035805,
        0.08495126664638519,
        0.07337166368961334,
        0.012007252313196659,
        -0.06974903494119644,
        0.0644548237323761,
        0.016555994749069214,
        0.05834066495299339,
        0.03308318555355072,
        -0.026475118473172188,
        0.06661835312843323,
        -0.03833642974495888,
        0.10022106766700745,
        0.0018251463770866394,
        -0.06964720040559769,
        0.019734960049390793,
        -0.03616867586970329,
        -0.06551279872655869,
        -0.13785895705223083,
        0.08020277321338654,
        0.04756493866443634,
        -5.508520928287908e-08,
        -0.021554401144385338,
        -0.02055966854095459,
        -0.05583622679114342,
        0.06505025923252106,
        0.07245451211929321,
        -0.007884182035923004,
        0.020454127341508865,
        0.017376763746142387,
        -0.009473875164985657,
        0.004859901499003172,
        0.054360032081604004,
        -0.025081340223550797,
        -0.06872440874576569,
        0.034213028848171234,
        0.0630059465765953,
        0.015621558763086796,
        -0.014915120787918568,
        -0.028932102024555206,
        0.02022411860525608,
        0.0018978664884343743,
        -0.03403224050998688,
        0.05327170342206955,
        0.05225059390068054,
        -0.052736952900886536,
        -0.0018687653355300426,
        0.038042571395635605,
        0.06250154227018356,
        -0.004266425035893917,
        0.08609186857938766,
        -0.010085032321512699,
        -0.08467385172843933,
        0.011640860699117184,
        -0.04186251387000084,
        -0.03015262633562088,
        -0.06526465713977814,
        -0.04421781748533249,
        -0.04042181372642517,
        -1.9187860743841156e-05,
        0.00969689805060625,
        0.08403366059064865,
        0.11030977964401245,
        0.014322634786367416,
        0.09096796065568924,
        -0.019795840606093407,
        0.0399286225438118,
        0.034288182854652405,
        -0.032860781997442245,
        0.016084088012576103,
        0.10943599790334702,
        -0.039453841745853424,
        0.02086532860994339,
        -0.02776583656668663,
        0.043994054198265076,
        0.005747555289417505,
        0.077798031270504,
        -0.07650765031576157,
        0.01333992462605238,
        -0.005688119679689407,
        -0.10389229655265808,
        0.06868419796228409,
        0.05297195166349411,
        -0.06152672693133354,
        0.03512871265411377,
        0.05131674185395241
    ]
}