{
    "id": "-G-DByczbWA",
    "title": "My PC is Slow… Can These “Speed Up” Tools Fix it?",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-05-25T17:00:13Z",
    "video_url": "https://www.youtube.com/watch?v=-G-DByczbWA",
    "category": "Science & Technology",
    "tags": [
        "PC",
        "Speed up tools",
        "Avast",
        "AVG",
        "IOBit",
        "AShampoo",
        "Microsoft",
        "windows",
        "gaming",
        "Computer",
        "USB",
        "Testing",
        "LTT",
        "Labs"
    ],
    "views": 1297797,
    "likes": 54284,
    "comments_count": 2505,
    "description": "Visit  and use offer code LTT for 10% off  Check out the GL.iNet Flint 2 using the link below!   Everyone wants their computer to be running in the best condition possible, but they dont want to re install windows. Thats why we decided to run 6 Different tools to see if any of these can Speed up your computer. Will they work? Are they Snake Oil? The only way to find out was to hand over our credit card, and get Labs to test them!  Discuss on the forum:   Download these Tools...If you dare! Avast:   CCleaner:  IOBit:  AVG Tuneup:  MS PC Manager:  Ashampoo Win optimizer:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:58 Our Tools of Choice 2:29 Startup Time Results 3:29 Some Failed before starting... 4:26 Productivity Test Results 7:10 Scary Marketing Tactics 9:45 Gaming Results 10:12 Why didnt they work? 11:11 Should you buy them? 12:00 DIY Solutions 15:01 Outro",
    "description_links": [
        "https://www.squarespace.com/LTT",
        "https://lmg.gg/GL.iNet-LTT-Q1-2024",
        "https://linustechtips.com/topic/1571456-i-bought-6-pc-%E2%80%9Cspeed-up%E2%80%9D-tools-to-see-if-they-work/",
        "https://www.avast.com/en-ca/index#pc",
        "https://www.ccleaner.com/",
        "https://www.iobit.com/en/advancedsystemcarepro.php",
        "https://www.avg.com/en-ca/avg-pctuneup#pc",
        "https://pcmanager.microsoft.com/en-us",
        "https://www.ashampoo.com/en-us",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "Step one was to create the kind of bloated, bogged down system that would send someone looking for a remedy. So, we downloaded every piece of free software in arm's reach, carpet bombed our system drive with random extracted zip folders, and sprinkled in a generous helping of RGB control applications. Which might not sound that bad, but it took our system from booting up in 28 seconds to booting up in over a minute. And guys... That's on a high-performance gaming PC. Step 2 was to do what the average person would do and Google \"best PC speed-up tools\" where almost immediately we noticed a pattern. Most of the review sites for these tools recommended the same handful of tools over and over and over again, which might seem like a case of \"hey, experts agree\" until you dig just a little bit deeper. What is this? For every tool on their recommended list includes, Windows 10 offers comparable built-in tune-up tools. I mean, kudos for honesty, I guess, but if Windows has these features for free, then why the Sam fool are you recommending that I buy other software? To find out, we took the one brave step that no one else seemed to be willing to take. We actually bought and installed the most recommended PC speed-up tools, to see if they could fix what ails us. Spoiler, some of them actually work pretty well, but you could achieve a similar result for free. All it'll cost you is patiently listening to this message from our sponsor. GL-INet, meet the Flint 2, your networking ally. It runs on vanilla OpenWRT, has speeds of up to 900 megabit per second, and even has multi-WAN support. Check it out at the link down below. After braving the ad-infested listicle wasteland that used to be Google search results page, we decided to dig further into ashampoo win optimizer, avast cleanup, Ccleaner, AVG tuneup, iObit advanced system care 17 pro and Microsoft PC manager. If a free trial of the premium features was available, we used that, otherwise we bought the software outright. And the last line you'll find on our performance charts is a fresh windows install to see how close our tools can get to the. Out-of-the-box experience. Now one of the most common complaints is my computer takes forever to start up and Every one of these applications includes a dedicated tool to help address this that honestly works pretty well Across the board our desktop to desktop reboot times dropped by at least 30 seconds But there were some standouts iobit and ccleaner led the pack cutting our time by more than half Can't say I expected that given that iobit Added six of its own applications to our startup sequence, but hey you can't argue with the results Which is unfortunate for Microsoft who seem to know less about deep loading their own operating system than these third parties With that said it's not like it was all bad news for Redmond as you would expect a clean Windows install topped the charts Which is probably going to be a bit of a pattern here now we need to address our pet room elephants Why is it that ashampoo and AVG have a did not finish here? It's more of a DNT on ashampoo site We were overwhelmed by just how many pieces of software they made and when we did find win optimizer The one that the review sites told us to use there was six different options We could have just gone with the latest one version 27 But we didn't even feel like we could trust that since if you refresh the page or clear your cookies The price would change every single time It even went as low as free if you bought it with another piece of software. This rabbit hole actually goes much deeper and we will touch on it after some more benchmarks but ultimately this caused us to be uncertain about what we were even buying we just killed it from our testing. As for AVG they were actually bought by Avast back in 2016 and since over the years they've become almost the same piece of software, except for AVG requires a credit card to start the free trial. No, see you later we're over it and yes CCleaner is also owned by Avast but the UI and the features were different enough that we just decided to keep it in our testing kicking off our productivity suite then we started by encoding a 1080p video in Handbrake which is a really useful test because the run-to-run variance is extremely tight allowing us to demonstrate the small but measurable effects of both a bloated system and of these tools now obviously these differences are pretty small but given that I expected them to be pure snake oil I was actually kind of pleasantly surprised now as you'd expect a fresh install of Windows is of course the best medicine but reinstalling everything you actually do use can be a time- consuming endeavor compared to just running Avast which landed darn near our fresh install demonstrating that these tools well they can't speed up your PC but they may be able to actually unslow it or wait unless whoa in Cinebench 2024 Ccleaner and IObit tied with the clean install in single core But avast and Ccleaner actually won the multi-core test Well, except that a 20-point difference between all the competitors here is Not as big as it sounds. So if we're being realistic Everything but the bloated system is within our expectations for a clean system, which is still a good result for our cleaners Our last productivity test is 7-zip, which is great because in addition to looking at our CPU, it tests the impact of bloat on our poor cluttered up SSD. Almost all of these softwares have some kind of drive optimization button that tries to clean up temporary files, clear junk files like old Windows updates, and some even go as far as to defragment or trim your drive, organizing all of the files in a way that they are more quickly accessible As for our results, wow this is by far the biggest difference we've seen yet. Creating a compressed zip file results in as much as a 9% difference between our bloated system and IObit. As for the rest, well, regardless of whether we're compressing or decompressing files, our results ended up falling within the expected run-to-run variance, so I guess they all work the same. But with that said, there is a clear difference in the experience of using the different suites. While Microsoft PC Manager didn't lead the pack in results and didn't even include a trim function, what it did do was perform a lot of the other cleanup functions without feeling like bloatware. Plus, I mean, it's free real estate. So far, for the paid options, avast, CCleaner and iObit have all done pretty well at unslowing our computer, managing to get us on par or at least close to a fresh install. The question is, can they pull off the same in gaming? Well, I would love to talk to you about that, but first, there's something way more important that we need to address. In researching this project, we came across some of the most invasive predatory marketing tactics that we have ever seen. Going back to Ashampoo, you might at first say, \"Wow, great! They're Intel and Microsoft partners?\" But look closely, you guys. That is definitely not the official Microsoft partner logo. And neither Intel nor Microsoft list ashampoo as a partner in return. This is pretty much the tech industry equivalent of updating your relationship status, except she has absolutely no idea who you are, and every pick of you together has obvious hover hand. And aShampoo wasn't the only one whose business practices are in bad condition. Er. Iobit was super aggressive when it came to completing the sale, bombarding us with promotional bundles and using any excuse to offer us an enormous discount. Is it spring? Is it Mother's Day? Mom, forget the flowers. I got you IObit. Now all I got to do is complete the checkout process and, oh my goodness, the FOMO marketing tactics don't stop there. If you're on the checkout page and you go to close your browser, a pop-up warns you that, \"OMG, wait! For the next five minutes, you can save another 20%!\" Which, by the way, I went for, since, hey, it was Elijah's job to sit at the computer and wait for the price change anyway. What do I care? Okay, I do care. These kinds of gross tactics are everywhere. I mean, IObit ticks down a limited offer that resets if you clear your cookies, so obviously it wasn't that limited. And then they continue to abuse you even after you purchase the software. I have three downloads remaining? What? I paid for the licensed version of your software. How can you deny me the right to download it again? Especially since I can just download the free version as many times as I want and then activate it with my key. Now for many of you, this isn't gonna be a surprise and you probably won't fall for this stuff. But if these tactics exist, you know it's because they work on someone. So just, hey, for you and yours, stay safe out there. Some of the more basic applications that we saw ended up just wrapping Windows features into a pretty looking interface and then taking your money for repackaging what you already had. We're gonna have a fun closer look at that over at lmg.gg/floatplane where John and Elijah talk about some of the funny stuff they found during testing that didn't make the YouTube cut. Now for the gaming results! Drumroll, please! Yeah, literally the exact same. The only slight difference is iObit lost 3 FPS in both averages and 1% lows, and our clean install was only outside of our expected variance compared to our applications in one game, and even then it was just barely. Which, it's kind of confusing, right? I mean, why wasn't our bloated system worse than a clean install? Well... For starters, modern systems usually include multiple CPU cores, some of which can manage background applications at a lower power state, while the main cores focus on your game. And the developers of these tools know this, which is why most of them don't mention gaming at all, and even the ones that do don't focus on it. But then, okay, what about the outlandish claims that they do make? Does that mean those are real then? IObit promised to make our system 200% faster and Avast promised 23% faster work performance. How do they get away with saying those things when that's clearly not what we measured? There are millions of potential combinations of computer hardware out there and when you add software to the mix, those combinations easily balloon into the billions. So because it's pretty much impossible to test every one of these combinations, there's just no real way to hold these companies accountable for these claims. With all of that said, is there anyone that I would recommend a software package like this for? If you're watching this video, probably not you, but if you are constantly being bothered by a family member to update their drivers, delete useless startup items, and to clear up their storage space, then I would say Avast and CCleaner are easy to use applications that can help with that, and Maybe give them a financial incentive to learn this stuff for themselves. I would have actually included iObit in that list since they legitimately performed well in all of our tests, but installing six applications combined with that horrible shopping experience just Disqualifies them in my book. We are still gonna have all of them linked down below in case you want to check them out But I've just, ugh, man these sites. Some of them aren't even worth going to. Especially because realistically, if you don't mind spending five minutes a month on computer hygiene, there are some tricks to achieve very similar results while sparing your credit card that are both fast and easy. You can even do them right now. Hit Control-Shift-Escape to open up Task Manager and head to the Startup tab. From there, you can choose which applications you want on Startup and which ones you're okay to open manually. If this takes you even three minutes and then saves you 30 seconds on every reboot. You are going to make up that time you spent in just six reboots. Taking that a step further. If you're noticing that there are apps in there that you haven't used in forever, hey, maybe it's time to just uninstall them. Search add or remove programs, and then take your time going through the list and looking for apps to remove. This won't only stop that app from starting up on boot, but it should also help free up some storage space. Speaking of storage, if you want to defrag or trim your drive, the Windows search bar is your new best friend. In most of your cases... These tasks will run automatically, but if not, you can change that setting here or you can press the optimize button to run them right now. This can take a while though on slower mechanical drives, so just maybe let it run on the schedule or run it the last thing before you go to bed. Another storage tool is disk cleanup. Just scroll through the lists and confirm what you'd like to clean. The biggest ones are probably going to be your recycle bin and your temporary files. Then click OK, and just like that... You've probably saved a couple dozen gigs if you haven't done this in a couple years. Our final tip is, if you really need more performance, it may just be time for an upgrade. And guys, I'm not talking about a whole new system, but the thing is, many of these tools are targeting people who are on older systems that might still be using an old-school hard drive as their main system boot drive. But the issue with that is, at the price of this software... You could just buy an SSD that would result in a truly meaningful day-to-day performance improvement, and then clone all of your data over to it with a convenient free trial tool like Macrium. Or, another option would be this one from Ashampoo. Just make sure to refresh the page a few times to get the best price. I'm kidding. What I'm not kidding about is our sponsor. Squarespace. Building a user-friendly, visually captivating website for your business is not the easiest thing to do. Luckily with Squarespace, you're set up with a Blueprint for success. Their new guided design system aptly named Squarespace Blueprint helps you build your own unique online presence from the ground up with professionally curated layouts and styling options. Then dive into the details with their Fluid Engine Editor which features intuitive drag and drop building blocks. Once you're happy with your marvelous creation, you can then use their comprehensive email marketing tools to engage with your audience, generate leads, and make that moolah. Plus, their advanced analytical tools let you see what's working and what you need to tweak for your next campaign. So, visit squarespace.com/LTT for a free trial and receive 10% off your first purchase of a website or domain. If you guys enjoyed this video, go check out \"How to Build a PC The Last Guide You'll Ever Need.\" We've updated it for 2024 and, yeah, it's two hours long, but it is packed with information and may even help you if you need to upgrade to an SSD.",
    "transcript_keywords": [
        "system",
        "tools",
        "Windows",
        "software",
        "iObit",
        "free",
        "avast",
        "bloated system",
        "results",
        "Ccleaner",
        "Microsoft",
        "applications",
        "install",
        "windows install",
        "ashampoo",
        "clean Windows install",
        "average",
        "clean",
        "time",
        "free trial"
    ],
    "transcript_entity_values": [
        "the years",
        "one",
        "20",
        "GL-INet",
        "five minutes",
        "SSD",
        "IObit",
        "RGB",
        "30 seconds",
        "10%",
        "Handbrake",
        "over a minute",
        "John",
        "Task",
        "9%",
        "FPS",
        "three",
        "200%",
        "at least 30 seconds",
        "YouTube",
        "the Flint 2",
        "Windows",
        "Microsoft",
        "2024",
        "2016",
        "more than half",
        "Fluid Engine",
        "IObit",
        "first",
        "a couple dozen",
        "Squarespace Blueprint",
        "Windows 10",
        "aShampoo",
        "billions",
        "another 20%",
        "AVG",
        "Disqualifies",
        "FOMO",
        "The Last Guide",
        "iObit",
        "Redmond",
        "Squarespace",
        "CPU",
        "Ccleaner",
        "three minutes",
        "six",
        "third",
        "Intel",
        "listicle",
        "IObit",
        "UI",
        "1080p",
        "28 seconds",
        "Windows",
        "Startup",
        "Google",
        "Sam",
        "Spoiler",
        "Ashampoo",
        "the next five minutes",
        "a couple years",
        "27",
        "Iobit",
        "Avast",
        "3",
        "millions",
        "Windows",
        "two hours",
        "Startup",
        "17",
        "23%",
        "Avast",
        "1%",
        "2024",
        "Elijah",
        "2",
        "900 megabit"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORG",
        "TIME",
        "PERCENT",
        "ORG",
        "TIME",
        "PERSON",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "ORG",
        "EVENT",
        "NORP",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "LOC",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY"
    ],
    "vector": [
        -0.108210489153862,
        -0.018538080155849457,
        0.01130938995629549,
        -0.0034808036871254444,
        0.0944729596376419,
        -0.062454670667648315,
        -0.011153661645948887,
        -0.07352331280708313,
        -0.06701362878084183,
        -0.042843662202358246,
        0.0038571059703826904,
        0.03584221005439758,
        -0.09103275090456009,
        -0.03251677006483078,
        0.01375273335725069,
        0.02902320958673954,
        0.04752326384186745,
        -0.012885937467217445,
        -0.04196728765964508,
        0.018029753118753433,
        -0.057209961116313934,
        -0.07465150207281113,
        -0.048080794513225555,
        -0.04764103144407272,
        0.007275639101862907,
        0.017122507095336914,
        -0.04179591313004494,
        -0.058383237570524216,
        0.003221468534320593,
        -0.048976898193359375,
        -0.020482204854488373,
        0.005640165414661169,
        -0.014662815257906914,
        -0.007611701264977455,
        0.08216023445129395,
        -0.03247155249118805,
        0.040729548782110214,
        -0.025663862004876137,
        -0.05089527368545532,
        -0.03952357545495033,
        0.020300405099987984,
        0.016541525721549988,
        -0.01731877028942108,
        -0.04903636500239372,
        0.04103561490774155,
        -0.04372337460517883,
        0.018221022561192513,
        -0.04918289557099342,
        -0.03487289696931839,
        -0.06139900162816048,
        -0.030998777598142624,
        -0.04546770453453064,
        -0.002341724466532469,
        -0.0843205600976944,
        -0.03853456676006317,
        0.002588357776403427,
        0.007400571368634701,
        -0.06234297901391983,
        0.02290806546807289,
        -0.001153924036771059,
        0.034549180418252945,
        -0.046043723821640015,
        -0.04252264276146889,
        0.12230656296014786,
        0.008399423211812973,
        0.044945135712623596,
        0.05967186018824577,
        -0.006151766516268253,
        -0.012561812065541744,
        -0.0693308487534523,
        -0.07284018397331238,
        0.029591431841254234,
        0.011678897775709629,
        0.08593621104955673,
        0.0037713891360908747,
        0.04274119436740875,
        0.0005585397593677044,
        -0.004791893996298313,
        0.061529017984867096,
        -0.10741183161735535,
        -0.014306171797215939,
        -0.060080159455537796,
        0.05070691555738449,
        -0.044858839362859726,
        0.02605435624718666,
        0.046258438378572464,
        -0.002073122886940837,
        0.0024923193268477917,
        0.04794737696647644,
        -0.030605994164943695,
        0.05927922949194908,
        0.07939435541629791,
        0.12944673001766205,
        0.02863181009888649,
        0.0881877914071083,
        0.014762604609131813,
        0.0717022493481636,
        -0.10846224427223206,
        -0.1031312644481659,
        0.0808892548084259,
        -0.027776246890425682,
        -0.0006848463090136647,
        0.01128173153847456,
        -0.05318271741271019,
        -0.030224859714508057,
        -0.00693845609202981,
        0.011631778441369534,
        0.07629235088825226,
        0.03986562043428421,
        -0.027281716465950012,
        -0.0125286178663373,
        0.059389159083366394,
        -0.015834182500839233,
        -0.024374566972255707,
        0.04527871310710907,
        -0.04476673901081085,
        -0.06253305077552795,
        -0.023889878764748573,
        0.015720708295702934,
        0.027173858135938644,
        -0.047691427171230316,
        -0.032232556492090225,
        -0.039518292993307114,
        -0.09109972417354584,
        0.09850475192070007,
        0.06686285883188248,
        -0.0033605224452912807,
        2.9508721215439896e-33,
        0.02716374211013317,
        -0.03877536579966545,
        -0.05791556090116501,
        -0.06862133741378784,
        -0.012606371194124222,
        0.05099579319357872,
        0.012689362280070782,
        0.006215288769453764,
        0.014138631522655487,
        0.017378319054841995,
        -0.006864823866635561,
        0.014587732031941414,
        -0.0832616537809372,
        0.03959625959396362,
        0.07297342270612717,
        -0.0071123805828392506,
        0.011550461873412132,
        0.056622251868247986,
        0.0019343519816175103,
        -0.042039334774017334,
        0.07536356896162033,
        -0.06938613951206207,
        -0.051507845520973206,
        -0.04247533157467842,
        0.08441859483718872,
        -0.023896338418126106,
        -0.031974777579307556,
        0.009795906953513622,
        0.08617967367172241,
        0.023130344226956367,
        -0.07127924263477325,
        -0.022024279460310936,
        -0.045655757188797,
        0.006951924879103899,
        -0.039726339280605316,
        0.02955382689833641,
        -0.05857658386230469,
        -0.04520777240395546,
        0.07324816286563873,
        -0.002097799675539136,
        0.008205443620681763,
        0.03291359171271324,
        -0.06177219748497009,
        -0.10595040768384933,
        -0.060615550726652145,
        -0.022118622437119484,
        -0.02646428532898426,
        0.04117699712514877,
        -0.009726852178573608,
        0.09708511829376221,
        -0.04842004552483559,
        0.05088912695646286,
        -0.038063302636146545,
        0.05768832564353943,
        -0.07465898245573044,
        0.04476289823651314,
        0.07768454402685165,
        -8.954123040894046e-05,
        0.08305595815181732,
        0.06417176872491837,
        0.05193943530321121,
        -0.058245424181222916,
        0.002163513330742717,
        -0.06546854972839355,
        0.023062987253069878,
        -0.020611759275197983,
        0.08398188650608063,
        0.04964035376906395,
        -0.03854967653751373,
        0.07276451587677002,
        -0.04578853398561478,
        -0.05651848018169403,
        0.04845672473311424,
        -0.018195729702711105,
        0.08537095785140991,
        -0.05099118873476982,
        -0.03706938028335571,
        0.005022258032113314,
        -0.10070188343524933,
        -0.014880364760756493,
        -0.04272511228919029,
        0.09629803150892258,
        0.049265503883361816,
        -0.06483595818281174,
        0.09426549822092056,
        -0.015363015234470367,
        -0.03337802737951279,
        -0.02287702076137066,
        0.019150670617818832,
        -0.014393125660717487,
        0.025165745988488197,
        0.06410689651966095,
        0.010635717771947384,
        0.05501542240381241,
        -0.07867489010095596,
        -3.848147530677781e-33,
        -0.06372823566198349,
        -0.05756308510899544,
        0.03829716891050339,
        0.056993383914232254,
        -0.05316348001360893,
        -0.007624993100762367,
        0.02603096142411232,
        -0.0298644807189703,
        0.04300154000520706,
        -0.07646708190441132,
        0.023717503994703293,
        0.02866053394973278,
        -0.027412589639425278,
        -0.08647433668375015,
        0.03831406310200691,
        -0.019969303160905838,
        0.006438673008233309,
        -0.055689696222543716,
        0.08690763264894485,
        -0.006183199118822813,
        -0.022927451878786087,
        0.019404197111725807,
        -0.03316633775830269,
        -0.0152058070525527,
        -0.04575275629758835,
        0.0130363954231143,
        -0.013843879103660583,
        0.004486919846385717,
        0.018103905022144318,
        0.030207160860300064,
        0.07544682919979095,
        0.08165239542722702,
        -0.04405593499541283,
        -0.00044196381350047886,
        0.10579194873571396,
        -0.012451780028641224,
        0.11132347583770752,
        0.006212868727743626,
        -0.03857890143990517,
        -0.036764904856681824,
        0.06987086683511734,
        0.03307819738984108,
        -0.04617628455162048,
        -0.02164388820528984,
        0.02792240120470524,
        0.04165652021765709,
        -0.0015250497963279486,
        -0.09118086844682693,
        -0.05169793590903282,
        0.06497170031070709,
        0.05428985878825188,
        -0.04423145949840546,
        0.05060693994164467,
        0.04098239913582802,
        -0.02041645348072052,
        -0.028846288099884987,
        0.0007768415380269289,
        -0.009110544808208942,
        -0.06555879861116409,
        -0.03208472207188606,
        0.000627816014457494,
        0.026431331411004066,
        -0.05061294138431549,
        -0.06584662944078445,
        0.0680069774389267,
        0.06741607934236526,
        0.08053094893693924,
        0.023036567494273186,
        -0.021936243399977684,
        -0.012571850791573524,
        -0.017711151391267776,
        0.0011426284909248352,
        0.031987596303224564,
        -0.06846077740192413,
        0.004969724453985691,
        0.0008000648813322186,
        0.06911525875329971,
        -0.03367322310805321,
        -0.03237374126911163,
        -0.07229989767074585,
        0.024876775220036507,
        0.0018585966899991035,
        0.02862192690372467,
        -0.04581843316555023,
        -0.07518557459115982,
        -0.023612450808286667,
        0.0106163015589118,
        -0.005427987780421972,
        0.0495833195745945,
        -0.012442518025636673,
        -0.07586957514286041,
        -0.009970573708415031,
        0.02410760521888733,
        0.09326653182506561,
        0.0513293631374836,
        -5.7500233907603615e-08,
        0.025553280487656593,
        0.004636711440980434,
        -0.04228638485074043,
        0.036240898072719574,
        0.01625141128897667,
        -0.023232266306877136,
        -0.09196402877569199,
        0.08368659764528275,
        -0.018317949026823044,
        -0.06901494413614273,
        0.1282283365726471,
        -0.05273989960551262,
        -0.039317503571510315,
        -0.02124042809009552,
        0.044935524463653564,
        -0.01323479600250721,
        -0.08440586179494858,
        0.02660743147134781,
        -0.03170411288738251,
        -0.1284020096063614,
        0.03197453171014786,
        0.06885392963886261,
        0.07843124121427536,
        -0.010186940431594849,
        0.01581527292728424,
        -0.0024634855799376965,
        0.08336584270000458,
        0.04135258123278618,
        0.05594664067029953,
        -0.006208330392837524,
        -0.09044478833675385,
        0.021347612142562866,
        0.02081393264234066,
        -0.00934740249067545,
        0.09042979031801224,
        -0.023446857929229736,
        -0.008880695328116417,
        0.08847886323928833,
        0.13256239891052246,
        0.07874862104654312,
        0.011561550199985504,
        0.027150176465511322,
        -0.024119429290294647,
        -0.04409465193748474,
        -0.029415642842650414,
        -0.0902993306517601,
        -0.056378740817308426,
        -0.05649161711335182,
        0.08516953885555267,
        -0.07516804337501526,
        0.0011671484680846334,
        0.06658050417900085,
        -0.01722990907728672,
        0.06083336099982262,
        0.012000421062111855,
        -0.04851176217198372,
        -0.004043654538691044,
        -0.015083644539117813,
        0.014447241090238094,
        0.10730131715536118,
        -0.030246194452047348,
        -0.11051879823207855,
        0.05431022867560387,
        0.02267192304134369
    ]
}