{
    "id": "-HmaAl2X09E",
    "title": "iPhone 15 event in 17 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-09-12T18:53:37Z",
    "video_url": "https://www.youtube.com/watch?v=-HmaAl2X09E",
    "category": "Science & Technology",
    "tags": [
        "iPhone 15",
        "new iPhone 15",
        "iPhone USB-C",
        "Apple Event",
        "Apple Event 2023",
        "Apple Event recap",
        "Apple Event supercut",
        "iPhone 15 Plus",
        "iPhone 15 Pro",
        "Apple Watch Ultra 2",
        "iphone 15 pro max",
        "iphone 15 ultra",
        "iphone 15 colors",
        "iphone 15 camera",
        "iphone 15 release date",
        "apple iphone 15",
        "iphone 15 review",
        "iphone 15 rumors",
        "iphone 15 design",
        "iphone 15 pro max 2023",
        "iphone 15 pro camera",
        "apple watch",
        "tech",
        "the verge",
        "apple event 2023"
    ],
    "views": 1187237,
    "likes": 19856,
    "comments_count": 1754,
    "description": "Apple just wrapped up its Wonderlust showcase, where it revealed an updated iPhone 15 lineup with USB-C, Dynamic Island, and more. Plus, we got a look at the Watch Series 9, Watch Ultra 2, and much more. Here are all the biggest announcements. #Apple #Technology #iPhone15   Read more here:    0:00 Apple Watch Series 9 1:47 Double tap feature demo 2:40 Apple Watch Series 9 availability 3:02 Apple Watch Ultra 2 4:17 iPhone 15 hardware 5:26 iPhone 15 camera 6:49 iPhone 15 performance 09:09 iPhone + USB-C =  9:34 iPhone 15 availability 9:45 iPhone 15 Pro hardware 11:20 iPhone 15 Pro performance 13:53 iPhone 15 Pro camera 16:43 iPhone 15 Pro availability  Subscribe:  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://bit.ly/48fF6Ek",
        "http://goo.gl/G5RXGs",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "- Welcome to Apple Park. Let's get started with Apple Watch. - Apple Watch Series 9 has been redesigned on the inside, with the all-new S9 SIP. The Series 9 CPU has 5.6 billion transistors, 60% more than Series 8, and its GPU is 30% faster. S9 also has a new four-core Neural Engine that can process machine learning tasks up to twice as fast. This powerful custom silicon is what allows us to maintain all-day 18-hour battery life while adding new features and system-wide improvements to series 9. Thanks to the powerful new Neural Engine, Siri requests are now processed on-device, making them faster and more secure. Because the Neural Engine can run a more advanced transformer model, dictation on Series 9 is up to 25% more accurate than on Series 8. Secure on-device processing also enables a brand new feature: The ability to access your health data with Siri. Siri Health Queries will be available later this year in English and Mandarin, with more languages to follow. Series 9 has a new second-generation Ultra Wideband chip that enables precision finding for iPhones with the same chip. You'll see both the distance and direction to your iPhone, and once you get close, haptic and audible feedback guide you to its location, even if it's in a different room. Series 9 features a big edge-to-edge, always-on Retina display that's even easier to read outdoors because it now goes up to 2,000 nits, double the brightness of Series 8. The display is also better in very dark situations, like a movie theater or early morning wake-up, because it now goes down to just one nit. - Series 9 enables an incredible new gesture that uses just your watch hand. Introducing Double Tap. Just tap your index finger and thumb together twice. Double Tap controls the primary button in an app, so you can use it to stop a timer, play and pauses music, or snooze an alarm. A double tap will also launch the Smart Stack from your watch face. Double tap again to scroll through the widgets just like turning the Digital Crown. This new gesture is enabled by the powerful Neural Engine in Series 9, which processes data from the accelerometer, gyroscope, and optical heart sensor in a completely new way. It uses a machine learning algorithm to detect the unique signature of tiny movements and changes in blood flow when your hand and fingers perform a double tap. It will be available next month. Series 9 will be available in a gorgeous new pink aluminum case, plus starlight, silver, midnight, and Product Red. And stainless steel cases in gold, silver, and graphite. And that's the new Apple Watch Series 9. It's Apple's first-ever carbon-neutral product. Now, let's talk about Apple Watch Ultra. - Ultra 2 gets the powerful new Series 9 SIP. Ultra 2 also has a new advanced display architecture that pushes the brightness to a massive 3,000 nits. We created an exclusive new watch face called Modular Ultra. It's the first to use the outermost edge of the display to show real-time data, like altitude, depth, or the passing seconds. And now, night mode uses the ambient light sensor to activate automatically in the dark. - Ultra 2 still gets the same great battery life. Up to 36 hours of typical use on a single charge and up to 72 hours in low-power mode. And this year, the Trail Loop in Alpine Loop and the Ocean Band come in a range of beautiful new colors. And that's the new Apple Watch Ultra 2. Ultra 2 joins Series 9 in the lineup, along with the popular second-generation Apple Watch SE. The Apple Watch SE starts at just $249, the new Series 9 starts at $399, and Apple Watch Ultra 2 is $799. You can order the new Apple Watch model starting today, and they will be available on September 22nd. - iPhone 15 has an all-new design that's simply gorgeous. Starting from the front, it has the Dynamic Island, which has been a hit with our Pro users, and the Dynamic Island looks fantastic on the Super Retina XDR display which uses OLED technology, and now it's even brighter. Peak HDR brightness reaches 1,600 nits. When it's sunny, peak brightness can now go up to 2,000 nits, twice as bright as iPhone 14. It comes in two sizes: 6.1 inches for iPhone 15 and 6.7 inches for iPhone 15 Plus. Both sizes feel even nicer in your hand due to a new contoured edge on the aerospace-grade aluminum enclosure. For the first time ever in a smartphone, iPhone 15 has color embedded throughout a single piece of durable color-infused glass to create five stunning colors. iPhone 15 has Ceramic Shield, tougher than any smartphone glass, and water and dust resistance. iPhone 15 has an entirely new advanced camera system, so we are bringing an amazing 48-megapixel main camera to iPhone 15. It's built for shooting sharp photos and videos every day, with a quad-pixel sensor and 100% Focus Pixels for fast autofocus. - This year, we're introducing the next generation of portraits on iPhone, like this one. It's full of vivid color and detail, and it used as a rich depth map to create a beautiful bokeh effect. And it's easier to take a portrait because now you don't have to remember to switch to portrait mode. Using machine learning, we can detect when there's a person in the frame and capture rich depth information automatically, so you can turn it into a stunning portrait right away or later on in the Photos app. It even works with dogs and cats, so you can have more portraits in your pet's album in iOS 17 automatically. And with a rich depth map, we're introducing Focus and Depth Control. Now you can switch the focus from one subject to another after the photo's been taken. By combining advanced computational photography with the 48-megapixel domain camera, ultra-wide camera, and TrueDepth front camera, iPhone 15 makes it easy to take great-looking photos and videos every day. - iPhone 15 has an incredible chip: A16 Bionic. It was introduced on iPhone 14 Pro. The custom image signal processor enables the advanced camera system. The 16-core Neural Engine handles everything from computational photography to live voicemail transcriptions on-device in order to protect your privacy. The five-core GPU has 50% more memory bandwidth than A15 Bionic, so it's even better for graphics-intensive games. And the six-core CPU has two high-performance cores, which are faster and use 20% less power than A15 Bionic. The four high-efficiency cores can handle most daily tasks, so even with all the new features, iPhone 15 still has all-day battery life. And iPhone 15 Plus has a bigger battery that lasts even longer. - Ultra Wideband is getting even better this year because, just like Apple Watch, iPhone 15 has our cutting-edge second-generation Ultra Wideband chip. This chip also opens up a completely new way to use precision finding on iPhone 15 to find your friends. When you're in a crowded place like a train station or a farmer's market, and your friends share their location, you'll be guided right to them with clear directions and distance. And now audio quality on phone calls is getting better too because iPhone 15 uses a more advanced machine learning model that automatically prioritizes your voice. If you prefer to filter out even more distracting background noise, just select Voice Isolation, and you'll come through loud and clear. When you need help in an emergency, iPhone introduced a breakthrough new service, Emergency SOS via satellite. But say you have car trouble and no cellular or wifi service. For those times, we're introducing Roadside Assistance via Satellite. Just text Roadside Assistance and select what kind of help you need. Then the intuitive interface will guide you to connect to a satellite and share that information with a roadside assistance provider. It's launching in the US with AAA. Roadside service is covered by AAA membership and is also available separately for non-members. - Now, let's talk about iPhone's wired capabilities. USB-C has become a universally accepted standard, so we are bringing USB-C to iPhone 15. Now the same cable can charge Mac, iPad, iPhone, and even AirPods Pro second-generation, which is updated with a USB-C connector. If your AirPods are low on power, you can charge them or even an Apple Watch right from your iPhone. So that's iPhone 15. They still start at just $799 for iPhone 15 and $899 for iPhone 15 Plus with carrier activation. - iPhone 15 Pro is packed with industry-first innovations and features our users are going to love. Powered by our most advanced Apple silicon yet, it delivers the most incredible photos and videos. And we are thrilled to introduce our astonishing new titanium design. This is the most premium material we've ever used in an iPhone enclosure. Yet, at the same time, it is much lighter, making these our lightest Pro models ever. And we're also introducing the thinnest borders ever on an iPhone. iPhone 15 Pro has the toughest glass-based materials in the industry, including the Ceramic Shield front, which is only available on iPhone. And there are two great display sizes to choose from: 6.1 inches for iPhone 15 Pro and 6.7 inches for iPhone 15 Pro Max. From the very first iPhone, we've had the ring/silent switch. We wanted to make this even better. So, with iPhone 15 Pro, we are reinventing the experience with a customizable Action button. By default, it's still a simple ring/silent switch. To toggle between ring and silent, you simply press and hold the button to confirm your intent. You also feel a distinctive haptic feedback for each state. And you can choose from a set of actions and easily switch between them, or you can use shortcuts to open up an even wider set of options, from simply launching your favorite app to running your own custom shortcuts. We are excited to introduce next-level performance and more pro capabilities than ever with the A17 Pro. - And this is the industry's first three-nanometer chip. These three-nanometer transistors are patterned using state-of-the-art extreme ultraviolet lithography. Elements of these transistors are just over 12 silicon atoms wide. A17 Pro features 19 billion of these transistors. The new CPU features micro architectural and design improvements for both our performance cores and efficiency cores. Our performance cores are now up to 10% faster, continuing to deliver the fastest single-threaded performance in any smartphone. Our efficiency cores are also faster and remain unmatched in the industry, delivering three times the performance per watt of the competition. The Neural Engine is now up to twice as fast for machine learning models, allowing it to process up to 35 trillion operations per second. A17 Pro has dedicated engines that enable pro features. Those include the ProRes codec and a display engine that powers ProMotion and the always-on display. We also included a dedicated AV1 decoder, enabling more efficient and high-quality video experiences for streaming services. iPhone 15 Pro also has the new USB-C connector, but for our Pro models, we included a new USB controller in A17 Pro that enables new workflows not possible before. This is the first iPhone with USB 3 speeds, up to 10 gigabits per second. The groundbreaking innovation of A17 Pro is a brand-new GPU with a new Apple-designed shader architecture. This is a pro-class GPU. The new GPU is now a six-core design, which is up to 20% faster for peak performance. We've added brand new features to the GPU, like mesh shading, which lets games create detailed environments while drawing less power. And for the first time, we have hardware-accelerated ray tracing. Gaming is further improved with new software features, including MetalFX upscaling, which combines the performance of the GPU and Neural Engine to enable high-quality graphics while using much less power. - iPhone 15 Pro features a more advanced 48-megapixel main camera with an even larger sensor than iPhone 15. The camera includes a new nanoscale coating to reduce lens flare, brings high resolution to everyday photos, enables more focal lengths, and has better low-light performance for portraits and night mode. Users can now shoot in 48-megapixel HEIF, with four times more resolution than before. Since the new Photonic Engine now uses a 48-megapixel image, iPhone can shoot higher resolution photos in 24, 28, and 35-millimeter focal length. A very important range for pro photographers. They can now quickly switch between these new options and even choose a new default lens, customizing their camera experience to their creative needs. iPhone 15 Pro features a great 3x telephoto camera at 77-millimeter focal length. For iPhone 15 Pro Max, we're using the extra size of the larger iPhone to introduce something unique: 4x optical zoom at 120-millimeter focal length. We designed a state-of-the-art telephoto camera. Compared to iPhone 14 Pro Max, it has a 25% larger sensor, 100% Focus Pixels, and an f/2.8 aperture, the largest of any smartphone at this optical range. The light rays are reflected four times through the glass structure, allowing the light to travel for longer in a much smaller design. And we have our most advanced stabilization yet: A combined OIS and auto-focus 3D sensor shift module that moves in all three directions. The ultra-wide camera is also improved with a new anti-reflective coating, better night mode, and the latest Smart HDR, in addition to enabling one of our users' favorite features on the Pro models, macro photography. - And now you can use your iPhone with Capture One to shoot and instantly transfer 48 Megapixel ProRAW directly to a Mac. iPhone 15 Pro also supports recording ProRes video directly to an external storage drive. Recording to an external drive enables even higher-quality recording options, pushing ProRes 4K up to 60 frames per second for the first time. We are also introducing log encoding to make ProRes even more powerful for our pro users. And there's one more unique feature we've created just for the world of spatial computing. With iPhone 15 Pro, you can now capture spatial videos. We use the ultra-wide and main cameras together to create a three-dimensional video. You can then relive these memories in a magical way on Apple Vision Pro. So this is the iPhone 15 Pro, our best and most pro iPhone ever. The iPhone 15 Pro will start at the same price as last year, $999. And iPhone 15 Pro Max, featuring the new 5x telephoto camera, will start at $1,199 with 256 gigabytes of storage. All new iPhone models will be available for pre-order this Friday, September 15th. And they'll be available in stores next week, on September 22nd. This is, by far, our best iPhone lineup ever. - Thank you for joining us. Have a great day. (electronic pop music) But I can see the magic in you I can see the magic in you",
    "transcript_keywords": [
        "Apple Watch",
        "Apple Watch Ultra",
        "Apple Watch Series",
        "iPhone",
        "Pro",
        "Neural Engine",
        "Series",
        "Apple",
        "Apple Park",
        "Watch",
        "Pro Max",
        "Pro features",
        "Watch Ultra",
        "Watch Series",
        "Apple Vision Pro",
        "Ultra",
        "Apple Watch model",
        "Engine",
        "Pro models",
        "camera"
    ],
    "transcript_entity_values": [
        "18-hour",
        "6.7 inches",
        "120-millimeter",
        "35-millimeter",
        "up to 20%",
        "three",
        "iPhones",
        "ProRes 4K",
        "ProMotion",
        "30%",
        "SOS",
        "5x",
        "Series",
        "CPU",
        "Up to 36 hours",
        "the A17 Pro.",
        "just $249",
        "S9",
        "50%",
        "English",
        "September 22nd",
        "This year",
        "Apple Watch SE",
        "Focus and Depth Control",
        "Bionic",
        "TrueDepth",
        "the Dynamic Island",
        "just $799",
        "Ultra 2",
        "the Neural Engine",
        "Series 9",
        "799",
        "3x",
        "Dynamic Island",
        "6.1 inches",
        "20%",
        "GPU",
        "4x",
        "60%",
        "USB",
        "the Smart Stack",
        "399",
        "Ceramic Shield",
        "19 billion",
        "Roadside Assistance",
        "iPad",
        "Neural Engine",
        "AAA",
        "25%",
        "Mandarin",
        "Action",
        "Photonic Engine",
        "AirPods Pro",
        "Modular Ultra",
        "this year",
        "3,000",
        "Siri",
        "first",
        "Apple Watch Ultra. - Ultra 2",
        "up to 72 hours",
        "iPhone 15",
        "Apple Watch Ultra 2",
        "A17 Pro",
        "28",
        "last year",
        "48-megapixel",
        "256 gigabytes",
        "the Digital Crown",
        "midnight",
        "Ceramic Shield",
        "Capture One",
        "Focus Pixels",
        "Voice Isolation",
        "Pro Max",
        "US",
        "8",
        "77-millimeter",
        "The Neural Engine",
        "Apple Vision Pro",
        "Roadside Assistance via Satellite",
        "100%",
        "1,199",
        "next month",
        "iPhone 15 Plus",
        "1,600",
        "USB-C",
        "second",
        "later this year",
        "five",
        "A17 Pro",
        "the passing seconds",
        "up to 10 gigabits",
        "up to 2,000",
        "The Apple Watch SE",
        "one",
        "Mac",
        "Apple",
        "four",
        "A16 Bionic",
        "999",
        "iOS 17",
        "today",
        "48",
        "Megapixel ProRAW",
        "six",
        "60",
        "iPhone 15 Plus",
        "three-nanometer",
        "35 trillion",
        "just over 12",
        "15",
        "Siri",
        "two",
        "5.6 billion",
        "899",
        "Apple Park",
        "24",
        "Apple Watch",
        "9",
        "ProRes",
        "next week",
        "up to 10%",
        "S9",
        "iPhone",
        "the Trail Loop",
        "this Friday, September 15th",
        "Series 9",
        "16",
        "up to 25%",
        "Product Red",
        "early morning"
    ],
    "transcript_entity_types": [
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "EVENT",
        "ORG",
        "TIME",
        "ORG",
        "MONEY",
        "ORG",
        "PERCENT",
        "LANGUAGE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "LOC",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "LOC",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "LANGUAGE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "TIME",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "MONEY",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "MONEY",
        "EVENT",
        "DATE",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "FAC",
        "DATE",
        "LAW",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "TIME"
    ],
    "vector": [
        -0.07452132552862167,
        -0.04837311431765556,
        0.07321755588054657,
        -0.07953346520662308,
        0.10128817707300186,
        0.018627915531396866,
        -0.048958346247673035,
        0.033951036632061005,
        0.036105718463659286,
        -0.007674856577068567,
        0.03975443169474602,
        -0.02538491226732731,
        -0.06702554225921631,
        0.053023386746644974,
        -0.019376937299966812,
        -0.03654225543141365,
        0.1674930304288864,
        -0.10285692662000656,
        -0.012467462569475174,
        -0.037304628640413284,
        -0.015401594340801239,
        -0.07781578600406647,
        0.0777510479092598,
        0.03179171308875084,
        0.0050117988139390945,
        0.03583459556102753,
        -0.08876664191484451,
        -0.08913352340459824,
        -0.04748043045401573,
        -0.031316183507442474,
        -0.009468176402151585,
        0.04078393056988716,
        0.026509813964366913,
        0.022872135043144226,
        -0.020054463297128677,
        -0.11095976829528809,
        0.00880090706050396,
        -0.02120201475918293,
        -0.02059980295598507,
        -0.04229842126369476,
        -0.01891949214041233,
        -0.024713221937417984,
        0.001356117776595056,
        0.07140258699655533,
        0.04558059945702553,
        -0.004146374296396971,
        0.01877071149647236,
        -0.027476422488689423,
        0.0049020773731172085,
        -0.009350469335913658,
        -0.008374892175197601,
        -0.006988456938415766,
        0.06691941618919373,
        0.033328767865896225,
        0.0057344757951796055,
        -0.011699204333126545,
        -0.04842711240053177,
        0.006937038153409958,
        0.13036128878593445,
        -0.029334217309951782,
        0.06184203177690506,
        -0.034512996673583984,
        -0.056384868919849396,
        0.015372075140476227,
        -0.0327494777739048,
        0.01250059250742197,
        -0.05074413865804672,
        0.0652230829000473,
        0.05429888516664505,
        -0.003996876068413258,
        -0.03218168765306473,
        0.03650324046611786,
        0.026510002091526985,
        -0.030344393104314804,
        0.058269698172807693,
        0.051993247121572495,
        0.0584978386759758,
        -0.04303703084588051,
        -0.06295952200889587,
        -0.06746263802051544,
        -0.0006195713649503887,
        -0.05177624523639679,
        0.011494219303131104,
        -0.021628186106681824,
        0.07516653835773468,
        -0.027488283812999725,
        0.007526550441980362,
        0.037546224892139435,
        -0.063337542116642,
        -0.06206712871789932,
        -0.06362553685903549,
        0.109673872590065,
        -0.045438505709171295,
        -0.030164053663611412,
        0.03296279534697533,
        0.04879307746887207,
        -0.05167997628450394,
        -0.08592543005943298,
        -0.047549597918987274,
        0.007471851538866758,
        0.08188298344612122,
        0.006439893040806055,
        0.00496653700247407,
        0.011892528273165226,
        0.004433806985616684,
        -0.1028985008597374,
        -0.025352340191602707,
        -0.003306030761450529,
        0.042768511921167374,
        0.12128493189811707,
        0.05300005525350571,
        0.04775024950504303,
        -0.05237363278865814,
        -0.06782597303390503,
        0.005668867379426956,
        0.06660454720258713,
        -0.02263331413269043,
        0.08017043024301529,
        0.11453724652528763,
        0.03383554518222809,
        0.040621861815452576,
        0.020556125789880753,
        -0.06251968443393707,
        -0.07238668948411942,
        -0.0004377469012979418,
        0.018397849053144455,
        1.856175367720425e-05,
        7.638320414656976e-33,
        0.009621392004191875,
        0.04376307874917984,
        -0.07136368751525879,
        -0.029134660959243774,
        0.021962493658065796,
        -0.03704153746366501,
        0.026252470910549164,
        0.06659472733736038,
        0.011628178879618645,
        0.003579541342332959,
        -0.04142816737294197,
        -0.05309537425637245,
        -0.04769006371498108,
        0.025849251076579094,
        0.018499070778489113,
        -0.09784616529941559,
        -0.04091428965330124,
        -0.04546348378062248,
        -0.0477890744805336,
        -0.020475683733820915,
        -0.029190964996814728,
        -0.02681870199739933,
        -0.06064164638519287,
        -0.04732382297515869,
        0.04290922358632088,
        0.03362937644124031,
        0.03651384636759758,
        0.022373342886567116,
        0.10913953185081482,
        0.02189268171787262,
        -0.08906377106904984,
        0.0150832524523139,
        0.0033609201200306416,
        -0.054077621549367905,
        0.015926675871014595,
        0.005393783561885357,
        0.04917224869132042,
        -0.06931278854608536,
        0.05683743953704834,
        -0.03606293722987175,
        -0.03954797610640526,
        -0.014043129049241543,
        -0.09235022217035294,
        -0.0742601752281189,
        0.034048017114400864,
        0.041719745844602585,
        -0.006690137553960085,
        0.03365153446793556,
        0.0025692759081721306,
        -0.012441731058061123,
        -0.008207804523408413,
        -0.023973889648914337,
        -0.05582411214709282,
        -0.08785351365804672,
        -0.037429891526699066,
        0.03100563958287239,
        0.028514256700873375,
        -0.040286362171173096,
        -0.0015822876011952758,
        0.06300071626901627,
        0.02934037148952484,
        0.004520529415458441,
        -0.010658602230250835,
        0.034549884498119354,
        -0.1078827902674675,
        0.037265609949827194,
        0.012390804477036,
        0.01062725018709898,
        -0.021118607372045517,
        0.1326945275068283,
        -0.06974030286073685,
        0.019278863444924355,
        0.06528632342815399,
        -0.06606777012348175,
        0.02798810787498951,
        0.06601428985595703,
        -0.01465657353401184,
        -0.02032634988427162,
        -0.03727208077907562,
        0.05728079378604889,
        -0.08731524646282196,
        0.00635672640055418,
        0.06266937404870987,
        0.005899203009903431,
        0.040985312312841415,
        -0.054534636437892914,
        -0.041264522820711136,
        -0.03914155438542366,
        0.013231184333562851,
        0.03192263841629028,
        -0.007820498198270798,
        0.003980895038694143,
        0.024782391265034676,
        0.03740868717432022,
        -0.07539808005094528,
        -8.97213989553961e-33,
        -0.00877341441810131,
        -0.023024417459964752,
        -0.011878847144544125,
        -0.029772069305181503,
        0.020790575072169304,
        -0.10482075810432434,
        -0.02211640030145645,
        0.05294158309698105,
        0.026947027072310448,
        -0.006781380157917738,
        0.020966151729226112,
        -0.06077529489994049,
        -0.04819994047284126,
        0.05578446388244629,
        -0.0357634499669075,
        -0.002203328302130103,
        -0.014457913115620613,
        -0.05145597085356712,
        0.007075880188494921,
        0.07002857327461243,
        0.08772177994251251,
        -0.01329032052308321,
        -0.009685021825134754,
        -0.013772357255220413,
        0.04059278219938278,
        0.02778274193406105,
        0.09314726293087006,
        0.0735795795917511,
        0.03466655686497688,
        -0.1123443990945816,
        -0.04828469455242157,
        -0.09352781623601913,
        -0.014319829642772675,
        0.05184170603752136,
        0.05803094804286957,
        0.08991313725709915,
        0.02990579418838024,
        -0.03272164985537529,
        -0.019563106819987297,
        -0.07779929041862488,
        0.08103092759847641,
        0.034448154270648956,
        0.03199225664138794,
        0.025254180654883385,
        -0.02571059577167034,
        0.02907387726008892,
        -0.07195805758237839,
        0.06255220621824265,
        -0.05845332145690918,
        -0.018313279375433922,
        -0.006278162356466055,
        -0.03187977522611618,
        -0.02504907362163067,
        0.041571568697690964,
        -0.09062910079956055,
        0.003111132886260748,
        0.02696962095797062,
        0.007562695071101189,
        0.028616193681955338,
        2.695007060538046e-05,
        0.04956233501434326,
        -0.00581784313544631,
        -0.06510727852582932,
        -0.05059760436415672,
        -0.0013812901452183723,
        -0.014135605655610561,
        0.022211087867617607,
        -0.06386091560125351,
        -0.017665142193436623,
        0.045777108520269394,
        -0.0657460018992424,
        -0.014480690471827984,
        -0.054365936666727066,
        -0.08323336392641068,
        -0.02917042188346386,
        0.04600246623158455,
        0.019521484151482582,
        -0.019720377400517464,
        -0.04043081775307655,
        -0.04493436962366104,
        0.0033393963240087032,
        0.09052298963069916,
        0.06283023208379745,
        -0.046155329793691635,
        0.09123051166534424,
        0.11715976148843765,
        0.02454843372106552,
        0.060983337461948395,
        0.0492701418697834,
        0.07130230963230133,
        -0.03377092257142067,
        0.032458823174238205,
        -0.059858862310647964,
        0.09507453441619873,
        -0.01793784648180008,
        -5.772182376517776e-08,
        -0.012617272324860096,
        0.04357025399804115,
        -0.015268942341208458,
        -0.07437758892774582,
        0.006982999853789806,
        -0.06707378476858139,
        -0.004197221249341965,
        -0.006914053577929735,
        0.07635894417762756,
        0.007438001222908497,
        0.0229631494730711,
        -0.08647118508815765,
        -0.09652227908372879,
        0.0231383815407753,
        0.08391478657722473,
        -0.0059976158663630486,
        -0.04327456280589104,
        -0.014975870959460735,
        -0.0009469338110648096,
        -0.053629521280527115,
        -0.006403218489140272,
        0.020674115046858788,
        0.05722199007868767,
        -0.062749482691288,
        0.02330314926803112,
        0.024991346523165703,
        -0.04273407533764839,
        -0.004416139796376228,
        0.04811619222164154,
        -0.05723835155367851,
        0.0049352641217410564,
        0.03626781329512596,
        -0.0206516794860363,
        -0.06558693200349808,
        -0.032671909779310226,
        -0.03183402866125107,
        -0.010758661665022373,
        -0.021076152101159096,
        0.10813961923122406,
        0.04417966678738594,
        0.020323291420936584,
        -0.09571446478366852,
        -0.009080578573048115,
        0.017154835164546967,
        -0.01644500531256199,
        -0.10872261226177216,
        -0.010072910226881504,
        -0.09723030775785446,
        0.047781988978385925,
        0.01590774580836296,
        -0.04950982704758644,
        -0.12465221434831619,
        0.06432849913835526,
        -0.04858233407139778,
        0.0989052951335907,
        -0.001185802510008216,
        0.014827394858002663,
        -0.04307771101593971,
        -0.06082608178257942,
        0.016264893114566803,
        0.11233244836330414,
        -0.04667652025818825,
        -0.04555327445268631,
        0.07746776193380356
    ]
}