{
    "id": "-jwS1EKKY6k",
    "title": "The Perfect Minimal TV Setup MAKEOVER! (2021)",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2021-05-12T18:01:11Z",
    "video_url": "https://www.youtube.com/watch?v=-jwS1EKKY6k",
    "category": "Science & Technology",
    "tags": [
        "office tour",
        "office tour 2021",
        "sony a90J",
        "Best TV",
        "Best OLED TV",
        "work office tour",
        "office redesign",
        "design",
        "office ideas",
        "work office ideas",
        "setup ideas",
        "minimal setup",
        "tld",
        "Jonathan Morrison",
        "sony"
    ],
    "views": 298838,
    "likes": 2420,
    "comments_count": 165,
    "description": "Got some big changes and a fresh 2021 office/workspace makeover as we re-build from scratch. Part 1 includes a minimal floating TV setup which features Sony's incredible A90J OLED TV.    starting over (if you missed it):",
    "description_links": [
        "https://www.sony.com/electronics/televisions/a90j-series?utm_campaign=a90j_jonm",
        "https://youtu.be/OOT2membFB4"
    ],
    "transcript": "- Yo! So this is something that I've wanted to do like forever, a simple, super-clean, minimal, cable-less floating wall mounted TV. And if you cut the most recent update video, for being amazing, this probably makes a ton of sense. If not, I will drop a link to that video down below but the cliff notes version of that is we essentially went full blown Houston rockets on this place, blew it up, started over. And while this is no longer my main workspace, this is the first project that I wanted to tackle with that blank canvas and huge thank you to Sony for teaming up with me supporting the channel, and sponsoring part one of the new new. (upbeat music) Now there's really not a ton of complexity to the setup, again, simplicity was the goal. There's a media console, inside there is a PS-5 nestled away, above that is a soundbar, which is paired with the wireless sub. And then of course, the TV. The media console is the Align 7477 from BDI. They make incredible stuff and this is doing a few different things. It is of course, locking down the aesthetic and compliments that floating TV look, but as beautiful as it is, it's also extremely functional. There's so much room for activities, whether you wanted to house a receiver for audio, or in our case that kind of dual functions, one again to house that PS-5, but two, to store some video and film gear which is amazing because one, it alleviates the need to have an external unit somewhere else and free space up there, and two, make sure stuff is not left out in the open on a table. The soundbar is the Sony HTST 5,000, and anything sounds immediately cooler once you slap 5,000 to the end of it, naming aside though, it's an incredible soundbar. And I knew I wanted to compliment Dolby Vision with something that was Dolby atmost equipped, and this checks that box. Dialogue is crisp, it gets plenty loud. I am sorry, but not sorry, neighbor. If you watch \"The Office\", you know what I'm talking about, but what ices is the cake here is it being paired with the wireless sub because moving it back and placing it here definitely makes that sound experience more immersive. Now, without a doubt, the star of this set, the part that's gonna make you go \"What is that?\" is part of Sony's master series. It's their brand new 65 inch 890J. Now this is not a review by any means. If you're looking for one, I'll drop a link to a couple from those who are way more qualified than me. I will not be whipping out anything to measure nits or peak brightness, but the general consensus on this TV is that it's incredible. And spoiler alert, I would have to agree. I think what definitely ties everything together here is the cables running through the wall and under. You could absolutely run that cable down or keep it neat with conduit. But if you have the means to fish it through the wall and underneath the console, that makes things that much cleaner and gives off that floating no cables anywhere effect. So this is kind of the vibe of the setup, instead of trying to shove or cram a home theater type spot into that backspace, which is what we did for years, this does a couple of different things. One, by itself, it's a great workplace just to get work done, but it also doubles as a great viewing experience as well. If you make video and your goal is to create the highest quality video you can, it's always nice to have a high quality source to watch that back before you unleash it to the internet, and this does exactly that. For me as someone who's jumped deeper and deeper into HDR and to Dolby Vision the more and more I've grown to appreciate it. And when you pair really high quality HDR with a high quality Oled panel, it is game over. So once you experienced true Dolby Vision or really good HDR on an Oled display, it's kinda hard to go back and don't get me wrong, this is a fantastic 4K Oled display, but I think what sets it apart from other Oled panels for example, is the processing inside, because as we've said before, when one piece of technology works in tandem with another, it is a beautiful thing. The techie name is what Sony is calling Cognitive Processor XR, and to simplify that, the processor, or the brains inside the TV is using AI to enhance the image more like our eyeballs see things in real life. Like for real, you ever sit there and look at life, and you're like, man, that looks amazing. I wish my camera could shoot video like my eyeballs see life, how quickly things focus it's like instantaneous, the dynamic rings. There's no noise. So it makes sense for somebody to try to bring that through our screens. So for example, it's gonna take a scene, analyze it in real time, and then much like our eyes, decipher what is the focal point? What do we want to be looking at? And then subtly enhance that. All that processing then starts to trickle into various things like color, how natural does it look? But then also things like contrast and peak brightness. And I realize contrast and peak brighteners are two terms that probably aren't going to excite most people. Like if I called my mom and I was like, \"Yo, you got to check out the contrast on this TV, the peak brightness is insane!\" She's going to be like, \"What are you talking about?\" I think once you start to simplify things though everything just makes a whole lot more sense. Like if you look at HDR like life then it makes it really easy. There are peaks, there are valleys, there are highs, there are low much like in music. If everything was just at a constant, then it wouldn't be as enjoyable. And that's what makes HDR so special. So when you hear contrast, that just means deep blacks. So those black parts of whatever you're watching, they're so dark. It's almost like your TV is turned off just for those sections because those pixels aren't lighting up. But then you get the peak brightness which is all of the little like sprinkles on top. Now this TV is incredibly bright, but I think when a lot of people hear brightness or HDR sometimes natural reaction is, well, what if I don't need a TV that bright? Why do I need all those nits? And you gotta remember it's about those peaks and valleys. So it's not like the entire image is blasting a thousand nits at your face, you're getting those lows and those highs. So a term you may hear throughout TV reviews or film or video is specular highlights. And really what that means is those starry sparkly elements, those little kind of sprinkles on top again that just really enhance those low lows, those Oled blacks. Somehow we've ended up on sprinkles, drop a like if you're hungry, but that is the beauty of HDR of Dolby Vision, the low lows the high highs paired together, it is a beautiful thing. When you have a great Oled panel, that makes it even better. And then when you pair a great processing on top of a great panel, it is a completely different level. Now as incredible as the image is, nothing will ruin that faster than crappy sound. And as happy as I am with the soundbar set up, I was kind of surprised with how good the internal speakers were. That's kind of a trend I've seen with Sony speakers is really good built in audio and you would never guess it looking at this, but the entire TV essentially is the speaker. There are two woofers packed right underneath that panel. So if you wanted to go super minimal, no soundbar you absolutely could if you wanted to. So it's nice knowing that, or potentially if you wanted to build this out over time, it's also super reassuring knowing that you can buy the TV, wait a little bit, upgrade the audio later, but still get really great audio and sound in the meantime. At the core of this is powered through Google TV which is kind of your central hub to keep everything clean, their support for Disney Plus, Netflix, YouTube, Apple TV, there's airplay support. So really everything you could possibly want out of this TV is there. If you want to really level things up and get the most quality out of this TV, Sony has their own streaming service called Bravia Core where you get access to new movies, old movies, but you get to stream them at a super high bit rate. And they even have an IMAX section. We haven't been to movie theaters in like a year, so the fact that you can get access to that and essentially build your own mini IMAX setup at home is amazing. So there are definitely more and more great TVs out there, more and more great Oled options, but if you want kind of the best of the best, if you want to build your own home setup, this is kind of the cream of the crop right now. So details on everything you need to know, everything you wanna check out is down below. Thank you guys so much for watching. This is Jonathan and I will catch you guys later. (upbeat music)",
    "transcript_keywords": [
        "Dolby Vision",
        "Oled",
        "HDR",
        "things",
        "makes",
        "kind",
        "Sony",
        "wanted",
        "great",
        "Dolby",
        "video",
        "great Oled",
        "peak brightness",
        "Vision",
        "Oled panel",
        "make",
        "high",
        "high quality Oled",
        "high quality HDR",
        "peak"
    ],
    "transcript_entity_values": [
        "two",
        "thousand",
        "Disney Plus",
        "Cognitive Processor XR",
        "One",
        "BDI",
        "Google TV",
        "Bravia Core",
        "4",
        "IMAX",
        "YouTube",
        "Netflix",
        "a ton",
        "Apple TV",
        "65 inch 890J.",
        "years",
        "first",
        "Dolby Vision",
        "one",
        "Oled",
        "Sony",
        "Houston",
        "5,000",
        "Dolby",
        "Yo",
        "Jonathan",
        "AI"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.03977694734930992,
        -0.03237435966730118,
        0.07021095603704453,
        -0.06819333881139755,
        0.07573888450860977,
        0.013879336416721344,
        -0.08283647149801254,
        0.05038377270102501,
        -0.05980328842997551,
        0.024373693391680717,
        -0.013582355342805386,
        0.03256708383560181,
        0.028733164072036743,
        0.011408296413719654,
        -0.01354245562106371,
        -0.05187220871448517,
        0.046578217297792435,
        -0.08536266535520554,
        -0.026614118367433548,
        0.00872980896383524,
        -0.005974168889224529,
        -0.08391354233026505,
        -0.05159447342157364,
        -0.0633934959769249,
        0.0451861210167408,
        0.07139784097671509,
        -0.00390470284037292,
        0.025054065510630608,
        0.003844739869236946,
        -0.07831986993551254,
        0.01204243116080761,
        0.029079321771860123,
        0.031455013900995255,
        -0.009509045630693436,
        0.002265818417072296,
        -0.020444199442863464,
        0.04057491570711136,
        -0.03373388573527336,
        -0.08844652771949768,
        -0.010711470618844032,
        -0.007782257627695799,
        -0.04931673780083656,
        -0.0015822359127923846,
        0.042193371802568436,
        -0.03180829808115959,
        -0.07675514370203018,
        -0.016830403357744217,
        -0.12071943283081055,
        -0.011445047333836555,
        -0.030493713915348053,
        -0.04628001153469086,
        0.0022367730271071196,
        0.01358851883560419,
        -0.015230928547680378,
        -0.024845173582434654,
        -0.0059374007396399975,
        0.026081714779138565,
        0.05331376567482948,
        0.024415917694568634,
        -0.05798156186938286,
        0.11928273737430573,
        -0.04467989131808281,
        0.008065986447036266,
        0.03770102560520172,
        0.018020788207650185,
        -0.03236290067434311,
        0.035529401153326035,
        0.027565166354179382,
        0.009207700379192829,
        -0.029698224738240242,
        -0.09666316956281662,
        0.0450654961168766,
        0.020353371277451515,
        0.0030881843995302916,
        0.052642080932855606,
        -0.02579285390675068,
        0.04515235871076584,
        -0.061531003564596176,
        0.0019721705466508865,
        0.05876709893345833,
        0.06568022817373276,
        -0.0381372794508934,
        -0.18108826875686646,
        -0.00042761783697642386,
        -0.06627797335386276,
        -0.01012671273201704,
        0.002582703484222293,
        -0.014816533774137497,
        0.016940848901867867,
        -0.027979472652077675,
        -0.07606465369462967,
        0.011728947050869465,
        0.015047602355480194,
        0.045421116054058075,
        -0.03164025768637657,
        -0.006361701060086489,
        -0.09749842435121536,
        -0.08626273274421692,
        -0.032557617872953415,
        0.07899729162454605,
        -0.006977288983762264,
        -0.014882712624967098,
        0.07975541800260544,
        -0.021816711872816086,
        -0.015592735260725021,
        -0.10757684707641602,
        -0.019693808630108833,
        0.08669217675924301,
        -0.02770981937646866,
        -0.04432639107108116,
        -0.052666570991277695,
        0.0006722503458149731,
        -0.0750049501657486,
        -0.015194644220173359,
        0.0033180266618728638,
        0.07064651697874069,
        0.01682954467833042,
        0.014838101342320442,
        0.08992838859558105,
        -0.08120139688253403,
        0.1013496145606041,
        -0.025783518329262733,
        0.005129653494805098,
        0.04177813604474068,
        0.024019284173846245,
        -0.008104491978883743,
        -0.024858146905899048,
        1.4606109647917141e-33,
        0.01026932243257761,
        0.06107088178396225,
        -0.022655285894870758,
        0.06023089960217476,
        0.07354052364826202,
        0.023868532851338387,
        0.026247086003422737,
        0.11799342930316925,
        -0.009759522043168545,
        0.027721649035811424,
        0.06844790279865265,
        0.026190387085080147,
        -0.02689371071755886,
        0.005901504307985306,
        0.038418643176555634,
        -0.1513935625553131,
        -0.026662979274988174,
        -0.01933695189654827,
        -0.05307624861598015,
        0.02501174621284008,
        -0.05299884453415871,
        0.048874661326408386,
        0.013370726257562637,
        -0.08018600940704346,
        0.030140172690153122,
        0.012737453915178776,
        -0.00035239098360762,
        -0.031120307743549347,
        -0.004088426474481821,
        0.017072653397917747,
        -0.09730540215969086,
        0.004665807820856571,
        0.00027669238625094295,
        0.017576688900589943,
        -0.009850163012742996,
        -0.055629439651966095,
        -0.0870305746793747,
        -0.06799274682998657,
        -0.004938118625432253,
        0.009323806501924992,
        -0.026642005890607834,
        0.05217975750565529,
        -0.07399638742208481,
        0.006011801306158304,
        0.009450853802263737,
        0.03829815611243248,
        0.06143273413181305,
        0.05704157426953316,
        -0.047695524990558624,
        0.0431453175842762,
        0.04324333369731903,
        0.06851884722709656,
        -0.07325219362974167,
        -0.02700275368988514,
        0.025066155940294266,
        -0.05858682841062546,
        -0.0041226595640182495,
        -0.041477371007204056,
        0.10646574199199677,
        0.011732238344848156,
        0.07547798752784729,
        0.05383441224694252,
        -0.030262349173426628,
        0.024965524673461914,
        -0.07719848304986954,
        0.03291220963001251,
        0.1085091084241867,
        0.03302479535341263,
        0.026615668088197708,
        -0.03499540686607361,
        -0.05253320932388306,
        0.00047030928544700146,
        0.005929704289883375,
        -0.06972174346446991,
        0.03511610999703407,
        0.028670331463217735,
        -0.044286731630563736,
        0.006656165700405836,
        -0.00651037460193038,
        -0.03122725337743759,
        0.037951234728097916,
        0.05447683110833168,
        0.042085547000169754,
        0.0397239588201046,
        -0.005834096577018499,
        0.058401476591825485,
        0.037775199860334396,
        -0.06983339041471481,
        -0.10199999809265137,
        -0.026839502155780792,
        -0.058862216770648956,
        -0.027760742232203484,
        0.0530705563724041,
        0.01876477338373661,
        0.0514729879796505,
        -2.3468298393655642e-33,
        0.09470467269420624,
        -0.04984940588474274,
        -0.037699777632951736,
        -0.06784180551767349,
        0.028471646830439568,
        -0.045482147485017776,
        0.00627767201513052,
        -0.045038748532533646,
        -0.016734372824430466,
        -0.007885309867560863,
        -0.009862853214144707,
        -0.035399775952100754,
        -0.042221371084451675,
        -0.021279102191329002,
        -0.04504883289337158,
        -0.023172924295067787,
        0.04747975617647171,
        -0.05567765608429909,
        0.005344798322767019,
        0.05476920306682587,
        0.13562063872814178,
        0.0695057064294815,
        -0.03430512174963951,
        0.05977810546755791,
        0.035619281232357025,
        0.044237054884433746,
        0.06843645125627518,
        0.07486428320407867,
        -0.012954507023096085,
        0.04735241085290909,
        -0.06797033548355103,
        -0.046993743628263474,
        -0.004320177715271711,
        -0.06811941415071487,
        -0.0021196308080106974,
        0.10765765607357025,
        0.057389453053474426,
        0.02432687021791935,
        -0.09616751223802567,
        -0.10359355807304382,
        0.01808212138712406,
        0.020626699551939964,
        -0.03169155865907669,
        0.03951284661889076,
        -0.007214569952338934,
        0.0093734385445714,
        0.0005781756481155753,
        0.007311504799872637,
        -0.04558704420924187,
        -0.04988846927881241,
        0.007131242658942938,
        0.0001594671921338886,
        -0.04401106759905815,
        -0.037808775901794434,
        0.004351743962615728,
        -0.021335795521736145,
        0.006223419215530157,
        0.09885004907846451,
        0.03718140721321106,
        -0.02278689481317997,
        0.015600192360579967,
        -0.059504810720682144,
        -0.0648355707526207,
        -0.0642796978354454,
        0.007739291060715914,
        0.04809414967894554,
        0.13424280285835266,
        0.015101323835551739,
        -0.05198861286044121,
        0.033806610852479935,
        -0.037327613681554794,
        -0.0074935853481292725,
        0.016565581783652306,
        -0.01635541021823883,
        0.0498252734541893,
        0.06695574522018433,
        0.02962857484817505,
        -0.00829209666699171,
        0.021469436585903168,
        0.026154138147830963,
        -0.09550141543149948,
        -0.024883845821022987,
        0.01864926517009735,
        -0.007104977034032345,
        0.14207570254802704,
        0.010995770804584026,
        -0.016263185068964958,
        0.00806525256484747,
        -0.0042877160012722015,
        0.09700258821249008,
        -0.05382866784930229,
        0.05544114485383034,
        -0.02980312705039978,
        0.07430870085954666,
        0.07945465296506882,
        -5.75409089265122e-08,
        0.03119291365146637,
        -0.013548479415476322,
        -0.07916002720594406,
        -0.013782869093120098,
        -0.00024310883600264788,
        -0.10408689081668854,
        0.04875754565000534,
        -0.052220385521650314,
        0.1041736900806427,
        -0.08498197048902512,
        -0.002877010265365243,
        -0.008157939650118351,
        0.021301284432411194,
        0.12870845198631287,
        -0.04722670093178749,
        0.038399260491132736,
        -0.10476890951395035,
        0.0673765242099762,
        -0.05184406787157059,
        0.07691510766744614,
        -0.04400934278964996,
        0.014843476936221123,
        0.039742130786180496,
        -0.0510653518140316,
        0.06539789587259293,
        0.004644588567316532,
        -0.0033400272950530052,
        0.0014505551662296057,
        0.08981448411941528,
        -0.07618966698646545,
        -0.03398096561431885,
        -0.017250264063477516,
        -0.08494553714990616,
        -0.01466312725096941,
        0.01497084554284811,
        -0.02420875057578087,
        0.02807733416557312,
        0.004318833351135254,
        -0.038823097944259644,
        -0.01961720921099186,
        -0.04141760617494583,
        -0.05009786784648895,
        -0.03257974982261658,
        0.03875839710235596,
        0.05646869167685509,
        0.018053853884339333,
        -0.03736770153045654,
        -0.025867436081171036,
        -0.03233342617750168,
        -0.03876756876707077,
        -0.0022740750573575497,
        0.06145281717181206,
        -0.07789881527423859,
        0.004624845925718546,
        0.09666949510574341,
        -0.028346342965960503,
        0.06746894121170044,
        0.07779622822999954,
        -0.028679247945547104,
        0.028697216883301735,
        0.0023056447971612215,
        -0.010676772333681583,
        -0.0370822511613369,
        0.08976391702890396
    ]
}