{
    "id": "-LUt89E-OY0",
    "title": "RedMagic 5G Teardown! - How does the Cooling Fan work?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-05-12T13:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=-LUt89E-OY0",
    "category": "Howto & Style",
    "tags": [
        "RedMagic 5G",
        "Red magic 5g",
        "smartphone",
        "gaming phone",
        "best gaming phone",
        "coolest gaming phone",
        "cool smartphone",
        "smartphone cooling",
        "fastest smartphone",
        "cooling fan",
        "Red magic",
        "Nubia RedMagic",
        "blackshark",
        "razer"
    ],
    "views": 1753750,
    "likes": 57992,
    "comments_count": 3286,
    "description": "Not all gaming phones are created equal... especially on the inside. This Brand new RedMagic 5G gaming phone has a FAN inside. Making it one of the coolest looking phones weve taken apart in awhile. This little motorized hurricane sucks in air from one side to cool the processor (And other random mother board chips) And spits the hot air out the other side of the phone. Today we are going to take apart the Red Magic 5G and see what makes it work from the inside. We'll take a look at the Turbo Cooling fan inside of the Android smartphone, and see if the RedMagic 5g can withstand being taken apart and reassembled. And yes. The fan indeed sucks air in through one side and out the other.   RedMagic 5G Durability Test is HERE:",
    "description_links": [
        "https://youtu.be/SG85TQK8G74"
    ],
    "transcript": "The Nubia Red Magic 5G is one of the cheaper gaming phones on the market right now and also has a built in mechanical active cooling system. There is a literal fan inside of this phone...which I'm a fan of. Now normally I like to do my teardowns where the phone is turned off so nothing shorts out and the phone stays safe. But today we're going to do this operation live while the phone is awake so we can see that fan in action. So, without powering down, let's get started. [Intro] This phone is built in the same way as a lot of other glass backed phones. I use a bit of heat to soften the adhesive under the glass, and a thin pry tool or razor to cut through that adhesive...you know, being careful cuz you know, glass is glass, and glass can break. There is definitely no water resistance to this phone since it has giant fan grill openings on either side, but the adhesive underneath that glass is just as strong as it normally is. After carefully slicing through that last bit of glue, we get our first look at the internal cooling fan. As long as the screen stays unlocked, the fan stays on, in game mode at least. It looks like it pulls in air from the right side of the phone through this black channel and then pushed out the other side by the fan. The channel itself is made from metal, and could be also acting like a heat sink for whatever is below it, just like what we would see in a normal desktop computer. The fan itself is rather gutless, but I mean, it is the size of a large ant so my screwdriver poke isn't exactly an accurate assessment of it's power. Nubia does say this fan has a tested lifespan of 30,000 hours. That's a lot of gaming. Let's go deeper by removing these 14 Phillips head screws and popping off the top black panel so we can see the underside of the air channel. Below that black shield we can now more clearly see the fan and hear how it struggles when I cut off it's airflow. Most phones have passive cooling systems built in. You know, no moving parts, just copper plates and heat pipes and stuff. So this active cooling system with a fan is super unique. And if I position the phone just right it can blow all the little pieces of paper away, so it's definitely moving air at least. Now, thermal paste is connecting that metal portion of the air channel to what I assume is the processor for the Red Magic 5G. It's good to see that the channel is made from metal because metal conducts heat away much better than plastic would. There's some other pretty weird stuff in here, but first I need to turn the phone off and remove the long rear LED ribbon cable for the RGBs. The LEDs just shine into the white plastic for that glow effect. The rest of this phone is kind of an unorganized mess. The battery actually has two connectors. I assume one is to power the fan and the other's for the phone...but that's just a guess. I'll pop off the additional extension ribbons and the screen ribbon cable just like little Legos, then I can unplug the headphone jack and front-facing camera. This is an 8 megapixel little camera guy that can film in 1080p. Then there's this guy. Some of you young'uns might not remember, but this is a headphone jack. It can instantly play sound through wires that never need recharging. Pretty crazy, I know. There is one screw on the motherboard along with a few more signal wires. Then another little ribbon up top for the front firing earpiece speaker. Then the whole board can shift down and fold up out of the phone with one additional ribbon cable on the backside. And here's the motherboard. We've actually never seen anything quite like this with random splotches of copper tape all over the metal shields. I'll explain why this is weird in a second. The top of the three cameras is a 2 megapixel macro camera. The center unit is a 64 megapixel main camera, and the bottom is an 8 megapixel ultra-wide camera, none of which have optical image stabilization. Now, the interesting part about this copper tape thing is that it actually covers up little vents from the metal plates underneath. If I stab through the copper it shows the chips right below it. And even weirder is that this copper here at the bottom of the board, which presses right up against the metal air channel above it, is actually covering thermal foam. It goes circuit board, foam, then copper, then thermal paste, then aluminum, then air channel. It's quite a unique order of heat dissipating materials, but if it works, it works. The processor is on the other side of that complex cooling sandwich and it also has it's own copper sticker that touches a heat pipe that rests below the phone frame. So there's cooling all over the place...even if it is all over the place. Let's take apart the bottom of the phone before we try and remove that phone. Down here we have 8 more screws. Once the plastic's removed we can see a small circular rotating vibrator, along with the SIM card tray, and one screw that's holding everything down. Then the little SIM card and microphone board can come out at the same time with the USB-C charging port which is all by itself on it's own little ribbon. It's also got a rubber ring around the tip. But remember, with a fan inside of this phone, it's definitely the least water resistant device we've seen in a long time. And finally, the loudspeaker. No foam balls, but the speaker does have water-resistant mesh over the opening at the base of the phone. So it least some holes are protected. Now unfortunately the battery is very much glued into the phone body, which is disappointing. One big thing manufacturers can do to make their phones easier to repair and easier to recycle is adding battery pull tabs like we saw inside of the new iPhone SE. Permanent batteries are completely unnecessary. Bending the battery like you see here destroys it. Once those internal layers touch, it's curtains for the battery. If it doesn't explode immediately, the 4500 milliamp hour capacity will slowly start to expand over the next few months like a balloon, which also eventually kills the phone. You might be thinking, 'Well Jerry, just don't take out the battery then.' But for this phone and all phones, batteries don't last forever, just a few years. And this phone in particular requires the battery to be removed to access the screen ribbon cable. So for every single screen replacement, it'll require a new battery, which adds unnecessary cost...all of which could be avoided with the magic pull tabs. Now for the fan. Nubia says this guy has 30% more air volume increase over last year's Red Magic 3, and can spin at 15,000 RPMs. It's very securely adhered to the phone though it only comes out in pieces. Let's just say it'll be a miracle if this phone turns on again. There is no water-proofing mesh over the air vents which makes sense because that would restrict the air flow quite a lot, negating all the benefits. Overall, I'm still a fan of this fan inside of a phone concept. The phone is not very repairable though, so if that's important to you, I'd buy something else. It's definitely less complicated than the Black Shark 3 though. I'm not sure why all gaming phones have to by nightmares to take apart. Getting everything put back together again is easy enough...if you like 1,000 piece puzzles. I'll get the headphone jack and front-facing camera back into place, and then I can plug in the back glass panel LEDs and set the back metal air channel into place with it's 14 screws. And insanely enough the Red Magic 5G still works...even after all that. In a world where most phones are boring rectangles, I think Nubia deserves a thumbs up for making something new and interesting. And check that out, the fan is still spinning. Not too shabby. Do you think all phones should have built-in cooling fans? Let me know down in the comments. Hit that subscribe button if you haven't already. And come hang out with me in Instagram and Twitter. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "phone",
        "fan",
        "phones",
        "Red Magic",
        "air channel",
        "air",
        "channel",
        "glass",
        "metal",
        "cheaper gaming phones",
        "battery",
        "fan inside",
        "metal air channel",
        "cooling",
        "copper",
        "Magic",
        "ribbon",
        "heat",
        "camera",
        "Nubia Red Magic"
    ],
    "transcript_entity_values": [
        "1,000",
        "8 megapixel",
        "30%",
        "the air channel",
        "Red Magic 3",
        "8",
        "1080p",
        "just a few years",
        "Instagram",
        "two",
        "jack",
        "three",
        "4500 milliamp hour",
        "Jerry",
        "The Nubia Red Magic 5G",
        "Legos",
        "iPhone SE",
        "Phillips",
        "SIM",
        "30,000 hours",
        "last year's",
        "the Black Shark 3",
        "64",
        "first",
        "second",
        "today",
        "15,000",
        "One",
        "the next few months",
        "14",
        "one",
        "Twitter",
        "Nubia",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "LOC",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "LOC",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.052636709064245224,
        -0.009469067677855492,
        0.12756229937076569,
        -0.004397239536046982,
        0.017131876200437546,
        -0.12600652873516083,
        0.003521338803693652,
        -0.014815472066402435,
        -0.002359414706006646,
        0.02824041061103344,
        -0.014033596962690353,
        0.08576202392578125,
        0.0465162955224514,
        -0.08935339003801346,
        0.05243086442351341,
        0.021321551874279976,
        0.06720969080924988,
        -0.016797181218862534,
        -0.15782742202281952,
        -0.01902722753584385,
        0.046126920729875565,
        -0.01425969135016203,
        -0.10855049639940262,
        -0.019669976085424423,
        0.05553436651825905,
        0.006893851328641176,
        -0.025243286043405533,
        0.04171028733253479,
        -0.08347690850496292,
        -0.043351754546165466,
        0.016972223296761513,
        0.05882057547569275,
        -0.08387172967195511,
        0.028437597677111626,
        -0.0009871713118627667,
        2.0376890461193398e-05,
        -0.06737435609102249,
        -0.008179848082363605,
        -0.053767405450344086,
        -0.0091822799295187,
        -0.04878707602620125,
        -0.016116630285978317,
        0.068418949842453,
        0.08913727849721909,
        -0.0007077904301695526,
        0.08028353750705719,
        -0.006736396811902523,
        -0.012562400661408901,
        -0.003935822285711765,
        -0.05913257226347923,
        -0.006420144345611334,
        -0.0041841850616037846,
        0.01914597488939762,
        0.04029301181435585,
        -0.05220910161733627,
        0.09443669021129608,
        -0.0008646121714264154,
        -0.030607616528868675,
        0.00637886393815279,
        0.004697764292359352,
        0.08818662911653519,
        0.03371112421154976,
        -0.09321054071187973,
        -0.01080384012311697,
        0.018807705491781235,
        -0.026998868212103844,
        0.05258173123002052,
        -0.04792967811226845,
        0.04758644849061966,
        0.038638632744550705,
        0.06295204162597656,
        -0.05519174411892891,
        0.029008621349930763,
        -0.03177277371287346,
        -0.01582755334675312,
        0.036729585379362106,
        0.0034165161196142435,
        -0.0555596761405468,
        -0.0019124792888760567,
        0.018990905955433846,
        0.10408209264278412,
        -0.02714800462126732,
        0.06471164524555206,
        -0.044218868017196655,
        0.04610733687877655,
        -0.0342324934899807,
        0.07645178586244583,
        0.03549686074256897,
        -0.05080149322748184,
        -0.10106397420167923,
        0.018918592482805252,
        0.1889413446187973,
        -0.006821866147220135,
        0.03199511021375656,
        -0.001058644033037126,
        -0.014060299843549728,
        -0.15562842786312103,
        -0.03723836690187454,
        -0.023570599034428596,
        0.035449616611003876,
        0.06377648562192917,
        0.021323412656784058,
        0.08356514573097229,
        0.03870067745447159,
        -0.039384227246046066,
        -0.044196099042892456,
        -0.07930171489715576,
        -0.03396068140864372,
        -0.011570117436349392,
        -0.005558143835514784,
        -0.09834632277488708,
        0.006940588355064392,
        0.0003675009065773338,
        0.021165834739804268,
        0.0033425893634557724,
        0.015270705334842205,
        -0.03745102137327194,
        0.04546293243765831,
        -0.0008249954553321004,
        0.017563587054610252,
        -0.00020960168330930173,
        -0.01786012388765812,
        -0.04278559982776642,
        -0.049476753920316696,
        0.04912971332669258,
        -0.05989648029208183,
        -0.0891813263297081,
        4.0546106237722384e-33,
        0.014819486998021603,
        0.043489862233400345,
        0.011855727061629295,
        0.06801241636276245,
        -0.032717932015657425,
        0.022926194593310356,
        0.048375919461250305,
        -0.026546915993094444,
        0.028860459104180336,
        0.054950788617134094,
        0.07004085928201675,
        0.04219266027212143,
        -0.08475998789072037,
        0.023232929408550262,
        0.03189573436975479,
        -0.02121390961110592,
        -0.07761214673519135,
        -0.08113697916269302,
        -0.07442665845155716,
        0.01904626376926899,
        -0.027094559744000435,
        0.023063747212290764,
        -0.06744363158941269,
        0.007190693635493517,
        0.01709333062171936,
        0.0641925036907196,
        0.051297761499881744,
        -0.06936703622341156,
        0.002124083461239934,
        0.020211581140756607,
        -0.05304964631795883,
        -0.09861095994710922,
        -0.06361397355794907,
        0.07079247385263443,
        -0.061762452125549316,
        0.03317027911543846,
        -0.04410518333315849,
        -0.006926998496055603,
        0.030826207250356674,
        0.0009216917096637189,
        -0.03715836629271507,
        0.04563627392053604,
        -0.057859305292367935,
        0.08304094523191452,
        0.0028699676040560007,
        0.00961160846054554,
        -0.09112808108329773,
        -0.02697204425930977,
        -0.008110624738037586,
        -0.023558149114251137,
        0.047541067004203796,
        -0.02568059042096138,
        0.07091396301984787,
        0.04340643063187599,
        -0.04164136201143265,
        -0.0014906864380463958,
        0.046539194881916046,
        -0.009012351743876934,
        0.03739001229405403,
        0.03271917253732681,
        0.01591159962117672,
        0.0028886161744594574,
        -0.026567107066512108,
        0.008163503371179104,
        0.02141311764717102,
        0.0805525928735733,
        0.051380548626184464,
        0.0069372691214084625,
        -0.005937457550317049,
        -0.010788722895085812,
        0.016905630007386208,
        -0.004938630852848291,
        0.04701349884271622,
        -0.023018956184387207,
        0.0036884488072246313,
        -0.03742627799510956,
        0.020032459869980812,
        0.0020306783262640238,
        -0.13389533758163452,
        -0.09930308908224106,
        -0.002117957454174757,
        -0.03523571789264679,
        0.0170238446444273,
        0.001547420397400856,
        -0.024268748238682747,
        -0.059721626341342926,
        0.027316519990563393,
        -0.10187836736440659,
        -0.008665366098284721,
        0.011692303232848644,
        -0.0021970767993479967,
        -0.043107494711875916,
        0.015017740428447723,
        -0.009957941249012947,
        0.043039094656705856,
        -3.7323246029233226e-33,
        -0.03238803520798683,
        -0.07994125783443451,
        -0.006018137559294701,
        0.049098413437604904,
        -0.002162562683224678,
        -0.07976720482110977,
        0.057099949568510056,
        0.07272481173276901,
        -0.026875639334321022,
        -0.04819367080926895,
        -0.008075532503426075,
        0.04390711709856987,
        -0.025223100557923317,
        -0.009299720637500286,
        -0.006767059210687876,
        -0.06642482429742813,
        0.007192710414528847,
        -0.02258090302348137,
        -0.009862440638244152,
        0.036243170499801636,
        0.0470040999352932,
        0.04989222437143326,
        0.06444582343101501,
        0.08587167412042618,
        0.0012108336668461561,
        0.026419566944241524,
        -0.0043204850517213345,
        -0.029643340036273003,
        0.08754661679267883,
        -0.04567856341600418,
        0.020101742818951607,
        0.002832777099683881,
        0.05440697446465492,
        0.05634727701544762,
        0.062012650072574615,
        0.022067124024033546,
        0.024996696040034294,
        0.030072929337620735,
        -0.013380552642047405,
        -0.07444551587104797,
        0.05917833745479584,
        0.08827755600214005,
        0.040552083402872086,
        -0.045290589332580566,
        0.003548071486875415,
        -0.009987386874854565,
        0.017743155360221863,
        -0.03413883224129677,
        -0.00805946346372366,
        -0.08918670564889908,
        0.12902002036571503,
        -0.03985143452882767,
        -0.1009208932518959,
        0.028935717418789864,
        0.012418010272085667,
        -0.0068428972736001015,
        0.05385217070579529,
        -0.04978606477379799,
        -0.043736670166254044,
        -0.00024486175971105695,
        0.06702010333538055,
        -0.02639339491724968,
        -0.016833169385790825,
        0.0035397487226873636,
        -0.022890368476510048,
        0.03658406436443329,
        0.09601394087076187,
        0.025944935157895088,
        0.02957138605415821,
        0.06596578657627106,
        -0.05163407698273659,
        0.06498419493436813,
        -0.01575578935444355,
        -0.028183920308947563,
        0.05070161819458008,
        0.06763404607772827,
        -0.009634409099817276,
        0.02059468813240528,
        -0.014152822084724903,
        0.0349048487842083,
        -0.04995375871658325,
        0.004626587498933077,
        0.0034901632461696863,
        -0.022252842783927917,
        0.12754501402378082,
        -0.15193592011928558,
        0.015145859681069851,
        0.014216692186892033,
        -0.014838997274637222,
        -0.05598318204283714,
        -0.01643512211740017,
        -0.01609615609049797,
        0.05432180315256119,
        0.008375955745577812,
        -0.023369550704956055,
        -4.6373404671840035e-08,
        0.10811132937669754,
        -0.042620301246643066,
        0.01023827400058508,
        0.002686166437342763,
        -0.00587473576888442,
        -0.021060099825263023,
        0.03689761087298393,
        -0.07057516276836395,
        0.08078397810459137,
        0.010337421670556068,
        0.03531502187252045,
        -0.028266625478863716,
        -0.002453257329761982,
        0.04887884482741356,
        -0.028056276962161064,
        0.033243849873542786,
        -0.028556356206536293,
        0.056222036480903625,
        0.023298652842640877,
        0.06282939016819,
        -0.029138486832380295,
        0.048585984855890274,
        0.0015706989215686917,
        -0.02456788718700409,
        0.06629936397075653,
        0.10405375063419342,
        -0.042875729501247406,
        -0.06598097085952759,
        0.060424212366342545,
        0.014250178821384907,
        -0.017382189631462097,
        -0.010158552788197994,
        0.04114696383476257,
        -0.03038645349442959,
        -0.041956160217523575,
        0.0006833796505816281,
        0.06584973633289337,
        0.028749829158186913,
        0.052533090114593506,
        -0.08740564435720444,
        -0.040851421654224396,
        -0.06234902888536453,
        -0.015428200364112854,
        0.03481146693229675,
        0.013229954056441784,
        -0.18989168107509613,
        -0.008323061279952526,
        -0.126145601272583,
        0.009808409959077835,
        0.07005921751260757,
        -0.034287258982658386,
        0.01629558578133583,
        -0.059928204864263535,
        -0.06206536665558815,
        -0.024157684296369553,
        -0.07953327149152756,
        -0.025731470435857773,
        0.075143001973629,
        -0.014588600024580956,
        -0.009328477084636688,
        -0.01427424605935812,
        -0.016914060339331627,
        -0.023461688309907913,
        0.07785767316818237
    ]
}